{
  "title": "girls hostel EC campus (fresher)",
  "content": "so I'll be visiting the college for documents submission next week and im in need of hostel, is it possible for me to get a room ? also im not from karnataka- and i do not have a local guardian yet",
  "metadata": {
    "id": "1ldh2z0",
    "author": "DrawingLimp4287",
    "url": "https://www.reddit.com/r/PESU/comments/1ldh2z0/girls_hostel_ec_campus_fresher/",
    "permalink": "/r/PESU/comments/1ldh2z0/girls_hostel_ec_campus_fresher/",
    "score": 7,
    "upvote_ratio": 1.0,
    "created_utc": 1750145823.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "Exactly same situation, there is this living space in amaatra academy 5-6 kms away from the campus, I'll probably be living there.\n├── Me too. Did they assign you a room? And most importantly, did you like the hostel?\n│   └── Not yet, well the hostel is nice, but the rules, they're TERRIFYING, but then I got no choice.\n└── were you able to get in? also do you have a local guardian? pls lmk\n    └── I do have a lg but it is such a stupid rule that you need a lg to stay at a hostel. We talked there and they said all hostels at rr campus are filled, and ec campus hostels the rooms are filling fast. So we thought of going there around july 1 but now we are thinking to go within the next 2 days to get a room. We are arranging all the documents at the moment.\n        └── ill be visiting the college next week for the first time, will i be able to get the info regarding hostel and possibly get a room? im clueless about the admission process for hostel (ec campus)  and from what you're saying LG is mandatory, which means no seniors without an LG were able to get hostel? 🥲\n            └── Yes i think so, because it is clearly mentioned on the website that LG is mandatory. And you go on the pes website, hostel section and there the living space website link is available, so can see the details from there and you can also call there. And yes you can get the info in person too. Also lemme tell you the rules are atrocious (according to me, but maybe its just because I've never stayed in a hostel before), but since i have no other option, I'll have to get a room there.",
    "Pls let me know as well🙃\n└── i heard its not possible to get a room without local guardian, so ig PG is the only opt now - wbu?"
  ]
}