{
  "title": "Placemnt Query",
  "content": "Is it True that only 502 out of 1200(RR+EC) CSE got T1 offers? Will this number increase next year or decrease because of recession? Also is this number so less due to the recent hike of T1 bar(12 lakhs from 9 lakhs)?",
  "metadata": {
    "id": "134cswp",
    "author": "Basic_Ad_900",
    "url": "https://www.reddit.com/r/PESU/comments/134cswp/placemnt_query/",
    "permalink": "/r/PESU/comments/134cswp/placemnt_query/",
    "score": 16,
    "upvote_ratio": 1.0,
    "created_utc": 1682916182.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "502 also looks doubtful, I saw it close up and could notice how many companies just didn't visit for hiring. \nVery few number of large, reputed and respected multinational software development companies came which took 2-5 people, one or two took &gt;10.\n\n\nIt peaked in the first month(August) and by mid september the quality of companies coming in were not too great and tier really doesn't matter when companies are not known for good work culture or development related roles.\n\n\nPost September around 6-7 good companies came,a lot of them were performance based FTE conversion companies and that doesn't secure a full time offer hence no peace of mind.\n\n\nYes, increasing bar to 12 partly added to the burden as well but there was a significant slowdown in hiring events, American recession bloodbath heat was felt here as well\n├── This is what apparently jawahar sir said in his orientation(The 502 number)\n│   └── EC had 138 T1 offers in cse, and ec and rr were almost equal in hiring numbers,rr might have a few extra because of extra strength but 502 is a still far fetched number\n\n\nAnyways the numbers \"might\" be true but looks highly improbable tbh(market is in a brutal bloodbath, few European giants may hire and keep but others look doubtful)\n\n\nAll the best for your placements!\n└── True this is what happened. Fuck all this had to happen to our batch itself\n    └── Will it be even worse for our batch (2024) passout? Or is it expected to get better?\n\nReally scared atm\n        └── Its hard to tell. But one things for sure the recession isn't over in US and Europe.\n\nSo prepare yourself very very well.\n\nLand yourself a T-1 in Aug itself max to max September. Beyond that it becomes incredibly hard",
    "Don't know"
  ]
}