{
  "title": "Advice on time management",
  "content": "This 5 ISA system is wreaking me up. I have a lot of plans to learn new skills (CS as well as non-CS skills), I have bought many new courses to complete, but am finding absolutely 0 time for dedicating myself properly for self-improvement. I start up for about a week and then have to give up by the next week cause of ISA. This causes a break in my learning and I lose motivation to continue after ISA is over.\n\nAfter the coming of the 5 ISA system, how r u all managing time between academics and learning new skills? Can u suggest me some tips on how I can effectively manage time? Why isn't PES giving more free time to students unlike other colleges ?",
  "metadata": {
    "id": "13enfv6",
    "author": "[deleted]",
    "url": "https://www.reddit.com/r/PESU/comments/13enfv6/advice_on_time_management/",
    "permalink": "/r/PESU/comments/13enfv6/advice_on_time_management/",
    "score": 22,
    "upvote_ratio": 0.97,
    "created_utc": 1683811711.0,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false
  },
  "comments": [
    "yeah especially now this time, they’ve made each isa 10M instead of 7.5\n└── Wait what why?",
    "These ppl want good name for their college and at the same time want to make it stressful.",
    "This system was introduced to my juniors. I graduated last year and spoke to the VC about how the 5 ISA system is killing students, and they have 0 time for anything else. His response was that it's supposed to train us for the corporate world and teach us time management because our future companies will expect that. BS response.\n└── In case you meet him anytime soon, can you also tell him that there are students who are not job and placement oriented and would love it with the college wasn't so discriminatory towards us?\n    ├── I was not placement oriented.\n    │   └── Same here. But the 5 ISA system is heavily oriented towards them. No free time for me to do anything like research.\n    │       └── Tell me about it. Was burnt out throughout my last year and summer before 4th year cuz I was doing an internship (which I got thru the placement cell) and the department did not give me credit for that. \"Department Rules\" it seems. And also had to work on my capstone with a team that didn't do shit. \nIf they could care less about your mental well being, they would.\n    │           └── Damnnn, that’s rough. Things have gotten so bad that I have literally given up on trying in college. Also, what the heck is ‘Department Rules’? Now, I’m scared because I am doing an internship and I really want credits for it.\n    │               └── These are rules cooked up by the HoD of a certain department. DM me I'll tell you the dept lmaoooo. \nThey're fake rules and will change at the whims and fancies of this HoD.\n    └── They want people getting into \"dream\" and \"tier 1\" companies. That's how they get better placement statistics. I don't think they rly care and I honestly wish they did about inclusivity and a diverse (in terms of interest) student population.\n        └── Yeah, well, in most people join PES because of its placements. And the management knows that placements is the only factor driving them forward. So obviously, placement oriented changes in the way college runs.",
    "Give less importance to isas\n└── I did that last sem and my sgpa was fked up. So only alternative is to focus on it, but at the cost of learning new things kind of seems unfair to me.\n    └── It might help if you could do a lot of your studying in class itself. I don't mean you listen to class, i mean you should study at a much faster rate than the class. This shouldn't be much of a problem since they don't really do much\n\nThen you've got the rest to do whatever you want\n        └── This is like \"Ideal gas conditions\" for me :(",
    "\r  \nI understand your frustration with managing your time effectively, especially with the demands of the 5 ISA system. It can be challenging to balance academics and personal development. Here are a few tips that might help you navigate this situation:\n\nhttps://youtu.be/zgpOhEHLb-A"
  ]
}