{
  "title": "Programming Language choice for placements/internships/coding rounds",
  "content": "We are taught DSA and DAA in only C language throughout our 1st and 2nd year . Ive heard that learning an OOP is a must for placements and coding rounds so i learnt basic C++ . However while solving certain leetcode questions ive found that i can solve several string /array questions using Python instead of C or C++ very very easily and i think i could make it my main language for those coding rounds. I thought of mastering a language just for these interviews so which one do i choose?  \nAre we allowed to use python during placements/internship coding rounds /interviews ?   \nor which programming language should i master for my 3rd / final year?",
  "metadata": {
    "id": "13px5h9",
    "author": "Tiny-Mongoose-7727",
    "url": "https://www.reddit.com/r/PESU/comments/13px5h9/programming_language_choice_for/",
    "permalink": "/r/PESU/comments/13px5h9/programming_language_choice_for/",
    "score": 16,
    "upvote_ratio": 0.95,
    "created_utc": 1684867902.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "From my experience, I've never actually faced any language restriction during my placements except for *one* company that restricted to using one of C/C++/Java. However, I didn't choose the \"one language for all\" approach. \n\nFor questions based on arrays, strings, lists, stacks/queues, graphs etc where indexing is required to a great degree I used Python. I found it far more convenient compared to C/C++. I stuck to C for trees, heaps and tries only. This way I was able to use the language which was faster to implement certain tasks in.\n\nYou're not going to face a language barrier for &gt;96% of the companies that visit. Most of them will host their test on either HackerRank or HackerEarth and allow most mainstream languages, including Python. I'd suggest you to pick the language *based on the question and the degree of convenience it gives while solving that question*. Looks like you've already found which language helps you out in certain situations, you can stick to that and practice. However, I'd still recommend you to ensure that worst case you *can* solve the same problems using C/C++/Java for the fraction of the companies that don't allow Python.\n\nInstead of mastering a single language for all, my suggestion would be to master each concept using the best language suited for it, but also have a good backup if necessary.\n├── Alright thank you so much for the insight!\n└── Hey. I just have a doubt. Is competitive coding really needed? I actually don't plan on sitting for placements and I'm more into research, most definitely go for a PhD in the future. I'd rather work on projects in my domain of interest and do it. I'm just curious. How hard are the tests?\n    └── Well you still need to get an internship in your last semester. If you're planning an MS, or directly a PhD as well, you'll need some kind of work experience, atleast as an intern. If you are directly trying for a PhD, you'll need to show valid research experience. You won't be able to cover these aspects of your profile by just working on projects on your own. My suggestion to you would be to sit for placements and make sure you have some sort of company to fall back on. Give a few sample tests online and see how you fare. Based on that you'll get to know how much prep to put in. The tests usually aren't very tough, but do require some effort and prep. You can't expect to show up unprepared and get selected.\n        └── Yeah, I am doing internships. I am currently doing one right now too. I was just wondering how difficult they would be. Thanks a lot!",
    "For coding tests you can honestly use any language - it doesn't matter at all. There's probably a de-facto \"preferred language\" for your area of interest - C/C++ if you're into systems, C# if you do game/app dev, Python for DS etc etc. \n\nI think it's important to have atleast one general purpose language that you're comfortable with, and one of the preferred systems languages.My language of choice were Python and C (which is basically the stuff we learnt in college). While I never did any programming rounds in C/C++, I was at times asked to not use Python in my in-person interviews after providing a python solution. I'd recommend C++ over C though in hindsight. \n\nTldr - whatever you like to code in and C++.\n└── Thanks so much ill keep C++ in mind!"
  ]
}