{
  "title": "CGPA and SGPA calculator",
  "content": "I will pin the post, if anyone knows the complete formula, please comment it\n(i will try making it into a GSheet)",
  "metadata": {
    "id": "13wdtcl",
    "author": "ChromaticChaos",
    "url": "https://www.reddit.com/r/PESU/comments/13wdtcl/cgpa_and_sgpa_calculator/",
    "permalink": "/r/PESU/comments/13wdtcl/cgpa_and_sgpa_calculator/",
    "score": 17,
    "upvote_ratio": 0.96,
    "created_utc": 1685512464.0,
    "flair": "ANNOUNCEMENT :snoo:",
    "nsfw": false
  },
  "comments": [
    "Let me start from the beginning:\n\n## Credits\n\nTo obtain your degree, you need to gain a certain number of credits across the 4 years of study here. This number for my batch was 160 and ideally should remain the same for you as well. If you don't get 160 by the time graduation arrives, you simply won't be given your degree.These 160 credits are then distributed among courses. You would have noticed that some courses will have 5, 4 or 2 credits.\n\nEach course will have a certain credits required, which will be awarded once you pass the course. Which means as long as you get above an F grade, you will pass the course and get those credits at the end of that semester. You either pass and get the full number of credits in that course, or you fail and you get 0, there is no partial credit. Since there is no concept of \"failing a year\", you can essentially fail all your courses in a year and still move on to the next year, but you would not have earned any credits. Credits are essentially weights for a course that determine how important they are. For example, a 4 credit course will have 4 hours of classes in a week, a 2 credit course will have 2 hours of classes in a week and so on.\n\n## Mandatory and Optional coursework &amp; Internship credits\n\nSome courses are mandatory, meaning you will have to pass them and get those credits while some of them (electives and special topics) aren't. If you withdraw from a course you'll need to make up for credits. You cannot skip out on mandatory courses.\n\nCredits are also obtained via internships pursued at the end of 3rd year and in 8th semester. The details of how this conversion is made aren't relevant to your question so skipping it for now. Additionally, you can also take up some extra courses beyond the official curriculum to add credits. Note that there is no concept of early graduation at PES, so even if you finish BTech a year early they'll make you stay so there is no advantage from a time or financial point or view.\n\n## Calculating your GPA\n\nYour final marks for a course is a combination of ISA + ESA + assignments + project + etc combined in some weighted fashion. Now marks are mapped to Grades with 90+ being S, 80-89 being A, 70-79 being B and so on. Grades are then assigned numbers with S grade = 10, A = 9 and so on.\n\n## Relative Grading?\n\nNo, PESU does not follow any relative grading. There is a fixed formula used to calculate your GPAs. However, sometimes, when a batch performs poorly in a course they will shift the marks-to-grade mappings (so maybe instead of 90+ being an S they shift it to 85+). This isn't the accurate definition of *relative*, and additionally we do not know how they *determine the magnitude of the shift* so it's not a transparent process.\n\nSGPA is a weighted average of grades in a semester where the weights are the credits for that course. So,\n\n&gt;SGPA = sum(credits for course \\* grade obtained in course)/total credits in semester\n\nCGPA is again a weighted average of your SGPA, where the weights are the credits in that semester. So,\n\n&gt;CGPA = sum(credits in semester \\* SGPA in semester)/total credits across all semesters\n\n# How do I get a certain GPA/Grade?\n\nTo get an SGPA of 8, you need at least a 70 in all courses. So a little lower than that in every course will fetch you a 7.75. FYI an easy way to figure out how much you need to score is to know the average minimum marks needed for a particular GPA. Obviously, if you perform extremely well in one course, it will allow you to get slightly lower on another course.\n\n|SGPA|Required Grade in all Courses|Required Marks for Grade|\n|:-|:-|:-|\n|10|S|90+|\n|9|A|80-89|\n|8|B|70-79|\n\nand so on...\n\nYou can also use [this](https://docs.google.com/spreadsheets/d/1EUXscZPrBGKSxbk2howqwZGC96whG_ncXQL_2_3YLts/view) spreadsheet to calculate your GPA. Instructions are in the sheet. You will need to create a copy on your Google Drive from settings and then edit it.\n├── Thanks\n└── Could you elaborate on this please?\n\n&gt;Additionally, you can also take up some extra courses beyond the official curriculum to add credits.\n    └── Summer courses: these are special topics that are offered during the summer break. They're worth 2 credits each and you can take a max of 2. People usually take these to decrease the number of courses needed to be taken in the final year. Sometimes the department might also let you swap these credits for other special topics you have taken during the semester (T&amp;C apply).",
    "How do i convert cgpa or sgpa into percentage?",
    "[https://pesupedia.vercel.app/academics/gpa.html](https://pesupedia.vercel.app/academics/gpa.html)   you can calculate you sgpa here",
    "Below is our site for CGPA Calculator  \n[cgpa calculator](https://collegecgpacalculator.com/)",
    "Build a cgpa calculator which is simple and easy to use https://sgpa2cgpa.vercel.app check it out\n└── All you have to do is divide by 2 to get your cg",
    "How much extra 2 credit will help in cgpa?"
  ]
}