{
  "title": "General Discussion - PESU PROs and CONs",
  "content": "I have seen and received some feedback from redditors that \"PESU subreddit\" is a little \"Too Negative\" about PESU  \nAs an alumni, although i do agree on most of the cons people have listed out, there are multiple good things i have seen in PESU (especially as compared to other colleges)  \nAs i am out of touch with the current 5 ISAs BT and Club Culture in PES, can we turn the comment section of this post as a PROs + CONs of joining PES  \nMy request is for all alumni/peeps studying in PES to listing down both \"PROs\" and \"CONs\" about PESU (Both, not only 1)  \n\n\nThis post is going to be Pinned, the idea is to show both sides of PES to the world; to help people make an \"Informed Decision\" before joining PES  \n\n\nThank You to everyone who contributes &lt;3",
  "metadata": {
    "id": "13ygg68",
    "author": "ChromaticChaos",
    "url": "https://www.reddit.com/r/PESU/comments/13ygg68/general_discussion_pesu_pros_and_cons/",
    "permalink": "/r/PESU/comments/13ygg68/general_discussion_pesu_pros_and_cons/",
    "score": 58,
    "upvote_ratio": 0.99,
    "created_utc": 1685721157.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "**Pros**:\n\n1. **Great placements if you are in CSE** \\- major MNCs visit every year and the packages are great and increase every year. A good number of companies come for summer internships between 3rd and final year as well. But, placements have been poor for the current outgoing batch (2024). This is not just a PES-specific issue but because of the market. Most of the batch struggled to get placed until much later. Even now, there are probably unplaced students.\n2. **Updated syllabus** \\- the syllabi for all courses are more or less pretty up-to-date with recent advancements, but there are 2 sides to this. Most students from PES find themselves better equipped after getting placed than their colleagues those from other Bangalore colleges under VTU or other known ones like RV and BMS. Additionally, a lot of them (including me) have found a good overlap in what is followed in the industry and what is expected from students when it comes to projects and assignments, sometimes courses even going to the extent of having small-scale versions of applications that exist in the industry. The syllabus also tends to be very hands-on.\n3. **Great crowd** \\- the crowd here has always been top-notch, you will find really great people here who are competitive and will push you to do better. PES has always been known for this. There are a lot of people who will inspire you with their achievements. The seniors are great as well, [there is a discord server which contains over 3000+ members from all the recent PESU batches](https://discord.gg/pesu-discord-742797665301168220). This is probably PESU's saving grace. Students from PES have gone on to work at major MNCs like Apple, Google, Amazon, Cisco, etc and have even pursued MS from Unis like CMU, UCLA, UCSD, Stanford, UIUC etc abroad. The crowd at PES will always encourage you to do better.\n4. **Location** \\- kind of self-explanatory, being in Bangalore has its advantages by bringing in more opportunities. Additionally, if you live near any metro line you have connectivity as well (EC campus apparently will get connected soon too).\n5. **A lot of clubs and a lot of hackathons** \\- there is a hackathon happening every other week here, plus there is a large assortment of clubs to choose from: so you get enough opportunities to take part in events. While this might seem like a nice advantage, it comes with its own share of problems.\n6. **Scholarships** \\- there are many scholarships every semester for multiple ranges of performers, giving you a lot of opportunities to get some financial returns, including top performers in the entire batch, top performers per branch etc. Although you will be eligible for only one scholarship at a time, it's nice to have these options.\n7. **Alternative choices to hostel** \\- PES RR campus is surrounded by affordable PGs and apartments. If you don't like the hostel or were late to get a room, there are a lot of backup options at arm's length.\n\n**Cons**:\n\n1. **PESU's only reputation comes from CS** \\- the other branches are ignored and even the management does nothing to promote them. If you are in these other branches, you will miss out on a lot of the benefits PESU has.\n2. **Placement stats are skewed in favour of CS** \\- building on the first point, the advertised placement stats are always for CS. This is a misrepresentation because people from other branches do not get packages even half of what CS kids get.\n3. **The updated syllabus is superficial** \\- the syllabus although updated, is in name only. Most courses will dedicate only 10-20 slides of a PPT to the \"recent developments\", glancing over these topics. The expectation is on you to cover the knowledge gaps and equip yourself with the \"updated skills\" to survive in the industry. Most courses's syllabus is 75-80% still a little old, and is nowhere close to covering the amount to justify the syllabus being advertised as \"updated\". You will need to spend extensive time apart from the syllabus to make yourself qualified for a job, especially in the current competitive market.\n4. **Campus is tiny** \\- If you are a fan of large open spaces, this place believes in the opposite (at least for RR). It is like a concrete jungle with buildings all around and construction happening most of the time. EC campus on the other hand is beautiful but I am not sure what is the state of it currently. RR campus has great infrastructure.\n5. **Crowded and packed** \\- self-explanatory again, the sheer number of people makes it packed all the time, and competition for CS placements increases exponentially. Other things get affected as well such as chances for opportunities at clubs, etc.\n6. **Faculty is mediocre** \\- Biggest issue here, professors have been leaving left, right and centre. Issues such as dissatisfaction with the management, too much work etc. All the good profs have left long ago, leaving the bad ones. Profs who made the Uni what it is today, ones who headed research clubs etc have all ditched. The bad ones are leaving now too. Additionally, there are rumours of profs of axed branches (such as the old Civil branch, etc) are still being tied down to PES by the management. They are being trained in introductory courses of different branches so they are still useful (and the acute shortage of faculty). Here, you will find a single faculty member teaching a wide array of courses across different fields, even if they do not specialise in them.\n7. **Research output is abysmal** \\- A byproduct of the previous point, because the primary faculty heading these labs have left, a lot of premier research clubs have shut down. They are a mere shadow of themselves and they barely publish anything significant over the year (or actually do research for that matter). CDSAML has been a poor show for years, CCBD is dysfunctional and because of that it was merged with CDSAML, CORI was shut down this year and PCPR has basically disappeared. Most faculty in the college additionally are not interested in pursuing good research, with most of them looking forward to just publish some copy-paste/poor quality research in predatory journals and conferences just to add to their list. You will probably find \\~5 profs per department who are actually interested in research. Further, there is no encouragement or support from the department to amplify efforts, thus it is actually going to get much worse. If you are someone who is looking forward to get into academia, then this will severely hurt what you can achieve here.\n8. **Management is poor** \\- Even a rock is more intelligent sometimes. They take illogical decisions that do not make sense, screw around and experiment on batches and then pin the responsibility on you. The management is a mockery of what it should be. From placements to examination stuff, a lot of it needs improvement.\n9. **Stressful environment** \\- Mentioned multiple times here, the environment here is pretty academically rigorous. You have 2 tests and 1 sem exam for each course in a semester, and between those tests multiple labs, assignments, project(s) etc. It is hectic, and you might find yourself jumping from one deliverable to the other. There is a constant expectation to do well, since your CGPA can affect a lot of things ranging from choice of professors in higher sems, placements and even your chances of a good Uni for MS. However, as most would have also said, it is not that easy to perform here and the stereotype of college kids scoring in exams after studying overnight does not work here. You need to study regularly and perform consistently well to obtain a 9+ at the end of your 4 years here.  In some cases, it might feel like a school, sometimes worse. It is academically it is so rigorous that I currently feel my job functionality at my office is barely anything that I went through here.\n10. **Facilities are okay at best** \\- Infrastructure in the labs is okay at best. It is nothing world-class, it only gets the job done. You also need to jump through multiple hoops to gain permissions for things and is a cumbersome affair. Simple things such as the WiFi have multiple restrictions and you'll even ironically find unblocked porn sites but blocked educational videos on YouTube.\n11. **Fests are yet to return to their pre-COVID capacity** \\- they are around 80-90% back, but not all fests have returned yet. But this is pretty much a transient issue and should be resolved in a year or two. Fests apart from that aren't too many, however, so do not expect ground-breaking fests to happen every other month. They're great, but nothing extraordinary. This is subjective, so I am not going to comment more on this.\n12. **Club and Hackathon quality are severely diluted** \\- Having 15 clubs with quality events is way better than having 45 clubs in which most of them do not do anything. In fact, there are so many at this point that you would not recognise a few anymore. Clubs in CSE are also being run under some weird \"vertical\" concept, with less student management and more teacher involvement. This has been explained in detail before but the summary is that the old clubs that used to exist have mostly died because of the CSE management and been replaced by shoddy replacements (which have also died kekw). Hackathons happening every week do not make sense: the quality of projects being displayed has gone down drastically. People at these hackathons now build anything that was planned over a few days, instead of spending weeks/months like before to plan a good product (back when hackathons were at most twice a semester).\n13. **Insanely high fees** \\- this keeps increasing every year. It isn't really worth it if you are joining through management (which is 11 LPA now). KCET/PESSAT fee is a little high but is expected knowing them. Since this is again subjective, not commenting more.\n14. **Other** \\- strict attendance policy (**75%**, no exception), w**eird hostel rules**\n├── The best subredditor &lt;3\n├── Umm...Thats a lot of Cons XD\n│   └── First time on this subreddit?\n│       └── Haha no but looking at the sheer number of Cons ppl will run away without even reading all that...Plus many of this cons are true for other good clgs (especially the first 2 points )as well..also with the introduction of 3 isas I feel some of these cons will not be a issue for much longer.\n├── Would be great if someone would have written the same for bmsce\n├── Hey, I have put 3 choices for counselling, 1) aiml,ece and cs\n\nI'm interested in ece at RR campus, but I have put first preference as aiml, would I be able to select ece at counseling even if I get aiml ?\n│   ├── You can select during counseling\n│   │   └── Thanks mate alot\n│   └── Hows the ECE going brother?\n├── We need a updated one\n│   └── It is updated. I updated it a few months ago. If you'd like to add points, let me know and I'll update the comment\n│       └── Infrastructure has developed a lot in past few years\n│           └── By infra, I am referring to labs. Most students (event those passing out last year) have complained about the ineffective labs for most reasons. Unless that changes, the point is still correct.\n│               └── Yes labs are the same I was talking about the new gjb with all sports facilities\n├── woah\n└── pesu cse vs mit manipal cse purely on basis of placements?",
    "Pros:\n1.Good placements\n2.lots of Hackathons (one every week) \n3.updated curriculum (compared to other Karnataka colleges) \n4.Good amount of scholarships\n5.Larger alumni base compared to other colleges\n\nCons:\n1) Extreme workload ( lots of internals and assignments) \n2) Very few cultural events \n3) Attendance policy (pro or con depending on teacher) \n4) High fee if not through kcet\n5)Campus is overcrowded\n6) Teaching quality is low",
    "PROS  \n&gt;&gt;Guest talk  \n&gt;&gt;Hackathon  \n&gt;&gt;Campus infrastructure\n\n&gt;&gt;Scholarships\n\nCONS\n\nrules are made just to break. teachers don't care about students at all they upload notes or ppt a day before ISA if you guys ask if they make time table they will follow for 2 days max  \nTeaching: The majority of teachers there are not fit for teaching\n\nManagement: Management makes good decisions but implementation never happens according to management\n\nISA: the main exam consists of marks from internal as well as final exam faculty won't give marks fully although you have made a 100% attempt in doing your research paper or case study and ISA questions are different from what was there in the syllabus\n\nThe faculty are limited so even if we complain they will just warn them and the faculty won't change at all\n\nThey keep on trying trial and error methods of any implementation of rules  by using student life\n\neven for MBA, there are no good teachers most of them are just good at networking so management hires them because the college will gain fame  \nthe faculties themselves know that they don't serve any purpose for the university they are part of university because they know no school or clg will take hire them  \n\n\nALTHOUGH WHATEVER THE MANAGEMENT SAYS OR BRINGS RULES THE FACULTY WON'T CHANGE\n\nTHE INSIDE PES AND OUTSIDE IT IS DIFFERENT\n└── The faculty for BTECH is Strict? if yes how?\n    └── acc to you what is strict\n        └── 1. Targeting students\n2. Strict in academics\n3. Do they involve parents in every matter. like missing the classes etc.\n4. Mental harassing students.\n5. There has been an allegation that if a boy n girl talk, they suspend them or any other punishment is given, is that true?",
    "Bhai koi pes ke baare mein detail se bata skta h ? Admission mode, Total fees, attendance criteria, hostel mess",
    "CSE is the only course which gets all the attention than any course in pes, what about Biotech ? What are the pros and cons for Btech. Biotechnology Eng. ?",
    "Can someone tell me how it is for bsc psych hons?",
    "hello , please suggest me over , IT at RV vs CSE at PES vs CSE at MSRIT",
    "Hey I am fresher this year can I get the link of WhatsApp group of pes of freshers"
  ]
}