{
  "title": "PESU Discord",
  "content": "Hey there, Reddit fam! Guess what? I'm Han, the \"amazing\" creator of the PESU Discord. Brace yourselves because we are the coolest community ever for all you \"awesome\" people from PES University (or that's what we tell ourselves before we go to bed every night, crying). We've got over 2000 members, including graduates from the batch of 2021 and current first-year students. Yep, it's like a huge never-ending party in there!\n\n&amp;#x200B;\n\nIt's that time of the year again, folks! PESSAT season is upon us, and all you bright 12th graders who are considering PES University should ideally look away, but for some reason y'all are jumping with joy. Now, normally, you need a fancy Student Registration No. (SRN) to join our oh-so-exclusive Discord. But hey, I've made a \"special arrangement\" just for you guys. Aren't you lucky? Probably not cuz you're thinking of joining PESU.\n\n&amp;#x200B;\n\nPrepare yourselves for the experience of a lifetime. You can now connect with our current students, bombard them with endless questions, and get a teeny-tiny taste of what awaits you at PESU.\n\n&amp;#x200B;\n\nSo, don't even think about missing out on this golden opportunity! Join [PESU Discord](https://discord.gg/eZ3uFs2), where you'll be surrounded by fun and support from the coolest of the cool. Get ready for a supposedly \"great time,\" because apparently that's what we offer here. Make friends, learn about life at PESU, and brace yourself for the most unforgettable experience of your life. Can't wait to see you there... or maybe not.  But hopefully not.\n\n&amp;#x200B;\n\nLink to the server: [https://discord.gg/eZ3uFs2](https://discord.gg/eZ3uFs2)",
  "metadata": {
    "id": "142gani",
    "author": "[deleted]",
    "url": "https://www.reddit.com/r/PESU/comments/142gani/pesu_discord/",
    "permalink": "/r/PESU/comments/142gani/pesu_discord/",
    "score": 35,
    "upvote_ratio": 0.97,
    "created_utc": 1686058443.0,
    "flair": "ANNOUNCEMENT :snoo:",
    "nsfw": false
  },
  "comments": [
    "Why is bro scaring us\n└── ![gif](giphy|SzD4gF32YzTTUiINhn|downsized)\n\nImagine ( i know its not) its all an elaborate scheme to gatekeep aspirants from getting into pess and raising the competition\n    └── Greatest plot twist",
    "Hello Amazing Han",
    "Han :pepepray:",
    "HAN-JI  Already a part of this fam"
  ]
}