{
  "title": "Pessat counselling 1",
  "content": "Just in case you are intrestested",
  "metadata": {
    "id": "154iy0o",
    "author": "Broken_Broccoli5",
    "url": "https://i.redd.it/xwpsge0hd2db1.png",
    "permalink": "/r/PESU/comments/154iy0o/pessat_counselling_1/",
    "score": 26,
    "upvote_ratio": 1.0,
    "created_utc": 1689834473.0,
    "flair": "PESSAT",
    "nsfw": false
  },
  "comments": [
    "Damn dude opening rank 1 I remember last year topper of pessat got like rank 10 in jee adv",
    "How much rank is expected for 125 marks including negative",
    "will i get EEE for 6k rank? PESSAT 2024",
    "Pes ec campus cse worth it ??\n├── yup\n├── your pessat rank??\n│   └── 3.6k\n├── Totally. The placements office is the same for both and the teaching is good too\n│   └── Thank you.\nJust wanted to ask that being a north indian will I face any issues over there ?\n│       └── Getting adjusted to the food might be hard , other than that , no issues. There are a lot of North Indians in PES. More than actual Bangaloreans I'd say 😂\n└── Pessat ka exam though hota hain kya ?\n    └── Bhai 180 min mei 180 question hote hai.\nEasy - moderate hota hai.",
    "Can I get AIML or ECE in EC ? With 4500",
    "Will I get eee at rank of 61xx in second coounselling.\nI got mechanical in the first round but differred it\n└── i too have the same question, due to the increase in seats this year, do we have a chance of getting EEE? I got a rank 60XX rank.",
    "Will I get ece at RR CAMPUS at 280X rank in second round? I couldn't go for round one counseling due to some issues?\n└── you'll def get ece at rr campus .....well you might get cse at ec campus\n\neven I'm confused whether I'll get cse at ec campus or not ( pessat rank - 2313 )\n\nLet's hope for the best and all the best to you mate!\n    ├── Thanks mate for the relief, i believe you will get cse at ec campus easily, have trust also best of luck for ur college life:)\n    └── Give me some hope my man\n\nRank 32xx\n\nWill I get ECE in 2nd round RR\n        ├── last year ECE rr campus closing rank - 2977 ( round 1 )  &amp;  3693 ( round 2 )\n\nthis year ECE rr campus closing rank - 3486 ( round 1 )\n\n&amp;#x200B;\n\nimo you'll get ECE at rr campus\n        │   ├── Thanks brother\n        │   │   └── hope for the best mate ;)\n        │   └── Bhai can I get AIML(EC campus) in second round with rank 42xx?\n        │       └── maybe...can't be 100% sure...but you'll get ece at EC campus for sure!!!\n        └── well , i would suggest you to take cse at ec campus instead or ece at rr campus\n\n&amp;#x200B;\n\nyou're very close to cse ec campus round 1 cutoff",
    "1718 pe aiml mil jayegi 2nd round rr mei?\n└── Ha mostly mil jaayega",
    "hey guys i didnt sit in round 1 of counselling because i got 6k rank in comedk and thought that i would get any circuital branch in top 3 colleges atleast. but the cutoff turns out to be too high. i got a rank of 1.8k  in pessat and i am interested in circuital branches. Is ece or eee worth it from pes considering i didnt get any circuital branch in top 3 from comedk\n└── U will get cs in ec campus its good better than ece in others\n    └── i dont want cse. is ece good in rr campus&gt;?\n        └── you may get aiml at rr campus\n            └── 😮"
  ]
}