{
  "title": "BTech student from PES RR College, Karnataka jumps to death after being caught copying during exam",
  "content": "",
  "metadata": {
    "id": "154rmz8",
    "author": "OwnOne5032",
    "url": "https://indianexpress.com/article/cities/bangalore/caught-malpractice-first-year-btech-student-bengaluru-dies-suicide-8845628/",
    "permalink": "/r/PESU/comments/154rmz8/btech_student_from_pes_rr_college_karnataka_jumps/",
    "score": 29,
    "upvote_ratio": 0.84,
    "created_utc": 1689861375.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "even if he hadn’t taken the phone intentionally, he handled it really poorly. The moment he realised that he had the phone, he should’ve informed the invigilators. At the max if it was proved he was cheating, he would’ve had to write a back paper. Why jump off man. Seriously, no matter what anyone says to you, your life is worth too much to not just you, but people around you as well compared to one shitty booklet of paper.",
    "he wasn't copying. [see this post](https://www.instagram.com/p/Cu6Tdn0OqNN/?igshid=MzRlODBiNWFlZA==) for accurate info.\n├── Scary!\n\"It is better to die than do such things\" this is what they told to him as Aditya is believed to inform this to his mom before he took the harsh decision.\nThis college don't deserve to operate till the investigation is complete. The investigating Auth should seal the college to investigate issue with specific professor behaviour or college admin in general. Strict action needs to be taken against the college, whatsoever. \nStudents life matters\n│   └── By suggesting that the college should be sealed do you really think it's worth ruining and scaring the future of thousands of other students at the cost of one student? Cause this is not the other students' fault. Only the counsellors and the concerned authorities' job should be at stake.\n├── Obviously not handled well by pes, but i don't believe that he wasn't cheating. Everyone i know we got caught first told everyone that they took their phone by mistake. It's likely that the kid just lied to his mom.\n│   ├── &amp;#x200B;\n\nHe was academically really good.. and he was pretty good in coding.. so there is no chance that he would have intentionally taken his phone with him to copy.. He was accused of cheating in C-Programming exam..\n│   │   ├── Bro getting good grades doesn't mean you'll never cheat\n│   │   │   └── Bruh C programming had 80% programs.. what the heck will he copy?\n│   │   │       └── Ummm.... The programs?\n│   │   │           └── Well even if he had to copy programs, he would have to search them in about (70 slides \\* 5 units) and multiple notes to find them.. by tht time he would have been caught\n│   │   │               └── Bro, why are you coming up with such absurd ideas to defend him. Are you literally claiming that it's impossible to cheat in the programming exam?\n\n Let me ask you a simple question, why was the phone on him if not to cheat. Come up with one reason\n│   │   └── even if he hadn’t taken the phone intentionally, he handled it really poorly. The moment he realised that he had the phone, he should’ve informed the invigilators. At the max if it was proved he was cheating, he would’ve had to write a back paper. Why jump off man. Seriously, no matter what anyone says to you, your life is worth too much to not just you, but people around you as well compared to one shitty booklet of paper.\n│   └── so he cheated with his phone for 2.5 hours and didn't get caught? with 2 invigilators being present in the room  as well as 3-4 teachers coming during exam to check? \n\nwas he also in the movie 'now you see me' then?\n│       └── The Idea was to not get caught. He was successful, until he wasn't. \n\nBefore going in, they ask us to pull all our pockets inside out and tell us to check multiple times before the exam starts. Anything you take with you, you definitely know about it. \n\nI'm not disputing the bad conduct of the guys who caught him, all I'm saying is that it's very likely that the dude just lied to his mom.\n│           ├── Very well said. Happened with me too, I told them within first 10 minutes and everyone was chill....\n\nTeachers kind of know about students they teach. They have a very good idea about who all can, and who all cannot cheat in exams. Teachers are not dumbazz-es.\n│           │   └── It's just really funny the guys trying to just claim that his intention was not to copy. Another response was literally saying that it would be impossible for him to try and copy because he gets above average marks.\n│           └── there's no way you can use your phone for 2.5 hours (on and off) and not get caught. why are there CCTV cameras if they can't even do what they're supposed to. \n\ncheating or not, you still can't tell someone that they don't have a future and they should k*ll themselves\n│               └── So you're saying it's just impossible to cheat? If he was caught after only an hour would you say that it's impossible to not get caught for an hour. Im pretty sure you're smart enough to know how absolutely ridiculous your argument is, i don't even need to tell you\n\nSo now you're falling back on the other part which i never disagreed with. Just read my previous reply and tell me what you see. The only disagreement was whether or not he cheated, but you're trying to get me to defend their conduct. Really scummy way to have a discussion, please get better\n│                   └── I never said it's impossible to cheat. I said it's highly unlikely to not get caught, which is the problem on the invigilators' part. even if he was cheating, idk what the invigilators were even doing for so long. one more question that i have is if he successfully managed to cheat for 2.5 hours, why would he take out his phone (that's how they found out didn't they)? if you manage to hide a phone for 2.5 hours, what's another 30mins?  same goes with the other what-if-he-actually-forgot-to-take-it-out scenerio. \n\n&gt;but you're trying to get me to defend their conduct.\n\nwhere did I even say that you're defending them. you can't. because I didn't. I literally just repeated what you said in order to agree. way to turn things around and make the bad guy.\n│                       └── Okay, so let's say a career thief got caught while committing his 10th theft. Does that mean that the police were very incompetent before? Or does it mean that he didn't steal the other 9 times? I mean, after all one more theft should be nothing for him right? No, it just means that the circumstances were different and he was just unlucky. \n\nThe teacher just looked at the correct place at the correct time. \n\nYour reasoning just does not make any sense. \nIf he didn't commit suicide, i don't think many people would believe that he didn't cheat. I'm pretty sure it's the mentality that he's a victim and that victims can never do wrong is what's making people like you jump through hoops to defend him even when it's clear that he willingly took his phone in for an obvious reason\n│                           └── &gt;mentality that he's a victim\n\nso you're saying he's not a victim. lmao okay this conversation is done here. don't reply to this comment.\n│                               └── No you dimwit. If you read what i said and thought about what it meant, you'd get that what I was trying to say is that people only think he didn't cheat because of the escalation in the situation. If everything occurred normally after he got caught, I bet even you wouldn't believe that he wasn't cheating.\n\nIt's really amazing how you just quote three words and twist it into a narrative of your choice\n└── slide 6 has some misinfo. they were all there for a long time."
  ]
}