{
  "title": "Freshers",
  "content": "Does this college not know that freshers and ethnic day exists. Every other college is having and people are getting mad fomo. You seniors never hsd it as well eh??",
  "metadata": {
    "id": "16eu31z",
    "author": "Positive-Effect-1228",
    "url": "https://www.reddit.com/r/PESU/comments/16eu31z/freshers/",
    "permalink": "/r/PESU/comments/16eu31z/freshers/",
    "score": 35,
    "upvote_ratio": 0.81,
    "created_utc": 1694331523.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "Welcome to pes 🥶 . Soon you'll be getting an email from VC\n└── The one they consistently send every year without changing a word xD",
    "OP actually thinks the concept of college life exists here 💀",
    "Yeah we seniors know and it sucks. You'll have to wait all the way till Aatmatrisha to experience the closest thing to enjoyment in this campus\n├── And even atmatrisha is nothing special compared to other college fests\n└── Well guess what i am in the ec campus lmao....noice campus life\n    ├── I feel the same lol. What I've heard and what I'm feeling here is different.\n    └── Which section dawg ?",
    "Hehehe lmfao... How did u even have such expectations\n└── Pretty dumb of me lmao",
    "U'll soon get a mail saying 'Dear Parents, it's has come to our notice that 'Fresher's party' is being organised in some private places.....'\n\nWelcome to PES, Enjoy !!!",
    "Lol \nFirstly,welcome.\nYou will get a mail,rather your parents will get a mail this week,keep waiting 😎",
    "what?? seriously??\nall those rich kiddos populating the campus and still no fresher's?\n\nwe definitely had it better 😂😂",
    "welcome to PES ....",
    "We have joined a school not a college....",
    "Bro, welcome to PES",
    "Don't worry neither did MSRIT organize a fest in last 4 years. So 2019 batch has no idea of what a college fests look like.\n└── Damn thats sad....Why tho?",
    "Bro my college 'freshers day' is a mass ragging session 😂"
  ]
}