{
  "title": "Internship Confusion",
  "content": "Guys I have received a 2-3 month internship offer from a big company, somehow i have convinced them to make the starting date Jan 2024. But now the problem, currently i am in 5th sem December our ESA ends, Jan we have a 1 week holiday and 6th sem starts immediately. Now the options i have, \n\n1) Ditch the internship, the pay is really nice 60k per month approx. And attend 6th sem classes.\n\n2) Bunk class for 2 months, i dont know what will happen next.\n\nBTW the company told me ,i have to come everyday to the campus ( near Bellandur) . Remote wont work, like physically i have to go every day.\n\nSomeone had a same experience before, can some senior guide me and tell what should i do?? Whats the best for me? Will college provide some help.\n\nThanks in advance",
  "metadata": {
    "id": "16hh1ha",
    "author": "FickleAd4141",
    "url": "https://www.reddit.com/r/PESU/comments/16hh1ha/internship_confusion/",
    "permalink": "/r/PESU/comments/16hh1ha/internship_confusion/",
    "score": 21,
    "upvote_ratio": 1.0,
    "created_utc": 1694592220.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "&gt;Bunk class for 2 months, i dont know what will happen next.\n\nI am not sure how this is an option, given the fact that skipping 2 months of classes will absolutely take out your attendance. You will definitely not have enough attendance to give the ESAs and will essentially end up with multiple backlogs. Additionally, 6th sem is when your capstone starts and you will be required to work on that as well. College will not provide any help - no attendance will be reimbursed or anything. You will just end up with multiple backlogs, minimum progress on capstone and 0 credits from your internship, plus those multiple backlogs wont let you sit for placements until you clear them.\n\nAsk the company to move the internship to last week of May if possible. If not, ask for remote work. If neither works out, you IMO should skip out on the internship.\n├── Thanks 👍👍\n└── wont pes allow excuse for attendance for internships/research??\n    └── Nope, internships are only permitted during the summer breaks when there are no classes or your final semester."
  ]
}