{
  "title": "ECE Placements 2024 batch",
  "content": "From our branch (ECE) so far, barely anybody has been placed. All the companies that come, just shortlist CSE guys. Some of my seniors said ECE placements start when they fill in CSE guys. A lot of people around me are saying people in other colleges usually get placed within a month before college starts, irrespective of branch. But here, It's been around 3 months and I suppose not all CSE guys have been placed. Why are we not getting placed? Or am I just too early to ask this? Is there still time to get placed? There's a lot of pressure from my family and I'm daily getting asked \"Why are you not getting placed\"? Help pls :(",
  "metadata": {
    "id": "16r2h73",
    "author": "cap_spack_jarrow",
    "url": "https://www.reddit.com/r/PESU/comments/16r2h73/ece_placements_2024_batch/",
    "permalink": "/r/PESU/comments/16r2h73/ece_placements_2024_batch/",
    "score": 19,
    "upvote_ratio": 1.0,
    "created_utc": 1695574160.0,
    "flair": "Study Help :table:",
    "nsfw": false
  },
  "comments": [
    "Unfortunately, companies looking purely for core ECE grads only come in a little later, halfway through the placement season. So if you're looking to get into these companies, either apply off campus or wait it out a bit. \n\nIf you're referring to companies that visit now, then yes they do tend to pick CS grads over ECE grads. While not impossible, it's difficult because of a lot of factors from not being able to clear the coding rounds, not being prepared enough for interviews and sometimes even bias from the company towards CS. If you're targeting IT companies, then the only options you have are to skill up, prepare thoroughly for placements (including interviews) and build a strong profile. \n\nWhile I agree it's worrying, this is the usual trend every year. Believe in yourself, it will work out. Placements are long and draining but the relief at the end is worth it. My only suggestion would be to keep working on filling the gaps you see in yourself and also keep looking out for off campus opportunities.\n└── How do ECE guys get placed then since only a handful are core companies? Also, I don't want to join a core company since I don't have the necessary skills. I know programming (Python, Java) and some DSA concepts. What about tier-3 companies? Do we have a shot at that at least?\n    └── Well, you need to understand that a good number of ECE kids are people who are actually interested in CS but are in ECE because they did not get it. This is true in all colleges across the country. Thus a lot of ECE kids actually end up in IT companies. As I said before, it's difficult, but they do end up getting placed sooner or later, either through on campus or off campus placements. You will need to be really good at DSA and be very thorough with CS theory to stand a chance at getting selected though because you're essentially competing with hundreds of CS kids. Unless you put in extra effort, it does not work out easily. \n\nYou ideally have a shot at all companies, but due to slowed down hiring across all companies its become really difficult this year. Focus on filling the gaps. It will work out soon.\n        └── Thanks for the suggestions man!\n            └── did it worked?",
    "Can anyone share current situation of ECE placements?Whats the average?Are core companies visiting?"
  ]
}