{
  "title": "Try our college social app? 👉👈",
  "content": "Hello PES folks, we've been working on Sling -- a social + anonymous social media exclusive to colleges.\n\nAs the description suggests, there are two modes, 'Anon' and 'Public'.\n\nYou can choose your vibe: share your thoughts anonymously in 'Anon' mode or engage openly in 'Public' mode, and keep up with the latest happenings in your college.\n\nFolks are verified through their university email, making sure there are no imposters and keeping things genuine.\n\nHere is the link: [https://play.google.com/store/apps/details?id=com.slinglabs.sling](https://play.google.com/store/apps/details?id=com.slinglabs.sling)\n\nNote: Please use your university email to sign up, it grants unrestricted access!\n\nWe're just starting out, and would love any feedback or suggestions if you had any!",
  "metadata": {
    "id": "16xvkij",
    "author": "sling-social",
    "url": "https://www.reddit.com/r/PESU/comments/16xvkij/try_our_college_social_app/",
    "permalink": "/r/PESU/comments/16xvkij/try_our_college_social_app/",
    "score": 35,
    "upvote_ratio": 0.94,
    "created_utc": 1696250267.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "Looks like you need University emails to register. These weren't given out to *all* students before the outgoing 2024 batch, so I am unable to register :)\n└── Yep! The usage is pretty limited with gmail, the university email grants unrestricted access. \n\nSorry to hear that! : ( Hope you get one soon, and join us!\n    └── Ah I think you misunderstood. I'm a graduate. University email addresses weren't given out to all students until the pandemic started. So if you joined PES anytime before 2020, chances are you do not have one and have graduated without one.\n\nThat's why a lot of people won't really be able to access your platform because we don't have University emails\n        └── Oo that makes a lot of sense. Bummer!  \n\n\nBut thanks for the heads up! : )",
    "iOS app when?\n├── Really soon!\n\nIt is almost ready, we're just taking care of a few things and testing it a bit more. : )\n└── It’s out now: https://apps.apple.com/in/app/sling-a-college-social-app/id6475726880",
    "We already have our own discord channel for that with better authentication system and more features.\n└── Sure, but Discord accomplishes different things than what our platform aims to, and is not either/or to it. \n\nBut thank you for your feedback!"
  ]
}