{
  "title": "Fuck u pesu bots",
  "content": "There is one guy in pesu who stole my dosa. It was 70 bucks. Scam",
  "metadata": {
    "id": "171bsgd",
    "author": "Putrid_Abrocoma_1080",
    "url": "https://www.reddit.com/r/PESU/comments/171bsgd/fuck_u_pesu_bots/",
    "permalink": "/r/PESU/comments/171bsgd/fuck_u_pesu_bots/",
    "score": 89,
    "upvote_ratio": 0.91,
    "created_utc": 1696597436.0,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false
  },
  "comments": [
    "How tf you steal a whole ass dosa cone?\n├── Nah bro someone stole my sambar\n│   └── Ye this is a seriousness issue\n│       └── I thought it's only dosa I look again and my sambar is gone too\n│           └── Yes I think he called me a loafer but my name jatin and calling me a loafer is confusion becuz that is footwear\n│               └── Man having a name like jatin sucks\n│                   ├── Taton supermacy\n│                   └── How dare u insult jai shree ram gay shree ram\n│                       └── 💣💥\n└── My chutney as well\n    ├── Ok taking a mans chutney is going too far doredaddy needs to address this issue immediately\n    │   └── Who is dora reddy my anna is also reddy\n    └── Bro they stole my sandwich, there's a fat guy near the canteen area who does it\n        └── Why do these fat people exist\n            └── A fat fuck spilled sambar on me as I was leaving hostel....got me late for class and I had to pay ₹100 (amaatra to EC campus)\n                └── Yes even myself getting fat man who steal it",
    "Bro the canteen guy tried to scam me today , he was tryna give me a fake 10 rs  note in return. 💀\n\n&amp;#x200B;\n\nAlso there's this random ass nescafe coffee drink for like 45 bucks , that shit aint even worth it and doesn't even taste good 💀💀\n├── Ayy u got scammed by the canteen uncle too . He sucks man don't even get me started on the Nescafe shit it should be banned bro\n└── Wow very bad 1 rating",
    "Nah wth 💀\n└── Ikr how could they... what the helling",
    "literally every dish is 70 or 80 .. and sometimes they taste like shit\n└── But myself not getting taste also they steal before I tasting\n    ├── ![gif](giphy|OPU6wzx8JrHna)\n    ├── ![gif](giphy|OPU6wzx8JrHna)\n    └── ![gif](giphy|OPU6wzx8JrHna)",
    "most kids from pes act cringe someone had to say it.\n└── Yes u behaving bad",
    "I feel you man, sorry :(",
    "Lmao weird place to rant\n├── I would argue as the right place\n│   └── Prolly\n└── Where else wud I u fridge",
    "Jatin\n└── Taton op",
    "Idk why but I get this post recommended to me every week and I'm not even in PESU",
    "I think taton stole the dosa man to assert his dominance"
  ]
}