{
  "title": "Can I buy macbook m1 ??",
  "content": "I am a cse 1st year student here(Pes) and looking to buy a laptop under 75k, will I face difficulties with the clg work if I buy macbook m1(base model 8gb, 256gb )  as I'm getting it at a low price in BBD sales??",
  "metadata": {
    "id": "1721ntx",
    "author": "[deleted]",
    "url": "https://www.reddit.com/r/PESU/comments/1721ntx/can_i_buy_macbook_m1/",
    "permalink": "/r/PESU/comments/1721ntx/can_i_buy_macbook_m1/",
    "score": 17,
    "upvote_ratio": 0.79,
    "created_utc": 1696668973.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "M1 is overkill lmao. It will be more than enough (for cse at least).\n└── Do u use m1 ?\n    ├── Nope I got thru with a laptop that was 32k and outdated when I bought it. There is nothing you will be doing in cs that requires the power of an M1. \n\nThis isn't to say M1 is a bad laptop or anything. It's great but you can get away with something a lot cheaper. \n\nTLDR: If you want the M1 go for it. You don't need an M1\n    │   └── Thank u for the reply, but do clg required softwares be used in macbook?\n    │       └── Yes you'll be required to download a few things for some subjects. Most of these, if not all of them, are available for M1 Macs or have an equivalent. \n\nWorst case you can run a virtual machine.\n    └── I use.. feel free to ask anything\n        └── Tq for the reply,\nI'm really tensed will I face issues regarding using necessary softwares for the clg work\n            └── yes that will be an issue, some softwares run only on windows. but there is a fix for that, you can use parallel desktop (that is two OS on the same machine).",
    "More than enough",
    "For a student, unless you’re looking to game or perhaps do some serious video editing, M1 chip is MORE than enough.",
    "I got m1 two months ago and its been amazing for my work\n└── Ohk, are u fresher at PES ?\n    └── Nope 2023 passout and working\n        ├── Were u using the base model\n        │   └── 16Gb memory and 256 storage although my work does requires it even then 8gb ram should be fine\n        │       └── Do u use an external SSD, is using it a hectic time consuming task on daily basis?\n        │           └── No external SSD I'm fine with base, why would it be hectic 🫠\n        └── 2023 passout getting jobs 😲 (I'm 2023 passout lmao)\n            └── Try off campus I never was eligible for on campus dude",
    "Bro, it’s harder to install softwares without license in Mac, if you’re in college then just get a decent windows laptop and dual boot it with Linux and profit.\n└── For a cse student most of the applications would be open source. License wont be a problem for developers. Community support for mac is far ahead than Windows. License is a problem if you are content creator or other gui users. Also working with mac os gives a better understanding of unix based systems which is the primary environment to development in the industry. I would say mac is a great option for an cse student.\n    ├── I second that. Dual booting was a terrible experience with many windows laptop. There were few subjects that required Unix based system and eventually all of my roommates assignments I made on my Mac as dual booting was painful. Apart from that portability and battery life of Mac really stood out in classes where there were limited charging ports.\n    │   └── Also all softwares were provided by college or were open source.\n    └── This is what I did, even though multi-boot is a pain but it’s a good opportunity for a CSE student to learn more about Unix, Linux and low level details. I think starting in this part is a pain, but as you grow you master it and it becomes a trivial thing. \n\nHaving a windows gives more flexibility in terms of experience (using Linux systems like Ubuntu, Kali etc.. recalling these from my college days). Growing up, the focus is more on experimentation, fast execution of plans and fun as well (install cracked games on windows). \n\nNot all college provides the licenses, like you’ll need to worry about Microsoft office in Mac, not sure if there’s a free version of it in Mac. \n\nAs a beginner in CSE, I think it makes sense to go through some pain (reads as hard time understanding low level stuff to be able to perform some task without being a script kiddie) to understand about systems better.",
    "Mac user for 10+ years now, was using a MBA in college. You can only do ios, macos app development in a mac. The laptop will never crash or hang. I’m a professional mobile app developer now and absolutely no one around me uses a windows laptop. Take the leap, it’s going to be worth it. Don’t listen to the cheap arguments you always get what you pay for.\n└── You can android dev as well\n    └── I meant you cannot do ios dev on a windows. MacOS is a superior development environment.",
    "Bro buy the M2 MacBook air instead. That also comes for 70k\n├── Where flipkart selling it at 89k\n└── Not much difference between m1 and m2, and base m1 ssd speeds are way faster than m2 base",
    "MacBook Air m2 was at 73k till 9 am today. Should have gone for it\n└── What?! Really? I missed the purchase at 1 AM and the price had already shot up to 90k\n    └── Huh? It was around 86(without offer) when I commented that.",
    "Hey OP you will lose freedom cracked softwares is not an option in macbook so keep that in mind otherwise it's good and also it does not have any upgradable options\n├── oh is it, are u m1 user ?\n│   └── M2\n├── sab milega nmacs pe bhai, baaki virtualisation p chala lo\n└── this is only true for iphone, not for mac",
    "My friend got M2 at 77k this BBD sale",
    "Nah man mac has a lot of restrictions on what softwares you can install on them. Also you need to enable a lot of permissions to get your codes to read a file from your computer. Its a lot of hassle and tbh its not worth it. Choose a windows machine, you wouldn’t need to worry about softwares. Though m1 does have great battery life, i could go 2-3 days without needing to charge it\n└── Seeing this reply after ordering the m1 😢 ?Did u use m1 during ur UG ?\n    └── Yup, final year",
    "I’ve got a mbp m2 and I’m studying CSE… So, imo buying MacBook just for CSE isn’t that good. Like you’ll have to find workarounds for a lot of things. Some labs like MPCA, CNS, AC, etc don’t even have a workaround. So, buy a windows laptop with good battery. It’ll get you through college just fine.\n└── Oh really, will it be a serious issue ?\n    └── I’m using my old windows laptop for certain labs and stuff… So, yeah it’s pretty serious…",
    "As a general laptop, it's a great one to have. \nBut, since you are in college, the software you might have to work on might not be MacOS compatible and it will be a bitch to find a workaround for it. The Windows emulator or from a BootCamp will be ok, but it comes with its own set of challenges, around the compatibility and making the laptop slower on the Windows.\nIdeally, a Linux or Windows native laptop is good atleast till you finish your degree.\n\nCurrent Mac user, switched over because I couldn't be arsed to build a PC for my requirements. Used Windows through my UG in Bangalore, and saw some of my classmates face the Mac issue, and the professors wouldn't care. Biggest challenge was getting a cracked Matlab version at that point, and AFAIK, even now it runs on the Rosetta translation",
    "Buy Mac M2 will get in 85000 from Flipkart you just need ICICI credit card . Price is showing 95000 but with ICICI credit card you will get in 85 .so instead of Mac m1 go for M2 mimor differnce in rate",
    "The m2 is on sale right now for 90k. With further discounts you may get upto 80k try it\n└── Are u Mac user ?\n    └── I own a 2015 macbook air and i recently upgraded it to 1tb, if not I'd have bought the m2 air\n\n\nAs you can see, i still haven't made my mind to get another laptop even after 8years, you can only imagine the quality and reliability of this amazing device\n        └── Did u use it during ur UG?, also are u a cse student?\npls reply\n            └── Im a mechanical engineer, got it during my college days. Intel mac were only a fifth in performance compared to the m1 counterparts. M1 outright beats most the intels/amds in the market in terms of performance and efficiency\n                └── Ohk, Just wanted to know the cse clg required softwares will work on Macos or not,\n                    └── What softwares do you use? If they're strictly windows based, there is a workaround using parallels for using windows and Rosetta to emulate x86 apps\n\nMost apps are made for macs as its grown popular over the years. With the optimization and efficiency, its only gonna grt better over the years",
    "Dekh le budget hain to lele, otherwise its a good laptop and you won’t waste time finding power sockets everywhere you go atleast for 4 yrs of college and its lightweight too.\nMost of stuff works fine (90%). I have even boot up linux/freebsd on qemu and it works like butter\n└── Order kar Diya hein, regret to nhi hoga na clg mein pls  batao, are u using since 1st year cse ?\n    ├── arey virtualisation se kaam chal jayega dw too much\n\nvery good not only for college but also further down the line\n    └── Gaming etc to nhi krni na ? Otherwise all good\n        └── Gaming nhi krni",
    "M1 Macs are the best in case of everything other than software compatibility, I’m an electronics engineer and many software which is essential for me is not yet developed for new macbooks, because Apple silicon has a different architecture when compared to Intel.  Keep this in your mind  before buying. \n\nOther than that for personal use this is the best in the market.",
    "Bro, I graduated using a 31k HP laptop with 4gb RAM, Integrated graphicsand a crap processor.",
    "I am a second year student and use an M1 Macbook air, the base model of 8 256. \n\nYour biggest bottle neck will be storage. The RAM is manageable and enough on MacOS. If you're able to stretch your budget, get the 512 GB variant and not the 256 GB one.\n\nHere are my thoughts: \n\n1.  Most people install linux and a subject in the higher semesters afaik require you to be on linux. This isn't possible yet with the Apple Silicon Macbooks. Support is improving with the Asahi Linux Project but it's not perfect.\n2. You'd be better off getting a windows laptop. It's more freedom and you can install linux on it. Linux is an important part of having fun as a developer. \n3. The battery life on the Air is amazing. _amazing_ I can't emphasise that enough. This is one of the only pros I found on this laptop. \n4. You wouldn't be worried about the screen size a lot. It's actually an advantage if you have a smaller laptop. You'd be moving around a lot in college. Having a light bag is important, which leads me to my next point-\n5. Do not buy gaming laptops. They have terrible battery life and often come with compromises in build quality. Prefer having metal builds if your budget allows it. \n6. Do not go overboard on performance, balance other aspects like battery, screen, camera, evenly. Extra emphasis on battery. It's a hassle to be connected to the wall always. Anything with an intel i5 12th gen or above will be sufficient.\n7. Finally, try getting Intel EVO certified laptops. They offer great battery life and a superior experience generally. If I could go back in time when I was in my first year, I'd buy the [Acer Swift 3](https://www.amazon.in/Acer-Processor-Keyboard-Fingerprint-SF314-512/dp/B0B1F21WVP?th=1) (look for a better configuration if your budget allows for it, this is just a quick link I found on amazon)",
    "You wont use more than 50 percent of M1's power and moreover you'll end up watching YT or gaming in class so I'd say go to a gaming laptop with i7 , I used to use a Mac (old) in 1st sem and regret not gaming in it now I use an MSI and I just love it."
  ]
}