{
  "title": "Python mini project",
  "content": "I coded the most in the python mini project since I ended up with 3 other group mates who never studied python before and won't study later cause they are not from comp sci( they insisted they wanted to help too but i found it easier to do it alone since I already found plenty of references online to make my code work) what questions are the teachers going to ask when we show them the project are we supposed to divide the entire work between the 4 of us and explain the code or??",
  "metadata": {
    "id": "17uy1wl",
    "author": "Turbulent-Spinach360",
    "url": "https://www.reddit.com/r/PESU/comments/17uy1wl/python_mini_project/",
    "permalink": "/r/PESU/comments/17uy1wl/python_mini_project/",
    "score": 21,
    "upvote_ratio": 0.93,
    "created_utc": 1699951377.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "&gt;what questions are the teachers going to ask when we show them the project are we supposed to divide the entire work between the 4 of us and explain the code or??\n\nEveryone knows one person works and the credit is divided at the end, think of it as preparation for your work life.",
    "They will be asking any their individual contributions, they may ask them to explain the project\n└── will there be plagiarism checks?? i cant find free options online for a plagiarism check\n    └── Idts it will be there, we didn't have it last sem , but do be cautious\n        └── Can you recommend any free websites where you can get plagiarism check for free?",
    "Related Side Note:\nIt doesn't matter which branch you're in. If you don't know how to code, the organization will make you a subject matter expert to someone who knows how to code.",
    "the same happened to me as well last year and i finished the project all by myself. The teacher I had didn't ask any questions, but I did explain most of the major parts of the project. Just know what you have implemented thoroughly. Your grades will reflect what you know.",
    "Even my situation was same. Other 2 members were mechanical. One insisted he knows but he had not even installed python till the last day. One begged me to take him in team and said he will learn (he didn't). I just finished the project and answered any questions asked to me. I didn't bother defending them or answering questions for them. They ended up getting pretty bad grade in python and I got an S.\n└── oh  ok so whatever they respond won't affect your grade right?\n    └── Nope, the teacher can clearly figure out who knows and who doesn't\n        └── I know, what I mean is say I do the entire project and my teamates don't understand even after I break my head explaining them. So if they do not answer but I do, will it affect my grade too?\n            └── Nope.",
    "Whats your project about?\n└── I made a text based rpg game!\n    └── Dayummm that is imopressive dude\n\nI'd suggest that you teach atleast surface level knowledge about the project in all aspects to your teammates, atleast that way the HOD will not be able to fuck the whole team over completely\n        └── Mhmm I will try too!\n            └── all the best dude, lmk?",
    "One rule I heard from a senior is:   \nIf, in a project team your teammates are not doing any work, just warn them once or twice or thrice, If they still are reluctant to contribute, just do it yourself. Do not defend them or anything when teacher asks in the presentation demo. You do the project correctly :)) (Note: This may not be the case every time. So be cautious)"
  ]
}