{
  "title": "Connecting to Seniors",
  "content": "[SAve for Later , Useful but Long]\n\nI got a few responses from PES  students from mostly CS and some EC. It's 3 years since I graduated and I try my best to stay in touch cause I like that keeps me in touch with the community and on what all is happening in tech education as and this you shall know as current students (\"PES Students are equipped with almost all the resources directly or indirectly to compete to any school\").\n\nNow why I'm posting this is some students texted me to get some help on their capstone project and I love to do that as I'm doing a PhD so I love working with students into latest problems and tech. \n\nI was surpising to me when after like 1hr chat and a lot of resource sharing he said that he asked for help from many other seniors but non replied. I asked him how he approached them. And I would just like to text a few things, might he useful to more of you\n\n\nFor those looking for internship/project guidance/help with college stuff if any\n\n1. Sending a LinkedIn connect without a note isn't very effective. Trust me if you mention the problem you want solved the chances of them accepting doesn't go down actually it increases cause they might not know who you are so introduct and feel free to ask upfront that you are from PES and you need help with so and so.\nTrust me your seniors (almost all) are more than happy to help you.\nBut don't ask for our projects reports or something like that, ideally you shouldn't plus no one saves them.\n\n2. You can connect with anyone but prefer seniors who are at positions where they run teams or have the potential to hire. Management roles mostly.\n\n3. For students planning for MS, 50-60% of my batchmates are in US doing or finished with MS. Drop a message ask what all happen there or what do they look for, see if they got some scholarship and if so what they did or where they looked for. This is something my senior told me \"Don't try to reinvent the process, you aren't at the position to do so, learn form those who did it well and replicate till you are where you can make changes in process\"\n\n4. This is a bit particular, me (and hopefully others in research) are asked this often. \nMy councilor says getting a paper published will help me get admission/scholarship for MS. Technically in will but what I saw most (including non PES students) is you are trying to replicate the ways of some other paper by changing it to latest algorithm and showing ye we for 2% better result. That's not research, trust me I did that and got a IEEE \"paper\" but even for my PhD interview I didn't mention I wrote it cause they would have laughed at me. You can call it a semester report, even a course paper don't call it research you didn't being any new method  problem approach algorithm data formulation anything. You just applied someone else's algorithm to someone else's data for solving someone's else's problem without a new approach.\nGood research takes time, do it only if you want MS, atleast in India it's not the most helpful for getting non research jobs. \nUnless you are doing DScience Papers then you can seek a good business solve their problem using their data and that gets you on board, as that's basically what their engineers do anyway. \n\n\nPES as a brand will help a lot, specially in Bangalore. But if you want to use it full, use its network  I tried it does help.\n\nAll the best for whatever exam is next, there must be some😂.",
  "metadata": {
    "id": "18hjf87",
    "author": "Abhi_IIMI",
    "url": "https://www.reddit.com/r/PESU/comments/18hjf87/connecting_to_seniors/",
    "permalink": "/r/PESU/comments/18hjf87/connecting_to_seniors/",
    "score": 57,
    "upvote_ratio": 1.0,
    "created_utc": 1702481629.0,
    "flair": "Pride Of PESU",
    "nsfw": false
  },
  "comments": [
    "Very insightful, thanks for this!\n\nAs a recent graduate, these are some things which are very helpful\n└── Glad to be of use😇",
    "Thanks you for this post. Would like to connect with many seniors and juniors as well."
  ]
}