{
  "title": "Help me",
  "content": "Hi Seniors,\n\nI am getting continuously low grades, around 5.5 till my 5 semesters.\n\nPlease tell me what should I do so that I can appear in the campus interviews after 8th semester.\n\nRegards\n\nLowscoringboy",
  "metadata": {
    "id": "18v7ea8",
    "author": "lowscoringboy",
    "url": "https://www.reddit.com/r/PESU/comments/18v7ea8/help_me/",
    "permalink": "/r/PESU/comments/18v7ea8/help_me/",
    "score": 17,
    "upvote_ratio": 1.0,
    "created_utc": 1704027993.0,
    "flair": "Study Help :table:",
    "nsfw": false
  },
  "comments": [
    "Time to pull up your socks and put in the effort dude. There's no other way. This semester is your last shot at raising your GPA by massive margins. You barely have any credits in your final year, your GPA won't increase by much post this upcoming semester. \n\nFigure out why you haven't scored well and work on them. A 5.5 is pretty much an average effort at best. You're going to need to put in a lot more effort. Think of the remaining 3 semesters as your last shot at achieving something out of your degree. You don't want to waste the invested money. \n\nDiscuss with your friends, find out how you can do better and put in efforts from day 0. Consistency is key here. You may not have enough GPA to be eligible for placements, but you should try to put in your best every single day from now onwards.\n└── How much gpa is required for eligibility? And how much should the cgpa be to be eligible for all companies?\n    ├── For eligibility you need 6.75. However realisticially you need 7.5+ for 60% for the companies and 8.5+ for 95% of the companies.\n    ├── 6.75\n    └── To be eligible for placements, I think you need to have at least a 7 CGPA. As for being eligible for all companies, maybe a 9. The catch is that companies will allow you to sit for the aptitude test with maybe a 7.5 CGPA but while shortlisting they are free to choose only the 9+ CGPA kids. So if you want to be eligible for all tests **and** stand a chance to be shortlisted by every possible company, maintain a 9+.  \n\n\nBut practically, maintaining an 8.75+ is usually good enough for over 98% of companies.\n        └── Thanks for the reply. \nOne more thing that I want to ask is- for the placements, is the cgpa considered till the 6th or 7th sem by the companies or is it considered to be for the entire 4 years? Will the companies wait for the cgpa of the entire course of a student or will they check for 7 semesters if a students get placed in the 7th sem?\n            └── The most updated CGPA is used. If you're giving the placement tests in 7th sem, then upto 6th sem CGPA is considered. If you're giving it in the 8th sem, then upto 7th sem CGPA.",
    "Friends and seniors, I want to do better now, I am working hard for this semester, but I think, I may not reach upto 7.7 or 7 CGPA, and the worst part is, campus interviewer may not consider me if they will calculate 6 or 7 semesters average CGPA. What else I can do extra-ordinary from now onwards, Please suggest, I will try my best to do the same."
  ]
}