{
  "title": "Capstone",
  "content": "Seniors a quick question, just want to know how many people get S in capstone??\n\nLike overall i wanted to ask, is it really tough to get S for all 10 credits?? And what's the percentage of people getting S?? Also all 4 members get the same grade or different for everyone in the team?\n\nThank you it will be helpful, PS if its really tough i will start grinding hard from now (Currently in 6th sem), i want a S. ",
  "metadata": {
    "id": "1ait7ow",
    "author": "FickleAd4141",
    "url": "https://www.reddit.com/r/PESU/comments/1ait7ow/capstone/",
    "permalink": "/r/PESU/comments/1ait7ow/capstone/",
    "score": 21,
    "upvote_ratio": 0.97,
    "created_utc": 1707067675.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "Honestly the bar isn't that high to get an S in capstone. Most people end up getting an S grade. Given that they don't really expect (or care about) genuine novelty and in recent years there's a lot of copy-paste research being presented for capstone, in most cases you'll walk away with atleast an A grade unless you do something horribly wrong. Also since all they care is an acceptance from any scopus-indexed journal, it's pretty easy to publish any work in a low tier, predatory journal and get the S grade for publishing it. \n\nBut all team members are *not* guaranteed to get the same grade. Grading is based on how well each member presents during the capstone reviews. Low participation, inability to answer questions, etc will lead to lower grades. \n\nTLDR is don't sweat it, most people land an S grade with just the minimum amount of effort, which is pretty sad because the people who do actually put in genuine efforts to build novelties go unnoticed. But put in equal efforts in a team else you'll be penalised during reviews.\n└── Thanks a lot, this is really helpful!!! ",
    "Let me just provide you the numbers for 2024 batch:\n1. Phase-1(2 credits):\n    S - 628 people\n    A - 682\n    B - 56\n\n2. Phase-2(6 credits):\n    S - 772 people\n    A - 488 \n    B - 86\n\nYour grade depends a lot on your guide, so choose wisely and never get on their bad books (A guide tried her best to sabotage one my friends project and they ended up getting a C grade).\n├── On fucking god man.. had a shit team and an even shittier guide.. do not pick Ashwini if your in CS no matter what you do.\n│   └── What grade did you get?\n│       └── Got B D AND S(cause we published our paper in a reputed place), B during phase 1 cause like out of 4 peeps I was the only one who was working and for no team work she cut marks, phase 2 she never set any meeting nor agreed to any time which we/she set, so telling there was no progress she gave D, our panel felt sorry for us and made sure we didn't fail due to our final demo showcasing actual research work(o and for those who wanna know, I was the only peep working in phase 2 also)\n└── How did more people get an A than an S in phase 1? It's literally the easiest phase - all you need to do is read papers about your topic and present their findings. Even if you read at the slow pace of 2 papers a month, that's 8 papers per person in a sem = 32 papers for the team by final review. \n\nAnd all they ask is for ~10 recent papers on your topic, which is basically 1 paper per month xD\n    └── This is PESU, anything can happen.",
    "&gt;Like overall i wanted to ask, is it really tough to get S for all 10 credits?? And what's the percentage of people getting S?? Also all 4 members get the same grade or different for everyone in the team?\n\nThere's favoritism involved, mine gave me A but gave his favourite \"yes men\" S.\n\nThey had to work as unofficial TA for that, creating slides and all during their capstone, so yea. It depends completely on your guide.",
    "Best to approach \"good\" professors and start on building some research experience with them before itself. \nLoyalty points will help in the end."
  ]
}