{
  "title": "What is the minimum jee percentile needed for cse?",
  "content": "Basically what the title says.",
  "metadata": {
    "id": "1aqho59",
    "author": "[deleted]",
    "url": "https://www.reddit.com/r/PESU/comments/1aqho59/what_is_the_minimum_jee_percentile_needed_for_cse/",
    "permalink": "/r/PESU/comments/1aqho59/what_is_the_minimum_jee_percentile_needed_for_cse/",
    "score": 26,
    "upvote_ratio": 1.0,
    "created_utc": 1707897369.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "Just go to another college trust me\n├── Why?is it that bad?\n└── I got 94.74 ,what are my available options. Other pvt exams haven't been conducted yet but why not to consider pes ",
    "These 4 years are a golden period of your life, don't go to PES and waste it 💀",
    "Bruvv, now i am in 2nd sem and seniors were right all alongg, clubs are shit, crowd is crazzyy, not worth, i feel sad why’d i come. Go to bits and all wayyy better",
    "Ik a guy who got ece at rr for 95 percentile, so i’m assuming more than that",
    "Name your options ,choose PESU only if you have no better option.\n└── Brother  , can you tell priority order for this \n\nRVCE cse &gt;&gt; MIT Manipal CSE &gt; PESU CSE &gt; VIT CSE &gt; Ramiah CSE &gt; BMS CSE \n\nIs this correct ?\n    ├── Id acrually say RV PES around the same level for CSE (debateable tbh) &gt; VIT &gt; Manipal &gt; Ramiah&gt; BMS\n    ├── If you are getting in through kcet then I would place BMSCE above PES and VIT at the end\n    │   └── Ohh...thanks ....i m outside karnataka student so will give comedk \n\nAlso Is MIT Manipal CSE better than PESU CSE \n[ Fees not an issue ]\n    │       ├── Mit manipal cs&gt;pes I made a mistake not taking manipal don't do it, clg life ,clubs r much better there\n    │       │   └── Thanks brother\n    │       └── 4 years back I would say PES over MIT but now I’m inclined to say MIT\n    │           └── Ohh i see ....\n\nWhats the avg of PESU CSE ??\n    │               └── Don’t choose college on average, consider other aspects like name, alumni network, campus, batch strength, fees etc\n    ├── Um ig RIT CSE &gt; BMS CSE &gt; VIT CSE dont get me wrong here but VIT is messed up cuz of too much intake and competition i would tell to go with VIT CSE only if ur getting category 1 fees anything more than category 1 not worth imo\n    │   └── Lmao ramiah would be the last among all these\n    │       └── LMAO sad truth xD\n    └── W Order but bms equal to pes , then vit then ramiah\n        └── Msrit is much better than bms. Crowds better campus is better. Bms is overcrowded in a small campus.",
    "Don't. \n\nGo anywhere else.\n└── The Capacity in RVCE is 1500 The Capacity in BMSCE is 1800 The Capacity in PES(Main Campus) is 1620 The Capacity in PES(EC Campus) is 1080 Just the Thing is PES is Computer Science Centered College",
    "SEE I AM A KCET STUDENT AND A DAY SCHOLAR SO I PAY ONLY 1.2 LAKHS PER YEAR FROM READING THIS SUB REDDIT I SEE THAT MANY ARE FROM PESSAT AND  HAVE REGRETTED BY PAYING 4.6L PER YEAR PLUS SOME ARE PAYING PESSAT FEES + HOSTEL FEES SO IT WILL MAKE IT ABOUT 6L -6.5L SO OF COURSE THE FACILITIES IN PES ARE NOT FOR 6L PER YEAR BUT FOR A KCET STUDENT IT'S FINE.\n└── Meanwhile SC student paying 500 rs💀\n    ├── Bro they pay 500 to Kea Later to College they pay the rest\n    └── So they pay same as other KCET students.",
    "How Many ever People are there the Number of people in a Class is Going to be 60-70 Students",
    "The Capacity in RVCE is 1500 The Capacity in BMSCE is 1800 The Capacity in PES(Main Campus) is 1620 The Capacity in PES(EC Campus) is 1080 Just the Thing is PES is Computer Science Centered College\n└── In the above comment I am Mentioning Total Capacity",
    "In Colleges Like RV BMS MSRIT Instead of Keeping only CS Branch they have kept CS(Cyber Security),CS(Data Science) if you add CSE Branch and it's allied Branches then the Capacity in RV is around 700 Students The Capacity in BMSCE is around 1000 The Capacity in MSRIT is around 600 Students.",
    "The Capacity of CS and AIML together in PES(Main Campus)and PES (EC Campus) is around 1900"
  ]
}