{
  "title": "Is a college switch worth it from ec ece to rr ece?",
  "content": "I've heard that placements in both campuses happen together, but looking at the statistics, there is a huge difference mainly in the ece branch, not too much in the cs branch? Why is it like that?",
  "metadata": {
    "id": "1asv7pq",
    "author": "pokecuber-",
    "url": "https://www.reddit.com/r/PESU/comments/1asv7pq/is_a_college_switch_worth_it_from_ec_ece_to_rr_ece/",
    "permalink": "/r/PESU/comments/1asv7pq/is_a_college_switch_worth_it_from_ec_ece_to_rr_ece/",
    "score": 17,
    "upvote_ratio": 0.95,
    "created_utc": 1708150810.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "The statistics would be because the people who got in rr did better in 12th. And that would make them generally better in college. the college itself doesn't treat anyone differently, thoughrr people might have an advantage due to the peer group I'm not really sure\n\nIf you wish to change branch after first year, you'll probably get ECE with a cgpa above 7 or so\n└── Thank you for the help. I've noticed branch wise both campuses have quite similar placement statistics except ece where there's a huge difference. Is the crowd only worse here at ec ece? \n    └── I suppose that's the reason. But this year ECE stats themselves are quite low. Unless you're interested in ECE i think you should switch to cs\n Last year's branch change cutoffs\n\nRr cs 9.6\nRr ai 8.2\nEc cs 7.4\n This year there's ai at ec so expect it to be lower. \n\nStudy good in the first year and you can definitely get minimum cs in ec\n        └── Thank you",
    "I'd suggest you to stay in this campus regardless there are few disadvantages but teachers in ec campus are really excellent in teaching(though they're lil strict)\n├── Thank you for your advice, yeah I've noticed it's a quite studious environment and that's probably better.\n└── Do u mean teachers in rr are not as good as ec ones",
    "In short, the ECE department at ECC is the best.  \nChoosing between ECE campuses: Consider quality, not just quantity  \nWhile both campuses fall under the same placement umbrella, focusing solely on placement numbers isn't ideal. Don't choose solely based on placement numbers. Both campuses have the same placement rate because they recruit together. While RR campus has more placed students due to bigger size, the individual placement chance is the same.  \n\n\n  \nHere's why ECC's ECE department might still be worth considering:  \n1. Strong faculty: Especially in Communication, VLSI, and AI/ML.  \n2. Personalized attention: Smaller student body means more faculty interaction.  \n3. Modern campus: Spacious and well-equipped facilities with minimal construction disruptions.  \nSole disadvantage: Less active student community compared to RR campus. But various clubs, hackathons, and activities are gaining momentum  \n\n\nI hope it helps  \nPeace.\n└── Thank you so much for the help!, I think I've got my answers now.",
    "EC ece is much better especially in the VLSI domain, don't know about other domains. Frankly both of them are at the same level because PES is afterall a teaching institute not meant for any serious research.\n└── Thank you for your input. I'm sorry I'm unaware of this but what are domains, is it like a subject split or something?\n    └── VLSI is a subdomain while there are others such as Wireless networking &amp; Communication and Signal Processing.",
    "I would be VERY careful with Theoria Technical if you were thinking about that one. Very, very very few of their courses transferred to community colleges and none of them transferred to Universities. Their courses are accelerated, but they are nearly impossible to complete and pass. On average 30% fail rate for all courses offered. For example, the one I’m in right now, the professor makes spelling errors in most materials. And on the grade scale for each assignment, there are spelling errors. Yet, in the grading scale if you make more than two spelling or grammar errors, you are docked two points and that leaves you at a D grade. Communicating with the professor is impossible to get answers. She just redirect you to resources via links. Assignments are called by two or three different names in the syllabus and online - none of us know what is what. The last thing I will say is that they tell you that you don’t need the book in order to pass the class, however, every assignment needs you to reference the book — the book cost $180. Honestly, honestly, it’s a money grab. I think that the worst part of all is that the class you take doesn’t transfer to any school- it just works for licensing so that you can work in the job you are looking at.",
    "Minors is not offered in EC Campus, and Capstone projects are alloted to u guys at EC Campus. So, better to shift to RR campus, ECE, if you are really interested that is.",
    "Doesn't matter at the end both are tier 3 local clg only🥲😂\n└── Yeah but the difference is substantial in ece which is what I'm trying to understand.\n    └── Placement are together but if you get that campus you can take it. At the end of the day it depends on you. Opportunities provided are equal in placements.\n        └── Thank you for your advice",
    "[ Removed by Reddit ]"
  ]
}