{
  "title": "Future college goer:)",
  "content": "I am in class 12th right now, i am a cricketer who is planning on giving his everything in cricket and trying to make it big......I will be heavily occupied most of the time with matches and practice (have played quite a bit of cricket in the pes ground as well) heard the college is good, planning on taking mechanical engineering over there as my safety net.....I would want to know what the scene is for attendance and in terms of academic performance i will be giving it my all and scoring of marks will be pretty good along with project submission.....Only worry about the attendance here.....Is this college lenient for attendance even if i adhere to  my promise of doing academically good?",
  "metadata": {
    "id": "1azfi64",
    "author": "Ok-Independence-9649",
    "url": "https://www.reddit.com/r/PESU/comments/1azfi64/future_college_goer/",
    "permalink": "/r/PESU/comments/1azfi64/future_college_goer/",
    "score": 18,
    "upvote_ratio": 0.85,
    "created_utc": 1708836889.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "Lol they're not particulary lenient about attendance. There can be issues if you don't maintain 75%. They'll torment you until you produce a medical certificate.\n\nPES places a higher emphasis on academics compared to other colleges in Bangalore. Since academics isn't your first priority I wouldn't suggest this college. Especially not for engineerin. Even though you claim you can manage, it only gets harder in the higher semesters.\n└── What's the other colleges i could seek out then?\n    └── I have no idea, at r/Indian_Academia would be a better place to ask.\n        └── Here's a sneak peek of /r/Indian_Academia using the [top posts](https://np.reddit.com/r/Indian_Academia/top/?sort=top&amp;t=year) of the year!\n\n\\#1: [Want to continue my education but lost in the process, where to go?](https://np.reddit.com/r/Indian_Academia/comments/13kq5vj/want_to_continue_my_education_but_lost_in_the/)  \n\\#2: [Is Indian School of Business worth the fees it charges?](https://np.reddit.com/r/Indian_Academia/comments/11wbxsz/is_indian_school_of_business_worth_the_fees_it/)  \n\\#3: [In India which degree gives you high paying job?](https://np.reddit.com/r/Indian_Academia/comments/15cnab1/in_india_which_degree_gives_you_high_paying_job/)\n\n----\n^^I'm ^^a ^^bot, ^^beep ^^boop ^^| ^^Downvote ^^to ^^remove ^^| ^^[Contact](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| ^^[Info](https://np.reddit.com/r/sneakpeekbot/) ^^| ^^[Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/o8wk1r/blacklist_ix/) ^^| ^^[GitHub](https://github.com/ghnr/sneakpeekbot)",
    "As others have said - wrong Uni. This place focuses primarily on academics and is pretty rigorous when it comes to it. A 75% (for my batch it used to be 85% btw) is mandatory, failing which you won't be allowed to appear for exams. IMO if you're focusing on sports as your primary profession you should look at more relaxed Universities that support your passion.",
    "Attendance could be a problem if u don't maintain above 75%\n└── How big of a problem tho, the current school i am in (JHS) were pretty lenient with my attendance cause my need was legit......will a talk to the college regarding this work?\n    └── Regardless of your activities, you need to cross a 75% after accounting for all extra curricular activities as well. I know this because my friend was part of the state and University swim team. If you miss classes due to these activities you can redeem it back, but it still needs to cross 75% overall.",
    "Engineering is an academically rigorous course in PES. PES has a BBA in sports management which is more suited to your requirements I feel\n└── Second this, people barely manage to clear engineering here, pls don't join engg here, else drop your idea of cricket.\n    └── The thing is there are many exceptions of cricketers who got thought engineering and playing at the highest level, Anil kumble being the most prominent person that to graduating from rv college, shabhaz ahmed, ravichandran Ashwin and many more..... I feel like mechanical engineering is something I can do well in cause I have general interests in that area of science.... What are the other options of courses do you say i have?\n        └── PES is more strict and academically rigorous compared to the other VTU colleges in Bangalore. People find it tough to pursue their other co-curricular activities here. Things were different back in the day, the competition and difficulty level were a lot lesser back then. If you are still hell bent on joining PESU I would suggest only lesser rigorous courses like BBA or something.",
    "If you are looking for a college which supports you for your sports, i wouldn't recommend PES, PES is more academics oriented.\nYou might be able to talk to the HOD for any other department, but the mech HOD I'm not really sure.\nI would recommend any other college if your main focus is sports. BMS and RVCE are better options.\n└── Ohh rvse as well?? I heard from fellow redditors that it's hell there in terms of strictness.....In terms of rv i must say i am not that bright to get merit seat in colleges like rv lol\n    └── I'm not really sure about RVCE but I've heard its better for sports than PES atleast, PES they do an inter department challenge every year and that's about it, i don't hear much about anything else, but BMS is good for sports, if you get a seat into mechanical or electrical I'm sure you'll be able to focus on sports as well...\n        └── What other colleges do you suggest other than that? Is ramaiah good for me to concentrate in sports as well?",
    "Mechanical as a safety net? Dawg mechanical students are taking ECE and Cs minors as their safety net. That department is gonna cease to exist in a few years. EEE students have already taken over their floor and Biotechnology students took over their lab. Please reconsider to either EEE or BT",
    "PES will be the absolute worst choice. Go to a more general Indian University subreddit and ask for options. Maybe btechards? I'm not too sure. A quick Google for subreddits will give u good options.\n└── Tried in more general subreddits but not getting the response, is it possible for me to dm you on the college choices?\n    └── I’ve heard colleges like Jain has support for cricketers.\n        └── Which other colleges other than jain would you suggest? It is in the other end of bangalore from the clubs i play in\n            └── Dude you cannot have everything you wish for, you got to compromise a bit. Jaiswal sold pani puri to play cricket and here you are cribbing about travelling.\n                └── True true, but many of my friends circle are heavily advising me not to go to that college due to various reasons\n                    └── Look for colleges with a good cricket team, I’m pretty sure you’ll know them.\n                        └── Sure thanks a lot tho",
    "https://www.youtube.com/@Otaku-kf1ie \nSubscribe and Like this channel\nagar pasand aaya toh subscribe karna ",
    "Please me out y'all, an answer to this could help me out a lot",
    "What level of cricket do you play?",
    "Are you even interested in engineering? If your main focus is cricket why even choose it? You can choose other less demanding courses(considering humanities and commerce too) from other good Unis across India which give importance to sports  and support them",
    "Try asking in r/India or other popular ones there you will get more responses.\n└── Did try that but everytime got the post taken down idk for what reason, even messaged the moderators of the sub but they never replied, horrible subreddit with overcrowding tbh"
  ]
}