{
  "title": "Why is pes college life so looked down on?",
  "content": "Everyone I talked too say the same shit,\n\"packages are good but don't come here college life is ass\". \nWhy is it so bad?are students here not given free time at all?is all u do study?\nAlso is 1 month enough for pessat comp sci.",
  "metadata": {
    "id": "1b34mah",
    "author": "[deleted]",
    "url": "https://www.reddit.com/r/PESU/comments/1b34mah/why_is_pes_college_life_so_looked_down_on/",
    "permalink": "/r/PESU/comments/1b34mah/why_is_pes_college_life_so_looked_down_on/",
    "score": 34,
    "upvote_ratio": 0.96,
    "created_utc": 1709224514.0,
    "flair": "PESSAT",
    "nsfw": false
  },
  "comments": [
    "Everyone has different perspective. If you are able to manage your time for everything , then college will be peace. \n\nFree time? \n\nOnce you are in college , you no more have free time like you used to do during school. \n\nwe do everything except study and when exams are nearing we study ;)",
    "Well the college has a strict attendance criteria, holidays are rare, the break after 2 sems is 2 months, which is usually not spent enjoying college life.\n\nOther than that they keep experimenting with exams. Once we had 5 internals, so we had tests every alternate week.\n\nAnd as for the projects, you'll most likely complete them at the end of sem, and the submission for all the projects, lab works and other such things is together in a single week, so that gets stressful too.\n└── Wym by not spent enjoying college life\n    └── All the hostel people go home, ie not in city.\n\nMoreover you enjoy young adult life if you plan a vacation, not the college life.",
    "It's not just PES the same people who say PES college life is bad will say the same for any other college.\n\nYou have to go only 5 days a week, 3 days of half day on top of that... Teachers are friendly(some aren't). Events happen regularly. The Dean is great...\n\nThere are some things that the college expects as well... That is good grades and attendance... I get it you don't wanna attend classes cuz it's boring... But in the end that's a problem everywhere... If you really don't want hassle for attendance just go to bits\n└── Chumma dean is great. VK is terrible for event approval.\n    └── He wants things to be done right so that he doesn't have work overload... Sounds like a skill issue from your side.",
    "You get Saturday holiday\n\nThat's like a huge benefit already\n\nAnd a lot of regular hackathons\n\nIt's just human trait to hate lol\n\n\nTho I don't like their class timings some time\n└── Timings are ass. 8:45 to 4:45 is honestly killing me, by the time I get back I'm too exhausted to do anything else.\n    └── It's only full day two times a week right?\n\nAnd i always bunk those last two because it's 75% now\n        └── What I mean is that living far away can be a hassle with these timings I've also been bunking since the moment they announced they were reducing it to 75% lol who even wants to attend that shit\n            └── I know right it's so hard to sit through these shitty\"lectures\". \nIf they were actually any good they wouldn't have to force people to attend. Yeah with the new timings I suppose i have it better better since I'm in hostel.\n                └── I just give up and sleep in some classes.",
    "It's changed a lot now tbf. They've given us like 3 half days a week now and no classes during isas as well. It feels like night and day almost",
    "Brothers I am going to study law from here. Is it good?\n└── everything is good except cse"
  ]
}