{
  "title": "Am I fucked lol",
  "content": "Seniors of PESU.\nI'm enrolled in ECE and am in sixth sem right now.\nMy CGPA is around 6.9 as of now, with no backlogs till now.\nAm I fucked for placements and /or do I have hope in the final year\n\nAlso helps if any of you were in this gpa category and how are you doing now lmao ",
  "metadata": {
    "id": "1b3j6a0",
    "author": "techgeek1216",
    "url": "https://www.reddit.com/r/PESU/comments/1b3j6a0/am_i_fucked_lol/",
    "permalink": "/r/PESU/comments/1b3j6a0/am_i_fucked_lol/",
    "score": 21,
    "upvote_ratio": 1.0,
    "created_utc": 1709260637.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "I am ex PES student, work hard and try to move that percentage to atleast 75 from now on (IDK if it's possible since lower semesters have least number of credits the weitage and importance of lower semesters may reduce in overall percentage). Having said that, During placements some company need you to have bare minimum of 75 percentage, if you are lucky they will allow 70% students also, forget placement even if you go out without placements you should have somewhat respectable percentage or else you will have probelm finding jobs. Competition is so much right now in the market, this is true atleast for people who are just starting the career, later your skill and experience matter.\n└── Wow thanks for the heads up! \n\nIs it possible to take a lot of smaller credit courses to improve my Gpa?\n    ├── Your GPA is counted only until 6th semester for placements. So if there's anything you can finish before 6th sem then it'll count.\n    │   └── Can I do it in 6th sem summer ....will the placements be after the summer or during 6 th sem only\n    │       └── Placements is during and after summer. Most are after summer. However your summer grades don't come until a lot later in the year. Don't rely on summer credit grades to boost your cgpa.\n    │           └── shit....i started 5 th sem and i have gpa of 6.75......am i in worst situtation,(no backlogs)\n    │               └── It's not a good situation nor is it horrible one. (Assuming you're in CS)\n\nFocus on 2 things for 5th and 6th semester. \n\n- Study hard for good marks. You still have plenty of time to go to 7+ by end of 6th sem. Try your best to have interest in the subjects. Most of them are very realistic and not a waste of time. \n\n- Make your resume look appealing. Go to hackathons/ volenteer at events. Make a side project that you are proud of. Put yourself in the shoes of a recruiter and think what else you need. Don't try to achieve everything. Just make sure to slowly improve day to day. \n\nDM if u want to know anything else. Keep in mind I am from 2024 batch so I'm not very upto date.\n    └── Sadly no",
    "I was from a core branch.\nSo my opinion cud differ from others.\nHave seen worser GPAs than this in my life. But trust me, if you are confident, and prepare well enuf, or even just enuf to crack an interview of a specific company. U r good to go.\nI had a gpa of 3.9 in my first sem.. 4 pointer in 3rd sem. \nAnd at your stage, after end of 6th sem, if am not wrong, i was just under 6 .5cgpa. With one pending backlog. \nI thought its all fucked up now, since i still had a pending backlog coming into rhe final year. \nAnd i couldn't attend most of the interviews since i cudnt even clear the criteria of gpa.\nBut i had confidence in myself.\nAnd finally i cleared my back during 7th sem exams. And i could clear the interview within the second company i sat for \n\nDuring my 7th sem, when i still had that backlog i attended an interview for one of the big 4 consultancy. And i cleared 2 rounds and got eliminated in the final round.\nIf not for my weak resume,  i reckon i could have got placed in that company itself. nevertheless, i got placed in a pretty gud company, and especially with the academic record i had, i was more than satisfied with what i got.\n\nWhat I'm saying is that, if you have a low GPA it'll definitely affect ur placement opportunities, but only for the top companies or i can say 10-20% of the companies. \nIf you've maintained a gpa above 7, ur good to go... For 80% of the companies.\nAnd if you could back yourself with a strong resume and actual skills, with a confident attitude and a bit of luck going ur side.There's no one stopping u from getting placed.\n\nBcz if i got placed , anybody can get placed. Didnt have a strong resume, neither top notch english skills, nor a good academic record.\n\nBut but but, give ur best shot for ur oncampus placements. Bcz once i get out, for the offcampus, its extremely competitive and not at all ez to get placed without actual talent.\n└── Just curious, which branch?\n    └── Mech",
    "Get it to 7.5 bro it will be great then",
    "I’m not from PESU, but I feel like the placement opportunities and requirements are almost the same. I have a % above 75 and my roommate’s is like under 65, because of this he didn’t receive emails about most of the companies. So, give your best to go above 70-65%",
    "Start preparing for MBA.\n└── Even in MBA during placements companies ask for 70 percentage minimum in under graduation level.\n    └── I myself have 67% as an ece grad (7.5 in vtu scale after conversion) and have good calls from tier 1.5 colleges, in fact I could’ve gotten IIMs but I messed up CaT. Please don’t spread misinformation. And as far as placements post mba are concerned, OP can garner some workex and make up for his so called bad GPA\n        └── I am not saying it's not possible, i am saying when he is starting his career he may find it little hard, I know at the end experience matter the most. Btw college's use software like superset during placement which will automatically eliminate you if you don't meet minimum requirement.",
    "I’m not from pesu but I also had very low Cgpa. Worked hard in 7th and 8th sem and increased it to 7s range. I got the highest placement and they never even once noticed my GPA lol. Please focus on learning skills required by the industry and hit topics",
    "Yes",
    "I’m not sure if you’d get core jobs, but you’d be able to get IT/CS jobs for sure, but I wouldn’t expect the pay to be great."
  ]
}