{
  "title": "Life is messed up 😞😞😞",
  "content": "Last year I passed my 12th with 90 percent (nothing great just common things)  used to travel daily for 3 hrs ( in total) for coaching n college from home. Always used to be tired n messed up the 2 years badly, with a hope that I couldnt Crack comeptative exams like jee, kcet due to lack of time, I took a year drop. One of the worst decision I feel but this might change in the next couple off months... I messed up this year also with a lot off health issues n upon that  over thinking, tension..\n\nPlease give me a proper review of pes I really want to work hard in engineering n prove myself n everyone around me, ig mostly I won't join via kcet n I might join with pessat only ( it's a hope).\n\n&amp;#x200B;\n\nIf possible can u give me a comparison between msrit n pes.\n\nPlease give some tricks to Crack pessat ( like which day to attend exam, comparatively which shit would be easier n all)\n\nIf you have any contacts to get me a seat in pes please please text me. I would be really happy",
  "metadata": {
    "id": "1belvw8",
    "author": "Repulsive-Bar8298",
    "url": "https://www.reddit.com/r/PESU/comments/1belvw8/life_is_messed_up/",
    "permalink": "/r/PESU/comments/1belvw8/life_is_messed_up/",
    "score": 37,
    "upvote_ratio": 0.85,
    "created_utc": 1710424913.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "&gt;If possible can u give me a comparison between msrit n pes.\n\nThis [comment ](https://www.reddit.com/r/PESU/comments/13ygg68/comment/jmmro6e)highlights a review about PES. You will need to ask someone from MSRIT for an accurate review.\n\n&gt;Please give some tricks to Crack pessat ( like which day to attend exam, comparatively which shit would be easier n all)\n\nIts KCET level, or a bit higher. Ideally, does not require additional prep. As for which shift and other hacks, there is no way to predict. Its best to focus on the exam and prepare rather than focusing on the hacks.\n\n&gt;If you have any contacts to get me a seat in pes please please text me. I would be really happy\n\nI would not recommend joining via management quota. Its too expensive and does not justify the fees you pay. There are multiple posts on this subreddit that highlight why, just search and you will find.\n└── The seats have doubled with total intake being 2200 for Cse +cse (AIML)do you think the college will make efforts to place those many students?? Or it will. Be like VIT SRM\n    └── &gt;do you think the college will make efforts to place those many students\n\nThe very first thing that should be clear is that the college *does not owe you* a job at the end of your 4 years. They will try to bring in companies as they usually do, but the companies that actually visit and the number of students selected are completely up to the company and the job market at that time. Placement season is usually very competitive and with each company taking in a handful at most, it can get very stressful. Every year, it gets exponentially tougher and the number of unplaced students will also increase. This is true at every college, not just PES.\n        └── So then even after spending 20 lakhs we cannot expect even a job.Then it is useless.\n            └── No University in this country will owe you a job at the end of your degree. It's up to you to build your skill set and profile and be industry ready. The University is just a platform to bring opportunities to you. You need to make the most of what's given. You'll be in college soon - you'll realise spoon enough that in life nothing is spoon fed to you. A 100% placement rate is at best, falsified data, atleast in the current job market and competitive situation.\n                └── Then it useless to spend 25 lakhs on this clg if cannot return even a single penny back.There is difference between t-3 and t-1 iit cse\n                    └── I'm not saying there is no difference between T3 and T1 colleges. There is a huge difference. Please read my comment again. The number and quality of opportunities are obviously far better at IIT/NIT/BITS/NIT.  Nobidy is denying that. \n\nBut the harsh truth is, regardless of which college you're in, *you* will need to put in the effort to get placed and have skills that the industry needs. No company will just pick you up looking at your college. Look at placement stats at most top colleges this year and see the number of unplaced students - even IITs this year have unplaced students still looking for jobs. At the end of the day, if you aren't industry-ready, nobody will recruit you. It's upto you if you want to live in a bubble that a BTech automatically guarantees you a job.\n                        └── Many companies like tower research allow only top iit cs students.I think pes has more unplaced students.About 300 students were not eligible for placement and another 200 did not get placed.This is extremely bothering.Also in iits you would pay about 11lakhs including all fees.For pesu it is 25 lakhs.Top IIT has tag pes does not. Please answer these question\n                            └── Again, you're raising points which I never argued with. Not sure what you're trying to prove here, since I never said that PES is better than any T1 college from any angle.\n                                └── So basically pes is last resort for student.There is nothing lower than it.",
    "Bois I'm a 4th year student and I'll keep it real. The college is actually pretty good. Yes, you will hear complaints but that's for every college lol. Just know what you're signing up for. Don't keep unrealistic expectations of some chill college life. If you're joining PES the academics will be rigorous. Try not to get backlogs and just maintain good relations with your faculty and you're good to go. People that hate on this college have no valid reasons to do so (apart from the management, they suck lol). The faculty is full of young people that are more than eager to help you (barring EE and Mech, their faculty is a nightmare from what I've heard). You guys have no idea how ahead PES in terms of curriculum and labs as compared to other colleges in Bangalore. If you're coming here, just know you'll be expected to work hard academically. If that's not what you want, don't come here. As simple as that.\n├── What is the safe CGPA for placement?\n│   └── Realistically keep it above 8.5 for being eligible for 99% of the companies. But anything above 7.75 should be fine for 80% of the companies. This might change for your batch tho.\n│       └── Thanks!\n├── Thanks for the genuine answer\n└── On an average PES is pretty shit\n    └── Tbh every college is shit to its students\n\nPesu is shit in some things but really good in others, it's just the tradeoff everywhere not just pesu",
    "Perc in mains 1?\n└── 80\n    └── 27 victim or 29 victim?\n        └── Didn't get u\n            └── On Which date was your exam bro?\n                └── 30\n                    └── 30th shifts weren't messed up...!\n                        └── Never mind bro I messed up whole year, n my parents hope.",
    "Bro join pes"
  ]
}