{
  "title": "Effect of intake on placements ",
  "content": "The 2024-25 intake is increased to 2250(CSE +CSE(AIML)\nWill the college make efforts to place students or it will be like another VIT SRM LPU ??",
  "metadata": {
    "id": "1bn9sam",
    "author": "[deleted]",
    "url": "https://www.reddit.com/r/PESU/comments/1bn9sam/effect_of_intake_on_placements/",
    "permalink": "/r/PESU/comments/1bn9sam/effect_of_intake_on_placements/",
    "score": 19,
    "upvote_ratio": 0.96,
    "created_utc": 1711360489.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "2027 batch is even fked \n720+360+360=Ans*2=2880\n├── Adding to this, 2160 out of 2880 are in CS, so 75%.\n└── Bro they won't even fit \n25 acre ka campus hai.\n    └── Yeah 2880 is across 2 campuses: RR and EC. But the total intake is correct. You can check [here](https://pes.edu/intake-of-courses/).",
    "Jesus. So happy I graduated when there were totally 900 kids in CS across both campuses. \n\nTo answer your question, companies will not increase their intake just because the college increases theirs. Competition will skyrocket because each company takes in at most 10-15 students (being generous here). Good luck lol.\n├── Naah I am asking will the number of companies visiting the campus increase??like how is the management will help people get placed or it will turn out to be like any other private college \n\nTho where are you placed ?\n│   ├── The number of companies cannot increase overnight. The number of T1 and even T2 companies roughly remains the same. Only new startups might join the list. The management is not responsible to get you placed - its up to you to be industry ready. The large intake only makes it worse for everyone. \n\nDM me if you want to know where I work.\n│   │   └── Hey I have texted you (we had a chat before)\n│   └── No it will not this only makes things worse , way more people competing for the same if not lesser seats\n└── Do you think the cgpa cutoffs for companies will increase by a lot?\n    └── It will definitely increase. Companies do not have the resources to interview every candidate. The most cost-effective way to filter is through a combination of CGPA and your score in the OA. If many perform well in the OA, then the CGPA requirement automatically goes up. Before, only a few companies (&lt;10) would stick to a 9+ CGPA cutoff, expect more companies to increase their requirement now.\n        └── Yeah i agree the proportion of companies with a 9+ cutoff will increase, but what I meant to ask was, will there still be a T1 companies with the 8+ cutoff, as in, does an 8 pointer who is v. Proficient in DSA + has done good projects(has good skills) still stand a chance of getting placed well. Have the lights completely switched off or have they just dimmed?\n            └── Lights never completely switch off if you put in the effort.",
    "Better start grinding CGPA rn"
  ]
}