{
  "title": "Masters - Applications + more",
  "content": "Hi everybody,\n\nI graduated with my Bachelor's degree from PESU (RR) in 2022 (Electrical Engineering), and am finishing my Masters at Arizona State this year. Many people from universities I was applying to helped me with my applications and gave me useful inputs on applications, statements of purpose, etc. I cannot thank them enough, and it is now my turn to start giving back and to me, the best way to do so is to help more students. \n\nI am planning to schedule about 2 hours every weekend (Saturday Nights IST) to help students with applications, try to answer any questions you might have, and look over SoPs and stuff. I want to do this for free, as I believe that it would be helpful for students who want to pursue a higher education abroad. \n\nI have experience doing this for many applicants as I had a small business back in the day where we did this professionally. During my master's, I've helped my juniors go through applications as well.\n\nIf doing this could be of use to you, please reach out :)\n\n&amp;#x200B;",
  "metadata": {
    "id": "1bv51l4",
    "author": "foodisspicy11",
    "url": "https://www.reddit.com/r/PESU/comments/1bv51l4/masters_applications_more/",
    "permalink": "/r/PESU/comments/1bv51l4/masters_applications_more/",
    "score": 55,
    "upvote_ratio": 1.0,
    "created_utc": 1712180085.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "Tq senior ❤️",
    "Hey, this seems like an awesome initiative.. We can use this post itself to act like a repository of all the questions!\n\nReach out to me if you need some help in setting this up on the subreddit\n├── You can pin the post for people who visit the sub\n└── Thank you, I've DMed you",
    "Thank you so much for doing this\nA 2023 CSE grad here. Confused with what to do in life. \n \nI need some guidance from seniors like to you\n└── Hi, inbox me - I'll try to help you as much as I can!",
    "W senior",
    "Thanks a lot! This will be greatly beneficial to us.",
    "U did your masters in electrical itself or any other course like CS? Also do you still guide new students to apply for masters abroad( ur post is 4 months old)?\n└── I did my master's in electrical engineering. And I can help! DM me\n    └── oh thats great! I will dm u once college starts.\n        └── Sounds good. :)"
  ]
}