{
  "title": "Kcet exam day doubts",
  "content": "\nWhy do we have to be present at the examination centre **two hours before the first bell**?\nWhat do they do?\nEven jee mains doesnt require us to be there so early \nAnd Are Clocks Present in each exam hall? \nOr we have to be human clocks ourselves \n\n\nAsking here because  its the biggest\nsubreddit and no subreddit exists  related to kcet\n",
  "metadata": {
    "id": "1bwld3j",
    "author": "[deleted]",
    "url": "https://i.redd.it/lil27qxbmosc1.png",
    "permalink": "/r/PESU/comments/1bwld3j/kcet_exam_day_doubts/",
    "score": 24,
    "upvote_ratio": 0.96,
    "created_utc": 1712332053.0,
    "flair": "PESSAT/Admission",
    "nsfw": false
  },
  "comments": [
    "Lolll my exam hall had no bells but better go there atleast 1h before. Centres are as strict as board exam centre only\n└── Was \"2 hours before\" mentioned in your hall tickets?\nBecause maybe there are new procedures and stuff which require a lot of time\n    └── I remember it was yeah , you can check the kcet instructions made by last year youtubers",
    "An HR before is fine. They gon allow you into the classes in the last 30-15 min anyway\n└── Was \"2 hours before\" mentioned in your hall tickets?\nBecause maybe there are new procedures and stuff which require a lot of time\n    └── I gave kcet in 2023. They had mentioned the same thing. However the procedures are almost nil, they just check your roll no/hall ticket no and tell the class number you supposed to go, and normal checking for chits(they did that hella leniently in our campus tho lol) that's it. A max   2-3 min procedure\n        ├── Thanks man\nAny information on the clocks?\n        │   └── I didn't get you, wym by clocks?\n        │       └── Are clocks present in every exam hall?\nSince watches of any type arent allowed\n        │           └── In our class there was a clock. But some of my friends of other centers didn't have one. However the teacher announces how much time is left at intervals ( 30 min left, 15 min left, 5 left)\n        │               └── Hmm ok thanks\n        └── so what is that bell thing\n            └── Ima send you a photo regarding the bell timings,please see it",
    "I wrote Kcet in 2023 and even in our hall tickets it was mentioned to be there before 2 hours but theres no use of going there so early as you might end up standing outside the college for like 1.5 hours as they don’t let anyone in before 30 minutes of the exam also additional tip check properly where you exam centre is because the college where I wrote exam, had 2 branches and many people who were allotted the other branch came to our branch by mistake and then got to know about it and had to rush to the other branch. Just be sure that your centre is right to avoid panic at last moment. \nAll the best for your exams hope you get into your dream college.\n└── Thanks",
    "I went 1hr before. Try contacting kea helpline",
    "bro, just be there on time ...thats it...2 hrs prior is not required coz most colleges wont even let you inside the gate until last 5 mins\n└── Was \"2 hours before\" mentioned in your hall tickets?\nBecause maybe there are new procedures and stuff which require a lot of time\n    └── it was .... they'll only check ur hall ticket ,aadhar card and ur pockects thats it..... so just be there like 30 mins prior the bell.... that should do....ig...",
    "Dw u don't need to go 2 hrs early atleast my center didn't allow us to get in until one hour before so we had to stand outside the gate. Be very careful about the bells cause in some exam centers u can't hear them so u might realize the time just 5 min before ends and u won't have time to bubble ur sheet. So my advice is simultaneously solve and bubble the sheet. ATB\n└── Thanks",
    "2 hrs before is a buffer time depending on how far you stay from the centre because of Bangalore traffic. better to reach at least 1 hr before",
    "Well sometimes it's the exam centre which has a couple of instructions which aren't mentioned in the KCET instructions.\nIncase you have forgotten something you still have the time to get .\n\nThe crowd is so huge there is a tendency of missing out the first bell and you not able to get to the alloted room in time.\n\nA similar one happened to me, where I nearly ignored the first bell alert only to see the place being empty though this happened the second half of the day and me being there since morning.\n\nLuckily I rushed upstairs intime and mind you the alloted room was in 3rd floor and the others were already seated in their places for I just received a glare from invigilator for being a couple of minutes late.\n\nLucky me for there was someone who was not allowed to take up  the exam for being late. \nPS: The person was late a couple more minutes after I was late.",
    "you got your hallticket?\n└── Yes\n    └── brother how. Website has been down",
    "Not reqd, it's a safety precaution \nBe there half an hour before the exam starts\nAll the best",
    "I wrote KCET in 2021. I went 30 minutes before bro."
  ]
}