{
  "title": "PESSAT - April 20, Slot 1",
  "content": "Since many were asking how was PESSAT, I'll put the details here\n\nEnglish - 10 MCQs Comprehension + 10 MCQs for Antonyms and Synonyms\n\nMaths\n - Integration, Relations, Functions &amp; Sets had more weightage than other chapters\n - it was moderate paper, 10-15 difficult questions, 20-25 Easy, 20-25 Intermediate Questions were asked - there were also Integer Type Questions (Around 10 i believe I don't remember that properly)\n\nPhysics\n- Magnetism, NLM, Motions (1D, 2D, Rotational, Circular) and Modern Physics (more of semiconductors) had more weightage than other chapters\n - My preparation for Physics was bad, so I can't comment on the difficulty - it also had 1-2 questions which wasn't there for PU Board namely Radioactivity\n\nChemistry\n- All chapters had almost equal weightage\n- It was moderate paper\n\nThis is only based on April 20, Slot 1 - the weightage and difficulty may or may not vary for other dates and slots",
  "metadata": {
    "id": "1c9eydv",
    "author": "ksvk_26",
    "url": "https://www.reddit.com/r/PESU/comments/1c9eydv/pessat_april_20_slot_1/",
    "permalink": "/r/PESU/comments/1c9eydv/pessat_april_20_slot_1/",
    "score": 23,
    "upvote_ratio": 0.97,
    "created_utc": 1713696455.0,
    "flair": "PESSAT/Admission",
    "nsfw": false
  },
  "comments": [
    "how many question u attempted\n└── Around 100-110\n    ├── bhai how many tukka(guess work) ???\n    │   └── None, there's negative marking\n    │       └── bhai i attempted 93 no guess work today was my paper\n    │           └── math only attempted 5\n    └── Damn bhai.. I attempted almost 155..yesterday was my paper.. Not sure kya hoga, zyada -ve na pad jae... Last yr i was getting 2-3k rank.. This tym lets see..",
    "Other shift is it diff or the same??? \n└── Most probably different questions",
    "So overall was the exam cbse lvl?\n└── I haven't seen any cbse papers so I can't say if it was cbse level",
    "How exactly did you prep for pessat?\n└── I had my jee and kcet prep, didn't do anything extra for pessat\n    └── Ahhh alr what's the rank you're expecting in kcet?",
    "english mei sirf antonym synonm i am fucked now i thought tense wgare ayega\n└── there was one question to identify adverb, one collective noun, rest antonyms (1/2) and synonyms, Excluding the 10 comprehension"
  ]
}