{
  "title": "PESU Internal marks",
  "content": "Why teachers doesn't give full marks in worksheets and case study although we have written Exact same answer as others they get more we get less   \nis there any way to approach to teachers regarding this  \neven in ISA also they won;t give question from the study material they have created   \nWHY PESU",
  "metadata": {
    "id": "1cdef62",
    "author": "EngineeringNo8467",
    "url": "https://www.reddit.com/r/PESU/comments/1cdef62/pesu_internal_marks/",
    "permalink": "/r/PESU/comments/1cdef62/pesu_internal_marks/",
    "score": 13,
    "upvote_ratio": 1.0,
    "created_utc": 1714112944.0,
    "flair": "Study Help :table:",
    "nsfw": false
  },
  "comments": [
    "yeah the internals thing is annoying and it almost feels like they write a random number as marks. nothing you can do about it though\n\nas for the isa, what do you expect\n\nthis isn't like narayana where they'll give a question bank and guarantee that the questions will be the same. learn to understand the concept instead of approaching every subject with the sole goal being answering ISA questions.\n\nin the long run you will benefit. in the short run they will do relative grading and everyone gets good grades anyways. it's a win-win\n└── I know however it's a win I wanted to recover fee from scholarship as much as possible 🙂\n    └── you will dude. just learn the ideas instead of mug up. but there are definitely subjects where mug up is the only way. chem, phy, mech, i remember a lot of epd as well. and math is a bit of both.\n\nfor math they mostly ask questions directly from the class notes, so just take pictures of someone who writes them. i absolutely hated how many formulas you have to know\n\nbut mainly try to understand c and python",
    "From my 4 semesters of experience, I can say that they would rather do grade shifting but they will never sacrifice on difficulty level of ISAs and ESAs. This puts mental stress on students ngl.."
  ]
}