{
  "title": "Is college life as bad as people say?",
  "content": "im getting mixed responses about college life at pesu. some say its literally school and some others say that it is not like how it is said over the internet. clarify everything please. im planning to join ece there. if the schedule is damn too hectic, ill seek some other college. thank you\n\n&amp;#x200B;",
  "metadata": {
    "id": "1cea6uq",
    "author": "Personal_Quarter_235",
    "url": "https://www.reddit.com/r/PESU/comments/1cea6uq/is_college_life_as_bad_as_people_say/",
    "permalink": "/r/PESU/comments/1cea6uq/is_college_life_as_bad_as_people_say/",
    "score": 12,
    "upvote_ratio": 0.87,
    "created_utc": 1714208951.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "PES places a higher emphasis on academics compared to other colleges in Bangalore, hence the perception that campus life here is nonexistent. Your college life is primarily what you make of it. You will have abundant chances to make friends, participate in clubs and activities etc. If you still choose to remain isolated and cry about a shit college life then that's on you.\n├── It really sucks when you're an introvert and can't even talk to people\n├── lol ok then\n└── Kya dost ptogi kya?\n    └── No\n        └── Kyu dost, ek try to bnna chahiye na?",
    "In terms of student quality, you get to meet very diverse people. Who you choose to befriend is up to you. Sometimes you end up wasting time with idiots before you realise it's too late.\n\nPes have pretty good student culture\n└── thank you for guidance",
    "https://www.reddit.com/r/PESU/s/5jaMNLGJ8F Pros &amp; Cons of PESU",
    "also, my friend does bba there and getting 40% fee waiver for high cgpa. can i get that in btech too? he said me to join as there is that 40% scholarship\n├── theres upto 50 as well. yes its there for btech also\n│   └── thanks for clarifying\n└── Does 40% fee waiver apply to management seats as well 💀💀\n    ├── anyone... of this sub please reply\n    │   └── yes its applicable to management seats as well dw\n    └── yes\n        └── Fr ? So I'll get 19lakh back ? Seems cap tbh\n            ├── No,you will.But to get it you’ll need to have about 9.2 GPA which isn’t easy and you have to maintain it as well\n            └── I know one friend from mgnt he got mrd scholarship in 2nd sem\n                └── where can I find the the topics covered semster wise ?\n                    └── google search pes student handbook its is old but can be **referred**",
    "Let me answer this as a grad:\n\nIs the stuff mentioned here inaccurate? Nope, it's mostly right and isn't that exaggerated. But is it as bad as it seems? Not really. It depends a lot on what are *your* expectations of PES.\n\nA lot of people come in with the assumption that college will be like what they depict in shows and movies - kids chilling all day and night, parties, etc. Unfortunately this isn't that kind of college and overnight studying doesn't lead to results. PES is known to be academically rigorous with a good emphasis on academics. If you want to score well, you're not only gonna have to work hard but also put in consistent effort. Each course has multiple deliverables and workload generally increases in magnitude and difficulty with every year. Honestly, things used to be *more* hectic - there used to be tests every 2 weeks and assignments in between those weeks. You're lucky to not have joined during that phase. \n\nBut there is a life beyond academics. There are multiple clubs (way too many and redundant if you ask me) and events happening throughout the semester. There are decent fests. A couple of fun events across the year. None of them are world class but neither of them is trash either. They're good enough to serve as breaks between the semester. You also get a 2.5 month long summer vacation, which to the best of my knowledge, very few colleges have. \n\nSo is PES a school? To a large part, yes. There's a fixed schedule, you sit in your classes from morning to evening etc. But there's also a lot of opportunities to break that monotony and its upto you to make the most of them. Don't expect a college life equivalent to ones shown in movies because they don't exist here (or anywhere in the country). My suggestion is to join with an open mind without expectations and take everything in. \n\nIf you'd like to talk to current students, you can always join the PESU discord server (4500+ members). The link to it is in the FAQs or even in my previous posts. If there's other things you'd like to ask, feel free to DM.\n└── thank you... are clubs necessary? i am planning to do a course side by side and also football in the evening so will joining clubs affect my free time? and ofc, i didnt assume college life to be like the ones shown in movies lol\n    ├── It all depends if you are interested in them or not.\nI think they won't be interfering with your normal life for the most part\nThey'll just be a fun and new learning experience.\n    │   └── fine....\n    └── Depends on your interests as someone said. It won't really help you too much professionally, but they are good ways to get a break from the monotony.",
    "Personally I'd say it is too hectic but the thing is you have to find time and make the most out of it.  \nPES gives more importance to studies and academics rather than seminars and sports, so it seems a little hectic tbh as for the 1st year the academics take a little time and effort but is it worth it?? I guess, it totally depends on what kind of person you are and what you like doing the most.  \nAs of now they have reduced the attendance benchmark to 75% for the 1st year( It was 85% before ) so it's a lot helpful and gives you a bunch of time for your extra-curricular activities.  \nThe Placements are good ( If you study that is ).\n\nAt last I would say it totally depends on how you use your time and how you utilize the space around you!!  \nGood Luck and make some good friends it plays an important role.\n└── how is the placement for core branch students? atleast do even one or two get placed in core jobs? not asking about it jobs",
    "2023 grad here, I believe whatever experiences you have read/ heard might be extremely biased and may or may not have been shared through that particular individual’s frustration. \n\nIt all depends on what you want to derive out of 4 years at PES. That is going to more or less influence your college life imho. Maybe a well paying job ? Or good education to pursue your masters abroad or elsewhere? Or a chance to work on your idea and build a startup ? You will find people from different backgrounds trying to fit themselves into one out of the above 3 categories and majority of them successfully do it so. You might have to sacrifice few things which you may feel is not worth it at that moment….but trust me, in the long run, these sacrifices will help you achieve what you want to ! then this means you might have to travel to college, attend classes regularly and do assignments, this is the story if you go to any good engineering college, with PES being no exception. \n\nThere are people who belong to another category where they are not ready to put in the hard work and expect a great package waiting for them out of nowhere. They play the victim card and blame PES for ruining their lives. Mostly they are here because their parents forced them into engineering or some other weird reason. For them it’s waste of time and money. When your core friend circle consists of individuals from this category, you will enjoy their company and feel this is the college life you deserve, but you have no idea how deep a hole you are digging yourselves into ! and before you know it, 4 years are done and you feel you have not made any progress. This guilt is going to eat you up. \n\nSo make good friendships, you will make few bad ones but hey ! This is how life teaches you a lesson. Wherever you decide to go, you have to put in the effort to reach somewhere. Some places help you reach that goal sooner and others don’t. Each college has its own pros and cons and no college is perfect. Sounds cliche but that’s the reality. ultimately wherever you go, there will be ups and downs but you get to choose how your life is going to shape up for the next 4 years. And here’s a secret: it’s never too late to change your life during those 4 years. All you have to do is to decide !\n└── the best guide out there. thank you buddy",
    "don't study man, nothing is there in studies believe me.\n└── eh?"
  ]
}