{
  "title": "PESU toll free number uses the GTA San Andreas soundtrack",
  "content": "Called PESU today to check if the COE office is open. Called the admissions number by mistake. Very surprised when the GTA SA soundtrack started playing.",
  "metadata": {
    "id": "1cm5gzb",
    "author": "nishshastry",
    "url": "https://v.redd.it/jjt7a8xgayyc1",
    "permalink": "/r/PESU/comments/1cm5gzb/pesu_toll_free_number_uses_the_gta_san_andreas/",
    "score": 126,
    "upvote_ratio": 0.98,
    "created_utc": 1715064223.0,
    "flair": "Meme :snoo_dealwithit:",
    "nsfw": false
  },
  "comments": [
    "Ahh shit here we go again",
    "Now you know about all the shit that goes down in PES\n└── Definitely. Saw some shit during my time too",
    "Even bits ka number uses it😭",
    "Copyright ©️ case.",
    "PESU. Home. Atleast it was before i fucked everything up.\n└── Hey stranger, it may seem tough but keep going. There’s nothing you’ve fucked up that is permanent. Once you graduate and move on, everything that happened in PES will be forgotten. \n\nTry to make some good memories with your friends. Those are the only things you will remember",
    "PESSAT ka result aaya kya?\n└── Internet says May 16th. Idk if this is correct. I graduated from PES in 2021\n    └── Would you say it's worth it?\n        └── Sorry for the wall of text. In all truthfulness, despite the drawbacks of PES, it was definitely worth it for me. I had a lot of fun during my 4 years and was able to get placed in a tier 1 company at the end of it. After working for a couple of years, now I am heading off for my MBA. PESU definitely helped kickstart my career.\n\nWhen I studied though, it was a different time. I studied CS in the RR campus. After my first year, they basically demolished most of the buildings and the cricket field so we didn’t have a campus at all. Covid then killed my 3rd and 4th year. So I basically had 1 year with a proper campus and 1 more year with no campus. Last 2 years were completely online. Now though, with the new building and everything, the RR campus looks really good. Haven’t seen the EC campus in person but have heard that that one also looks really good. \n\nComing to placements, I wasn’t a spectacular student or anything. Had a slightly above average CGPA in my batch (8.73). Never bothered with any of the opportunities or clubs that were there - AI/ML club, Alcoding club, CDSAML, research opportunities, etc. Didn’t find too many problems with placements though. Only a couple of companies had a cutoff of 9 so was able to sit for pretty much all companies. All of my friends with lower or higher CGPAs were all able to get placed. I personally feel that with all the problems it has, PESU does its job in the one thing that counts - placements. But with the current market, this definitely may not be the current state of affairs. Try to speak to a couple of current final year students for the stats. I think comparatively, PESU is still doing quite well. Atleast in my company I saw a good number of interns join from PESU.\n\nThe college had the same drawbacks during my time too. It’s way too strict and is pretty much just a school. Not much freedom to do anything fun. Most of the professors were bad, ngl. Even the most brilliant professors couldn’t really teach well. The few who could teach well taught extremely well though. It’s all luck based who you get. But I guess that’s common in all colleges. The professors also love to screw and punish the students for every single little thing. I remember getting my phone confiscated for 2 weeks after I was caught using it in class. Even after paying such high fees, we have to pay for everything from parking to buying another record book. Our college definitely feels like a scam sometimes. In my case we didn’t even have a campus. Despite all that I enjoyed my time. With a solid group of friends, you’ll have a good time. We spent a lot of time bunking and playing football, gaming, billiards, or just going out. There’s a lot of things to do nearby and JP Nagar is also very close to go and hangout.\n\nI would say that at the end of the day, placement or going for higher studies is all that matters. In that aspect, PESU is very strong for placements. I also saw many of my batchmates going into some of the top schools in the USA for masters. Many of them utilised the college resources available and got some good LORs from some of the qualified professors which seem to have added a lot of good weight to their applications. So if PESU can help get you that job/college at the end of the 4 years, and if you can manage and find enjoyment despite all the problems that exist, it’s so worth it.\n            └── thanks a lot you cleared most of my doubts please help me with this last one  \nim getting ece at rr campus and cse at ec   \nive heard a lot of shit about ec   \nwhat do you think is better  \nim fine with both the branches but placement is what matters at the end of the day\n                └── I don’t really have a definitive answer to your question but I’ll give you some points that you can consider.\n\nIn my year, they started the new system of combining both campuses together for placements. Both were known as PESU and all students from both colleges had the same placement opportunities. Companies couldn’t tell which student came from where. Both campuses were on equal footing.\n\nAlso when it comes to ECE vs CSE, pretty much everyone from ECE in my batch who sat for placements got placed too. There were very few core companies that hired for ECE related jobs and most ECE students got placed into CS related roles itself. So placements wise also, ECE doesn’t have any significant drawbacks.\n\nSo you basically need to ask yourself which campus has more benefits for you, and which branch would you personally find better.\n\nFor branch, there are some benefits to taking CSE. Some of the classes like operating systems from which concepts are frequently asked in interviews only happen in CSE (atleast during my time it wasn’t there for ECE students). So if you take ECE, you might have to do a bit of additional self study. Other than that it pretty much boils down to which subjects you can stomach for 3 years. And which course do you think you can easily maintain a decent GPA. It may sound nerdy or something, but despite how it might feel during your college life, maintaining a decent GPA (doesn’t need to be exceptional) is honestly quite important. Even now when I applied for my MBA 2-3 years later, I still had to add my college GPA to my application. So really think about which subjects interest you and you think you can score well in. Do you really want to study the things in ECE/CSE during class and then also for the exams? You’ll need to think about this. Try to find out a list of subjects that you’ll need to study in each course\n\nIn terms of campus, start with which one is closer to you. Do you plan to stay in the hostel? If not will you have a long commute? Do you really want to travel so far both ways on a daily basis? Appearance wise I think both campuses look equally good now. EC campus may not have as many hangout joints and things to do nearby like the RR campus does. But other than that, at this point, I don’t really know whether there’s any unique thing in the RR campus that isn’t there in the EC campus other than the fact that RR campus came first. I’m pretty sure 90% of the professors equally suck in both places. Clubs and things are probably the same or marginally different (maybe better to ask current students for this info)\n\nDidn’t really answer your question but you should think about these things before deciding. Don’t really overthink it too. More than the course and campus, it’s about your effort and performance as a student. The students who studied hard and put great effort, from both CSE and ECE and from both campuses, got placed in amazing companies or went for good masters programs. Since the resources are very common in both, it depends more on you\n\n(Since it may get confusing, ECE = electronics branch, EC = Electronic City campus)"
  ]
}