{
  "title": "Late to LEET CODE",
  "content": "So I'm in 4th sem and have not done a single LEET code problem. I do have good projects when it comes to full stack, AI/ML on my resume and real time work experience for a startup. With respect to the summer internship recruitment coming this August, I'm planning to do 5-6 questions of LEET code everyday in the 2 month break. Will this help me? What more should I do?",
  "metadata": {
    "id": "1cn06rq",
    "author": "Consistent-Form-8212",
    "url": "https://www.reddit.com/r/PESU/comments/1cn06rq/late_to_leet_code/",
    "permalink": "/r/PESU/comments/1cn06rq/late_to_leet_code/",
    "score": 16,
    "upvote_ratio": 0.87,
    "created_utc": 1715159682.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "Don't treat this like another JEE mate, do what excites you the most and do it because you're passionate about it",
    "You aren't \"late\" by any means - in fact, you are probably at an ideal time to start. Companies only visit from the end of the 5th semester, around October-December and continue till around March-April of 6th semester. If you start *today*, that still gives you 6+ months to prepare. That is a LOT of time to not only brush up on basics but also learn advanced concepts. \n\nAlso, DSA isn't the only thing you need to get placed since it only helps you clear the aptitude test. You also need to get your CS basics right: OS, CN, DBMS. These are often tested not only during the test but also during interviews. Knowing these is as important as knowing how to solve problems.\n\n-------\n\nAnd as someone else commented, do not treat this like JEE. You don't *have* to do LC to get an internship or job.\n\nI didn't even create an account for LC during placements. Been 2 years since I graduated and started working, and I still don't have one. I did not even get to prepare for placements since I was already busy in the summer before 7th sem (and throughout it too) with an internship (which again, did not test me on DSA and only had interviews) which was likely to give me a FTE offer. Although I would not recommend this since I had the safety net to fall back on and the job market was good back then.\n\nWhat worked for me was that I was thorough with the basics and I had a pretty good resume with experiences/projects relevant to the job requirements at the time. As long as you can clear the test and *if* you have a strong resume with solid evidence for your skills (along with a little luck, of course), the interview should go your way. \n\nSo don't break your back trying to become to best LC/CC-solver because you don't need to solve 1k+ problems to get placed. Instead, focus on having a really good resume to show with relevant skills, while ensuring you do have the basics fundamentals in CS theory as well as DSA.\n├── Thank you for helping me with this. I'll keep this in mind 👍\n└── I came here cuz u mentioned about it in my recent thread  👇\n\nhttps://www.reddit.com/r/PESU/s/I4r9gidm3m",
    "Holy hell chil tf out. \n\nThis is the last summer vacation of your *life*. Take time to relax and understand what you enjoy in computer science. Understand what domain you want to work in.\n\nW.r.t summer internship opportunities, don't expect anything from PES. Look outside on you're own. Outside, your resume matters not leetcode. \n\nThe vast majority of people start leetcode in their 6th semester so chill out. \n\nFinally, CHILL OUT. If coding helps you chill then code, if swimming helps you chill then swim. Take time off man.\n\nIf you really want to do things to improve, I'd recommend doing a project in whatever you are interested in.( I see you said you have a AI project, maybe improve on it or combine it with another domain of your interest?)\n└── thank you, I'll keep this in mind.",
    "don't do it like entrance exams again but yes it is a good skill to have. my friends in third year currently say that it's really competitive to get summer internships so yeah. it's not only dsa, they also ask some stuff from cn and os.\n\nour CN was honestly pretty enjoyable and im glad they chose to teach from jim kurose's textbook. \n\nbut yes you should get competent at problem solving in general. one thing i was told to do (and planning to do this summer) is to re-learn dsa properly (our college's syllabus is jack shit) and also get into competitive coding."
  ]
}