{
  "title": "AIML Vs CSE",
  "content": "Should I join AIML by chance i dont make it into CSE? Or choose CSE in a different college like BMS or VIT. I do have a decent background in Computer Science for a high school student and i dont mind on missing out on my college life and willing to work hard at it. So whats the main difference between the two branches?",
  "metadata": {
    "id": "1cn3uab",
    "author": "Pale_Order4389",
    "url": "https://www.reddit.com/r/PESU/comments/1cn3uab/aiml_vs_cse/",
    "permalink": "/r/PESU/comments/1cn3uab/aiml_vs_cse/",
    "score": 10,
    "upvote_ratio": 1.0,
    "created_utc": 1715172806.0,
    "flair": "PESSAT/Admission",
    "nsfw": false
  },
  "comments": [
    "i would take cse in bms over anything at PES. but i would take AIML in pes over CS at VIT.\n\nthere are only a handful of courses that are different between AIML and CSE till second year ( there is no third year yet). but till second year you will be learning everything the cs people do and some more. they will skip some small parts in order to fit some more ML related stuff but what they skip is pretty minor and unimportant.\n\nkeep in mind this is only till second year. third year could be very different nobody knows yet. we'll find out as we go lol\n├── How is bms better than pes can u plz explain, I'm a fellow aspirant who's gonna join clg this year..\n│   └── Less crowd is a huge factor. Pes has 720+480 in rr and 720+240 in ec. Also there will be tons of people in ec and eee who will also sit for cs placements. \n\nBMS is also more chill in general and not as academically focused as pes\n\nBut it's also not as bad as people here say and the subjects themselves are also quite easy. And pes also has better placements. \n\nSo for CSE i suppose either one is fine\n│       └── Considering placements as the sole thing, which would be better?\n│           └── Still I'd say very equivalent. I like PES's portions better and also the computer based exams are very nice. The strictness is overstated. \n\nBut attendance requirements are annoying af. 75 is too much. \n\nSomething else that gives pes an advantage is that you can make back 40 percent of your fee by being in the top 25 percent of the people. An easy way to get back like 2l out of the 4.5l fee. \n\nFor that also I'd pick pes\n\nOverall, like i said. Either way it's almost the same\n│               └── Tier 1 offers are way more in pes than bms afaik, bms students are saying to choose pes over bms anytime if only placements are the concern...\n│                   └── Oh haha i thought you said \"placements aside\". \n\nYeah if placements are your priority then hands down pes\n│                       └── Thank you so much mate.. 🙌\n├── cs at vit still would be a better choice imo. yes vit has high intake but most are just there for their degrees and aren't serious so you get a boost in cgpa ( I've heard vit has relative grading so) and the opportunities are pretty decent. the fee of vit till even cat3 is way lower than pes iirc plus they have decent reputation abroad since how high their rankings etc are.\n└── facts, CSE in BMS over anything at PES",
    "If you are willing to get yourself into school-like regime again.... go for PES. BMS offers a less academically intensive course and from what I've seen... all of my friends in BMS are living life. But if you want more exposure academically and want to build a stronger foundation... I'd say PES. CSE and AIML in PES have almost the same buzz created..... I'd suggest CSE since you can learn ML concepts side by side",
    "Check out my previous comment: [https://www.reddit.com/r/PESU/comments/147gamv/comment/jnve51g/](https://www.reddit.com/r/PESU/comments/147gamv/comment/jnve51g/)",
    "Before you choose, I guess you should have a decent knowledge of what they exactly are.\nI am an AIML student so I would like to clear this buzzy word AIML.\nThis is mostly (90%) math and nothing else. You can enjoy the course only if you enjoy seeing all these years of math that you learnt from grade 6 being useful now.\nSo if you are sure about spending the rest of your life soaking in mathematical equations and concepts you can choose this.",
    "Wait y'all got your pes results??\n└── no not yet just a hypothetical question"
  ]
}