{
  "title": "PSE RR vs EC campus",
  "content": "I heard from quite a few people that PSE RR campus is better than EC campus on multiple aspects (infra, coding clubs, teaching etc). Cutoff also seems to be high for RR campus than EC campus. Is this true?",
  "metadata": {
    "id": "1cpg2rr",
    "author": "techieAtheart2006",
    "url": "https://www.reddit.com/r/PESU/comments/1cpg2rr/pse_rr_vs_ec_campus/",
    "permalink": "/r/PESU/comments/1cpg2rr/pse_rr_vs_ec_campus/",
    "score": 12,
    "upvote_ratio": 1.0,
    "created_utc": 1715429406.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "-When I joined PESU , RR campus closed at below 800 ranks and EC campus closed at 3k rank for cse. However the situation has drastically changed since then , both campuses have increased their intake and right now CSE at RR closes at 1.6k CSE Aiml closes at 2.6k, CSE EC closes at around 5.6k and CSE aiml at EC closes at 6k+. Back when I joined there was a difference in peer groups I guess ,but the difference in peer groups will be more pronounced now. That being said if you come to ec campus and have the exact same cgpa and skill set as an rr campus student ,you wont be treated differently in anyway wrt Placements/Internships.\n\n-Teaching wise both are roughly the same (nobody listens to the class anyways), we have the same study material, same av summaries to give a gist of each topic .\n\n-Infrastructure wise Ec campus was slaking when i had joined but since the student centre has opened up here ,we also have pretty nice recreation centre which includes top notch quality gym, badminton courts, table tennis, pool tables, a running track ,chess ,carrom all of which is indoor btw. Classes in both campuses are the same , a large room with 60 students in each class , a tv in the centre and boards on either side. Library in RR campus is definitely better. EC campus however is more open and is far less crowded compared to RR campus. EC campus' location is a major flaw though, situated on a literal highway , you will need to go all the way to EC or Kormangala for decent hangout spots. RR campus is much better in that aspect ,it is well connected also , metro connectivity is coming soon to EC campus, the station is at a walkable distance from the campus whereas in RR ull have to take another bus from the metro. Fests in RR campus are better but wont make a difference anyways since both campus students can attend either fests.\n\n-Personally if I was going to join now , I would first look at the fees . If I was getting PES EC campus through CET and PES RR campus through pessat , I would blindly go to Ec campus , pessat fees now in nearly approaching 20 lakhs for the entire degree, you are getting nearly the same experience, and exactly the same opportunity at 4 lakhs ish through kcet at EC campus . If fees is the same then I would consider travel time next. If all the parameters are the same then I would have joined RR campus for the better peer group . Your priorities , Financial situation may be different ,I hope my answer helps you make an informed choice.\n├── &gt;However the situation has drastically changed since then , both campuses have increased their intake and right now CSE at RR closes at 1.6k CSE Aiml closes at 2.6k, CSE EC closes at around 5.6k and CSE aiml at EC closes at 6k+.\n\nCan you elaborate on \"increased their intake\" according to the kcet seat matrix in the last two years the number of seats for example cse is 720 including seats for reservation candidates(288 for general candidates if i remember correctly)\n\nDo you mean they are increasing intake through pessat/management? If yes, can you please provide data if you have it.\n\nEdit: recommend you to delete this account as you can get doxxed easily by your fellow batchmates if you havent graduated yet \nAnd reddit also recommends users to not share private information as you have did in your username\n│   └── In my batch there are 720 students in RR campus CSE and 600 people in CSE EC campus and around 120 students have been admitted through lateral entry in both campuses combined so thats 1440 students there was no AIML seperate branch. Rn the intake is 720 students in RR CSE ,480 RR CSE AIML,720 students in EC CSE and 240 in EC CSE AIML. There are 840 more students now in comparison with my batch.\n\nThe point I was trying to make is that the quality of students entering EC campus has changed alot since my batch which you also may want to consider while picking your campus. Ig the huge change in cutoff (almost double) also is because of increased intake by adding other CS related branches in other Bangalore Colleges like BMSCE and MSRIT. \n\nOn a side note the 720 seats you see the matrix, is like the total intake KCET+ PESSAT+ Management ,out of which 288 are alotted for kcet and there will be further reservations applied on these 288 seats.\n│       ├── Is it safe to taking admission in pes for a middle class guy like me ?\n│       └── Yo bro ,I'm getting around 5.5k.rank  in kcetdo I still have chance in rr branch for cybersecurity??? Or in bad case cse?? Or worst case aiml???\n└── Thanks for your inputs",
    "When it's about teaching in PES don't expect your teachers to spoon feed you everything. They teach with the expectations that we know the basics. \n\nFor gaining knowledge there are multiple ways for it. Your choice and efforts matter. Keep learning.",
    "i've spent a year at both.\n\nteaching is equally useless at both\n\nclubs are good at both. actually maybe better in ec campus\n\ninfrastructure better at rr but it is full of buildings. ec has more free space\n\nsyllabus and exams are the exact same. people write the exact same paper at the exact same time\n\n  \ncutoffs are higher because 12th graduates don't take very smart decisions usually\n└── u can change campus in between??\n    └── yes it's based on cgpa instead of rank. and there should be a vacant seat left after the first year. meaning somebody left in the middle",
    "There are already enough good answers here, but if you need another opinion, check the FAQs, it's been answered there: https://bit.ly/pesu-faq"
  ]
}