{
  "title": "How tough is it to atleast get a Tier 3 job right now for Btech CSE",
  "content": " Im from 2025 batch , placement season is around the corner and Im getting worried about how placements will be for us after seeing 2024 batch placements. Is it pretty difficult to even get any job rn??  ",
  "metadata": {
    "id": "1cr4awe",
    "author": "anirudhk_27",
    "url": "https://www.reddit.com/r/PESU/comments/1cr4awe/how_tough_is_it_to_atleast_get_a_tier_3_job_right/",
    "permalink": "/r/PESU/comments/1cr4awe/how_tough_is_it_to_atleast_get_a_tier_3_job_right/",
    "score": 17,
    "upvote_ratio": 1.0,
    "created_utc": 1715619546.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "Young talent is important to companies and the industry in general. And T3 companies are generally run purely on manpower with bad churn rate so they won't stop hiring as such. As for the rest, it's looking bleak right now. \n\nBut you need to understand the industry is just like this. It bloats up and then shrinks in cycles. 2000 this happened, then 2008, and now.\n\nStart prepping early. Get specialised knowledge and skills in your area of interest. Apply off campus from the get go and float your resume to your network. This is after all just a numbers game.",
    "Just having a degree is not enough to get you a job in today's market with the exponentially increasing competition. You will need to find a way to stand out with your skills, projects and experiences. Focus on building a solid profile beyond just your CGPA.\n├── Yo bro calm down\n│   └── It's pretty obvious that the scene has changed since your batch and the batches that our passing out now, put yourself in our shoes and think instead of arguing here. People with 8 cgpa not getting placed was that head of in your batch? We paid the same fees as you guys and you guys almost all of you got placed ,got placed to the moon, What did we do\n│       └── I'm one year your senior. If someone with 8+ is not getting placed that's 100% their fault. You have to be genuinely horrible at interviews and coding to have 8+ and not be placed. \n\nFor my batch, Tier 3 is not an issue. Plenty of opportunities. Tier 2 was a little harder, but still lots of opportunities. Tier 1 was very competitive and unfairly skewed to favor chpa over everything else.\n│           ├── what salary range defines tuer 1 2 3? does tuer 1 means 12+lpa?\n│           │   └── Tier 1 is 12+ lpa, tier 2 is 6+lpa (maybe 8+lpa, I don't remember) and anything below that is tier 3. \n\"Dream tier\" is 60+ lpa.\n│           │       └── woah, how many ppl from cse rr campus get 20+lpa?\n│           │           ├── Placement stats usually not given campus wise. The placements are combined afterall. I'd say maybe 20-30 people would have 20+ lpa. I'd say at max 50 people. \n\nDon't be deceived by large lpa jobs. Lot of these have a comparatively very low take home ( money actually sent to bank account)\n│           │           └── Placement stats usually not given campus wise. The placements are combined afterall. I'd say maybe 20-30 people would have 20+ lpa. I'd say at max 50 people. \n\nDon't be deceived by large lpa jobs. Lot of these have a comparatively very low take home ( money actually sent to bank account)\n│           │               └── got it. thanks.\n│           └── thanks bro this was the kind of reply I was expecting. Some insights like these\n│               └── Np. Atb for placements!\n└── Nobody told me this, I feel like I've been scammed... I wasted 3 years of my life for nothing\n    └── Not sure why you expected a job to be handed to you on a silver platter just because you (and thousands of kids) get an undergrad degree.\n        └── Well, because this is fucking PES\n            └── Even if you're an IITian, you're not going to be spoon fed a job. Work on yourself instead of expecting things to be given to you. This isn't school anymore.\n                ├── Imagine a college not even being able to guarantee a minimum package of 4 lpa, even if CGPA is decent, even cab drivers earn more than this crap, stop with that boomer attitude\n                │   └── Again, you are not entitled a job just because you can pay for an undergrad degree. A job requires industry relevant skills. If you do not have the skills to clear the aptitude test and then the interviews, then you are clearly not industry-ready.\n\nNobody will hire you just because you paid to get a degree. You need to show the recruiters that you deserve the job.\n\nCall me a boomer all you like, but the reality is that you still think you are in school and everything in life is handed out to you without any effort. Its time to grow up, this isn't school - this is real life.\n                │       └── Then this goes on college, not us students, we deserved decent teachers, and all we get is really bad teachers, whom no one listens to in class, majority of the classes I've had, barely anyone listens in class because of bad teaching, on what basis is this college ranked up so high? This college can't even do the bare minimum of uploading up to date content on PESU academy.\n                │           ├── Nigga if you study by yourself you will get a decent CGPA. You can learn to code well with the abundance of resources online, You literally don't need teachers.\n\nSure I mean if your goal is to get like 10 CGPA then im sure good teachers will be able to help but if you want a decent GPA and a Decent job u literally don't need the teachers for anything.\n\nFuck me bruh even in iits and the best universities in the world, theres a lot of complaints about the teachers not being on par. \n\nPeople who succeed in life strive to do well in the hardest scenarios, yapping on reddit gets you nothing.\n                │           │   └── Yeah bro, that's true, but I fucking hate my parents who forced me to go this route, I was always bad with Computer science at school. But I didn't know it would be this bad when I came to PES, in 11th 12th, I had amazing teachers, but the teachers over here don't even hold a candle to them. And what's this about succeeding in life bro? What's your definition of success? I just want bare minimum and I'll do my thing, if I can't even expect that, I fucking wasted my life here.\n                │           ├── This has to be rage bait 💀\n                │           │   └── Nope, I am just telling what I observed.\n                │           └── There is bad teaching quality almost everywhere. But there are also unlimited resources available online. Textbooks, websites, videos etc. Consider yourself lucky to even get content on PESU Academy. Batches before you (including mine) never had content provided to us like this - we had to depend on textbooks or class notes. You guys definitely have it easier when it comes to getting academic material for courses.\n\nAlso, teaching quality only gets you so far, you still need to actively put in effort to build something beyond your GPA. Poor teaching quality might explain an average GPA at best, but not having the skills required for a job is completely on you.\n\nMy DMs are always open on if you need advice on how to build your profile. Good luck.\n                │               └── Thanks for the discussion senpai, I lost my cool a bit, I apologize for that.\n                └── This field sucks\n                    └── You chose this field. Nobody forced you to take this up.\n                        └── I didn't have an option damn it, this is partially the fault of my parents as well, I had no career counselling at all, I was busy studying for entrance exams and didn't put any meaningful thought on what am I going to do in life. What's the point of getting a 3 digit rank in CET and then suffering such a meaningless fate?\n                            └── Instead of being so bitter about it now, you have 2 options: \n\n1. Accept your circumstances and try to find happiness in your current career trajectory.\n2. Actually spend some time figuring out what kind of career you want to build and work towards it. It is never too late for career counseling and starting afresh. You are barely 20-21. You can definitely turn your life around if you take the right steps."
  ]
}