{
  "title": "What do you think the most important things to be done in this summer break",
  "content": "I will be in 3rd year(CSE) after this Break. So is there something really important that needs to be done for current job market ??. Can you list the few of them. It would be really helpful 🙂 .",
  "metadata": {
    "id": "1crlw4p",
    "author": "_The_Greek_God_1",
    "url": "https://www.reddit.com/r/PESU/comments/1crlw4p/what_do_you_think_the_most_important_things_to_be/",
    "permalink": "/r/PESU/comments/1crlw4p/what_do_you_think_the_most_important_things_to_be/",
    "score": 17,
    "upvote_ratio": 1.0,
    "created_utc": 1715669836.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "The competition is pretty cut-throat right now and the market isn't great either. The only thing you can do is prepare yourself as much as possible and hope for the best.\n\n1. Keep an updated resume (and portfolio if you have one) and LinkedIn. Makes it easier (and quicker) to apply online if you have everything up to date. I used to update these once every month. Also, learn how to build standard resumes and portfolios that are followed in the industry.\n2. Tailor your resume/profile to your interests and the roles you are looking for. This helps your resume pass filters for roles that interest you. Build projects on topics you are interested in and try gaining good experiences.\n3. Prepare for DSA. This is the right time to start prep. If you scroll on this sub, you will find a recent post about leetcode where I commented about how much of time you should dedicate on it. Give it a read. To summarise, be proficient with the basics and ensure your fundamentals are perfect. This alone will help you solve at least 50% of the questions.\n4. Be thorough with CS theory. Concepts like OS, CN, DBMS are often tested only during interviews but also in the aptitude test. Revise them over the next few months so that you know your concepts well.\n5. Apply aggressively off-campus as well. Don't depend only on on-campus opportunities. Keep sending out applications. Reach out to recruiters on LinkedIn. Try connecting with seniors and alumni for referrals (learn how to ask for one before asking). Network as much as possible. \n6. Keep faith in yourself and your abilities. Placement season is very intimidating for most and there is a lot of anxiety. You will face rejections, probably from multiple companies before you eventually land a job. This series of rejections can last anywhere between weeks to even months. You might not even secure a summer internship. Don't give up, learn from your mistakes and keep pushing yourself to get better and focus on the next opportunity that comes.\n└── Cool Will do that 😃",
    "Would be nice to intern somewhere. Reach out to family friends and see if you can do an internship somewhere, even if it's a small company or informal.\n\nIf you don't get an internship, then now is also a cool time to figure out what sub-fields interest you. Muck around with different topics, don't try to learn them ground up, just do mini projects from tutorials in everything and see what one topic you find cool and interesting. Then you can go ground up in that topic over the course of the next year apply your skills somewhere. This will also help u pick electives. \n\nPES courses will make you a decent jack of all trades but it always helps to be better than most at one particular thing, for which you'll need to study outside college.\n\nAlso check out OpenSource projects.\n└── Sure i will look into it 😃"
  ]
}