{
  "title": "Confirmed: 3rd student did suicide and passed away because he wasn’t let to write exam",
  "content": "He came to exam hall after 9. He wasn’t let inside. Apparently in his PESU academy the exam was supposed to start at 9. The examiner told he will have backlog and won’t sit for placements. He jumped from fourth floor. He was alive for 20 minutes when they found and died in hospital. Please do not try to take such drastic steps for an exam. It’s not the end of the world.",
  "metadata": {
    "id": "1crqziu",
    "author": "Imsmortboi",
    "url": "https://www.reddit.com/r/PESU/comments/1crqziu/confirmed_3rd_student_did_suicide_and_passed_away/",
    "permalink": "/r/PESU/comments/1crqziu/confirmed_3rd_student_did_suicide_and_passed_away/",
    "score": 167,
    "upvote_ratio": 0.98,
    "created_utc": 1715689908.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": true
  },
  "comments": [
    "Last esa anol they were allowing people who came half an hour later inside, idk why they aren't doing it this time. People commute from far off places so they must be allowed atleast even 30 mins after exam starts. \n├── dude there are invigilators who take the job too seriously, some people are just sadistic like that\n│   ├── Bro one person didn't allow me to keep my water bottle cause it's not transparent, I had a feeling of dehydration all throughout my exam because i felt I always needed water, sometimes I keep water for the sake of it even if I don't need it\nImagine denying that\n│   │   ├── Why down vote this is a sensible Question\n│   │   │   └── Also I didn't downvote it someone else did\n│   │   └── This Is sensible this was there even in my school exams these things what you expect is too Much\n│   │       └── No because I am in this college for 4 years I have not once been asked to do this, this is the first time and it's ridiculous\n│   │           ├── But as Far as I Know this is a Basic Rule In Instruction Sheet only they Tell to Bring Only Transparent Bottles and Pouches are Not allowed\n│   │           └── I think you also Wrote Competitive exams four Years Back right or Board Examm the Same Rules are Followed in PESU Exams\n│   │               └── I understand for jee bro, PPL have insane ways of copying 😂 I just want my water cold so I have a thermos bottle during summer is very helpful to keep awake\n│   └── I am not taking any side here, but being sadistic has nothing to do with taking their job seriously. Back when I was in college, 30 mins was the limit for ESA and 15 mins for ISA. You cannot blame a faculty for doing their job and not letting a student beyond the permitted time limit.\n│       ├── there are some things then can let go off. teachers have harassed me before because my hair was open, that's such a silly thing, im obviously not gonna hide a paper in my hair 😭😭 and most other profs would be okay with certain things that some of these profs don't allow. of others are allowing it it means its not such a big deal. some profs DO take their jobs too seriously and yss it IS because they're sadistic. maybe you've been out of college too long to remember this.\n│       │   └── &gt;there are some things then can let go off\n\nThe 30 mins after the exam's start time *is* the \"let go off\" you speak of. 30 mins in a 3 hour exam is a pretty fair time period to allow late students to enter. After all, this is an exam and you cannot walk in at any time you want. I would like to see you do this for JEE or other entrances and still hold the security personnel accountable for you being late.\n\nAnd yes while I understand that some profs can be sadistic and annoying to deal with, its definitely not justified to label everyone the same. Profs take their jobs seriously not because they are sadistic but because that is what people do when they have a job - carry out their responsibilities to avoid consequences. Not everyone here is out to get you. Maybe once you start working and seeing others taking their jobs seriously, you will think twice before labelling them sadistic.\n\nAnd if you have been harassed by any faculty, reach out to the Dean. These incidents are not new and I am sorry they happened to you.\n│       │       └── okay but a lot of these people are simply rude. they treat us like we are beneath them and not human beings deserving of respect. he could've just said, im sorry but i can't let you in after 30 mins, but knowing him im sure as hell he was much worse and probably spoke super rudely to the kid. this particular man takes pleasure in seeing us suffer. i don't wanna dox myself so i wont say much, but he took away my phone and i had to follow him around to get it back, and when i did, he would ignore and me and walk away like you ignore beggars on the street. alot of professors and especially invigilators talk to us so rudely when they're asking us to check our pockets or telling us bottles aren't allowed. they don't need to be rude to do their job, but they are.\n│       │           └── If they are rude, report them. Visit the Dean of Student Affairs. The DoSA is pretty chill and understanding about student matters.\n\n[Like I commented](https://www.reddit.com/r/PESU/comments/1crqziu/comment/l40jwk8/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button), I do not support the apparent rude behaviour or the comments the faculty made. If it was indeed said, then yes it was out of line. \n\nHowever, I don't see anything wrong in the prof not letting the student in after the allowed delay time. They carried out their responsibilities. It was the student's responsibility to be on time, and that is exactly what I have iterated all over this thread: unless we know how late the student arrived, we cannot conclude who is at fault. If they arrived within the 30 min mark, then by all means, raise questions on PES and I will join you too. If not, why would the faculty be accountable for a student's late arrival?\n│       ├── I agree with you exactly\n│       └── Yeah I agree with you 💯\n└── We don't know how late he was yet right ??",
    "Rip",
    "Rip\n└── Fuhrer respects the dead 🫡",
    "fuel bright recognise ossified fertile capable wistful frighten fanatical quickest\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
    "wow. nothing else to say",
    "One of the sad reality to say that  exams are not needed to be conducted bcz PPL are almost gng to bed like unhealthy \n\n\nWaste clg and waste staff unfit for anything 🤬",
    "How late Was he to the exam",
    "This was directly caused by pes and they must be held responsible for it\n├── If you were given invigilation duty and the rule says after Some amount of time The Student is not allowed to take the exam You would just do the Thing which is given in the rule book Right.\n├── Why do you want to jump to conclusions before we have exact information?\n├── Not enough information to conclude this. If he arrived within the permissible time limit (30 mins after ESA starts), then he should have been let in. If he arrived after, the rule strictly says you won't be able to write the exam. If the latter has happened, you cannot really blame PES for following their rules.\n│   └── They told him he won't be eligible for placements.\nIs there no makeup exam?\n│       └── There are makeup exams. The threat was unnecessary [as mentioned in previous comments](https://www.reddit.com/r/PESU/s/dhEaDj52mb)\n├── They have rules and they enforced those rules. They did absolutely nothing wrong here Don't spread hate\n│   └── Are you serious? The invigilator knows very well if he gets a backlog he cant sit for placements, and yet knowing fully well, he barred him from entering, we aren't dealing with robots, we're dealing with human beings with a life.\n\ninfact the invilgilator single handedly caused this death\n\n  \n\"spread hate\"? brother this man died, because a teacher didnt let him write the exam and ur worried about me spreading hate??\n│       ├── He can sit for placement with a backlog whoever told u this crap is the real liar here because he's 3rd year not final year he can easily clear it next month\n│       │   └── But yes I agree the invigilator should have sent the lad to the coe not given life lecture\n│       ├── If he was denied entry after being late **even by the permissible amount**, then it is on the student for not arriving on time. Rules are established for a reason, you cannot show up for an exam whenever you wish to.\n\nHowever, its a completely different story if he was denied entry before the permissible delay time ended. Since we don't have any information on how late he arrived, its too soon to point fingers.\n│       │   └── Now this is incredibly heartless on ur part, dick riding can be done to some extent, too much dick riding is straight up sad.\n\nYou're going to blame the guy that died, and not the cold enforcement of said rules as though we live in a sort of dictatorship, as i said, we're humans, not pieces of code that must be perfectly on time with no delay.\n\nIf he had no valid reason to show up late, then its on him fine, but if had a valid reason if he had a reason for which he came late and his academic records are fine, then how is it on him?? brother stop dick riding for the love of god, idk how much they pay u for this\n│       │       └── Firstly, I don't get paid for anything and my opinions are completely my own.\n\nSecondly, I did not blame anyone. As I said, its too soon to point fingers. You are the one assuming that (1) he had a valid reason to be late and should have been permitted inside and (2) the invigilator should *not* have carried out his assigned responsibilities.\n\nThe instructions were known to everyone. The faculty was just doing their job by not letting anyone inside after the permitted time. The student arrived late for unknown reasons and was not allowed inside. How late? It is not clear. Thus too soon to say for sure who is at fault.\n\n&gt;as i said, we're humans, not pieces of code that must be perfectly on time with no delay\n\nAnd so are the faculty, who want to just carry out their duties without consequences of not following them.\n│       └── Teachers Just follow rules Given to them by Higher Ups Blindly\n└── What if he was an Hour Late\n    └── But it is on PES thu their app showed the wrong info and he missed his exam\n        ├── I don't mean to be harsh but how exactly is it possible for the app to show a single student the wrong timings but the correct one to everyone else?\n        │   └── Could be a server side error or something related to which admins can control or change\n        │       ├── Possible. Let's not comment about it actually being a server side bug without knowing if it actually happened.\n        │       │   └── Ya I do agree with u\n        │       └── Please read what I have said I said what if there was a Rule that after the exam Starts if you're late to the exam by More than 30 Minutes obviously the Teacher wouldn't allow you write this is Not only in PES but in Every College Exams.\n        │           └── 30 minutes is the rule time for ESA. It is already mentioned on the instructions booklet. Do not blame faculty or anyone without proper information.\n        ├── I faced Login issue in one of the ESAs and they Called the people and fixed it\n        ├── They might have tried calling PESU Academy People\n        └── No even in our exams many people find login issue but they fix it by calling the PESU Academy people\n            └── This wasnt a login issue but the information given is wrong and its on pes because the academy ppl do come under the whole umbrella of pesu\n                ├── Why would the Teacher Bar Him from Writing the Exam the reason they Wouldn't have let him Is it would be a Rule and Teachers Follow Invigilation Rules Blindly So that The Teacher Doesn't Get questioned Later On.\n                ├── Like see What if they Had rules that they Wouldn't be allowed after 30 Minutes\n                │   └── Bruv according to [this](https://new.reddit.com/r/bangalore/comments/1crs4aw/pes_university_suicide/) a post from r/bangalore he had come on 9:00 but the goddamn exam started at 8:30 am which more or less within the permissible time limit and the professor should have refrained themselves from speaking rudely to the person and asking them to go to the HOD and ask them for extra time.\n                ├── I think Teachers only would have Informed this in First Year Second Year\n                ├── During Classes they Might have given this Instruction\n                └── Otherwise Why Would the Teacher Bar. Teachers Blindly Follow the Rules Given to them For Invigilation",
    "Not all the club heads and 4th year students desperately downvoting others and even saying things like 'dont spread hate about college'. Looks like they got an order from their masters to downplay this incident like the last 3 sucides\n└── We all know the fucking master who dances during AT.",
    "Lore is they Tryna hide the body, how true it is?",
    "To those arguing 'They were just following rules,' or 'It's not PES's fault,' I ask: Whose fault is it then? FOUR suicides in less than a year!   \nYes, rules exist, but when they lead to such tragic outcomes, they warrant scrutiny. Why is this happening at PES when other colleges have rules too?   \nThe institute should delve deeper into the root causes and take meaningful actions to prevent further loss.",
    "There’s no way he was denied entry because he was a few minutes late, I myself have been late by 20 mins and been allowed, I’ve seen students even entering after 30 mins and being allowed. Stop spreading hate on the college and Rowlet Sir without knowing the full details of the incident.",
    "Today my friend came 25 minutes late. He was allowed to write exam. I don't see why a faculty would restrict you??  \n30 minutes is the time allotted until which a student can come inside. \n\nI feel students should have more self power within themselves and control over their mind. Death is not the only solution to everything in this world",
    "Even in Exams Like JEE-MAINS,KCET They have a rule if you come late by some amount of time you can't write the exam\n└── Those are exams conducted on a national scale and they have lakhs of students writing them and people dedicate an insane amount of time to JEE and KCET, there's far more at stake there(not denying how even the ESA paper being linked to placements is not worth something though) and maybe the rules mattering should make sense.\n\nWhen you look at a small exam such as an ISA or an ESA paper which is regional and localised to just our college, you can't expect there to be such strict rules where a person could be late and have a teacher tell him/her things about how he/she is not eligible to sit for placements, one of the biggest reasons one even joins BTECH.\n\nIf you're that insensitive where you think that every human being should live by a rule, it doesn't make them human, it makes them a machine and that's just an insane level of delusion on your part where you think that a student is completely perfect.\n\nYour argument is baseless and completely delusional, someone has lost their life and you're bringing up two very different things into the play here.\n\nThis is equivalent to me comparing narendra modi leading a country worth 1.4 billion people to a 5 year old child leading a pack of his other 5 year old children at a park.",
    "Teachers Just Blindly Follow Invigilation rules Given to them Otherwise why would they even Do this\n├── You clearly look like you're on PES' payroll, i mean i absolutely don't understand what's your motive behind commenting on every single post about this incident at all the subreddits and saying not to drag the college and questioning the guy who has already passed away. Show some fucking empathy will ya? \n\nYes teachers blindly follow orders but does the management tell the teachers to be brutal and be a bunch of assholes towards the students? I guess not.\n\n\"Otherwise why would they even Do this\" - I guess you didn't learn anything regarding Aditya Prabhu's case, it was PES' mistake, and this incident too is PES' mistake. \n\nThat particular invigilator had plenty of options where he could have called the boy aside and talked to him with a bit of care assuring that \"things are going to be okay and if he is late then he should be barred from the exam as things are not in my hand and it is a rule stated\" yet he chose to say harsh things to that poor boy like he won't be able to sit in placements and all, if he had spoken to him with at least a bit of care and concern then who knows he would have been alive now and might have not taken such a step towards ending his own life. \n\nYou are sitting somewhere commenting such shit, do you not know how precious a life is? Huh? Mark my words, be compassionate towards the person who lost his life and stop commenting such shit and questioning a person who's not alive anymore.\n└── Dude I've been seeing you here for months, defending PES under every post like it's your job. Seriously go outside.\n    └── This guy is chronically online",
    "How Late was he to the exam Hall any details on that??"
  ]
}