{
  "title": "Are PESU rules and academics that strict?",
  "content": "I just read the incident regarding the suic*de of a student because of coming late. And it the fourth within a year, it concerns me a little as I'm planning to get admitted in the coming semester.\n\nPlease don't get my intentions wrong here, I'm genuinely concerned.",
  "metadata": {
    "id": "1cs1egk",
    "author": "Src_oscar",
    "url": "https://www.reddit.com/r/PESU/comments/1cs1egk/are_pesu_rules_and_academics_that_strict/",
    "permalink": "/r/PESU/comments/1cs1egk/are_pesu_rules_and_academics_that_strict/",
    "score": 19,
    "upvote_ratio": 0.92,
    "created_utc": 1715716392.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "No you are totally getting it wrong.\nFor today's case\nOur college allows us to exit the exam hall after 30 mins from the commencement of the exam, and so he came around 30 mins late, and thus invigilators thought this guy could do cheating hence he wasn't allowed.\nBefore this particular case the last 2 were not related to academics (as far as I know).\n└── I see\n    └── Imo all the sui*ides could've been prevented if PES was a bit lax with its operations. One way or the other, PES contributes (negatively) to the mindset and mental health of all the students.\n\nThat being said, you really can survive or maybe even thrive here, as long as you find a domain you like and have a good friend circle. Nothing beats chilling with the mates after a hard day at PES.\n        └── From what i have seen other college have it worst . We atleast get saturday off to chill. As much as the college should work on these stuff the student should work on their mental health too ...",
    "Yes, PES is stricter and academically more rigorous than most other colleges in the city. If you read this subreddit you'll find a lot of posts that rant about how things are. \n\nThe management (or basically, mismanagement) is a shitshow here. With the number of bad decisions they've taken right from COVID in 2020 to these suicides, it's difficult to give examples of right decisions. The faculty is mostly average at best. There are a few exceptions of great profs but it's unlikely how long they'll stick around. Research is basically dead. Clubs are mostly one semester wonders. Fests are okay for the most part. Campus quality is subjective so I won't comment on it. The fees has been exponentially bloating every year and does not justify what you pay for. One thing to also note is that most colleges in the country share atleast 90% of the problems that PES has, so you will probably find similar problems everywhere.\n\nHowever, PES also does get a lot of things right. It's syllabus, atleast for most courses, is pretty up to date. Courses tend to have a good emphasis on hands on learning through projects, which are challenging for some courses. Despite the market, it still had a good placement cycle in these circumstances. The infrastructure (atleast in RR) is pretty great. Some of the profs here (although only a handful) are really great ones - a lot of students personally reach out to them to work with them as TAs and RAs. Most people also do not face any sadism or get picked on by profs, these are pretty rare incidents, although they can happen. It also has a great crowd of not only present students but also alumni who are either working at major companies or pursuing Masters at top Universities. \n\nSo it's not exactly black or white. There are always positives and negatives. This subreddit is an echo chamber and negative incidents tend to be louder than positive ones, that's why you won't find too many people talking about the positives. The recent list of bad decisions following the suicides also (understandably) makes it difficult to not be angry or emotional and have a neutral point of view. However, personally, I would not recommend this place until there are some changes. It's definitely not worth your PESSAT/JEE quota fees. CET is probably okay. If all you're looking for out of college is to blindly pass through 4 years and secure a good job, only then would I probably say this is the place for you. \n\nTo conclude, yes, the stories are pretty accurate, maybe a little exaggerated. But it's not as bad as this subreddit makes it seem. There are both good apples as well as bad apples. Sometimes people pick the wrong one and it leaves a sour taste. People have a mostly mixed opinion on this college at the moment. There are problems, some bigger than others, but bad incidents aren't as common. This place is definitely not the hellhole as described here, but also nowhere near what it's reputation deserves it to be.\n└── This is so well written, and so accurate!",
    "Better off In bms or some is my conclusion even I was desperate to join here but seems like teaching and faculty and management is shit in pes it’ll just give u a hard time for next 4 yrs. No clg life either\n└── It's not shit in my opinion even I am a student who attends classes"
  ]
}