{
  "title": "People Using College Buses should stay till 6?",
  "content": "My distant cousin is in pes ec and i remember him telling that he doesnt use the bus transport since they have to wait for the degree students as welll and their classes end at 6 is this true?\nFor Both the Campus'?\nCant really ask him as i meet him once in 5 years\n \n(Also suggestion to mods to have like a question Thread pinned so that all the people who havent joined yet and have doubts can post it there and students can answer in free time atleast till counselling gets over instead of annoying seniors by filling their feeds with lame questions for example this one)",
  "metadata": {
    "id": "1csv113",
    "author": "[deleted]",
    "url": "https://www.reddit.com/r/PESU/comments/1csv113/people_using_college_buses_should_stay_till_6/",
    "permalink": "/r/PESU/comments/1csv113/people_using_college_buses_should_stay_till_6/",
    "score": 9,
    "upvote_ratio": 0.91,
    "created_utc": 1715805179.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "You'll have to wait till 5",
    "Since a year or so the buses have left at 5. They used to leave at 345/4ish but not anymore.\n└── When do classes end btw? For cse students\n    ├── The timetable has changed recently so I'm not sure. (It's fully online for 4th years). Ask any 3rd or 2nd years.\n    └── In sem 6, they got over at 4PM on two days of the week(varies across classes), 1:45PM on the rest of the days. In sem 5, classes got over at 1PM on two days of the week and 3 on the rest of the days. Apparently they're switching the timings for branches based on whether they're having an odd or even semester from now on. \n\nYou're better off asking a first year though since they fall under a different department and had different timings.\n        └── Forgot to ask \nEven if classes get over at 1 pm we will have to wait for bus till 5?\n            └── Unfortunately yes. Of course, you can leave earlier if you want to. A Bus Stop is nearby and because of the number of people in PES, you can easily form a group of 2-3 people going the same way.",
    "People might have trouble getting a Reply since people have to filter new comments though"
  ]
}