{
  "title": "Have you heard of 'RULES IN PES'?",
  "content": "I need to talk about this to know if any of this makes sense.  \n1. People cannot participate in **cultural/fest competitions** through clubs(EC) if their GPA is below 7\n\nI know amazing dancers and singers who have not been able to go out and showcase their talent in extra-curricular if they're not up to the mark in academics\n\n2. Student council is not elected by students? (genuine question since idk how the student body is chosen)\n\nAdd onto more things that don't make sense in PES..",
  "metadata": {
    "id": "1cu2sa0",
    "author": "Mother-Pomelo2815",
    "url": "https://www.reddit.com/r/PESU/comments/1cu2sa0/have_you_heard_of_rules_in_pes/",
    "permalink": "/r/PESU/comments/1cu2sa0/have_you_heard_of_rules_in_pes/",
    "score": 42,
    "upvote_ratio": 0.98,
    "created_utc": 1715945188.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "Wait, we have a student council?\n├── 'Student body' is what we call them. It's perfect actually they don't really seem to have heads\n│   ├── Probably its existence is similar to non-existing. I never knew it existed until I saw a LinkedIn profile of a senior who was head of it in Ec campus, unlike other college it is very dead. Or maybe they do work but don't advertise.\n│   └── No that have heads... currently there are 3 heads..\n├── yep... VK releases application to be the head of student council once in every year.. basically being a head means u will work closely with VK sir and are incharge of almost everything happening in the campus\n│   ├── The previous heads choose next heads. For the last 6 years, its been monopolised by heads of E-Cell\n│   └── Yeah, they work closely with management, not only with VK sir. VC and all will be in close contact with them mainly for fest stuff or something\n└── Yeah there exists a **Student Council** that is headed by the so-called AATMATRISHA HEADS. So, they will be in-charge of organizing the whole fest and also taking care of all clubs in campus. \n\nAs of now, there are 2 heads each at RRC and ECC.\n    └── They're also supposed to be our first point of contact for all club related stuff as well. Fests are handled majorly by the 'fest heads', again idk how they're chosen\n        └── They are chosen after an interview conducted by the management. It has panelists as VC, VK sir and so on. They have to follow a strict code of conduct.",
    "Just count your days there coz it’s all bullshit there and will always be since it has been autonomous, I had taken a complete package of torture (college + hostel) and suffered for almost 4 years, entire batch used to come during covid with their recent 72 hrs report in hand, did it make sense during the 2nd wave? No, did management do anything about it? No. Can you do something about it, possibly, but it will waste a lot of yours time, so just keep your head down and count your days backwards until you leave that hell.\n└── Lmao still remember the days when they called kids infected with COVID as \"COVID kids\" and permitted them to write exams with other students in the same block\n    └── Yeah bro, like the maximum level of insensitive culture, I honestly feel sad for the teachers, we would max be out of that 2 building so called “campus” in 4 or 5 years but they have suffer daily :(",
    "Why do we need to send satish sir nudes as the assignment???! We have don’t have to do this in any other class\n├── aye bro is this fr?  \nim might reconsider joining then\n├── Wait we *don't* have to do it for other courses too?\n├── You mean notes right? RIGHT?????\n├── WTF?!\n└── Is that a typo??????? I'm so confused",
    "Are these new rules? My frnds and I didn't hv 7 cgpa until our final year and we participated in a lot of club events and even hosted a few as part of our clubs. I don't understand what the point of this rule is. Is it to demean and put down people who are already not good at academics and make them feel even worse? Why should academics have anything to do with cultural events lol. If they want better results, let them get better professors and give us easier exams like every vtu college has lmao. And get rid of the damn bouncers. We're students, not criminals. There's no need for bouncers in an engineering college\n└── Maybe create a separate B. Tech (Hons) where exams and courses can be harder and make regular B.Tech exams easier like every VTU college has.",
    "Maybe that’s why they should create a B.Tech (Hons) that can have these rules but students that opt for the regular B.Tech don’t have to be constrained by such rules.",
    "I'm just confused if there are soo many downsides to PES why does everyone regard it soo high and as such a good college and high cutoffs?"
  ]
}