{
  "title": "Pessat and PESU doubts",
  "content": "I just wrote my pessat and cet this year and am thinking of joining PESU for ECE. Here's a list of doubts that I have regarding Pes University Ring Road Campus. \n\nPes books: As I have heard that the college is an autonomous one, does it have it's own syllabus and books?\n\nPes lunch: Being a localite myself, I don't intend on stay on campus... Do they allow outside lunch boxes and stuff inside the campus or are we supposed to eattheirc cafeteria food? (Also please give a rating on the cleanliness and taste of the food there) \n\nPes exam pattern: How often do they conduct exams and how difficult can the papers and/or their correction be? (Heard from a few ppl that they don't get marks easily  as in correction isn't too lenient) \n\nPes professors: It's not like I haven't heard about the unfortunate incident(s) that have occured in this college, but I just want to know whether their teaching quality isgas good as I have heard (talking from ECE perspective here) \n\nTransportation: Are there bus facilities to and from the college? If so, how regular are they? And how strict is the college regarding punctuality? \n\nWill I get fees concession on fees if I go through pessat with a rank of 8xx? \n\nPS. Let me thank anyone who spent their time reading and answering these doubts!! THANKS ALOT",
  "metadata": {
    "id": "1curh3i",
    "author": "violentmilkshake72",
    "url": "https://www.reddit.com/r/PESU/comments/1curh3i/pessat_and_pesu_doubts/",
    "permalink": "/r/PESU/comments/1curh3i/pessat_and_pesu_doubts/",
    "score": 15,
    "upvote_ratio": 1.0,
    "created_utc": 1716015739.0,
    "flair": "PESSAT/Admission",
    "nsfw": false
  },
  "comments": [
    "&gt;Pes books: As I have heard that the college is an autonomous one, does it have it's own syllabus and books?\n\nYes, it has its own syllabus, fairly updated every year. Not sure what you mean by \"own books\", but it follows well-known standard books for courses. There are more details about syllabus on the FAQs (check links for study material and Pros and Cons)\n\n&gt;Pes lunch: Being a localite myself, I don't intend on stay on campus... Do they allow outside lunch boxes and stuff inside the campus or are we supposed to eattheirc cafeteria food? (Also please give a rating on the cleanliness and taste of the food there)\n\nYou can carry your own food, nobody will stop you. I used to carry my lunch every day too. Cafeteria food has been significantly upgraded since I was at PES, so maybe wait for someone to add on to this answer. Back then it was decently good and mostly clean.\n\n&gt;Pes exam pattern: How often do they conduct exams and how difficult can the papers and/or their correction be? (Heard from a few ppl that they don't get marks easily as in correction isn't too lenient)\n\nISAs held twice a sem, ESA once a sem. Each course also has assignments/projects/labs. Difficulty is subjective, depends on course to course. There are courses in which everyone performs well, and some in which everyone screws up. But exams do require effort and **consistent** hard work. Most of the people who get a 9+ do it by putting in effort periodically. Overnight study usually is not recommended since you will not be able to score well, you have to study a few days in advance. Corrections are usually standard, most people get what they expect. It isn't lenient, but isn't strict either.\n\n&gt;Pes professors: It's not like I haven't heard about the unfortunate incident(s) that have occured in this college, but I just want to know whether their teaching quality isgas good as I have heard (talking from ECE perspective here)\n\nCannot answer much about ECE since I was in CS, but most faculty in all branches are average at best. I think EC campus has better faculty for ECE though. Best to wait for someone else to comment. Although one thing to note here is that the campus incidents shouldn't really be taken as a generalisation. Most students don't really face any form of harassment or abuse over their 4 years here. Its just unfortunate that whenever something has happened, its happened at a large scale.\n\n&gt;Transportation: Are there bus facilities to and from the college? If so, how regular are they? And how strict is the college regarding punctuality?\n\nThere is regular bus service, best to enquire at the transportation department about timings for your location. If you live near the purple line metro, its far easier to travel via metro though since RR campus is like a &lt;10 min bus ride from the closest station.\n\n&gt;Will I get fees concession on fees if I go through pessat with a rank of 8xx?\n\nThere are no scholarships for PESSAT performance if I am not wrong. However, there are scholarships for your academic performance in each semester such as being either in the top x% of the department or even batch. You can find these details on the PES website.\n\nI would recommend joining the PESU Discord server (link in FAQs) to ask current ECE kids about branch-specific doubts.\n└── Thanks a lot for the feedback!! I really appreciate ppl like you who take time to answer other ppls' questions with so much detail!! 🙏🙏🙏",
    "1. You dont require any hard copy books, professors will provide you the slides which will be more than enough. The soft copy of the textbooks will be available in PESU library website or discord group.\n2. You can carry your own lunch, there will be canteens and eateries inside and outside college.\n3. For each subject you’ll have two intervals aka ISA and one End semester exam along with a couple of assignments/projects depending on the subject, usually ESA accounts for 50% of your grade and the rest is split between ISA and assignments. The ISAs are generally easier to score compared to the ESA. \n4. Since I was in CSE can’t comment on ECE teachers.\n5. Contact the college for the bus details, they usually cover entire BLR, they have also metro feeder buses to and fro from college to Mysore Road metro station which is available free for all students.\n6. No concession now but you score well in your semester exams and get in the top 20% to get back 40% of your fees.\n7. Regarding attendance you got to maintain 80% and it is enforced strictly.\n\nIf you have any more doubts you can DM.\n├── Do you have any idea what the Pessat fees is currently for BTech courses?\n│   ├── https://pes.edu/fee-details/\n│   └── CSE / CSE-AIML : INR 480000  \nECE : INR 420000  \nME / EEE / BT : 380000\n└── It's 75% now",
    "1. There are no PES University published books as such. It has its own syllabus. Every subject has a set of textbooks prescribed by the university. (Applies to all branches and courses)\n\n2. Yeah, they do allow outside lunch boxed. In canteen, that is the GJB new canteen, the food is pretty good on FC Side, but Hallimane is worst, please don't eat there. (Applies to all branches and courses) \n\n3. Exams happen three times in a semester -&gt;   \nIn semester assessment 1, In semester assessment 2, and End semester assessment. There will be lab exams, assignments over this which will be added to your SGPA / CGPA. Difficulty varies based on subject. in ECE, most subjects are difficult (and useless). Since the papers are set by PESU faculty, they are usually very tough in ECE. CSE I am not sure but it depends on the subject  \n  \n4. In ECE there are very few quality teachers. Many good ones have already left PES or retired. Sad reality of ECE is that you learn the good things only at the end of engineering while CSE people would have learnt it before itself. \n\n5. Enquire in transportation department. \n\n6. There is no concession on fees on PESSAT exam. You have to pay the full fees. \n\n  \nJust a suggestion, **do not join ECE in PESU RR campus**, but if you really want ECE try out at EC Campus, but mind you, in EC Campus there are more cons of joining ECE as well, although there are more cons of joining ECE in RR campus itself.  One more suggestion is, **Do not join PESU via PESSAT**. I suggest you give a try in CET. PESU is not worth the skyrocket \"PESSAT Fees\".  \n\n\nWish you all the best :)\n└── &gt; **do not join ECE in PESU RR campus**\n\nWhy do you say that ECE in EC campus is more preferable than that in RR Campus. \n\nI'm asking this mainly because\n1. RR campus is MUCH closer to me commute wise than EC Campus\n2. I've read opinion elsewhere that the coaching in general in RR is better than that of EC\n3. Also that RR Campus apparently has much better connections with core companies and has better campus placements\n    └── Speaking about RR campus\n\nA) The Professors are average at best. Most good professor left during peak covid time. The ECE dept in general in RR campus is disoriented \n\nB) Placements of ECE are not good . While this is true in Most engineering colleges , pes is no exception to that . This season only 30% got placed in ECE dept with highest as 24.62 and median 8.5 ( Only 20 out of 551 ECE students got T1 placements ). Yes this time market was bad and placements was bad in general but usually it is not better by any significant margin for ece.\n\nC) The Labs and Facilities are average / bad / terrible if you wanna do ECE properly. They just have enough equipments and facilities to conduct small experiments for your coursework . Even to use what is left of those in the labs, you have to go through a tedious process to gain access to use the labs which is just a waste of time ( They just gaslight and catfish you into projects which can be made by even beginners who grasp a decent amount of Hardware , microcontroller and sensors knowledge and they just  showcase that. (IEEE RAS club  is the only one with access  but honestly speaking their projects are not something really great or noteworthy to be mentioned based on seeing their work but they are functional and receive decent funding )\n\nSpeaking about EC campus \n\nA) Same as RR\n\nB) Same as RR\n\nC) From personal experience the ECE crowd and the labs and facilities  in Ec campus for ECE are better. The famous CHIPS lab is present in EC campus\n        ├── Adding on, in one of my previous comments, I have added the image with placement statistics of ECE - \n\n[https://imgur.com/a/ece-placements-pes-university-uwBG6en](https://imgur.com/a/ece-placements-pes-university-uwBG6en)\n\n[https://imgur.com/a/q6oG1v1](https://imgur.com/a/q6oG1v1)\n        └── When you mention only 30 percent of ECE got placed does it mean the 30 got placed in core companies or does it also include CS placements in which ECE students got placed in?\n            └── Everything 30% including core companies and The CS placements ece students got in",
    "I'm a PES final year student and whatever i say comes from my 4 yrs in this place\n\nPes books: No one really buys the books for any subject in a particular year cuz its pointless to buy books for a semester when the semester lasts like 4-5 months max..I bought books in the 1st sem and it was a total waste of money...The college does provide you slides and other material to prepare for exams so youre covered plus the really make you take notes in classes so that should help too\n\nPes lunch: I'm from the Electronic City campus and we have decent lunch offerings there's a canteen and a mess for hostel people and as i hear there's much more better food facilities in RR campus due to the recent renovations\n\nTransportation: There are bus facilities but depending on where you live the bus timings can get pretty early..They are regular and VERY strict if youre not at the stop when the bus comes they aint waiting around..they'll takes the kids who came and buzz off so you'll have to be hella punctual..i'd say just get a vehicle if possible it doesnt make sense to show up to college at 7 when classes begin at like 8.30\n\nDepending on your gpa you do get some discount off your fees but these bastards make it so impossible to claim.\n\nif you do get some scholarship amount you can only take it by creating a union bank account\n\n  \nPS: If youre sure about taking ECE mind you no matter what campus youll have you grind your ass out and maintain a decent cgpa to have any aspects in placements for a job cuz rn i know a lot of students in ECE who\n\nare 8.5&gt; in gpa and still can bag a decent job offer"
  ]
}