{
  "title": "How do I get a management seat for cse ",
  "content": "I couldn't get a good rank in pessat (around 13000),and i am interested only in cse or computer science related degree, now what's the process , and the donation for management seat for cse or such courses and how likely is it that I will get in?",
  "metadata": {
    "id": "1cvfg90",
    "author": "SpareSyllabub3020",
    "url": "https://www.reddit.com/r/PESU/comments/1cvfg90/how_do_i_get_a_management_seat_for_cse/",
    "permalink": "/r/PESU/comments/1cvfg90/how_do_i_get_a_management_seat_for_cse/",
    "score": 11,
    "upvote_ratio": 0.92,
    "created_utc": 1716091139.0,
    "flair": "PESSAT/Admission",
    "nsfw": false
  },
  "comments": [
    "Pes CS 10lac plus 12lac yearly fee \nEC 7lac plus 7lac yearly fee\n├── Wait so basically to get a MQ CSE seat at RR, it's 12*4 + 10 = 58L? \n\nHoly shit how do people justify paying ~60L for an undergrad degree from PES? I paid 12.8L in total a few years ago for a PESSAT CS seat and we used to discuss how expensive it was.\n│   ├── Tbf it's not for middle class PPL. all the people who go to pes by management quota are very rich\n│   │   └── Yeah I have friends from various parts of the country that joined through MQ, they're all loaded as fuck. I don't think the higher fee is a cause of concern for them.\n│   └── They can justify it because there aren’t many alternatives. PES and RVCE are basically the only good colleges in India for engineering that offer admission through management quota.\n\nRV’s management quota is even more expensive\n│       └── Do you know how much a CS seat costs at RVCE, BMS and MSRIT? Just trying to get an estimate for comparison, even approx figures will do\n│           └── BMS -\nCS 56.5lac overall package. 16.5lac donation.\n\nRamaiah -\nCS 48.5lac donation 274000/- yearly fee \nEC 16lac donation 274000 yearly fee\n\nRV college -\nCS 32lac DD plus 6.5lac first year fees, 12lac from second year\n\nEC 16lack DD  plus 5lack first year\nSecond year 7 lac\n│               └── The fees for RVCE CSE through management is 68 lacs it's mentioned on their own website man\n│                   ├── Ya it depends on the number of seats available. They increase the price drastically with amount of seats\n│                   └── Bro they have development fees also.\n└── Wait they started taking donations now?💀\n    └── Yes they always did . They change the name of donation to development fees",
    "I got in thru MQ and rn in 2nd sem …when i got in last year i had to pay 11 L yearly fee and no extra donations besides that …11L for Cs and aiml peeps , for Ec it was around 7L prolly and also u might not get any seats in Cs if you go now coz of the demands …coz i myself got in before my cet results came out and i only got a seat in aiml at the last moment lol…… (advice: after spending a year in this cllg, id recommend anyone’s who’s thinking abt getting in thru MQ to think over once again, get in only if you’re ready to bust your ass studying and working hard coz the exams,tests, and their tight schedules isnt a piece of cake for everyone and plus invest only if you r truly passionate abt the subject else its a waste of money and time)",
    "Would highly recommend not joining via management quota. The fees isn't worth it.",
    "It's not worth it dude"
  ]
}