{
  "title": "Remaining seats left after round 1 counselling",
  "content": "",
  "metadata": {
    "id": "1d06c49",
    "author": "Unique_Hamster2734",
    "url": "https://i.redd.it/h76uk0i9vi2d1.jpeg",
    "permalink": "/r/PESU/comments/1d06c49/remaining_seats_left_after_round_1_counselling/",
    "score": 43,
    "upvote_ratio": 0.98,
    "created_utc": 1716620897.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "Yo keep giving us updates pls\n└── I’ll try my best to\n    ├── Whats the update now?\n    │   └── Ai mL done Ece rr almost done but I just left the college\n    │       └── At what rank did aiml close\n    │           └── 1735\n    └── Is the attendance normal or less ppl due to advanced\n        ├── It’s less man like I got rank 134x but still got cse ai mL. But people are still showing up and they allowed students to come just to take fingerprint and head home to read for advanced and the parents can finish up the rest of the stuff\n        │   └── Oh no 😭, if less ppl show up I can expect a seat (further round)\n        └── Morning session of 1500 invited about 700 showed up and maybe 10 were deferred as well",
    "As a senior, I'm appalled to see that 36 seats have been allowed for EE and ME.\n└── Bro biotech is not even there💀",
    "Although aiml had more like 90 seats left after round 1",
    "ec campus, aiml, closin rank 0? what does that mean\n└── it says last rank is 0. which means no one has chosen AIML in EC yet\n    └── ohh ok, thanks.",
    "i was shitting myself😭😭 but yeah got in cse",
    "Cs rr closed at 1050\n└── Yup and ai ml closed around 17 something if I’m not mistaken",
    "Dude u could wait for few minutes more then my photo would be there in the screen 😅😅\n└── Even if had waited little more I would’ve been on screen lol 😜 what was your rank?\n    └── Ohh 😂\nMy rank is 1387 wbu\n        └── 1384 you came just after me I think\n            └── Ohh🫂😂",
    "Can someone update me on the  seats remaining for day2 of counselling",
    "Updates?\n├── I left man I’m sorry\n└── Just closing ranks?",
    "Hey, if someone didn't apply for first round can they go for the second round?",
    "Any placement data shared during presentation.",
    "I got 20X rank and kept this as a backup when is their next counselling",
    "Ay what happened to biotech and mechanical",
    "My pessat counselling is in 3rd batch do u think any cse seat in ec campus will be left by then\n├── na not likely by third round last time only mechanical and bt seats were left\n└── What happened bro?"
  ]
}