{
  "title": "ec campus girls hostel query",
  "content": "i read the rules and regulations of the hostel and it says stuff like grp study prohibited, cant use phone after 11 pm, laptop can be used only with permission, no leaving the room, no borrowing sharing calculators and other stuff etc etc... is it really that strict?",
  "metadata": {
    "id": "1d10epj",
    "author": "draught0fLivingDeath",
    "url": "https://www.reddit.com/r/PESU/comments/1d10epj/ec_campus_girls_hostel_query/",
    "permalink": "/r/PESU/comments/1d10epj/ec_campus_girls_hostel_query/",
    "score": 16,
    "upvote_ratio": 0.9,
    "created_utc": 1716726937.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "It's not as strict as the rules and regulations that are mentioned but the warden has mood swings, she's very very fake. In front of your parents she'll be so fucking sweet and then once they're gone she shows her true colours. \n\nThen again this is just my opinion: it's better to stay in a PG which is closer to the campus. Anyways there's no girls hostel inside the campus (which is kinda ridiculous if you think about safety)\n\nAlso, the warden does NOTHING if you go to her with any problems related to your room or your roommates. She doesn't understand most of us. And honestly, 6:30pm is a really shitty curfew to be stuck in a hellhole for.\n├── i guess ill have to manage this year then move to a pg next year 😭\n└── And if we want to stay outside past the curfew time what do we do?( Considering we have a local guardian)\n    └── Elaborate permission procedure you have to sign some stuff your lg has to come to pick you up",
    "most of those rules aren't real but the warden IS a b*tch and she will make your life hell. do yourself a favor and pls don't come. ill elaborate if you want in the DMs.\n├── If you elaborate here in a separate comment it'll help everyone out. I can also add it to the FAQs, since hostel is a pretty common question.\n├── Elaborate here only no :)\n└── yes please do ill dm",
    "I have seen girls getting suspended for being drunk at girls hostel while pandu(the boys warden) was quite chill even when he caught a few guys. The girls warden used to literally scold them for having conversations with guys in my time. Once the guard caught them playing uno with guys and took a picture of them, sending it both wardens, pandu laughed it off while the girls warden was really serious abt it",
    "Yes pls someone tell what it's like at the hostel? Curfew and all the rules that one should know before getting themselves into the hostel",
    "Damn thanks so much this clears a lot for me",
    "this is real",
    "boys hostel is chill af, we have so much fun, idk about you people..."
  ]
}