{
  "title": "Minor course ",
  "content": "1)Is summer minor course use full?\n2)Currently I am writing 2nd sem exam my ESA will get over on 17th june but minor course class is starting from 10th June will i be able to join?\n3) will it be useful for ECE STUDENTS?\n4)as a ECE student which course among this will be useful for me?\n\n\n",
  "metadata": {
    "id": "1d1punl",
    "author": "Academic_Tax8051",
    "url": "https://i.redd.it/b1wsbhyyky2d1.png",
    "permalink": "/r/PESU/comments/1d1punl/minor_course/",
    "score": 7,
    "upvote_ratio": 0.73,
    "created_utc": 1716811146.0,
    "flair": "Study Help :table:",
    "nsfw": false
  },
  "comments": [
    "1. Yes, it is very much useful, most importantly for placements  \n2. You need to ask that in your department, or talk to Minors in CSE - Co-ordinator - &gt; V R Badriprasad sir  \n3. Yes, it is a great platform to learn CSE subjects for ECE Students!!  \n4. I would say, start off with Data structures (1st one in this image)\n\nAll the best for your ESA and ISA!\n├── Thank you 🙏😊\n└── I’d like to add one more thing. While the minor course is pretty helpful, it’s just a base you can use to start. Don’t entirely depend on it and make sure to practice coding. The course mostly deals with theory and it’s up to you to practice on Leetcode, etc",
    "Go for OS or DAA. There are tons of yt channels for DS and DBMS. I'm not saying taking any of the courses will definitely help you, but having some familiarity at this moment will help you when you actually want to learn the related core concepts of CS when you are preparing for FAANG level companies. \n\n1. OS: u must know the OS concepts, but there are good online resources \"easily available compared to DAA\"  \n2. DAA: Will help you understand how algorithms are built, some history how they did it earlier, how nature uses math &amp; algos like sworm optimisation etc. Wouldn't recommend until u have at least intern level proficiency in coding.\n\n coding Gods, correct me if you think I'm wrong.",
    "if u are an ece student do dsa must\n└── Please tell the full form",
    "Are you from EC campus? If so, choose DS or that's the one that ma'am will choose for u. A minimum strength of 30 is needed for the course to be offered and everyone this time is taking DS. So even if you take something else, ma'am will call you and tell you to change to DS. Data structures is a very useful subject to you too. Most cs interviews have DS questions. It's very important if u wanna get a cs job",
    "ALL THE ABOVE COURSE ARE 5 CREDIT"
  ]
}