{
  "title": "Laptop Suggestion",
  "content": "I will be studying cse-ai&amp;ml, and would do light editing and no gaming at all so please suggest a laptop for same, within the range of 70K-80K. It should be portable, and must be worth for the money invested.",
  "metadata": {
    "id": "1d2a5y4",
    "author": "[deleted]",
    "url": "https://www.reddit.com/r/PESU/comments/1d2a5y4/laptop_suggestion/",
    "permalink": "/r/PESU/comments/1d2a5y4/laptop_suggestion/",
    "score": 7,
    "upvote_ratio": 0.82,
    "created_utc": 1716867433.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "Hands down MacBook.. but decide whether you need extra power or not.. MacBook Air is fabless and pro is with fan \n\nDisadvantage of MacBook is it cannot be upgraded (ram,storage)\nRepair will be expensive.. take care of it like your own child \n\nAdvantage \nOut of the world interaction experience the sound, screen quality, the keyboard, touch pad \n\nAmazing battery life lasts almost upto 2 days on normal use \n\nUsing VMware you can now download windows only softwares on virtual machine so it’s no more a problem \n\n\n\nIf you are going with mac , please spend atleast 2-3 days researching and understanding which type of user you are \nMac air or Pro and read reviews for the same \n\nHaven’t regretted a day with mac \n\nIf not mac.. there are some great windows machines as well \n└── How are the student discounts on it.\n    └── Pretty less actually.. it’s bad in India.. say they give a discount of about 4000 \nIf you claim gst aka buy in a business name u will get 18% of the price back as discount ",
    "There's a detailed previous comment on how to go about buying a laptop for college in the FAQs: https://bit.ly/pesu-faq\n\nBut to summarise, don't go for a gaming laptop. Get a laptop with SSD, atleast 16GB RAM, whatever the latest processor is, good battery life and since you mention editing, an entry level GPU (Nvidia only) too. I would also recommend getting a Windows machine and dual booting Linux on it because people still face a few issues running some software on MacOS. Configuration like storage, display size etc are up to you. \n\nAlso since you're in AIML a lot of people will suggest maxing out on GPU and going for a gaming laptop. Don't listen to them. Odds are you will never actually train models locally and depend on Collab/Kaggle instead, which provide 3x the amount of GPU power your laptop can provide. Gaming laptops have terrible battery backup and are extremely heavy to carry around, especially considering you'll probably need to carry it to college on an everyday basis.\n\nYou can read the linked answer for more details.\n└── So true",
    "MacBook M1 or M2 Air",
    "Get a mac OR wait for new snapdragon laptops.",
    "I really like the Lenovo Thinkpad with AMD Ryzen 7, 16.0GB RAM, 64bit. \nIt's got windows 11 pro, has impressive storage (useful for storing PPTs from classes to study for ESAs and ISAs), it touch supported, which is a nice feature as you can draw on it. It's light, so you can bring it to the university. It also has good processing power. Most of my work has intense computations (python, optimization with over 4000 variables and 200k constraints) and I'm able to solve it easily. The screen size is decent, and is very durable. \n\nPersonally, I would not recommend a Mac. This is because I feel like you are really exploiting the features of the device by investing fully in the Apple ecosystem, which may be a very large investment.\n└── Bro what about light editing? And the heating?\n    └── What do you mean by light editing?\nThe heating is very low. I had a Lenovo p series earlier (workstation) and it was an oven. I barely switch off my laptop because I run stuff overnight and am too scared to close my tabs, and hasn't heated up. Microsoft office is pretty slow but I am good at making a laptop want to run away by the way I use it\n        └── By light editing I mean, like using davinci and all. Like rendering 1080p vdos, not that vfx level stuff just normal utube editing.\n            └── Hmm, I'm not so sure about that actually. The computation is more than enough for a bachelor's student.\n                └── Does it heatup frequently on coding ?\n                    └── No, I run heavy code multiple times every day, and I have no problems with heating.\n                        └── Thank you so much for this info .. :)\n                            └── Ofcourse. I know that Lenovo offers very impressive student discounts, so look into that :)\nDell has good XPS laptops which are in the $1700+ range, so I'm assuming the Indian equivalent is more than what you're looking to spend. It's also definitely better for research and running codes requiring GPUs. \nIf you're okay with a flexible budget, check out the XPS15.\n                                └── It's too costly....but in lenevo how much is the student discount"
  ]
}