{
  "title": "Help me choose my college",
  "content": "Hey everyone, please help me out with picking between these options.\n\n1. Msrit cse\n2. mit manipal core cse\n3. bmsce core cse\n4. pesu rr cse\n\nunfortunately my jee did not go as planned and i dont have much hopes for advance.\n\nmy bitsat was decent but probably not good enough to get a core branch, however i will give my all for the 2nd attempt and try to achieve something decent.\n\nagain fees is not an issue, manipal looks appealing to me because of all the student clubs and extracurricular activities.\n\nhowever some people have adviced that while manipal is good it makes more sense to stay in the city as i live in bangalore. my parents are open to any of these options so there is no problem from that side either. placements are slightly better for manipal but again not too much better. could some of you please help me out with the advantages and disadvantages of each of these?\n\nAlso please tell me is pesu placements worth the high pressure and academic load which has caused some kids to commit su\\*cide\n\nI also have lmniit and thapar as options but prefer to stay in south india\n\n(edit: i also have  vit and  i mean vit is literally my last choice(i would take a drop instead of going there))\n\n",
  "metadata": {
    "id": "1d2c6xi",
    "author": "Sharp_Organization88",
    "url": "https://www.reddit.com/r/PESU/comments/1d2c6xi/help_me_choose_my_college/",
    "permalink": "/r/PESU/comments/1d2c6xi/help_me_choose_my_college/",
    "score": 11,
    "upvote_ratio": 0.87,
    "created_utc": 1716874878.0,
    "flair": "PESSAT/Admission",
    "nsfw": false
  },
  "comments": [
    "I would recommend Manipal over PES. Both are pretty similar when it comes to placements but unfortunately at this moment all PES has are its placements and location advantage. Manipal offers more opportunities to build a good profile, a better campus &amp; campus life with better campus clubs and other events, lesser academic rigour and stress, a slightly better reputation and as you mentioned, slightly better placements too. The only disadvantage would probably be the fees and the location, however IMO these are not crucial factors. UG is an investment, and it is important to invest wisely to get the best ROI.\n\nIf you are firm on staying in Bangalore, then I would compare between BMSCE and PES. You should compare the differences and decide if paying so much more for PES is worth it (it mostly isn't). BMSCE will mostly provide similar placement opportunities with an overall better college life. If not BMSCE, I would recommend MSRIT.\n\n&gt;high pressure and academic load which has caused some kids to commit su\\*cide\n\nWhile I agree that the academic load is high at PES, this has nothing to do with your question. Firstly, these can happen anywhere: IITs/NITs/etc have such incidents almost every year. Such events are not the norm at PES and this year has been an outlier to have had 4 incidents (out of which, only 2 are confirmed to be related to faculty interactions). Before this, the last incident was way back in 2012.\n\nSecondly, cases of harassment, although possible, are very rare - ask anyone (both present students and graduates) and you will see that while everyone agrees that the profs are average and unequipped, cases of harassment don't really happen as often as reddit makes it seem. A lot of students also look forward to working with some professors beyond the classroom either as TAs or RAs.\n\nThirdly, the academic load has greatly reduced now - your seniors used to give a test every 2 weeks at PES along with labs/projects/assignments submissions every other week for every course. Academic stress is not as much of a factor as you think.",
    "in the same situation please let me know what you choose\n└── hey what did you end up doing",
    "Wait is vit really that bad, I was planning to go ahead with it, what are the main cons?\n└── i think the main issue with vit is its entrance exam. I know people who have worked extremely hard and gotten under 10k ranks in jee and get disastrous ranks in viteee and i know people who have slept their way through these past 2 years , fail their jee and completely dont study at all and miraculously get great ranks in viteee. it is all a little bit too suspicious for my liking. obviously there are some kids who worked hard for the viteee but must of them seem to somehow luck out with the exam.I think the vit rank system is a random number generator lol. also vit has a category system which is harsh on the students who got good ranks. if you are getting category 1 or 2 it may not seem like a bad option but you will be with kids who have put no work in the last 2 years and are there on category 5. You obviously want to keep a good peer group. Also the high intake is obviously bad as you will be competing with thousands of other students. it will honestly be like jee part 2. I mean 30 percent of them end up mass recruited at tcs. everyone i know keeps it as the last option. in all the other colleges i mentioned you know that everybody is there on merit\n    ├── frrr broo truer words haven't been spoken i literally had a friend next to me during vitee who literally slept through the exam while I was dying and solving qs and he got almost same rank as me☠️☠️\n    ├── Very true, I got 80k rank in vitee with 92.9 jee percentile meanwhile I've seen people with 75 percentile getting 20k rank,Avoid Vit at all cost if you have similar options\n    └── 50% of the placed are at super dream companies or smth at vit. heard that in ritwik meghwani's video so idk it's nit all that bad. also people got to stop shitting on the category system. like yeah it's pretty weird but its their form of scholarship simple. other colleges give scholarship on basis of cgpa and vit on the basis of viteee (which is a bad thing but yeah). the high student population is a turnoff jndeed.",
    "Bro manipal how much da and in boards also",
    "Bro how much did u get in MET and in boards?",
    "Coming from North India, LNM is a great option to go with if you're willing to leave South, would recommend that over PES for sure",
    "PES is good as long as you can afford it",
    "I think for you msrit cse will be most suitable",
    "bmsce core\n└── please state any reasons which make bms better than pes"
  ]
}