{
  "title": "CDSAML and CCBD Centre Internship",
  "content": "Currently i finished by 4th sem. Now we have summer break. Got a mail about selection of internship. Is it worth to join or do some other online courses and upskill myself(planning to do [https://coincent.ai/](https://coincent.ai/) course)? I dont feel confident to join cdaml and ccbd. Need your suggestions",
  "metadata": {
    "id": "1d2dy1k",
    "author": "DaikonEmbarrassed147",
    "url": "https://www.reddit.com/r/PESU/comments/1d2dy1k/cdsaml_and_ccbd_centre_internship/",
    "permalink": "/r/PESU/comments/1d2dy1k/cdsaml_and_ccbd_centre_internship/",
    "score": 11,
    "upvote_ratio": 0.87,
    "created_utc": 1716882241.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "Bro are we literally the exact same person or what? Lmfao\n\nAlso to add\nIs this better or is it better to just take a 1 week summer course for the credits\n\nAlso i don't even remember what I filled in the form, literally don't remember a thing. How fucked am i\n├── I was in that SIG group they created; they don’t teach any stuff there, they just expect you to know about your selected domain prior to and ask you to give presentations on that.. like analysing research papers, and here I thought they would teach it, I just attended one session…\n│   └── Yeah, but one question, is that SIG thing only for Girls - CSE / CSE-AIML? Or is it open to ECE ppl too?\n│       └── I don’t know about ece but it’s for both boys and girls\n└── I posted a few detailed comments on these today. You can check my comment history.",
    "I am having a similar dilemma is it better to choose 2 months unpaid internship(mostly research work) in one of the departments in CSE or is it better to do two 2-credit special topic courses (I have already completed one) and do placement preparation in my free time, this will also reduce the load in my 7th sem.",
    "Selection of Internship at ??\n└── idk..all i got heading as CDSAML and CCBD Centre Internship.\n    └── Okay, I think it's pretty good. You should go ahead with it\n        └── But I'm not interested in research stuff( heard from others) it's research focused\n            └── If you're not interested in Research. I suggest u do the course, u were talking about.",
    "Also to add, is CDSAML better than ISFCR and the paid CIE internships??\n└── Cannot say that, because both are in different domains \\[ISFCR and CSDAML\\]. CIE not all are paid, so cannot comment on that either. But I suggest you take up the one which interests you\n    └── Are the first two paid?\n        └── Check with them once. Even I am not very sure, because I am in ECE. I'd say you ask someone in CSE or just ask your questions on the Discord server"
  ]
}