{
  "title": "More Info on ISFCR and CCBD/CDSAML internship",
  "content": "I needed some help regarding internships.\n\nI currently have 2 things-a 7 week internship in CCBD which is most likely going to be some project or a research paper/implementation of a concept in 5g isfcr lab. Both give me 2 credits\n\ni was hoping if any seniors/people in labs can give me any insight they had on isfcr and ccbd.\n\nany advice is also appreciated",
  "metadata": {
    "id": "1d35y39",
    "author": "Excellent-Let2022",
    "url": "https://www.reddit.com/r/PESU/comments/1d35y39/more_info_on_isfcr_and_ccbdcdsaml_internship/",
    "permalink": "/r/PESU/comments/1d35y39/more_info_on_isfcr_and_ccbdcdsaml_internship/",
    "score": 6,
    "upvote_ratio": 0.81,
    "created_utc": 1716965810.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "I interned at CCBD back in 2020-2021 when KVS was still in charge and he also happened to be my research advisor. \n\nCCBD is also a research based internship, like ISFCR. You'll have to do quite a bit of literature survey, experimentation etc, like any other research project. I am not sure about the current state of things but CCBD used to be one of PES' premier research labs that focused on quality research. Although said that, your experience will depend a lot on the actual prof who is your advisor as well as the project you are assigned to. This applies to both labs. \n\nIMO, both experiences will help you make your profile stronger. They will also open up other opportunities like TAships for relevant courses like Big Data/Cloud Computing or CNS, good contacts with profs at the lab etc. I remember KVS even offering my team referrals for future jobs at companies he had previously worked at. Both labs will also open doors for both research and engineering roles after UG, which isn't possible with just industry based roles. Plus, there's also the added benefit of a research based LOR if you do well. Since both labs also aim to publish at top venues, you might even get to add that to your CV.\n\nI don't think there is a *wrong* choice here, it will ultimately depend on your interests. You should try finding out which project you will get assigned to and under which prof. That will help you make a better informed decision. Pick the project that interests you more along with a prof known for publishing *quality* research in that field.\n└── The centres have greatly deteriorated since.\n    └── Yeah I am aware. That's why I would suggest confirming your participation in the internship only after finding out who your prof is, what is your assigned project, and finding out said prof's experience in that field along with past publications. Before, we used to take the quality of all these parameters for granted, can't really do that anymore.\n\nAlso looks like I am getting downvoted for no reason again"
  ]
}