{
  "title": "Ece ",
  "content": "How hard is ece guys, ppl in my class r like ece no placement, no good staff, difficult course, and wt not... ( apparently some person of my class forwarded a msg in the grp, of a senior in ece, where he ranted how bad ece was and asked everyone to change to cs... ). Can u guys give a realistic situation of how it is out there?",
  "metadata": {
    "id": "1d3556x",
    "author": "Own-Priority777",
    "url": "https://www.reddit.com/r/PESU/comments/1d3556x/ece/",
    "permalink": "/r/PESU/comments/1d3556x/ece/",
    "score": 10,
    "upvote_ratio": 0.82,
    "created_utc": 1716962396.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "Well, as far as the subjects in ECE go, they're mostly math and physics. Lots of advanced numericals and derivations and stuff you learn in 3rd and 4th sem carry over. Unless you really enjoys solving advanced numericals or really like the core part of it, you're gonna find ECE subjects really hard and frustrating. They're lengthy and all of the subjects in the VLSI and Comms domain feel like the exact same subject to study . if you don't like one, you're probably not gonna like any of them.\n\nI don't know how the staff is at RR, but at EC campus they're pretty horrible. Any ECE EC student can tell u how bad they are and how much all of them are hated lol. Our HoD thinks he's doing a good job if everyone hates him because apparently \"teachers should be hated by students\" or something according to him.  He also keeps reminding us very condescendingly  how we are all inexperienced nobodies and how there are ppl always better than us. Should give you a good idea of how the atmosphere is here.\n\nAs for the difficulty of the course, every course is difficult in its own way. Someone who isn't good at numericals and math will struggle a lot in ECE just like how someone with bad coding skills will struggle in CS. ECE exams in general(at least for my batch) were harder than CS exams if that's what the senior was talking about\n\nAs for the main thing, placements, yeah they're pretty horrible, at least for the ECE ppl in my campus. I'm in my 8th sem now and last I checked, in march, 6 people out of the 125 ish people we have were placed. That's 5%. And all of the companies are IT companies. So none of the ECE students in my campus got placed in core companies. Everyone else, including me, just got internships and jobs through referrals. Our placements have been going on from March of last year so most of the companies have come already so if someone hasn't been placed by now, there's a very small chance of them getting placed after this. Also, average package of ECE students was 3.2 lakh for my seniors  whereas that of CS students is 12 lakh this time. \n\nIf someone from ECE has a chance to go to CS, I'd 100% recommend it unless they are genuinely interested or passionate about ECE. It's a pretty difficult subject that needs a lot of time and CS is easier and better in almost every way, especially in PES. Hope this helps.\n├── Great comment. Thanks. \n\nCan you copy-paste this into the linked post in the FAQs too?\n│   └── Not sure what you mean\n│       └── Add the same comment to this post: [https://www.reddit.com/r/PESU/comments/1cyvucb/the\\_pros\\_and\\_cons\\_of\\_pes\\_university\\_of\\_ece\\_at\\_rr/](https://www.reddit.com/r/PESU/comments/1cyvucb/the_pros_and_cons_of_pes_university_of_ece_at_rr/)\n\nThis post is linked in the FAQs for feedback on the ECE branch. So next time someone is looking for something similar, they can find your opinion as well.\n├── damn, bro you look like you are cracked, the clarity in your writing...\n│   └── I'm not cracked, just broken 🙃. PES ECE does that to a person\n└── Damn thanks!\n    └── No worries! Glad I could help",
    "Someone made a detailed [post](https://www.reddit.com/r/PESU/s/OldsPM1WFc) about this a few days ago.\n\nDo you guys just not bother spending 2 minutes looking at the FAQs\n├── How else are they supposed to farm post karma on reddit? /s\n│   └── Karma farming in a subreddit with barely a hundred active members is certainly a choice\n│       └── 100 active members? You mean like 10. Most of these kids post a question and disappear.\n└── Apparently that post was the forwarded msg in the grp 💀",
    "There is a detailed post about the ECE branch at PES on the FAQs: [https://bit.ly/pesu-faq](https://bit.ly/pesu-faq)"
  ]
}