{
  "title": "Fee refund if I get BITS after 5th July??? ",
  "content": "So currently I'm alloted RR cse and there's still 1month left for 2nd bitsat, I didn't do well in 1st attempt because I didn't study much and I'll be grinding this month for 2nd attempt because fees in pes is insanely high and it's similar to bits so I'm thinking of joining even dual at bits. In orientation they mentioned they'll give full refund if we request it before cet results or July 5 and they mentioned if we get iit or nit theyll issue refund even after July 5. So does bits come under this category too cos iteration 3 of bits ends mostly in mid/end of July. Thanks. ",
  "metadata": {
    "id": "1d42tuc",
    "author": "buttsatGRindr",
    "url": "https://www.reddit.com/r/PESU/comments/1d42tuc/fee_refund_if_i_get_bits_after_5th_july/",
    "permalink": "/r/PESU/comments/1d42tuc/fee_refund_if_i_get_bits_after_5th_july/",
    "score": 17,
    "upvote_ratio": 1.0,
    "created_utc": 1717072030.0,
    "flair": "PESSAT/Admission",
    "nsfw": false
  },
  "comments": [
    "They would refund if u run after them for refund. Don't sit waiting for it\n└── Wdym by running after them? I don't live anywhere near bengaluru\n    └── U have to pursue them repeatedly by calling and emails , not literally run after them.\n        ├── Thanks for clarifying. I thought you meant he had to stalk doreswamy night and day\n        └── Will that work definitely?? Cos I've paid fkin 5lakhs 😢 😭😭\n            ├── Ofc it'll work, under ugc norms they will have to return your money.\n            │   └── Really?? Hope they refund it fingers crossed 🤞\n            └── Yeah dude , if u pursue them relentlessly it will work. One of my classmates went to bits and got refund after attending one month of classes at pesu, and another classmate even joined manipal\n                └── Yeah but mainly I'll try to get very high score on exam day itself so I can at least withdraw before July, and regarding that relentless pursuing I'm really scared because my dad has some anger issues he might even threaten them in phone or Irl 😭😭😭\n                    └── It's good only if he threatens, I am sure they would deny at first. Other than that best of luck, try ur best for bitsat so that u don't have to come here xd\n                        └── Idts threatening people of ex edu minister will go well lol and thanks btw",
    "I asked the same question to jawahar himself during my counselling. He said nope and I settled for PES. BITSAT'S second round round was just around the corner but counselling was after these people's refund window closed. I later found out that I could have gotten a dual degree at BITS which I wanted in the first place. I regret that ever since.\n└── Damn, sad man looks like I have to get exceptionally high marks on June 24th itself and then request refund immediately",
    "\"In case of withdrawal of admission, it can be done on or before 10th July 2024. 100% refund will be done except for Rs. 10,000\" \n\nThis was written in the acceptance/ provisional blocking of seat email i received,\n├── Oh okk thanks will check once\n└── Did you get in through pessat? I don't think I received any such mail."
  ]
}