{
  "title": "BMSCE(CSE) VS PES EC CAMPUS(CSE)",
  "content": "please tell me what should i choose MONEY DOESN'T MATTER \n\njust tell me which is better \n\nwhat will you choose if you have this type of option \n\n  \nPLEASE HELP ME it's URGENT",
  "metadata": {
    "id": "1d5lhr7",
    "author": "Dull_Grade5086",
    "url": "https://www.reddit.com/r/PESU/comments/1d5lhr7/bmscecse_vs_pes_ec_campuscse/",
    "permalink": "/r/PESU/comments/1d5lhr7/bmscecse_vs_pes_ec_campuscse/",
    "score": 6,
    "upvote_ratio": 0.88,
    "created_utc": 1717243485.0,
    "flair": "PESSAT/Admission",
    "nsfw": false
  },
  "comments": [
    "Are you sure it's bmsce and not bmsit? Cause bmsit is the one that's usually close to the cutoffs of pes ec campus\n\nEither way, \n\nbmsce&gt;=pes&gt;&gt;&gt;&gt;bmsit\n└── Yes 100%\n    └── So one is comedk and the other pessat?\n\nTake bmsce no doubt\n        └── can i ask little bit of why because i have to explain it to my parents as well 🥺\n            └── Was my comedk and pessat thing correct or did you get something with kcet?\n\nIf kcet then take ec campus for the lower fee. \nIf pessat, then take bmsce comedk for the lower fee\n\nBms does have a lower population so that's a plus but pes has sorta better syllabus and stuff. Infrastructure at rr campus is pretty good as well. Ec campus is not as nice. And placements at pes are generally a bit better. \n\nOverall The two colleges are pretty equivalent just pick the lower fee. If money is no object, I'd just toss a coin. That's how much i wouldn't mind either one\n                └── yes comedk and pessat \n\nas said my parents are saying money doesn't matter just choose best option as it will be a one time investment \n\nmy problem is that i am still thinking about BMSCE is i got EC campus if i got RR then i won't be thinking more than twice.\n\nand i might go with MASTER's as well in the future, so PES is a better option ?\n                    └── Like i said, I consider both equivalent. They both have their advantages and disadvantages. You will be in a more competitive environment at pes, which imo is a good thing.And placements are statistically better. But the population is larger than that of China's. \n\nI would personally take bmsce cause it's generally more chill and peaceful. Lower number of people and just a more calm experience. If you have some competitive enthusiasm pes is probably better\n\nBut at this point I don't really care. I'd simply pick based on location or something. \nIf you're staying in hostel, the first year hostel is 6 km away at ec campus. They arrange a bus everyday and you have to wake up quite early. That in itself is a deal breaker for me \n\nUnfortunately I cannot really tell you about future prospects post graduation, maybe u/rowlet-owl dude can help\n                        └── thanks for your lovely help most probably i would be going with PES EC campus now 😊\n\nthanks for helping\n                            └── Just warning you, this is what you'll be saying after a year or two. \"My friends at bms don't need to study shit. Fuck pes and fuck my life\"\n\nBut it's not so bad lmao. You'll know when you're in\n                                └── My brain cells are dead not able to understand this reply 🥲"
  ]
}