{
  "title": "Are PESU studies really VERY HARD and HECTIC as they say online, compared to BMS",
  "content": "just wanted to know if competition in pes is too hard to survive",
  "metadata": {
    "id": "1d66ywv",
    "author": "tejboss_4493",
    "url": "https://www.reddit.com/r/PESU/comments/1d66ywv/are_pesu_studies_really_very_hard_and_hectic_as/",
    "permalink": "/r/PESU/comments/1d66ywv/are_pesu_studies_really_very_hard_and_hectic_as/",
    "score": 13,
    "upvote_ratio": 0.89,
    "created_utc": 1717309508.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "PES is academically more rigorous, but its not that you cannot do anything else. Doing well in exams requires consistent hard work, rather than deep frying your brains 2 days before the exam. If you make a little progress everyday, the exams become bearable. Most of the kids who cross a 9+ aren't the ones who put in the hardest efforts but are rather the ones who put in effort regularly. Tbf, most kids don't even study everyday. Most people who do well begin their exam prep 2-3 weeks before the tests, ensuring to do a little everyday so by the time the exams are knocking at the door, they are prepared.\n\nEffective time management is the key. People here research with profs, pursue internships, work on their personal projects, head different (and sometimes multiple) clubs and fests, and also learn from other courses during the semester, alongside academics from PES. There are also people pursuing another online Bachelors degree alongside this. If they can find the time, so can anyone else - everyone has the same 24 hours in a day.\n\nAll of this is possible, but it all goes down to how well *you* can manage your time. The people who complain about not having time at all are often the ones who cannot manage their time well. If you can plan your days in advance, prioritise your work well, have a good sleep/work schedule, and efficiently make use of time when available, you will also see that it isn't as bad as portrayed.\n\nBut having said this, BMSCE is known for being far more relaxed with an easier/livelier college &amp; campus life. At PES, you will have to work hard. The crowd is also very competitive and is looking to excel. There is high competition for any kind of opportunity. You will need to take these chances the moment they appear. Everyone here is trying to get somewhere and be someone. A lot of people don't like this, but a lot of people also prefer this since it encourages them to work harder. The choice is yours if you think a competitive crowd is a demotivator or a motivator.\n\nEdit:\n\nI would also like to add that the academic load has greatly reduced now - your seniors used to give a test every 2 weeks at PES along with labs/projects/assignments submissions every other week for every course. Additionally, current batches are spoonfed notes, PPTs, worksheets, etc to prepare from, which are often verbatim tested in the ISA/ESA - a lot of kids don't read the textbook anymore. Previously, all you had was the prescribed textbook, it was on *us* to prepare notes either by writing them down in class, borrowing/stealing from friends/enemies or using the textbook to prepare them. Academic stress used to be a *lot* worse.\n└── Thank you very much",
    "2nd sem physics pessant here.\nThe grind: As long as you finish your work on a daily basis, it's alright I'd say. There are quite a few assignments though. Study for about 2 hours daily and you're golden. Stay away from keeping everything for just before the day of the exam, there's a lot of things to cover and there's no telling where questions are going to be asked from, and given that there's no choice on which questions you get to attend, not studying thoroughly is the best way to end up with a low grade, and when most of your peers are smart, that low grade begins to stand out more. As far as the hectic part goes, it's only the last 2 weeks of the sem. We had to submit assignments, give class tests for internal marks and finish lab exams, all on the last week of the sem, then we had this thing called ISA-2 (In semester assessment, basically an exam on the last 2 units of the course, there's ISA-1 for the first 2 units) right after, and then it's on to the final exam for the sem in about 5 days. \nThe timings: college starts at 8.45 and the day ends at different times for each class depending on your timetable. My class had 2 days until 1.45 pm, 2 days until 4 pm and 1 day till 3.15 pm. My friends at BMS go to college at 9 and are back home by 2 💀, so ye. \nAll in all, it's a little more School-like compared to any other place, but if you're willing to live with that aspect of things, I'd say it's not that bad.\n\nPS: Be prepared for a few mental breakdowns while studying 💀, cuz the pressure to perform is really on.\n└── Tq bro\n    └── No problemo, feel free to ask whatever you wanna know\n        └── hey bro,how hard is it to get 40% scholarship in pes?\n            └── You'll need a minimum of 8.6 or 8.7, but I recommend 9 just to be safe. \nIt's not that hard tbh. Listen properly to what the teachers have to say (Yes, it's boring. Yes, you'll feel sleepy, cuz you're tired and it's okay to doze off in a class or two, but stay attentive for at least 75% of the class hour) because sometimes there are things that are explained that are not in the slides or the notes, those are the things that'll help you get those extra 3 to 4 marks in the mcqs or help you go into the finer details in the theory questions. Again, more marks means you're one step ahead of the others when it comes to getting the scholarship. \nFigure out what subjects are hard for you, and which ones you find easy. Give more time for the harder subjects every day, and gloss through the ones you find easy. No shortcuts when it comes to putting in the effort to study. \n2 hours of study a day, a MAXIMUM of 3 hours if you found today's lessons hard. Revise daily, don't burden yourself before the exam. Give yourself enough time to sleep and rest well.\nISA (in semester assessments are graded absolutely, score over 30 in this out of 40, the averages usually hover around the 20s)\nESA (end semester assessments are graded relatively, try to score 85+)\nwith a combined total of over 30 in the ISAs, 10 in internals, and 85+ in ESA, an S grade is pretty much guaranteed. With 3 S grades, 1 A and 2 B, you'll end up with something like a 9.2, enough for the 40% scholarship.\n\n\nTLDR: Not really hard. Focus in class (at 80% of the total time of that class), go home and study what was done, if you've got time, prepare for tomorrow's class, 2-3 hours max everyday (even I do only 2 at best, but constant and continued effort is necessary), score well in ISAs.\n\nEdit: What I'd also like to add is that, everyone is built differently. Maybe you can't focus in class as well as I can but, you might be able to study more effectively before the exams than I can. In the end, it's all up to you to figure out the best method for you to study which gets you as many marks as possible. Just don't slack off on the effort because things didn't go well once, work harder and keep finding ways to squeeze out the maximum marks you can with every resource you have available to you.\n                └── Thanks top gun"
  ]
}