{
  "title": "Looking for a roommate in ec campus ",
  "content": "Hey everyone I am Shobhit, a fresher and I need to talk about the accommodations in EC campus please read the full post, though it is very big, believe me it will be worth it. If you are adamant in not reading the full post, at least read the last part and skip the pros and cons🙏.\n\nafter a quick search on the internet regarding hostels and PGs you will find the following pros and cons.(note - can be subjective) \n\nPROS (Hostels)\n1)  Hostels are generally better for forming meaning relationships and friends and it is easier to meet like minded peers of same age and life situations.\n\n2) Hostels are generally cheaper.\n\n3) Hostels generally have more amenities.\n\n4) Hostels are generally situated near or within the premises of the campus itself, so one can save transportation cost and a lot of time.\n\n5) Hostels are safer compared to other accommodation options, especially for girls.\n\nCONS (Hostels)\n1) Hostels are generally strict with various rules and regulations which maybe not suitable for your lifestyle.\n\n2) The food is, at best mediocre.\n\n3) you need permission for everything from your parents/ local guardian.(nightout, birthday celebration or any other event )\n\n4) Infrastructure may be bad depending on how old the building is._\n\nBelieve me if someone give you this bullshit that \" rules are meant to be broken\", just ignore them. This is from my personal experience, having spent 5 years in Hostels. Even if you are able to beak the rule there always will be arguments and clashes between you and the overly strict warden.\n\nPROS (PG)\n1) Not that strict compared to Hostels with generally flexible timings.(yes, you can celebrate you birthday and have a nightout)\n\n2) The Infrastructure is very good, especially if you find a good building, rooms are also generally cleaner and spacious.\n\n3) Great amenities are available in pgs.(indoor game rooms, common living space, common kitchen, some of them may also have gym )\n\nCONS (PG)\n1) PGs are generally more expensive than hostels.\n \n2) Some students may face location and travelling problems. \n\n3) The food again is, at best mediocre. \n\n4) PGs are generally not as safe as Hostels, especially for girls.\n\n5) In some PGs maintenence sucks, but may vary.\n\n\nNow coming back to the point, why i gave you this long list was to make it easier for you to understand my point now -\n\n1) regarding fees, it is 122k for 1 academic year (8 months for 1st years ) so 15,250 per month with a 30k additional security deposit.\n \n2) rooms are very small 4 sharing with bunker beds, 4 average sized desk and 2 cupboard, yes you read it right 2 cupboard for 4 students, good luck with that. There is also no space to keep your luggage and a single window. what a joke!\n\n3) there is no common halls for indoor games or television, let me remind you - 'you are paying 15k a month.'\n\n4) The cerfuee timings are around 7 pm, as we are 'non-responsible adults' also apparently there is a head count everyday at 7, seriously? I also heard you are not allowed to go to different rooms after 7, which is just mind bogglingly absurd although i am not sure about this completely.\n\n5) Hostels for pes EC campus, for first year students is around 5.2km away form the campus. So be ready to spend at least 1 hour of bus travel every day as Bangalore is overcrowded. Also you are not allowed to keep a bicycle, god knows why!\n\n6) Don't get me wrong the college is great and all the facilities are awesome but to access those facilities you have to travel around 10.4 km which will take at least 45 min as they don't let you keep a damn bicycle! For reference the college ends around 4 so you will reach hostel by 4:45, if you rest till 5:15 for 30 min, now you have less than 2 hours to access the facilities ( E.g. - going to gym) and explore Bangalore and also spend 45 travelling up-down  AS THEY DONT ALLOW A DANM BICYCLE!!\n\nsee all the advantages a common hosteller gets is non-existent here, apart form point one and five in pros of hostels however, all the cons a common PG student faces is also non-existent as in Bangalore, electronic city there are very good PGs around 12k with various amenities and just 5-10 minutes away from the campus because you will have a bicycle. regarding food both hostel and PGs have okay food so no comparison and there is no security problem as such because we are in electronic city.\n\nthe only con, realistically is point number one in pros of hostel which, don't get me wrong is one of the most important point but if we live in PGs in group of 10-15 it can be solved easily and believe me, I have spent 5 years in hostel, you will have more fun than you can ever imagine, living in PG.\n\nYou have around 2 months to plan this thing out and convince your parents,it will be great if the seniors could help in the issue and share their experiences and cross check the facts once also the local Bangalore students can help us find good PGs. if you have any further ideas or suggestions please share and any one interested please message me. \nAlso please join the WhatsApp group from the link.\nAnd dont spam!\n\nthanks you for reading the message, I really appreciate it. ",
  "metadata": {
    "id": "1d696yh",
    "author": "_seishi_",
    "url": "https://chat.whatsapp.com/Ly8UL7HUnTBHOioFljIBR8",
    "permalink": "/r/PESU/comments/1d696yh/looking_for_a_roommate_in_ec_campus/",
    "score": 18,
    "upvote_ratio": 0.96,
    "created_utc": 1717319156.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "Great post, adding this to the FAQs. Thanks for the contribution.\n└── Kindly add the post to the FAQs 🙏. So it could reach the interested students.\n    └── It's already been added :)"
  ]
}