{
  "title": "Cutoff doubt",
  "content": "I got a rank of 157x in kcet and i wanted to take cse rv is out of the picture so i was deciding bw bmsce msrit and pesu. Im most likely gonna go to pesu since it is closer for me to travel to (30 mins journey through metro+bus) while the other two take me 45 mins and a hour through bus but im not sure if ill be able to get a seat in pesu. I have 3A reservation and cutoff last  year for 3A was 1405 i think while nothing was specified in second round. Can anybody tell me if ill be able to get a seat and if possible please give me suggestions on what order of colleges i should use for counselling. Might be a dumb idea but i decided to keep rvce cse as option 1 and pes cse as option 2",
  "metadata": {
    "id": "1d70yzt",
    "author": "Manasvidr",
    "url": "https://www.reddit.com/r/PESU/comments/1d70yzt/cutoff_doubt/",
    "permalink": "/r/PESU/comments/1d70yzt/cutoff_doubt/",
    "score": 8,
    "upvote_ratio": 0.83,
    "created_utc": 1717409641.0,
    "flair": "PESSAT/Admission",
    "nsfw": false
  },
  "comments": [
    "yo bro, i too have 157x rank in kcet  \nCHECK 2nd EXTENTED ROUND CUTOFF , for 3a it is 1903  \nYOU WILL EASILY GET SEAT IN PES\n├── Oh yes thanks\n└── You’re considering pes too?\n    └── i have got cse through pessat, hoping that i will get it through kcet so that fees will reduce\n        └── I got it through pessat too but didnt book cuz who tf pays 5 lpa\n            ├── whats ur pessat rank?\n            │   └── 8xx\n            │       └── noice\n            └── Smart decision 5 lpa is not worth it for this college. You don't have to take whatever you get in 2nd round, I suggest you always go to the 2nd extended round coz cutoffs increase drastically. Also while doing option entry always do it according to your priority i.e., put the course and college you want the most at the top and followed by other courses and colleges according to decreasing order of interest, never according to how likely you are to get them\n                ├── That makes more sense yes thankyou. But if we go for second extended round dont we lose the colleges we got in first and second rounds? Is it worth the risk to give up pes(since i might get it in 2nd round) and go for second extended in hopes of rvce\n                │   └── brotha, cs core&gt; cs branches, you have no chance of getting core cse in rv(truth), so, decide if u want to go to cs-specializations\n                └── hey does pes take admission from jee too?\n                    └── Yes but there are only a few seats and the cutoff percentile and fees both are very high. Not recommended\n                        └── i saw somewhere one needs 90+ percentile for pes\n                            └── Closer to 97 or 98+ which is a joke. Although nobody knows the exact cutoffs, the few people who joined from mains say it's around 97%ile. With this score you're better off joining an nit\n                                └── yea true"
  ]
}