{
  "title": "Publishing two papers for Capstone.",
  "content": "So my guide basically wants us to publish 2 papers, one survey paper regarding what we did in Phase 1 and another final paper. I am a total noob and I don't clearly understand how publications work. I am afraid that if we publish some stuff now, it will lead to self plagarism\\* or some such problems later down the lane.  \nSo please suggest some resources to understand how publications work, and any resources on how to start writing a paper. Thanks a lot.\n\n  \n\\* I got this doubt as I vaguely remember reading about some seniors who tried to publish their paper in two phases and something going wrong. ",
  "metadata": {
    "id": "1d7pz1t",
    "author": "randomsurfering",
    "url": "https://www.reddit.com/r/PESU/comments/1d7pz1t/publishing_two_papers_for_capstone/",
    "permalink": "/r/PESU/comments/1d7pz1t/publishing_two_papers_for_capstone/",
    "score": 16,
    "upvote_ratio": 1.0,
    "created_utc": 1717480384.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "Don't publish twice. Instead, publish one single paper later. What you mention is right - publishing initial survey results first will just lead to a loss in novelty in the second paper. Especially if you aim at top ranked conferences, they will immediately flag your first paper and link to it. Then your second paper will be seen as a weak reprint of the first. If you *really* want to publish the survey results, you can put them up on arXiv, but I'd still recommend against it. Remember that your novelty points come from how valuable the study is, the experiments and analysis. If you split it, you will simply decrease the quality of the both papers. Profs will try to push for multiple papers because it increases NIRF ranking, but that's not how research is done.\n\nHaving a single, robust and detailed paper is worth more than having 2 diluted ones. Self-plagiarism is a valid problem many run into while splitting their work into two papers. Remember that research is about quality, not quantity.\n└── Thanks a lot, will try talking her out of the idea of two papers.\n    └── If you don’t mind me asking, who is your capstone guide? I sort of have a vague idea who it might be as one of my friends also had to go through the same thing last year….just wanted to confirm if it’s the same person. (Feel free to DM)",
    "Publishing papers is really a good idea. Do not worry about plagiarism or the first survey paper even. Just focus on your project and generating results in a presentable way. Writing papers is just about building a good narrative. I'm sure your professor will help you with it."
  ]
}