{
  "title": "4th sem cse",
  "content": "I don't know how to feel about this anymore. \nExhausted \nI felt sem 4 will be better than sem 3 but it turned out much worse \nIs it supposed to be a wake up call for us Or like why is the grading to strict? \nPlease share your thoughts",
  "metadata": {
    "id": "1d7yjtf",
    "author": "Strange-Slide-5300",
    "url": "https://www.reddit.com/r/PESU/comments/1d7yjtf/4th_sem_cse/",
    "permalink": "/r/PESU/comments/1d7yjtf/4th_sem_cse/",
    "score": 35,
    "upvote_ratio": 1.0,
    "created_utc": 1717511356.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "They are planning to make more money from re-evaluations \n\n/s\n├── Definitely , 1st sem results were disastrous for 23 batch if I remember. Tones got backlog in maths and physics.\n│   └── Bro 2020 batch students had avg 4 backlog in first 2 sem\n│       └── Ya'll did'nt have pesuacademy back then , so the struggle is understandable\n├── PESU management knows how to mint money lmao\n└── This might actually be true knowing pes",
    "It was the lack of study holidays between subjects ngl. Second and third sem had a good amount of break between subjects which was helpful in revising the syllabus fully and doing previous pyqs. I coud'nt do any previous pyqs this time and my syllabus was also incomplete, you can't revise in a day even with well-written notes. I hope they plan and give at least 2-3 days between subjects from next sem onwards.\n└── They should have relative grading, they have a 1000+ students! Why the fuk do they have absolute grading?!",
    "A senior told me, the first 4 semesters are bad, the next 4 make it up for the first 4. Happened with me and a few others when we chose the electives and specialisation that interested us, I went from a 6 pointer to 9. Hang in there!\n└── Really?(like genuinly asking cuz im in a 7 pointer now😭)\n    └── I was talking about SGPA, my bad, SGPA boosted and made my CGPA slightly better. Regardless, if you're in 6th sem too, you can't get a 9 CGPA now I guess, you can make it to a good 8 pointer though and that's great too\n        └── Im in 2nd sem and ig ill have a 7 pointer in the first yr seeing my prep for exams tho💀🙃\n            └── Yeah that's a good start. Study well and always maintain a 7 or 7.5+",
    "Can you all not request them to change the absolute grading to relative grading if the results are disastrous? Why the fuk do they not have relative grading with more than 1000 students?\n├── Because relative grading is a double edged sword. If you do it for courses where the overall population has performed well, then you might end up getting a lower grade than expected because everyone performed well. That's why it's only done when the batch screws up.\n│   └── The rest of the world gets it done effectively. Choose absolute grading for easy courses or where the number of people in that course is less, and use relative grading for literally everything else. PES has more than a 1000 students, they gotta make the system fair. They aren't obliged to use only one kind off grading, use a mix of both.\n└── Wait they don't? Did they change our something"
  ]
}