{
  "title": "Backlog in 6th sem help! ",
  "content": "I failed a subject in 6th sem. Im worried about the upcoming placement season. Will I even be allowed to sit for placements with a backlog? \n\nAlso when you do clear the subject backlog, is it explicitly mentioned in the transcript? \n\nRequest seniors to please advice",
  "metadata": {
    "id": "1d80nmv",
    "author": "[deleted]",
    "url": "https://www.reddit.com/r/PESU/comments/1d80nmv/backlog_in_6th_sem_help/",
    "permalink": "/r/PESU/comments/1d80nmv/backlog_in_6th_sem_help/",
    "score": 13,
    "upvote_ratio": 1.0,
    "created_utc": 1717516586.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "If u can clear it in the summer term clear it off, don't wait, u'll be ok.\n├── Thanks bro, will try my best\n│   └── I have backlog in 2subjects what should I do now?I literally have no idea.When is backlog?Do I have to talk to them and pay them?Please help if you know\n│       └── There's a fee that needs to be paid in order to rewrite the subject. Once that's paid, you can take up the exam in the next ESA session. Apparently there is one in July but I am yet to confirm the details. When writing a backlog exam it's important to note that, the entire pass or fail is based on the paper itself, which means the internal marks you gained no longer count. Once you clear a backlog paper they will update your marks card and your gpa as well. How the updates are done is a bit unclear at this time to me. For every backlog you can attempt it 4 times to pass it.\n│           └── thanks a lot really appreciate it.Can I give the exam this july itself?Also what is the highest grade in backlog?\n│               ├── I think you should be able to in July. That would include me too haha. Far as the highest grade is concerned I am not sure\n│               │   └── Thanks for helping bro If u get updates about exam and registration do tell me.\n│               │       └── I'll update you my g. Stay strong in the meanwhile, we'll get through it\n│               │           └── Thanks last few years have been my worst.I really appreciate you.Stay awesome.Take care.\n│               └── Study well, you might be able to crack an S or A as well. It's possible. Since it's PES, luck would play a slight role too.\n│                   └── Thank you.I'll try.\n└── I have backlog in 2subjects what should I do now?I literally have no idea.When is backlog?Do I have to talk to them and pay them?Please help if you know\n    └── Summer term notification will be sent by end of this month and exam will be in July. U can contact the COE for more details. Ull need to pay fees on pesuacademy.\n        └── Thank [you.So](http://you.So) I got backlog this sem I can give exam on this july itself right.Also what is the highest grade in backlog?And syallabus remains same right?\n            └── The highest grade is S only, U will be graded fully on your written exam. So take advantage of it. Study hard now so you can get through. You can most likely give in July only.\n                └── Understood thanks",
    "Some companies don't allow people with active backlogs , some companies don't with previous backlogs. And some are not all don't worry\n\nMake sure you are skilled enough for them tho\n├── Does the transcript mention backlog?\n│   ├── Remember that even if you lie about not having backlogs, PES knows you have one. It's not a question about whether you'll get caught, it's a question of *when*. Best case scenario, you aren't allowed to sit for the placement test and PES goes easy on you. Worst case scenario, you end up getting selected and then later get caught when you need to submit your documents to the company.\n│   │   └── Not planning on lying to any company, I was thinking about when I have to apply for higher studies and such.\n│   │       └── I could be wrong, but I don't think it shows up once you clear. But until you clear, it will show that you have failed a course.\n│   │           └── Alright, thank you!\n│   └── Not sure about that\n└── but all companies ask no backlog are there really companies that require no backlogs?",
    "Clear the backlog within 4 years, in fact before 7th semester if you plan to get a transcript during or right after the 7th semester. If you clear within 4 years, they won't show it in your final transcript dw.\n└── Thank you so much, this was the clarity i was looking for!\n    └── :))\nAll the best! Try to get the burden off your head in the summer term itself\n        └── Thank you! That's the plan now!",
    "Hey even I got a backlog. This is my first backlog in engg, and in CD too. 79 people got backlog or every 1 in 18. So don't worry, we'll get through this.\n├── Yes bro! We have to!\n└── Same dude! I’ve done fairly well in my entire college life but this CD absolutely fucked me over on top of me falling sick the day before.\n\nNothing that I studied last minute came and it was an absolutely unfortunate turn of events for me lmao",
    "Does anyone know when we will get results of the backlog we write in summer, will we get it along with our 6th sem grade card?\n└── Different grade card\n    └── Thanks, so do you know, by when we can get the results?"
  ]
}