{
  "title": "Placement 12th criteria",
  "content": "During placements does the 12 th marks really matter if somebody has score around 57 percent in pcm and 65 percent overall subject and does the company look for pcm or overall ?",
  "metadata": {
    "id": "1d82jhz",
    "author": "Fragrant-Buffalo8135",
    "url": "https://www.reddit.com/r/PESU/comments/1d82jhz/placement_12th_criteria/",
    "permalink": "/r/PESU/comments/1d82jhz/placement_12th_criteria/",
    "score": 8,
    "upvote_ratio": 1.0,
    "created_utc": 1717521292.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "Some companies have have a criteria, that ur 10th and 12th marks should be above 90 percentage. They take into account the overall score.\n└── companies keep over 90 ? isn't the max they usually go for 75?\n    └── Very few, probably a handful, have the 90% requirement.\n        ├── What's the minimum criteria for majority of companies ?and is it aggregate in all five subject or just pcm ?\n        ├── 90% in both 10,12 or the avergae of them should be 90??\n        └── even for 10th? why do they go so far back. i got like 75% in 10th, but above 90 in 12th. will it haunt me forever lmao",
    "its usually 60 or 75 sometimes 90",
    "Majority don’t ask for 10,12th grades but I’ve seen few(mostly in single digits) short listing based on 10,12th marks where they keep 90% as cutoff\n└── So they don't ask for 10 th 12th grades ? If somebody has overall 66.8 percent in 12 will he cross any problem during placements if he perform good in college ?\n    └── 99% of the companies won’t ask, only a few (mostly in single digits) will shortlist\n        ├── So the guy won't face any problem with 66 percent in 12th during placements right ?\n        │   └── 95% of companies don’t ask or care about your 12th score\n        │       └── So he will be allowed to sit for placements right ?\n        │           └── He will be allowed to sit for placements\n        └── and those 90%+ companies ask for 90% in aggregate or pcm?\n            └── Only a handful of them asked and it was 80/90% overall\n                └── got 89.2%, so was just wondering if it's worth getting it re-evaluated.  \nAnyway, thanks!\n                    └── Bro don’t worry too much, it’s hardly a few companies who ask for it like 2-4 at max, don’t worry too much, they’ll be hundreds more",
    "Mine is 58% percentage in puc am i eligible??"
  ]
}