{
  "title": "Easy electives ",
  "content": "I have really fucked up my cgpa in 4th sem so I can't take up  any elective carelessly  and wish to take up the easy ones to boost my cgpa. Which electives are the easiest in 5th sem cse ?",
  "metadata": {
    "id": "1d8ixfl",
    "author": "Awkwardab1304",
    "url": "https://www.reddit.com/r/PESU/comments/1d8ixfl/easy_electives/",
    "permalink": "/r/PESU/comments/1d8ixfl/easy_electives/",
    "score": 18,
    "upvote_ratio": 0.96,
    "created_utc": 1717567663.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "For us, Applied Cryptography (AC) ESA paper was easy af, i scored 80 and my friend scored 97 plus it's not difficult to understand (We had to watch YouTube videos from Neso academy iirc cuz didn't pay attention in class). Computer Network Security (CNS) ISA pattern was all MCQs instead of the standard: 4 theory questions and remaining MCQ, so you can score there if you study. CNS is all theory and does have code, fortunately they didn't ask coding questions to the level we anticipated in ESA\n└── Can vouch for this",
    "You dont mention which branch you are, how can you expect an answer?\n├── Cse\n│   └── Okay, send the list of electives for your batch\n│       └── They haven't released it yet but as per last year for E1 we might have-\n1)Advanced algorithms \n2)Data analytics \n3)Iot\n4) applied cryptography \n5)AR/VR\n6)HCI\n\nAnd for E2 we might have \n1)Unix systems programming \n2)Big data\n3 graph theory \n4) bio inspired computing \n5) Advanced CN\n6) CN security\n├── I have backlog in 2subjects what should I do now?I literally have no idea.When is backlog?Do I have to talk to them and pay them?Please help if you know\n│   └── What happened then?\n└── &gt;Which electives are the easiest in 5th sem cse ?\n    └── I feel ARVR is easy and good. bcoz i took that in my 5th sem. it was very easy and just one drawback is project maybe slightly hard if u dont know Unity and blender, so I suggest u join a team where there are ppl who know these kinda stuff. Teacher is also very good. \n\nSide note: teacher might also make u TA for ur juniors if u are exceptionally good",
    "what cgpa, not sgpa?\n└── 7.3\n    └── 9 and 9 would make you 7.75+ that seems only option ig...damn it sucks\n        └── Ik but now I can't do anything abt it except for trying to increase it as much as I can, and I have nothing to lose from here on as my placement chances are also quite less\n            └── damn, so what you'll do then? without cgpa no masters as well??\n                └── It's not that low also bro. I have seen elders with 5-6 gpa also do mba or ms from good universities and crack good companies. I see u are a 1st year rn u would get to know how difficult it is once u enter 2nd year. 2nd year has been the worst phase of my life academically\n                    ├── Hey I jus finished my 4th sem as well and i am currently in a similar condition (gpa). Is placements l gonna very tough with this gpa?\n                    │   ├── i am in first year, my bad💀\n                    │   └── There is a recent question on CGPA requirements for placements.\n                    └── yea, i am lil too scared, why does it get so hard??\n                        └── The isas and esas are not straightforward from the slides like u get in 1st year and the syllabus for subjects like os, daa is fucking huge. Web tech, the way it is taught and the way the syllabus is organised is a pain in the ass and on top of that we got just 1 day gap b/w exams for 4th sem. Anyways there are people who do well but very few people improve on their first year performance\n                            └── i am cooked then, shitt, i see future you in me, shit, i didn't knew...this tough it is, but like i am good in cs, and i have interest in cs, so i have a feeling i'll clutch anyway.\n                                └── That's good. Now study for ur 2nd sem, it's the easiest sem u will get and  try to get 9 sgpa in it. Even a guy like me scored 8.3 in 2nd sem",
    "Go for Applied Cryptography for E1.\nFor E2 go for Graph Theory if you can mug nicely. It will be useless literally later. But it's useful to score for ESA. For ISA it will be mid.\n└── Is gaining specialization necessary ? And is it useful for masters ?\n    └── It is not useful in my opinion. From what I've heard others say. Undergrad specialization doesn't mean shit."
  ]
}