{
  "title": "pes cs rr vs vit vellore cs",
  "content": "ive booked a seat in both the colleges, will be paying similar fees if i got to any of them.i think the placements r also similar.  \njust wanted to know what you guys would prefer and why?  \nty is advance &lt;3",
  "metadata": {
    "id": "1dacrki",
    "author": "crytios",
    "url": "https://www.reddit.com/r/PESU/comments/1dacrki/pes_cs_rr_vs_vit_vellore_cs/",
    "permalink": "/r/PESU/comments/1dacrki/pes_cs_rr_vs_vit_vellore_cs/",
    "score": 15,
    "upvote_ratio": 0.89,
    "created_utc": 1717772136.0,
    "flair": "PESSAT/Admission",
    "nsfw": false
  },
  "comments": [
    "&gt;think the placements r also similar\n\nKuch bol dunga  tho vivaad ho jayega\n└── The placements are bad in vit? Damn\nI thought it was good for cs atleast ",
    "If fees is same, for CS, definitely PES!\nAs its located in Blr, location matters too much in this field buddy\nIf uh would have asked for other branches, then vit would be the perfect and!",
    "I'd definitely recommend PES for the following reasons  \n1) You're getting cse in the main campus , placements are very good. It's in Bangalore which is the IT hub so u have better exposure and internship opportunities\n\n2) Not worth paying that much fee for VIT because the peer group there isn't great , not to mention the weather too haha ( Peer group because they have 1k rankers as well as 50k rankers in the batch) and PES cse is mostly the under 1k rankers only\n\n3) PES tag is very famous in Karnataka \n\n4) Campus life is not at all great or any better in VIT because it's rules are way stricter , even the curfew timings are almost 2 hours earlier comparatively.\n\nJust another suggestion : Have you tried for CSE at Manipal main campus too?\n├── Hey, pes ec campus cse vs manipal cse?\n│   └── Choose Manipal only if it's main campus. Else pick PES\n│       └── Thanks bro, I was so confused between those two frfr\n├── What are you yapping nigg? Vit tag&gt;&gt;pes tag. And under 1k in pessat where 7k write and vit 20k among 3 lakhs. Why do you guys delulu so hard?\n│   └── Tff do u mean vit tag, no private Institute has tag other thn bits \nAlso good luck with ur delulu\n│       └── U just talked about tag so I mentioned vit has a better brand value and yeah, I'm sorry I ain't no 3 digit ranker 😔😔😔😔\n├── didnt get cs manipal main campus rip  \nis it worth going to blr campus?\n│   └── No\n└── Huh isn't there a huge chunk of management seats?",
    "Placements are way bad in vit Vellore cs than pes cs , a simple comparison would be the tier system of companies \nAt pesu\n\nT1 :12+lac\nT2:5-9lac\nT3: &lt;5lac\nDream :Apple (60+ lac CTC)\n\nAt VIT: \nDream offer :9+ lpa \nT1: somewhere around range of 5-9lpa not sure\n\nThe concept is if you get T1 offer at pesu you get locked from placements till you get dream.Also you can go for T1 if you hold a T2 company offer \nIn Vit it's  same concept ,if you get dream offer you're done with placements but you can see the range is lesser"
  ]
}