{
  "title": "Work in summerbreak",
  "content": "I'm in my summer break after sem 4 rn. Many of my friends who I would say are equal or higher in calibre, have gone on to do some sort of internship/pil etc. I willingly stayed out because I feel I have a lot more to learn and don't wanna rush just for credits. Have I messed up and are there others whove walked a similar path?",
  "metadata": {
    "id": "1db63dw",
    "author": "Previous_Locksmith_1",
    "url": "https://www.reddit.com/r/PESU/comments/1db63dw/work_in_summerbreak/",
    "permalink": "/r/PESU/comments/1db63dw/work_in_summerbreak/",
    "score": 21,
    "upvote_ratio": 0.96,
    "created_utc": 1717862263.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "I interned last summer coz the summer break in 3rd yr is more important you mostly should not intern then because you will have placements from August right after so it's better you do an internship now so that you can have atleast 2 credits.\nMany of my friends are doing internship now as well but personally i will advise you not to because you won't have time to  for internship and at the same time prepare for placements.\nYou still have time try getting an internship.\nDoesn't matter which field just get it\n├── I have a different point of view. \n\nSummer internships (canonically the one after 3rd year) are the only time you can actually intern at top companies and well known MNCs, including Microsoft, Amazon etc. This the closest you will get to interning and gaining valuable industry experience at a major company, which helps a LOT more during resume shortlisting off-campus and even during interviews. Additionally, if you do perform well, you will simply get invited back next Spring (8th semester) for the Spring internship and might even get a verbal agreement for a PPO, and all this is even before the placement cycle officially begins at PES. And before you ask, yes, there are students who have gotten PPOs or verbal agreements right from the summer - I know people at my own company. But yes I agree, a PPO is very performance dependent. \n\nI would suggest to try getting a good internship as much as possible. It helps. Perform well and your final year might end up becoming just a formality. I interned throughout the summer after 3rd year, throughout 7th AND 8th sem, and I know that I wasn't the only one. People do this and turn out fine.\n\nAnd if you can get into such a company, trust me you already have the basics (and probably more) in terms of DSA and problem solving skills to get placed - all that is left is to remain in touch with these skills.\n│   └── I am in 6th sem rn, interning at an early stage AI startup. how did u prepare for dsa and other stuff while interning?\n│       └── Just stay in touch with the basics and practice your problem solving skills. Remember that you don't need to be an expert at DSA - you only need to be good enough to solve a bit higher than what has been covered in the syllabus. Honestly, as long as you have a good grasp on your basics, can work on your ability to solve problems, you can solve most problems.\n└── This. \nAgree with this 100%.\nI did this and was super prepared for the placement season. \nIt's very important to resist the fomo"
  ]
}