{
  "title": "Out of India scope provided by PES.",
  "content": "I am planning to join PES (cs in ecity) this year and have plans of doing my master's abroad.  \nHow much can PES help/play a role in this?  \nI also have VIT Vellore core cs category 2 and many seniors told its good if you want to go abroad but I liked PES more so pls do tell me your opinions too",
  "metadata": {
    "id": "1dbrk3w",
    "author": "4dxrsh",
    "url": "https://www.reddit.com/r/PESU/comments/1dbrk3w/out_of_india_scope_provided_by_pes/",
    "permalink": "/r/PESU/comments/1dbrk3w/out_of_india_scope_provided_by_pes/",
    "score": 15,
    "upvote_ratio": 1.0,
    "created_utc": 1717932392.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "Firstly, a bit of information: **No college will actively help/spoonfeed you**. Whether you are in an IIT or at PES, it **is up to you to make use of the opportunities at hand**. Given this, a better ranked college such as any of the T1 colleges will also provide way more opportunities than a lower ranked college to build your profile. These opportunities can come in the form of research and work experiences. But its not impossible for a T3 grad to have the same experiences, just more difficult to gain access to them. Thats why a good UG college reputation is at best a \"good to have\" rather than a \"must have\".\n\nAs for what opportunities PES offers for MS admissions, I recently added a detailed comment regarding the same a few days ago [on this thread](https://www.reddit.com/r/PESU/comments/1dav416/comment/l7n6f99/). This should cover all your questions.\n\nIt is impossible for any of us to say whether the opportunities at VIT are better, although it definitely isn't easier given the massive batch size at VIT. But this is for you to find out from the VIT sub and seniors. You should also reach out to seniors from these colleges currently pursuing or have pursued MS on LinkedIn and get their opinions.\n\nI will end this answer by quoting my other comment:\n\n&gt;Also unrelated and unwanted advice but thinking about Masters even before Undergrad is a stupid move because requirements, plans, goals and everything change over the course of 4 years and a Masters degree relies a lot on these. You should revisit this decision only after your second year once you have an answer to all of these. You will yourself realise that it was too soon to think of a Masters before understanding more about what you want to study.\n└── thank you for this response!",
    "Take PES if u get RR campus only. since you're getting the main campus for VIT go for it"
  ]
}