{
  "title": "Dress code for girls",
  "content": "Just a random question, but are crop tops, sleeveless tops allowed in the university? Or is there any specific dress code?",
  "metadata": {
    "id": "1desmjd",
    "author": "Lumpy-Breath4671",
    "url": "https://www.reddit.com/r/PESU/comments/1desmjd/dress_code_for_girls/",
    "permalink": "/r/PESU/comments/1desmjd/dress_code_for_girls/",
    "score": 8,
    "upvote_ratio": 0.9,
    "created_utc": 1718261349.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "I see girls wearing crop tops and sleeveless tops everyday. I don't know if it's against the rules but a few teachers may not like it.\n\nI've worn sleeveless kurtis before and no one cared\n└── How's the college overall? Emma going to join this year XD",
    "Depends on your course ... It's allowed for BTech ig\n└── Wait there are different levels of strictness for different departments?\n    └── Other departments like nursing and BBA have uniform\n        └── No shit?\n            └── You constipated or smtng?\n                └── Having Uniform In College, excluding Btech Only,\nWow.\n                    ├── Tf should I do about that 💀\n                    └── Is that true? Wasn't it only for those got admission thru management or smt\n                        └── new Conspiracy initiated.",
    "Its allowed but depends on your teachers some don't care but some do ,wearing something like torn jeans and shorts are not allowed for both boys and girls, for a cropped top like 70% teacher don't give a shit but a few boomers do, they will just tell you don't wear it next time thats all .\n├── That's true but I think torn jeans are allowed\n├── Wait are you sure about torn jeans??\n│   └── They are allowed but a lot of teachers don't like it\n└── What about sleeveless tops??\n    └── Some of the male teachers they don't like sleeveless tops but usually nobody questions it, for some reason every teacher has a problem with torn jeans\n        └── you expect them to not react to wearing torn jeans. We are going to college so don't dress like a bhikhari 😂😂😂, be professional.\n            └── Womp womp nigga\n                └── Womp womp loser\n                    └── Touche",
    "You've come here to study, dress decently this is a college not a randikhana\n└── Uh fyi I was just asking, As most of my clothes are mainly crop tops.. so I just wanted to know what's the scenario in college plus what tf is randikhana.. whenever I wear crop tops or sleeveless tops, I look decent enough..and there are no rules as such for clothes and I have every right to ask whatever I want to"
  ]
}