{
  "title": "Electives and CGPA",
  "content": "Does cgpa have anything to do with choosing electives? Are certain electives or teachers assigned according to cgpa or is there no such relation? ",
  "metadata": {
    "id": "1djc79i",
    "author": "Khayali-Biryani",
    "url": "https://www.reddit.com/r/PESU/comments/1djc79i/electives_and_cgpa/",
    "permalink": "/r/PESU/comments/1djc79i/electives_and_cgpa/",
    "score": 7,
    "upvote_ratio": 0.9,
    "created_utc": 1718777640.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "&gt;Does CGPA have anything to do with choosing electives? \n\nNo, it does not. Electives are something which you can opt in the 3rd year. These are courses which you opt over the already existing 3 core subjects  \n\n&gt; Are certain electives or teachers assigned according to cgpa or is there no such relation?\n\nNope, there is no such relation.\n└── Uhm no. If you are in CS, when there are multiple profs for a single elective, a form is sent out asking you your preference for profs taking a course. These are then allotted based on your CGPA, so the person with the highest CGPA gets first pick and so on. This might not be the case for ECE because of the lower batch strength but for CS electives like Big Data, Data Analytics etc, there has always been a priority list based on CGPA.\n    ├── Im from EC campus entering my 4th yr right now this didnt happen for us. Certain sections were allotted a Professor at random. Maybe thats the case in RR campus ,also not sure if that is still happening.\n    │   └── Ah, it is possible it did not happen for EC, but that usually happens at RR. I remember as TAs we had to sort through entries in the form filled out by juniors too.\n    ├── Ah okay. Atleast in ECE, this does not happen. thanks for clarifying\n    └── So you are saying that there'll be shuffling again based on the CGPA you got? Damnnnnnnn\n        └── bro for the elective classes alone you have to move to a common class ,for the core subjects the class remains the same as 4th sem\n            └── Okay, understood"
  ]
}