{
  "title": "Electives ",
  "content": "How do we go about selecting electives \nWhen it comes to specialisations \nWhich one is the best in terms of:\n1) In demand / most useful\n2) Ease of scoring and improving GPA\n",
  "metadata": {
    "id": "1djf129",
    "author": "Strange-Slide-5300",
    "url": "https://i.redd.it/h01h3b1tzh7d1.jpeg",
    "permalink": "/r/PESU/comments/1djf129/electives/",
    "score": 6,
    "upvote_ratio": 0.88,
    "created_utc": 1718789558.0,
    "flair": "Study Help :table:",
    "nsfw": false
  },
  "comments": [
    "Its difficult to help if you do not include the names of the courses. Add those to your post and I will update my comment.\n└── hey thanks for your reply \n\nwe can't edit image posts so I'll list out the courses here \nElective 1:\n\nAdvanced Algorithms. \n\nData Analytics . \n\nInternet of Things . \n\nApplied Cryptography. \n\nVirtual and Augmented Reality . \n\nHuman Computer Interaction .\n\n\n\nElective 2:\n\nEnterprise Business Systems .\n \nBig Data. \n\nGraph Theory and it's Applications. \n\nBio-inspired Computing . \n\nAdvanced Computer Networks . \n\nComputer Network Security. \n\nRobotics with ROS.\n    └── Useful electives: Adv. Algo, Data Analytics, Big Data\n\nScoring electives (this is subjective, and the syllabus changes every year so its not possible to predict): Data Analytics, IoT, HCI, ERP, Graph Theory\n        ├── Is data analytics scoring for someone who is weak in maths. Like I am okay with the concepts but always shit the bed in the exams like isas with time constraints in math intensive courses\n        │   └── The course is basically a math course. It depends on what kind of math you do not like. There isn't any calculus, its mainly stats and probability and a bit of algebra. I would suggest going through the syllabus to figure it out.\n        │       └── Is applied cryptography scoring?\n        └── Even applied cryptography was a pretty scoring elective last year.\n            └── Ah, it wasnt really scoring 1-2 years ago. \n\nAs I said, scoring is pretty subjective. HCI and a bunch of other courses alternate between being easy and difficult.",
    "Also how is bio inspired computing as an elective \ncan someone who has taken it please share"
  ]
}