{
  "title": "5th sem electives",
  "content": "I dont have good cgpa.. so please suggest me which are the  electives that are easy to understand and can get me some good grades.",
  "metadata": {
    "id": "1djlsa9",
    "author": "Several_Appearance78",
    "url": "https://www.reddit.com/r/PESU/comments/1djlsa9/5th_sem_electives/",
    "permalink": "/r/PESU/comments/1djlsa9/5th_sem_electives/",
    "score": 7,
    "upvote_ratio": 0.82,
    "created_utc": 1718810456.0,
    "flair": "Study Help :table:",
    "nsfw": false
  },
  "comments": [
    "What's your branch dude?\n└── Cse",
    "You seem to belong to the CS branch so all I'll say is that AC is very easy to understand, CNS is manageable if you pay attention. I picked these electives and performed fairly well. But I highly suggest you consider choosing electives you're interested in, rather than selecting random electives just for the GPA boost.\n└── Which one is more scoring and easy to grasp, graph theory or cns ?\n    └── There's a lot of mugging involved in GT, and it depends on the person to decide how easily they can grasp it. ISAs are a little difficult in GT. When it comes to CNS,  the concepts are quite easy to understand but there are coding parts which can be a little difficult to understand but it's not bad overall. Also, CNS ISA questions will all be MCQs.\n        ├── is that specialization necessary?\n        │   └── Well it's not necessary but it definitely helps a lot if you have an interest in a specific field and would like to work in that sector.\n        └── And will I find cryptography and CNS difficult if I didn't do well in cn in 4th sem ?\n            └── Cryptography is a very easy subject IMO, it's just solving puzzles and it's also very interesting. CNS on the other hand requires a decent understanding of CN and uses many concepts that you learn in it. But CNS is also interesting in its own way as you get to learn about computer viruses, learn how attacks work and simulate attacks during CNS lab sessions. Either way, CN is a core subject and you'll need to understand the subject for placements so don't worry if you didn't do well before. If it sounds interesting to you, take it."
  ]
}