{
  "title": "ELECTIVES For Sem V",
  "content": "I'm heading into semester 5 and need to pick my electives. Can anyone share what to expect from the different options? Are they mostly theoretical, heavy on coding, or more like specific subjects such as LA, DSA, DAA etc ? Any advice would be really helpful. Thank you.",
  "metadata": {
    "id": "1dkbkk4",
    "author": "raincatmeow",
    "url": "https://i.redd.it/upg5xo87aq7d1.jpeg",
    "permalink": "/r/PESU/comments/1dkbkk4/electives_for_sem_v/",
    "score": 28,
    "upvote_ratio": 0.95,
    "created_utc": 1718889910.0,
    "flair": "Study Help :table:",
    "nsfw": false
  },
  "comments": [
    "Note - my info might be outdated because it is from 2021. I also took Big Data, Data Analytics and HCI personally, as well as was the TA for Big Data, so expect some bias for these courses.\n\n* Elective 1:\n   * Adv Algo: The most useful for placements because it covers concepts above what is expected. Its a mix of theory and hands-on but it is known to be tough (or *advanced* hehe). Before taking this up ensure you are strong with DSA and DAA concepts, otherwise, struggle is guaranteed.\n   * Data Analytics: Pretty much only math. It comprises mainly stats, probability and algebra. Questions in the ESA are also 95% numericals. It is a fun course for those who are interested in these topics and is pretty useful IMO. The math isn't touch by any means but it is a LOT of math and not for someone who is turned off by it. This is also a heavy course with assignments as well as a paper submission. Its a great opportunity if you are into research.\n   * IoT: Did not personally take these but usually its pretty easy. There is a small project involved which is straightforward using arduino because multiple such projects are available online.\n   * Applied Crypto: This course tends to swing between easy and difficult across different batches. Its unpredictable and one cannot say how it will be for your batch. My batch and the one before mine found it extremely tough but recently people found it easy.\n   * ARVR: No clue, ask someone who took it up. Its a new course, introduced probably 2 years ago at most.\n   * HCI: Easy and straightforward but entirely theoretical and memorisation based. If you want an easy course which does not require applying much brain power then this is the one. There is a lot to memorise however and the subject matter isn't very interesting, but everything in the ESAs is asked directly from the content. There usually is a small project which can be done in a week or so.\n* Elective 2:\n   * ERP: Did not take this, but heard its pretty easy to score in and straightforward. Dont remember if there was a project.\n   * Big Data: My favourite course throughout PES. Very well planned out, really great content &amp; syllabus, amazing deliverables and overall an amazing experience. A *very* hands-on course, this is by far the closest you will get to a course that shows you how things work in the industry. I owe my job to this course lol. This course is pretty heavy - 3 assignments AND a project. But all the learning in this course happens through these deliverables. Also, since the scale of these projects are larger, most people who opt for Big Data end up having their project on their resume because of the quality. Overall, its a great course I 100% recommend. You will learn more in this course than any other and apply techniques which are industry relevant. Majority of the tools/techniques I apply every day at work are scaled up versions of the projects and assignments covered in this course.\n   * GTA: Usually very easy and straightforward, but its also a pretty interesting course. Would have opted for this if I did not have any other choice. There are assignments (and a project if I remember). A lot of people opt for this. Its a great course overall.\n   * BIC: At this point its probably a mystery because this course almost always gets cancelled due to low enrollment lmao. No clue about this.\n   * Adv CN: Similar to Adv Algo, its a challenging course. Most of the people who opt for this are ones interested in CN. If you want to opt for it, make sure you are really good with CN concepts. I've heard its a decent course but I don't know about its assignments/project.\n   * CNS: Similar to Adv CN. Its a niche area so not many opt for this. This is taken directly by IFSCR if I remember correctly and is mostly assignment/project driven.\n   * ROS: This is new, we did not have this. So no clue.\n\n  \nBefore you choose electives, make sure to check (1) who is taking the course and (2) the syllabus for the course. These are factors that will determine how the course is. Sometimes, a great prof takes a difficult course and it ends up becoming easier than a trash prof taking an easy course. Since you already know who is in charge, try finding out the syllabus. If you cannot find the syllabus, use the most updated syllabus from the previous year and see if you actually like the concepts. Only then make a decision. \n\nAlso - don't focus on specialisations. Pick courses you like. Specialisations are useless.\n├── Doing GOD'S Work \nThank you u/rowlet-owl\n├── Data Analytics doesn't have a paper presentation, but a hackathon now for 6 marks. The worksheets count for 4 marks. You form teams of 3 and it takes place on Kaggle. For us, the question was stock market related. If you rank in the top 30%, you get the 6 marks straightaway but if you don't, you can get those marks through an additional worksheet.\n│   └── Thank you!!\n│       └── Yw! I made an edit so its a bit more detailed now!\n└── Thank you so much !!! I was really confused and this was really helpful.",
    "  \nThese are the faculty members for the electives in the EC campus:  \nDa - bharathi  \nCrypto - Sheila Devi   \nBio computing - arti arya   \nRobotics - Gokul  \nBusiness - Nivedhita   \nHCI - Geetha   \nBig data - Animesh  \nCN security - Saraswathi  \nIot - vinodha  \nAR VR - mannar  \nAdvanced algo - Vandana  \nAdvanced CN - Chavan   \nGta - arti arya\n└── Animesh is decent/good for Big Data. I'm still in touch with him. Fun fact: he scrolls through this subreddit and follows up with it lol.\n\nArti Arya is good as well. Although, she is primarily known for taking deep learning/NLP-related coursework and is also known to be a good research advisor. I am unsure how she will fare with GTA and BIC.\n\nYou should reach out to immediate seniors and ask their opinion on not just the prof but how they take up the specific course.\n    └── Thank you so much. I'll reach out to the immediate seniors for the other electives."
  ]
}