{
  "title": "bd course structure",
  "content": "hi does anybody have the course structure pdf for big data (e2)? can't find it on discord or betterpes \n\ni want it to check the distribution of marks for the course since i've heard the project carries a big chunk of it \n(the first ppt of the course generally has that information but the bd ones i found don't somehow)",
  "metadata": {
    "id": "1dl8q2m",
    "author": "shiurts",
    "url": "https://www.reddit.com/r/PESU/comments/1dl8q2m/bd_course_structure/",
    "permalink": "/r/PESU/comments/1dl8q2m/bd_course_structure/",
    "score": 8,
    "upvote_ratio": 1.0,
    "created_utc": 1718988814.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "I took the course in my 3rd year (2020) and was the TA for both the RR and EC campuses in my 4th year (2021). But this info could be outdated by now.\n\n2 ISAs, both added and scaled down to 30\n\n1 ESA, scaled down to 40\n\n3 assignments x 5 marks each = 15 marks\n\n1  project, 15 marks\n\nTotal = 30 + 40 + 15 + 15 = 100\n\nNote - I am not too confident about the scaling because I've kind of forgotten but I am pretty sure about the 3 assignments being 5 marks each and the project being 15 because I still have the files I created for the course. If you'd like, I can share those as well if you'd like to see the content.\n└── damn so the project is the same weightage as an isa\n\ncould you please share the project and assignment files would love to get a better idea of the course,,, tia :)\n\nalso off topic but how do u become a ta for both campuses at once lol did you have to physically travel back and forth?\n    └── Sure. DM me, I'll send the files. \n\nAnd lol this was during COVID. There wasn't any travel involved. It was pretty stressful cause we had 650+ enrolled kids that year across both campuses",
    "I took the course last year and it was 30+10+10+50 where 30 was isa component and 10 marks for assignments and 10 marks for project + 50 from esa.\n├── ohhh i see thanks a lot!!\n└── bro was esa and isa difficult for bd\n    └── ISA's were hard and esa was easy"
  ]
}