{
  "title": "Rethinking Professor Quality at VIT, MIT and Similar Institutions\n",
  "content": "Hi everyone,\n\nI recently analysed thet h-index of CSE senior professors at VIT (Manipal/Chennai) and MIT (Manipal/BLR) using Google Scholar. The h-index is a metric used to assess the impact and productivity of a researcher's publications.\n\nBased on my findings, a majority of the professors at these institutions have an h-index of 10 or lower, which suggests an average level of research output. This raises a question about the frequent discussions comparing these colleges without any data-driven support for which one is truly \"better.\"\n\nWhile I haven't looked at RV, PES, or BITS Pilani yet, I wouldn't expect to see significantly different results.\n\nIf you want to see for faculty in your college, search the prof name on\n\n[https://scholar.google.co.in/](https://scholar.google.co.in/)\n\nClick on Prof/researcher name under profile section. h-index will be listed on the right.\n\nThis will help take right decision regarding which college to join and selecting right prof for projects so that you have a powerful LOR if planning to go abroad.\n\nPS: Based on feedback from others, I delved a little deeper. For the faculties in these colleges (BITS, VIT, Manipal, RV, PES), the i10 index and the number of citations are also pretty bad to average. So, there is no indicator of good quality research. Very few professors are definitely better than average by Indian standards",
  "metadata": {
    "id": "1dlr7dr",
    "author": "OkRecognition2932",
    "url": "https://www.reddit.com/r/PESU/comments/1dlr7dr/rethinking_professor_quality_at_vit_mit_and/",
    "permalink": "/r/PESU/comments/1dlr7dr/rethinking_professor_quality_at_vit_mit_and/",
    "score": 17,
    "upvote_ratio": 0.87,
    "created_utc": 1719045799.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "Absolutely pathetic metric,\nI'll tell you why.\n\nH-index is , if you have 7 papers with 7 or more citations each you get a 7 H-index.\nSo if you work say on big projects, ground braking research you'll only publish like 2 papers a year. They will get tons of citations (assume it, doesn't always happen) and your h-index becomes 2 (p1-1000-cite, p2-1000 cite)\nAnd then there are professors who have the bulk of students doing shit work but need Scopus for NIRF ranking. So they cross cite their own papers and take say 20 papers from BTech, MTech, PhD students and get that published in a crap conference with Scopus index proceeding or a low hanging Scopus journal.\n(p1-20, p2-20....p20 -20) Now this prof has h-index 20.\n\nTell me which prof is doing better \"quality work\".\n\nA good reference would be\nThis link gives the h-index of all VIT prof (original university websites) : https://www.adscientificindex.com/?university=VIT+University+Vellore\n\nI think at least some 30-35 profs have a h-index of 25+.\n\nNow, \nThis is the scholar profile of Robert Metcalfe\nThe University of Texas at Austin\nWho was the Turing Award (Distinction) winner of 2022 and he has a h-index of 9 (last 5 years) and 22 (lifetime).\nFor those who don't know Turning award is sort of the Nobel in CS.\n\nhttps://scholar.google.com/citations?user=EKGzIBYAAAAJ&amp;hl=en&amp;oi=ao\n\n\nThus, VIT has at least 30+ profs who are better researchers than the Nobel Laureate level CS researchers 😂😂😂.\n\n\nEven the good professors at IITs who get crores of funding and working with leading companies have h-index of &lt;20. H-index talks about the popularity of your research not the quality. \n\n\nThis same message is on a ton of channels cause VIT is trying to I guess sell the same label for students to choose VIT over other colleges 😂😂😂😂, come on man be more creative then that.\n└── Most of the VIT prof you are mentioning are not from CSE. h-index is not perfect. More over Robert Metcalfe is an anecdote not statistics and fail to cover very ground breaking research which most researcher find difficult to comprehend. Do not tell me professors in Indian colleges are Robert Metcalfe. For one Robert Metcalfe, there will hundreds of faculty member of Ivy league with great h-index.\n    ├── Bro,\nThe measure of h-index is questioned today by everyone \nProfs are printing 400+ papers a year. If you are genuinely a scholar you'll know that. But I took Robert Metcalfe as one example 2023 winner didn't had a page so I took the latest Alternative.\n\n\nYou want to search profs on quality check how much money did Google Microsoft gave to them for research , or how many of them have presented in ACMKID, NeuroIPS, ICML, ACL etc \n\nThat is a parameter of quality or check how many IEEE transactions or ACM Transactions they have published. \nThese popularity measures are great for sorting popular magazines in library, but have no place in research. Trust me, I have been in the research domain for 5+ year now, even with a Indian degree I landed my first job in a Australian University at the age of 26. My h-index :1, candidates I know who got rejected 15, cause the colleges there didn't want a printing press, but people who can do research to get grants from industry, govt and make some real work.\n\nIf you the first thing in research you know the #1 publisher of research in most disciplines is Nature.\n\nHere are their views,\n\nIndia tops submissions in predatory journals\nhttps://www.nature.com/articles/nindia.2017.115\n\nBy the guy who created this measure \n\nWhat's wrong with the h-index, according to its inventor\n\nhttps://www.nature.com/nature-index/news/whats-wrong-with-the-h-index-according-to-its-inventor\n\n\nThe Print (News)\n\nIndian PhDs, professors are paying to publish in real-sounding, fake journals. It’s a racket\nhttps://www.google.com/amp/s/theprint.in/ground-reports/indian-phds-professors-are-paying-to-publish-in-real-sounding-fake-journals-its-a-racket/1535766/%3famp\n\n\nSee, I'm not critical of the university itself. I have friends there and it's a decent college but all this h-index thing and saying they are \"quality\" researchers that's absolute BS.\n    │   └── Also lets just stick to this subreddit can't copy past too many messages, not a bot account😅\n    └── Only those in the research world really know how horrible the h-index method is. H-index is not at all good metric to compare work done in a field, or the quality of their work. Nor does it say anything about a professor's teaching capability, personality and patience. There are plenty of professors who fit in only few of these categories and lack in others. If you just passed 12th, it will be hard to truly understand.\n        └── For the faculties in these colleges (BITS, VIT, Manipal, RV, PES), i10 index and number of citations are also pretty bad to average. So there is no indicator of good quality research. Very few profs are definitely better than average by Indian standard.\n            ├── Boss, \nWhen you know the scale can be and is manipulated all you are saying is at least VIT profs knows how to manipulate it well.See VIT has good profs, so do others but none of them is really useful to BE students. \n\nA good analogy: The best batsman in PNG is still a batsman in PNG, and till the point someone calls him to IPL, he isn't a professional cricketer.\n            │   └── I delved a little deeper. For the faculties in these colleges (BITS, VIT, Manipal, RV, PES), the i10 index and the number of citations are also pretty bad to average. So, there is no indicator of good quality research. Very few professors are definitely better than average by Indian standards\n            │       └── True.\n            └── did you even read my comment before copying pasting a reply?",
    "Check rv , bms , Msrit, pes first",
    "No matter which college, most professors in this tier of colleges are meh at best. Each college would have a few and maybe if you're lucky you'll make use of it. \n\nBut overall for most people the professor doesn't make a difference",
    "Most of the good professors have left PES that’s for sure, the current new professors barely know the subjects they are teaching and are below average at best.\n└── He is a spammer and the faculty crisis is not in PES but everywhere in general.\n    └── Thank you for writing this. As a 12thie I hate it when people spread false claims. It subsonciously makes you doubt the choices that you made.\n        └── Don't worry about it, your institution has enough to give you a launch pad. \nPut efforts and fly high."
  ]
}