{
  "title": "Big Data assignments and ISAs are pain💀",
  "content": "I've heard a lot about Big Data elective being the most useful out of all electives available in elective-2. I contacted a few seniors who took it and they said this:\n\n1. The assignments are very hard and moreover they give a extra hard time during submissions because of how distressing the submission platform is. Personally I am fine with the plagiarism check part but adding to that the seniors said this: It takes many submissions to match the output the platform wants (issues regarding white spaces and comma differences ,etc.) , no feedback about where is the problem exactly in the answer , or which test case it has failed if there are many outputs that has to be matched then at which level it failed , hidden test cases ,etc.\n2. Very confusing MCQs in ISAs for Big Data.\n\nThis is the common insight I got for Big Data from numerous seniors. Despite it being very useful and the project it comes with being CV worthy , the amount of time it will demand scares me as I have to regularly prepare for placements and at the same time maintain my cgpa. I want to know what to do because in elective-2 I find only ERP worth taking and bit interesting other than BD.\n\nSo how hard would it be to manage or should I just not opt for it , I would appreciate receiving a range of opinions and responses on this matter.🙂",
  "metadata": {
    "id": "1dlsgcc",
    "author": "Content-Walk9994",
    "url": "https://www.reddit.com/r/PESU/comments/1dlsgcc/big_data_assignments_and_isas_are_pain/",
    "permalink": "/r/PESU/comments/1dlsgcc/big_data_assignments_and_isas_are_pain/",
    "score": 15,
    "upvote_ratio": 0.91,
    "created_utc": 1719051191.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "Just take whatever interests you\n.At the end of the day you need to put effort.\nSide note- Acc to me all cs elective look and feel the same",
    "The thing about white space and other issues is true but the TAs this year were really helpful , there was also a chance to makeup for some assignment marks.\n\n\nAs for the second part about isa being hard it is also true but tbf the esa was equally easy to make up for it. Same with the project evaluation , as long as the professor felt you actually worked on it. \n\n\nThe slides are good , assignments and projects actually helped in learning and I personally felt they were worth the time spent studying them. \n\n\nIt also depends on interest and varies from person to person I found it interesting and easy to score personally but some of my friends felt the course was not worth it and hard to score. \n\n\nI would say read up about topics in the course and see if it interests you before picking it up.\n└── Is the course too much time consuming? I mean the assignments and everything we have to do on our own it will take up some time but with the additional difficulties that comes with the submission platform , it makes me think how much time will it really consume💀\n    └── I remember the assignment took me around 6-8 hours of focused work for the second assignment as I had trouble understanding what to do but that was because I had not paid attention in class so had to watch yt and read documentation for the assignment. \n\n\nThe first assignment though is usually easy and if you listen to class and read up a bit of previous year assignment question and solution it will hardly take 1-3 hours including required installations.\n        └── So there were only 2 assignments in BD for your batch?\n            └── 2 assignments but each had 2 sub questions , the second assignment had both parts big enough to be stand alone assignment"
  ]
}