{
  "title": "Doubts regarding special topic courses ",
  "content": "Could someone kindly clear up the doubts I had regarding special topic courses? I've listed them below: \n\n1) How many credits do we need to obtain through special topic courses and upto how much credits would 1 course have? Also, is it mandatory? \n\n2) Do we need to get those required credits before 7th sem starts or by the end of our degree (before end of 8th sem)?\n\n3) Can you list out the special topic courses available for CSE and AI &amp; ML students in particular? \n\n4) How much time would these take up? How many classes per week and no. of assignments/projects/tests? Will it be manageable? \n\n5) Also, when can we take up these courses? Can we only take them up during an ongoing semester or can we do it during the summer/winter breaks? \n\n6) Lastly, which sem is like the best time to take up these courses in your opinion? \n\nThankyou",
  "metadata": {
    "id": "1dnbx90",
    "author": "Head_Fish794",
    "url": "https://www.reddit.com/r/PESU/comments/1dnbx90/doubts_regarding_special_topic_courses/",
    "permalink": "/r/PESU/comments/1dnbx90/doubts_regarding_special_topic_courses/",
    "score": 8,
    "upvote_ratio": 1.0,
    "created_utc": 1719230956.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "Special topics are 2 credit courses offered by every department. You need to take up a certain number of special topics to meet the credit requirement for your degree.\n\n&gt;How many credits do we need to obtain through special topic courses and upto how much credits would 1 course have? Also, is it mandatory?\n\nEach course is 2 credits, and yes they are mandatory. The exact number of special topics needed is not fixed, but you have to take up a minimum of 5(?). There is no fixed maximum because it depends on how many *you* need to meet your degree requirement of 160 credits. If you fail to get an internship in 8th semester, then you will be forced to take as many special topics as needed to meet the credit requirement.\n\n&gt;Do we need to get those required credits before 7th sem starts or by the end of our degree\n\nYou can get most of your special topic credits beforehand. If you cover one ST each in 3rd, 4th and 5th semester, along with 1 ST in the 2 summer breaks between 1st and 2nd year and 2nd and 3rd year, you have already covered 5 STs. This will ensure that most of your STs are covered before the final year begins, so you will have minimal load in the final year. Most students opt for this because it gives them more time to focus on Masters/placements. Some even take up more courses because college does allow you to swap one ST with another in final year (T&amp;C apply).\n\n&gt;Can you list out the special topic courses available for CSE and AI &amp; ML students in particular\n\nThey mostly remain the same every year and each semester has a different list of STs. Since they usually don't change, you can find the courses and the syllabus for each on PESU Media server. Check FAQs for more info.\n\n&gt;How much time would these take up? How many classes per week and no. of assignments/projects/tests? Will it be manageable\n\n2 hours of classes per week. These are pretty straightforward because the content in itself is very less. Most people finish the syllabus in 3-4 days before the ESA. They are easy S grade courses. Sometimes they have a minor assignment or project. They are definitely manageable.\n\n&gt;Also, when can we take up these courses? Can we only take them up during an ongoing semester or can we do it during the summer/winter breaks\n\nAnswered earlier but max of 1 during the semester and 2 courses during each summer. There are no courses during the winter break at PES. Note that even if you max out all STs, you will still be forced to take up at least 1 in the 7th semester because each semester has a minimum number of credits. So while its suggested to finish them quickly, its also important to leave room for 1-2 in final year.\n\n&gt;Lastly, which sem is like the best time to take up these courses in your opinion\n\nEvery semester. As I mentioned - it gives you more free time in final year to work on other priorities and also gives you room to swap a course if you perform poorly.\n\n---\n\nu/PYUchiha7's questions:\n\n&gt;Are special topics and elecvies different?If yes,wt are they?\n\nElectives are 4 credit courses in 3rd year which need to be taken up 2 per semester in 5th and 6th respectively. These are full-fledged courses like others you have covered so far. These are mandatory to take up in those semesters itself. Think of these just as any other course you have taken up.\n\nSTs are 2 credit courses taken across different semesters. You are free to take it up whenever you wish to, but most people take them up whenever they are offered as I mentioned earlier.\n\n&gt;If we do an internship after 2nd year,will it be compensated for a special topic or an elective(if they are diff)\n\n\"Compensate\" would be the wrong term here. But yes, if you do an internship then the credits from it will allow you to take up a lesser number of STs. However do remember that you are allowed to claim a maximum of 6 credits through internship (but those 6 can be split in any way: 2+4, 2 + 2 + 2, etc).\n└── Thanks a lot for the detailed answer u/rowlet-owl bro \n\nI looked up on the PESU media server but couldn't find anything on the list of special topics though. I wanted to know the list of special topics available in sem-3 and sem-4 under CSE and AI&amp;ML. Any other way to get it? \n\nBtw if I decide to take up a special topic course during the summer, would I have to be present in campus throughout the duration of the course or can I attend class online and just come to campus for the project/assignment submission and ESA?",
    "special topics are two credit courses that you need to take up in order to get all the credits needed to complete your degree. Special topics are sort of like electives in terms of the fact that they allow you to choose one subject from a set of subjects offered by the uni. You can either take up these special topics over the summer or do them during the third or fourth sem \n\nwe used to have three classses every friday for special topics (45 min each)\n\nthere were no assignments. You only have to make one project (which is very easy)\n\nin my opinion you should take special topics in both 3rd and 4th sem, this would allow you to have the entire summer for yourself.\n\nSpecial topics offered to my batch in sem 3 were: C++, R and Unix (R was by far the easiest one)\n└── Thankyou bro.\n\nBtw what special topics were offered in 4th sem for you guys? \n\nAre the classes for special topics online or offline? \n\nAlso, for the ones who take it up during the summer will it be online or offline? \n\nLastly, what is your view on taking CIE courses for Special Topic? Is it useful and will it take up a lot of time?\n    └── Yes special topics were offered in the fourth sem.  Courses were: Golang, java, matlab and rust(these might be different for your batch)\n\nClasses are offline.\n\nAlthough Im not one hundred percent sure on this but the classes for the summer courses are also offline\n\nFrom what ive heard cie is pretty strict when it comes to attendance and it takes up time. I wouldnt recommend you to take it cause the special topics are just so easy and dont require you to put up a lot of effort during the semester. (i legit only studied a day or two before the exam and managed to get an S grade in both my special topics)",
    "Just 2 additions:                                                                              -Are special topics and elecvies different?If yes,wt are they?\n-If we do an internship after 2nd year,will it be compensated for a special topic or an elective(if they are diff)?"
  ]
}