{
  "title": "Is partial drop posible in pesu???",
  "content": "So i was alloted pes rr campus cse during counseling, my mains went bad which i wont be taking here and my main aim was bits but due to some reasons i couldn't get a great score. I was willing to take a full drop but my parents (and a part of myself) are hesitant because if i fail in drop, even the present opportunity will be wasted along 1 year. So im planning on doing a partial drop from pes mainly for bitsat and i have a few questions regarding these.\n\n1. Will i be getting free time of around 3 to 4 hrs everyday to study for this?\n\n2. How hard are the academics in pes(ive heard they're a bit hard) and is it feasible to do hoth college and jee academia during college?\n\n3. If, lets say i do get a good score after my 1st year and i get into bits, will the college allow me to leave? What i meant was that some colleges ask you to pay whole 4 years  fee in this cases and some colleges dont allow to leave the college itself.\n\n4. Will i have to sacrifice a major part of my social life for this?\n\n5. Lets say if i fail my partial drop, how hectic would it be for me to recoup all the potential learning stuff and social life in my 2nd year?\n\n6. And lastly, do you recommend taking a partial drop? Especially which isnt advanced oriented? It feels that if i try hard enough i can convince my parents for a full drop so please share your views on this.\n\nThank you.",
  "metadata": {
    "id": "1do5u5x",
    "author": "phe2_hxh",
    "url": "https://www.reddit.com/r/PESU/comments/1do5u5x/is_partial_drop_posible_in_pesu/",
    "permalink": "/r/PESU/comments/1do5u5x/is_partial_drop_posible_in_pesu/",
    "score": 13,
    "upvote_ratio": 0.94,
    "created_utc": 1719321601.0,
    "flair": "PESSAT/Admission",
    "nsfw": false
  },
  "comments": [
    "Same condition as you. I just spoke to somebody from cse pes university today. She said academics are very hard and a lot of self study is required. I don’t think it’s possible tbh. But PES is a good university too, great placements I heard. If you’re taking a drop I think a full drop is better. Because you’ll be fycking up both college cgpa and ur second attempt in entrances if you fumble\n├── yea hopefully my parents accept. main proble, with takimg a drop is that one of my dads friends son got double digit crl in jee adv and hes suggesting partial drop becauuse if i flunk my jee atleast I'll still be in a college.\n│   └── Don't let others decide your future.. he could be smarter than you, both of you might have different calibre.. \n\nThink carefully and decide\n└── Pes uni is different from pes rr right?",
    "A partial drop does not work out for 99% of people, especially at PES which is already known to be academically rigorous and an environment which stresses academics. I would suggest to either go for a complete drop or focus completely on PES.\n\n&gt;Will i be getting free time of around 3 to 4 hrs everyday to study for this?\n\nBeyond the time taken to also complete homework/assignments/projects? Mostly not. \n\n&gt;How hard are the academics in pes(ive heard they're a bit hard) and is it feasible to do hoth college and jee academia during college?\n\nNot really possible. PES exams aren't straightforward, you cannot pass by studying overnight, or if you do, you will get the minimum passing grade. To actually do well, you need to consistently perform well across all components of your grade: assignments, projects, ISAs and the ESA. Consistent hard work is key to getting a good GPA at PES. If you sacrifice time for JEE prep, you will end up sacrificing quite a bit on your GPA. And you should know that damage to CGPA is often irreversible if you screw up really bad. Also, PCM solving abilities do not translate to college. There are people who sucked at PCM but end up scoring high GPA and also the other way round. Just because you might have done well on the PESSAT does not mean you will automatically do well in college.\n\n&gt;If, lets say i do get a good score after my 1st year and i get into bits, will the college allow me to leave? What i meant was that some colleges ask you to pay whole 4 years fee in this cases and some colleges dont allow to leave the college itself.\n\nIf I remember correctly there *is* a certain amount deducted as a fine. Not sure of the amount.\n\n&gt;Will i have to sacrifice a major part of my social life for this?\n\nYou cannot really put \"social life\" and \"partial drop\" in the same sentence lol. Either take a full drop and have a social life or accept a seat here and have a social life. You cannot juggle between academics at PES + JEE + active social life. Everyone has the same 24 hours in a day. You are gonna be at college from 8 am to 4 pm on most days. The remaining time is whatever you make of it.\n\n&gt;Lets say if i fail my partial drop, how hectic would it be for me to recoup all the potential learning stuff and social life in my 2nd year?\n\nYou can potentially recover your social life but how much of your GPA can be salvaged will depend on how much you score. First year comprises 24 + 24 = 48 out of 160 credits of your degree. Which means that roughly 30% of your final CGPA at the end of 4 years depends on how you perform in the first year. If you get a 7/10 in first year, you can at best push it to 8-8.2, given you work your ass off over the next 3. If you get 6/10, you are in trouble. Also, most people's CGPA ends up around what they score in the first year, because as you progress, courses get harder and workload increases. If you start with a 7/10 GPA, you will in all likelihood end up with 7.0 +- 0.5 GPA after 4 years.\n\n&gt;And lastly, do you recommend taking a partial drop? Especially which isnt advanced oriented? It feels that if i try hard enough i can convince my parents for a full drop so please share your views on this.\n\nI will recommend taking a full drop if you are confident in your abilities. A partial drop will not work out.\n└── Woah. Thanks for such a detailed answer. I will try to comvince my parents for a full drop(🤞) if not then ill take pes and grind in college for future.",
    "As a previous partial dropper my suggestion is choose one thing\n\nGenuine advice from me to you\n└── As I get some upvotes I would like to share a summary of my story I was studying in some tier 3 college in Delhi but my hunger for some good college keeps on getting bigger and due to that I fucked up my 1st sem(CGPA 6.3) I just passed the exam and didn't gave mid sem of sem 2 and practical as well and I realise there's no going back and somehow luckily got PES CSE.\n\nMy realisation was if I had taken a full drop I could have got an IIT lower branch rather than this.\n\nDISCLAIMER:- my jee journey has many flaws and it's one of them.\n\nI have much more to tell but this is not the right place . Just wanted you to understand that it is just a delusion that you can get some nice college with partial drop in PES",
    "What can I get with 2000 rank in pessat in round 2? I couldn't attend round 1 for various reasons. Help me out!! Any1",
    "I am  also thinking of partial drop from pes.  for jee mains tho",
    "See idk my ans maybe diff from the others hwre but thats solely based on how first yr was for me in pes. I had a 9 gpa in both my first and second semesters and that was by studying a week before the exams\n\nHowever yes a drop is always hard when you take into account the university schedule and stuff",
    "I don't think BITS allows partial droppers so look into that I might be wrong. I'm in the same situation as you.",
    "Bits allow partial droppers..they care only for BITSAT marks..if you are really dedicated then many partial droppers have joined Bits…but you have to be really dedicated..not let go of cgpa as well as mains and advanced prep..finally PES will not ask you to pay 2nd year fees onwards if you don’t attend even 1 class of 3rd sem ..they will give you back all the documents..this happened last year to a person 1 know\n├── But..ask yourself are you really ready for this grind..not some casual thinking..people really really work hard..mental and emotional turmoil is extreme for dropper or partial dropper\n└── Hey can you help me out with thiss!!?\nI've got 19xx rank in pessat and couldn't attend round 1 counselling due to various reasons , so if I attend round 2 counselling is there any chance for me to get cse aiml in any of the branches? (RR campus or ecity campus).",
    "Not from PES ..so don’t know current situation..yes ,attend 2nd round..hopefully ec branch can be a possibility.."
  ]
}