{
  "title": "rvce eee vs pes ece ",
  "content": "got 182x in comedk and according to last years cutoffs i should be able to get eee in rvce + have secured a seat in pes ece through pessat\n\npls choose and also tell why\n\nalso i had a few questions\n\n1. are the placements course/branch specific like can the eee people sit with ece people for placements? also can ece/eee people sit with cs people?\n2. how much free time?\n3. any general thing to know before joining",
  "metadata": {
    "id": "1dos0vg",
    "author": "orphic___",
    "url": "https://www.reddit.com/r/PESU/comments/1dos0vg/rvce_eee_vs_pes_ece/",
    "permalink": "/r/PESU/comments/1dos0vg/rvce_eee_vs_pes_ece/",
    "score": 8,
    "upvote_ratio": 1.0,
    "created_utc": 1719383892.0,
    "flair": "PESSAT/Admission",
    "nsfw": false
  },
  "comments": [
    "I would suggest choosing the branch you are more inclined towards. If you like EEE, pick EEE, else if you like ECE, pick ECE.\n\nI don't think there are many posts about EEE on this sub (you should search the sub for relevant posts), but if you would like reviews on ECE at PES, you can find a fairly detailed post under the ECE section in the [FAQs](https://bit.ly/pesu-faq). I would recommend reading through the post as well as the comments because multiple students have posted their opinions.  \nIMO if you do not know which to pick, picking RVCE for EEE might be better. ECE at PES is in a pathetic condition from what I hear. You can find out more from students on Discord or wait for more comments.\n\nRegarding your questions:\n\n&gt;are the placements course/branch specific like can the eee people sit with ece people for placements? also can ece/eee people sit with cs people?\n\nI think EEE and ECE mostly do sit together for placements for core companies. As for CS, it depends. Most companies allow ECE but only a few allow EEE. Regardless, if you are looking for an IT job, you are better off joining CS, IT/ISE or a CS-allied branch. Do not choose either EEE or ECE just to get an IT job, because the odds are stacked against you both in terms of prep for OA/interviews but also certain requirements. There is also a bias involved and although its possible, its very difficult. There are more details about this in the FAQs I linked under getting an IT job as an ECE student.\n\n&gt;how much free time?\n\nThis has been answered multiple times on this sub every single week. Please search and find relevant answers. You can also go through my comment history to find ones posted by me. TLDR - not as much as other colleges because of the academic rigour but definitely enough to have a social life. Depends on your expectations, time management and social skills. There are some people who complain there is no time at all but there are also people who travel 3 hours per day, being active in clubs and also pursuing another degree on the side.\n\n&gt;any general thing to know before joining\n\nThis is a very broad question. Just know that PES (or any other college in India) is not like how its portrayed in movies or tv shows and life is very different here. You will have to work and put in the effort. Do not come in here or any college with a blueprint or map to follow and do not have any expectations. College is a new experience meant to be cherished first-hand. The best way to prepare for college is to not prepare for anything.\n└── alright thank you so much!"
  ]
}