{
  "title": "ECE SENIORS IS IT POSSIBLE RO GET A SGPA OF 9 IN SEM 3 IF YES HOW TO DO SO IF NO PLEASE TELL THE MISTAKES YOU GUYS DID AND WHAT NOT TO DO",
  "content": "",
  "metadata": {
    "id": "1dpmx6r",
    "author": "Impressive-Dare3267",
    "url": "https://www.reddit.com/r/PESU/comments/1dpmx6r/ece_seniors_is_it_possible_ro_get_a_sgpa_of_9_in/",
    "permalink": "/r/PESU/comments/1dpmx6r/ece_seniors_is_it_possible_ro_get_a_sgpa_of_9_in/",
    "score": 18,
    "upvote_ratio": 1.0,
    "created_utc": 1719479646.0,
    "flair": "Study Help :table:",
    "nsfw": false
  },
  "comments": [
    "Blud got straight to the point 💀, also please help seniors we got fucked over royally by this chutiya college\n└── Well, we got fucked by this college way more than you guys lmao. Just hold on till sem 5, that's when it gets easier and the subjects aren't as oppressive. But sem 3 and 4 are fucking horrible. No way around it. Just hope that you get good teachers and try your best not to fail. Brush up on your math and physics basics and understand that you need to grind the fuck out of your subjects just to get an E or a D. No other way around it\n    └── Bro i legit was gonna break down after seeing those marks like wtf could you send any links or courses to get good in those subs , I have heard extraordinary things on how good the ece departments are so I would like to place all my faith on learning shit myself.\n        └── There's a playlist on YouTube by this guy called Razavi. He's the author of the textbook u guys are given. Fucking lifesaver. He's the reason I passed ACD. It's like 20-30 hrs per unit but it's worth it. Also, if you find that something is hard, just search for that topic ok YouTube. There are some channels that are pretty decent at explaining ECE stuff. Also be sure to read a lot of notes from RR teachers. Many questions will come from those notes. U can find those notes on discord\n            └── could you please tell me the server's name?\n                └── PESU Media server. Find the link on FAQs.\n                    └── Please can you help me with Engineering Maths. It's a real struggle there. Any help is appreciated\n                        ├── What help are you looking for?\n                        │   └── Maths coaching for BTech in Bangalore. Finding it very tough\n                        │       └── Hmm, not sure if there's any coaching as such. You can always approach profs at college and ask them to help you out a bit. Back in my time a lot of profs would stay for an hour or more after classes ended for the day to hold a revision class or to help students with doubts. You just need to approach them and ask for help - remember that there's no shame. Remember that not all profs are terrible - some of them genuinely want to help students. \n\nAlso, which branch are you in and did you pass both Math courses? If you are in CS, then you don't have that kind of math anymore so no need to worry.\n                        └── There's a channel on yt by this guy called Gajendra Purohit. 2-3 hrs of videos per unit and if you do those and practice some more pesu questions, you'll be able to solve pretty much everything in the paper. He's helped me in MA1 and MA2 sooooo much. He's the only reason I passed. Watch his videos , it's definitely worth your time",
    "I'm not gonna lie to you, getting 9 in sem 3 is really really hard. Not seen many people do it. Sem 3 is a lot of basics and if you don't pay attention in class, you won't be able to understand half of it by yourself. Don't bunk classes in ACD and CADD. You need a good teacher to teach these subjects or you're cooked. Be perfect with your KVL and KCL. You'll need it for NAS. Brush up a bit on Fourier series and integration. You're gonna use it a lot. Just pay attention in class and go home and practice. Do your best and know that sem 3 is really hard, especially for ECE. Do your best and you'll be fine. Good luck :)\n└── If I don't have a good teacher in AC and CADD could you please link some youtube channel or any course to learn it on my own, could you also please link the resources for sem 3, like the slides and notes . Im a fucking retard I fucked my cgpa so hard that I need to cross 9 is all my above semesters. I want to start getting into a zone of studying everyday so any gdrive or website where I can access the resources would be really helpful\n    ├── Not sure about youtube vids but tbh I found all the content on pesu academy to be enough. I got a fucked up teacher for ACD in 3rd sem so I did everything on my own and managed to get a B at the end.(Also managed to get an sgpa of 9 that semester only with pesuacademy XD)\n    │   └── Could you give me your schedule like what did you do for the entire semester and how did you study, also can anyone link me any pesu resources for ece all the links in the discord don't work anymore\n    │       └── Well firstly, I wasn't a part of any club so I could dedicate my time to studying and tryna pass XD\nAnd I'm definetly not one of those talented people who can balance clubs and academics. I was one of those front benchers who people think are dorky but nah we're fun :P \n\nComing to my \"schedule\"(double quotes cuz there wasn't any schedule or anything as such, I just studied when I got free time because I live 1.5h away from college so all my energy went into travelling and i was DEAD by the time I reached home)\n\nI can kinda give a picture of how my 2nd year went in general: \n3rd sem was actually much better than 4th sem (don't get me wrong though it was still tough). I said that 3rd sem was easier because we had the 2 isa scheme in 3rd sem, the 5 isa scheme started in 4th sem. So as far as I remember, we had more holidays in 3rd sem (dussera Diwali and all) so I could spend some time studying. \n2nd year was more problem solving than theory so paying attention in class and being active helps. Don't do anything last minute just try to do as much as you can everyday and then just leave the rest for before the exam. \n\nIf you don't understand anything just bug the teacher. They all love questions and they don't mind you asking them questions. Even if it's last minute, just ask. I remember one time we called one of the teachers the night before the exam to ask her a doubt and she didn't mind.\n\nTry to keep up with the assignments it really helps for the exam..\n\nI'm not going to get into any subject specifically because you guys might be able to work better with your own formula, it might take some time but believe me with persistence and dedication its always gonna work. If you do have any doubts tho the 4th years who answered this question gave pretty good answers so you could ask them(or me, I dont mind XD)\n    │           └── Brother where are the paragraphs\n    │               └── Gone with my sanity :)\n    │                   └── Ah yes, the sacrifices we make to graduate from PES\n    └── There's a discord server called PES media. It has all the PES resources u might need like notes, slides, question papers and stuff",
    "Fun, i don't have to deal with this, I'm in BBA"
  ]
}