{
  "title": "PES EXAM EVALUATION IS SCAM!",
  "content": "Even after we all study and slog so much for ISAs and ESAs, our papers aren't evaluated well. This has become so evident across all semesters, be it 2nd, 4th or 6th sem.  \n\nThe examination departments claims that they do the correction properly, \\*The biggest joke of the century!\\* BUT ITS ALL A SCAM. Marks are not given even though it is exactly matching the marking scheme. They have some baseless criteria for the scheme. What is the point of pulling all-nighters just to receive this kind of unfair grading that no one deserved?\n\nThese people recruit some third class faculty/mentors from tier-3 (or even lower) colleges, for eg., DSCE for us. They don't know shit about pes system. They intentionally want to bring down the reputation of pes, that's why they are pulling these cheap stunts to reduce the performance of the batch so that we don't get good placements. \n\nthe mentors no longer try to understand the pain of students, they just say, \"Get used to this!\". Is this real mentorship that this college offers after paying so much fees? \n\nThe stepmother treatment in ec campus is so evident now. Students in main campus are guven 15 minutes to review their answer scripts, whereas students in ec campus are given only 5 minutes for the same. Also, those exam controller department is so abusive! These people are the reason to the increase in the number of sui\\*ides. After all this mess, the management doesn't want to take any action against the unfair evaluation by DyCOE!",
  "metadata": {
    "id": "1dq0bow",
    "author": "key-kaleidoscope-6",
    "url": "https://www.reddit.com/r/PESU/comments/1dq0bow/pes_exam_evaluation_is_scam/",
    "permalink": "/r/PESU/comments/1dq0bow/pes_exam_evaluation_is_scam/",
    "score": 76,
    "upvote_ratio": 0.94,
    "created_utc": 1719517774.0,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false
  },
  "comments": [
    "Seeing all these posts after my admission...  sounds like a bad idea",
    "Bro dsce is tier 3???",
    "Bullshit you only get 5 minutes in ec campus. It's literally the same website, I've been at both campuses a year each. \n\nWhat you've probably done is opened a paper, closed it and then came back to it after 10 minutes. \n\nThe correction, yes is not at all logical i will agree \n\nAnd what do you mean \"abusive\". I've applied for reeval in both campuses and the process is the same and the people are equally fine. I made a mistake in bubbling a question in my esa and the head of the coe made me write a letter to him and said he'd look it through. Not sure if he will, but at least he said he will.",
    "Exam paper checking is a scam in itself. Zero transparency in paper checking. Answers are nor even checked. People are not even given a feedback after pointing out to the authroities of the gaps in the paper checking.. the scam becomes evident when the marks in ESA are inversely proportional to what was scored outside it and can be proved statistically. Some even score without assignment submissions these days. To top it no serious academic discussion is entertained lest it hurt egos",
    "How can they leave 2cr+profits for no reason 😂😂",
    "15 mins for each paper u apply for"
  ]
}