{
  "title": "Re-eval Results",
  "content": "For 6th sem students, do you know if anyone's grade increased from an A to an S in any core subjects or any electives?\n\nAlso specifically in Blockchain from B to A or any grade change? Please let me know, thank you.",
  "metadata": {
    "id": "1dqe8h0",
    "author": "cicaada3301",
    "url": "https://www.reddit.com/r/PESU/comments/1dqe8h0/reeval_results/",
    "permalink": "/r/PESU/comments/1dqe8h0/reeval_results/",
    "score": 7,
    "upvote_ratio": 0.9,
    "created_utc": 1719561040.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "They released it? How do you know?",
    "u/rowlet-owl, they are showing TAL(To be Announced Later) for the subject in which I applied re-eval. Is it common as most of the people have got the results by now\n└── You could have just DM'd me lol.\n\nYes, sometimes delays happen for multiple reasons. Don't stress. Just reach out to the COE for more details if you want to. Remember that re-eval results sometimes take almost a month or more.\n    └── i actually did all the re-eval procedure through email so maybe that's why they have delayed it.\n        └── Possible. Email and find out.",
    "Did they release the re-evaluation results for 6th sem ?\n└── They released for 4th and 6th i think. Don't know anyone who got a subject increase to S\n    └── But they haven't released a separate section yet to inform u whether ur grade remained same or increased for  subjects for which we submitted re-evaluation request  for 4th sem, like they usually do with re-evaluations\n        └── I'm 4th sem. I got an increase in a subject already\n            ├── Oh, okay then I guess my money got wasted. When did the result come btw and is it showing the separate thing which I mentioned abt earlier\n            │   └── It shows in provisional results in ESA results.\n            │       ├── Idk it's just showing all the grades as it is and no separate mention  for the re-evaluated subjects. I had applied in my 1st sem and it showed the re-evaluated subjects separately. In 1st sem my grade didn't change so there was a separate section on which \"No change\" was written for the re-evaluated  subject as far as I can remember\n            │       └── It's just showing paid in the challenge evaluation payment status nothing else\n            │           └── Ohh for me it was showing paid initially, then it got updated to verified and then the reval results came.\n\nMaybe check with COE once.\n            └── My money got wasted :("
  ]
}