{
  "title": "Reval Grade Change",
  "content": "Blockchain hasn’t seen a change in the grade graph after reval results are out. Despite being a dead easy elective, somehow only 4 people got an S?? \n\nI got 42 in internals and I know I didn’t lose the ~20 odd marks in ESA I’d have had to to get the B I got (which hasn’t changed after putting for reval). I know other people in a similar range of marks who’ve got A\n\nSeniors is there any way to take this further? I’m on the brink of 8 CGPA so this is p important to me",
  "metadata": {
    "id": "1dqnuz6",
    "author": "no-thanks-please",
    "url": "https://www.reddit.com/r/PESU/comments/1dqnuz6/reval_grade_change/",
    "permalink": "/r/PESU/comments/1dqnuz6/reval_grade_change/",
    "score": 8,
    "upvote_ratio": 1.0,
    "created_utc": 1719592238.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "Reval scam hai\n└── They won't change otherwise it will affect the evaluation System and it will spoil college so they would have cut marks wherever possible to show they have a Very Good and Strong Evaluation System.",
    "I'm on the same boat. My internals is 39 and I thought I did fairly well in the ESA and I get a B?\n\nI've scored better in harder subjects, much less with lower internals. It's possible they haven't graded on a curve but there only 4 people who got an S so, they should've?\n\nWhat a joke.\n└── Even without grading on a curve you’d have to lose a fair amount to get a B also love the username",
    "Same case here, expected more. I hate this stupid college. ",
    "You can hedge your bets on summer courses but some people are saying they don't update the results till the end of 7th sem.\n├── Yeah it gets included with the marks of the following semester, happened w the one I took after 4th sem\n│   └── You mean after 7th sem ?\n│       └── Yeah it’ll be included w 7th sem grades\n└── + u need to pay for all those extra credit\n    └── At this point I don't even care if I've to pay something to get a CGPA bump."
  ]
}