{
  "title": "GYM FACILITIES",
  "content": "I'm planning to join PES RR campus this year and when I visited the campus, I really liked the gym there. Is that gym free to use for students or are there any restrictions for that?",
  "metadata": {
    "id": "1dsxj60",
    "author": "xerxes_8888",
    "url": "https://www.reddit.com/r/PESU/comments/1dsxj60/gym_facilities/",
    "permalink": "/r/PESU/comments/1dsxj60/gym_facilities/",
    "score": 8,
    "upvote_ratio": 0.9,
    "created_utc": 1719851904.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "The gym equipments are top notch but the batch timings and size make it depressing. Only 45 people are allowed in batches of 75 mins and it is practically impossible to get in the evening 5-7 batches.\n└── I think it'd be better for me to join cult.\n    └── PESU gym is really beneficial if you a hostel student otherwise you better off working out in the gym near your home. Although I prefer non-cult gyms, cult gyms have gone down in maintenance and are overcrowded always.",
    "Can day scholars go to the college early (before 7am ) and access the gym?\n└── Yes, you can... the gym opens up at 5 or 5:30 am, not exactly sure. Be careful though because your classes might start at 8, so you might not be able to get a good workout in if you get there too late",
    "10k per year. you get to go 1 hour a day\n└── Just an hour?\nI guess I'll join a gym near my house then.\n    └── It depends on what time you go to the gym\nSo if you go anytime  after 4 pm, you have time slots. The time slots are usually 1-1.5hrs long.\nIf you go to the gym anytime before 4 pm, there are no time slots, and you could just stay in gym till 4 pm if you want.\nFor a hostelite it's pretty chill if you r willing to work out early in the morning \nFor day scholars it could be a little bit of a struggle if you don't live nearby\n        └── Yeah it's better if I join near my house.",
    "Do they offer training and guidance as well ? \n└── Yep, there are trainers available in the gym who you can ask for guidance",
    "The gym equipment is honestly some of the best I've ever seen... There is a gym fee which you have to pay to the sports department after which they will give you a card containing your gym membership details. The fee payment is 10k for a year... And you'll have to show the card every time you want to enter the gym, so make sure not to lose it\n\nEdit: depending on the time you go ( say 2-2:30), you can work out up to an hour and a half (depending on the crowd), making this edit cos I read another comment saying you can work out only an hour max, also there are trainers in the gym who you can approach for help if you need it\n└── Does the sports department charge for using the other facilities too? \nLike the basketball court.",
    "Are outsiders allowed?"
  ]
}