{
  "title": "Is the ECITY campus bias real?",
  "content": "planning to join ecity core cs this year ive seen a lot of worrying things and also ppl who say both are same  \njust a few questions  \nIs it true that ecity campus is very neglected and campus life over there is dull with clubs being of low quality and fests being very few?",
  "metadata": {
    "id": "1dtqb0j",
    "author": "4dxrsh",
    "url": "https://www.reddit.com/r/PESU/comments/1dtqb0j/is_the_ecity_campus_bias_real/",
    "permalink": "/r/PESU/comments/1dtqb0j/is_the_ecity_campus_bias_real/",
    "score": 12,
    "upvote_ratio": 0.94,
    "created_utc": 1719938322.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "&gt;Is the ECITY campus bias real?\n\nAcademically? No. \n\nPlacements? No.\n\nInfrastructure? Yes.\n\nCollege events? Yes.\n\nCollege life? It's what you make of it.\n\nPeople don't care what campus you're from. Even if they ask, they will not treat you differently because it doesn't matter.\n└── Are the classrooms in both campuses air conditioned? Are the campuses in general air conditioned? Asking this as someone coming in through Pessat.\n    ├── It's bangalore mate. You don't even need a fan except for the summers\n    │   └── If that's true, awesome! But I heard that the summer this year was relatively brutal, was it?\n    ├── Some of the rooms in ecity have air conditioners but they don’t work. In EC, only the seminar halls, MRD Student Centre and CIE room are air conditioned afaik\n    │   └── What about RR? Do you have any idea?\n    └── does it really matter tho?  \nits a college not a hotel.\n        └── Pessat people are paying so much money, I think it is fair to expect decent facilities at the very least. Ik Bangalore is relatively not that hot, but given what I heard about the summers there this year, I wanted to know.\n            └── No offence but I think it’s the college you should really look at when going for admission and not the ‘comfort facilities’\n                └── I already have got admission. I was just curious to know the kind of facilities the college I'm potentially going to has.\n                    └── There's no ac in the first year student's block",
    "The management always makes sure we are united, our combined hate for the management is far greater than the hate between the campuses. also idts anybody gives a shit if you from RR or EC the only thing that matters is what is your goal and how you plan on achieving your goal. we occasionally will have banter but its all chill nothing like we hate each other( bring back diss tracks it was fun) also EC campus has way better clubs than RR and we have 2 fests for each campus and yes the RR one is better \n\nTo all the kids asking campus life this , campus life that , its completely on you and how you plan things . If you can manage studies and friends properly you will have a fun time on either campuses"
  ]
}