{
  "title": "Just a curious question, is mandatory paper publishing for capstone fair?",
  "content": "And how hard is to publish one",
  "metadata": {
    "id": "1dv3lre",
    "author": "SnooAdvice1157",
    "url": "https://www.reddit.com/r/PESU/comments/1dv3lre/just_a_curious_question_is_mandatory_paper/",
    "permalink": "/r/PESU/comments/1dv3lre/just_a_curious_question_is_mandatory_paper/",
    "score": 17,
    "upvote_ratio": 1.0,
    "created_utc": 1720088513.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "Okay, let us start with the fact that this is a capstone project but for some reason, every team is forced to publish something. This was never meant to be a *research* project, why are you making students write papers and making them publish them? Why is everyone pushed into research - let people choose which path they want to take. Not everyone is interested in research and they do not have to be chained to this path - and I say this as someone IN research. Like wtf PES? Just let kids work on some industry-based project.\n\nThe only reason they have started making it a research-only project in recent years is to boost their NIRF rankings. NIRF rankings use publications as one of the parameters to rank colleges. There is a very well-known saying - \"When a metric becomes a target, it has failed as a metric.\" PES (and other colleges) are just churning out one paper after another without a fucking ounce of novelty in them. No, we do NOT want to see papers that classify leaves or vegetables into different shapes. No, taking models that came out before you were born and applying them to a dataset that was released last year is NOT research. And no, following some Medium guide on applying a model to a dataset and writing a paper on it is NOT research. And neither does importing libraries or doing a \\`git clone\\` qualify. You cannot just fucking take algorithms that exist, slap them on some random dataset and call it nOvElTy. What you have done is simply evaluate a model on a dataset NOBODY else will evaluate. No offence but your sign language to text model that uses the same techniques that came out in the early 2000s is not really relevant today. Survey papers are valid research ONLY IF you use a different, unique and novel benchmarking metric and evaluate multiple models on the said metric. You cannot simply do an import transformers and load the largest model that fits into your memory, evaluate it on some donkey dataset from Kaggle on the same metrics that others have used and write a paper on it. Using ML models to tackle new problems is not research, it's called application of research, not research in itself. Where is YOUR contribution? Where is the NOVELTY? Where is the RESEARCH?\n\nIt is because of scammy \"research\" like this that people who are interested in research get sidelined. I might sound petty with this one but it fucking boils my blood when I see some of the most irrelevant \"research\" being displayed on the ground floor of B block but the paper I wrote that got accepted into \\[REDACTED\\] and establishes numerous SOTA results is not good enough to be listed there. And it is not just mine, I know so many whose research has not been recognised because so many others are publishing their nut job research at predatory conferences. Which brings me to my next point.\n\nPES/other colleges do not even care *where* you publish your work. Misleading kids into publishing at poor quality venues just for quick publication because they know their research is nowhere good enough to get published at a major venue. So many predatory journals and conferences just preying on students and accepting any kind of research that exists. I am pretty sure if you cook up your dataset using randomised data and apply some models you will get accepted at many of these. Trust me, all these conferences do is make YOU look bad. Nobody in academia will recognise these publications. A poor-quality publication hurts you more than anyone else, especially for Masters applications. Publishing in these kinds of conferences is not at all difficult. Try publishing at a major international peer-reviewed conference - you will see how rigorous the review system is. It is not as simple as submitting your paper today and getting the decision tomorrow.\n\nAnd what's this new business of publishing twice? Why are you sabotaging your research? Self-plagiarism is still plagiarism. Do you know how stupid it sounds - \"Hey see here is part A of our paper which does not have any research, simply a study on what exists. Yes, we essentially scraped paperswithcode or Google Scholar but this is that in paper format. Now here is paper B which also has 0 research btw, where we take the same models and apply them to a new dataset that is on Kaggle\". What is the point of this? You are making it harder for yourself to publish. You have produced exactly 0 research in either paper.\n\nIf you want to do *actual* research - start experimenting. Start playing around with the intricate details. Do not use models as is - change things inside them. Write your OWN models. Change how the layers in a pre-trained model function - add your own layers, modify how weights are computed, and come up with new computations or learning equations. Design your own algorithms. Come up with your OWN metrics. You will fail, multiple times, but know that every time you fail you are one step closer to getting better results. And remember that failed research is STILL RESEARCH. Research does not have to produce SOTA results always. It's not about beating the best model. It's about finding new ways to solve problems. That is what research is about. Do not chase publications. It's about discovery and curiosity. Publications will always follow good research.\n\nIMO, this entire system is broken. Students should not have to pursue research if they do not want to. Let them work on a good end-to-end project if they choose otherwise. For people interested in research, profs need to advise them the right way. Quality always triumphs over quantity when it comes to research. Even Vaswani, the lead author of the Transformers paper probably does not have as many papers as the average PESU professor. This entire system of pushing students to publish research happens *only* in India and it's honestly very sad. Research is something you get into for the joy you get out of discovering something new and your passion for building new things. Don't ruin it.\n├── Note - there are a couple of profs who still care about the kind of research you publish. Not going to name them but everyone knows who they are. They are really good research advisors, some of the best I have come across as well. Working with them is going to be hectic, rigorous and tough because they expect quality research outcomes and don't treat it as a joke. They will definitely guide you the right way but they also expect efforts in return. You will not have a guaranteed paper like other profs, but if your research is good, it is guaranteed that your paper will get accepted into a major venue.\n└── u/SnooAdvice1157 TLDR for your questions:\n\n1. Absolutely not fair, it is a travesty what colleges like PES have turned it into.\n\n2. If your research is good, it will automatically be easy to publish. However, there are also many low-quality conferences and journals that pretty much accept anything.\n    └── Why aren't students protesting against this\n\nI see rants for many petty reasons here but never saw anyone talk about this ?\n        ├── There isn't a rant as such every year, but it is definitely brought up to some capacity regularly. There have been multiple discussions on Discord as well about forcing kids to do research.\n\nOnly so much you can do to fight the system when the system assigns 8 credits of your degree to this component. Besides, as I said, it is not that difficult to scam your way past it with minimal effort and get an easy grade. Most people just suck up and go with it.\n        └── You can’t really fight if your credits and degree is on the line, many just publish in some phony  conference just for the credit sake and claim the publication fees. Majority just want to publish it for the sake of credits.",
    "Adding a placeholder comment so I can return to this after work and rant about how broken this system is. Remind me if I forget lol\n└── Remainder for the wise rowlet\n    └── Done, pls go upvote that comment now lmao",
    "Extremely unfair. I built an Android app because the paper thing wasn't mentioned to my team earlier (2018-22 batch). The project was approved and every teacher/review panel gave the go ahead. \n\nIn the end we had to somehow scramble and write a paper that \"had to be published in IEEE conference for S grade\". No paper meant grade B or lower. Since it's 8 credits, your GPA does feel that hit, so we somehow came up with absolute bullshit for our \"research\" paper and got it published in some random unknown IEEE conference that was begging for submissions.\n└── We published our paper in an IEEE conference and still didn't get S lmao\n    └── I built the app and got an A. My teammates who didn't do shit got an S 🤡",
    "Lol the paper is purely to boost their NIRF , even they know that it's all substandard work being done"
  ]
}