{
  "title": "Electives",
  "content": "Seniors..is big data and data analytics tough combo? what are ur opinions or suggestions to do?",
  "metadata": {
    "id": "1dvulhk",
    "author": "DaikonEmbarrassed147",
    "url": "https://www.reddit.com/r/PESU/comments/1dvulhk/electives/",
    "permalink": "/r/PESU/comments/1dvulhk/electives/",
    "score": 11,
    "upvote_ratio": 1.0,
    "created_utc": 1720174442.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "Big data assignments are tough. Ur assignments will be strictly checked for plagiarism. Subject is interesting tho. Coming to Data Analytics yes it is tough. If you don’t want ur CGPA to get fkd then never ever dare to take DA. I would suggest BD is okay but DA is not. But still BD assignments are hard AF",
    "As someone who has taken both, understand one thing. Both subjects are extremely hard. The concepts in DA itself are extremely hard to grasp and understand in a way that u can prepare for exams. Coming to BD, it is comparatively easier, but that is not by a lot.. the assignments and the final project in BD are quite hard, and even tho everyone is given the same questions, there is a plagiarism check done on the answers(which is quite stupid cause by and large the code doesn't change). The issue is in today's IT world both are quite important, and if u do take both, understand that ur CGPA will drop, and ur on campus placements will not be as good as others.. what I have personally done is, not sit for on campus placements, and instead applied directly to companies, and like that I have gotten around 3 offers, which I have taken an ML role in a mid size company. So if ur confident in ur skills, and during an interview answer the questions \"why is ur CGPA so low?\" Then tbh I would highly suggest taking both, but again that's only if u have a back up plan. Also the benefit of taking both is u get the ML certification or some specialisation right.. so there are pros and cons, talk to some professors and seniors (like me) and try to decide.. I think ull be fine tbh, cause y'all don't have 5 isas, 5 expt, 5 assignments and 1 MP per subject"
  ]
}