{
  "title": "AIML ELECTIVES",
  "content": "Can a CSE student opt AIML electives?\n",
  "metadata": {
    "id": "1dw0foe",
    "author": "Yagnikanna_123",
    "url": "https://www.reddit.com/r/PESU/comments/1dw0foe/aiml_electives/",
    "permalink": "/r/PESU/comments/1dw0foe/aiml_electives/",
    "score": 12,
    "upvote_ratio": 0.94,
    "created_utc": 1720192706.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "Yes, you can take up AIML courses as electives in 3rd year. You might not get to pick from the full range of courses but you can still cover the major ones like Big Data, Graph Theory, Data Analytics etc.\n\n[Here is the current list of electives for 5th sem.](https://www.reddit.com/r/PESU/comments/1dkbkk4/electives_for_sem_v/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button) As you can see, if you opt for ML-related electives you can get the MIDS (Machine Intelligence and Data Science) specialisation.\n└── yeah thanks for clarifying,  \nCSE students received a mail that we can opt ECE Electives but, no info about CSE-AIML dept. electives being offered to CORE CSE kidz.\n    └── Email them and find out. If they say no, ask them for the reason. If you are allowed to opt from branch X, there should not be any restricted imposed on branch Y.\n        └── Yeah sure I'll do that,even I wanna know why aren't CSE kids allowed to chose electives from Aiml, whereas the other way round is possible.\nThank you!!",
    "Yes. You can obtain an AI ML specialisation by opting for specific electives. I am not sure if this specialisation is the same thing as what the AI ML branch folks would be getting.\n├── Correction: CS-AIML is the branch itself, not a specialisation. So CS-AIML kids will get a degree that says CS-AIML and CS kids will get a degree that says CS. Suppose CS kids get a specialisation by completing all electives from the same specialisation group (supposed MIDS). In that case, they are awarded a *separate* certificate that mentions that they have completed the requirements for said specialisation. Since the CS-AIML in itself is a *specialised branch*, there is no specialisation certificate.\n\nThe MIDS specialisation has been there for years. Even I got it. The certificate in itself is pretty useless though.\n└── yeah IK about the MIDS specialisation but I am keen on opting \"Recommender systems\" which is an elective offered to the CSE-AIML branch students, but I am a CSE student.\n    └── Usually, you are allowed to take a certain number of electives from a different branch. Reach out and see if it is possible."
  ]
}