{
  "title": "Mistakes to be avoided ",
  "content": "Hey seniors\nCould you please guide us on what mistakes are to be avoided at any cost(if possible wrt CS/CS AIML)\nPlease do let us know about even small things which we feel don’t matter but make a huge impact later on",
  "metadata": {
    "id": "1dw2yx6",
    "author": "Brilliant_Mangi",
    "url": "https://www.reddit.com/r/PESU/comments/1dw2yx6/mistakes_to_be_avoided/",
    "permalink": "/r/PESU/comments/1dw2yx6/mistakes_to_be_avoided/",
    "score": 34,
    "upvote_ratio": 0.97,
    "created_utc": 1720199300.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "Do not jump,worst case scenario just change ur identity(i know a guy) and start a new life",
    "Be consistent during your semester for your in-semester assessments(ISA)\n\nIf you perform badly in them, there's no amount of work you can do on the ESA (end-semester assessment) to compensate",
    "don't get into substances, try performing well in your isa's and try keeping your internal marks 40+/50, this almost ensures you a 9+ gpa if you perform decently well in the esas. Don't spend all your time studying but don't spend all your time not studying too.",
    "• Take every subject seriously from the very first sem. Sems get progressively harder, so difficult to try and turn your GPA around later. All the ISA and internal marks help A LOT more than it may seem. Labs are an easy way to get an S to boost GPA.\n\n• Join at least 1 technical club, maybe try and switch every sem until you find something you like and stick to it. Join a non-technical club as well if you want fun college life memories and to balance out the stress of PES.\n\n• The most invaluable piece of advice? - Talk to as many people as you can. Professors, alumni, seniors, peers, anyone and everyone. You will always learn something new from their experiences, whether useful or not. And the number of opportunities it opens up is insane, because the word spreads. If people know you're good at Cybersecurity (my example), they instantly talk about you to anyone who mentions CySec. I got my first job this way and a whole lot of other valuable/powerful connections.\n\n• Bunk classes occassionally, chill with friends. Enjoy college life. After you start working, everyone drifts apart and it's harder to get people to meet than organising a Goa trip -.-\n└── Also specific to CS/AIML - avoid tutorial hell. Build projects. Any sort of internships and experience will take you miles ahead. Startups are the best for insane amounts of work experience.\n    ├── What’s tutorial hell\n    │   └── The process of constantly watching tutorial after tutorial, Udemy courses, YouTube videos, etc. and never actually building something. Coding and building stuff on your own always gives you the most learning benefits, proper experience.\n    │       └── Gotcha\nThanks\n    └── Where do we start the process tho?? Maths --&gt; Python then after that ?\n        └── I studied CS, not AIML. So Python and C were taught in sems 1, 2. You can build miniprojects or just keep trying out random stuff that will teach you a lot. Each concept that you learn in class can be applied in different ways. So the sooner you start the better. \nOver the sems you will learn more and more and by the end of 3rd year, you should be able to build full-fledged projects and host them. If you join a technical club or attend events, this learning by doing process will happen even quicker.",
    "Even if you bomb ISAs if you do good in ESAs you can still get above 8gpa don’t lose hope until it’s done (from personal experience)"
  ]
}