{
  "title": "Placement Statistics 2024",
  "content": "[https://docs.google.com/spreadsheets/d/1YZ7HtUcvA9jqWZ04DuwTT66aTV7gU7DUlXyO2BewpII/edit?gid=457632655#gid=457632655](https://docs.google.com/spreadsheets/d/1YZ7HtUcvA9jqWZ04DuwTT66aTV7gU7DUlXyO2BewpII/edit?gid=457632655#gid=457632655)  \n\n\nfound this Excel sheet by a current student at PES.  \nHope that's helpful",
  "metadata": {
    "id": "1dxg3m8",
    "author": "Agile_Tip4177",
    "url": "https://www.reddit.com/r/PESU/comments/1dxg3m8/placement_statistics_2024/",
    "permalink": "/r/PESU/comments/1dxg3m8/placement_statistics_2024/",
    "score": 39,
    "upvote_ratio": 0.98,
    "created_utc": 1720357622.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "You are late🤓\n└── Bruh does cgpa here refer to only btech cgpa or class 12 , 10 as well ? and if not then what's the class 12 eligibility criteria for placements ?",
    "[Pes-Placements-CSE-ECE](https://ibb.co/q0777v1)\n\nThis is the entire CSE and ECE placement statistics from the placement coordinator room\n├── these are different from what I saw. the numbers are updated ryt. how old is this one?\n│   └── This is the latest one , updated last on June 28th . What you saw is the old one\n│       └── were the stats for other branches shared similar to how these were? to get an idea what the overall university average and percentage were?\n│           └── AFAIK other branches placements are not shared because the placements are petty non-existent (batch strength is small as well ) as most go for masters and GATE\n├── This isn't opening man, can u plz share me the ss in dm..?\n└── Hi, do you have placement data of PES CSE for this year (2025)?",
    "Bruh what's was the eligibility criteria of class 12 ?",
    "How about Product Marketing engineer role which Texas Instruments came for Campus drive ? What was the comp offered ?",
    "why don't i see big companies :sob:\n└── Curious, which \"big\" companies are you referring to? Even a couple of companies from FAANG visit PES usually.",
    "Talking about placement statistics \nThere was one on a whiteboard from.the placement coordinator or someone \nWere the stats mentioned in that according to ctc or base\n└── Ha usme to 12lpa tha shyd avg(or median ig) pes ke main campus cse ka\nBut is pdf ke hisab se to lgra ki is saal bhi shyd ache placements hue hai!"
  ]
}