{
  "title": "How to survive as a management quota student in ec campus",
  "content": "I've had an issue - I was getting mech(wanted biotech in rr) via pessat but my parents wanted only CSE so took higher fee quota and took CSE seat in ec campus. I know somebody IRL joining ec and they know my rank - I'm worried they'll hate me and I'll get excluded and outed as mgmt quota student\n\non top of that the warden assumed I was via pessat so now he thinks im a bigshot and has placed me with previous yr batch toppers and studious kids( I used to be studious till 10th but 11th and 12th I was taking care of my father who has been sick since 2017 w cancer)\n\nI'm genuinely interested in computational biology and wanted to pursue that (I think I can still try with CSE path for it) but I'm worried that being a management quota student professors won't take me seriously and it will affect my CG. On top of that I want to go into research but would they even allow me to join? \n\nI'm not from bengaluru either and have no relatives here because of which I'm really worried about the ragging aspect as well, please help!\n\nSomebody said that MQT is visible on all your files and that professors/placement recruiters can see and it affect placements, is that true?\n\nDoes it also affect MS/MTech apps?\n\nPlease help, thank you",
  "metadata": {
    "id": "1dy6fa4",
    "author": "[deleted]",
    "url": "https://www.reddit.com/r/PESU/comments/1dy6fa4/how_to_survive_as_a_management_quota_student_in/",
    "permalink": "/r/PESU/comments/1dy6fa4/how_to_survive_as_a_management_quota_student_in/",
    "score": 24,
    "upvote_ratio": 0.93,
    "created_utc": 1720437740.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "When I joined pesu as a management student , even I had the same view but dw no one cares and no one would exclude you infact I’m in my 4th year now and till date many of my classmates think I am a merit student cos I get a  decent gpa plus I never found it important to tell anyone  , and regarding the professors no one will know apart from your mentor and it no where affects your placements or masters . You will be treated as a regular student just cause you are paying higher amount doesn’t mean you are an outcast . Enjoy your engineering life don’t let all this trouble you\n└── Thanks sir\nAtb for placements ",
    "No one even cares if you are from management or via pessat, Kcet etc, after one week or so, everyone will forget, better is to focus more on ISAs and ESAs and mantain a good CGPA, so that you won’t get any impostor syndrome.\n└── But I'll always remember that I'm not on the basis of merit especially during placement no?\n\nsure about this?\n    └── Idt most ppl care how you got in and if you’re afraid on how ppl will judge you, you don’t have to tell anyone that ur from manegement\n        └── Then what do I say when the ask kcet/pessat?\nMake up a fake rank? But what if there's already someone of that rank \n            └── Dude, nobody cares if you are from MQ. I have friends from MQ and odds are everyone knows at least one person. Nobody gets judged here for that. At the end of the day, everyone is a PESt. Some of my friends from MQ are currently working at Google and other MNCs. It does not mean anything.\n                └── Alrighty\n\nThe warden seemed judged and assumed I was from pessat\n\nso should I just be open about it with people?\n                    └── If they ask, say you are from MQ - nothing to hide. Being honest about it is far better than hiding and saying you are from other modes of admission. You wouldn't want your friends to lie to you about themselves right? If they judge you, they aren't your friends.\n                        └── Got you sir.\n\nlast question - does it affect placement, at all?\n                            └── Nope, not at all. A MQ kid has access to the same opportunities as a CET kid.\n                                └── Got it, thanks rowlet anna!",
    "Just ignore them",
    "noones cares lol, there are bigger things to worry about than this bs",
    "Lol you’ll be fine. I also joined CSE via management quota, literally no one cares.\n└── srsly?",
    "Bro r u serious 😭😭 management quota gives u the most favour in clg honestly ik a friend that gets away w tattoos, coloured hair n shit in another clg while other students don't even get admission for this shit cuz they don't come from mgmt quota. There's no chance anyone except the ppl handling the clg finances know ur mode of admission. The hostel warden is only bothered with ur HOSTEL fees and mess fees other than that it's none of his business, and if he's placed u w previous year seniors/toppers or whatever maybe they are placing u with ppl who push u to work harder. So take full advantage of that make contacts w seniors and somehow boost ur grades, you don't have to worry abt anything related to discrimination lmao😭 chill your ass, lie that you got in through pessat, I don't think any student has a way of finding out how u joined the clg\n└── got it sir"
  ]
}