{
  "title": "What to expect from these courses?",
  "content": "As these courses are being held for the first time, I'm a little confused especially about whether there might be overlap between recommendation system and information retrieval and would also like to hear your general view on the courses offered\n",
  "metadata": {
    "id": "1dz8fo9",
    "author": "no_name_mate",
    "url": "https://i.redd.it/3422fz9a4jbd1.jpeg",
    "permalink": "/r/PESU/comments/1dz8fo9/what_to_expect_from_these_courses/",
    "score": 11,
    "upvote_ratio": 1.0,
    "created_utc": 1720546563.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "Nobody can answer accurately since you *are* the first AIML batch. But as someone who works in this field, I can introduce the topics from my experience working with them. I don't know if that helps a lot but it might help you pick.\n\n1. Recommender Systems; Usually math-heavy, will focus on the different approaches to today's techniques. I am assuming this will also include some project. There is a chunk of this in the DA course in CS. \n2. Smart Manufacturing: This is equivalent to topics related to how AI is used in engineering from manufacturing to planning/management. Its pretty theoretical because this concerns how as an end-product it is used. Personally not really interested lol. No math, if that is what you are looking for.\n3. Social Computing: Related to Graph Theory - not sure why this is a separate course since these topics were originally already part of GTA and GTA is offered to CS kids. Mainly concerned with social graphs and networks and representing data as graphs. Pretty interesting topics to work with. Going by GTA based standards, you will probably have a decent project too. Not too much math but it is there.\n4. Metaheuristic Optimisation: Related to searching and optimization techniques in ML. Extremely math intensive, so will not recommend if you struggle with math. These are concepts from fundamentals in ML which are math based. You will essentially be learning about the intuition behind ML and how it works. Very interesting if you want to learn more in depth about the math but can potentially screw you over if you do not understand.\n5. Advanced Data Analytics: No clue, probably more advanced concepts from the CS elective. Not sure why you guys have Adv. DA without having DA. Regardless, DA is a very math intensive course. Some like it, some don't - depends on how much you like math. The DA paper is almost entirely numericals. But this is assuming it builds on the DA course. If it goes into applications of DA it will be theoretical.\n6. Info Retrieval and Applications: Seems like a copy of AIWIR (Algos for Web and Info Retrieval) from CS. Not too math heavy, mostly algorithms like indexing and modelling. Pretty fun and lightweight course. Easy to score. Has a little math but doable. Topics are fun to implement in projects. AIWIR had a nice project for our batch involving page rank.\n\nAgain - just adding that I have not seen the syllabus. Just adding info from personal experience and history of working with them.\n├── u/rowlet-owl can you see the syllabus details and reply which courses concentrate on the application of ML more and will be more helpful in delving deeper into ML, how important is metaheuristic optimisation as a part of ML cause out of the recommendation system and meta only one can be chosen, while I prefer recommendation cause I think it teaches application, if metaheuristic turns to be an integral part of ML it might be better\n│   ├── Went through the syllabus. Metaheuristics and optimization are often what is considered \"fundamental\" ML, that is they deal with \"how\" ML works. Unless you are someone who wants to get into the nitty-gritty details about what makes ML work, the intuition behind learning algorithms, why an algorithm is chosen, what are the various optimisation choices, etc, you will mostly not need this. They are fun topics to explore if you are interested though!\n\nIf you are looking for applied ML, pick Recommender systems. In most cases you will need knowledgeof applied ML rather than deep level understanding of ML mathematics.\n│   └── I don't have the syllabus. DM me the syllabus and I'll take a look tomorrow.\n│       └── https://www.reddit.com/r/PESU/s/DyxN6ejAcw\nThanks in advance\n└── Dmd you on a query, pls help!",
    "Hey, can you share syllabus of these courses please?",
    "[link to syllabus details](https://docs.google.com/presentation/d/177OY2oOr_vdVaAyGZc2FWlgEqsCPchrE/edit?usp=sharing&amp;ouid=105254164872678450679&amp;rtpof=true&amp;sd=true)\n└── Thanks"
  ]
}