{
  "title": "Looking for a roommate at a house extremely close to PES",
  "content": "I'm a 4th year student who shifted out of the boys hostel. I live at a house near PES and am paying 11k rent monthly (100 rupees water bill per head + 10,950 rent). This 1BHK is quite spacious, and I'm looking for a roommate to split the rent with. I'll take the hall so that you can sleep in the bedroom.  \nI chose this house because it has a great kitchen too and I needed to cook (I'll cook only veg food). The price and proximity to PES is great (especially when you come, both of us will be paying 5.55k).  \nThe restriction is that the owner didn't want to give it to bachelors, but my mom convinced him that I and any roommate I have would behave well, so if you smoke or drink or whatever I wouldn't want you to do that inside the house risking our shelter. Let me know if you want more pictures of this fully furnished house.\n\n[https://maps.app.goo.gl/orkhJBzeHHm7T7dT6](https://maps.app.goo.gl/orkhJBzeHHm7T7dT6) There's even an interior footpath that leads you directly to the PES entrance.\n\n[The bedroom is to the right of the sink](https://preview.redd.it/hskt2unpltbd1.jpg?width=469&amp;format=pjpg&amp;auto=webp&amp;s=89ed3e973a1570301537e61f4c9cace7be9dbd30)\n\nhttps://preview.redd.it/i81zbgqpltbd1.jpg?width=838&amp;format=pjpg&amp;auto=webp&amp;s=d79b1223064530c29703676b869ae219fe440efc\n\nhttps://preview.redd.it/w4ood6opltbd1.jpg?width=1600&amp;format=pjpg&amp;auto=webp&amp;s=d3afb8d3d2d1acd42282a386006db34891ee6a5d\n\nhttps://preview.redd.it/aecg8ynpltbd1.jpg?width=471&amp;format=pjpg&amp;auto=webp&amp;s=bef317a2f918f6d907437ad8cec7ca88a391f2d5\n\n[A rushed picture of half the bedroom](https://preview.redd.it/uo3a0vu7mtbd1.jpg?width=960&amp;format=pjpg&amp;auto=webp&amp;s=8bdc412a2ac2a027d0d75e018a43fde2b668e12a)",
  "metadata": {
    "id": "1e0gmxo",
    "author": "Banging-my-bang",
    "url": "https://www.reddit.com/r/PESU/comments/1e0gmxo/looking_for_a_roommate_at_a_house_extremely_close/",
    "permalink": "/r/PESU/comments/1e0gmxo/looking_for_a_roommate_at_a_house_extremely_close/",
    "score": 30,
    "upvote_ratio": 0.94,
    "created_utc": 1720673343.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "How on earth are u getting that for 10k/month?!\n├── It's extremely shady that you're posting almost the exact same message with a 500rs increase more than a month later. If you want to advertise, be transparent about it, but don't resort to astroturfing tactics to mislead people.\n│   └── Bro i aint him\n└── Banashankari prices seem cheap, and 10k was the rent amount of the previous tenant so they just passed it on with a 500 rupee increase. They used to refuse to give it to bachelors, and they don't have a To-Let Poster, so they don't experience the PES student demand.",
    "Hey man I am looking for a place to stay as I didn't get hostel...I'll dm u"
  ]
}