{
  "title": "Please Help !",
  "content": "I took CSE (AI-ML) at PES RR campus over CSE at PES EC campus and I regret it (should I tho ?)  \n  \nLooking at the previous posts I see a lot of hate towards specialisation branch like AI-ML, why is it so ?  \n  \nIf I took CSE (AI-ML) isn't it supposed to be that I will be studying more into the depth of that field, and why the hell should I have a broader view of CSE when the market is inclining towards AI-ML ?\n\n  \nThis is going to be a big post so please mind me ......\n\n[https://www.reddit.com/r/PESU/comments/147gamv/comment/jnve51g/?utm\\_source=share&amp;utm\\_medium=web2x&amp;context=3](https://www.reddit.com/r/PESU/comments/147gamv/comment/jnve51g/?utm_source=share&amp;utm_medium=web2x&amp;context=3)\n\nI want to ask questions based on the post given above .......\n\n1. a) I agree it is an untested branch, but isn't it true that every branch was once an untested branch ?  \nBe it the opening of market in the 80s and 90s where the rise of CSE was significantly increasing compared ECE/EEE or the rise of ECE/EEE over Mechanical in the 50s and 60s, and seeing the stagnant growth of AI, I really don't want to regret afterwards for not taking AI-ML ?\n\n   b) Why are premier institutes like IITs and BITS Pilani (MnC only) introducing so many specialisations be it data science, AI-ML, or MnC ?\n\n   c) For PES I agree with you, that intro. of CSE (AI-ML) might be for profits only ......\n\n2. I am not so sure about this point because a typical fresher like me won't understand these buzz words, still why PES would make a curriculum which would miss out some of the fundamentals, I suppose this course would be structured on the basis of years discussions, tests, and other projects isn't it, even AICTE approves it .......  \n\n\n3. I am targeting for master's in abroad (particularly USA), and this point is the one which is making me regret about my decisions of taking CSE (AI-ML) over CSE.  \n  \n Can you brief this point more ?  \n And how can I deal with this problem if I had to do my master's abroad ?\n\n4. I agree with 4th point.\n\n5. Ain't your 3rd and 5th point contradicting each other ?\n\n6. What are the electives for CSE (AI-ML) students ?\n\nAnd 3 more questions I have to ask.\n\n1. What do you think will the placement stats be for CSE(AI-ML) according to you or any other fellas there in this branch ?\n\n2. Why do cutoffs for CSE (AI-ML) for RR usually go high compared to CSE at EC, are those people less aware or brain washed ?\n\n3. If I want to change my college from RR to EC how to do it, is it possible to change my branch from RR itself, from CSE (AI-ML) to CSE ?\n\n",
  "metadata": {
    "id": "1e0kogu",
    "author": "Interstellar777077",
    "url": "https://www.reddit.com/r/PESU/comments/1e0kogu/please_help/",
    "permalink": "/r/PESU/comments/1e0kogu/please_help/",
    "score": 20,
    "upvote_ratio": 0.88,
    "created_utc": 1720689801.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "There are hardly any openings for freshers in ML roles.\n\nCutoffs are higher because deep down everyone ignorantly has some sort of perception that RR campus is the \"main\" campus and you are missing out on something if you come to EC campus\n\nMy own brother wrote Kcet this year and was in the exact same situation as you he was getting rr aiml and ec campus cse , I guided him to take Ec campus cse. Aiml is a very math heavy course and is tough to get through if you don't have real interest and join out of herd mentality. I myself found the Machine intelligence core course in 5th sem itself very tough filled with calculus, derivations, numericals, even the labs were tough. I huffed and puffed and got through that course and didn't dare to take any other ml elective after that. As a fresher you won't have any idea what you're getting yourself into. I wanted my brother to have the liberty to pick which ever domain he wants to get into after exploring it first as the course progresses , He will have the choice to get into cybersecurity or systems or Aiml later on when he reaches 3rd year or a mix of any these subjects based on his interests. Unlike my brother you will be forced down your throat with Aiml whether you like it or not.\n\nfrom what I've read the profs don't like specialization in ug they tend to skip the fundamentals which impacts admits in mscs programs\n└── Referring to your last statement.. The professors from where don’t like specialisations in UG? USA?\n    ├── Admission committees abroad (which comprises of profs). The general idea is that UG is for fundamentals and MS is for specialisation. A specialisation degree like CS-AIML makes no sense in undergrad when you haven't even covered the fundamentals in CS. That is why I did not even submit the MIDS (Machine Intelligence and Data Science) specialisation certificate during my MS applications, even though I took up ML related courses as electives and cleared the specialisation requirement - simply because it carries no value to them. Note that pursuing these courses as electives is good (and pursuing courses related to the field you want to specialise in also shows high interest in a field), but it is not ok when they replace core parts of your CS degree. The issue with the CS-AIML branch is exactly that - instead of adding courses it replaces things you need.\n    │   └── it really does not replace things you need though\n\nin third sem ddco and mpca is combined into one. some parts of the syllabus from both is deleted, but it's not a lot. either way, this is a subject nobody cares about. if you ask any related questions a year later, i think a cs and an aiml student would give a similar high level answer.\n\nin 4th sem LA is replaced by math for machine learning. again, it has everything LA has except for a few stuff. but it includes a lot more.\n\nin 5th sem, the ML course is replaced by something similar but again, a bit more.\n\nthe only huge difference is in 6th sem, where OOP is replaced by some Deep learning course. this is the only course which aiml people will miss and have something completely different. \n\nas for electives, the ML related electives by the aiml department are alright. and you can also choose any of the cybersecurity electives from cs. most people take either of these anyways, so it's mostly similar here too.\n\n  \nthe only thing that cs people have over aiml is the OOP course and a couple more elective choices. \n\nit's really not as bad as you make it out to be. i actually liked that they rushed through the boring theory subjects like MPCA and that we could learn big data as a core course\n    │       └── &gt;either way, this is a subject nobody cares about.\n\nYeah see that is the problem. (1)You are assuming nobody cares about it - not everyone is interested in AIML. Whether you care about it or not is a different matter. (2) What matters is if it is deemed sufficient from a Masters admission requirement point of view. You would probably be surprised to know that a lot of MSCS programs have mandatory courses which are advanced level graduate versions of undergrad courses, and some of them do have courses like OS and architecture. How will you justify it being a good reason to be skipped then? Its not for you to decide whether a certain part of the syllabus is not needed (and neither am I the one deciding).\n\nLA, ML etc weren't an issue any day so not going to address them.\n\n&gt;the only huge difference is in 6th sem, where OOP is replaced by some Deep learning course\n\nAnd do you think this is a sensible decision for a \"CS\" degree?\n\nAgain for electives, my problem wasn't with that, so not addressing it.\n\n&gt;i actually liked that they rushed through the boring theory subjects like MPCA and that we could learn big data as a core course\n\nUnderstandable if you are looking for a specialised degree but not justifiable from a \"fundamental CS degree\" point of view. And repeating what I said earlier - not everyone cares about AIML. Whether you think it is boring is not at all relevant.\n    └── Yup USA, wait for u/rowlet-owl reply , he will be able to give better clarity since he went through the application process ,\"from what Ive read \" is in most cases what he has said in previous threads, He is a knowledgeable person you can rely on from what I can tell.\n        └── Thanks, just replied as you commented lol.",
    "&gt;Looking at the previous posts I see a lot of hate towards specialisation branch like AI-ML\n\nNobody is spreading \"hate\" dude. The people with experience in this field and some knowledge of how the industry works are laying out facts. Just because you cannot digest it does not mean we are throwing \"hate\".\n\n&gt;If I took CSE (AI-ML) isn't it supposed to be that I will be studying more into the depth of that field, and why the hell should I have a broader view of CSE when the market is inclining towards AI-ML ?\n\nThere are a lot of issues here. Firstly, yes there is an AI boom happening but guess what it was also happening more than a decade ago. Secondly, sure the market is hot for AI but the question is are *you* interested in ML? A lot of people aren't and are choosing it without knowing what they are in for. I know more people who dropped their interest than people who continued to work in ML because of the nature of this field (and I say this as someone with 4-5 years of experience in this). And thirdly, the market is hot for AI, but NOT FOR FRESHERS. More details can be found [in this comment](https://www.reddit.com/r/PESU/comments/1drdt4h/comment/lauveid/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button) about the nature of your jobs post UG.\n\n&gt;I agree it is an untested branch, but isn't it true that every branch was once an untested branch ? Be it the opening of market in the 80s and 90s where the rise of CSE was significantly increasing compared ECE/EEE or the rise of ECE/EEE over Mechanical in the 50s and 60s, and seeing the stagnant growth of AI, I really don't want to regret afterwards for not taking AI-ML ?\n\nFirstly, it sounds like you really do not know what the AIML field is about and are picking it completely out of the hype. Which is all sorts of wrong because you **should** know what you are getting into. What happens if you join and realise that this is not for you and you do not like it? What will you do? Secondly, nobody is asking you not to pick AIML - people are suggesting to choose core CS so you can explore what CS offers. CS is not about picking a predefined path, it is about exploring what is there to offer in this vast field and pursuing what interests you. If you choose core CS, you can explore field like cybersecurity, ML, theoretical CS and so on, and if you do happen to stick to ML, you can *still* choose AIML related courses as electives and study them. What is more important to you - **being able to choose** what field you pursue and studying those courses or having a degree with AIML written on it? Would you rather be able to choose an interest or be forced down a predefined path? Would you rather have the chance to explore and pursue a different field if you did not like one or bite your tongue and pursue a degree you arent interested in? \n\n(contd)\n├── &gt;Why are premier institutes like IITs and BITS Pilani (MnC only) introducing so many specialisations be it data science, AI-ML, or MnC ?\n\nPretty much the same reason as T2/3 colleges - to increase student intake. There is no other reason. If you think of colleges as anything apart from businesses then you are deluded.\n\n&gt;I am not so sure about this point because a typical fresher like me won't understand these buzz words, still why PES would make a curriculum which would miss out some of the fundamentals, I suppose this course would be structured on the basis of years discussions, tests, and other projects isn't it, even AICTE approves it .......\n\nThere are a fixed number of courses you can have per semester. The only way to fit in AIML related stuff is by replacing some of these courses. Note that none of us would have had an issue if they *added* content, not replaced. You are forgetting that PES (and other autonomous colleges )has power over its syllabus and they can structure it as per their need. For example, the syllabus at Manipal replaces compiler design and automata while keeping in computer architecture while PES has made a mess out of architecture and we do not know what has happened to the compiler course (syllabus isn't out yet). It is not based on \"years\" of discussions - the first AIML batch is yet to enter 3rd year and the syllabus for it is still not out.\n\n&gt;I am targeting for master's in abroad (particularly USA), and this point is the one which is making me regret about my decisions of taking CSE (AI-ML) over CSE.\n\nI'm someone who went through the MS application process, have friends who went through it and in touch with faculty and industry folks who know about it too. Specialised degrees are not recognised too well because of the simple fact that undergrad is meant for fundamentals (something I stressed about in my last comment as well). Does that mean your doors are closed? Nope. But it honestly does not make you look good. More than that, it will cause issues if you do not have minimum admission course requirements as explained [here](https://www.reddit.com/r/PESU/comments/1d66gzl/comment/l6v07vi/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button). As for how to deal with this problem - if you do not have the courses there is simply nothing that can be done.\n\n&gt;Ain't your 3rd and 5th point contradicting each other\n\nNot sure how. I am explaining that the field itself is a high knowledge requiring field, which means you need at least a MS or PhD for actual ML roles in the industry. More details [in this comment](https://www.reddit.com/r/PESU/comments/1drdt4h/comment/lauveid/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button). While on the other hand to pursue a specialised MS in AI or even CS, you will need to ensure that you meet the basic requirements set. These points are not related. I am not saying you do not need an MS or anything else.\n│   └── &gt;What are the electives for CSE (AI-ML) students ?\n\nYou can find it [here](https://www.reddit.com/r/PESU/comments/1dz8fo9/what_to_expect_from_these_courses/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button). Additional thing to note - I know a lot of AIML students not picking from the courses here but rather picking electives from core CS. Second note - many of these courses are rebranded versions of existing core CS electives (social networking is graph theory, info retrieval is AIWIR, etc) which CS kids will take up. Being in core CS, you can also pick electives from any branch, including AIML, upon department approval.\n\n&gt;What do you think will the placement stats be for CSE(AI-ML) according to you or any other fellas there in this branch ?\n\nExactly same or similar to core CS since there aren't really ML jobs for freshers - all of them will sit for the same companies that visit for core CS. The actual way to measure a difference is to see how many from the AIML branch secure AIML jobs. If they end up securing SWE roles then it is effectively useless in comparison. If PES does actually filter and see how many get actual ML roles, you will notice at best, not more than a fraction of what is advertised. Hence, as I said, pick it only if you care about having similar placements.\n\n&gt;Why do cutoffs for CSE (AI-ML) for RR usually go high compared to CSE at EC, are those people less aware or brain washed ?\n\nTwo reasons - (1) Some people still think RR is better than EC and do not know that they are equivalent. There used to be a difference only until 2018 incoming batch, but most websites and blogs are outdated. This is more about people being unaware of changes. (2) People are going by hype, just like you. \n\n&gt;If I want to change my college from RR to EC how to do it, is it possible to change my branch from RR itself, from CSE (AI-ML) to CSE ?\n\nYou can do it during second round of counseling as long as there are available seats in EC CS. Or the next time to do it is during branch change after 1st year, based on CGPA.\n│       └── u/Interstellar777077\n\nI've addressed everything in this thread. Feel free to DM if you need more help.\n│           └── Thnx a lot for your input, and I think agree upon 90% of what you said ....\n└── What to choose if I am fully interested in data science cse(aiml) or cse core. Cuz the college does not have data science branch.\n    └── Pick core CS. Core CS also has data science related courses you can take up.",
    "there's nothing wrong in being on the forefront of AI mL \n\npeople who say it's untested are being a lil cynical\nthink about it..the amount of companies (Nvidia Apple Microsoft) that are pumping money into up and coming Ai startups and tryna integrate it into their own services and products \n\nif it was a fleeting field it wouldn't have gained this kinda traction to begin with\n\nand tbh when you are CSE being in RR or EC campus doesn't matter much as far as placements are concerned cuz both of them have the same stats and numbers when it comes to students getting placed \n\nit's just what's more convenient for you in terms of commute and comfort"
  ]
}