{
  "title": "Help Needed to make an informed decision between EC and RR",
  "content": "I have gotten cse(aiml) rr campus through pessat.\nI am confident i will get electronics rr campus in kcet.\nI am also confident i will get cse and cse aiml ec campus through kcet.\n(I need help making this choice)\n\n\nI have read that cse (aiml) is a cource where \nwithout masters there is no job in the ML feild.\nNow i have talked to the Faculty of CSE(AIML) in RR campus and they told me that the CSE(AIML) and CSE degrees are same and that students of CSE(AIML) are eligible for the CSE jobs.\n\n1)How much of that is true?\n\n\nI also talked to a student and asked wether its a reaseach feild and he told me that there is a alot of push towards reasearch... he also told me that RR campus is hands down better than EC campus as all the events (competiotions and hackathons and all opurtunities )happen in the rr campus and that EC campus students not just feel left out but also are treated worse(in terms of presure and stuff)\n\n2)Now could you guys tell me the order from good to bad in my options \n(In terms of feilds I am fine with both CSE and ECE i am not sure about aiml)\n\nPlease Do help me as i am very much confused.\n\n",
  "metadata": {
    "id": "1e16ce4",
    "author": "whymyusernametaken69",
    "url": "https://www.reddit.com/r/PESU/comments/1e16ce4/help_needed_to_make_an_informed_decision_between/",
    "permalink": "/r/PESU/comments/1e16ce4/help_needed_to_make_an_informed_decision_between/",
    "score": 11,
    "upvote_ratio": 1.0,
    "created_utc": 1720750896.0,
    "flair": "PESSAT/Admission",
    "nsfw": false
  },
  "comments": [
    "I heard ece is not so good in pes....so be careful in choosing electronics at any campus of pes",
    "I'd suggest choosing CSE in EC Campus over CSE or CSE(AI &amp; ML) in RR as you're getting in EC Campus through KCET and in RR through PESSAT. You'll save atleast 12-13 lakh in fees and the difference in avg CTC for CSE across both the campuses will atmost be around 2-2.5 lakh {it was 14.55 for RR CSE and 12.8 for EC CSE last year}\n\nIf you'd have gotten CSE(AI&amp;ML) in RR through KCET, then it would've been a better option \n\nThe order I'd suggest is (considering placements and fees basically the ROI you're getting):\n\nCSE in EC (KCET) &gt; CSE (AI &amp; ML) in EC (KCET) &gt; CSE (AI &amp; ML) in RR (PESSAT) &gt; EC in RR (KCET)\n\nIf fees is not an issue for you, go for AI &amp; ML in RR over AI &amp; ML in EC. \n\nNote: Please make a well informed decision on this considering all the factors that are imp to you. I've only considered the fees and placement as the main criteria.\n├── These are the placement docs for the 2024 batch:\n\n[https://docs.google.com/spreadsheets/d/1YZ7HtUcvA9jqWZ04DuwTT66aTV7gU7DUlXyO2BewpII/edit?gid=1441576938#gid=1441576938](https://docs.google.com/spreadsheets/d/1YZ7HtUcvA9jqWZ04DuwTT66aTV7gU7DUlXyO2BewpII/edit?gid=1441576938#gid=1441576938)  \n\n[https://ibb.co/q0777v1](https://ibb.co/q0777v1)\n\nBrief overview:\n\nCSE (RR) - Avg: 14.55 LPA, Placed % : 67.14, Median: 12.65 LPA\n\nCSE (EC) - Avg: 12.8 LPA, Placed %: 59.05, Median : 12 LPA\n\nECE (RR) - Avg: 8.2 LPA, Placed %:  34.77, Median : 8 LPA\n\nCSE (AI &amp; ML) placements haven't happened yet, the first batch started their course from 2022 so they'll graduate in 2026 and placements for them will start in 2025 (7th sem). \n\nHere the placed % is taken considering those who were eligible to sit for placements among those who applied, if they had taken all the students who applied, it would go down further. \n\nNote: The image I shared might not be the final one, so placed % for all courses might have probably gone up by now and the avg CTC and median CTC would have likely gone down. The Excel sheet contains details of only CSE Placements.\n│   ├── The image one was last updated on 28th June 2024, pretty sure its the last one\n│   └── Hey man whats the highest placement in rr an ec campus?\n│       └── 52 lpa by DeShaw this year.\n├── What if the decision was between cs aiml in rr (kcet) and cs in ec campus(kcet)?\n│   ├── Do not go for EC IN ECE campus the teachers are sadistic and their placement is nothing if u get cse go for it but as a recent ece grad there are maybe 6-7 people been placed through college and even in that 2-3 of them had done cse minors and gotten cse jobs the faculty of the worst most sadistic set of people you will ever meet\n│   └── If you want to go for masters and want to keep your options open on what field in CS you want to specialize on, CS in EC Campus might be better. Placement wise there isn't much diff b/w the two.\n\nIn RR Campus, the peer group and faculty is better. Also most of the hackathons, competitions and all take place in RR Campus and the fests are also bigger in RR. However, being a student of PES you can participate in all the events, competitions, hackathons, fests at both campuses and the campuses aren't too far apart either. Placements are also pooled together for both campuses. \n\nIf you were getting CSE in both campuses at same fees, it was RR any day but because it is AIML, it makes it a bit difficult.\n\nThe main difference between the two is the syllabus, AIML students have to choose AIML related electives in 3rd year and some cyber security related ones are also offered whereas for CSE students, they get to choose electives from any CS related topic (Cyber Security, AIML, IOT, AR/VR etc.) so if you choose AIML then you'll have less diverse options to choose from for your electives in 3rd year. \n\nFor 3rd and 4th sem, syllabus is pretty much the same for both CSE and AIML students, they've removed parts of some courses (Digital Design &amp; Computer Organization and Microprocessors &amp; Computer Architecture) and combined it into one course (SoC Design &amp; Computer Architecture) and in 4th sem, they've added Big Data and added a few topics to the Linear Algebra course and named it Mathematics for Machine Learning.\n\nSince the first AIML batch started only in 2022 and they are only going to start their 3rd year, the teachers are experimenting with the syllabus and trying to understand what works best (which topics to add and which ones to remove) and it might take a few iterations for them to get it right. \n\nThe AIML branch will be more Math intensive than the core CSE branch, so if you don't like doing Math (especially Calculus, Probability, Matrices, Vectors and all) you are likely to struggle and lose interest. \n\nThere are few openings for engineers in AI/ML specific roles straight out of undegrad. It is true that there is an increasing demand for good ML engineers but most of these positions are filled by people who atleast have a Master's Degree if not PHD or atleast a few years of experience in the industry. \n\nSo most of the students in AIML will likely end up in Software Engineering roles like their CSE counterparts and there are many opportunities available for undergrads here. AIML students will also be allowed to sit for the companies open for CSE students so you're not missing out on anything as such by choosing AIML. \n\nBut you'll have to go through a slightly more difficult and math intensive course and have limited options in terms of specialization so if later on you end up not liking ML then you'll have few choices compared to what core CSE students get. \n\nNote: One imp thing that you need to keep in mind is that the first AIML batch is only going to start their 5th sem coming Aug and they'll sit for placements only next year, so to make any conclusive calls on the quality of the syllabus, the course structure, placements, job opportunities and masters prospects after the course is difficult.\n\nThink it through properly and make a well informed decision considering all aspects that are important for you. All the best!\n│       ├── You can refer to these posts/comments from u/rowlet-owl to better understand how the choice of degree between CS and AIML could affect your prospects of doing masters from a good university abroad\n\n[1](https://www.reddit.com/r/PESU/comments/147gamv/comment/jnve51g/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button)\n\n[2](https://www.reddit.com/r/PESU/comments/1e0kogu/comment/lcop86r/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button)\n\n[3](https://www.reddit.com/r/PESU/comments/1e0kogu/comment/lconz5b/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button)\n\n[4](https://www.reddit.com/r/PESU/comments/1d66gzl/comment/l6v07vi/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button)\n│       └── thank you, i really appreciate the deatiled answer.\n└── I am getting ECE in PES EC campus. And I'm getting ISE in Nitte Meenakshi.\n1. Which one would you suggest?\nI am keeping PES EC (ECE) as an option because I get to attend the PES placement and I would be able to attend all PBC that visit PES. \n2. And people are saying placement is combined for both RR and EC campus. Is it true?",
    "There is a detailed RR vs EC post in the FAQs: https://bit.ly/pesu-faq\n\nI would suggest picking core CS through KCET. PES EC CS (CET) &gt; PES EC CS-AIML (CET) &gt; PES RR CS-AIML (PESSAT).\n\nRegarding your questions,\n\n1. Yes, if you compare the job situation it's true because there aren't true ML jobs for undergrads. \n2. Not completely true. The only reason RR has better fests is because it has a larger budget, which means fests are bigger. However that doesn't mean EC doesn't have fests. Also, the tech scene at EC is far better than RR with better quality hackathons and events. Besides, being a student you can take part in fests from either campus so not like you'll miss out. You'll find more details in the comment I linked in the FAQs. \n\nOne thing I'd like to add is that your campus doesn't mean anything after 3 years. So choose the best branch at the cheapest cost you get.",
    "Take pes ec cse. I'd pick that over aiml rr Even if it was the same fee. This is just a double whammy",
    "Generally the order would've been\nPes rr aiml&gt; pes ec cse &gt; pes ec aiml\nIf you didn't care much about masters and only college + placements\n\nBut \n\nConsidering the fees ur getting it'll be\nPes ec cse&gt;&gt; all cuz kcet fees"
  ]
}