{
  "title": "Reval",
  "content": "Sem 2 reval results are out, did anything change for anyone?",
  "metadata": {
    "id": "1e23h6r",
    "author": "minky_05",
    "url": "https://www.reddit.com/r/PESU/comments/1e23h6r/reval/",
    "permalink": "/r/PESU/comments/1e23h6r/reval/",
    "score": 15,
    "upvote_ratio": 0.9,
    "created_utc": 1720851426.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "Nope.Nothing",
    "They don't change anything. They just want you to spend money.😑\n├── I've got my grades changed. What I've observed is that usually the papers with absolute dog shit correction get their grade bumped up by one. I was confident that it would happen when I first got my for for that subject.\n└── Not true. People have gotten their grades improved, and can personally vouch for this. What people don't understand is that for your grade to improve, it depends on what your original score was and how much error was there in correction. If you scored an 80, then the only way your grade would've improved is if your revaluation returned a score of 90. Similarly if you scored an 89, you'd need just 1 mark for a grade increase. For most people, their revaled score isn't much higher than their original score so there is no change in grade (although there might be a change in marks).\n    ├── Well I needed 2 marks for a grade upgrade and I could clearly see during paper review that I should get atleast 5-6 marks, yet nothing has changed. Is there any way to challenge/review it further?\n    │   ├── Not sure. Never heard of someone reviewing a revaluation. Maybe ask COE.\n    │   │   └── okay will try. thanks!\n    │   └── Which Subject?? Are you sure only 2 Marks are needed\n    │       └── Chemistry, yeah I'm pretty sure\n    └── I needed 3M for grade change and when checked they didn't give 7M , so I challenged for reval and it was obvious that grade should have changed, but didn't happen though...😭\n        ├── same boat dude, it sucks\n        ├── Are you sure it's 7\n        │   └── Yeah bro, Thala for a reason...\n        └── What if there's a mistake",
    "Nothing changed",
    "Did it come??\n└── Yeah, on the website.",
    "No change.",
    "Does the grades decrease ? After reval\n└── No",
    "It did change. Also does anyone know if they return a portion of the 1k if there is a change in grade?\n└── i think they give back 750 rupees, i’m not sure though\n    └── W, thanks",
    "Did the Grade Change for anyone from Physics Cycle??",
    "Stats changed from B to A\n└── You mean Engineering Mechanics ( Civil )"
  ]
}