{
  "title": "Help",
  "content": "Alright so I'm right now sitting in PEC, Chandigarh counselling and I have already got a college which is PES, Bengaluru (CSE).\n\nNow I really want to get admission into PEC, idts I need to explain why. It's such a good college. There's no two ways about it.\n\nBut but but, PES is also a good college, it's not on the same level as PEC but it's not that far behind imo. It is situated in Bangalore.\n\nCurrently, I'm leaning a bit towards PES.\n\nThe admission list for PEC will be releasing on 22nd I think, if i get admission into CSE core or even a good specialisation, then what should I do. Keep in mind I am still leaning towards PES. I'm uploading my doubt here just to get some advice.",
  "metadata": {
    "id": "1e3niwd",
    "author": "chIck-fil-A69_",
    "url": "https://www.reddit.com/r/PESU/comments/1e3niwd/help/",
    "permalink": "/r/PESU/comments/1e3niwd/help/",
    "score": 14,
    "upvote_ratio": 0.9,
    "created_utc": 1721023477.0,
    "flair": "PESSAT/Admission",
    "nsfw": false
  },
  "comments": [
    "Dude look the reality is that nobody cares where you're from. \n\nIf you remove the top iits, nits and Elite private stuff like bits. Nobody cares where you're from. For future ms prospects, nobody cares. Either way, most of the teachers won't be that great. \n\nJust pick the one that's more convenient. Or if you like infrastructure or something like that, pick based on that. If you play a particular sport, choose the college that has the court for it. \n\nIt won't matter much whichever college you choose, like i said choose based on your convenience\n└── I agree with a part of what he's trying to say but what he doesn't realize is that pec falls in the category of good colleges (your nits dtus and whatever) obviously lower than some of the top nits and bits but it's still a part of the same league. \nYou ask any gen x or millennial guy he'd tell you the same thing. ",
    "**Choose PEC Chandigarh if:**\n\n* You value a long-established institution with a strong alumni network.\n* You prefer a campus with a historical background and solid academic reputation.\n\n**Choose PESU RR if:**\n\n* You want to be in the heart of the tech industry (Bangalore) with excellent opportunities for internships and jobs.\n* You prefer a modern campus with advanced infrastructure and a focus on contemporary teaching methods.",
    "PEC",
    "doesn't PEC take admissions under JoSAA?? wdym sitting in PEC counselling? also prefer it over PES man. PES is good but PEC is better. you'll save money there too plus the placements are awesome too and MS prospects are as good too.\n└── PEC also conducts counselling for categories like defense wards, kashmiri students, sportspersons etc.\n    └── aah interesting... didn't know about that",
    "Any time PEC,",
    "I'd say go for pec, people consider it to be as good as dtu nsut and some of the nits.\nAs much as people would like to tell you otherwise Pec really does have good reputation. \n\n\n\n If you are from punjab I can guarantee you would have a much better college experience there than in pes. \n\n\nPes also has a very high fee (4.8L)\nPes is overcrowded with cse students (there's like almost 2k students who are just pursuing cse or a branch related to cse). I'm sure Pec wouldn't be that bad. ",
    "Defence quota?"
  ]
}