{
  "title": "Document submission",
  "content": "Can anyone tell us it hard and fast to go to the uni to submit the documents left? For me (in Delhi) it’s gonna be a 30k trip to even just go to submit the 10+2 marksheet (only document I didn’t submit original). Rest, in the acknowledgment, there’s some documents not ticked off but I’m sure I did submit them after the seat allotment in the documentation.\n\nThe main question, do I need to go submit the documents compulsorily or will it work if I do it when I go for orientation??",
  "metadata": {
    "id": "1e3olow",
    "author": "Blowing-up-bawls",
    "url": "https://www.reddit.com/r/PESU/comments/1e3olow/document_submission/",
    "permalink": "/r/PESU/comments/1e3olow/document_submission/",
    "score": 10,
    "upvote_ratio": 1.0,
    "created_utc": 1721027666.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "You need to submit the original documents before the stipulated date. Else admission is cancelled (mostly, from whatever I know).\n└── Ahh",
    "What you can do is if you have any friend or relative in blr, you can courier it to them and they'll submit it for you.. that's what I did and others are doing who live mainly in northern india\n└── Okay I’m gonna try that if possible",
    "Send them an email asking the same. See what they say and based on that you could decide what is the best course of action to take.",
    "30k?? It's 12-13 k for one pax return flight ticket from Delhi I am myself from Delhi ncr\n└── Ahhh damn you’re right boy",
    "dude chill this confusion happened previous year also but many students submitted after classes began\n└── Man you sure my admission won’t be at risk??\n    └── not at all someone i know who lives in blr went to submit the docs and there the people said you can submit later also, he is waiting for kcet counseling and so didn't submit\n        └── Ahhh right right satisfactory then, ima just go at time of the sem then\n            └── Only KCET students are exempted because of the multiple rounds of counseling. It's a hard deadline for PESSAT students."
  ]
}