{
  "title": "Incoming student 28 batch",
  "content": "Anything particular you seniors can advice all of us of what to do what not to do how to proceed with college and how not to screw up (cs ec campus)",
  "metadata": {
    "id": "1e5fdix",
    "author": "Trying2livenice",
    "url": "https://www.reddit.com/r/PESU/comments/1e5fdix/incoming_student_28_batch/",
    "permalink": "/r/PESU/comments/1e5fdix/incoming_student_28_batch/",
    "score": 24,
    "upvote_ratio": 0.97,
    "created_utc": 1721214124.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "Nice Post\n\nHere's my advice (Batch 22')\n\n1. Get peer groups with whom you can chill, grow and learn. These groups can be independent of each other \n\n2. Use your college's 4 years to explore yourself (from a career perspective) and pick up additional courses and skills to help you go towards your career goal\n\n3. Don't be involved in activities that don't help in your personal or career growth. Spend your time to grow yourself \n\n4. Have fun, college is just not to study. Start new hobbies, pursue existing ones and have good co-curriculars. This will eventually help you have some fun time post work after 4 years\n\nGood Luck for your 4 years!!\n└── Tysm!",
    "Class of 26 here \nMy advice would be:\nAlways be open to new experiences\n\nSome of the rules and regulations in pes would probably not make sense to you and seem unreasonable but you would just have to learn to live with them.\n\nIf a teacher is rude to you don't take it to seriously, he's only gonna be your teacher for like one sem. \n \nSometimes your teachers may not be the best and you would kinda end up being on your own. So be prepared for that. You would have to study the entire subject either  on your own or using yt\n\nMarks atte jate rahte hain, don't make your miserable. Even if you fail a subject don't think that it's the end of the world I Have seen people come back from failing a subject in their very first sem.\n\nDon't eat from the food bus, their stuff is questionable to say the least.\n\nYoutube channels that will help you study: gate smashers, neso academy, Abdul Bari, code with harry.  These are just the ones that I had personally used, I'm sure you can find many more.\n\nFind yourself friends that you could study with, friends that are studious and will help you realize how much you have progressed and what resources to use etc. You need to have a good friend group that could guide you with this.\n \nAlso find friends who are willing to give you a proxy lmao cause attending classes is such a pain in the ass. \n\nAnd lastly you would have to maintain a gpa of 8 to be able to get shortlisted during placements. In my experience scoring an eight isn't that tough but as you get closer to 9 it becomes increasingly more difficult. \n\n\nScoring a good GPA can also land you scholarships which you could use to buy sneakers and a ps5 or at least that's what I did.",
    "Just explore a lot in your first year. Learn about every possible field you can, it'll help you decide what you enjoy and are interested in. Talk to as many people as you can, networking is the biggest advantage of getting into a higher ranked college.\n\nKeep your GPA up, the sems get progressively harder. Ideally aim for above 8 throughout. Not the only factor though, there's insanely skilled students with a 5.5 GPA. A higher GPA just helps you get admission into universities abroad, as well as get shortlisted for on-campus placements.\n\nEC campus folks are generally way more helpful and collaborative in comparison to RR in my experience. So your peer/friend group needs to be one that pushes you to do well. \n\nBe a part of at least 1 technical club. Leadership positions of any kind will give you an edge in interviews later on. Take part in non-technical clubs and events as well so that you enjoy college life. \n\nStay as far away from PES management as possible. \nAll the best!\n└── Tysm!"
  ]
}