{
  "title": "Heres why AIML at RR is better or equivalent to CSE at EC ",
  "content": "Basically for those saying to switch from RR AIML to EC CSE , why ru guys not mentioning this :-\n\nIf you've taken a look at the 2nd and 3rd year syllabus , theres no incomplete topics in aiml that arent in cse , instead there are some extra topics in math so theres no reason to switch from rr to ec with the pure justification of 'lack of fundamental coursework in aiml'\n\nAIML in almost all colleges so far ( including NITS,  IITs , BMS , Manipal ) has had higher placements than CSE , so theres no reason why it would be worse than cse in terms of placements in any way.\n\nFor those saying that there's no undergrad jobs for pure Btech CSE(AIML) , why does that matter when u can just go to CSE jobs instead. That's still equivalent to CSE but u have an edge because uve studied extra AIML topics and can pursue higher education :-  \nYou don't need to have a BTech in core CSE to pursue a Master's in CSE. Specializations like BTech CSE (AIML) are generally acceptable for most master's programs in computer science. Admissions committees usually look for strong foundational knowledge in computer science, which is typically covered in specialized programs as well.\n\nAs per the above point  , the PES  syllabus for cse(aiml) covers all topics like :\n\n* Operating Systems\n* Computer Architecture\n* Mathematics\n* Programming Languages\n* Formal Languages and Automata Theory\n* Cloud Computing\n* Compiler Design\n* Web Technologies\n* Statistics\n* Databases\n* Software Engineering\n* Computer Networks\n* Data Structures and Algorithms\n\nNot to mention that the RR campus does have  points in favor compared to the EC campus (including the crowd)... If you dont agree then ask urself which ud chose - CSE at RR or CSE at EC and u'll see why most of u would easily be inclined to RR\n\nHappy to hear what I'm wrong about , don't insult me if I made any mistakes in the post , I'm just looking for clarification\n\nPS: dont reply without reading the post entirely",
  "metadata": {
    "id": "1e6b648",
    "author": "Pleasant-Repair3220",
    "url": "https://www.reddit.com/r/PESU/comments/1e6b648/heres_why_aiml_at_rr_is_better_or_equivalent_to/",
    "permalink": "/r/PESU/comments/1e6b648/heres_why_aiml_at_rr_is_better_or_equivalent_to/",
    "score": 30,
    "upvote_ratio": 0.77,
    "created_utc": 1721308544.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "Well, bits of this are right and bits are wrong.\n\n&gt;Not to mention that the RR campus does have points in favor compared to the EC campus (including the crowd)\n\nFirstly it appears you are falling for the campus bias here, which itself is wrong. There are enough posts that talk about how both are equivalent. Campus should not be a differentiator here because it is meaningless after 3 years. Also, the tech scene is far better at EC compared to RR lol - better and stronger tech community, better tech events, better hackathons (note I am talking about quality, not quantity). Sure, RR is better if you want larger fests but objectively speaking there are no differences. The only differences that exist are subjective (from the FAQs). IMO if you are getting the same branch at both campuses, pick the one which shows a better alignment with your subjective interests, and if you do not have a preference, pick the one closest to your home.\n\n&gt;theres no incomplete topics in aiml that arent in cse , instead there are some extra topics in math so theres no reason to switch from rr to ec with the pure justification of 'lack of fundamental coursework in aiml'\n\nI am not sure how they are fitting 2 courses in one (DDCO+MPCA) without cutting out content. Does not sound possible to me. They are doing this to fit in Big Data in the next sem, which ideally *should* be covered after OS and CN (these are extended topics). I am aware that the other fundamental courses exist, so nothing to complain about them. However, you should know that each college has a different set of \"modified\" courses. For example, Manipal does not have compiler/AFLL courses too, along with architecture. So yes, core courses *are* being replaced. PES has done maybe a better job compared to the others.\n\nSecondly, everyone going through AIML is currently saying the combined courses are a colossal shitshow.\n\n&gt;AIML in almost all colleges so far ( including NITS, IITs , BMS , Manipal ) has had higher placements than CSE , so theres no reason why it would be worse than cse in terms of placements in any way. For those saying that there's no undergrad jobs for pure Btech CSE(AIML) , why does that matter when u can just go to CSE jobs instead.\n\nAgain, from the FAQs itself, there will not be any difference in placements between CS and CS-AIML because reality is that there are no actual ML jobs for undergrads. Here is a quote from my comment:\n\n&gt;The only reason I would recommend picking CS-AIML is if you only care about having equivalent placements as core CS and did not get it (core CS).\n\nComing to your next point:\n\n&gt;You don't need to have a BTech in core CSE to pursue a Master's in CSE. Specializations like BTech CSE (AIML) are generally acceptable for most master's programs in computer science. Admissions committees usually look for strong foundational knowledge in computer science, which is typically covered in specialized programs as well.\n\nTwo points:\n\n1. Correct, you do not need a BTech in CS (for most, some are very specific about CS in some way) but you do need to have covered the admission requirements. Some are explicit while some are implicit but the requirements remain roughly the same: DS, Algo, architecture, computer organisation, automata, compiler design, databases, OS and CN. Not having these tends to create issues, that is why you will see that most people from other branches who do get admitted into CS are ones who have completed these requirements while those who haven't find it extremely difficult (you will need other things to show you do know these topics, like relevant experiences or projects). This brings me back to my previous point that since PES has done a decent job at course modification, it is fine. If you are at another college which cuts more courses, you start entering a dangerous area where your academic credentials aren't enough.\n2. Admission committees do not prefer specialised degrees for undergrad. While I am not saying it is impossible, I am saying that a core CS degree is seen in a more positive light compared to a specialised one. They are aware that your CS fundamental coursework is definitely modified and thus they will look deeper into what you are missing.\n\nFinally, you are missing the biggest issue with the degree - its a specialised degree for offered in undergrad, which is meant for exploration and building fundamnetals. It restricts you to a field you don't even know if you will like. I would suggest [this](https://www.reddit.com/r/PESU/comments/147gamv/comment/jnve51g/?utm_source=share&amp;utm_medium=web2x&amp;context=3) comment (along with every comment linked in that comment). People choosing a field without info and being led down a path when CS is about exploring your interests, finding your passion and working towards it is the biggest issue of this degree.\n├── Although the placements get pooled and the coursework is the same in both the campuses, why is there a disproportionate cutoff? iirc PES RR CSE campus closes under 1k in KCET while it goes till 2.5-3k in PES ECC CSE. There has to be a reason for this difference and I can account that for the peer group. Someone with a 400 or 600 or even 800 in KCET will almost always prefer RR campus over ECC.\n│   └── Short answer: lack of awareness and outdated information among students, peers, parents/relatives, YouTubers and websites. \n\nLong answer: \n\nPES EC (then called PESIT) was under VTU until 2018 - so until then they had different syllabus, placements, etc. In 2018 it came autonomous and since then EC has been sharing the same syllabus, profs, placements etc etc. However, until 2018, PES kept branding RR as the \"main\" campus and EC as the \"South\" or \"other\" campus. It was always advertised strongly that RR was the superior choice being autonomous. So until 2018, either EC was unheard of, or they were simply given the stepson treatment. Nobody, including PES, really cared about it. So all websites, blogs, YouTube videos, etc considered it inferior. So people who graduated years ago, or are in turn parents now, don't consider EC even 1% of what RR is. \n\nHowever things changed in 2018, but it takes time for information to get updated when such drastic changes have taken place. For years PES kept shooting itself in the foot by saying RR &gt; EC so when finally both campuses did become equivalent, people were stubborn to believe it (and trust me this was especially true in my batch since I joined in 2018 - the same year it became autonomous). However most websites, parents, relatives etc are still on outdated information. Most don't know that both are the same now, sharing placements and opportunities. Anyone older than 30 or so will mostly have this outdated information. And that's why students also still pick RR over EC because they hear from word of mouth, websites, videos, relatives, parents etc that RR is better. It will take a couple more years to actually change the mindset and outdated beliefs. It was much worse in 2018 and 2019, now it's actually a lot better. \n\nAs for the peer group, I disagree. Sure you might find people at RR who are better at PCM, but that doesn't correlate to people being better at engineering. In fact there is no correlation at all. Just because you solve a few more questions doesn't mean you'll succeed at college. College requires a whole new array of skills to do well and succeed. It's often those with passion and interest in their branch that actually stand out. And as I mentioned, the quality of tech clubs, events and the tech culture in ECC is currently far ahead of RR due to a variety of reasons.\n│       ├── Adding to the last point that pcm skills dont always correlate to cs skills \nIve heard the batch topper for the batch going into 4th year presently is actually from ec campus rather than rr\nNot 100% sure though\nCan someone confirm\n│       └── Thanks for the info about the campuses. Altho the peer group is definitely better at RR and it's visible in the average campus-wise placement stats as well ( with a difference of almost 2 lpa for average cse bw RR and EC stats ), now is it worth the risks associated with AIML, that's the question it depends on for most people ig\n│           └── The difference in placements can be explained by simple statistics. It's not the peer group, but the difference in sample sizes that leads to higher offers. \n\nThere are more kids appearing for T1 companies from RR campus compared to EC campus because there are more people at RR. So if say a company shortlists N students, you will expect to see **more students from RR in the list** than EC. As a result, more kids from RR get placed at T1 companies and thus the average increases. To give you a mathematical example (lifting this from my FAQs): my batch had 600 RR CS and 300 EC CS. Even you assume a student is chosen randomly for each position in the 10-student shortlist, that gives an RR student a 600/900 = 66% chance of being selected while an EC student is only around 33%. Actually, if you sit down and do the math, you'll see that the probability of an all-RR shortlist will be significantly more than an all-EC shortlist. Simply because of distribution.\n\nThis is a classical case of wrong sample sizes leading to wrong conclusions. Now, had there been the *same* number of students appearing from both campuses for T1 companies AND we observe a trend that more RR kids are getting selected, then yes without a doubt you can conclude that RR kids are better at clearing OAs. However, until we have the same comparison, there will always be a flaw in your judgement.\n│               └── This isn't the case anymore since the batch size is almost the same (2025 batch) but most company shortlists still have more RR campus students and the reason for this is CGPA. RR campus folks have a much better CGPA than folks at EC campus, this can be confirmed by seeing the scholarship cut-offs in both campuses. RR campus has much higher cut-offs for scholarships. So since the CGPA of RR campus students is higher they are more likely to get shortlisted for tests.\n├── I have some queries. .. Dm ? :)\n│   └── Sure, feel free to DM.\n└── I have a doubt. How good is AIML in ec campus?\n    └── The same as AIML at RR campus.\n        └── No in ec campus itself. If I don't get cse core in ec campus, is it wise to choose aiml or get into other colleges for cse?\n            └── You didn't understand me. \n\nThere is no difference between campuses. Whether you picked AIML at RR or EC, your experience will largely be the same. I'd suggest picking core CS wherever you get. CS+AIML at PES isn't a bad option if your other colleges aren't as good as PES",
    "why so much of downvote guys...",
    "I can't speak on the syllabus as it is a new branch and PESU changes syllabus constantly. \n\n\nWhere are you seeing better placement stats for AiMl compared to core CSE? Please share these sources as most colleges directly say core CS has better placements than any sub branch. \n\n\nW.r.t getting core CS jobs Aiml will harm more than help. Very few companies give an advantage if u have aiml. Most companies will put aiml below core CS (Below but a small amount). \n\n\nHaving core CS helps in masters more than you post lets on. While it is small, it is still better to have core CS than Aiml or any other branch.  \n\n\nFor 99.9% of people the \"crowd\" is meaningless. Yes RR has a \"better\" crowd but it's honestly not important. The student is far more important in this case.",
    "To me it sounds like you are just trying to console your self after making the wrong choice lmfao.\n\nIf pes rr cse is better than pes rr aiml then pes ec cse is better than pes rr aiml,cuz PES RR CSE=PES EC CSE. the same opportunities are given to both campus students, it depends on the individual as to what they do with those opportunities.\n\nYour missing the point here lol as a fresher how do you know if you want to do aiml when you probably dont even know python lmfao. Did you explore aiml b/w after the competitive exams ended and counselling started?\n\nBro the point is there are other things in cse other than AIML , most people are joining it out of herd mentality cuz of the buzz it has created. What if after you join and you explore and realize you dont like Aiml? What if you find all the complex math(even in the btech course that is) ,Calculus, Probability, Linear Algebra, Numericals , tough and cant cope with it ?Say you end up liking System's instead ?Do you have a choice like the PES EC CSE students?\n\nSure RR campus is better than EC campus(which is also subjective) , but its not worth limiting your choices.\n\nIm entering 4th yr right now , I guided my own brother who wrote kcet this yr who was in the exact same dilemma to take cse at ec campus over rr aiml. Tell me why would I misguide my own brother.\n\nKeep trying to convince yourself that rr aiml is better because of the rank difference hahaha. Come to 3rd year, We will see who will be crying and who will be laughing if you dont end up liking AIML.",
    "I see the others have corrected a lot of points. W.r.t:\n\n&gt;You don't need to have a BTech in core CSE to pursue a Master's in CSE. Specializations like BTech CSE (AIML) are generally acceptable for most master's programs in computer science. Admissions committees usually look for strong foundational knowledge in computer science, which is typically covered in specialized programs as well.\n\nIf you try to get into Masters programs in Europe, they happen to be quite strict with the requirements. I have been on the receiving end of this even though I have the CSE degree. \nFor example - in AI/ML subject list you shared - \"Formal Languages and Automata Theory\" seems to be removed, which is a super important subject for any research uni and course.\n\nIf you do your Masters in USA/Canada/UK/Australia/NZ then yes, they can be lenient and overlook the CSE degree requirement.\n├── Fair point , I think he missed to put it but it's included for aiml students as well\n│   └── Ah, then u/rowlet-owl has covered everything as usual 😂\n│       └── Thanks, but you've still added a good point. Masters programs in EU are extremely strict on requirements. Basically it's a desk reject if even one course is missing.\n└── Hey Formal Languages and Automata Theory is included as well, my bad but thanks for pointing it out , Ill edit it",
    "Heres my questions (might sound dumb tho)\nIf one had pursued in aiml btech rn,and goes for further studies , aint they kinda doomed to study aiml or related thing for mtech?? I mean ive heard few reputed uni (mostly from europe) dont allow u to do mtech in cy, or mtech in applies phy , if u got btech in aiml, as they aint toallt related ,but also not totally unrelated\n\n\n\n\n\n\nAlso, i think many prefer cse over aiml spec, cuz they think that , if they take aiml, thet might not be knowing bout other branches of cs(as ds,cy, or any other field) as much as the \"cse\" students, and they might fall back when theyd wanna change branch , so they might have consid|red those aspects and claimed cse&gt; aiml,",
    "ya makes sense",
    "Again to clarify , I'm not saying RR AIML &gt; RR CSE. No.\n\nIm saying RR AIML &gt;= EC CSE\n└── cry more 🤣\n    └── cry about what my guy? I'm literally getting all the options with my rank 😂😂",
    "thanks for clarifying bro , i am getting aiml in rr thru kcet (1.4k rank) will go for it ....\n├── The final call is obviously yours, but please ensure to read both sides of the argument and then take a well informed decision on your branch.\n└── Ayoo even if you’re General I’d suggest you to wait till 3rd round since you might get core cse itself\n    └── ya i will"
  ]
}