{
  "title": "can we use laptops to take notes on in pes university?",
  "content": "i'm joining pes university this year and i wanna know if i can use tablets or laptops for taking notes instead of paper n pen, someone reply asap pls",
  "metadata": {
    "id": "1e8l9tb",
    "author": "Personal_Action3891",
    "url": "https://www.reddit.com/r/PESU/comments/1e8l9tb/can_we_use_laptops_to_take_notes_on_in_pes/",
    "permalink": "/r/PESU/comments/1e8l9tb/can_we_use_laptops_to_take_notes_on_in_pes/",
    "score": 9,
    "upvote_ratio": 0.82,
    "created_utc": 1721565137.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "U in India sirr wdy expect\n└── 🥲🥲",
    "Nah bruh\n└── shiitt, i cant use it for any course? and is it strict that i cant?\n    └── Bro in the first year, they are strict you can use it for coding, in other classes it's not allowed\n        └── done done ok thanks",
    "Depends on the teacher\n└── ohhh do uk anyone who use? btw what course?\n    └── I know some ppl use them in class, not personally and im cse\n        └── ok ok done thanks",
    "They do allow tablets but laptops I don't think so\n└── u sure?\n    ├── Absolutely in my class two three ppl used to take notes in tablet . This was just last sem(January to June) so pretty sure they do allow\n    │   └── ok greaaat thanks\n    └── i really wanna use a tablet cuz im used to it\n        └── DW they'll allow\n            └── btw what course are you doing?\n                └── Ec\n                    └── what course tho\n                        └── Sorry I mistook your question. Im from btech ece course\n                            └── ohhh im bout to do bsc psychology honors courseee",
    "you will be allowed to use you laptop for the coding related subjects , and some teachers might allow you to make notes on tablets but some won't be okay with it but then after 1st year, basicallly sem 3 onwards m pretty sure u can take notes on ur tablet for all classes\n└── thanms sooo much",
    "I write my programming notes in my laptop itself. If u have a tablet and a stylus then you can use them to take notes (that's how our class ppl did)\n└── okok thanks"
  ]
}