{
  "title": "What is the process of giving original documents?",
  "content": "What steps are there to do this and how long will it take? Also can i go alone to pes to give the documents?",
  "metadata": {
    "id": "1e97m5g",
    "author": "macchar-ke-jhaant",
    "url": "https://www.reddit.com/r/PESU/comments/1e97m5g/what_is_the_process_of_giving_original_documents/",
    "permalink": "/r/PESU/comments/1e97m5g/what_is_the_process_of_giving_original_documents/",
    "score": 12,
    "upvote_ratio": 0.94,
    "created_utc": 1721630672.0,
    "flair": "PESSAT/Admission",
    "nsfw": false
  },
  "comments": [
    "Went today. It was relatively an easy process. You go inside MRD building,the receptionist will be sitting on the left, ask for documents submission, she'll show you the way.\n\n\nThe first thing they'll ask you is, the acknowledgement form (which they gave during the Counseling). And ask for the remaining documents, which you didn't submit during counseling. They'll tell you to sign under the copies (self attested). And that's it. They'll keep it in a file.\n\n\nAlso make sure to bring the ID card, even though it's just for them to know your rank through pessat. I didn't bring mine, but had a photo of it, and they said it's completed.\n\n\nAlso they mentioned that, If you are going to study in EC campus, make sure to get those originals after the completion of first year.\n\n\nWhen I went, It wasn't crowded and the process took less than 5 minutes.\n\n\nAlso, you can go alone.\n\n\nEdit : spelling \n├── ok thanks a lot\n├── Is there any last date to it? Why do they want originals? \n│   └── At first they said the last was 25th July, but today they've changed it again to 5th August, due to Kcet counseling.\n\n\nGiving them the originals means that we've secured our seat.\n└── What all documents must we carry?\n    └── https://pes.edu/documents-to-submit/",
    "I did this years ago, so the process could have changed. But you essentially just take the documents to the admission department (MRD building, RR campus) along with other admission related documents they might have given you (like the acknowledgement) and they just take it. You can go alone too.\n└── Ok do i need to sign anywhere or any other things to keep in mind?\n    └── U have to sign on the copies of the original documents(self attested)",
    "As per UGC colleges are not allowed to take originals, they can just verify / keep the copies and return the originals. Do we really need to deposit the originals ? \n\nPlease refer page no. 3 and 4 for UGC circular pertaining to AY24-25\n\n[https://admission.uoc.ac.in/downloads/UGC\\_Guidelines\\_Fee\\_Refund\\_Policy.pdf](https://admission.uoc.ac.in/downloads/UGC_Guidelines_Fee_Refund_Policy.pdf)"
  ]
}