{
  "title": "Fucked...",
  "content": "So I just got my admission in PES EC campus and when I went for PES hostel they said it's completely booked , went to the pg's near the campus and most are really bad for me as I need a bigger bed , are there anyone who's down to share a flate or something cause I'm from Udupi and my cousins live near yeshwantpur so kinda fucked.Rent doesn't matter as long as the place is decent.",
  "metadata": {
    "id": "1ebpnjy",
    "author": "[deleted]",
    "url": "https://www.reddit.com/r/PESU/comments/1ebpnjy/fucked/",
    "permalink": "/r/PESU/comments/1ebpnjy/fucked/",
    "score": 16,
    "upvote_ratio": 0.87,
    "created_utc": 1721895728.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "I had called like 2 days ago warden said there are 50 percent of rooms available\n└── Are you taking about 1st year hostel or second?\n    └── 1st",
    "Hey I know a place where you can find proper accomodation and food nearby college. DM me through reddit",
    "What the hostel is not full booked\n└── That's what the warden told me when I visited the campus today\n    └── Ammatra academy hostel ??\n        └── No no no I'm a lateral entry student so I went to the in campus hostel\n            └── Ohh sorry got confused\n                └── Can second year students start there any chance ?\n                    ├── nope it is only for the first years\n                    └── Ig u can ask warden once DM for contact",
    "Check for pg's in neeladri nagar,They are quite decent",
    "Guys I have doubt.  if I join pesu eee or pes(ec) ece through kcet will I be able to change my branch after 1st year to atleast ec campus cs. And will I be considered as management from 2nd year if I do change.",
    "DCET guy ?\n└── Yup",
    "When are the classes starting?\n└── August 5th apparently",
    "Fuck whattttt\nEC campus?\n\nDid they send any message or anything?\n└── Thats what they told me during admission s",
    "💀 lady at the reception told that they gonna send a message/mail within 12th August.\n└── Lol are u a lateral entry student? Which branch cause i asked the people who did my admission and they told me ut was 5th august\n    └── Lateral entry student - CSE (my reddit's glitching)\n        └── Its august 5th too for you",
    "If you are looking for decent pg near college , there's one called Your Space (now named to Royal service apartment) it's pretty decent"
  ]
}