{
  "title": "Need advice",
  "content": "Hi im a first year now second year\nAIML student\nI have 6 backlogs\nAnd I feel like it’s not working for me\nShould I quit Pes?\nOr is there a possibility where I can give an accademic comeback \nI’m a management student ( I pay 11 L per year and I feel like I’m wasting my parents money )\n",
  "metadata": {
    "id": "1eil9ah",
    "author": "Own_Ambition_807",
    "url": "https://www.reddit.com/r/PESU/comments/1eil9ah/need_advice/",
    "permalink": "/r/PESU/comments/1eil9ah/need_advice/",
    "score": 15,
    "upvote_ratio": 0.95,
    "created_utc": 1722632743.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "Well if you have no interest in the course it's difficult for an academic come back with respect to any field of study honestly.\n\nNow if you aren't interested then you must know wt interests you and if it's compelling enough , drop this to pursue something you can strive for.\n\n\nNow if sticking to this course is your only option the only thing you can do is just put your head down and grind it out but first find wt issues you are facing which caused you to end up with so many backlogs and then work on those.",
    "Honestly, it's completely upto you. It's not too late to quit, but you can definitely clear all your backs and get a decent cgpa by sem 6 if you grind properly before the exams. I am in ECE and had 9 backs before sem 3 and 14 overall and I was able to clear almost all of them by sem 8. AIML subjects will be way easier dw. This is not a bad time to quit, but you have to consider your other options as well. If you have a better and more chill college ready, you should probably go for it. Most other colleges are way less stressful than PES and usually more chill. It's better to just cut your losses with the 11 lakh than spend like 45 lakh and be miserable for 4 years. But if this is your only option, you can definitely make it work, though your cgpa will be a bit on the lower side. College shouldn't feel like a chore and if you have better options than PES I'd 100% recommend it",
    "you feel💀?\n├── attraction crawl fact observation marry chubby toy payment fanatical ripe\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*\n│   └── Dude isn't aware of how stressful and rigorous exams can get at PES and is pulling others down. What a clown.\n│       └── dependent lip practice seed escape carpenter combative scandalous sheet chop\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*\n└── If you can't help them  , don't hate"
  ]
}