{
  "title": "Internships",
  "content": "How exactly do internships work? Are you allowed to go during classes if you show that your logs or something or only after classes. For a CSE student what are the prerequisites required for an internship and is anything which was taught to us in the first year relevant for any of it",
  "metadata": {
    "id": "1eisvwd",
    "author": "BattleGod1026",
    "url": "https://www.reddit.com/r/PESU/comments/1eisvwd/internships/",
    "permalink": "/r/PESU/comments/1eisvwd/internships/",
    "score": 21,
    "upvote_ratio": 1.0,
    "created_utc": 1722654109.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "Internships at PES are permitted only during summer or your 8th semester. So this gives you 4 slots (summer after 1st, 2nd and 3rd semester and 8th semester) to pursue an internship. PES does not permit any internship that does not occur in these slots. You are however free to pursue it if you wish to, but do not expect any support in the form of NOC or attendance waivers. This means that any internships during the semester aren't permitted. If you choose to pursue one, you will either have to work remotely or find a way to balance attendance and work.\n\nInternships in the permitted slots are also applicable for credits. There is a conversion formula and a bunch of other requirements like the nature of the internship to be eligible to claim, but I won't go into the details of these now.\n\nCompanies (MNCs mainly) visit campus for 2 internship slots - summer internship (summer after 3rd year) and spring internship (8th semester). These slots are canonically called \"internship season\" and are the only slots companies will visit campuses (any college, not only PES) to recruit interns. So if you are looking for an internship, you will probably be able to land one at a good company in these slots. However, startups tend to recruit from any batch, and research clubs on campus (and other places like IITs, NITs etc) recruit during all summers.\n\nRegarding what skills you need to get one, ideally your profile's fit with the role and your technical skills. There are more details about this in the FAQs (check the comment about placement prep)\n├── Then what do students do during the 7th sem? Remain unnemployed? Work on capstone?\n│   └── Capstone, yes, and there are a few courses too. Some also pick up a TAship.\n└── Hey, what about the internships after 4th sem? Is any assistance provided by the college or do we look on our own?  \nthanks",
    "For on campus internships keep your CGPA above 8.5 till 5th sem and for off campus internships do open source and a few really good projects on a particular stack.\n└── Wht abt students below 8.5 CGPA ...no internships?\nThis is scaring me 😱\n    ├── It's not that bad. Most companies that come for placements ask you to have a minimum of 7. CGPA wise, 7 should be pretty safe for most companies. Whatever happens after that depends on your skills. But most of you can get an internship without the help of the college too. I have a friend who got a really good internship which converted to fte with 12 lpa and he had 5.7 cgpa. Ik another one with 6.45 cgpa who also got a really good internship and is now working full time in that company. Internships aren't that hard to get, you just need to talk to your friends and relatives and someone will mostly be able to give you a referrel somewhere. And if you get an internship through a referral, most companies don't care what your cgpa is.\n    │   └── Thank u bro , u have me a hope . 🙌\n    └── You will get, chances are little low"
  ]
}