{
  "title": "Doubt",
  "content": "I have heard that the syllabus in PESU is quite tough and the college is strict academically and exams are on the harder side. Can anyone share your experience with the difficulty of the syllabus and in what sense clg is strict? And how is it different from other clgs? And also i heard exams in PESU are difficult. is it possible to score 8.5+ cgpa ? what is your comment on this ?",
  "metadata": {
    "id": "1eiwvsj",
    "author": "Ok_Evening_7975",
    "url": "https://www.reddit.com/r/PESU/comments/1eiwvsj/doubt/",
    "permalink": "/r/PESU/comments/1eiwvsj/doubt/",
    "score": 20,
    "upvote_ratio": 0.96,
    "created_utc": 1722667896.0,
    "flair": "Study Help :table:",
    "nsfw": false
  },
  "comments": [
    "There are multiple comments and posts on this subreddit about this already. Just search using relevant keywords.\n\nTLDR; yes its is academically rigorous. You cannot pull an overnight study and expect a good grade, you will barely pass. You need to put in time for academics at least a week or two before the test to score well. Each course has many deliverables too and you need to perform well in every component to get a good grade. Finally, tests aren't easy. You need to study and also write the answers properly to score well, which means you often cannot bs your way through a test. Correction tends to be on the stricter side sometimes so do not expect leniency. Overall, if you want to score well in PES it requires quite a bit of effort. Scoring an 8+ is easy, 8.5+ is doable with some effort, 9+ is difficult and 9.5+ requires incredible effort and dedication.\n\nIts considered strict because of the strong focus on academics and academics alone. There aren't that many other fun events during the year, most of your time goes in either preparing for tests, giving tests, or coursework. Beyond that, it leaves you with little time for your other interests (free time does exist but you will need to take out time rather than it being generously available). Fests are okayish, nothing brag-worthy. Most people at PES are always hustling to get better at their interests, its a pretty academically focused crowd as well. Everyone is also very competitive and trying to do something with their time here either through internships or research. It can encourage you but also discourage you.\n\nSome links you can refer to (please also do your own research by going through the sub):\n\n* [https://www.reddit.com/r/PESU/comments/1d66ywv/comment/l6qhycx/](https://www.reddit.com/r/PESU/comments/1d66ywv/comment/l6qhycx/)\n* [https://www.reddit.com/r/PESU/comments/1cea6uq/comment/l1hd26d/](https://www.reddit.com/r/PESU/comments/1cea6uq/comment/l1hd26d/)\n* [https://www.reddit.com/r/PESU/comments/1dpt9m0/comment/lajlfjm/](https://www.reddit.com/r/PESU/comments/1dpt9m0/comment/lajlfjm/)\n└── Bros tldr is longer than the original answer",
    "It's possible , do well in internals and okaish in the esa that should be enough for 8.5",
    "It is and it isn't. I can't say for any other branch since I took biotech. but they required at least 85% attendence although depending on the teacher attendance can be laxed to 75%. You have to be on top of your studies to get a good GPA, nothing less than a C is good.\n└── Yo I got cooked with D's and a few E's . As long as you maintain a gpa of more than 7 by 8th sem, you're fine. I'm ECE tho so CS has a high risk high reward thing.  For ECE, mech and EEE, what I said holds due to the mathematical rigour of the course. Just don't get any backlogs, especially in Analog circuit design, electromagnetic field theory, computer architecture, Digital communications and waveguide and antennas. If you get back in these three, it's very hard to clear. Make it your life's goal to clear these in the first attempt and you should be sorted.\n    └── That's what I meant...the more D's and E's you have...the less chance there is to secure a high CGPA. Backlogs can help you improve your gpa but I wouldn't recommend purposing failing to improve your gpa."
  ]
}