{
  "title": "fresher here (cse)",
  "content": "any general do's and don't 's for first years?",
  "metadata": {
    "id": "1ek15de",
    "author": "ambatakumph",
    "url": "https://www.reddit.com/r/PESU/comments/1ek15de/fresher_here_cse/",
    "permalink": "/r/PESU/comments/1ek15de/fresher_here_cse/",
    "score": 25,
    "upvote_ratio": 0.93,
    "created_utc": 1722793597.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "I would not suggest having a \"blueprint\" for college because this is a new chapter in your life meant to be experienced first-hand. You will falter and make mistakes but that's ok. But here are a couple of do's and don't's:\n\n(This comment is broken down into multiple threads)\n\n**Do's:**\n\n* **CGPA is important**. Don't let anyone tell you otherwise. Whether your goal is placements or Masters, a high CGPA opens doors to opportunities. Your first year's CGPA forms the backbone of the CGPA you get in later years, so if you screw up in the first year, it can take a while to recover from the damage. Many shortlisting situations directly use your GPA, so the higher the better.\n* **CGPA is not everything!** While important, the \"higher the better\" policy only applies to a certain extent. Beyond that, all CGPAs are treated the same. College isn't about going to classes, studying and achieving the highest CGPA (more on this later), so don't waste your time grinding for the golden 10/10 because it might hurt you more than it can help.\n* **Become industry-ready**. Gone are the days when a BTech would guarantee you a job. College is about picking up valuable skills relevant to the industry and showcasing them during placements. If you do not have the necessary skills to work in a role and/or if you spend all your time grinding a high CGPA but do not have the technical proficiency to succeed in a corporate role, you will not be selected. So don't make CGPA everything and focus on developing these skills. Your goal should be to be hireable, not to get a degree.\n* **Explore, explore and explore!** This is more relevant to CS, but you need to explore this vast field and figure out your interests. CS is NOT programming - it is so much more. There are various fields from theoretical CS, systems, cloud, etc and so on. Explore different fields, see what they have to offer and find your niche. At the end of the day, you do want to pursue a career in what you are interested in. Once you find your interest, keep learning more it has to offer. Work on relevant projects, pick up experiences, etc until your profile is relevant/aligned towards a field. This will specialise your profile (something which most undergrads do not have) and allow you to apply for specific roles in the industry, help you become more noticeable to recruiters and also help your resume clear multiple screening rounds easily.\n* **Opportunities are plenty!** There are many opportunities at PES and outside, if you keep your eyes and ears open. Try your hand at everything - be it research internships or industry internships. You will not be able to find out your interests until you try your hand at everything. Keep an eye out for openings, internship announcements, etc (an easy way is to ask seniors - more on this below) so when something opens up, you are the first to apply! Keep looking for any kind of opportunity that might be relevant to your interests and keep applying, regardless of your chances. You never know what might click.\n* **Maintain a professional profile**. Always keep an updated resume (I used to update mine every 2 months, or if any major update is needed) and an updated LinkedIn. You will need these to apply and look for opportunities. Keeping an updated profile at all times makes it less tedious and much quicker. Building one also helps recruiters find you for relevant openings. It also helps you network and find alumni who can help you out! If you need help building a profile, reach out to seniors - they have resources to help you out. Since this is needed for internships, jobs and Masters, its important to get a head start here.\n* **Make a good peer group**. Having a good peer group which encourages you to do your best and vibes with you is ideal. Find your tribe and people you can get along with and it will make college life significantly better. Don't be an isolated dude on campus. Friends will keep you sane.\n* **Stay connected!** Its already been repeated a few times, but all communities/groups/clubs etc at PES actively use discord. There are discord servers for notes, alumni groups, MS admissions etc. Each club also actively manages their events through Discord. While its known that most students have not used discord, getting used to it early and staying connected makes life much easier later. If you need to find anything at PESU, PESU Discord will help you find it.\n* **Look after your physical and mental health!** PES can get very stressful, rigorous, competitive, hectic, etc. You have already heard this before. Keeping a check on your health from time to time is important. Sometimes, you might not be able to perform as well as you want to in a test, and that's ok. Learn where to draw the boundary and don't put in effort beyond what you are comfortable with. If you are satisfied with an 8.5, make sure you put in enough effort for an 8.5. Don't compare with others - only with your past self. Eat healthy, pick up a regular physical exercise and do these alongside work. Talk to people for support and share your feelings. Don't let the stress get to your head. Mental health matters, and you will need to take precautionary steps to take care of yourself at PES. Your health is more important than a GPA.\n\n(continued in a reply)\n├── (Continued Do's)\n\n* **Seniors and alumni are your friends**. Make use of the top network of seniors here. Everyone is well connected over various platforms (mainly Discord) and many of them (like me) would happily take out time to help you out if you need us. You will find PES alumni working at FAANG or pursuing MS/PhD at many top Unis. Everyone is friendly, helpful and great (provided you ask politely). PES alumni are known to have a good reputation everywhere and they can open up opportunities for you as well. Spend time networking and getting to know them better, they can help mentor you to pursue your goals and some might even turn out to be good friends :D. If you ever need any kind of help, whether is academic or not, always reach out.\n* **Professors aren't your enemies.** There is a lot of hate for profs on this subreddit, but not everyone is bad. Most profs here are okay, but some profs are really good. Networking with the right profs can open various opportunities in the form of TA/RAships and even referrals for jobs/internships. Some might even invite you to be part of research internships after bypassing the entrance test. You can also ask seniors about which profs are good. Forging a good relationship with a great prof takes time and effort from both ends, but it pays handsomely with opportunities and LORs. If you find a prof whose work is interesting, feel free to approach them and ask them about it. Just being nice to them goes a long way. I've had the fortune of interacting with many profs and have good memories with the ones I worked with. Some of the profs here at PES are also very sweet and stay in touch with students long after they graduate.\n* **Have fun!** This time of your life will not return. Make sure to have fun beyond the classroom - take part in every club event you are interested in, organise fests, attend the fest concerts and events, and make memories which will last you a lifetime. Don't be bookish - go out and there and make the most of college life. Its not all work and study. You will miss this time once its gone.\n│   └── Ayy nahh mann i love u boss u always ready to give detailed answers to all the queries asked by ppl here. U the real goat my g\n├── **Don't's:**\n\nI cannot think of too many right now, will update this as I form my thoughts.\n\n* **Fall for scams.** There are many scammy groups (both inside and outside PES) that will try to sell you various opportunities. These prey on unaware students fresh into college like you. Remember that no company takes money to hire someone. Before applying or paying money for anything, ask a senior for advice.\n* **Sign up for everything!** While its good to be socially active, you do not need to sign up for every event or hackathon that happens. Sign up for only those events relevant to your interests. Quality &gt; quantity. Signing up for everything will simply consume a chunk of your time needed for exam prep or rest. Find the right balance between club events, test prep and rest.\n* **Have unreasonable expectations.** Many of you might walk in with the picture of PES being the big bad person waiting to screw your life up. This subreddit greatly exaggerates things. Its not all bad. There are both pros and cons of PES and you will have to live with both. Don't expect a party college but at the same time don't expect it to be Alcatraz. Don't walk in with hate for the college or its professors. Form your opinion based on your experiences, not others. Its easy to fall into the PESU hate group if you join with misconceptions.\n* **Be spoonfed!** PES spoonfeeds students when it comes to academics: they will spam you with all sorts of PPTs, notes, worksheets etc. Most students fall into the trap of depending on the smallest resource (PPTs) for test prep because it takes the least effort/time and they do not open the textbook. Don't make this mistake, the PPTs are simply a summary of points while the textbook is the source material. Learn from the textbook as much as possible, especially for theoretical courses, and use the PPTs to revise concepts quickly. While it is possible to score decently enough (8+) using just the PPTs, it is not enough to get a 9+. If you do not get into the habit of reading the textbook, you will also face issues in higher semesters when reading the textbook is essential to get a good grade.\n* **Get into bad company and toxic activities**. Self-explanatory: stay away from substances, drugs, their users and associated bad company. Its your life, don't ruin it by doing something stupid.\n* **Get involved with management**. The management here like can be unreasonable and tends to be a shitshow for the most part. It's advisable to not get into trouble because they won't hesitate to take action against you. They also make questionable decisions from time to time and like to experiment with both academics and non-academics. However, they aren't voluntarily out to get you. Stay out of their way and they'll stay out of yours.\n└── Thank you so much dude this was so detailed big up for the effort you put in  \ncan't wait to start college and hopefully one day become wise enough to advice juniors in this way heh  \ncheers mate looking forward to meeting you and others at campus",
    "follow rowlet advice he’s the og and a huge W in helping other people",
    "Keep GPA 8+ (not too hard) , don't run behind 9+ that will cost you other stuff.\n\nTry things, and don't try to connect your first 20-30 40 hrs of any new things club skill subject to \"how it will help in internship or job\"\n\nTalk to seniors/alum when you get a chance. They also don't have everything figured out (no matter how much some pretend) but they have seen more so take their words with a grain of Salt.\n\nDon't try to be a specialist in the first year, go crazy with experiments try everything let your mind be free. You'll find something you like and continue with that.\n\nYour peers aren't your competitors, there is a bigger market outside so when competing try to compete with them and make good friends, that's the most important \n\nRest, enjoy your time, 😊 \nAll the best.",
    "avoid pes management and stay away from doing stupid stuff that should help",
    "Hi \ntheres also a post on my feed for others looking  for more replies"
  ]
}