{
  "title": "Ece with minor cse branch",
  "content": "Is it manageable to score good cgpa(above 8.5)after opting for CSE minor course with ECE as mybranch? How hectic does it become to manage both the branch opted and minor course classes?\nPov: I'm very bad at coding still want to take cse minor branch\nWill I be able to manage?",
  "metadata": {
    "id": "1ekrmz1",
    "author": "littlehalf_",
    "url": "https://www.reddit.com/r/PESU/comments/1ekrmz1/ece_with_minor_cse_branch/",
    "permalink": "/r/PESU/comments/1ekrmz1/ece_with_minor_cse_branch/",
    "score": 13,
    "upvote_ratio": 0.94,
    "created_utc": 1722873937.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "It gets hectic but manageable i would say\n└── But do companies give preference to those who did minor in CS?\n    └── Not really. Most companies allow both CSE and ECE students to apply; some companies only let CSE apply. Shortlisting would be based on cgpa and performance in the test. Minors will only help you answer better during tech interviews coz they mostly ask DSA, OS and DBMS\n        └── Got it. Do most of the T1 companies allow ECE students?\n            └── Yeah 85-90% of them (for 2024 batch)\n                └── Oh Okay.. but then why is the percentage of students getting T1 companies in ECE branch only 15% while in CS it is 50%?\n                    └── Competition. CSE students end up doing really well in tech interviews when compared to ECE students. Also, not everyone in ECE is proficient enough to get T1 CSE-related jobs. Most of them go for masters or core jobs.\n                        └── Ohh I see... also maybe because its hard to cope ECE subjects along with DSA etc.",
    "Question is what do you mean by manage. If you want to live the \"college life\"* along with studying, then maybe no. It will get \"hectic\" means juggling between ece along with cse. Meaning, you would need to dedicate a part of your life to it aside from what time you give to ece: you must be regular with your core course while also dedicating extra time to cse, i.e, if yoh want to do well in both. And afaik, ece is pretty hard as it is. Don't do this if you just want the cse tag. If you are genuinely interested, you will find more ways that are better without the stamp of having done a college course related to cse.\n\nWhile this might sound a bit demotivating, but there is another side to this. A bunch of guys in cse do a dual degree. The one which iit madras offers for data science. They manage to dedicate time for both college and the degree and manage to have fun with friends as well. \n\nPoint being, you need to be regular. No slack with priorities. If you end up slacking, you might end up in trouble. Also, the iit madras course is self paced. Minor course may not be so. Go for it if you are being honest to yourself (meaning dont choose something on the basis of fleeting emotions). Only then will you able to reap the complete benefits. \n\nTldr; be disciplined or you might fuck it all trying to stand on two boats at once and fall hard in the middle. You will be having less fun than your peers, but if you manage to pull it off, then have better chances later on.",
    "Cfbr\n└── i dont wanna be that person but commenting \"cfbr\" under a post does nothing. Visibility of a post is determined by the number of upvotes. Just upvote instead :)"
  ]
}