{
  "title": "*OFFICIAL*.    2nd round counselling on Aug 25th ",
  "content": "Aug 23 is the final date for submitting documents and 25th Aug is counselling round 2",
  "metadata": {
    "id": "1eksz8c",
    "author": "Brilliant_Mangi",
    "url": "https://i.redd.it/ineptl1fmvgd1.jpeg",
    "permalink": "/r/PESU/comments/1eksz8c/official_2nd_round_counselling_on_aug_25th/",
    "score": 18,
    "upvote_ratio": 1.0,
    "created_utc": 1722877183.0,
    "flair": "ANNOUNCEMENT :snoo:",
    "nsfw": false
  },
  "comments": [
    "better late than never heh",
    "I can only see ‘August, 2024’ for second round of counselling and August 15th for seat surrender in their important dates, from where did you got this info ?\n└── It’s on the same page itself\nMaybe just reload the page\n\nhttps://pes.edu/important-dates/\n    └── got itt, thanks, it was showing something different here, maybe they didn't updated it [https://admissions.pes.edu/registration/Impdates.html](https://admissions.pes.edu/registration/Impdates.html)",
    "When would they intimate about the available seats and stuff, and why do the motherfuckers have to do this way later than comedk cancellation deadline. Fuck You PES.\n└── probably a day before the 2nd round, that's how it was last year. pes conducts 2nd round counselling of pessat after round 1 results of kcet are announced. comedk dates and pessat counselling dates have no correlation.\n    └── I mean it's a gamble for those who'd be leaving their comedk seats, what if they pull a scam like last year with \"-ve\" seats.",
    "so orientation most probably on 2nd sep\n└── why?\n    └── i think college starts a week after 2nd round not sure",
    "Just wanted to know whether the counselling for pes that is first and second round is over or not?\nBecause I haven’t got any messages or mail regarding the counselling\n└── 1st round was completed in May\n2nd round will be conducted on 25th Aug\n    └── Ok, but I haven’t received any mails or messages regarding counselling\n        └── For round 1, they have sent email regarding counselling \nThey haven’t sent the mail yet regarding Round 2\n            └── Ok thanks"
  ]
}