{
  "title": "Videogames in hostel (RR campus)",
  "content": "During the orientation the director said something about checking our laptops for NSFW content and videogames and that games aren't allowed. Is that true or is he bluffing",
  "metadata": {
    "id": "1elh4wp",
    "author": "Leo_Stormdryke",
    "url": "https://www.reddit.com/r/PESU/comments/1elh4wp/videogames_in_hostel_rr_campus/",
    "permalink": "/r/PESU/comments/1elh4wp/videogames_in_hostel_rr_campus/",
    "score": 21,
    "upvote_ratio": 0.96,
    "created_utc": 1722949177.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "My porn stash disagrees with him\n└── There was a time years ago when the hostel wifi had blocked Stack Overflow and various course submission portals but porn websites were accessible lmao",
    "You can actually put a case against them for privacy invasion of they check, don't worry lmao\n└── i was wondering abt that but then again the way he said it made it seem so real",
    "Nah chill,\nNothing happened in my 4 years of hostel.\nPeople used to get drunk in hostel and was able to cover it up,they barely ever check\n└── that's a relief, they make it seem so airtight",
    "When was the orientation?\n└── it was the hostel orientation not the actual, i apologise for not being specific\n    └── Not a problem at all. Thank you. Do you have any idea when the 1st semester college orientation will start for fresher\n        └── nah man im waiting for it as well",
    "cap, don’t worry\n└── thank goodness",
    "As someone who stayed in the hostel for 3 years, the hostel director will say a bunch of this shit just to scare you. Maybe the first semester they'll try to scare you a bit. They stop caring eventually and you'll find ways around every rule they put in place. We used to host full scale parties, get drunk, have overnight gaming sessions, watch movies, sports, everything you can name. So it's chill, the curfew can be a bit annoying though. \nI also know a lot of people who snuck out and never got caught, there are ways around everything.\n\nI'm not endorsing any of these activities, just making it clear that the hostel is never what it's made out to be. They're going to be some of the best years of your life so don't forget to have fun!\n└── I've been mentally preparing myself for all the strict rules since I got in lmao"
  ]
}