{
  "title": "Placement stories of ppl with &lt;7 cgpa.",
  "content": "Hi guys, \nI  have a cgpa just less than 7. (6.991) To be precise. How did people in similar situation get placed. What should I do, feeling mentally very down rn. \nPls help me ppl.",
  "metadata": {
    "id": "1em516f",
    "author": "Constant_Guard2949",
    "url": "https://www.reddit.com/r/PESU/comments/1em516f/placement_stories_of_ppl_with_7_cgpa/",
    "permalink": "/r/PESU/comments/1em516f/placement_stories_of_ppl_with_7_cgpa/",
    "score": 48,
    "upvote_ratio": 0.95,
    "created_utc": 1723013251.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "There are a few companies that have the minimum requirement as 6.5 CGPA. Don't be disheartened, placements can still help but maybe at T3 level. Just try not to be ripped off by TCS/Wipro/Infosys and the likes.\n\nI'd say off campus works better. Build a good solid network and ask for referrals/interviews. The main advantage is you can negotiate salary, which isn't allowed for placement offers. And you can get a more specific role too, other than the standard SDE roles, if you want.\n\nThe best Security Engineer on my team at work was a Mechanical grad from BMSIT with a GPA of 5.5\n├── Adding to this, if you have any good projects, that can help you a lot.\n├── Yes, to be honest, pay/money isn't my focus, it is good work. Tbh I am decent in terms of DSA. \nAnd thanks, your comment really means a lot.\n│   └── Off campus DSA also is not too hard generally. And yeah projects help the most. Feel free to reach out anytime to the alumni network on LinkedIn, most seniors are helpful because they've gone through this placement hell themselves 😅\n└── What would be the cgpa requirement for tier 1 company placements?\n    └── I think generally 8+ is what gets you selected. But really depends on the company, some of them have ridiculous standards like 9.5+ 🙃\n        └── Oh ok",
    "i got placed thru oncampus(u can say) but i had to visit the startup for gd and technical rounds and competed people from offcampus and oncampus despite my btech being 6.67...lost many good opportunities for this cgpa shit...don't worry u will get placed..u r well above 60%..so it's enough some tier 3 and tier 2 companies will set 60% as criteria\n└── where did u get placed",
    "There are a few companies that come for placements that ask for 6.5+ and many that don't even have a CGPA requirement. You can try applying for those. But your best bet is definitely to get something through a referral. Almost all my friends who got a job in my batch got it on their own through a referral. I know a friend who got a 11 lpa job and he has 5.4 cgpa. I know another friend who still has backlogs but got his internship converted to full time. I have another friend with 7 cgpa who has a 15lpa job after getting his internship converted. If you have any contacts in your family or within your friends circle, don't hesitate to ask them for help or a referral. Getting a referral makes getting that role 90% easier. Many internships are pretty much guaranteed if it's through a referral. Don't be discouraged, CGPA isn't the most important thing in your career. After your first job, nobody will even ask you what CGPA you had. Just focus on building up your skills, do whatever internships you can and build your portfolio well. You'll be fine, it's not as bad as you think\n└── Hi can I dm\n    └── sure",
    "Its difficult but not impossible. Minimum for any company is 6.68 gpa so in that case you're good.",
    "Thats still above 6.68 which is the minimum gpa for most companies. Try and get, otherwise you have hope in getting after masters, provided you maintain a good gpa in masters and be well rounded in extra-circulars too."
  ]
}