{
  "title": "Please help!! PESU (CSE WITH AIML) OR BMS (CSE) ",
  "content": "Please help me out guys!!\n\nHi guys. I already have booked a seat in pes university, rr campus cse with aiml and in comedk round 2 I got bms cse. I could have also gotten msrit ise but I made silly mistake by putting bms on top of msrit during choice filling. What should I choose? PESU RR CSE with AIML or BMS CSE. \n\nI have heard that the curriculum at pes is tough, no social life and the student intake is very high but it has very good placement record, 18 lpa avg for cs branches. Companies like microsoft, Amazon, apple, adobe come here. BMS is more lenient that pes, has low student intake, good social life ig but not very good placement record. What should I choose? Please help.\n\nI could also edit choice filling in comedk round 3 and put msrit ise above but there's a risk of losing the seat at pes and getting bms. Please guys, help me out.\n\nAlso are there north indian students, not from Bengaluru at pes? And droppers? Will I, as a student from north indian face any difficulty mixing with the students there if I choose pes?\nI know it's a bit long but i'd be really grateful if someone can please help me out here.",
  "metadata": {
    "id": "1en1por",
    "author": "[deleted]",
    "url": "https://www.reddit.com/r/PESU/comments/1en1por/please_help_pesu_cse_with_aiml_or_bms_cse/",
    "permalink": "/r/PESU/comments/1en1por/please_help_pesu_cse_with_aiml_or_bms_cse/",
    "score": 10,
    "upvote_ratio": 0.86,
    "created_utc": 1723109986.0,
    "flair": "PESSAT/Admission",
    "nsfw": false
  },
  "comments": [
    "By the way BMS's seat intake for CS is 1700 in their main campus this year and PESU is 720( cse ) +480 (aiml ) so 1200 in the main campus \n\n  \nBMS - Relatively chill college life  \nPES - Academics/Placements ( and infrastructure is better due to newly constructed labs and blocks )\n\n  \nFees might be more for PES but im not sure what exam ur going through , and also there's a lot of scope for scholarship. \n\nNo you wont face any problems, there's a lot of kids coming from north India , many in hostels too.\n└── Thank you so much. If fees aren't a problem, should I go for pes?\n    └── yes pes better\n        └── Thanks dude :)",
    "The main question is are you really interested in AIML ? If so, take PESU.\n\n\nStill not decided? Take BMS CSE. Why? It's core branch, you'll have many specialisations to choose from.\n└── I can still apply for software engineer jobs, right? I've heard that all the subjects are the same except a few extra things that'll be taught for aiml. Cse with aiml people at pes are eligible for all the companies that come for cse.\n    └── Yes you can"
  ]
}