{
  "title": "Huge doubt here!!!",
  "content": "So I was joining pes only for the sole purpose of placement since the placement stats (excel sheet )were pretty convincing.\n\nBut I saw that the CSE intake is 1200(cs +aiml).\nAnd for 1200 students tier 1 placement has just 70 entries.\n\nAnd that is very low % of tier 1 placement ig.\n\nI wanna know if this is the complete tier 1 placements or there are other tier 1 students who haven't made entry here.\n\nAnd 1200 students is a lot BMS itself is 1500 and it is being shat on.\n\nThe competition here must also be crazy considering the student strength or the 1200 seats do not even Get filled ?",
  "metadata": {
    "id": "1enunyt",
    "author": "Photonic_Mouse",
    "url": "https://www.reddit.com/r/PESU/comments/1enunyt/huge_doubt_here/",
    "permalink": "/r/PESU/comments/1enunyt/huge_doubt_here/",
    "score": 15,
    "upvote_ratio": 0.86,
    "created_utc": 1723192849.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "Can't really complain about competition if you're choosing CSE tbh\n└── Yeah I agree but I here talk about the campus placement competition to be specific.\n    └── If you want i can explain VIT placement.. Which has seat matrix of 4k+ in cse &amp; specializations only.. Intense competition but only 10-20% make out for tier 1 placements rest in medium or WITCHA mass recruitment\n\nNote : 500-600 including ( super dream, dream companies, WITCHA, startsup visit there)\n\nFirst CGPA screening so 9+ are 1k this year so they will be allow to sit in super dream / dream companies first... \nIn that too screening above 9.4 allowed as par CGPA first movers.. Hell lots of 8.5-9 still in waitlist not got any to sit even. \n\nSo it open secret  Tnp and companies coming in campus do screening in large pool of tech batch Otherwise its not possible\n\nSame will happen in bms with new seat matrix and others like PES rr/e-city\n        └── u/rowlet-owl\nThoughts on this?\n            └── Happens at PES already, Many companies shortlist only those with 9+ CGPA or allow those with 8+ CGPA to even write the test. As the intake increases, these cutoffs will also increase.\n                └── Damn🥲",
    "70 entries and multiple people per entry, the official stats you can check from this post \n[placement](https://www.reddit.com/r/PESU/s/LvAd9S6GCj)\n└── Oh this kinda makes sense.",
    "&gt;tier 1 placement has just 70 entries.\n\nWdym by entries?\n└── I meant the tier 1entries in the placement excel sheet being circulated.\n    └── The total students placed with t1 packages are about 700+ including ppos\n        └── Source?\n            └── Spreadsheet shared in this sub\n                └── this one? (https://docs.google.com/spreadsheets/d/1YZ7HtUcvA9jqWZ04DuwTT66aTV7gU7DUlXyO2BewpII/edit?pli=1&amp;gid=1441576938#gid=1441576938)\n\nThere are around 100 people in T1 and most of them are \\~12LPA, where did you get your 700+ number from?\n                    └── I've dm'ed you..\n\nAnd t1 are those packages which are &gt;=12 lpa..\n                        └── 12 LPA ones are included in T1 though, in the sheet\n                            └── Yes.. What's wrong?",
    "Tier 1 placements including PPOs was around 700+. wdym 70 entries?\n└── Yup it was 700+ for 2023 that doubt of mine is resolved, but this year intake is 2200 sm.\nSo will that be an issue?",
    "I don't think the intake was 1200 for CS last year. You'll need to account for last year's intake.\n├── Well acc to [this](https://www.reddit.com/r/PESU/s/71tydlrQFF)\npost it says almost 1100 and 1200 in clg website seat matrix.\n\nConsider it to be 1000 but still won't it be a lot?\n├── happy cake day\n├── Happy g-max Alcremie day\n└── Happy cake day Rowlet bro"
  ]
}