{
  "title": "Jee mains ",
  "content": "What percentile needed to get CSE core in PESU rr campus? Is there any benefit of OBC NCL? I am from non KKR region ",
  "metadata": {
    "id": "1eojzpp",
    "author": "[deleted]",
    "url": "https://www.reddit.com/r/PESU/comments/1eojzpp/jee_mains/",
    "permalink": "/r/PESU/comments/1eojzpp/jee_mains/",
    "score": 13,
    "upvote_ratio": 0.93,
    "created_utc": 1723262967.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "Get 97+ ull be safe.\n\nAnd afaik there's no reservation in jee mains quota..\n└── This year cutoff for rr cs was 98.5\n    └── The same won't be for next year dude.. From next year there will be no pessat and admissions will be through jee mains, so the cutoff percentile will significantly decrease..\n        └── Yes tru but the competition for mains itself will increase so I would recommend to keep atleast to the same cutoff as this yr\n            └── Nah, getting 97+ is safer lmao.. Till this year, only 5 percent of seats were reserved for jee mains quota, from next year 35 percent of seats will be filled thru jee mains.. So cutoffs will decrease..",
    "I secured 97.51%tile in JEE Mains 2024 in the April Attempt. I applied in PES through JEE Mains quota and was offered all the courses in RR and EC campus except for CSE and AIML. So I would say 98%tile+ would be the cutoff for CSE. I took up B.Tech ECE in RR campus. I wish they had scrapped PESSAT right from 2024. I would have benefited from that. Now since that there is not PESSAT and only JEE Mains, KCET and Mgmt, the cutoff would probably decrease for all branches including CSE. So anywhere above 96-97 would put you on a safer side. For CSE try to keep atleast above 97.5%tile.\n└── Whats the fee for you?\nIs it similar to the pessat kids \n    └── The fees is the same as that of PESSAT. Paid 4.3Lakh per year for ECE. It varies with branches. For mech it’s about 3.9Lakh. For CSE it’s 4.9Lakh.\n        └── Should have gone to thapar cs dude...\nPes ece ain't worth the fees you're paying"
  ]
}