{
  "title": "getting pes rr eee",
  "content": "how is it? \n\nare they allowed to sit for cs placements?",
  "metadata": {
    "id": "1eoskv0",
    "author": "sasta_internet",
    "url": "https://www.reddit.com/r/PESU/comments/1eoskv0/getting_pes_rr_eee/",
    "permalink": "/r/PESU/comments/1eoskv0/getting_pes_rr_eee/",
    "score": 7,
    "upvote_ratio": 0.78,
    "created_utc": 1723295119.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "You can but make sure you know your own core content (EEE) because it determines your gpa. Also you need to brush up on the what the company requires of its employes, CS kids probs would have a higher chance. Good luck!\n└── thank you so much !!!",
    "You will be allowed to sit for CS placements. Until you make sure you know or are learning the subjects that CS companies require, you're good to go.\n├── But I don't think *all* companies will permit EEE students. Most allow ECE as well but the number that also permit EEE is far lesser.\n└── if i maintain cgpa , do a minor and i have the required skills \n\nit's all good?\n    └── Absolutely. But a tip. Just because your interests are in CS, don't forget your core subjects because they dictate your GPA. I know a lot of people in my batch who've always had an interest for CS but they never maintained their CGPA upto a requirement needed by some companies. So keep that in mind.\n        └── yes sure will . i will be working hard on my gpa anyways so that i am eligible for most companies \n\nthank you so much\n            └── I'd also suggest reading the FAQs on this topic. There are some answers on navigating CS placements being in a non-CS branch.\n                └── i couldn't find any , i'll look more. if you have the link , please do share\n                    └── https://bit.ly/pesu-faq\n\nIt's under ECE but most of it will apply",
    "Dude, get a cgpa of 8.5, get your branch changed to pes ec campus cse..\n└── okay \n\nthank you \n\nbut with 8.5 , can't i upgrade to rr ece branch\n    └── Idk the cutoffs for ece, but 9.3 for rr cse and 8.6 for rr aiml and 8.2 smtg for pes ec cse\n        └── okay..\n\nthank you so much !!",
    "Idts unless u have done any minors or courses related to cs"
  ]
}