{
  "title": "About PES(RR) being too 'Strict'",
  "content": "I want a senior to clarify what you mean when you say that 'PES is very strict and theres no college life' ?\n\nAs far as I've seen , (at least in RR campus) : The infrastructure , fests , clubs , crowd and sports facilities seemed decent. What do you mean by 'strict'? Hostels seem chill too, I know the rules are very strict but they aren't really enforced past sem1 anyway.\n\nIf you mean to say academics is tough, I don't see how that has anything to do with the college being strict.  I have friends who're in 3rd year with 9+ cgpa that say that it's not too hard if you study regularly like you would in any other college.\n\n\n\nTLDR: What makes PES 'stricter' than other colleges . \n\n  \n( made an account just now to ask this on reddit )",
  "metadata": {
    "id": "1epo2r7",
    "author": "Low-Astronomer6886",
    "url": "https://www.reddit.com/r/PESU/comments/1epo2r7/about_pesrr_being_too_strict/",
    "permalink": "/r/PESU/comments/1epo2r7/about_pesrr_being_too_strict/",
    "score": 25,
    "upvote_ratio": 0.93,
    "created_utc": 1723391559.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "\"Academic strictness\"",
    "The hostel life sucks, they literally take attendance every evening to make sure everyone is present and going out for even a single night requires special permission.\n\nAnd no, they don't stop enforcing past sem1\n└── That's there in most pvt engineering colleges, vit for example.",
    "bouncers\n└── what're they gonna stop u from doing?\n    └── Skipping classes, loitering around campus, celebrating birthdays etc. Basically anything \"fun\". If you intend to skip classes you are better off wasting time at the library than hanging around in different parts of the campus.\n        ├── I've never seen bouncers catching students for  skipping classes /loitering around campus. I  skip classes here and there to play football  💀(in RR campus).\n        └── Celebrating birthdays is kinda pushing the limits bruh.\nAnd loitering around campus means after class timings or during class timings\n            └── During class timings\n                ├── Ngl but the old owl was better than this japanese version   /s\n                └── new pfp looks cool",
    "I'd say that since the management mainly stay in RR, that's why the rules are much more strictly enforced there. Dress code, ID card, no bunking/loitering, etc. EC campus is comparatively chill (or at least was, during my time)\n\nAcademically RR is tougher and more competitive simply because the higher ranking students go there. It's strict in the sense that the faculty there are stricter about the rules and deadlines.",
    "Attendance matters, need at least 85%. If you study properly and maintain grades youre good. And it depends on teachers."
  ]
}