{
  "title": "Unprofessional Teacher",
  "content": "My Machine Learning teacher walked up to us,a group of 6-7 kids sitting in the last three benches and said\n\n“All of you look the same like Chinese , go to gym,try to have curly hair,have glasses and eat that same dirty protein powder”\n\nCompletely unprovoked might I add,just randomly walked to the back of class and said this during a break.\n\nShe’s a pretty awful teacher and she says all sorts of random shit during class and she switches off the recording device when she spews her nonsense…She flings chalk across the room,she throws markers on the floor when they don’t work and if you ever ask her to go to the restroom she’ll say “you also go out,I’ll also go out but for that you have to pay me more than 1 lakh per month”\n\nPretty much everyone in class hates her,is there anything I can do about it??",
  "metadata": {
    "id": "1eq6sum",
    "author": "DankDankrev",
    "url": "https://www.reddit.com/r/PESU/comments/1eq6sum/unprofessional_teacher/",
    "permalink": "/r/PESU/comments/1eq6sum/unprofessional_teacher/",
    "score": 89,
    "upvote_ratio": 0.97,
    "created_utc": 1723444739.0,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false
  },
  "comments": [
    "True she also said she got an interview at Microsoft for 60 lpa.",
    "Just in she said “ee chut tarle buddi yaake,mane alli pathre tikktya?,what do you have at home? A wife,a girlfriend? Nothing”\n\nTranslation:why do you do this jobless things,do you go home and wash dishes,what do you have at home,a wife? A girlfriend? Nothing \n\n“There’s only few girls in this class even then I see boys gossiping more”\n├── Somebody get rid of this woman\n└── She also said the class is filled with useless people because it has less girls\n    └── Her insecurities are showing",
    "Name and shame. \n└── I would love to but if she finds out I’ll lose my grades and if she’s on my future capstone panel I’m screwed\n    └── She won't, reddit is anonymous and besides profs won't be lurking here \n        ├── Oyeeee..I am watching ...but rest assured, you need not have to worry. That was all common when we were young..now you are young. Just chill and perform.\n        └── Mom, stop! We know it's u",
    "wtf",
    "Just go to the and say that she said that shit, that hod will whack her, for sure, because after two three suicides people are taking that shit seriously, if you wanna take revenge, just go for it, it works, it worked in ec campus\n└── Thing is I’m scared she’ll find out and my grades might get fucked,I’m not sure if that’s a risk I’m willing to take\n    ├── If u have a decent hod, he'll keep ur privacy. Hods generally do not tattle on their students to professors, and in pes they wouldn't take the risk especially after their reputation is down the drain.\nSo go and tell, no need to fear.\n\nEdit: It's also not like she's doing something subjectively bad. What she's doing is just straight up bad in front of any human, so u don't have many worries. You can also bring along the other kids whom were told that racist stuff for convincing power.\n    ├── Something like that happened in my class that went and talked to sandesh, sandesh called that teacher and properly scolded her, saying that she wasn't supposed to say shit like that, so yeah just forget shit like that, that's better, good to move on with, and sandesh maintained the anomity.\n    └── She can't fuck over your grades give an anonymous complaint",
    "Okay, I'm curious. Can you drop the name?\n└── She’s an associate prof,I’m not sure if I should drop the name.Im very tempted to though\n    ├── Fair enough, it's probably best not to\n    │   └── She teaches ML for 5th sem students though that’s the max I’ll say\n    └── CSE?\n        └── Yes indeed",
    "which campus bro?\n└── RR Campus",
    "A or F section for sure\n└── I can confirm you are right",
    "As far as I know, pes has restrictions on mobile phones alone (class of 2005, yeah I know pretty long back.) don't know if it's still the same. But then read the rules does it ban you from using an audio recording device? If not, then get one and you know what to do next. Btw is Mr Nitin pujari still working there? If yes approach him. He's a gem of a person who is super super helpful for students.\n└── Edit: nitin pujari was in the nayandahalli campus back in 2008 when I checked. Haven't been there after that."
  ]
}