{
  "title": "2025 Batch Placements",
  "content": "Hey, is there any spreadsheet for the statistics of placements for the 2025 batch? ",
  "metadata": {
    "id": "1eqho76",
    "author": "Prize-Mechanic-8180",
    "url": "https://www.reddit.com/r/PESU/comments/1eqho76/2025_batch_placements/",
    "permalink": "/r/PESU/comments/1eqho76/2025_batch_placements/",
    "score": 12,
    "upvote_ratio": 1.0,
    "created_utc": 1723478797.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "\n\n[pesu 2025 placement stats.. ](https://docs.google.com/spreadsheets/d/1TfR17y3iPGzHFmCfWGwAXBpwCHvbxEK0wOP_Kx8FOG8/edit?usp=sharing)\n├── was someone in ece offered 56lpa or was that offer just open to ece students?\n│   └── I confirmed it with a senior, the company was just opened to ece students, but fte was only offered to cse guys\n│       └── ohhh so the placements have just begun and it'll take many months for the full placement details right?\n│           └── Yes.. You can check placement stats of last year and before last year for reference..\n│               ├── ohh ok thanks\n│               └── wt was the highest offered to an ece student?\n│                   └── No idea, sry..\n├── Does the list include only the placement details of 2025 batch students who got placed since July/Aug or the ones who got internships earlier for spring/summer of 2024 are also included?\n│   └── Only the placement stats of this batch ig and their internships, Not sure\n│       └── Yes, only 2025 internships &amp; placements\n│           ├── Ohk. I have a doubt actually, why did jp Morgan and phone pe take ece students for sde and software engineer role and not cse students?\n│           │   └── Nope, we have forgot to include JPMC (JP morgan and chase) under CSE. They were open to CSE , ECE both. \n\nBut as far as i know only CSE ppl got FTE + Internship offer(s)\n│           │       └── That's great...\n\nWhat about zomato and blink it.. Was it the same case?\n│           │           └── Yes yes, we have updated now, as u can see\n│           │               ├── only one student was placed in ece?\n│           │               │   └── Yes\n│           │               └── Ohk man, tqsm for confirming this..\n│           └── the placements have just begin right?how long will the placements last?\n│               └── It will keep happening till next year March ig\n│                   └── A little longer than that actually. 2024 batch is still getting placement offers. \n│                       └── Ah okay, got it\n└── Did goldmansachs offer 75k intern with performance based placement for 4th year students ",
    "Looks like sheet not updated from long time"
  ]
}