{
  "title": "Regarding criticisms of AIML branch at PESU",
  "content": "We had a orientation session last week for 2nd year AIML students where they informed us about the syllabus and entire course structure of our batch. AIML students now have the exact same courses and syllabus in 2nd year as that of CSE students and in 3rd year, the main courses for both are also the same and the difference lies only in the elective choices. AIML students get to choose Cyber Security and AIML related electives (AI for Healthcare &amp; Manufacturing and Applied &amp; Advanced ML) whereas CSE students get to choose Cyber Security, Systems and Core Computing and MIDS (Machine Intelligence &amp; Data Science) related electives in 5th and 6th sem. So are the critcisms pointed out earlier by seniors especially with regards to future MS prospects and about the syllabus/course structure still valid? \n\nu/rowlet-owl",
  "metadata": {
    "id": "1eqhv21",
    "author": "Head_Fish794",
    "url": "https://www.reddit.com/r/PESU/comments/1eqhv21/regarding_criticisms_of_aiml_branch_at_pesu/",
    "permalink": "/r/PESU/comments/1eqhv21/regarding_criticisms_of_aiml_branch_at_pesu/",
    "score": 21,
    "upvote_ratio": 0.9,
    "created_utc": 1723479238.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "Yes it is regarding the future MS/Mtech prospects. The only thing being in AI/ML is they obviously teach you stuff more towards this particular specialisation. This would only do good for those who are interested in this field. However there are people who are keen to explore other specialisations so they would opt for the core CSE instead.\n└── You sure about that though? The only diff now lies in the elective choices, there are 3 elective related specialization both CSE and AIML students can opt for and both of them have Cyber Security electives and the ML related electives CSE students get are there for AIML students also so the only diff lies in the electives coming under Systems and Core computing for CSE students which AIML students don't have. But some of the electives coming under SCC specialization also overlap with MIDS or Cybersecurity so you only miss out on the ones that exclusively come under SCC specialization. So is there really that much of a diff? \n\nAlso most people anyways end up taking AI/ML related electives only right? And if in case, you aren't keen on learning ML then you can just take Cyber Security related electives no?\n    └── Yes we can do this but again comes the challenge of how colleges offering post graduate courses accept colleges. There's even uncertainty if they would accept a specialisation course such as CSE(AIML), because they have been accepting core CSE guys over the years. So the fear factor also exists while choosing branches.\n        └── Bro the HOD told us that if we end up taking Cyber Security related electives ours would be the same degree that the core CSE guys get with a specialization in Cyber Security. And also if we end up taking random electives (not all coming under a particular specialization) then we'll just end up getting a B. Tech in CSE degree without any specialization. And while applying to foreign univ's we can just mention that we did our undergrad in CSE no (as all main subjects are the same) and not mention about the specialization certificate if we feel that'll affect our selection prospects?\n            ├── &gt; And while applying to foreign univ's we can just mention that we did our undergrad in CSE no (as all main subjects are the same) and not mention about the specialization certificate if we feel that'll affect our selection prospects?\n\n\nDo not lie about your degree. If your degree said AiML say you did it in Aiml. Lying during masters application is a huge red flag and can leave a permanent black mark on your education. \n\n&gt; mention about the specialization certificate if we feel that'll affect our selection prospects?\n\n\nThere is a big difference between a specialization certificate and a Aiml degree. If u get a B.Tech degree for CS **and** a seperate certificate for specialization in Aiml then you can always say you did B.Tech in CS. If your BTech degree says CS+Aiml or something like that, it is considered a different branch.\n            └── Hey bro, can I DM u?",
    "The main problem with Aiml is how people view it **outside** of PES. \n\nThe syllabus could be the same or maybe even better than core CS but will people outside of PES know or even care about that? The majority of people see Aiml and other specialized branches as a \"lower\" branch. \n\n\nThe issue is not the syllabus. If there is one thing I can give credit to PES it'll be how they handle the syllabus.",
    "u/rowlet-owl, did u see this",
    "if you want u/rowlet-owl to answer why dont you just dm him bro\n└── Bro I mentioned him because he was the one who was most vocal about this and wanted to engage in an open discussion that could be of use to other people as well, especially the students who are already in AIML or planning/going to join AIML at PESU and are concerned about their chances of being able to do Masters in India or abroad if they take up AIML.\n    ├── to be honestly , if theyre letting you pick cyber security electives as well seems like they just invented a way to increase their cse intake lmao. Look admissions depend on the USA University ka Admission council , its their decision whether they consider your UG course sufficient and comprising of All the fundamentals for a CSE UG degree or not. its not u/rowlet-owl or pes or you or me who can decide. I personally know people who have done degrees like telecom in ug worked a few yrs in IT and then went on do their MS in CS in USA in ASU, so I think admissions are based off whether they think you can cope with A ms degree or not. This may vary from university to university. Some unis maybe strict with their requirements in UG and some may be flexible as long as they believe you can get through the course. No way will you get straight rejects from all mscs programs cuz you have aiml specialization (cuz people with telecom have made it AFTER proving their work ex in IT). It all depends on the admission Council of the Uni you apply and their requirements bro.\n    └── I'm a bit busy today (and will be over the next 2 days) because I'm flying out tomorrow morning for my MS. I'll post my views once I find the time. Hope you understand.\n        └── Sorry man. Reply whenever you get time. All the best for your new journey."
  ]
}