{
  "title": "I am currently in 2nd year when to start leetcode problems ",
  "content": "",
  "metadata": {
    "id": "1esksyz",
    "author": "Hour-Still2441",
    "url": "https://www.reddit.com/r/PESU/comments/1esksyz/i_am_currently_in_2nd_year_when_to_start_leetcode/",
    "permalink": "/r/PESU/comments/1esksyz/i_am_currently_in_2nd_year_when_to_start_leetcode/",
    "score": 21,
    "upvote_ratio": 0.96,
    "created_utc": 1723691346.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "The earlier u start, the better",
    "Most people grind LC only in their third year. Placements do not only depend on your problem solving abilities but also your entire profile. Now is the time to explore and figure out your interests so you can align your resume towards a certain field by building relevant projects and through relevant experiences. There are more details on this in the FAQs.\n└── So late ?\nSo pes rvce bms dont have coding culture  like nits iits iiiits ?\nNo comeptitve coding ?\n    └── People do competitive programming, but definitely not as much as in IIT/NIT etc. I was referring to when people do it for placements, that's when most pick it up. \n\nContrary to popular belief, you **do not need** CP to get placed.\n        └── But oas are cp level right \nAnd doing cp is edge in tier 3 college  where almost all biehart leetocde\n            └── Nah, you don't need to grind CP. As long as you have good problem solving abilities and your fundamentals are clear, you have a good shot. A lot of people including me did not bother with it to get placed. You don't have to memorise answers, if you do that you won't make a good engineer (and it'll show at work lol). Doing CP will not give you the edge in any college. Having a good profile will. The goal of CP is to build problem solving abilities. If you develop this skill, that's all you need. If you pay attention during DSA courses, that's enough to cover the basics.\n\nAnd online assessments also include CS topics like OS, CN, DBMS etc.\n                └── My friend told me reach expert or master by 1 year \nDsa will be cakewalk you can even solve lewtocde hard\nAmd from second year explore domain\n                    └── Explore first, grind later. That's the ideal way. CP isn't everything. Having a good profile with solid experiences and projects is the way to stand out.\n                        ├── What are good projects?\n                        └── I feel cp will improve my proboem solving . It will help in bakcend optmising \nFrom 2nx year i can even use what i studied\nMostly will be backend role  i feel or data eng",
    "Your at the correct platform to start it  with, as in the 2nd year you have the sub DSA."
  ]
}