{
  "title": "Should I Participate in Infeynite as a second-Year?",
  "content": "Hey everyone,\n\nI'm a second-year student at PES University, and I've been hearing a lot about this  hackathon called Infeynite. It sounds exciting, but I'm not sure if I'm skilled enough to participate, \n\nFor those who have participated in hackathons before or have experience, do you think it's a good idea to give a futile shot. And if I do decide to take part, what kind of projects should I consider working on \n\nAny advice or suggestions would be greatly appreciated!",
  "metadata": {
    "id": "1ev1lb8",
    "author": "lain_2004",
    "url": "https://www.reddit.com/r/PESU/comments/1ev1lb8/should_i_participate_in_infeynite_as_a_secondyear/",
    "permalink": "/r/PESU/comments/1ev1lb8/should_i_participate_in_infeynite_as_a_secondyear/",
    "score": 15,
    "upvote_ratio": 0.88,
    "created_utc": 1723958253.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "If you're wondering whether to join Infeynite, here's the deal: themes are provided, and you can choose a problem statement. You'll pitch your solution idea in a deck; if it's innovative enough, you'll move forward. Then, you'll actually build your solution with rounds of mentoring and judging. It's not just about coding—hardware solutions are welcome too.\n\nSo, if you're curious or excited, it’s worth giving it a shot!",
    " I regret not going for enough hackathons  And most of the times, getting a quality team is the issue.. so get a team who are ready to come to all hackathons and stick with that team!  Go on try different hackathons! ",
    "bro chill you ain't getting selected.\n\nlol\n\nkidding\n\njust go don't think so much",
    "Got no skills : still go for the hack  \nGot no prev hack experience : still go for the hack  \nGot no projects done before : still still go for the hack  \n  \nHacks are pretty important to attend in ur clg , u learn most of the things in no time , meet so many good people (trust me I always did) , Get a good project made by u in a span of a day!!  \n  \nNote: the first hack I went , all I knew was basic python &amp; still made it to the top 4",
    "I would advice you that you do participate even if u don't win it's a great chance to:   \n1) meet your seniors and make some connections  \n2) make new friends  \n3) a good exposure to team working and competing   \n4) And obviously have fun get goodies and make the best memories of your college life"
  ]
}