{
  "title": "NVIDIA Software Engineer QnA",
  "content": "**TL;DR**: AMA with Nvidia Senior SWE (CMU graduate), 24th August 10 AM IST, live on YouTube. Post questions if you can't attend; recording available later.\n\n**Submit your questions here:** [https://forms.gle/xoSz7Vi9imxeNmMWA](https://forms.gle/xoSz7Vi9imxeNmMWA)\n\n\n\nHey r/PESU \n\nThought you all might be interested in this: PES Innovation Lab is organizing a live Q&amp;A session with **Aushim Nagarkatti**, a member of the Lab, and **Senior Software Engineer at NVIDIA** who graduated from **Carnegie Mellon University**. This is a great chance to get some real insights into landing those coveted internships and new grad positions at top tech companies.\n\n**Details:**\n\n* **Date:** August 24th\n* **Time:** 10 AM \\[IST\\]\n* **Where:** YouTube Live on the PES Innovation Lab channel ([here](https://www.youtube.com/@pesinnovationlab))\n\nAushim will be taking questions on (not limited to):\n\n* His journey from CS major to NVIDIA\n* Internship and new grad application strategies\n* What it's like working at NVIDIA\n* Skills and projects that stand out to recruiters\n\nThis is your shot to get advice straight from someone who's been through the PES grind and made it to a senior position at a leading tech company. Whether you're stressing about internships, wondering about grad school, or just trying to figure out your career path, Aushim's insights could be super valuable.\n\nDrop your questions below if you can't make it live - we'll try to get to as many as possible during the stream. And don't sweat it if you miss the live event, the recording will be up on the channel afterward.",
  "metadata": {
    "id": "1ezd5j8",
    "author": "AdPublic1057",
    "url": "https://www.reddit.com/r/PESU/comments/1ezd5j8/nvidia_software_engineer_qna/",
    "permalink": "/r/PESU/comments/1ezd5j8/nvidia_software_engineer_qna/",
    "score": 41,
    "upvote_ratio": 0.98,
    "created_utc": 1724420727.0,
    "flair": "Club Announcement :snoo_smile:",
    "nsfw": false
  },
  "comments": [
    "Hi I'm a fresher joining pesu this year cs core. Im not sure what I'm interested in but everybody around me seems to have decided on their interests like someone wants to be be web developer, someone wants to be an iOS developer etc. \nWhat exactly did you do while exploring your interests in college while maintaining the cgpa grind?"
  ]
}