{
  "title": "Need perspective from college students",
  "content": "Hey everyone!\n\nI graduated some time ago and I’m working on an app to help people find others with similar interests to hang out with and do hobbies together. Initially, I built it for people after college, since staying connected and finding buddies can be tough. But talking to a junior who mentioned he sometimes has the same problem even in college made me realize this could work well for students too.\n\nThe use cases can be finding people for your clubs or fraternity, prepping for interviews or career mentorship with seniors, sharing notes, or even finding someone to play a sport with. I'm launching on September 20th, and I’d love to get your feedback. Do you think this is something you'd use? Let me know—any input would be super helpful.\n\nIf you're interested and want to know more, you can check out [www.aroundu.i](http://www.aroundu.in/)n Any feedback would be super helpful.\n\nThanks in advance.",
  "metadata": {
    "id": "1ezxjjn",
    "author": "Glass_Abies1426",
    "url": "https://www.reddit.com/r/PESU/comments/1ezxjjn/need_perspective_from_college_students/",
    "permalink": "/r/PESU/comments/1ezxjjn/need_perspective_from_college_students/",
    "score": 24,
    "upvote_ratio": 1.0,
    "created_utc": 1724475996.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "Any student who is interested in helping me out by spreading the word? We can discuss a possible internship, please DM me\n└── I messaged you.I'm looking for software internship",
    "Nice but I can't use it. I mean it asks for email id with a waiting time. How long will it take?\n└── We’re launching on September 20\n    └── Ok Will try it. Any plans on making it paid in any way? Or just generate revenue from promoting ads?\n        └── We will not make it paid per se. People who are creating lobbies, can make their lobbies paid. And probably, we will charge a commission. But nothing decided, we are just experimentation stage as of now\n            └── Ok. Good luck.",
    "Well, firstly its a great idea. Secondly, the feature where u provide resources to prep for interviews &amp; career mentorship, is amazing as well. \n\nYes, I'd definitely use this as long as its *not paid*\n└── Its not going to be paid from our side in the near future\n    └── Awesome !!",
    "Personally, I'd use subreddits and discord servers for this.\n└── I think these are good for chatting and having an online community m, but would you meet someone from reddit without having thousand thoughts\n    ├── Hi sorry I sort of assumed what the app would be like w/o visiting your website because I've seen some people try this out and didn't like how they presented it. But to answer your question, no I wouldn't meet someone off reddit unless they were from PES (initially I thought the app was only going to be for PES students). and yeah discord servers won't be beneficial for the examples that you've mentioned in your website too (for eg: looking for a roommate).   \nI've come to like the idea now lol, apologies again. just signed up w/ my email.\n\nP.S. there's a spelling error at the very end of the homepage, I think you missed the 'a' in 'Banglore'\n    │   └── No worries, i think everyone makes assumptions, glad you came around to like it. And noted the mistake, fixing it\n    └── If you meant meet people irl it would be about the same be it reddit, discord or your app. You can't trust faceless people on the internet\n        └── They will not be faceless :)\n            └── Like Omegle but for hobbies? Idk man I still wouldn't want to meet strangers I met online. The idea is great and I hope it works out\n                └── If you visit the site, you will see what the user profiles will look like. I’d say it more like Tinder for hobbies than omegle\n                    └── Bro the website looks hella clean. This gives me hope.\n                        └── Arigato"
  ]
}