{
  "title": "Socialising help",
  "content": "I am an second year student now . I still dont have any good friend group even after completing one year . I have a few friend but i cant call them my close friends . I cant say myself as an introvert but  istg i havn't talked to a single girl , at most 3-4 words a few times . So how do i get some good friends (ik this not a question to get a tutorial).But i seriously need help as from now on well start having group projects and if i dont make good friends eventually my grades gonna suck.",
  "metadata": {
    "id": "1f05z08",
    "author": "Radiant-Contract-460",
    "url": "https://www.reddit.com/r/PESU/comments/1f05z08/socialising_help/",
    "permalink": "/r/PESU/comments/1f05z08/socialising_help/",
    "score": 42,
    "upvote_ratio": 0.97,
    "created_utc": 1724508050.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "Is it because you were in 2 different sections for the 2 sems ? Shuffling can screw you up big time, 1st sem I was in 1 class then they had to mix pessat and kcet together so I was thrown into another class, in the third sem I was thrown in another class because they had to make is SRN wise sections.I can really relate with you. Its prettty hard to like penetrate into an already formed friend grp. I recommend joining a club so that you can have a stable group friends, it takes time to become close especially as adults. Once things settled down in 3rd sem I found a friend and through him I got into his then friend group and after that its only been ups. Before that I hated coming to college . After i found this group I had started looking forward to coming to college. I hope the same thing happens to you.",
    "Join clubs for a start. You'll meet like minded ppl",
    "Well I joined friends for group projects, and they definitely sucked. So just find smarter people to talk to for that purpose.\n\nYou need to be able to talk to just about anyone about anything. Practice makes perfect. It's very difficult initially, but you learn and get used to it. \n\nAlso, people love talking about themselves. Asking relevant questions will get them to open up and like having you around. \n\nI have had various friend groups throughout my 4 years of college. It's pretty easy to socialize at any type of college event. Especially now, there's thousands of people on campus. Good to have certain hobbies/interests you're passionate about too, so that you have stuff to talk about.\n└── The problem is I feel odd to talk to my classmate now after being silent for whole month(new classmates) and even moreeeeeee awkward after not talking to them for whole year (old mates) especially girls\n    └── never too late to start talking!\n        └── Yup, never too late. The oddness and awkwardness exists in your head. It could be weird initially if you go out of the blue like an extrovert, but will be fine after that. You're missing out on good friendships and class experiences by staying silent.\n\nHeck I'm still reaching out to my batchmates 2-3 years after graduation. Approaching people 1-1 is easier than in a group sometimes. And the 1 person will introduce you to the rest of the group and so on. \n\nTry your best to socialize and network, that's the only useful (and fun) part of college. All the best :)",
    "Same bro 😔",
    "Us moment 😭",
    "This is the feeling most (if not all boys have) \nJust don’t feel too insecure or anything. Join clubs, talk to many people and most important don’t change anything for anybody, \nPeople will like you and become close to you eventually.",
    "What branch are you bro? I'm a lateral entry student and i literally have no friends here except like a couple classmates who talk to me. But I just approach anyone if I need anything and people in my section are cool too. Making close friends doesn't matter to me anymore because of a long history but I'm still down to it tho. If you wanna catch up and talk you can text me bro.",
    "Just start talking to your classmates and you’ll find people you fw soon"
  ]
}