{
  "title": "College hasn't started yet and my parents are pressurizing me for the most trivial things possible",
  "content": "For instance, for the past few days, my father has been frustrated with me and is scolding me because I do not know when the college will start and there hasn't been any official announcement yet. Basically he's putting all blame on me for not knowing when the college starts.\n\nOn top of that, both of my parents are pressurizing me to study even though college hasn't started, because they think if I do not study now, I will struggle when college starts.\n\nDue to this, I've been feeling anxious and going completely off the deep end.\n\nWTF should I do in this situation?",
  "metadata": {
    "id": "1f356ia",
    "author": "fuckstans42069",
    "url": "https://www.reddit.com/r/PESU/comments/1f356ia/college_hasnt_started_yet_and_my_parents_are/",
    "permalink": "/r/PESU/comments/1f356ia/college_hasnt_started_yet_and_my_parents_are/",
    "score": 59,
    "upvote_ratio": 0.94,
    "created_utc": 1724834496.0,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false
  },
  "comments": [
    "My scene the entire lockdown",
    "Just make up a random date around the second week of September and give it to them so that they calm tf down and then when the real dates are released just tell them the dates got preponed/postponed from the last announcement.",
    "Indian parents are like this all the time. You have to convince them that you will manage on your own, and that they should not worry about you.\n\nThey still think of you as a 13 year old child who can't make decisions on your own",
    "almost same situation, bro 😭😭",
    "There comes a point in all our lives when its time to tell even ur parents to jist chill tf out. Just say, \"Listen mom and dad I have it under control, *state ur previous success with ur study strategies* , I will be anyways fully busy when college starts so leave me for now. Please try and understand.\" If this is not an option and u probably could get belted for standing up for urself then just say \"Haan ok i will do it later i have little work rn or do some chores\" and maybe look at the books for like 1 hour for their satisfaction. But thats it dont strain urself for their sake.\n└── Me with no previous success😌",
    "aicte has told colleges to started max by 15th sept  \nso yeah thats a deadline you could expect pes to follow though i think they will start bootstrap from 7th ish only\n\nits neither your fault nor your parents   \nbut ik a tactic to cool your parents down  \"act like you are studying\" lol   \nbut do study fr if you are already interested in a certain domain of cs\n└── Any guesses on MCA course bro of the new batch of 2024 ?\n    └── idk man sorry",
    "Us bro us moment 😭",
    "Play some games in there absence",
    "Dude ,Parents are bound to be like that, \nFirst, as far as dates are concerned you should just say when college tells when to come,  I will go. You can tell ur dad to find out himself honestly .\n\n\nSecondly,  just for their sake and your sake just like study like 1 mini topic or better yet 1 sentence. Just show them that your studying.  I don't think they will be sitting and asking you questions.  ",
    "Which branch are u bro",
    "Nice to know we have the same father\n└── \"Type\" u wanna say?",
    "Dont worry bro \nYour parents are concerned about you \nAnd they are doing all this \nThey are worried about you and your future\nYou might be angry at them \nBut when you go to hostel you will miss them so badly\nIf you want you study but don't fight with them\nThese 2 weeks is your last time with them \nAfterwards you won't get this much time to speak with them \nDon't do or say something that you will regret later\n└── Bro that doesn't give them the write to say all that or behave like that, No amount of love can justify wrong behaviours"
  ]
}