{
  "title": "Why You Should Not Join PESU",
  "content": "This post is a final warning call to ask yourself if you truly want to join PESU  \nThe sole purpose of this post is to reduce competition and to give opportunity to others who want to join but are cut short by cutoffs **though i clearly state the purpose i wont blurt out random words with hyperlinks to references here and there** and go ahead and correct me down in the comments if something is mistaken.\n\n* ***College Life:*** Stressful to say the least. The only fun you have in college is if you a decent friend group or you wait until the yearly once fest (twice if you attend both the campus' fest). As many have stated PESU is completely academically orientated. PESU does not even have a [freshers/ethnic day ](https://www.reddit.com/r/PESU/comments/16eu31z/freshers/)you are slingshot straight into academics from Day 1 after Bootstrap and starting from that your life will revolve around ISA's, ESA's, Projects, Assignments, Capstone and yada yada. First Year starts off with students filled with enthusiasm to get a job at MAANG, you get tossed into a competition with 2160 students if you are not in rr cse to get to the 9.5+ mark to have a chance of getting those few seats. Second Year is When The Courses start to get hard. Third Year is the most stressful out of all the four years with the electives, capstone, internships. Fourth Year is Chill only if you manage to get a job early or you will be stressed out about your career until you manage to get one. Keep in mind You have to learn more than what PES teaches on your own while juggling between everything to get a job.\n* ***Competitive Environment:*** Maybe A bit of a personal account but befriending people might get hard especially if you are joining from kcet round 2 or 3 (separate classes) students find each other to be as competitors rather than friends (happened to be the case of my elder sister who joined EC CSE through kcet round 2 2022 joinee) though this will get better from sem 2 since you are mixed with pessat students. This Competitive Environment Comes to its highest peak right before placement season with even friends getting jealous of you if they you end up getting a better ctc.\n* ***Clubs , Hackathons, Extracurricular Activities:*** Clubs In PESU are on paper large in quantity with Management hanging posters everywhere on campus [but most are dead/inactive](https://www.reddit.com/r/PESU/comments/1c2wtt1/comment/kzcx9lo/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button). Hackathons are held in both the campus' regularly in RR and EC(more in quantity at RR) but the quality of hackathons in [EC is better than RR. ](https://www.reddit.com/r/PESU/comments/1e6b648/comment/lds0rlx/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button)Talking about extracurriculars, [sports at pesu is a joke ](https://www.reddit.com/r/PESU/comments/1ekwexo/sportshow_good_is_is_it_in_ec_campus/)at this point though there are so many amenities on campus yet students dont have time to use them without sacrificing academics(especially day scholars) there are huge cricket grounds in rr and ec but only [university team members are allowed to use them ](https://www.reddit.com/r/PESU/comments/1el7peh/are_students_allowed_to_use_the_cricket_and/)atleast wrt ec, football club is good though and everyone is allowed to use the field.\n* ***Questionable Peer Group:*** [With Only 88 General Merit Seats out of 720 through kcet ](https://cetonline.karnataka.gov.in/keawebentry456/cet2023/BULL_ENGG_FREE_2023english.pdf)(no change in core cse seats this year)(720 is including pessat, jee-m, mq seats) with cutoffs for **just RR CSE** being well into [&gt;15k rank range](https://cetonline.karnataka.gov.in/keawebentry456/cet2023/ENR2_CUTGENenglish.pdf) for certain Categories, with More second round pessat seats said to be sold secretly as management quota seats, with pessat normalisation across shifts being suspicious as nor do they release the candidate's marks nor the question paper's of each shift and candidates flunking in every other competitive exam but miraculously acing in pessat has been a common occurrence over the years(hesitating to link comments of people mentioning their kcet/comedk rank and pessat ranks as they might get offended) After taking admission too, if you end up in the wrong friend group you might start getting involved in activities such a smoking, vaping etc. especially in RR Campus with a road adjacent to it which is glorified as the ['Sutta Gully'](https://www.reddit.com/r/PESU/comments/162n74m/sutta_gully/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button) even on this sub reddit though ig its more of a food street.\n* ***Poor Management:*** With Insensitive Professors/Teaching Staff Even having a hand in the last sui\\*ide, [with unprofessional teachers continuing to be paid](https://www.reddit.com/r/PESU/comments/1eq6sum/unprofessional_teacher/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button), [bcom hod](https://www.reddit.com/r/PESU/comments/1er6egm/we_are_so_cooked/) making students sit at assigned places worse than a school hope that stuff doesnt happen to btech, [making electronic city a literal prison](https://www.reddit.com/r/PESU/comments/1dghai9/seriously_wtf/) instead of even trying to implement other methods to address the chief problem of students being stressed out to that level.\n* ***Bus Timings and Congestion:*** Bus routes with even boarding times as early as 6:20 a.m. you are spending approximately 12 hours of your day at PESU since the Bus' Depart from both RR and EC at 5pm regardless of when your classes end [even on half days](https://www.reddit.com/r/PESU/comments/1csv113/people_using_college_buses_should_stay_till_6/). Going back home will take so much more time since you are travelling in the rush hours. With the Metro Construction right in front of RR Traffic Congestion will increase making it a pain in the ass for day scholars until it opens (expected to open in 2029 so our batch will graduate until then). And guess what even after going home guess what you have to focus on academics.\n* ***Placements:*** PES Saar Placements are Second to RVCE Saar better placements than BMSCE saar even after securing 8+ cgpa after working hard for 4 whole years with the hard tests in PES companies can choose to shortlist however high cgpa they want sometimes without realising the difference in the difficulty one has to go through to get a high cgpa with respect to a VTU college. BMSCE Overall Undergrad Median(with all branches) itself is[ 9 lpa](https://bmsce.ac.in/assets/files/NIRF/2024-B.M.S.%20College%20of%20Engineering20240228-ENGINEERING.pdf) according to official placement statistics even after not having to go through PESU level of academic rigour. Though ill give the benefit of doubt since they dont give a detailed picture. But [RVCE placement statistics](https://drive.google.com/file/d/1pzw8FkXRknEpaXBBmoVEl8HFE-iqmdx6/view) are detailed and according to them **RVCE ECE Median itself is 14 lpa beating PES' 12 lpa** median Even Mechanical is Close to 10 lpa. **So if you are just looking for placements** **rvce ece is statistically a better option but do remember if you want to do masters cse is always the better option** also i remember seeing some dude saying that[ rvce ece isnt recommended by seniors itself while linking to a post](https://www.reddit.com/r/rvce/comments/1esag9d/an_imposter_among_us/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button) and the \"senior\"  turned out to be a guy slandering to reduce competition though the difference between me and him is that he didnt include any proofs/references.\n\nI appreciate if you read so much, took me 4 hours to compile my thoughts and word them properly lol.  \nAn upvote would be appreciated, though i would understand why you would downvote as well.\n\nI am going to delete this account in a few hours to remain anonymous.\n\nThanks.",
  "metadata": {
    "id": "1f4awz0",
    "author": "[deleted]",
    "url": "https://www.reddit.com/r/PESU/comments/1f4awz0/why_you_should_not_join_pesu/",
    "permalink": "/r/PESU/comments/1f4awz0/why_you_should_not_join_pesu/",
    "score": 260,
    "upvote_ratio": 0.98,
    "created_utc": 1724959059.0,
    "flair": "Pride Of PESU",
    "nsfw": false
  },
  "comments": [
    "GAWD DAMN it the ultimate BOSS 🗿🫡",
    "You know more about PES than the students themselves lmao\n├── nah uh more than PES management itself 🗿💀\n└── Is he not a student there?",
    "Honestly this is so well written I might actually add it to the FAQs\n└── Bro you yourself commented a month back that the peer group in pes is better than most other tier 2 colleges.😭😭😭 Could anybody tell what's the scenario. Most of my friends joining pes rr cse even through pessat have jee main percentile of atleast above 97\n    ├── The peer group is great, not denying that. OP is looking at a small sample to claim that your peers are wasting time and money. But as is the case with every college, you'll find both types of people here\n    ├── i am joining ece after 95 bro, i have a friend joining after 98.\n    │   └── Rv or pes??if pes then peer group would be good only no\n    │       └── its good only bro, tell me any other tier 2 college with students this active, all Passat and jee quota students are technically pure merit. thats more merit seats then RVCE or bms.\n    │           └── Ya\n    └── with 97 u wont get any good govt college and PES CSE is better than most of the lower NITs, e.g. Nagpur, Hamirpur, Jalandhar, etc. If you are getting something like Rourkela, Allahabad or better, go for it.\n        ├── u wont get cse anywhere if i am not wrong, even lower nits end by 97.\n        │   └── Ya only new iiits\n        └── I am telling in general",
    "TLDR : If you're an academic student , Join PES : it'll boost ur profile , give you appropriate training ( atleast for CS related branches ) and decent placements\n\nIf you're going to college for sports/extra curricular - You can still do it at PES , but you'll have to learn time management.",
    "Thanks for giving all the feshers more regret and guilt. Appreciate your efforts tho.",
    "Summarized with AI  \nThe post delves into various aspects of PES University, including:\n\n**Academic Environment:**\n\n* **Stressful:** Students are immersed in academics from day one, with a heavy focus on ISA's, ESA's, Projects, Assignments, Capstone, and more.\n* **Competitive:** Students compete intensely for limited seats in high-paying companies, especially in core branches like CSE.\n* **Difficult Courses:** Courses become progressively harder, particularly in the third year with electives, capstone, and internships.\n* **Self-Learning:** Students need to learn beyond the curriculum to secure good placements.\n\n**Social Environment:**\n\n* **Friendship Challenges:** Befriending peers can be difficult, especially for students joining in later rounds, as competition often overshadows friendship.\n* **Jealousy:** Friendships can be strained during placement season due to competition for better job offers.\n* **Limited Extracurriculars:** Clubs are often inactive, and sports opportunities are limited, especially for day scholars.\n\n**Peer Group:**\n\n* **Questionable Behavior:** Some students engage in activities like smoking and vaping, particularly in the RR campus.\n* **Management Issues:** The management has faced criticism, including allegations of insensitivity and unprofessional behavior.\n\n**Infrastructure and Logistics:**\n\n* **Bus Timings:** Bus timings are inconvenient, requiring students to spend long hours on campus.\n* **Traffic Congestion:** The Metro construction near the RR campus has caused traffic congestion, affecting day scholars.\n\n**Placements:**\n\n* **Second to RVCE:** PES Saar's placements are generally considered better than BMSCE but behind RVCE.\n* **High CGPA Requirement:** Even with high CGPA, securing placements in top companies can be challenging due to intense competition.\n* **RVCE as a Better Option:** RVCE is statistically a better choice for those seeking placements, especially in ECE.\n\nOverall, the post paints a negative picture of PES University, highlighting the challenges and drawbacks that potential students should consider before making their decision.\n└── &gt;Questionable Behavior\n\n\n\nAre these students limited to rr , or are there some in ecc too?? And are there any fights frequently?",
    "Pes is only good for studies and placements nothing else 😛",
    "Man the 4th point is so true\nMany of my batch mates who flunked every exam have gotten in rr campus in branches like aiml, cs",
    "Ik OP has deleted their account, but if you're reading this, thank you for summarizing my exact thoughts.",
    "Best written post in this sub reddit",
    "We all have been saying the same thing since we joined... Nobody believes it until they join",
    "Actually liked the 4th point, your humour. Dude Woke up and spitting fax. Will share this to my other friends I know who want to get into the college only by seeing \" MEDIAN PACKAGE\"",
    "Great job dude!  , would love if anyone makes the same for rvce and bmsce .",
    "\n\n&gt;, if you end up in the wrong friend group you might\n\n\nI got a question bro, regarding peer group, are the \"activities\" limited to what u mentioned, or are there still more \"activities\" going on, which can't be mentioned??I would like to know bout  it , to dodge such bullets, "
  ]
}