{
  "title": "Which is the best",
  "content": "So I'm getting pes rr cse through pessat, pes ec cse kcet, pes rr aiml kcet (but heard it'll be a problem for masters) and bms cse kcet (increased seats could be a porblem) \n\nmy main focus is placements and academics. Wanna pursue masters abroad.\n\nSeniors please suggest which to pick.",
  "metadata": {
    "id": "1f5izsn",
    "author": "[deleted]",
    "url": "https://www.reddit.com/r/PESU/comments/1f5izsn/which_is_the_best/",
    "permalink": "/r/PESU/comments/1f5izsn/which_is_the_best/",
    "score": 8,
    "upvote_ratio": 0.91,
    "created_utc": 1725094918.0,
    "flair": "PESSAT/Admission",
    "nsfw": false
  },
  "comments": [
    "Pick thru kcet bro u can save money\n└── is rr not worth the extra fee?\n    └── no.\n        └── are teachers, facilities research any better in rr?\n            └── Yeahh but it solely depends on you if money ain't a problem",
    "Rr aiml won't be too much of a problem now afaik. Their coursework covers everything core cs does and that's what unis abroad look at\n└── but won't it be even hard to score good cgpa?\n    └── It's the same courses and infact aiml grading is slightly lax here compared to cs",
    "Hey, I’m a fresher just like you and I don’t have any experience in graduate admissions so take this with a grain of salt.\n\nI recently read a research paper by a guy who was on Stanford’s graduate admissions committee and according to him, the most impactful factors in applications (not in any definite order) were CGPA, GRE score, research experience, and recommendation letters. Though they look at courses as well, the paper said that it isn’t heavily criticised, but that it’s important to take harder classes and do well in them.\n\nSo if you love maths and are genuinely interested in aiml, then just go for it, otherwise choose core cse.",
    "RR AIML if you interested in AIML if not EC CSE.\n└── aiml is fine, but will it give any setbacks during masters? and also will it decrease my cgpa considering aiml is hard and cgpa is important for masters?\n    └── Most of the courses are similar compared to CSE and you got to work hard to maintain a good GPA no matter which branch you in .\n        └── yes but I saw rowlet owl's post saying pes ec cse is better than rr aiml because of the masters thing. so I'm a lil confused\n            └── He was super against it (rightly so) before they made it include all core courses. He takes a much softer stance now (afaik, I spoke to him abt it) after the syllabus was released. Core is still better but by a small margin\n                └── oh that's reassuring thank you"
  ]
}