{
  "title": "Is there any difference between rr and ec",
  "content": "let be teaching,placements, degree(certification)  research facilities. tech clubs and all other academic oriented stuffs other than fests.\n\nMost important are the teachers bad in ec and better in rr?\n\n\n\n",
  "metadata": {
    "id": "1f5juob",
    "author": "[deleted]",
    "url": "https://www.reddit.com/r/PESU/comments/1f5juob/is_there_any_difference_between_rr_and_ec/",
    "permalink": "/r/PESU/comments/1f5juob/is_there_any_difference_between_rr_and_ec/",
    "score": 7,
    "upvote_ratio": 0.89,
    "created_utc": 1725098661.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "Please read the FAQs before posting duplicate questions\n└── sorry just wanted to know about the facilities, teachers and research clubs. Are they similar or rr is way better smh like that.",
    "Rr = ec in placements\n\nEc &gt; rr in quality of events\n\nRr &gt; ec in terms of infra\n\nRr = ec in terms of teaching coz both are shit (accnd to seniors) \n\nRr is more preferred by students than ec (coz of connectivity and some other subjective reasons)\n├── In a board outside pes placement office the placement stats for 2024 were like\nCse pes rr avg was 15lpa\nCse pes ec avg was 12lpa\nOverall was 13.8 lpa \n│   └── Did you take a pic?\n│       └── Yes how to add in comment\n│           ├── can you dm it to me too\n│           ├── can you dm it to me too ?\n│           └── You can't attach photos, dm me\n│               └── Dm me too\n├── I saw somewhere that rr has better placements stats than ec I think rr cse avg was 14.5L this year whereas ec cse avg was 12.8L maybe it's cuz the peer group is better at rr\n│   ├── it could be because of peer grp, considering cutoffs\n\nI'm asking about professors.\n│   └── Where did u find campus specific placement data bro, i struggled to find their overall placement data here lmao\n│       └── In pes campus outside placements office they had put in a board\n│           ├── Oh cool, do u mind sending me the pic?\n│           │   └── Forward it to me too bro\n│           └── Hey, can you dm me too?\n└── well what about teaching? like professors and facilities and research clubs\n    └── Seniors should answer or check the faqs\n        └── In colleges most of it is self study ig"
  ]
}