{
  "title": "Biggest blunder",
  "content": "I had 6.1k rank in pessat, and before counselling thought that I won’t get any seats (IT related), so took admission through management quota\n\nNow I see people getting cse (ai&amp;ml) in ecity in 7.5k rank 😭😭😭😭😭😭😭😭😭😭\n\nI literally don’t care about the campus but the amount difference is so much, I am literally regretting about not sitting in the counselling.\n\nLiterally couldn’t have known earlier if the cutoffs were going so down this year 😭",
  "metadata": {
    "id": "1f6zw2r",
    "author": "Sobo-prithvi",
    "url": "https://www.reddit.com/r/PESU/comments/1f6zw2r/biggest_blunder/",
    "permalink": "/r/PESU/comments/1f6zw2r/biggest_blunder/",
    "score": 42,
    "upvote_ratio": 0.92,
    "created_utc": 1725258151.0,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false
  },
  "comments": [
    "Yeah it’s a costly mistake \n\nBut you can’t change it anymore. Move on and like you said in the past, get a scholarship and get back your money\n\nAll the best\n└── Thank you, I’ll do everything to get that scholarship",
    "Lmao my rank was around 7k I got cse ai and ml ec campus. I thought the same too but I took the risk came for the 2nd round in hopes to get something so that I won't have to pay 50 lakhs for fking btech degree.",
    "So which clg did u take admission rr or ec ?\n└── ec campus (they were asking more for rr campus)\n    └── I thought it was the same. How much is it for both campuses?\n        └── I think they take 5-7 lacs more for the main campus (they’re were almost 50-100 people in waiting lists) only talking about cse core here,\n            └── More than what lol? I don't even know the base. Tell the values only\n                └── 12 lakhs/yr + 5-7 lakhs extra (I don’t know the correct value), also they take a lot of backdoor entries, more like political relations\n                    └── Damm wow",
    "I made the same mistake as you. I thought I wouldn’t get a seat with my CET rank and joined through comedk and people with even worse rank sat beside me. Still hurts 3 years after graduating but nothing can be done.",
    "Blunder indeed...there was no loss in going for the councelling...\nAnyways you can't change that so work hard in college",
    "I sat through counselling man. My rank is roughly &gt;4500 and I got a CSE(aiml) at ec(I specifically opted for aiml because I want to pursue masters in the same field later on) and one thing to note was a lot of people came in to alter their seats so the number of total seats stabilized until they reached 4000. \n\nIt's okay dude I was in mqt as well before switching over. Just put your head down and get to work on projects(I'm doing that rn). Hope to see you in campus!!\n\nCheers!!\n└── So did you got refund of your mqt seat yesterday itself ?\n    └── They said they will send a communication regarding the refund in the following weekdays",
    "😭 sad,go speak to them once",
    "Ye i feel u brother",
    "Call the college and ask them if it's possible to transfer to pessat seat. Afaik there were still aiml seats vacant\n└── Called them, they now are saying that now I can’t convert to pessat quota as I wasn’t in the counselling.\n\nThey probably gonna convert it to mq seats",
    "Loll u got fucked boii"
  ]
}