{
  "title": "A bit of a primer/ unofficial orientation for all those of you who are joining or considering joining PES",
  "content": "Hey, I'm a second year in the ECE branch at the RR campus. A friend of mine was scrolling through this subreddit in class and I got a bit curious and started reading some of the posts myself. It's quite saddening to see all the uncertainty and anxiety surrounding your futures, which is completely valid, and I'd like to help out a bit. I cannot cover everything but I want to try and soothe some of your fears.\n\nFirst off, I want to make it clear that my experience pre-college and during college might be a little different to yours. I was fortunate to not have to go through all the JEE and coaching hell that most of you did, I did not have any academic pressure so while I empathize, I'm not completely in the same boat. That being said, I hope to give you some fresh perspectives about college, which seems to be lacking in this community as most of them are mostly grade/placement oriented (which is a good thing mostly, that's what most of you care about).\n\nFor those of you who are worried about getting good grades and eventually a good job, you already sort of know the drill by now and are probably just asking questions to confirm your anxiety about all this. Studying consistently and getting good grades WILL help your chances, you know this already, so that's not what I'm going to tell you. \n\nWhat I do want to tell you is how to try and get the most out of these four years, which I see so many people unfortunately struggling with. Starting with the obvious, PES is a little different from school. You are thrown into a fairly large mixer of people your age, all from vastly different backgrounds and that is shuffled for two consecutive semesters. Some of you might have trouble making friends or have social anxiety in general, well there's some good news. The first few weeks/months is essentially a playground for you to get good at this. You're going to be surrounded by people and all of them are going to be trying to make friends too, so if you feel a little left out or alone, don't worry, everyone's just putting on an act. \n\nEven if you don't manage to do that, like I said, the sections shuffle around and you'll be dropped into a new pool of people again, it's okay.  I'm emphasizing this because I didn't realise how alienating a college environment can be. It isn't as easygoing as school where you're so familiar with everything and everyone. You need to TRY. It's true what they say about it getting harder to make close friends as you grow older, so if you're still in touch with all your school friends, please remain so, it's probably the best decision I made by far.\n\nComing to the academics, look man people give you varying answers for this but here's my two cents. If you're used to academic structure (coaching, JEE grind, a strict school etc etc), pes shouldn't be too much of a culture shock for you. People constantly told me first year was pretty easy, but what I forgot to factor in was that these were people who stayed on top of everything.  Most people here are used to this structure and hence do pretty well academically. But if you're anything like me, do not take it lightly, you will have to put in effort every step of the way. I slightly screwed my first year by fucking around and taking college lightly. It's not the end of the world and I don't really regret it, but it would be nice to have a better grade so there's that.\n\nThe resources here are pretty good, compared to what you get in other colleges in Bangalore. The online portal (pesuacademy) is going to become your best buddy and is what you'll primarily be using for all your exam prep. If you're more of a textbook kinda person, the library usually has multiple copies of the same book so they've got you covered on that front.\n\nThe teachers are a mixed bag, I had some great teachers and some really bad ones in my first year and you probably will too. But you're at the age where you should start becoming a little more self reliant, teachers shouldn't be your only resource for learning. I encourage you to take learning into your own hands, and even though you might only be here because your parents asked you to, try and find something about your degree that interests you.  (Sidenote: Yes keeping your cgpa above 7.75 is the benchmark, if you've done that and the other \"recommend\" stuff like projects and internships, you're more likely than not to get placed, don't worry too much)\n\nOn to the extracurriculars, if you really care about this, then PES really isn't the place for you. Whether it be sport, music, any other performing arts, club's, social activities. Pretty much everything is lacking here. If you come from a somewhat restrictive environment, then this will be nice for you. But if you already dabble in stuff like this then it's not going to be very fun. All the events are student organized, and the management is so stingy about things like attendance, budget, timing and approval that everything that gets done is shoddily produced.\n\n\n The quality of most events is poor, which is very sad because the students do the best they can with the time and resources that they're given, not to mention most clubs being inactive. The fest is a two day affair. The first day is all student organized events so again, it's not going to be much. But hey, it's a day off on campus with your friends where things are constantly happening so its still something to look forward to! The second day they shove you into a field and make you overpay for tickets. The main night is essentially just a PR stunt for college, but it's still fun with the right people. (Another sidenote, if you're coming to Bangalore for the first time, we have tons and tons and tons of great stuff you can do outside of college, make friends with the locals!)\n\nOk this turned into a bit of a ramble but essentially: You can completely start fresh in college, do whatever you want, even though I told you about the state of clubs and events, I encourage you to join them and see for yourself. Who knows! You might end up enjoying it thoroughly and meeting fun new people. Even if the college itself might not make it too enjoyable, you DO have a degree of autonomy over what you can do here. Try new stuff and please don't get bogged down with academics, you've done it for so long, and you finally have a chance to explore other interests of yours. Pick up all the hobbies that 11th and 12th killed, pick up new ones, make new friends, get your first heartbreak, give the VC a wedgie, do whatever!  You have somewhat of a fresh start, and you'll have plenty of time to worry about your grades, for now just take in this brand new experience, it'll all pass very quickly.",
  "metadata": {
    "id": "1f9ogi6",
    "author": "Legal-Intern-5013",
    "url": "https://www.reddit.com/r/PESU/comments/1f9ogi6/a_bit_of_a_primer_unofficial_orientation_for_all/",
    "permalink": "/r/PESU/comments/1f9ogi6/a_bit_of_a_primer_unofficial_orientation_for_all/",
    "score": 116,
    "upvote_ratio": 0.98,
    "created_utc": 1725548210.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "Well that actually helped a lot, thanks man, really appreciate you taking out the time for this",
    "I didn't go to any coaching centre or anything either, guess I'll have to up my game in the upcoming months...\n└── How did u crack pessat or kcet then?\n    └── Studied for PESSAT by myself\n        └── Cool",
    "well written",
    "Is there a music club at ec? I'm a fresher at ecity and thinking of maybe joining one to learn and instrument\n└── U can join clubs for learning?..or u have to join a club in which u already have knowledge of it?\n    ├── For the music club auditions, you do need to know an instrument or know how to sing. But you can apply to other domains that they have (graphic design, etc etc)\n    │   └── Thanks for the info\n    └── Same que\n        └── 🥲I dunno anything properly",
    "Mods can we have this pinned. This is a masterpiece.",
    "Thanks so much man ,eased my nerves a little \nCould I dm you for some info?\n└── Yeah sure",
    "\n&gt;On to the extracurriculars, if you really care about this, then PES really isn't the place for you.\n\nHow reasonable / doable is it to leverage Bangalore and it's events for this? For example, joining a music or dance class on 1-2 days a week?\n└── There are tons of options, the feasibility is down to your commute/schedule."
  ]
}