{
  "title": "Deviation Weightage ",
  "content": "Is it followed as said in orientation?\n1. Do they actually check our FKING LAPTOPS? \n2. If they check our mobiles up to what extent are the applications allowed? Like games, netflix, etc. \nAny information is appreciated. Thank you",
  "metadata": {
    "id": "1fcr4t1",
    "author": "AimWTF",
    "url": "https://www.reddit.com/r/PESU/comments/1fcr4t1/deviation_weightage/",
    "permalink": "/r/PESU/comments/1fcr4t1/deviation_weightage/",
    "score": 16,
    "upvote_ratio": 1.0,
    "created_utc": 1725893038.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "Lmao they ain't checking anything except cigarettes, drugs  and alcohol .",
    "Calmly politely and nicely ask them to fuck right off if they invade your privacy",
    "1. They do. To check if you are doing what you are told.\n2. They won’t. But try not to make it too obvious when you are using your phone.\n\nPro tip: open your laptop, open the corresponding notes to the particular class and use u r phone pressed against your screen.\n\n![gif](giphy|xUPOqo6E1XvWXwlCyQ|downsized)\n└── He meant in hostel lmao",
    "Yo chilll\nThat old blad guy is barely here, comes once in a month.\nOther than cigarettes and drugs they don't check for anything else.If found with ciggs they'll call ur parents and inform them and warn you.\nIf you repeatedly get caught with ciggs they'll (at max) remove you from hostel\n└── Okay. Thanks a lot!",
    "what's deviation weightage\n└── A point system adopted my PESU Hostel. If u aquire 100 points then u are \"kicked out\" of the hostel.\n    ├── and doing what exactly gets you kicked out 🤡\n    │   └── There's a set of rules which we have to abide. For example if we don't clean \"our\" room we get like 20 deviation Weightage 🤡 idk the exact number\n    │       ├── 20 for that only? lmao kicked out in a week\n    │       ├── Never seen them do this btw\n    │       └── wtf nah bro stop gaslighting\n    └── from when did this happen?",
    "Btw maybe idk much in a first year but so far, \nDon't make a ton on noise if your room is near office.(Debatable I scream like a motherfucker to duck with the authorities)\nThey don't check laptops, but sometimes they come to check cupboards.\nSome of my friends here smoke and drink, and so far as long as it doesn't take place inside the hostel , no one says anything. Just make sure to not smell like cigs or alcohol and don't be obvious.\n(V importantly don't bring that shit in your room at the least, so you can pin blame on other 🤪)\n└── Alright, thanks",
    "Same doubt😥",
    "hostel is fake bruh chill",
    "Don't do alcohol and weed and you'll be all good\n└── Bet\n    └── Bruh they tell all that shit to scare you guys so chill out\n        ├── bro u dont get it .. they gave a whole rule book ... i was scared asf\n        │   ├── Even I was scared at first but eventually got bored lol\n        │   │   └── Ohh\n        │   └── It's all bullshit da so chill out\n        │       └── thanks man :)\n        ├── and the briefing session was 2.5 hrs just explaining abt the hostel rules and some other stuff\n        └── they gave a hole speech so thought theyll be serious\n            └── As I said earlier just don't do alcohol and drugs and you'll be fine , for us in ecc atleast only the 1st 2 or 3 days the security guard used to come to rounds and shit , after than he stooed even bothering abt it",
    "Deviation points is bs , people get caught with alcohol/cigarettes etc and after a day everything's fine . Regarding weed it's a risky zone as police might be called . However,some people were lucky to get away with that but don't assume it to be the norm\n└── Okay thanks!"
  ]
}