{
  "title": "Kcet Procedure ",
  "content": "This post contains a detailed explanation of admission through kcet. I will talk mainly about PU Board students and will include extra information for Cbse fellas when needed(idk about icse).\nNote that this information is based upon the procedure I followed for the admission in the year 2024.\n\nFirst round:\nAfter getting seat alloted in PESU (Any campus) through KCET Counselling and opting Choice 1 (refer kea website for in detail information about Choices). \n1. Paying fees to kea: For payment through online, u can use netbanking or other online payment services. \nFor payment through offline, download the chalan from the website. Print it and take it to your bank branch. There u have to either pay it through RTGS/NEFT. After finishing the payment the bank will give u two copies, one would be student copy and another would be college copy, retaining the bank copy with themselves. \nI insist on taking the xerox of the copies after the payment. \nAfter the payment is verified u will get your admission order.\n2. Preparing documents: \nMake a set of original copies of the following documents:\n   1. 12th Marks Card\n   2. 10th Marks Card\n   3. Fee receipt provided by the bank\n   4. Admission order (preferably a colour      print)\n   5. Income caste certificate (if applicable)\n   6. 3 Passport size and 3 stamp size photos\nNote that these original documents will be taken by the college and will be returned after a year. \nMaking photo copies of all your documents is highly recommended, Even for applying for a loan. \n3. Reporting to the college: Congrats 90% of the work is done. Now report to the college before the deadline and go to the main building (Golden jubilee building) after going there, the student has to go alone to a room full of computers and create his own account on his own. (I recommend you to have knowledge about your parent's profession, income, your 10th,12th marks, CET Marks and rank and CET application number. Yes you will be allowed to refer to documents). \nAfter the registration you are told to go to cet admission counter where u have to submit your original documents and photos. \nAfter that you will be given an acknowledgement which should be showed to a person providing the joining kit. A TC Requisition letter will be given to you which u have to fill and get it stamped from the person who took your documents. After getting the joining kit, Congratulations you are now a part of PES University. \n(making a few photocopies of the acknowledgement)\n\nAfter this go to ur PU College and take the TC Requisition form, 100 rupees and 12,11 marks card with you. Submit those documents to the office and tell them to send over the TC to the address provided in the TC requisition letter. They will give you an acknowledgement stating that u have submitted the TC Requisition letter. \n\nAdmission through round 2,3 will be very similar. \nAfter the admission, log onto your Kcet counseling account and report there whether u got the admission or no, whether the college asked you to pay extra money for the admission. After submitting the report, the part of Kea is now officially over! \n\nAdmission into hostel. (Information only for PESU Boys hostel is available) \nThis can be done only after you have gotten the acknowledgement of ur admittance. \nReport to the hostel and then write your acknowledgement number, name, phone number. Asking them the prices for the hostel rooms. After this u can go back to your home. And NO the warden doesn't cooperate and will not let u get your admission immediately nor will he tell u the exact date u have to come back. You will later get a phone call from the hostel telling you to report to the hostel on a certain date (this call comes usually after 2 days).\n\nDocuments required: (All are photo copies) \n1. Admission acknowledgement. \n2. KCET Fee receipt. \n3. A character certificate from your college with stamp or sign of the principal of the college. It should preferably contain statements like: The student had a good behavior, Was not part of any sort of ragging, etc. Even a Photocopy of your TC works, note that it should have the statements provided above. \n4. Affidavits, 2 to be exact. Bonds worth rupees 20 or more are to be taken and the matter provided by the hostel should be printed on it. \nIn the first affidavit the Student will be the first party. \nAnd in the second affidavit the parent will be the first party. \nPESU Boys Hostel will be the second party in both the affidavits. (original copies of these affidavits must be submitted to the hostel) \n\n\nReporting to the Hostel for orientation:\nReport on the day of orientation (they will tell u to come at 7:30 in the morn but u can come till 10) After reporting you will have to register with your name, father's name and LG'S name (if u are not from bangalore) \nAfter this you will be given a token and told to go to an auditorium where an uncle will come and tell you things which your parents have been telling you for your whole life in 2.5 hours. \nAfter the orientation you will be given an application form for rupees 100. Fill this form and take a payment details slip from the hostel staff and fill the information in that. \n(U have two options, payment through dd or payment through rtgs/neft) \nMake a bunch of the documents mentioned above, application form and payment slip. And give it to the person who is incharge of documents collection. \nAfter submitting this u are officially part of PESU Boys hostel. \nAn acknowledgement will be given and further details will be given to you. \n\nIf theres any misinformation or anything to be added/corrected, feel free to reach out.\nHope this helps! \n(My English is not so very good so thank you for baring with it). \n\n\n",
  "metadata": {
    "id": "1fevmn0",
    "author": "AimWTF",
    "url": "https://www.reddit.com/r/PESU/comments/1fevmn0/kcet_procedure/",
    "permalink": "/r/PESU/comments/1fevmn0/kcet_procedure/",
    "score": 21,
    "upvote_ratio": 0.94,
    "created_utc": 1726121063.0,
    "flair": "PESSAT/Admission",
    "nsfw": false
  },
  "comments": [
    "I have taken admission through KCET and everything OP mentioned is quite accurate\n\nfor E-City people you'll have to report to the engineering building itself\n\nafter making your PES account and submitting your original documents, you'll have to go to room 107 i believe where the admission manager guy is (a guy with a moustache) and he'll give you the acknowledgement and he'll also guide you to the next room where a guy will ask you for your tshirt size and give you the starter kit\n└── Bro what about the allotment of rooms in hostel especially in e city can you choose by yourself or they will let you know which room is alloted to you?\n    └── I'm not sure about the hostel, sorry bro",
    "U forgot one thing,  u need to report to the kea online after ur done with the admission , u need to go to the cpaic portal and click on college report and then click on the date on which u report along with the details of whether any extra fees was taken from u ,\n├── Ohh right, my bad. Mind if I add this information now?\n│   └── 👍 anything is fine\n└── I forgot to report to kea fuck. I got admitted on 6th. Can I do it now pls help I don't want to lose seat\n    └── see if u live blr then run to kea , see i don't know how severe its to not report , it may just be like a feedback thing or it may actually be a quite serious action which is mandatory to be done , so u have to ask the kea officials about it bro , i wish u all the best\n        └── I do live in blore but malleshwaram is very far away. Shit da why won't they pickup the damn call or respond to my email.\nCollege PPL also won't pickup wtf do I do\n            └── Be calm and dont panick",
    "What all stuff do you get in the joining kit??\n└── Horrendous looking backpack, bottle, tshirt\n    └── Oooohhh, is it some good bottle or trash?\n        └── It's meh, looks alright but isn't very sturdy. Will get a dent if it falls from the table.",
    "Could u elaborate on going back to pu college and giving a letter part.....I got myself admitted thru cet but didn't do that step\n└── Yeah, I've updated the post. Please check.",
    "What all ll be included the joining kit?\n└── A T shirt, bottle and a bag with PESU Branding\n    └──  Oh nice",
    "What amount do we have to pay in bank\n└── It will be specified on the chalan for this year it's something like 107000 ig. Not sure though",
    "what about parents??? should both parents come to the college or only father is fine?\n└── Anyone is fine"
  ]
}