{
  "title": "Scholarship refund",
  "content": "Can any second year student share the details of scholarship you got as a PESSAT student like how much you paid in 2023 and how much you got refund",
  "metadata": {
    "id": "1fexfxx",
    "author": "Working-Bank4419",
    "url": "https://www.reddit.com/r/PESU/comments/1fexfxx/scholarship_refund/",
    "permalink": "/r/PESU/comments/1fexfxx/scholarship_refund/",
    "score": 6,
    "upvote_ratio": 1.0,
    "created_utc": 1726129055.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "You get either 20 or 25 percent of whatever you paid. No deductions\n└── We paid 400000 as tution fee and 480000 as total fee including exam fees library fee other fees etc. Do we get refund acc to 400000 or 480000\n    ├── 48\n    │   └── no\n    │       └── What do you mean \"no\" lol.\n\nThey changed the amount from last year onwards. Now they give a percentage of the total fee paid\n    │           └── where did you source this info from, can you send link.? Coz honestly the only data i found about the scholarship was that video. Thanks\n    │               └── The source is myself. Our fee is 4.1L of which 3.6 is tuition.\n\nOur first year we got 72,90k for the scholarships\n\nSecond year we got 82, 1.025L respectively. \n\nA senior I know also had that increase and Kcet people did as well.\n    │                   ├── Ohh okay, thanks!\n    │                   └── Btw I wanted to ask, How easy/hard is it to get the scholarship?\n\nIs it easy if you study regularly, or does it depend mostly on the type of competition in our batch?\n    │                       └── Two weeks before the exam. One to skim through everything, and the other to properly study. One subject a day, weekends i don't study. \n\n\nFor esas 3 or 4. \n\nBut everyone is different, nothing wrong with trying harder for the first exam. And seeing how difficult they are. You can plan for the future based on that.\n\nBut they're nowhere near jee, think of them as 10th board level\n\nAnd getting the scholarships isn't that hard if you care about it. There are many morons/people who don't care. If they all cared it would be much harder\n    │                           └── Oh that is kinda a relief to hear thanks a lot!\n    └── only for 400000, i had the same doubt and i watched a video about it which pes had posted on yt"
  ]
}