{
  "title": "a sad tale",
  "content": "introverted. shy. lonely this was everything i was, this was everything she wasn’t. my gaze met hers and the stars aligned, a universal event that would put even the gods to shame. water slid off my cheeks, this time it wasn’t the tears that i always shed, it was the rain, a walk in the rain with her that filled my heart to the point of spillage, she poured everything i didn’t possess into me but alas, even alexander fell to his knees, who am i to deserve something astronomical. a mere lover in the midst of this bustling college, a mere romantic in this world full of romeos, a mere nobody in this universe. all i ask for is guidance now.",
  "metadata": {
    "id": "1fgtp99",
    "author": "lonelybug99",
    "url": "https://www.reddit.com/r/PESU/comments/1fgtp99/a_sad_tale/",
    "permalink": "/r/PESU/comments/1fgtp99/a_sad_tale/",
    "score": 49,
    "upvote_ratio": 0.85,
    "created_utc": 1726341602.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "Just leave social media for a while and focus on work and see the results don't fall for mere distractions",
    "I wish i had a heart to understand this.",
    "Romanticizing loneliness is my only coping mechanism too man. Works like a charm every time\n└── Underrated",
    "Dont worry, pes will prepare u for the worst, so u will feel that it was nothing afterall &lt;3",
    "Bro shaked my spears",
    "Bluds down bad\n└── i asked for advice not hate comments 🙃",
    "bro u shld write",
    "Ball up top dawg",
    "I don't have anything to say here, nonetheless upvoted this masterpiece",
    "Shit happens, move on bro.\nTry reaching out to other dating related subs.\n└── i'm way too shy for that, what we had was something i can never find on dating apps. anyway i can get her back?\n    └── Dm me if possible\n        └── hehe, it's fine, not much to do now i guess 🙃",
    "u/lonelybug99 i think its time for pattangere shed.",
    "To kya mai nachu\n└── advice dedo thoda!",
    "Do you read?",
    "Tf is this cheeseball",
    "Don't worry you will get her",
    "Arts kyu nahi liya itna bootiful poetrie"
  ]
}