{
  "title": "Pes aiml admission doubts ",
  "content": "Hey , I had got pes aiml in kcet round 2 , how is it being an aiml student? , and is it similar to cse for some extent? .. I am not an extraordinary minded in maths but kinda above average or can be said good in some concepts... , will it be tough for me to handle the maths given In the course?? I had got 90 percentile in maths in nee mains and state board I got 96 marks, is it gonna be tough for me?? ",
  "metadata": {
    "id": "1fkoys2",
    "author": "Living-Cheesecake576",
    "url": "https://www.reddit.com/r/PESU/comments/1fkoys2/pes_aiml_admission_doubts/",
    "permalink": "/r/PESU/comments/1fkoys2/pes_aiml_admission_doubts/",
    "score": 7,
    "upvote_ratio": 0.77,
    "created_utc": 1726763079.0,
    "flair": "PESSAT/Admission",
    "nsfw": false
  },
  "comments": [
    "pes aiml is pretty much same as cse you even have almost the same amount of liberty in picking electives as core students (it used to be a con before) after the recent changes.\n├── Then what's the difference?\n│   └── nothing,way of increasing cs seats\n└── so how much percent of cse core is same as aiml  , like approx , and are pes papers hard to get a cgpa above 8??\n    └── With the current revision in coursework, only your electives will differ (and if you choose to take electives from AIML - you can take them from CS too now). You totally need to take 4 electives, so that's 4*4 credits each / 160 credits so roughly 10%. \n\nGetting &gt;8 CGPA isn't \"tough\" but you're not going to get it without at least the minimum preparation.\n        ├── According to the revised syllabus,cse(aiml) has the same syllabus as core Cse in 2nd,andd 3rd year,and even in 3rd year ,cse(aiml) students can take the exact same electives as cse students,if they take cybersec for example.What I mean to say is that its not completely fixed that we need to take atleast 1 aiml elective. Do you think the degree would still be an issue while applying for masters in Cs abroad?\n        │   ├── ok now i understand , that its just cse which has a name cse(aiml) , both cse and aiml students have same subjects taught till end of 3rd year\n        │   ├── btw now u are which year and how has been the placemnts for aiml students this year\n        │   └── what about the math , thats what i struggle in , i heard ther eis lot of math in aiml  , if cse and aiml are almost same they maths should be lesser because cse has lesser math than aiml actual course right\n        └── i didnt understand ur first paragraph because im a fresher , and i guess u are saying that aiml and cse core are same by 10 percent and remaining 90 percent aiml is different that cse",
    "It's the same as cse untill 2nd year. From there on you'll have different electives thats all , core subjects are still gonna be the same for you all."
  ]
}