{
  "title": "How does PESU manage to be a top 3 engineering college in Karnataka despite so many cons?",
  "content": "I read from the pinned comments and I seem there are more cons than pros with lots of restrictions but still PES is actually a #1 priority for engineering colleges. What makes it so special? ",
  "metadata": {
    "id": "1fkoyex",
    "author": "Relative-Strike340",
    "url": "https://www.reddit.com/r/PESU/comments/1fkoyex/how_does_pesu_manage_to_be_a_top_3_engineering/",
    "permalink": "/r/PESU/comments/1fkoyex/how_does_pesu_manage_to_be_a_top_3_engineering/",
    "score": 19,
    "upvote_ratio": 0.83,
    "created_utc": 1726763051.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "As Jawahar once said \"Why Bangalore doesn't have an IIT? Because it has PES\"\n├── 🤯\n└── 😅",
    "Doraswami",
    "PLACEMENTS\n├── Biggest nd only pro\n└── I've heard that there are restrictions to view certain education sites. Also the professors are pretty bad. Plus too many ISAs. How do they still get such great placements?\n    ├── Because the crowd is amazing.\n    └── They reduced the no of isa's from last year.  Now it's just 2 isa's per sem",
    "😂😂When you can't trust the National Rankings by the govt who is trusting the rankings of any local paper or agency which you can easily buy you way in.\n Number. 3, okay \n\nNIT Suratkal, IISc Bangalore or IIIT Bangalore. Forget about dozens of others in Bangalore than can give a run for money which one of the three is worse than PES.\n\nPES is a great college, as an alum I can tell you the crowd you get there is amazing to learn and interact with. Surely it's one of the top colleges that may be in the top 10. The top 3 isn't in the stars (yet).\n└── Top 5          Nitk Iiitb IIT dharwad Rvce Pesu Mit manipal Bmsce Msrit Iiit dharwad Iiit raichur\n    └── They are all good colleges, among the top. I don't have enough knowledge and real parameters to actually rank them. 🫣",
    "Firstly I don't think its top 3 in Karnataka. (IISC if you count it, IIITB, NITK, RVCE and maybe IIT Dharwad - not necessarily in that order)  \nSecondly a lot of people judge college based on placements.\n├── Nitk\nIiitb\nIIT dharwad \nRvce \nPesu\nMit manipal\nBmsce\nMsrit\nIiit dharwad\nIiit raichur\n│   └── Exact order..\n│       └── Are other kcet colleges like dsce better than iiit raichur and dharwad\n│           └── I'd say the top 3 kcet are better than iiits of ktaka.. You can check their placements only 30-40 percent are placed in these clgs and fee factor iiits have a fee of 15-16l and cet is 5l\n│               └── Yeah but they might improve in future\n│                   └── Can't reach the level of the top 3 tho.\n│                       └── its funding and all would be high and even the location is decent. It has some tie up with iit hyderabad so definitely it wont remain same. They got their own campuses so they will definitely improve.\n│                           └── &gt;It has some tie up with iit hyderabad\n\nIt stopped da from this year.. \n\nIiit dh/raichur isn't even established like rv/pes/rit/bms, it'll take some 10-15 yrs to reach the level of the top 4 kcet clgs\n│                               └── oh sad but still betterthan dsce,bmsit and all\n├── U can add mit manipal\n│   ├── Debatable pes through cet is cheap asf and manipal is so expensive and the placements are same tbh\n\nSo if I had a chance, id have chosen pes over manipal if through cet, but if through pessat id have chosen manipal coz a better clg life same fee and same placements\n│   │   └── U can also bet on intake\n│   │       └── 73.5 percent placed last year, wt else would you expect? This is only without ppos if you also include ppos  more than 78-79 percent which is same as rvce\n│   │           └── We can consider all three equally if fee is not main concern!!\n│   │               └── Nah da fee is actually a concern.. Only a few percentage of the people can afford a clg with a fee of more than 25l..\n\nOr else why would pessat cutoff go for 7k for ecc aiml.. 7k in pessat is easy asf, you don't need to study only tbh\n│   │                   ├── True agree!! Even I dropped mit mechatronics for fee!\n│   │                   ├── Yeah\n│   │                   └── Yeah\n│   └── Oh yeah I forgot, thats a little debatable/subjective but I personally agree\n└── Why downvote..? Im not hating on PES in any way. I respect all institutes. I have quite a few friends in PES. Just having a discussion.",
    "PESU is not in top 3 engineering but it is the top and best engineering college. \n\n1. 600+ students are getting 12 LPA + package  \n2. Latest syllabus par with IIT better than NIT  \n3. Exam pattern is so great student will learn most of the latest trend  \n4. Very transparent recruiting process  \n5. PESU Management has great vision, strategy and thought process\n└── I forgot one point to add here. In IIT  / NIT branch wise intake is around 60 or max by 100. In PES top 60 median salary is around 30LPA. It is far better than many IIT or NIT\n    ├── Dude who tf told u median salary is 30LPA? 😭\n    │   ├── Yo median of top 60, which means more than 30 people get 30 lpa he's saying which is a bad comparison tho😭\n    │   └── I am telling median of Top 60 students\n    └── That's not really a fair comparison. Thats like saying VIT Vellore is a better college than NITK Surathkal just because VIT had a higher \"highest package\" (2022-23 data)\n\nThis is meaningless in my opinion.\n        └── Minimum sample size in statistics is 30. IIT CSE n Core branch and TOP NIT CSE is far better. But as a private college is able to provide 30 LPA to his top 30 students, it is not bad. It is very good. Regarding comparison you can compare any NIT / IIT all students of their branch (Might be 60 or 100) with top 60 / 100 students of PES.  They have brand / tag, Govt funding, all top students but still some students are unplaced. In PES, you do not get IIT / NIT, but still there is a chance you can get into similar company at the end of the day. Then why company choose PES? There is something. Think twice. There is 8000 students unplaced in IIT, Here PES is proving 500 students to 12+LPA. Why? Why the leadership team of top companies are choosing PES?\n            └── I am in no way saying PES is bad. I just don't agree that it is far better than many iit or nit. Sure lower nits/iits maybe but the way you said it and with respect to iiitb especially. Id much rather be in a college where top 50% of students get 30+ lpa than where 2% of students get over 30+ lpa. You are just comparing top 30 out of thousand(s) to top 30 out of 120 but thats the whole point, having less students (to an extent) is better due to many aspects. Peer group and exposure also play a role. I get your point that if you are in the top in PES you can get great opportunities and I agree, it doesn't mean its suddenly better than a college where MOST students get those opportunities rather than only the best ones. And im not speaking about lower branches in lower iits etc. Mainly speaking wrt to cse. I would also pick PES cse over lower NITS cse but im from bangalore so might be a little biased towards pes idk.\n                └── Agree. My only conclusion is like other private colleges, PES is not focusing much on money. Same time PES management are working hard to see the institute at top. If in our country, in our state, in our city, an organization is trying to success, we should also support, encourage and highlight.",
    "What about UVCE Bangalore?, where does it stand in the top 10. What about its 1st IIT Model Tag? Kindly reply as I've got CSE there and I'm already in VIT Chennai.\n└── I'm pretty sure in KCET colleges, it would be in 6th place. They have good placements but infrastructure is bad and teachers don't come regularly.",
    "It's not at all top 3 at most it's top 10 people forgetting iiitb, iit Dharwad, iisc, Manipal and other clgs in bangalore\n└── We can consider it as top 6 or 7!!"
  ]
}