{
  "title": "Kcet round 3 doubts.",
  "content": "If I lock the seat and go to the second round extended what are all the stuff I'll be missing out. I hope I don't miss out alot especially the syallabus and tests. Btw I am already cooked as I got into mech cuz I fucked up my option entry. But I am ready to study anything. HELP 😭.",
  "metadata": {
    "id": "1fn9cvx",
    "author": "dumbguy044",
    "url": "https://www.reddit.com/r/PESU/comments/1fn9cvx/kcet_round_3_doubts/",
    "permalink": "/r/PESU/comments/1fn9cvx/kcet_round_3_doubts/",
    "score": 8,
    "upvote_ratio": 0.9,
    "created_utc": 1727055713.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "I think they said that they'll take extra classes for round 3 students to ensure tests will happen at the same time.\n├── You sure about this??\n│   ├── Yup, you'll have classes till 4:00 everyday to catch up with the others. I know coz I joined in round 3 too\n│   └── Yes\n└── https://www.reddit.com/r/kcet/s/4S2tZwDLjU help\n    └── About the comment on 2nd ext or college selection?\n        └── About the college selection\n            └── Pes usually does well in cs related branches.But I have been advised against ece in pes cuz of its placement records, moreover ece is a tough branch and on top of that pes is academically rigorous. Since u have interest in it field, ull end up having to compete with 2000 (cs+cs aiml) students if u wish for a it related job. Idk about robotics with ai, but it'll probably be something similar to cs. Also bit is not a hectic college either so ull probably get time for studying. But again ull probably not get the same type of campus placement like pes. So it comes down to ur personal choices\n                └── Hmm , thanks for input , I'll consider it",
    "You won't miss a lot stuff but for 1sem it will be faster than bullet train\n└── https://www.reddit.com/r/kcet/s/4S2tZwDLjU help",
    "When will we join in ( idts we will miss \"so much \" ) \nIt's just a matter of 1-2 weeks late\n├── Nah! But imagine joining the clg and the next day you got a test. In that 1-2 weeks they'll conduct classes and I am sure they'll also conduct some kind of tests after that.\n│   ├── It's better than sacrificing the course for 4 yrs 💀\n│   │   └── 🫣 that's true. 4y &gt;&gt; 40d\n│   └── Class tests you mean ? 😂\n│       └── I thought those were called internals and had major value during the finals.\n│           └── Hmm 🫠 not sure fk this shit I missed round 2 cut off by 84 rank 🥹\n│               └── Which clg/course did you get?\n│                   └── Pes ec aiml 🫠\n└── https://www.reddit.com/r/kcet/s/4S2tZwDLjU help"
  ]
}