{
  "title": "CR",
  "content": "would it be a wise decision to become CR in the first year? Is it gonna be too hectic?",
  "metadata": {
    "id": "1fnfgdp",
    "author": "Bitter_Front226",
    "url": "https://www.reddit.com/r/PESU/comments/1fnfgdp/cr/",
    "permalink": "/r/PESU/comments/1fnfgdp/cr/",
    "score": 12,
    "upvote_ratio": 0.81,
    "created_utc": 1727079355.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "It will be hectic. But if you have good leadership qualities and are willing to take up more work, then you can apply.\n├── Can you justify why it will be hectic?\n├── BRO I VOLUNTARILY TOOK CR ROLE, though i am an extrovert and like to do host stuff so in my brain being a CR was justified.\n├── Will being CR somehow be useful for placement?\n│   └── Obviously not. It's just timepass.\n│       └── It's actually a waste of time cause you'll be called for CR meetings and what not during the semester after classes end for the day.\n│           └── and how often would that be?\n└── Lmfao you write way too good",
    "Please don't become CR u will regret it later\n└── Oh okayy",
    "I'd rather do ddco problems than be cr\n└── Lmaoo",
    "I'm out of the loop, whats cr\n└── late sparkle marvelous afterthought sophisticated tart reply start frame melodic\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
    "Why tho\n└── Wdym",
    "No fam, I was the CR lf my class in sem 1 and 2, there's no additional work AT ALL. You'll have to attend a few class committee meetings with the HoD and maybe talk to a few teachers now and then if there are problems with portions and stuff. Nothing that you can't handle. But it also makes it so that everyone in the class knows your name when not everyone knows each other. Might be a good thing for you. You should go for it\n└── Bro could you please help me, check dm",
    "Become a cr bro trust me a very good choice you won't regret it, hell I'll help you out if you have doubts about anything.",
    "For me becoming the CR was single handedly one of the best things I did. \nCuz now I don't need an excuse to talk to someone, I can always talk without a reason, it was a big thing for me, cuz I always shyed away from taking initiative in talking.\n\nThis greatly framed my personality and later on helped a lot in networking in general.\n\nI would suggest you to go for it. Not much of additional workload. It's chill and ez. \nAlso depends what are your definitions of chill and ez, yet 10/10 recommended",
    "As a cr, you will have to talk to all your classmates, or even they have to come and talk to you.\n\n- So especially if you are an introvert and want to talk to people, make friends, this is a good opportunity.\n- Also you'll be known and remembered by the teachers.\n\nPersonally speaking I was a cr for 4 sems and I was able to achieve the above 2 goals."
  ]
}