{
  "title": "Opinion on pesu io ",
  "content": "Title. Is it worth it? Do we learn anything useful ?",
  "metadata": {
    "id": "1fp1pzk",
    "author": "Ok_Plum6388",
    "url": "https://www.reddit.com/r/PESU/comments/1fp1pzk/opinion_on_pesu_io/",
    "permalink": "/r/PESU/comments/1fp1pzk/opinion_on_pesu_io/",
    "score": 21,
    "upvote_ratio": 0.9,
    "created_utc": 1727262270.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "This place doesn't have the charm anymore. The credits to this can be wholeheartedly given to the SHITTY and EGOISTIC team behind this place. Neither the students nor the SMEs are treated well. The SMEs are treated like slaves, by forcing them to come for shoots multiple times, and irritating them for petty reasons etc.\n\nThe courses are too overpriced, and a student can learn way more from the internet themselves. The SMEs are not up to the mark too. (The process to select them hasn't been fair too, too many discrepancies and favourism atp)\n\nThey don't treat their management team like humans. They are abused and made to slog for some petty work. The nice and hard-working people who worked for them were abused and made to leave (later labelled that they were \"kicked\"), so that their friends can take over and join the team, and do whatever they wish! \n\nA good initiative ruined by cheap-minded students!\n└── OverPRICED? They started selling these courses now? That’s just evil, using students’ courses to make a cheap profit.\n    └── yea, from 500 -&gt; 800 -&gt; 1000 now, its too expensive :(",
    "I took my PESU IO course way back in 2019. I would suggest you to take a paid course online (if you’re hell bent on learning something and want to pay for it ). It encourages students to teach, but it often (not always) happens that the expectation and reality are of such courses are quite different from a learners perspective.",
    "Areeeeyyy this pesu io is a TOTAL SCAM. They will first take 1000 rupees and later won't give you certificates properly. So much bias and bs. They flex on their website that top scorers get distinction certificates, but NO ONE HAS RECEIVED THAT TILL DATE. When we asked about this to the team, THEY GHOSTED US COMPLETELY. \n\nSUCH AN UNPROFESSIONAL MANAGEMENT TEAM FFS. It has also come to notice that they don't pay their SMEs and insult them a lot. All mediocre to trash courses and you can learn way more from youtube yourselves. \n\nEC CAMPUS BEING THE WORST. ONE DISGUSTING TEAM THEY HAVE. SUCH WEIRD PEOPLE THEY HAVE, NA KOI TAMEEZ NA KUCH. \n\nTHE WORST EXPERIENCE ANYONE CAN HAVE!!!!!!",
    "Thanks for the inputs!",
    "IMO the fee for the course is way too much! While it can be fun learning the course (i took mine in 2023) it can also be shitty. Do some research on your SME and make sure he has a good resume or good amount of projects under him! But you can always learn anything you want over the internet. Do consider this before you go for it",
    "Had taken a pesu io course in 2019...used to be free that time... My sme was good and the subject something I was interested in.... Sad to see such a great initiative becoming a way to make quick bucks.",
    "Depends on your SME and the topic you are choosing. There are good and bad SMEs\n└── Do you have any idea of the good ones rn? How do I pick\n    └── From EC Campus, I can vouch for these SMEs:\n\n- Shreya (OS Fundamentals)  \n- Vyoman &amp; Samarth (RAGs to Rich AIs)  \n- Prathamesh (Neural Networks)\n\n  \nYou can have a look at my course too :)\n        └── for rr campus? is ethical hacking good?\n            └── No idea mate, I'm from EC\n                └── ok, tq  \nBUT WHY AM i getting downvoted?\n                    └── Means it's not good",
    "Cfbr",
    "Honestly bruv, it depends on your SME. So the most important factor to consider when choosing wether or not you want to take up a course, first check the course you are interested in and then find out from your peers or seniors(if you know any that is) about how good/ bad the SME’s are. IMO if your SME is good, irrespective of whether the course is good/bad, boring or not, you’ll have good time and you’ll get to learn.\n\nIn my case, I took it up in my 1st semester(2023). My SME was amazing, not only did we learn, but we had a lot of fun too.\n\nIn terms of what course to choose, here are some insights based on personal thought. These are for RR campus :\n- Agentic system 101 will be good( SME is a great guy and the topic a fun o e too)\n- Tensorflow  mastery will be good too, this is the second time this SME is taking this course\n- Frontend Developer Bootcamp - SME is super chill and front end web dev is your entry point into real world development\n- Mastering Linux and NixOS : IMO very interesting topic and the SME is also very good\n\nThese are my recommendations. Hope it helps.\n├── Is it better to just do a similar course online? And what value would these courses add to our resume\n│   └── way better to do it online!! The ones online have better content and better worth than this anyway!!\n└── How much actual value does this add to our resume? Cuz I'm not sure what I'm interested in yet and all these topics have courses available online easily for free or much cheaper\n    └── Look for certifications on sites like udemy or Coursera, these have more comprehensive content and more worth than pesu io. They are cheaper too, 1000 for pesu io is too expensive!!!!",
    "For Rr campus I can vouch for \nSamarth and Saarth ( Entrepreneurship course )\nIt’s damn good and they are also damn good \nYou’ll learn a lot of useful stuff for life\nSo give it a try\n└── do you mean the startup course?"
  ]
}