{
  "title": "I didn't get to finish my food today",
  "content": "I'm so done with PES Cafeteria(RR campus GJB cafe)\n\nThere was a mad rush/crowd\n\nFelt like I was inside one of those BMTC buses during peak hour\n\ntried to get to the cafe asap but still LONG ass queue\n\nThe catering guys weren't following the token system even though it was printed on the bill and I had to yell to get my food\n\nonly to be left with 9 minutes to eat, I of course wasn't able to finish my food\n\nplease don't get me started on the fact that they expect us to also use the washroom in the same time and refuse to give us \"bio breaks\" as they call it. Like let me just use the washroom its not that deep\n\nI understand maximizing seats but at least upgrade the facility to hold the number of students\n\n3 measly shops in the main canteen catering to like 500-600+ people, what nonsense  \nat least the food isn't horrible, I might try some of the other cafeteria's tmw idk\n\nIma guy who lives alone and only have about 30 minutes to make, eat breakfast and then get ready  \nI cant cook lunch on days when classes extend past 3pm\n\noutside catering defeats the whole point of there being 3 canteens for ease of access but its looking like my only option",
  "metadata": {
    "id": "1fpuew1",
    "author": "Aye_Klutch",
    "url": "https://www.reddit.com/r/PESU/comments/1fpuew1/i_didnt_get_to_finish_my_food_today/",
    "permalink": "/r/PESU/comments/1fpuew1/i_didnt_get_to_finish_my_food_today/",
    "score": 75,
    "upvote_ratio": 0.98,
    "created_utc": 1727351947.0,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false
  },
  "comments": [
    "Wait till other kcet rounds ppl,MBA,MCA etc join too and see it getting much worse",
    "That's why, Sutta Galli. We abandoned the canteen long before GJB even came into existence.",
    "Welcome to PESU",
    "I don't mean to scare you but this is 50% of the crowd since most of the second and third years have ISAs right now. Be prepared for worse.",
    "one reason I'm happy to be in ec",
    "Bro/sis you can eat mess food..you can pay for it and eat\n.it might not be as tasty but still you can eat in peace\n└── Girls aren't allowed in skm mess?\n    ├── Since when ? Pretty sure you are allowed to\n    └── Ok....you can try food court",
    "plus they dont even let us enter if we’re late",
    "Come to the be block cafetaria\n└── Will that be free during 10.15 and lunch breaks?\n    └── Yess! If not completely free, u can definitely find space to sit and have food with peace.\n        ├── Ohh good,Thanks man!\n        └── Damn, I remember when this happened there only at class times",
    "I get it. Look, you should try getting there as early as possible. Second, U may have to shout and push ur way throught the crowd just like a local.",
    "and the workers there are also rude   \nThey know whatever we do they have no option apart from this",
    "This is why I like the ec campus , full open space so no rush at all.",
    "Yeah I'm forced to either cut in line or take food from others or skip lunch. The rush during breaks is crazy so best to try coming early or getting your own food (if you're a day scholar)",
    "Yeah you just gotta keep screaming your order and pray one of the guys notices you. ATP this is the norm otherwise have fun wasting 30 mins standing lol",
    "Stopped going long back, sutta gully ftw.",
    "Dude.. just go to sutta gullii.. I mean it ain't the healthiest, but the taste is there.. even that gets crowded, but u can atleast count on quick service",
    "Go to sutta Galli and eat shawarma if you're a non vegetarian or eat momos if you're a vegetarian",
    "how does it feel to cry about everything\n└── I'm sure you enjoy either home cooked food or something alternative to the cafeteria here. \n\nPlease realise that not everyone has that privilege"
  ]
}