{
  "title": "Anyone up for a chess match?",
  "content": "Is anyone up for a chess match in RR campus? Please mind that you will be up against a rookie. ",
  "metadata": {
    "id": "1ftqxd0",
    "author": "catmilkyoghurt",
    "url": "https://www.reddit.com/r/PESU/comments/1ftqxd0/anyone_up_for_a_chess_match/",
    "permalink": "/r/PESU/comments/1ftqxd0/anyone_up_for_a_chess_match/",
    "score": 9,
    "upvote_ratio": 0.85,
    "created_utc": 1727796637.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "there is apparently a dead chess club, we freshers might be able to revive this. with power of frndship....never mind. i am down btw.\n└── Yes, let's do it man\n    └── We need more people",
    "I wanna play but dk how (noob me)\n└── I'll teach you. Even I am not an expert\n    ├── I mean ik how to play the game idk how to play it in college but still I am noob only\n    │   └── Even I am a noob. I'm willing to play just for the joy of it\n    │       └── Yes sameee\n    └── Yeah me too let’s play !\n        └── I'm currently at the hostel indoor games. You can come if you want\n            └── I’m not in college unfortunately\n                ├── Do you use chess.com?\n                └── It's okay. We'll be playing on friday. I'll dm you\n                    ├── sure sure\n                    └── Do you still play chess 😭\n                        └── I'm an amateur. I invited a guy from reddit and he obliterated me. Anyways, we can play whenever you are free. And don't expect me to play well. That guy was boref af and destroyed me in a few minutes",
    "Why not how do we play lol\n└── I'm not sure if you can play chess in the indoor games room in hostel\n    └── Come gjbc noe I’ve seen a few chess boards near the badminton courts(online is also available)\n        └── Yeah I too have seen them but the drawers were locked. Maybe it's allowed only for people representing PESU idk",
    "I'm a day scholar but send me ur [chess.com](http://chess.com) user if you have one\n└── Sorry, I don't play online as I'm new. Why not play it in real. It'll be more fun as we'd get to meet each other.",
    "Yup send dm\n└── please dm me. I'm not able to dm you",
    "Even I'm up for it.\n└── dm",
    "Ya for sure",
    "DM me whenever you're free tomorrow"
  ]
}