{
  "title": "How is MBA PES IUP ?",
  "content": "I am planning to join PES IUP for MBA finance \n\nAnd planning to go to Indiana University of Pennsylvania for my 2nd years MBA\n\n\nIs this MBA with it ? Is the course work good, its good opportunity to go to IUP for 2nd year in USA \n\nIs this a good move ?\n\nOr anything else I need to be caution or whats the con of this MBA ? \n\n",
  "metadata": {
    "id": "1fxctgb",
    "author": "[deleted]",
    "url": "https://www.reddit.com/r/PESU/comments/1fxctgb/how_is_mba_pes_iup/",
    "permalink": "/r/PESU/comments/1fxctgb/how_is_mba_pes_iup/",
    "score": 6,
    "upvote_ratio": 0.88,
    "created_utc": 1728207413.0,
    "flair": "PESSAT/Admission",
    "nsfw": false
  },
  "comments": [
    "Jawahar's cab driver in the US was a PES IUP student. Take what u can from it.\n└── In the US it’s ok driving uber or lyft nothing to be looked down upon. Sometimes they do it out of compulsion or to support themselves or sometimes it’s just a passion. I have had a driver once who was a marketing head at Morgan Chase sometime back. Once I had a driver who was a big shot researcher at Brown university had his own lab and used to drive to meet new people",
    "https://www.reddit.com/r/PESU/s/iIAbvyWixZ\n└── Lol \n\nThanks bro, he himself confirmed?? Or that guy was doing a 2nd part time job ?? 🙄\n    └── Not a part-time, he was a full-time driver. He got fired for some reason iirc\n        └── Thats so bad, life aboard is worst.....\n            └── And pay in India is worst 😑",
    "Even i planned in iup program but dropped it coz of the fee\n└── Can you please tell my how much it is?\n    └── 24 to 26 Lakhs\n        └── For the second year in iup right\n            └── Yes it's in USA penselvaniya this the place name (spelling might be wrong)\n                └── I know. Btw if you go to some other colleges in the us. Itll cost a lot more than that",
    "I’m an alum from the course and can speak about it. I personally felt it to be decent. The head of the program knows how to trick people in believing that IUP is a great school but trust me it’s not the best school and is far away from all the major job markets. Most students choose to go to Desi consultancy and want the easy way out. There is a dude called Nanja and Simran- they are a couple they run a consultancy and hire students but be extremely careful of them. They both are like chameleons and know how to trick you. Furthermore to add on an actual MBA in the US costs you north of $120,000 so IUP-PES is a steal that way\n└── I actually have a few questions, if you don't mind :\n\n1) Is the fees actually 28L or are there ways to get a scholarship? \n2) How are the class timings? In India and in Penn\n3) How good is the job market? Atleast compared to now, as it might have changed a bit. Heard it's better now than compared to the previous batches. \n4) Did you think it was worth it? Or you wish you had considered other universities?\n    └── 1) The fees In my time was around $30,000 it’s for all 2 years including India fees. Back then $1 was 63-65 INR.\n2) The class timings in India are in the morning usually till about 2 ish. US depends on the courses you take some are in the morning or in the noon or early evening \n3) The job market can be a challenge since point to note IUP is located in a far flung area and is a Univ town so not many opportunities. Most students usually go to Desi Consultancies, since that’s the only option you are presented for and are coaxed into. Surprising and appalling to see not many use LinkedIn yet from IUP-PES even the current student. You need to work really hard to find a full time job, I have had a job been laid off as well and back to job hunting. \n4) For me it was worth it, I took it as a way to enter the US but post that did another masters from a better school. It’s a way to come here but trust me there are better schools for MBA when  compare and see IUP is no way near and Dr PNB doesn’t do much to improve it. For him money is more important than experience and also working hand in glove with one of the consultancies\n        └── Wow thank you for this information. \nAnd yes, the price is higher now, now that the exchange rate is way higher and it's around 27 L. \nThere are job fairs if I'm not wrong right? If you have done really well and worked hard in MBA we could aim for good jobs I think. And the ROI might be worth it? \nWould you recommend any other universities instead to get good jobs?\n            └── There are job fairs on campus, but most companies who come to IUP don’t sponsor internationals. Most of these companies are local and hire locals. But if you work hard you’ll get a full time job. You need to put in 6-8 months of effort in order to get a full time job, in order to get ROI. \nI would personally recommend you to apply to other schools as well and choose what’s better.\n                └── Thank you so much",
    "Is this worth it, planning for 2025/27"
  ]
}