{
  "title": "What am I missing out?",
  "content": "Should I regret my destiny for not giving me PESU last year? I was only getting some mechanical and biotech streams in PES last year through PESSAT and this year for the same rank I would get CSE and AIML and all that in the 2nd round at least in the EC campus. Even COMEDK this year would have given me a better college for the same rank.\n\nI keep lurking around this sub from time to time and keep seeing posts of EVENTS and FESTS from friends who joined there and think how much better my college life would have been if I joined there. I would have had better friends and a better overall crowd that I currently do.   \n(I kinda fked up comedk which also ended up becoming my best option and had to join ECE at CMRIT). \n\nMost of the crowd at CMRIT is from south and end up speaking in Kannada and only make groups among themselves. I have a few friends in other departments but not more than 1 or 2 in my class. The only silver lining about the college is that they aren't really strict in terms of attendance. \n\nSo would really appreciate if you post your thoughts on this.",
  "metadata": {
    "id": "1fxiqj2",
    "author": "IWantAChangeFR",
    "url": "https://www.reddit.com/r/PESU/comments/1fxiqj2/what_am_i_missing_out/",
    "permalink": "/r/PESU/comments/1fxiqj2/what_am_i_missing_out/",
    "score": 28,
    "upvote_ratio": 0.97,
    "created_utc": 1728227631.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "Rather than regretting not getting something, appreciate what you have right now. It will help you in the long term.\n└── That is there yes, maybe I should be optimistic about it being a life lesson and look into working with what I have. (Ill join some clubs this year now that clubs are finally back to being active)",
    "the people here in pes are looking at their frnds in iit nit and having same feeling which you have. but at last we cant change it. better enjoy what you have.The future is in our hands, not the past.\n└── Yea true af",
    "you would have regretted after joining here anyways\n└── yea maybe grass is always greener on the other side",
    "You'll never change don't worry"
  ]
}