{
  "title": "Sub Review, Feedback and Appreciations",
  "content": "Hey All\n\nSo, we have 5000+ peeps in our sub, which is a HUGE milestone (top 10% according to reddit) so it is natural to take a small pause, and see what can be changed/improved. \n\nSo share your suggestions and reviews in the comments, and i will go through them, implement if required or reject\n\nAdditionally, this sub has been EXTREMELY USEFUL, so if you wanna thank some redditors, here's the chance!\n\nSo good luck guys, hope to see more and more engagement  ",
  "metadata": {
    "id": "1g0c44l",
    "author": "ChromaticChaos",
    "url": "https://www.reddit.com/r/PESU/comments/1g0c44l/sub_review_feedback_and_appreciations/",
    "permalink": "/r/PESU/comments/1g0c44l/sub_review_feedback_and_appreciations/",
    "score": 70,
    "upvote_ratio": 0.98,
    "created_utc": 1728539655.0,
    "flair": "ANNOUNCEMENT :snoo:",
    "nsfw": false
  },
  "comments": [
    "Srsly thank you for this sub all the mods especially u/rowlet-owl who literally has made everything so easily accessible and kind of basic faqs seen which ain’t really there in other subs(Atleast ones which are similar in size to this one). Thanks to the mods as well for their help :). \n\nIn terms of suggestions I can’t really think of that many except maybe having a couple more mods we can reach out to? And maybe a sort of thread where juniors can ask seniors stuff and hence can check if their question has already been answered? It may even exist I just haven’t seen it ig lol ;)\n├── got it, but what if we had a chat channel with seniors + connecting with actual seniors, i guess, the discord channel is better as compared to reddit\n\nProblem with reddit has always been, verifying a \"senior\"\n\nSo, if you need some senior help, i guess discord is the way to go, or let me know if we need a separate chat channel\n│   └── Yes honestly that’s sound like a great idea, and even maybe one more for us to speak with seniors that are working or doing higher studies rather than say limiting ourselves just to people studying in pes. Maybe even create a separate channel for it…\n│       ├── This already exists. There is a discord server for alumni who are studying abroad. You can DM me for the link.\n│       └── on it, will be created\n│           └── Awesome stuff thanks a lot !!\n└── Glad I could help :D",
    "Editable flairs\n└── Any specific reason?\n\nOr which flair do you want\n    └── \n&gt;Or which flair do you want\n\nHas branch name and year\n        └── See the thing is, i had enabled this, but, very less adoption and again, there's no way to accurately verify\n\nI don't see how this flair would help\n            └── No need of verification in reddit man its fine..\n\nAnd u didn't enable this, can u plz check it again",
    "Will rowlet guy give his darshana to us juniors? Who is he, kaha se aya ta vo, udti patang sa ta vo.\n├── Aww &lt;3\n\nI am currently in the US but I used to drop by sometimes to college. I'll do the same when I come home later this year to meet people if they are interested.\n├── so cuteee \n\nOnly a select few can see our fav owl ig :P\n└── Yes, dude is literally a celeb",
    "One suggestion is to give mod duties to present 3rd / 4th years.   \n  \nThank you so much for all the mods who have been doing a really amazing job. Kudos to all of them and to everyone who has contributed to the betterment of this sub.\n└── I can give the mod duties, but this will again be converted to a college propaganda spreading + used for club/event promotions (i can be wrong, but this has happened in other subs)\n\nAnd the mod duty honestly is reviewing and sanity check of posts which doesn't take much time, but will keep in mind to see if we have like a rolling mod system or something\n    ├── Give me mod duty now atleast:kekhands:\n    │   └── hahahahahah\n\nLet's discuss soon; mod owls are scary (duolingo)\n    └── I don't feel there are any complaints regarding current moderation set up",
    "A sincere request to the mods, so far this sub has been fun to read and answer queries regarding several things, but at the same time some juniors who think it's 'cool' to put some random and irrelevant posts are diluting the quality of the sub. So kindly keep a check on those users and ban them accordingly.\n└── This is true, but again, the bad posts are also sometimes fun to read xD\n\nI don't want to hold a personal bias and judge if they are right or wrong; however, if a lot of people have reported it, i definitely do take it down.\n\nFeel free to report whatever you don't like/doesn't go well with the sub. Happy to review and remove",
    "Love this subreddit and much appreciation to Rowlett sir and all the seniors who actually help us by answering stuff.  ∩^○^∩\n└── 🥺💖",
    "Please change the sub reddits banner to new pes logo , it's understandable that old one looks good but it's just irrelevant at this point\n└── Oh yes, very valid point. Can you please share the logo file if you have?\n\nBeen very long since I designed with clubs, don't have the updated logo\n    ├── The logo is off centred\n    └── Yeah it's not properly centred\n        └── Let me try once again, reddit doesn't give edit options \n🥲\n            ├── Minor nitpick: Zoom into the icon more and reduce the whitespace around the logo\n            │   └── True \nLogo looks so small\n            ├── now its perfect 🙌\n            └── Check now \nI hope all of you are satisfied 😤"
  ]
}