{
  "title": "Do we get a holiday tom?",
  "content": "https://www.hindustantimes.com/cities/bengaluru-news/bengaluru-schools-and-colleges-to-remain-closed-tomorrow-amid-heavy-rain-across-city-101728990149367.html\n🥲",
  "metadata": {
    "id": "1g4896x",
    "author": "Potential_Diamond562",
    "url": "https://www.reddit.com/r/PESU/comments/1g4896x/do_we_get_a_holiday_tom/",
    "permalink": "/r/PESU/comments/1g4896x/do_we_get_a_holiday_tom/",
    "score": 37,
    "upvote_ratio": 0.97,
    "created_utc": 1729000423.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "The holiday is actually for both wednesday and thursday,\nbut for all the colleges(obv except the college which is a substitute for IIT Bangalore) thursday is holiday by default due to Valmiki jayanti.I doubt they would give holiday\n├── Where is it mentioned that Thursday is a holiday\n│   └── bro didn't get it\n│       └── 😂😂😂 got it, use /s\n└── thursday is a holiday in pes?\n    └── PES is the substitute for IIT-Bangalore /s",
    "Lmao PES had students come to ec campus by boat. You think this is going to stop them?",
    "Lol as a fourth yr student ,saying from experience even if you guys do get a holiday/s they will compensate by keeping classes on saturdays. If you get 2 days holidays then 2 saturdays lmao so dont get your hopes up\n└── 😭",
    "i just got mail that i have to come to class tomorrow at 7:45 am ( i joined in kcet second extended round )\n├── 😢\n├── All other colleges have declared holiday tomorrow \n│   └── nah bms and christ have college tom\n├── ME 2\n│   └── so you coming ?\n│       └── yea i mean i have to which class u in tho\n├── through email or the pes website/app?\n│   └── email \n\nfrom pes electronic city\n│       └── sigh, ig rr just does not care\n│           └── rr got holiday ?\n│               └── no\n├── Off topic but did the sections get allotted?😭\n│   └── yes i got mine\n\ngot it on pesu app\n│       ├── Where in the app? 😭 I'm a bit confused\n│       │   └── sorry on the website\n\n[https://www.pesuacademy.com/Academy/](https://www.pesuacademy.com/Academy/)\n\nknow your class and section\n│       └── may I ask where you saw it in the app?\n│           └── sorry i saw it on the website \n\n[https://www.pesuacademy.com/Academy/](https://www.pesuacademy.com/Academy/)\n\nthis one\n\nknow your class and section\n├── I got no mail, only my srn, did you also get your section details? and is it reflecting in pesu academy?\n│   └── [https://www.pesuacademy.com/Academy/](https://www.pesuacademy.com/Academy/)\n\nknow your class and section\n\nyou got your SRN number?\n\ni didn't\n└── I didn't get any mail and even I got admitted yesterday through KCET\n    └── i got it an hour ago\n\ncheck once\n\ntho my mail got no SRN number",
    "Kids these days, we used to go to college in peak Covid first and second wave to give ISAs\n├── Kids these days won't know how wild it was to drag your ass to college with a COVID negative test certificate and a mask over your face just to write ISA and ESA with 1000+ other students in the same building. They also missed the \"advisory not mandatory\" phase too\n├── this is the modern version of \" kids these days , i used to go to school after climbing two mountains \" \n\n( i am just kidding sir, no offense )\n└── That first isa in sem 2 was peak clownery\n    └── I swear",
    "I'm from the 2012 batch which was PESIT. Even if there's a fire, they'll continue running classes"
  ]
}