{
  "title": "Fuck pes",
  "content": "Metro lines fucked getting no auto or cab and pes still wants to keep classes, they won't even answer calls and shit fuck pes",
  "metadata": {
    "id": "1g4oz9f",
    "author": "Simple-Antelope5228",
    "url": "https://www.reddit.com/r/PESU/comments/1g4oz9f/fuck_pes/",
    "permalink": "/r/PESU/comments/1g4oz9f/fuck_pes/",
    "score": 168,
    "upvote_ratio": 0.97,
    "created_utc": 1729045337.0,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false
  },
  "comments": [
    "Went thru great difficulty and pulled up to college and still didn't get attendance",
    "Yeah istg\nWhat absolute cunts\n└── Fr fuck this college",
    "Ma chudaye pes",
    "If your attendance is good, take a day off. Ntgs gonna happen",
    "Take a day off. Not worth getting drenched in rain.",
    "No idea what this is fuck it I guess",
    "Plus they dropped isa results. Average pes moment😭🤣.\n└── Fuck you I actually fell for it\n    └── They did for us lmao. 7th sem btw. Mb if it didn't come for y'all yet xd\n        ├── Sorry, i'm in 3rd sem 💀\n        └── Yeah it has come for 7th sem folks",
    "I just went back home lol",
    "Fuck pes indeed",
    "Goateed clg",
    "Wait metro lines fucked??\n└── In SV road (purple line) a branch fell on the track",
    "Lmao this is so PES. During COVID, other colleges had their final exams online and PES had us come to college to write our fucking ISAs lol. Just tell your parents it's a holiday and bunk",
    "Randi ass cllg",
    "You can at least bunk classes. What do you do for exams . We had some assessment of a company.\n\nI had to skip it\n└── are most company assessments this year offline i.e. in campus?\n    └── A good number is. If you live far. Just suffer",
    "Lmfao.... Glad to see juniors experiencing this... Same thing for us during covid too",
    "welcome to pes buddy :)",
    "Guys, been a while since I graduated but i believe things have gotten worse. But it all starts to make become easy in the end, bunking is easier, so is the attendance strictness. \n\nCan someone fill me in on what's the worst internally, be it attendance, profs etc etc"
  ]
}