{
  "title": "Y is it that we need to room with someone in first year?",
  "content": "Already I'm pretty irritated by how this year started, and they put us up with roomates 😭\nAnd many are not even accomodative 😭😭😭\nWorse that I'm an introvert who hates when someone comes into my space. And my roomie is someone who likes to be in other's space a lot.\nI'm going crazy after a month itself, dk how I'll handle a year.",
  "metadata": {
    "id": "1g4vncl",
    "author": "Eevee-06",
    "url": "https://www.reddit.com/r/PESU/comments/1g4vncl/y_is_it_that_we_need_to_room_with_someone_in/",
    "permalink": "/r/PESU/comments/1g4vncl/y_is_it_that_we_need_to_room_with_someone_in/",
    "score": 20,
    "upvote_ratio": 0.86,
    "created_utc": 1729072411.0,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false
  },
  "comments": [
    "Why take hostel if you don't like others coming into your space😭 I feel like it's a given\n└── I'm from Delhi dude\nDon't have any other place to stay\nPlus parents are the ones who put me in it\nAnd they specifically requested a single room, but they were like \"not available for first years\"\n    ├── Room no\n    │   └── U from hostel too?\n    ├── Ah.. Well that sucks but you just need to learn to adjust/get used to it :')\n    │   └── 😔\n    └── ayo which hostel and which room, from Delhi NCR too\n        └── Unit 1 \nU?\n            └── u in rr campus?\n                └── Yeah\n                    └── Which is unit 1?\n                        └── Wait, u a girl or boy?",
    "U will adapt eventually nobody started loving hostel life in the 1st month itself\n└── I like hostel life, my roomie, not so much\n    └── Then if u have some good friends u can stay in their room apart from sleeping anol . U could also try and request for room change with any of ur friends who wants to be ur roommate too. Tell ur roommate if u don't like something abt him , trust me it becomes easier if u tell the other person, during my 1st year I didn't like my roomie at all in the 1st month but we became good friends eventually",
    "Become good friends with your roommate and don't commit too much.",
    "stop being an introvert, problem solved\n└── 🙂 Wah *slow claps* such an amazing solution! Why didn't I think of that?\n    └── from the way you type, I can tell ur an introvert, it genuinely ain't hard to stop being one, im def getting downvoted for this\n        ├── Okay grandma\n        └── it doesnt work like that , are you retarded?  \nSearch up the definition of introvert , that's not something you can change and \"stop\" being one , you know you're wrong and yet you type it out without even thinking once. \"im def getting downvoted🤪🤪\"\n            └── its my opinion man\n                └── being an introvert is related to psychology it can't be your \"opinion\" , it's science based"
  ]
}