{
  "title": "3-6 Month Internship at IIM Bangalore ",
  "content": "Hey Folks, \nI have got a lot of juniors and acquaintances who wants positions like this, where they can learn research, analytics and other very important skills for research and analytics.\nProf Shailendra work on really interesting problems.\n\nDo apply for this position if you got 3-6 months and want to learn things underlying good quality research.\n\n\nNote: Not sure if directly PES Related, but hopefully would be helpful for a lot of folks.\n",
  "metadata": {
    "id": "1g4w0hs",
    "author": "Abhi_IIMI",
    "url": "https://i.redd.it/7jcanlugg3vd1.jpeg",
    "permalink": "/r/PESU/comments/1g4w0hs/36_month_internship_at_iim_bangalore/",
    "score": 28,
    "upvote_ratio": 0.98,
    "created_utc": 1729073911.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "Pro tip: Please go down to IISc and go to the departments of your interest and request them for an internship. It’ll be a paid opportunity if you’re lucky. Every person I know who has gone down to IISc in person and requested an internship has got one. It’s a great learning experience and if research is your thing then you’ll love it.\n├── Worth a try.\nJust personalized application and read about the papers and work happening in the lab right now.\nThey are always looking for good candidates\n├── Hey! I’m a final year student here and I’m trying to get an internship at iisc. Can I dm you some questions regarding this?\n│   └── Sure\n│       └── Hi, I was not able to dm so I'll ask here instead,\n\n1. Is it actually easier to get an internship if I go to the IISc campus physically rather than cold emailing professors? \n\n2. Do you have any idea if there are specific labs/departments which welcome interns at IISc from PES? \n\nThank you in advance!\n│           └── Pretty much all labs look for interns lol. Do your research on the labs you want to target beforehand. I was an intern down at CiSTUP under Dr. Punit Rathore, he’s a pretty cool guy and keeps hiring interns from time to time. \n\nI have had friends who had a good luck cold mailing but meeting them in person is a fool proof way of introducing yourself. \n\nKeep in mind that more often than not, you might not get to meet the professor directly and will meet their PhD students. These will be people you’ll be working with if you do get the internship. \n\nTo sum it up, do some research on which labs and professors to target and go in person. Good luck!\n├── can i dm?\n│   └── Sure\n│       └── can you please msg? im unable to from my end\n└── so im a 4th sem student interested at pursuing an internship at iisc. i reside in blr so it's the best place for me i suppose. i don't really have much of anything apart from a decent enough gpa to show. i could try approachig them but im really unsure abt how to go about things. any tips?"
  ]
}