{
  "title": "IT IS UNFAIR FOR CET 3RD ROUND STUDENTS!",
  "content": "8 - 4:45 classes everyday???????!!!!!!!!!!!!!!!!!!!!!! thats crazy and theres also only 2 breaks , rest of the classes happen one after the other without breaks! its not our fault its the government's fault they delayed the counselling so much !",
  "metadata": {
    "id": "1g50258",
    "author": "SecondFade",
    "url": "https://www.reddit.com/r/PESU/comments/1g50258/it_is_unfair_for_cet_3rd_round_students/",
    "permalink": "/r/PESU/comments/1g50258/it_is_unfair_for_cet_3rd_round_students/",
    "score": 27,
    "upvote_ratio": 0.87,
    "created_utc": 1729087191.0,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false
  },
  "comments": [
    "Welcome to PES",
    "This is just for first sem dw\n\nThe crazy thing is I feel like I haven't learnt one fucking useful thing for like almost 3 weeks of classes.\n\nTake classes to write tests all based on some pointless or outdated shit. Its all a practical exercise to see who can cope better and become a programmed bot for these companies to come pick up off the assembly line. \n\nI feel bad for you man. Classes till 5 and you probably reach home at 6 or 7. Might as well live at pes at that point\n├── Honestly, first sem subjects, with the exception of python are useless.\n\nIMO you cannot teach programming in a class. All you can teach are the APIs and the syntax, the two things you can *easily* lookup.\n\nKnowing how to reason about a problem is something that no teacher can teach. It only comes with practice.\n\nGo forth, and build stuff!\n│   └── Python faculty ain't very good tho.\n│       └── And?\n\nTeach yourself, you can do it\n│           └── That's the only way.\n└── This is just general Indian education atp",
    "&gt;its not our fault its the government's fault they delayed\n\nWell to complete ur sem within Jan they have to do it no matter whose fault.They have to perform sem exams for everyone at the same time.Everyone went through this shit,now it's ur turn",
    "dw it only gets worse :D\n└── :D",
    "cope. it gets better later",
    "Even for 2nd round students we have classes till 4:45. What part of this is unfair? Even if the counselling wasn't delayed you would still be having regular classes till 4:45 because 1st and 2nd round students are already way ahead of you. We all have ISAs at the same time so they have no other choice either.",
    "we have classes from 8:45 to 5:30. Welcome to pes.\n└── Wow you guys are really unlucky, I remember for us in 1st sem, we used to have classes from 8:15 - 11 am on certain days and also had 3-4 weeks online due to third wave in COVID. It was real chill.",
    "Welcome to People's Education Society boss!!\nChill...just bear it somehow for a sem",
    "We have 9-6 kid\n├── which class?\n└── Which course?",
    "It's a cannon event.",
    "You people had 1 month extra holidays😅\n└── We didnt ask for it\n    └── If not should have taken whatever you got in first/second round and attend classes and even participate in counselling and later convert it to whatever you got in third round.I know quite a few people who requested them to attend classes and later got their branches changed.\n        └── I have been in another clg , I was in chem cycle and here im in physics cycle ( 3 subjects are changed )🤡\n            └── Oh sad",
    "been there, this happens every year, you have to just cope with it.  \ngets better later, you'll definitly get 2 month summer breaks, which many vtu colleges don't, advantage of being autonomous  \nour batch cet 3rd round students finished 3 sems in 1 calender year  \nik its a hectic schedule but try get a good sgpa, coz its easier to maintain gpa than to improve it later",
    "If they don't keep extra classes and rush the syllabus I'm sure you will make a rage post for that as well lmao",
    "bruh what do u want college to do, delay it even more?  \nafter first isa u guys will also go at same speed as the rest of the people.",
    "Could’ve studied better and get into Clg in 2nd round.Fate bro fate",
    "that is normal in places like PES man",
    "The reason I went to msrit 💀"
  ]
}