{
  "title": "What’s the current state of PES RR?",
  "content": "Hey everyone. What’s the current state of PES RR campus? 2020 CS grad here. \nIt’s been a (really) long time since I visited the campus (Don’t have my ID card on me sadly) \nI was curious about things now post all the things that transpired earlier this year. \n\nWho all are the HODs and the _meta_ CS profs? \n\nI remember back in 2020 a lot of the good profs left PES and I’m not really sure of the ones that have remained in PES now. \n\nIs Cheta’s juice shop still open?\n\nIs Vasundhara Kritika still open? \nDo they still have people from the college there? (When we were about to graduate there was an entire scene with the VK association and not allowing PESU kids to take up residence there). \n\nAnd finally. Is the construction of that new building done? 😂",
  "metadata": {
    "id": "1g5b83q",
    "author": "FormerTechie",
    "url": "https://www.reddit.com/r/PESU/comments/1g5b83q/whats_the_current_state_of_pes_rr/",
    "permalink": "/r/PESU/comments/1g5b83q/whats_the_current_state_of_pes_rr/",
    "score": 16,
    "upvote_ratio": 0.87,
    "created_utc": 1729115711.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "&gt;Who all are the HODs\n\nMamtha HR - HOD of CS department \n\n&gt;Is Cheta’s juice shop still open?\n\nYup it is,but the thing is he got too many competitors and his juice quality/taste has been dropped overtime.But ppl do come for his Mayo maggi and sutta.\n\n&gt;Is Vasundhara Kritika still open? Do they still have people from the college there?\n\nYup,Yup\n\n&gt;Is the construction of that new building done?\n\nNope.Partially done,just 3-4 floors r well constructed and even they have some work to be done and still 4 floors r remaining (It has lift up to the 8th floor,so i discovered that much)\n\n&gt;Don't have my ID card on me sadly\n\nWell idk how it was during your time but now it's not too strict, You can get in if you are in a flock,just show the pesu app page(I hope you can login even now) and he will let you in with 0 verification.If u cannot arrange this just get into the college after 9 and no one will ask anything.\n└── Gjbc is supposed to have 8 floors?\n    └── Well it has lift till 8th floor,idk anything beyond that\n        └── That's just the chamber of secrets\n            └── 💀",
    "If you haven't visited campus since you graduated in 2020, then you won't recognise it the first time you visit lmao."
  ]
}