{
  "title": "clubs",
  "content": "I am a fresher here and had a few doubts about clubs:\n\n1.Will you be allowed to leave the club in the middle of the year\n\n2.will there be an opening in 2nd year to join clubs\n\n3. How many clubs can i manage without it affecting my studies \n\n4. Is there some sort of minimum attendance before u get kicked out?",
  "metadata": {
    "id": "1g5ppuy",
    "author": "Background_223",
    "url": "https://www.reddit.com/r/PESU/comments/1g5ppuy/clubs/",
    "permalink": "/r/PESU/comments/1g5ppuy/clubs/",
    "score": 16,
    "upvote_ratio": 0.9,
    "created_utc": 1729168168.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "It's cute to see these kids thinking that clubs are some serious affair and a binding contract for participation. \n\nClubs hold events and you take part in them. For almost all clubs, to \"join\" a club means to join their organising team that puts together these events for others. Less than a handful of them have exclusive \"members\" the way you think it is. Think of it as a group of kids with similar interests who put together events for others. It isn't that complex or serious. This isn't some \"formal\" club system\n\n\n1. You can always leave a club at any point. Nobody is going to stop you. But if you play a big role they're gonna be pissed lol. \n\n2. It depends on the club - some recruit bi-annually, some annually, etc. \n\n3. Depends on you. The goal isn't to join the most number of clubs and it isn't a contest. Given that clubs themselves don't carry any weight on your profile, maxing out here is pointless.\n\n4. Again, since this isn't a strict contract nobody will bat an eye if you leave. Although if you're an organising member and stop showing up for things they will eventually replace you.\n├── thanks!  \nalso wanted to know what exactly we gain from joining clubs.\n│   └── You network with like minded people\n│       └── oh ok thanks!\n└── Wait, you don't have to be in a club to participate in its events?"
  ]
}