{
  "title": "HELP ",
  "content": "reallyy not vibing with my friend group most of the time im just questioning why im here.\nBut its so hard to make new friends now(im second year btw), since im already kinda stuck with these people and most people are already are in their own friend groups.\nhow do i put myself out there to make new friendships this is coming from an introvert btw.",
  "metadata": {
    "id": "1g5y2h9",
    "author": "Resident-Branch-2719",
    "url": "https://www.reddit.com/r/PESU/comments/1g5y2h9/help/",
    "permalink": "/r/PESU/comments/1g5y2h9/help/",
    "score": 22,
    "upvote_ratio": 0.86,
    "created_utc": 1729190453.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "What's with the iPad generation and not being able to make friends? This is literally the third post this week about not being able to make friends in college.\n\nIt's easy to get along with people who share the same interests as you. The only way to find these people is to put yourself out there. Next time you see an event (and I believe there are multiple clubs events every week) coming up which sparks your interest, take part in it. Talk to the people who are taking part and see if anyone gets you. Talk to people on discord and WhatsApp groups - there are so many of them - and see which people share similar interests. Honestly the only way to \"put yourself out there\" is to literally make yourself visible and noticeable. \n\nStart breaking away from your shell, it's only holding you back. I understand that it's easier said than done but it does get a little easier if you give it your best. Just talk to people. It's the easiest way to make new friendships.\n└── Saar we are like 5-6 years older than them Saar half a decade, these kids are all the digital age guys, we were in the middle of both so we know how to do stuff without instructions from a app\n    └── Makes sense lol. Tbh I'm really grateful for having been born just at the right time. I got to grow up without technology taking over my life yet got to witness how phones and devices became part of our everyday activities. \n\nLife was a lot simpler back then. Only being able to talk to your friends after school through calls or in-person, and not through texting or sending memes, navigating roads without Google maps, not having assignment answers being spoonfed through ChatGPT, actually visiting libraries, etc. the last 10 years have changed the world drastically.\n        └── Honestly the chatgpt shit is new to me as well, I mean it's been what 2 years 😭, also sir guess who this is , uk me🤭",
    "You're in second year. Float between groups if you must...you'll find someone. I'm an introvert too...or just look for the loners and hang with them (don't force if they don't vibe)",
    "You don't."
  ]
}