{
  "title": "How exactly is credits awarded per subject and what does credit even mean?",
  "content": "1st year student here... Professors keep mentioning about credits in class and we studenta are literally puzzled as to what does it even mean. Can any senior explain this in detail?",
  "metadata": {
    "id": "1g6b7zy",
    "author": "AnimeFan-_-99",
    "url": "https://www.reddit.com/r/PESU/comments/1g6b7zy/how_exactly_is_credits_awarded_per_subject_and/",
    "permalink": "/r/PESU/comments/1g6b7zy/how_exactly_is_credits_awarded_per_subject_and/",
    "score": 16,
    "upvote_ratio": 0.9,
    "created_utc": 1729230769.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "Go through the FAQs, there's a detailed answer there about how GPA is calculated.",
    "credit just means weightage, more credits = more weightage = more effect on cgpa\n└── That we understand, but we are not understanding what each part of credit mean and how each subject has different credit.. on what criteria is each credit given?\n    └──  More important the subject , higher the credit. Some subjects will have a lab and that's an additional credit, like python will have theory (4) + lab (1) credits. Marks for theory and lab is calculated seperate and added with an overall weightage of 5.\nStatics for example is three credit and will affect your gpa lower than something like chemistry.\n\nJust read the FAQ for any more questions.",
    "Basically credits is something which you earn per course till the final year, based on which your CGPA is calculated and the degree will be awarded.",
    "Ok so basically credits are like the weightage of a given subject w.r.t your cgpa. Main course subjects are 4 credits and if there's a lab with that subject it'll be 5 credits. In sem 1, you have civil, electronics and math which are 4 credit courses and chemistry and CS which are 5 credit courses because they have a lab attached to the subject. Constitution was a 2 credit subject for us  but I think it doesn't count for credits for my juniors, but I'm not sure abt that. So without constitution, your credits for that semester will be 4*3+5*2 which is 22 credits.  If I overly simplify it, the impact of your marks of a subject like math will be 4/22 and chem will be 5/22 roughly. There's a formula with which you can calculate your sgpa given your grades but this is just like an outline of what credits are",
    "[Check this out!](https://pesufy.netlify.app/docs/folder/gpa/)",
    "They contribute to gpa. Do well in ISAs and ESAs and the higher chance you will get a high gpa. Most core subjects are 4 credits, some are 5, including lab.",
    "Don't you guys get handbooks anymore?\n└── Nope"
  ]
}