{
  "title": "Byheart or understand properly???",
  "content": "I am in 1st year CSE and week 1 just got over for us.\n1. Engineering physics and mechanical science, these two subjects have gotten me confused.\nI wanna know if it's good to understand the concepts deeply without byhearting anything or will byhearting alone fetch me 9+ cgpa??\nUnderstanding each and every concept properly feels really difficult as we don't have the derivations and just the formulae many times.\n2. Will I need these concepts of engineering physics and mechanical science only for this semester or even in 2nd and 3rd year? (I am a CS student)",
  "metadata": {
    "id": "1g7tvul",
    "author": "TheCosmicBlizzard",
    "url": "https://www.reddit.com/r/PESU/comments/1g7tvul/byheart_or_understand_properly/",
    "permalink": "/r/PESU/comments/1g7tvul/byheart_or_understand_properly/",
    "score": 12,
    "upvote_ratio": 0.87,
    "created_utc": 1729411787.0,
    "flair": "Study Help :table:",
    "nsfw": false
  },
  "comments": [
    "-You need to understand bro, these guys dont ask straightforward questions in their exams lol.\n\n-You can delete all 1st yr non cse bs the second you finish writing your esa\n├── From where can we understand these concepts. It almost seems like symbols I have never seen in my life especially with del operators and all in engineering physics\n└── Ohh I see\nIs it enough if I understand everything in the slides? Or should I read those reference books they have mentioned?\nAnd also will they ask the derivations that r not in the slides?\nBtw which sem u in bro?\n    ├── For mechanical just mug everything up blindly From slides. For esa you'll need to learn diagrams too.\n\nFor physics stick to Faisal sir's slides.  Reference textbooks not needed. Derivations from the exam came only from slides and class notes. Mug up formulas properly.\n    │   └── Makes sense\nThank you for the advice.\nBtw Faisal sir is actually my physics teacher, u recommending his slides?? Is this a coincidence?\n    │       └── Thats lucky. everyone across both campuses uses Faisal sir's slides because they're pretty good.\n    │           └── Both campuses? Damn\nAre u from ecc tho?\n    └── bro just make sure you understand everything in the slides and for math do notes",
    "This ain't school where you can byheart content  and they're gonna ask you the same thing in exams. They're gonna test your understanding by asking questions in ways you wouldn't have imagined. So understand the concept.\n└── I'm assuming u r in ur 7th sem\nWhat's a safe cgpa if I wanna get placed in a tier 1 company?\n    └── Keep it above 8 CGPA.",
    "brother it's 1st sem you're not gonna use this knowledge anywhere trust me...unless you take up some kinda research \n\ni would say just mug it up for now and do well in exams \n\ncuz most of the theory being taught is anyway dated\n├── why do the still keep it, i heard pes does a pretty good job updating syllabus regularly\n│   └── Which section in 1st year r u?\n└── If I understand most of the things in the slides and mug up the parts I don't understand, is it enough to get 9+ cgpa?\nI would say I understand about 65% of what's there in the slides.\nAnd we have quantum mechanics in engineering physics.",
    "Mug up",
    "As long as you don't get grades below C. You don't need to worry about gpa. The more Es and Ds you have on your grade card the less chance you have to get a good gpa. For me mechanical was easier compared to physics because its mainly theory.",
    "For physics you need to understand if you want high marks, especially problems. Mech is mostly theory with few problems...you can byheart if you want (not the problems )\n└── Now that I have started physics ig ur right abt the problems\nBut I'm more worried about those conceptual questions at the end of the ppts\nLike....how to even write a proper 4 mark answer for those? I don't even know how detailed or lengthy the teachers expect us to write them.\n    └── The higher the marks the longer you need to write. Talk to your teacher"
  ]
}