{
  "title": "New app announcement to fellow PES friends",
  "content": "Hi PES friends, I am an alumnus from PESIT. We have recently launched an app to help people find company for meals. We all recognize that we have a loneliness epidemic. Especially once you graduate and start working. It's hard to meet people, especially the people with like mindedness. This causes many of us to be in situations where we eat alone although we don't like to. We want to try new restaurants and new cuisines but can't find company who has same eating preferences. \n\nSo we made Solono app. Solono helps you add meal requests and let others repond to it. You can choose to match with someone from interested people and have a meal with them while having good conversations. \n\nWe really hope this brings us a bit closer leading to new friendships, professional networks and even relationships. Hope you all download and enjoy the app. \n\nDownload link on the website. [www.solonoapp.com](http://www.solonoapp.com) ",
  "metadata": {
    "id": "1g7xzkd",
    "author": "Much-Leadership9645",
    "url": "https://www.reddit.com/r/PESU/comments/1g7xzkd/new_app_announcement_to_fellow_pes_friends/",
    "permalink": "/r/PESU/comments/1g7xzkd/new_app_announcement_to_fellow_pes_friends/",
    "score": 60,
    "upvote_ratio": 0.98,
    "created_utc": 1729428710.0,
    "flair": "ANNOUNCEMENT :snoo:",
    "nsfw": false
  },
  "comments": [
    "Bro created a problem and solved it 😭\n└── Hehe just wait until you graduate bro! You will search for this post and download the app\n    └── Jokes on u, I'm already lonely.\n        └── Bwahahahaha",
    "Bro ate all introverts with this one\n└── You might find an extrovert that will fill all the silence! haha",
    "dating app with extra steps\n└── Yes you can use it for dating! No more weeks and weeks of talking stage. And no more 'men' have to pay the bills. You go for meals. You hit it off, that's great. If you don't, then go on another meal.",
    "Yo this is a crazy idea icl I fw it\n└── Thank you Bro! Counting on you all and hoping that we make a difference!\n    └── whatd u use to make it?",
    "This is actually a really great idea!\n└── Thank you Bro! Hope it helps us all to be a better community!"
  ]
}