{
  "title": "DDCO U3",
  "content": "i scored really bad in isa 1 . And i didnt even listen u3 since it was more of theory so from where do i read now . Even if i listened to the class i wouldnt understand . So from where do i read so that i could understand them properly ",
  "metadata": {
    "id": "1g99z4z",
    "author": "Radiant-Contract-460",
    "url": "https://www.reddit.com/r/PESU/comments/1g99z4z/ddco_u3/",
    "permalink": "/r/PESU/comments/1g99z4z/ddco_u3/",
    "score": 11,
    "upvote_ratio": 0.92,
    "created_utc": 1729571641.0,
    "flair": "Study Help :table:",
    "nsfw": false
  },
  "comments": [
    "The DDCO, MPCA and OS course textbooks are really good. You should use them to learn the content and then use slides to revise. \n\nUse textbooks for courses. You'll see the difference between learning from a couple of points and learning from the source pretty easily.\n├── Anything for afll? The TB they suggested is bad, I went through it.\n└── But isn't the topic soo large in the tb, and I feel like the content are spread out and difficult to pick out which concept to read\n    └── Don't you get the course info which specifies which topics to read from the book? Refer to that. \n\nAnd yes, the content is large because it is *explained* in detail. Isn't that what you're looking for? You're in college, get used to reading the book. Don't fall into the downward spiral of getting spoonfed with slides, notes etc. - there will never be any replacement for the textbook. And some of these textbooks are arguably the best textbooks to read for these topics, especially the courses I listed out. Read the book and solve the problems. You'll see the difference on your own. \n\nSlides were always meant for revision, not learning the content. Just because the first year was easy and slides were sufficient, doesn't mean it will continue to work now.\n        ├── I see, and if I have doubt in learning is there any yt channel to clarify those . Like I don't wanna depend on yt but the doubt part\n        └── I made my notes only after reading the textbooks mainly because the slides we got were just random sentences from the same textbooks cut and pasted with 0 context (applies to DDCO, MPCA, OS)",
    "Not related, but when it comes time for the ESA, definitely do the end of chapter problems from the textbook or atleast go through the solutions once.\n\nFunny story, I didn’t do shit for DDCO, and right before the exam, I went through the end of chapter problem solutions for most of the chapters. I got asked 4 of the exact same questions from the exercises in the ESA (and these were like 6-8 markers but with different numbers) and this was the only reason I managed to get a B grade instead of a C grade\n\nObviously not saying this happens every year, but recommend to go through the chapter problems anyways\n└── which textbook?\n    └── I graduated 2021 so it’s been many years since I took DDCO. Don’t remember the name. Just whatever textbook is prescribed for the class",
    "I am in the same ship rn , my teacher recommend me to do the text book which im doing rn , really useful untill now atleast\n└── Mind sharing the textbook name?\n    └── Computer organization edition 5 , it should be in the google drive link"
  ]
}