{
  "title": "Hectic? (genuine question)",
  "content": "It's been about a month now since first year started and we haven't had any projects or assignments yet... and it just feels like all we gotta do is attend classes, study, participate in club events, do assignments/projects assigned once in a while and just do whatever you want with the remaining time. I haven't yet experienced the \"academic hell\" that is PESU, and I genuinely want to know what's in store for us.\n\nIf a senior could tell what's in store for us after these first few \"happy go lucky\" weeks end.\n\n(PS: please don't leave comments like \"oh it's gonna be hell\" or \"it's only gonna get worse\", I've read enough of them in other posts already, I honestly want to know what's exactly gonna happen.)",
  "metadata": {
    "id": "1g9kj52",
    "author": "PlusBad4113",
    "url": "https://www.reddit.com/r/PESU/comments/1g9kj52/hectic_genuine_question/",
    "permalink": "/r/PESU/comments/1g9kj52/hectic_genuine_question/",
    "score": 39,
    "upvote_ratio": 0.91,
    "created_utc": 1729609971.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "Well actually in sem1 it will be chill for pessat students cause u guys have so many half days. But for some rounds of kcet ppl they do have classes till 4 if im not wrong (We had) so it's hectic for them.First year will almost be like that,make sure you enjoy when u get an opportunity!\n└── For us Kcet 3rd round students classes are till 4.45 from Monday to Friday bro\n    └── Joined 2nd round  we have a few extra classes",
    "First year is pretty relaxed in terms of academic workload, which is why people consider it to be the lightest/easiest year. Once you hit 2nd year when every course has atleast an assignment, project (or both) and you're simultaneously trying to balance labs, quizzes, club activities, social life, fests, building your profile - that's when shit hits the roof.",
    "Probably wait for isa and esa... Thats all... projects and assignments they will give 1 week before isa so when pressure will hit, it will hit from every side....at the starting its chill I guess...update me after few days after isa",
    "Sem 5 is one of the most hectic sems....as per usual you have projects, assignments, certification, hackathons(in some courses), depending on the electives the difficulty and amount of work varies....along with that you start to attend summer internship tests and capstone starts as well..",
    "Each subject will be packed with info you need to memorize. Have to be on top of grades, getting anything less than C will affect the GPA. And first year matters...my class had a bad first year experience that affected rest of collage."
  ]
}