{
  "title": "Vent/rant (PES and research @ PES)",
  "content": "I'm a 3rd-year student at PESU-RR, and I'm uncertain if PES made the right decision by starting Capstone Phase 1 in the 5th semester. I'd appreciate it if seniors could share their opinions on this.\n\nHandling everything has become incredibly hectic—hackathons are being conducted for internal grades in ML, DA, and DBMS, along with the constant load of worksheets and labs. I’m not sure how things are at other colleges, but this workload feels overwhelming. I barely have time for the \"LeetCode grind\" needed for placements.\n\nI interned at one of the centers at PES, where there's constant pressure from stakeholders to produce a research paper. However, I’m not satisfied with the project results, and I simply don’t have the time to revisit and improve the work.\n\nMy belief is that a quality research paper holds far more value than one published \"just for the sake of it.\" (Correct me if I’m wrong.)\n\nPES and the professors pushing students to publish papers just for NAAC grades or certifications—and framing this as a \"GOOD RESEARCH ENVIRONMENT\"—doesn’t feel right, in my opinion.\n\nJuniors can consider this post based on the reactions and opinions of my batchmates and seniors before deciding on internships at these centers.\n\nDo share your opinions if u feel like it!",
  "metadata": {
    "id": "1gf3szv",
    "author": "[deleted]",
    "url": "https://www.reddit.com/r/PESU/comments/1gf3szv/ventrant_pes_and_research_pes/",
    "permalink": "/r/PESU/comments/1gf3szv/ventrant_pes_and_research_pes/",
    "score": 62,
    "upvote_ratio": 0.98,
    "created_utc": 1730231709.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "You’re right about the research environment here- they only seem to be concerned with publishing maximum number at at scopus indexed journals followed by conference (for NIRF sake), regardless of quality where it’s published. They are not concerned with what outcomes this leads to for their students. It’s pretty unfortunate but I’ve come to not expect too much of this place.\n\nComing to 3rd year being hectic, that’s absolutely true and the batches till now just try and survive through it. I’m not sure what they can change for that, it’s not like capstone or placements can be removed, and the subjects will also be more specialised than earlier years naturally. Only thing I can say is stay strong because 4th year will be very chill if you do 3rd year right.\n└── Yeah exactly \n\nThanks for elaborating on the workload/capstone stuff,.I'll Definitely stick to your suggestion abt managing it!",
    "&gt;I interned at one of the centers at PES, where there's constant pressure from stakeholders to produce a research paper. However, I’m not satisfied with the project results, and I simply don’t have the time to revisit and improve the work.\n\n  \nSame OP. I interned in the summer at one of the labs and the pressure to produce an IEEE paper in 4 weeks was so much. We did finish it and gave all the deliverables we had promised but our guide rejected it calling our project trash and we ended up not submitting the paper despite writing it. Research needs time and patience for quality results, PES is only obsessed with producing papers but not with producing quality work.\n└── Same here dude, we were humiliated in the review and that was really demotivating.",
    "Hi, although your perspective is justified, the issue you are highlighting is an issue with private colleges having engineering programs.\n\nYour research paper is right now a metric for colleges to get admissions, we have XX research papers published. Hence, when quantity is the priority, the quality goes for a toss\n\nA solution to this could be approaching the issue in 2 perspectives, doing research for your degree (PES) and doing research because you want to do it. These 2 approaches need to not be done at the same time, after you complete your degree, you can always continue the research.\n\nTreat them separately and ace both of them independently\n└── Yes I agree with your POV too.",
    "Since you are in your 3rd year focus on what's important for placements drop other activities\nMake sure you do well in your course work to maintain your GPA\nmake a habit of practicing leetcode everyday\nWhenever possible like on weekends study other concepts that will be asked in interview like system design etc\nThe grind will be worth it\n└── Ah sure,noted\n\nWill work along these lines, thank you!!",
    "You can focus on finding your topic in 5th sem, do the literature in 6th. Its better to start as early as possible so no problems occur. I started a bit late and had to rush later and it was no fun.",
    "Its better if you start as early as possible so u don't have to rush later.",
    "I can't be more proud 🥹 as a senior (super senior) that my juniors understand what good research environment is and what good research is already at a bachlors level. \nTook me an entire PhD to realize it 😂.\n\nBut on a senior note, for those doing it for jobs only your conference papers are useless in your interview unless you are solving a genuine problem and know it in and out. Basically a good project.\nAnd if you have plans for MS aboard then in that cause while yes Scopus is better than nothing instead of 5 Scopus try one Q 1/2 journal in 3 years and you'll be way better off. \n\nAs someone sitting in the admissions for a foreign university now I can tell the brownie points the students for research is based on the fact that they would be a grad research student which a prof can use and may even pay a stipend to through his funding during your studentship. \nFor Indians students now days they see almost everyone have one or two Scopus and ground reality is they don't know anything so if you are doing it for MS better do one good work and present in a leading conferences or a journal if you are lucky so they know you are aware of what good research is.\n\n\nAll the best🙌"
  ]
}