{
  "title": "17 Days to ISA. How to go about it?",
  "content": "Chem Cycle",
  "metadata": {
    "id": "1gh64k5",
    "author": "[deleted]",
    "url": "https://www.reddit.com/r/PESU/comments/1gh64k5/17_days_to_isa_how_to_go_about_it/",
    "permalink": "/r/PESU/comments/1gh64k5/17_days_to_isa_how_to_go_about_it/",
    "score": 18,
    "upvote_ratio": 0.95,
    "created_utc": 1730469743.0,
    "flair": "Study Help :table:",
    "nsfw": false
  },
  "comments": [
    "For math, practice as many problems as you can because you need to be fast.\n\nEverything else is comparatively chill. They will usually not ask anything that isn't in the slides.\n\nAnd please for the love of god don't forget to bubble the question number on top of each sheet. I didn't do this in my first exam and endes up losing marks.\n├── where do you practise problems from in math?\n│   └── Classwork and assignments.\n│       └── didnt get any assignments so far. only classwork. is that enough?\n│           └── I meant the assignments tab in pesuacademy\n└── hey what do you mean by bubbling the question number on top of each sheet? I dont get it\n    └── At the top of each answer sheet, there are circles to fill in for marking the question numbers. They'll brief you about these things before your exams.\n        └── okay, thank you",
    "Literally just do slides and solve qs from qb /mcqs. math maybe practice more from your tb. statics do the problems in the tb. if you start now, can easily get 30+ every subject.\n└── How hard is 35+\nLike how many people get it\n    └── Really depends on the subject and how hard the paper is. In some hard subjects there'll be less than 10, for others it will be 100.",
    "slides must be enough, but yeah dont miss out on assignments/qb as well",
    "Do the slides properly, for maths qb which is on pesu academy , and do questions from tb for mechanics",
    "Just chill till the last day and pull an all-nighter….\n\n\nHope this CORRECT study technique helps!!"
  ]
}