{
  "title": "Dumb questions pls don't mind ",
  "content": "There is credit for each subject ryt is that given after esa or its applicable for isa too ? This SGPA and CGPA also given after esa or isa Or wt ? Wts difference b/w  sgpa n cgpa ?? There r 6 sub in sem 1 but there r only 5 days alloted for isa y so ?? ",
  "metadata": {
    "id": "1gk7odk",
    "author": "Ok-Cable-1977",
    "url": "https://www.reddit.com/r/PESU/comments/1gk7odk/dumb_questions_pls_dont_mind/",
    "permalink": "/r/PESU/comments/1gk7odk/dumb_questions_pls_dont_mind/",
    "score": 6,
    "upvote_ratio": 0.88,
    "created_utc": 1730816158.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "1&gt; For physics cycle, EVS is along with mechanical     on the same day (correct me if I'm wrong)\n\n2&gt; Sgpa is for a particular semester, while cgpa is cumulative score of all the semesters (again correct me if I'm wrong)",
    "&gt;There is credit for each subject ryt is that given after esa or its applicable for isa too\n\nAfter esa . Cumulative score. \n\n&gt;This SGPA and CGPA also given after esa or isa Or wt\n\nCumulative \n\n&gt;Wts difference b/w sgpa n cgpa\n\nSgpa is given every semester. And cgpa is as the name says cumulative of it\n\n&gt;There r 6 sub in sem 1 but there r only 5 days alloted for isa y so\n\nI have suffered enough in this college I don't remember what happened in my first sem 😭",
    "If you’re in chem cycle, you’ll have 2 exams on the day of mechanic statics\nIf you’re in physics cycle, you’ll have 2 exams on the day of mechanical",
    "Read the FAQs, its documented in detail. The FAQs are linked everywhere on this subreddit - from the home page to the community guide.",
    "Does constitution subject counts in cgpa and sgpa?\n└── Yes. One credit.\n    └── Isn't it two from this year?\n        └── Wow, it is? For my batch it was a single credit.\n            └── Yes!!",
    "Sgpa is for the semester: average of all grades in a semester, this is fixed. Cgpa is cumulative: average of all semesters upto your current one, this keeps getting updated."
  ]
}