{
  "title": "Ideal time to start dsa?",
  "content": "Due to the shortened semester and the additional classes for 2nd round students, I am struggling to find time for coding. How did you all manage your schedules when you were in your first years? Because every day I just come back home and study mech/python/math/ee/phy. I am not getting time to do things other than studying these. How did you all manage this? It doesn't feel hectic studying these subjects, but doing extra things other than this is definitely hectic and isn't manageable at all..\n\nAnd what should I start with after learning a coding language? Should I start DSA? Every senior I ask tells me to explore things and find it on my own... But what exactly does exploring mean? Can someone explain the meaning of this sentence, please?",
  "metadata": {
    "id": "1gkximp",
    "author": "[deleted]",
    "url": "https://www.reddit.com/r/PESU/comments/1gkximp/ideal_time_to_start_dsa/",
    "permalink": "/r/PESU/comments/1gkximp/ideal_time_to_start_dsa/",
    "score": 21,
    "upvote_ratio": 0.93,
    "created_utc": 1730896650.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "CS is a vast field. There are many domains and fields out there and not everything will interest you. It's important to figure out where exactly your interest lies before the final year so that you can build a profile aligned with your interests and hopefully land a job in the same field. \n\n\"Exploring\" essentially means to explore what's out there, find out what interests you (usually by finding out what *doesn't*) and then learning and upskilling in that field by working on projects and picking up experiences. \n\nBlindly doing DSA will only help you clear OAs, but to actually do well in interviews, you're going to need to have a good profile that matches what the job is looking for. DSA will simply get one foot through the door, the rest is up to your skillset. \n\nThere are more detailed comments on this topic if you search the sub with relevant keywords, mostly posted by me.",
    "Start in sem 3,we have a dsa course itself",
    "\nTL:DR: 2nd year summer break if sure that getting placed is the only goal for now\nElse, maintain a balance throughout and dedicate free time \n\n\n\nIm a 3rd yr student haven't cracked any internships yet, my opinion on this based on mistakes I did would be:\n\n1.For internships also it's really important, almost all the OAs till now had atleast one section of DSA/coding/algos \n\n2.A lot of basic concepts required will be taught to u by the end of 2nd year,so instead of prioritising internships at centers at PES during 2nd yr summer break you can safely go ahead with grinding leetcode and brushing up with OS/CN/ learn SQL/DBMS so that you are well prepared for 3rd yr summer break internships at good companies\n\n3. Just grinding DSA throughout your engineering will definitely help you in honing your thinking ability (to properly come up with a solution to a given problem and model it accordingly) but it's very important for you to know how to build something by referring to research papers or something in general that is capable of solving a case scenario and hence developing something is also equally important \n\n4.keep your curiosity alive by reading papers and exploring development stuff as well bcz converting a hypothetical question (leetcode ques) to algo is different from converting a real life situation to algo \n\n5.plan slightly, if you can build up a strong resume/get influence and get into IITs/NITs for 2nd year summer internships then you'll have to do DSA alongside the internship\n\n6.DSA helps in overall algo building and thinking perspective, other subjects from 2nd yr are also important for internship OAs and DBMS which isn't taught in 2nd yr is also imp so make sure to learn it atleast the basics\n\n\nRelax n take a break OP, take sometime for urself and family friends, you are just out of a tiring race of competitive exams, it won't be beneficial if u look at all the subjects from now on as a competition.So proceed with a balance\n\n(Ik OP is a 1st yr student but I feel this may help other 2nd yes looking for smtg similar)\n└── Mann thank you so so much, this was much needed 🙏",
    "Damn, so relatable.\n\nFor the first 3 weeks of college start I never studied those 1 sem irrelevant shit. Only spent time working on small projects and lil DSA. But now exams are on the way so 🤷"
  ]
}