{
  "title": "Cie attendance",
  "content": "I have very low attendance in CIE course (2 credit special topic) is it an issue?",
  "metadata": {
    "id": "1gmcehb",
    "author": "Kitchen_Dare_6675",
    "url": "https://www.reddit.com/r/PESU/comments/1gmcehb/cie_attendance/",
    "permalink": "/r/PESU/comments/1gmcehb/cie_attendance/",
    "score": 18,
    "upvote_ratio": 1.0,
    "created_utc": 1731047745.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "If your prof is lakshmeesha (ec campus) you can talk your way through. If it is sathya (rr campus) you're cooked",
    "How much do you have?\n└── 30🤡\n    └── I have 70 man I hope they let me write esa 😂\n        ├── Same... Hopefully we have two classes left, right??  😭😭😭  \nShould barely scrape by in that case\n        │   └── I think we have 2 classes left\n        └── Not helping man😭😭😭\n            └── Nah so many people bunked cie classes, im sure youre not the only one. Many of my friends have below 50.\n\nThese dumb fucks should have updated attendance every week. What the fuck do they get out of uploading attendance suddenly at the end of the semester.",
    "I attended almost all classes except 2 and my attendance is 50% 😭",
    "Just attend quiz \nNo need to listen to the class\n\nI just attended a quizzes.... I got 💯",
    "We were never even able to attend 1 class also out of that 4 which they took 🤡",
    "If your prof is Lakshmeesha ( ec campus) you can talk it off. If it is sathya (rr campus) you're cooked",
    "It depends on how lenient your teacher is. But usually if your attendance is below 75%...then you have to worry.\n└── whom can i contact bro , i have 50 so little screwed ( RR )\n    └── Depends on your teacher. Sometimes they let people write something to make up.",
    "Our class has NA still on that sub, so chilling, she doesn't take attendance too, so peace :))",
    "How will CIE attendance contribute to our grades? Will they also check if our answers in the quiz is correct while grading us ?",
    "Attended 4 cls still got 90% attendance :)\n└── Not sure if you are on the same page as the rest\n    └── True brother"
  ]
}