{
  "title": "Roommate woes",
  "content": "My mf roommate roams in a chaddi every. He doesn't even change it daily and he stinks alsoo. Daily I've to see his same blue chaddi. He throws wet clothes in the room and it stinks like fucking hell. He looks worst than that raju in chota bheem. It's soo embarrassing when my friends come to my room😭😭. My other roommates are also irritated with him but he don't listen ",
  "metadata": {
    "id": "1golqxs",
    "author": "LastAssociation9694",
    "url": "https://www.reddit.com/r/PESU/comments/1golqxs/roommate_woes/",
    "permalink": "/r/PESU/comments/1golqxs/roommate_woes/",
    "score": 121,
    "upvote_ratio": 0.97,
    "created_utc": 1731305847.0,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false
  },
  "comments": [
    "Start roaming around in your chaddi too. Then you both can be chaddi buddies\n├── freaklet era rn\n│   └── i guess the west does have side effects in a way or another/\n└── your comment got more upvotes than the post itself. hecker hai bhai hecker\n    └── ![gif](giphy|26tn1ToaMhpOEetkA|downsized)",
    "assert dominance by walking naked instead\n├── I second this.\n└── Bruh💀",
    "Bro I died laughing reading this in the middle of class🤣",
    "https://preview.redd.it/jce5f029780e1.jpeg?width=1079&amp;format=pjpg&amp;auto=webp&amp;s=d0aa07f2a2c1b66386ddee44f552367890d8e8b4\n\nA fellow fresher at Pes",
    "What has this sub turned into",
    "Tell the same thing whatever you’ve told here to him lol. Call out their disgusting habits or else it’s gonna be hell moving forward",
    "Bhaisahaab what is this 😭😭😭😭😭😭💀",
    "Sniff it daily so that your senses become numb to it. And who knows one day you might miss it as well.\n└── Stfu nigga",
    "Ik bro NB516 😭😭\n└── Bro doxed 3 ppl at the same time 😭",
    "Bhai kisi din halka sa laal mirch daal de....\n\nFir sb saaf ho jaega 💀",
    "if in doubt kick him out lmao",
    "assert dominance by sleeping on his wet clothes",
    "So relatable, asf\n└── Wdym by relateble😭\n    └── Wait, are you talking about me?? 😳😳\n        └── Nah don't tell me u roam in a blue chaddii😥\n            └── It's more of a violet shade but okay 😔",
    "https://preview.redd.it/r3q021kf0a0e1.jpeg?width=1079&amp;format=pjpg&amp;auto=webp&amp;s=1c1f4b9b38fa8edc15a1cd3c53e7bfb281884ab0\n\nTharki saala, abhi bhukto",
    "Bro if it is jockey then burn it with respect\n└── That mf ain't cultured enough to wear jockey",
    "Have a talk with him. Report someone, ask for another room. Or wait it out next time you probs won't be rooming with him again."
  ]
}