{
  "title": "Alcoding Club -&gt; Going downhill to hell",
  "content": "Alcoding Club was decent to good till last year and great 2 years back... Now these new club heads have made it shit 😕. They don't know what competitive programming is at all, just running behind useless things.... Do this do this.. Can i get sign from here... Blah blah... \nI can't do anything but just hope they again try to make it a coding club instead of just  useless stupid chat club 😐. ",
  "metadata": {
    "id": "1gpaz3n",
    "author": "Famous-Meal1368",
    "url": "https://www.reddit.com/r/PESU/comments/1gpaz3n/alcoding_club_going_downhill_to_hell/",
    "permalink": "/r/PESU/comments/1gpaz3n/alcoding_club_going_downhill_to_hell/",
    "score": 49,
    "upvote_ratio": 0.93,
    "created_utc": 1731380392.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "This subreddit is actually growing wow!  \nWe have club feedback and stuff now\n\nCrazy",
    "Tru 100 percent",
    "Hello! im sorry you feel this way about our club, its true that outside of the online coding contests, we havent really done many competitive programming related events this semester, but we do have a bunch of competitive programming events planned for next sem, for now though, if you are interested, we do a bunch of other activities too, we have a workshop on containerization in rr campus tomorrow, you can register for it here :- [https://linktr.ee/thealcodingclub](https://linktr.ee/thealcodingclub)\n\ni didnt really understand what you meant by the chat club part, i have to assume you mean the alcoding cafe, which is just a community gc of all students interested in the club and is open to everyone; not just club members\n└── Well me and my friends would be happy see more on competitive programming too. \nIt wasn't just me but many felt the same way so posted . \n(Chit Chat I meant, we are seeing too much other stuff rather than coding) \nCoding was the main agenda for this club 🙂, hope it improves :)\n    ├── DON'T ABBREVIATE ANYTHING TO CP PLEASE\n    └── we'll have more competitive programming in the coming semester, again, i apologise if you found the last semester unfulfilling,\n\n  \nalso our club doesnt do much non-coding stuff.... are you referring to the recruitments events?"
  ]
}