{
  "title": "Rant and my opinion: Capstone takes away the joy of doing projects because of the paper publication compulsion. ",
  "content": "A Capstone project should be a culmination of four years of college. It should allow students to show what they have learnt and how they used their knowledge to build a well-planned, tangible and meaningful project.   \n  \nI love doing projects. Be it mini-projects or building for hackathons, my teams over the subjects and I have done it on our own with minimal help from AI tools.\n\nHowever, everything in the Capstone project is looked at through the lens of \"Research\", all our work amounts to naught and we are compelled to exceed the base paper's metrics by hook or crook. I know, I know. We will be entering the workforce soon and we have to adhere to metrics and standards. But this excess pressure on research forces people to fake results and come up with nothing new of value. The college should encourage working on industry-related projects and even help inculcate the mindset that research isn't something you have to get right on your first try which is very true in the real world. ",
  "metadata": {
    "id": "1gpjlc5",
    "author": "[deleted]",
    "url": "https://www.reddit.com/r/PESU/comments/1gpjlc5/rant_and_my_opinion_capstone_takes_away_the_joy/",
    "permalink": "/r/PESU/comments/1gpjlc5/rant_and_my_opinion_capstone_takes_away_the_joy/",
    "score": 82,
    "upvote_ratio": 1.0,
    "created_utc": 1731414547.0,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false
  },
  "comments": [
    "U raise a valid point, research is not something that u just get right. But how would u like the college to inculcate that mindset?\n├── Part of it comes from your mindset. This research problem- it's not a PESU only thing actually. This is widespread in India except for some T1 colleges.\n\nPESU has so many people in academia. I'm sure PESU has also contacted people who specialise in Learning Design since they keep changing their methodology so often.\n\nOne way I can think of improving this is by making students start out as research assistants and get the hang of it, hold their hand and slowly let it go. When you intern with a well-known research institute like IISc, do you notice how students are always taken in as assistants and not the main researcher? Exactly that.\n\nIt's also a good idea to not restrict the work of PESU centres to just summers- research is a long process and not something where your results are seen in a few months unless you know your field inside out. Undergraduate research around the world or in any field isn't as common as you think, actually and its important to give undergraduates room to learn instead of churning out papers at a high speed.\n└── \\~\\~By improving people's spelling?\\~\\~\n\nIMO like being a \"great\" engineer, its not something that is teachable, it is something that comes from within.\n\nWhat \\_can\\_ be done, is to make incentives favor skill development.\n    └── You are still being vague. How do you make the incentives? \n        └── Don't think you can expect a student to do anything when PESU has so many academians and other people who determine the curriculum and pedagogy. Most teachers want their free 3-8 publications a year.\n            └── Start removing teachers names from projects which are published locally for the sake of publishing, and the teachers name can only go on the project if there has been over a year's worth of research(aka longer than capstone).. automatically you will start getting better papers\n                └── That might not help, it just makes guides more elitist I feel and that would change the focus from a culmination project to an international publication. Teachers will still ask you about the novelty in your work and make a big scene if there is none. I’m sure there are also countries outside India where predatory conferences exist, so nothing changes at all.",
    "Valid points and I agree with everything. Capstone is being used as an excuse to churn out more papers.\n\nReminds me of my rant from last year: https://www.reddit.com/r/PESU/s/71eYCPuRMZ\n└── I agree with everything you said! \n\nIt severely undermines the reputation of Indian researchers, even the ones who are doing well. Why is there serious brain drain in India? Part of it is because a lot of students interested in research are seeking out greener pastures because of the quality of research here. Vaswani was from BITS iirc but his breakthrough happened in the USA. \n\nOh and the double publications thing annoys me to no end. I know a team who refused it because it was a lot of pressure but the guide was so angry.",
    "A very valid point. The number of times I've been asked \"what/where is the novelty\" by guide and panel.... I've lost count at this point. And to add to the whole mess, you end up with non cooperative team. Remember the part where they say PES trains you to meet industry standards? So far I've definately learnt how to deal with a disfuntional team.\n└── I relate to this so very much! \"Where is the novelty?\", when is the last time you(the person who asked me this; a panel member and an academian) came up with something novel without needing to rely on a group of 20 year olds who are overwhelmed and new to the ins and outs of research? \n\nBy the way, my team and I have vastly different working styles- I like making slow incremental changes over a long time while my peers are people who work days before the review. I've learnt how to deal with that and that's the best lesson I have taken home through this project.",
    "I swearrrr",
    "I totally agree with you",
    "True not to mention true research takes decades to master. Doing something in like 2/4 years will produce shit results. And we can't even complain when teachers questions such dumb questions...like if you point that out itll reflect badly on you. Like chill this is our first rodeo."
  ]
}