{
  "title": "Placement statistics?",
  "content": "Many colleges like iiits put their median, average salary of students placed on their web. But PES doesn't, where do yall check to know this info of placement stats from previous years. Just asking if anyone knows",
  "metadata": {
    "id": "1gqfh27",
    "author": "CherryOk4647",
    "url": "https://www.reddit.com/r/PESU/comments/1gqfh27/placement_statistics/",
    "permalink": "/r/PESU/comments/1gqfh27/placement_statistics/",
    "score": 12,
    "upvote_ratio": 1.0,
    "created_utc": 1731511801.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "just check out the sub, seniors maintain an excel sheet of it.  \nalso a lot of the stats those colleges put out are prolly a bit skewed at the very least.   \nThese ones are maintained by students so are quite trust worthy.",
    "I had calculated median and average for 2025 batch last month, it was around 19 and 22 respectively. It should be slightly lower now as more tier 2 recruitment has happened. But only around 60% or so of CS is placed till now so it will fall still. Either way it’s miles better than last year, number of tier 1 offers is already more than last batch’s in 3 months of placements.",
    "As someone else commented, students here maintain the placement records. You can find them on this subreddit by searching with relevant keywords. A quicker way is to go through my post history and look for the PESSAT branch cutoff post. The comments under that post have the sheets linked for various batches.\n\nEdit: Here is the comment: [https://www.reddit.com/r/PESU/comments/1ct5ujc/comment/l49p42j](https://www.reddit.com/r/PESU/comments/1ct5ujc/comment/l49p42j)\n└── Can u plz update the comment and add the 2025 stats as well\n    └── I don't have the link to it. If you do, share it with me and I'll update it.\n        └── https://docs.google.com/spreadsheets/d/1TfR17y3iPGzHFmCfWGwAXBpwCHvbxEK0wOP_Kx8FOG8/edit?usp=drivesdk\n\nHere it is\n            └── Done",
    "Search this sub\n└── https://www.reddit.com/r/PESU/s/GHYAbPBQbd",
    "This data is too skewed around the web, I've found multiple sources with each a varying answer for this\nWhy doesn't pes itself post the official data like the other colleges do"
  ]
}