{
  "title": "Convocation for 2020-2024 batch People!!!!",
  "content": "Hey people of PESU’24,\n\nWhen is our convocation, guys?\nSeriously, did they even remember our batch? Lol.\n\nDuring college, we were the experimental batch for them, the test group for everything they tried!\nNow, it feels like they don’t even want us to have a proper send-off.\n\nIt’s like we went through all the twists and turns of the pandemic, online classes, hybrid learning, and all those last-minute changes... and now we’re just being forgotten!\n\nAnyone else wondering if we’ll even get the chance to walk across that stage? I mean, we deserve it, right? 😅\nWe might not have had the smoothest ride, but we sure made it through. ✊ \n\n#Pesu24Convocation",
  "metadata": {
    "id": "1gtcbew",
    "author": "Suspicious_Code1493",
    "url": "https://www.reddit.com/r/PESU/comments/1gtcbew/convocation_for_20202024_batch_people/",
    "permalink": "/r/PESU/comments/1gtcbew/convocation_for_20202024_batch_people/",
    "score": 42,
    "upvote_ratio": 0.98,
    "created_utc": 1731845779.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "Brother at this point I don't even give a fuck about send-off. I'm ready to go in pajamas and get that final degree from that ground floor office in BE block. No need for any convocation no chief guest no jackshit. Just go there take it and come back home\n├── Lol even i am done waiting. \n\nBut just want to get it done with the PESU for one last time.\n│   └── Best case would be them just sending that certificate by speed post or something to my address. I am even ready to throw money on their face.\n│       └── Definitely they are gonna ask money :)\n└── Lol, even I am done waiting. \n\nBut just want to get it done with the PESU for one last time.",
    "The usual reason for delays is scheduling conflicts or not finding a chief guest (they're very ambitious sometimes), or both\n├── But yea they should do it at right time, Most of the ppl went abroad as well !\n└── I had asked my mentor in September, she said they are waiting for availability of chief guest, latest by November first week it will be done she said, we have almost come to 2024 end.",
    "doesnt convocation normally happen around sept-oct?\n└── Yes usually they do around that time ,\nBut dunno y they didn’t for us :)\n    └── Either they didnt find a chief guest, or there might be too many things clashing\n        └── No clue !\nthey are not even giving us the approx date",
    "Dude, I saw orange color notification with pes logo and this title and I freaked out, that maaybe finally we get the news -_-\n└── Lmao \nBut yea no news abt that yet :)",
    "But yea they should do it at right time,\nMost of the ppl went abroad as well !",
    "Bro these people are just so annoying. They won’t tell you concretely if it’s even going to happen. Like bruh just tell us if it’s even happening or not. Anyways I’m past the point of giving any fucks about the event atp.\n└── Exactly,they are like we don’t know!",
    "We asked this question on our official groups and one of our teachers said November and then immediately deleted it because he realised he messed up. It's not confirmed but it could be in the end of November or first werk of December. But then again, we would've probably got some notification if it was confirme\n└── Lets see :)",
    "I only hope they don't do some online shit. I mean won't most people go abroad for higher studies n stuff. At this point Idc about it.\n└── Only hope 🤞"
  ]
}