{
  "title": "Exam starting late",
  "content": "So my exam was at 12 and they let everyone in to the mech building at  ≈12:00 and i dont have a track of time after that but it took me a while after that to reach my exam room. They just gave us the answer booklet and sent us to our desk, and we hade to fill in details while the time was running out, by the time i started solving the time was already down to 50mins.   \nIs it always like this? Do u not get time before exam starts to fill in the details on the answer sheet?",
  "metadata": {
    "id": "1gu1kxq",
    "author": "Subject_Ingenuity375",
    "url": "https://www.reddit.com/r/PESU/comments/1gu1kxq/exam_starting_late/",
    "permalink": "/r/PESU/comments/1gu1kxq/exam_starting_late/",
    "score": 15,
    "upvote_ratio": 0.94,
    "created_utc": 1731924826.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "if the exam starts at 12\nthen irrespective of when you show up it starts at 12 you got to fill details empty pockets right the paper all within that time\njust come like three minutes early you can fill in and start the paper at 12\nplus they any way made the duration of the exam 65 minutes for this very reason\n├── We had bouncers stopping us from entering the mech building man\n│   ├── ideally in rr they let like 5-10 minutes before the paper starts\n│   ├── Why so? They should have given you guys extra time in that case to make up for it.\n│   │   └── This was in ec btw\nI didn't wanna waste further time debating so didn't complain\n│   │       └── Nah I was just wondering because they always let us go early and give enough time before the exam starts to let us fill in details. If they didn't do the same for u guys that's insane\n│   │           └── They did not give us any time before it all all, and it was my first time so i was a bit unsure about what to fill, so it took away a decent amount of time.\n│   └── Should we complain to someone about this?\n└── I was on time, they did not let us in. I waited for nrly 20 mins outside mech building.",
    "I know of one dude who lost 10mins of exam-time just because they had exactly enough answer booklets for the whole class EXCEPT HIM. Yeah, these kinda things happen ig"
  ]
}