{
  "title": "Does this apply for this sem as well? (Asking for a friend)",
  "content": "",
  "metadata": {
    "id": "1gu623h",
    "author": "me_da_Supreme1",
    "url": "https://i.redd.it/qq46n2qu7o1e1.png",
    "permalink": "/r/PESU/comments/1gu623h/does_this_apply_for_this_sem_as_well_asking_for_a/",
    "score": 13,
    "upvote_ratio": 0.88,
    "created_utc": 1731940393.0,
    "flair": "Study Help :table:",
    "nsfw": false
  },
  "comments": [
    "Nope. This was only applicable during COVID when PES enforced offline exams but provided a margin of flexibility. I know this cause it was applicable during my batch. This was rolled back in 2021 itself to the pre/post COVID policy which states that if you skip an ISA, it's a 0 for that ISA. If you skip ESA, it's a backlog.\n└── Oh alright thanks for clarifying !\n    └── just curious about what option you chose lol did you prefer the comparatively easier marks in isa  whilst risking covid infection or did you chose to stay safe. I remember my elder sibling copying in every exam cuz she studied in a vtu college and all her exams were conducted at home. PESU prioritizes academic integrity more than the safety of its students. Curious about how did the students react to this too\n        └── Students reacted against offline ESA during COVID. Scroll back to posts and comments from 2020-2021, you will see multiple rants. We even posted on subs like r/bangalore for attention. Nothing happened. \n\nTo answer your question, I stay in Bangalore. So I chose the ideal situation of giving ISA 1 + ISA 2 + ESA since it decreased the risk of screwing up a single component. Most people preferred the ideal situation, followed by skipping ISA 1.",
    "No lol absolutely not. It was done during covid since people couldn't attend exams due to lockdown I guess.",
    "No. If u miss an ISA you need to write to the COE or VC or Pro chancellor to request for higher weightage for the next ISA. If you miss both u will need to request for ESA having full weightage. Afaik the first case has been granted to some people, but I do not know about the latter.",
    "One of my friends last sem couldn't attend an ISA because the traffic was so bad from the place he was coming from, even though he left at 8 or something (exam was at 10:30/11), he couldn't even reach metro by 11. Stuck in the traffic for 3 hours. He asked the HOD as to what to do, and they told him he'll only be evaluated according to ISA 1 and the ESA. Look, I don't know what's your case to actually miss an exam, but make sure you have a good one, like my friend had. Oh, and being sick is not going to work as an excuse lol"
  ]
}