{
  "title": "Moving out of hostel",
  "content": "If I ask for refund for next sem, will it be possible?\nCan someone please help, I am messed up in hostel, I have 3 roommates, 2 other girls are also in my room the whole time. I can’t study a word there, the room is so messy, after a tiring day, if i wanna come lay down on my bed, can’t even do that cos someone or the other is sitting there. They are so loud even during ISAs , Keep on talking, I can’t go to study hall too as majority of the girls just come up there to gather around and laugh at silly jokes.. I had so much expectations from myself, I couldn’t even study..\n",
  "metadata": {
    "id": "1gusld0",
    "author": "Ghost_busters26",
    "url": "https://www.reddit.com/r/PESU/comments/1gusld0/moving_out_of_hostel/",
    "permalink": "/r/PESU/comments/1gusld0/moving_out_of_hostel/",
    "score": 25,
    "upvote_ratio": 0.97,
    "created_utc": 1732005013.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "Trust me these hostel people are complete chuts. There won't refund shit. I'm sure if someone tragically passed away also their parents wouldn't be refunded for the remaining sem",
    "I don’t think so they will refund you for one semester!\n\nYou will only get your CAUTION DEPOSIT amount back thats it ig.\n\nConsider changing room for next semester.\n\nYou can leave hostel for next academic year may be :)\n└── Even If I am actually diagnosed with OCD, won’t they consider that? \nI can’t live with people in the same room, till now I was managing but can’t mess up next ISAs",
    "For sem 2, just be in the hostel in normal times and travel from home (if you are banglorean) for ISAs and ESA. This way, you won't waste the money and you can achieve more also. Win win!!\n\nIf you aren't banglorean, idk what to do, I'll figure it out and tell 🫠\n└── I am not banglorean unfortunately \nPlease figure out nd tell something 😭\n    └── You can stay in your local guardian's home i guess? Travel from there only during exams maybe?",
    "Hi , so I have a question here if hostels are pretty bad then why not opt for 1 rk i was searching over no broker i would get decent 1 rk around 7or 6 k .",
    "Buy a noise cancellation earbud. You need to learn to manage.\n└── I am trying to, from past three years, I have studied alone , it’s really hard and then they are too loud\nI already get panic attacks during exams"
  ]
}