{
  "title": "Did anyone else's seating info change?",
  "content": "",
  "metadata": {
    "id": "1gvfqu9",
    "author": "DesperateUncle619",
    "url": "https://i.redd.it/kvy3abvj2z1e1.jpeg",
    "permalink": "/r/PESU/comments/1gvfqu9/did_anyone_elses_seating_info_change/",
    "score": 7,
    "upvote_ratio": 0.71,
    "created_utc": 1732071739.0,
    "flair": "Study Help :table:",
    "nsfw": false
  },
  "comments": [
    "It does change, dw\nMake sure you go to the new terminal, if any confusions check the attendance form in the room",
    "Your seating allotment *can* change within a single ISA (and ESA too). It is not uncommon. Always remember to double-check your seating allotment before the exam. There have also been multiple incidents of it getting updated a few hours before an exam, so the recommendation is always to check 30 mins before an exam as well.\n\nEdit: Fun side story since I'm bored and procrastinating doing my assignment: \n\nDuring my first ESA way back in Dec 2018, about halfway through my ESAs, my seating allotment had changed. However, I did not check it because, like most people, I assumed that it would not change. I entered the room, put down my bags, took the answer script, sat at my usual desk, filled in the essentials and when I got the question paper I started answering it too when the time began. For some reason, I did not notice that the people around me had changed, I was pretty focused on the exam. Here's the funniest bit: The person who *was* assigned to where I was seated *also* did not realise their place had changed, so they sat at their usual place which was a different class.\n\nSo initially, I sat at the wrong place and even they sat somewhere else. About 15 mins into the exam, someone enters the class and explains to the invigilator that they sat at the wrong desk and that they got kicked out by the invigilator of their class (and also showed proof that they arrived on time because they got the answer script and everything). They walk up to my desk and say \"This is my place\". I'm confused, the invigilator is confused and everyone is looking at us confused. Then the invigilator checked the seating arrangement of that class and it turned out I was indeed in the wrong class, so they promptly kicked me out. I had to then walk out after covering my face and quickly drag my ass to the correct room after checking my seating. Luckily the invigilator let me in without issues and I was able to carry on with my exam. Since that day, I developed an OCD to check my seating allotment 5 mins before the exam and I do it even now when I need to be somewhere at a stipulated time.\n\nMoral of the story: Always check your seating allotment, no matter how sure you are of it.\n├── Promptly kicked out was nice\n├── Omg\n├── wait can it change even after the seating info has come for the exam the previous night?  \nsay I have eee tomorrow and I received my seating info for tomorrow's exam  \ncan it still change just before the exam or during the exam ?\n│   └── How will it change *during* the exam lmao. What are you, Schrodinger's cat?\n\nBut yes, sometimes the seating allotment goes through changes and usually gets fixed only an hour or so before the exam. That's why - always keep checking and make one final check 15 mins before the exam.\n│       └── the results are gonna be like schrodingers cat :&gt;\n└── Hows that assignment going ?"
  ]
}