{
  "title": "Sgpa",
  "content": "How many marks should we get to score 9gcpa in every subject ",
  "metadata": {
    "id": "1gvlwoy",
    "author": "Mobile-Kiwi1370",
    "url": "https://www.reddit.com/r/PESU/comments/1gvlwoy/sgpa/",
    "permalink": "/r/PESU/comments/1gvlwoy/sgpa/",
    "score": 6,
    "upvote_ratio": 0.69,
    "created_utc": 1732095848.0,
    "flair": "Study Help :table:",
    "nsfw": false
  },
  "comments": [
    "He probably meant to ask what marks in ISA are good enough for being on track of getting 9 GPA",
    "If ur scoring 32+ in both isa's u'll need around 80-85/100 in ESA to guarantee 9 and above cgpa , so u can roughly use that logic to estimate ur marks. ( Also I assumed ur scoring 9-10 in assignments )\n└── Bruh i can only score 15-20 in isa 1 is it over for me 😭😭\n    └── Mathematically, yes. Screwing up ISA is as good as lowering the max possible grade you can get\n        └── Bro is there any possibility that i can get 8.5+\n            └── Let's do the math to get a 9 grade point:\n\nIf you score 20 in this ISA, then your ISA gets scaled down to 10. I'm also going to assume you have a full score in the assignments so that is a 10. A 9 point in a course corresponds to A grade, which is mapped to 80-89 marks. So you need at the very least, 80 marks. \n\nYou already have a combined 20 marks from ISA1 + assignment. You need another 60 marks from ISA 2 and ESA to get a 9 point in that course. An ISA can give you at most 20 marks (cause 40 gets scaled to 20), which means the remaining 40 marks needs to come from ESA. And to get a 40, you need to score 80/100 in ESA too. So if you score 40/40 in ISA 2 AND get 80/100 in ESA to get a 9, for an 8.5, you can score a bit lower. There are all possible combinations - \n\n1. ISA 2: 20, ESA: 100\n2. ISA 2: 30, ESA: 90\n3. ISA 2: 40, ESA: 80\n\nSummary: score 30+ next ISA and aim for 90+ in the ESA and you have a fair shot.\n                ├── Hey I just wanted a rough idea about how hard it is to score around 80-85 in ESA's , and what the class avg usually is ( just a general idea , because im not familiar with ESA's at all ).  Im pretty sure im getting around 34-38 in all subs in ISA1 and ISA2 as well.\n\nAccording to the calculation I need around 80 in ESA for a 9.4ish , how hard is that considering we have 1.5 months till it\n                │   └── ESA difficulty is usually similar every year. So if you check PYQs, it should give you a good idea about what to expect. Overall, it's hard to generalise if the ESA will be easier or tougher than the ISAs. In a few courses (especially in higher semesters), scoring in ESA is a little easier because of the type of questions and more flexibility in answering questions (and writing *something* for the answer). \n\nHowever, the general trend is that for *most* courses, the ESA is a bit tougher than the ISA. You'll always have 5-10% of the ESA paper comprising extremely conceptual questions which you might not have seen before in your slides or notes and require you to have a very good grasp on concepts to answer correctly - so memorising how to solve something doesn't help, rather you will need to know why you're solving it a certain way. Getting an 80+ in ESA isn't that difficult provided you study well for the exam and cover all the resources, but yes, if you're someone who only does the slides and minimises the resources needed to cover just to finish the syllabus, 90+ is difficult. \n\nIf you want to see class averages for the previous year, ask on discord. Someone can share the graphs of grade distributions across courses.\n                └── say I get 37 in a subject in isa1 so while reducing to 20 it becomes 18.5. do they consider the 18.5 or do they round off and consider it as 19 ?\n                    └── 18.5.\nAll rounding is done after your final aggregate is obtained out of 100.",
    "Marks  &gt;=80",
    "high duh in both isa n esa",
    "80+",
    "bruh first check FAQs"
  ]
}