{
  "title": "am i screwed?",
  "content": "https://preview.redd.it/5x4piql1h92e1.png?width=1558&amp;format=png&amp;auto=webp&amp;s=3ffe8e095d994563d444ed7f46db692f62ab1699\n\nhttps://preview.redd.it/4zlmr6hbh92e1.png?width=890&amp;format=png&amp;auto=webp&amp;s=247513e85baba7a1d13af7d8f1a3c6629c14da33\n\n",
  "metadata": {
    "id": "1gwh0j7",
    "author": "xAnnihilatoRx_",
    "url": "https://www.reddit.com/r/PESU/comments/1gwh0j7/am_i_screwed/",
    "permalink": "/r/PESU/comments/1gwh0j7/am_i_screwed/",
    "score": 11,
    "upvote_ratio": 0.83,
    "created_utc": 1732197837.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "Obtain a medical certificate, as this will require you to participate in additional classes to compensate for missed sessions. Additionally, consider searching for the Chrome extension \"Pesu Attendance.\" Once installed, navigate to the settings and adjust the attendance threshold to 75%. This tool will indicate the number of classes you need to attend or can afford to miss.\n└── Linking it here for others: https://chromewebstore.google.com/detail/pesu-attendance/aoblnnmlkcadhkdkocbanbcjndjlgiib?hl=en\n    └── Everyday I find some new pest invention which makes life easier here\n        └── As the saying goes: \n\n&gt;Hardship is the mother of PESt inventions",
    "Bro u have VK sir for mech ? Damn ur lucky, But u still have time to make up ur attendance, u are still in the first half, it doesn't matter for ISA make sure u have 75+ before ESA.",
    "Depends on how strict the teachers are.",
    "Well , I don't understand why many people who don't have experience with low attendance have to chime in, S and H is actually quite lenient with attendance given your attendance can be recovered. (I.e not below 60) \n\nYou should get a medical certificate if you can , and definitely ask teachers if they can give attendance at the end of sem , most of them indeed give if there is shortage (3 teachers boosted my attendance upto 85 even though hard requirement was 75) Worst case you'll have to go to remedial classes and build attendance back.\n\n\nBut if it's below 60 at the end of sem , you're cooked. Only medical certificate can save you.",
    "Medical certificate might save ya :)"
  ]
}