{
  "title": "What are your craziest PESU conspiracy theories?",
  "content": "One theory me and a few others have, and also somewhat subtly verified by some profs is that the 20 lab marks are not counted at all for final grade in 5 credit subject. These lab marks are never released on PESU app, and based on the marks in review too, grade seems to be based on internals + ESA marks(people with different lab marks noticing that their final grade is not affected by it). I'm not 100% certain about this but I think there is a high chance.\n\nAny other conspiracies y'all are aware of? Need not be related to academics.",
  "metadata": {
    "id": "1gwir4e",
    "author": "Lucian1729",
    "url": "https://www.reddit.com/r/PESU/comments/1gwir4e/what_are_your_craziest_pesu_conspiracy_theories/",
    "permalink": "/r/PESU/comments/1gwir4e/what_are_your_craziest_pesu_conspiracy_theories/",
    "score": 43,
    "upvote_ratio": 0.96,
    "created_utc": 1732205160.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "Doreswamy encroached the lake and built PES college there. It's not a conspiracy, it's a fact.\n├── its true I did\n│   ├── hi saar big fan\n│   └── Biggest celebrity to join the subreddit\n└── Are u talking about EC? U can go to Google Earth and see satellite pics from the 80s, the lake had the exact same size as it does now. Idk about RR\n    └── I am talking about RR. Ah, even EC wouldn’t be surprising",
    "The hospital is a front for organ trafficking\n├── Did you know ec campus has a graveyard\n│   ├── Ik about the mortuary, idk about graveyard\n│   └── EC Campus is a graveyard\n└── it is pakka",
    "This is less of a conspiracy theory and more of a fact. Most students get lesser than they're supposed to in their ESAs because many of the questions won't even be corrected and we're forced to put it for reval. It happens to people on the borderline too because they have to apply for backlogs too",
    "PES construction never ends cause of a superstition that something terrible will happen if they conclude the construction\n├── It's the tax benefits they get 💩\n│   └── Well that's smart af then, don't shit on PPL playing by the rules.\n└── I've heard of this one too!!",
    "lab marks are added thats for sure , i got a c in physics last sem , despite getting like 31/50 in isa+assignment and like 42 in esa\n├── Hmm it's possible that's because of moderation in marks vs grade. It's not impossible because I've got S in a subject where I got like 70s (out of 100 ISA + ESA) because everyone did horrible in that lol.\n\nBut yeah maybe it is counted, I'm mostly just speculating.\n│   └── It is definitely counted into your assessment marks. I did all my assignments well, everything to perfection, but messed up my lab exam terribly (submitted a blank paper, didnt conduct the experiment at all. Did my viva fine though). Everyone in my class got either a 9 or a 10 in their assessment.. I ended up with a 6 or 7. Grinded my ass for my isas esas lol ended up with a B.  \nSo ye,  \ntldr: they definitely do get counted\n└── 31+42 is 73 right &gt;70 is b grade right???\n    └── i got 42/100 dude , that wud be 31+21=52\n        └── Ohh I thought u got 42 for 50",
    "PESSAT is a scam and im like 90% sure they do some sort of rank manipulation.\n├── PESSAT is prolly one of the least manipulated exams in India, They have a very legitimate counselling process too. Idk a single person who claimed their performance was unexpected in the Exam, unlike for VITEE or Comedk.   \nU have to give credit where credit is due, Passat is legit. If they rly wanted to do rank manipulation they would have never switched to JEE, as the ranks are not in their control now.\n│   └── hello jawahar nice to meet you\n│       ├── Actually tho pessat is pretty legit all my friends got ranks somewhat according to thier jee ranks too so yeah it seems legit\n│       │   └── Who said jee was legit💀\n│       └── Liking ur own college is not a crime.\n└── Jealous 😂 \nHow tf do PPL just make such insane allegations.",
    "Biggest conspiracy, \"there are cute girls in pes\""
  ]
}