{
  "title": "Breaking News: Metro to E-City delayed again! BMRCL and GoK continue their streak of \"reliable\" deadlines",
  "content": "[Wait for metro to Electronics City extends as supply delays](https://www.newindianexpress.com/cities/bengaluru/2024/Nov/22/wait-for-metro-to-electronics-city-extends-as-supply-delays)\n\nWell, well, well, folks. Another day, another delay in the much-awaited Bengaluru Metro line to Electronic City. Remember when they said *\"January 2025\"*? Turns out that was just a warm-up joke. The new excuse: \"supply delays.\" 🤡 What’s next? Blaming Bengaluru traffic for delaying *the metro itself*? Or maybe the rain gods didn't give their clearance? BMRCL is out here playing the classic game of \"When will the Metro come?\" while all of us continue to struggle with Silk Board traffic. Meanwhile, the Karnataka government (aka Congress these days) is busy making promises louder than metro trains... if they ever arrive. At this rate, my future kids will graduate before I can take a metro ride to college. \n\nAnyone wanna bet on the *actual* inauguration date? My money’s on 2030.\n\nDrop your frustrations below, fam. Let's vent before we go back to our hour-long commutes. 😩\n\n",
  "metadata": {
    "id": "1gx7ld0",
    "author": "[deleted]",
    "url": "https://www.reddit.com/r/PESU/comments/1gx7ld0/breaking_news_metro_to_ecity_delayed_again_bmrcl/",
    "permalink": "/r/PESU/comments/1gx7ld0/breaking_news_metro_to_ecity_delayed_again_bmrcl/",
    "score": 44,
    "upvote_ratio": 0.94,
    "created_utc": 1732281367.0,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false
  },
  "comments": [
    "apparently, they don't have enough trains to operate, and even if they operate there will be a waiting period of 30-45 min \\~source: dad's friend who works in metro department",
    "Gotta fly now ...\n\n![gif](giphy|5EGq75uKnJEnJmYosZ)",
    "Giving the contract to the chinese was such a bad decision\n└── Obviously they want to go \"cheap\" to pocket heaps.",
    "I'm going to cry\n└── i am just a chill guy dude 😎",
    "All the work is done, they just need the trains. U can sometimes see test trains running on it. One of the reasons it got delayed is because of the galwan valley clash with China, which triggered make in india norms to get stricter. So the Chinese supplier of the trains was forced to do 75% manufacturing in india at the very least. It took time for the company to find an Indian partner to work with. So I think it's fair to cut bmrcl some slack here",
    "There’s still lot of work undergoing in that metro stations ,\n\nIn Hongasandra metro station: They are digging so deep and they diverted the main road into service road \n\n\n\nIts gonna take months to even finish that shit."
  ]
}