{
  "title": "Hostelers, do u like ur roommates?",
  "content": "i have one rlly horrible roommate. The other 2 guys are fine but they're so boring and closed off. we dont bond wel. i feel bored all the time. ill def change my roommates next yr but was thinking is this common or is it just me.",
  "metadata": {
    "id": "1gy3ouv",
    "author": "LastAssociation9694",
    "url": "https://www.reddit.com/r/PESU/comments/1gy3ouv/hostelers_do_u_like_ur_roommates/",
    "permalink": "/r/PESU/comments/1gy3ouv/hostelers_do_u_like_ur_roommates/",
    "score": 13,
    "upvote_ratio": 0.85,
    "created_utc": 1732379825.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "Imagine them putting a similar post lmao\n└── idrc if they do",
    "Wait, you're that chaddi guy's roommate 💀\n└── *chaddi buddies",
    "It's all good when they aren't a nuisance and a pain in the ass.Which, luckily, are not in my case. I also know a room where this guy and his 4- 5 friends play games being loud and obnoxious and his roommate was trying hard to focus on his book, was in a corner cupping his ears, his eyes locked, forced upon his book.\n\n\nSome rooms however, have a different environment.They always are upto something productive and do group studies and sometimes more than 6 people join in.It is sheer luck if you get allotted a room with such a group of people.\n\n\nSo, it all comes down to your luck to what kind of roomates you get.You certainly get influenced by them to an extent and it can change your outcome by a whole lot! So, best of luck.I'd suggest to find someone that is in the same boat.",
    "The hostel is so shit , the director is an ass who'll fuck over your plans of wanting to keep your roomate , every year they pull some new scheme. One year it was \"if you chose X block you can't downgrade to Y block\" even though we asked the staff a million times if it was possible. And he made a huge issue out of it when we asked during allotment, like ffs bro we just want our own roommates. Anyways he reverted the decision next day but it was too late for some of us cause we bit the bullet and gave up. The hostel has a very retarded system.",
    "Thats the thing with putting random people together. At least you've your classmates and you can hang with them."
  ]
}