{
  "title": "Random thought ",
  "content": "Idk how you guys score 9+gpa given the syllabus and time constraint..pls expand more about this thing so that I understand ",
  "metadata": {
    "id": "1h1tsfu",
    "author": "Parking-Ad5556",
    "url": "https://www.reddit.com/r/PESU/comments/1h1tsfu/random_thought/",
    "permalink": "/r/PESU/comments/1h1tsfu/random_thought/",
    "score": 17,
    "upvote_ratio": 0.96,
    "created_utc": 1732792566.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "90% of it is just listening in class. That’s not always possible because not everyone here is a good teacher, in that case use slides/textbook and help of Claude whenever you get stuck.\n├── I've got all bad teachers except for chem and epd is kinda ok😭\n│   └── Oh you're a first year\n\nVibha notes is pretty good for 1st year.\n│       └── Leave notes aside pesu slides and notes are pretty good..the prob is the kind of questions they ask in isas and Esas it's quite advanced for me how do u tackle them?\n│           └── You can try practising QB, PYQs\n│               └── I tried but did my isa1 hopelessly bad\n│                   └── Spend time figuring out why you weren't able to solve the questions. You probably don't have a good understanding of the concepts then.\n└── Why Claude and not, say, ChatGPT?\n    └── They recently blocked ChatGPT",
    "Already a good comment here. Another thing I'd like to add is that college is different. Your study techniques from school might not necessarily be transferable to college, so you're going to have to tweak things a bit to see what works for you. And most importantly, keep in mind that what works for someone else might not always work for you. It's about discovering what helps you perform. \n\nThe first ISA is always a reality check for people. Some realise that they need to study more, some realise how they need to study, some realise that barely memorising and not understanding won't cut it. Regardless, it's important to find this realisation. After the results are declared, spend some time going through your mistakes and try finding out *why* you went wrong - didn't study, didn't understand, question too tough, etc. Once you find the reason, you should be able to solve it. \n\nGeneric advice at PES is to (1) start preparing early, because syllabus is vast and questions will require you to understand concepts in depth (note - ESA is generally tougher than ISA) and (2) cover all possible resources from textbooks to questions banks because questions can come from anywhere and (3) listen in class, make notes, pay attention - it makes steps 1 and 2 easier. \n\nVery important to remember: overnight study, or even last week study, does not work here.\n└── Thanks a ton! But what textbooks tho?\n    └── You have prescribed textbooks for a course. Use them. They might not help too much in first year but from second year onwards they are a hard requirement if you want that 9+"
  ]
}