{
  "title": "Did you get paid for TA (batch of 2024 people!!)",
  "content": "Hey everyone,Just wanted to ask if any of you got paid for being a Teaching Assistant (TA). \n\n\nI haven’t received yet, so just wanna know!",
  "metadata": {
    "id": "1h21i7q",
    "author": "Suspicious_Code1493",
    "url": "https://www.reddit.com/r/PESU/comments/1h21i7q/did_you_get_paid_for_ta_batch_of_2024_people/",
    "permalink": "/r/PESU/comments/1h21i7q/did_you_get_paid_for_ta_batch_of_2024_people/",
    "score": 17,
    "upvote_ratio": 0.96,
    "created_utc": 1732816060.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "I was a TA in my 7th semester (Aug-Dec 2021). Got paid for it after my full time began around August 2022 lmao\n├── Even i did in aug-dec 2023 still didn’t get paid\n└── If you dont mind answering \nHow much do TA's get paid,\nIs it diff for diff profs\n    ├── Yeah, different for different courses and profs, as well as the amount of work done.\n    └── Thats peanuts!\nIts very less like cant even say :)\n        └── Can't generalise. We got paid almost 10k back then. But I do know some RAs who got paid as low as 2k.",
    "No not yet😭\n├── FYI was a TA from Jan - May 2024\n└── 🙃🙃",
    "Also could seniors add info related to becoming a TA.\n\n1.How do you approach the professor?\n2.Is it manageable workload considering placements, capstone,classes(online)?\n3.Is it worth the workload, what value does it add?\n4.How was your experience working under the professors,does it build a very good rapport or is it just limited to getting the work done?\n5.Any general suggestions\n└── I think the FAQs (and if not the FAQs, search this subreddit) answer all of these. They're answered by me only in the past\n    └── Oh sry, I'll check that, thank you!",
    "Abroad we get paid. Here not so much...\n└── Yea true!\nTill now i haven’t been paid.",
    "Does only CSE have TAs or even ECE ?\n└── No idea",
    "is it possible to bribe TA anonymously, give them some cash and increase assignment marks?\n├── Idk never heard of anything like this…\n└── It wouldn't work well for you if caught."
  ]
}