{
  "title": "Is this going to become the new norm 4 years down the line?",
  "content": "The boards 95% part.",
  "metadata": {
    "id": "1h2cjjs",
    "author": "Arjun9514",
    "url": "https://i.redd.it/a0pyvtw2er3e1.jpeg",
    "permalink": "/r/PESU/comments/1h2cjjs/is_this_going_to_become_the_new_norm_4_years_down/",
    "score": 51,
    "upvote_ratio": 0.98,
    "created_utc": 1732850458.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "Maybe yes :)\n\nTBH it might get tough!",
    "Society just needs a re set. Way too many requirements other than skills\n└── THIS !! I got rejected from an ML club of this college despite knowing basic ML but for being non-cse\n    └── That's really stupid which club?",
    "Man college placements feel like a scam , 95% board requirement , that too 10th standard. I understand the need for a cgpa requirement but the teaching at pes is subpar and trash , most courses suck ass and the only way you can get a good grade is by glucking down the slides. Sometimes even the slides and notes are fucking trash and incomplete.\nAtleast VIT has a proper resource system\n├── i completely agree. im paying you 4 lakh a year, the least you could do is employ decent teachers. \n\nthe only redeeming quality of this college are its CSE placements; remove that, and it becomes nothing but a dystopia.\n│   └── Exactly. I don't know what'll happen to this place in ten years , it's surely leaning towards becoming VIT instead of IIT.\n\nAtleast VIT knows it's worth.\n└── but the syllabus of pes is betetr right and not outdated? Just asking\n    ├── It's up to date but out of order.\n    └── The syllabus is better, but the execution is really bad. It used to be 5 units , now it's 4 and it's all messed up and most profs are crap.\n\nBasically, the effort is you and you only , which you can literally do in any other college. There are some good opportunities that pes gives ofc , but the management seems to fucking all of that over in favour of making more money \n\nThis place massively fell off man , anti club rules , shitty HODs and whatnot",
    "If that's the case, I'm cooked\n├── 😢\n└── me too",
    "And they say 12th and 10th doesn't matter!!  kids never listen to those people, give your compartment/improvement exams.",
    "im cooked",
    "Only pcmc or including English kannada ??",
    "is this only pes or is this how every college works? if its other colleges too im cooked\n└── It's being seen in most colleges now, it's cutthroat everywhere.\n    └── i hope they dont see my 12th marks",
    "95% what about the rest of us who don't score that much. What a world we live in.",
    "For entry perhaps but overall most would look like jobs in crossover or [turing.com](http://turing.com)"
  ]
}