{
  "title": "PLACEMENTS......!",
  "content": "What are the chances of 7pointer(CS-dept) getting Tier-1 job??????\nAnd what kind of projects should I put in resume?\nwhich is most preferred language by most of the companies which come to PES?",
  "metadata": {
    "id": "1h3darm",
    "author": "Damon_003",
    "url": "https://www.reddit.com/r/PESU/comments/1h3darm/placements/",
    "permalink": "/r/PESU/comments/1h3darm/placements/",
    "score": 19,
    "upvote_ratio": 1.0,
    "created_utc": 1732975671.0,
    "flair": "Placements 🤑",
    "nsfw": false
  },
  "comments": [
    "1. It's gonna be difficult but not impossible. However, it's unlikely you will get placed early (in a T1) since you'll be competing with all the high GPA students while shortlisting. \n2. Projects should be substantial and completed ones, ones that show your skills and aren't a copy-paste of things you can find online. Also, they should be sizeable and not something someone can put together overnight, so aim for end to end projects. Also, it helps if they're all related to the job you are applying for and/or the field you are interested in. \n3. If you're referring to the language for the placement tests, then you can use anything. 99% companies don't put any requirement. However, most people use Java, C++/C or Python.\n├── What do end to end projects mean really?\n│   └── It means suppose it's a web project then frontend to backend to hosting everything u can do... The more u do more the better\n└── So chances are there to get placed in T1 but it's hard right?\nAnd how to get to know about off campus placements ?\n    └── 1. Yep\n\n2. LinkedIn, Google job listings, career pages of company websites, etc.\n        └── Thanks a lot brother...",
    "If gpa is 7 pointer then u must be very well prepared in dsa and the technology ur projects are in... Since u will get lot lesser opportunities and u can't afford to miss them\n└── Lot lesser in the sense can I knw how many(roughly)??\n    └── It's relative.... If say someone with 8.5 or 9 + is getting some 100 tier 1 then u would be eligible in 10-15  approxx. These could be equally good but should be very well prepared at every step as here so much competition due to high number of peeps"
  ]
}