{
  "title": "Pissed at capstone panel",
  "content": "I had my phase - 1 ESA presentation today. The panel had a prof who was nice to me and asked me good questions and gave constructive criticism. But they proceeded to bully the shit out of my teammates. We were asked to come and present individually and the criticism they gave to each person in the team was different. The prof told one member in my team that the idea is not feasible and proceeded to tell me that we need to just take care we have enough validation data like wtf ? If capstone is a group activity why should everyone recieve different advice and criticism and why wasn't my team addressed as a whole ? This prof also made a big deal about small things and was very moody. Awful experience, now I don't know if my idea is bad or good despite my guide saying it's a good idea. I have a feeling they were playing favouritism cause I'm in good terms with them personally and it was not ok for them to bully my teammates like that. ",
  "metadata": {
    "id": "1h5iqjg",
    "author": "[deleted]",
    "url": "https://www.reddit.com/r/PESU/comments/1h5iqjg/pissed_at_capstone_panel/",
    "permalink": "/r/PESU/comments/1h5iqjg/pissed_at_capstone_panel/",
    "score": 55,
    "upvote_ratio": 0.97,
    "created_utc": 1733213856.0,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false
  },
  "comments": [
    "Jokes on you, you have no idea how they're gonna treat you towards the end of your project in phase 2 lol. That would be borderline PTSD.",
    "Lmfao lemme guess, lakshmeesha?\n└── Really? He was one of the nicest teachers for our batch.  He taught so well and gave us free marks in assignments and stuff",
    "Bruh its always the same ,\nThey will never stop doing that .\nHave seen so many cases in my batch too :(",
    "I will never understand the purpose of Biotech Dept capstone review process F",
    "There's always professors like this in every department and there's also students who don't do any work and teachers know that. At the end of the day, grades are given individually and not as a team so don't bother about it too much as long as you're fine. Plus, try to focus more on placements and learning good skills as they're more important for you rn than the capstone project and need more of your time and attention. The capstone reviews will just get worse and even the teachers will stop caring after a while. Just bear it for like a few more months and you'll realise there are more important things you can focus on\n└── I wanna have a good capstone project and want good grades cause my overall GPA is kinda low and this can give a good boost. Plus I wanna do masters and the unis I'm looking into all look for a good research profile and gave weightage to capstone during selection. As I said they weren't mean to me and gave me genuine feedback but bullying my teammates was not ok. "
  ]
}