{
  "title": "The ECE department of ECC is on a power trip",
  "content": "Few days ago (02/12/24), the dept of ECE, EC Campus, organised a placement talk by an alumni, which they marked as compulsory attendance for 7th semester students.\n\nHowever, this was planned on the same day as a NPTEL course ESA, and a talk on TL Verilog by Steve Hoover  from Redwood EDA (which was at the same time as the ESA, nicely enough), and with an ESA scheduled for Wednesday, attendance was poor. By the end of the talk, roughly 30 students were present, from a batch of \\~120.\n\nThe Head of Department, Dr. Ajey S N R, absolutely loses it, once the speaker has finished, he gets up on stage and says some of the most unhinged stuff, stuff like “you should hit your friends with chappals for skipping talk”, and how the attitude of the students was wrong, as we weren't getting placed, and whatnot. While that was understandable, here comes the kicker: Man has assumed the power of the controller of examinations, and is blocking Capstone ESA grades until the students who were not present bring an affidavit worth ₹100, signed by a notary by Saturday. This news was announced on Wednesday. Find the images below. \n\n**Message from the capstone coordinator:**\n\n[Screenshot of batch group](https://preview.redd.it/ck4dun2j9u4e1.jpg?width=875&amp;format=pjpg&amp;auto=webp&amp;s=086c4ea98cf5ea1a6e9bbd7ba2440b3f9fc28cef)\n\n**The affidavit contents:**\n\n[Screenshot of the document they want](https://preview.redd.it/vdyx27et9u4e1.jpg?width=515&amp;format=pjpg&amp;auto=webp&amp;s=d275ecd3f08739c62d78721fbf91646177172e1f)\n\nDoes the department have powers to do this? Which legal entity gives them this power? What about students who have attended previous talks, and could not attend this one, as it clearly states \"this is the third time I am careless\"?",
  "metadata": {
    "id": "1h6gtos",
    "author": "[deleted]",
    "url": "https://www.reddit.com/r/PESU/comments/1h6gtos/the_ece_department_of_ecc_is_on_a_power_trip/",
    "permalink": "/r/PESU/comments/1h6gtos/the_ece_department_of_ecc_is_on_a_power_trip/",
    "score": 150,
    "upvote_ratio": 0.99,
    "created_utc": 1733321240.0,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false
  },
  "comments": [
    "Wtf even? What kind of boundaries is PES is even crossing.",
    "Nah bro this has to be taken up by someone somehow and get ajey fucked",
    "The worst part is, the higher up the chain you go, the pettier they get. Get your parents involved I suppose and argue your case. Good Luck\n└── This is the best thing you can do  \nGet ur parents to screw Ajay too  \nMan will calm down for a few months",
    "What a corrupt person",
    "Yeah Ajey is the pettiest person I've seen in PES. He is a horrible person and the worst professor in the ECE department. Almost everything bad about ECE EC can be traced back to that hypocrite. So happy I'm not studying there anymore lol. I feel bad for everyone in ECE. I heard he's not gonna be the HoD anymore tho so maybe that's some good news. His replacement isn't great but is a bit better than him. Just get your parents and go directly to the VC on Tuesday. Get a few more parents as well. Ajey instantly folds if the VC says anything. Tell a few others also to bring their parents and go talk to the VC and it will mostly be sorted. Don't get too frustrated, we also experienced stuff like this and so did our seniors. You're almost done with this clg, just focus on your placements and stop worrying about unimportant stuff like this",
    "insane",
    "Can't u just ignore him, it'll be a stain on his reputation if he dosent consider alot of people's capstone projects. People like this need to be taken off their high horse and slammed into the dirt where they belong. Blatant disgusting gross abuse of power, bro has a God complex",
    "Insecure ajey makes the whole ECE department insecure.\n└── Lmao this is so true. Bro is the worst professor to be the HoD. Heard he's getting replaced soon tho but not that it's gonna help that much since Shreyus sir isn't that much better",
    "Our parents had to call profs every time we missed a class in 3rd sem. We almost always had to get a letter signed by HOD if we were absent on a day where many other people were coincidentally absent. I have seen these things only in ECC ECE dept and students cannot do anything about it. Its not there in any other dept (btech) of any campus afaik. The power trip is real.",
    "the best part is affidavits cost around 545 to 600 rupees\n└── I know a guys who did it costed him 800 apprently ",
    "I think college was falling short on grad day funding hence they pulled this shit\n└── They're making the 2024 batch fund their own graduation already wdym🥲\n    └── This is pes\nNo matter how much money they have, they will still say its less 😂",
    "Nah this is just crazy",
    "I am not gonna lie, ive seen this happen in my college as well (iiitb) but not to this extent. We are forced to attend random events sometimes like talks or counseling sessions and attendance is taken. idk what happens to the people who don't attend though. Seems like a sad thing. Forcing students to attend events so that colleges can build a good image in front of outsiders/companies. It's good to have relations and connections and stuff but is this really the only way?",
    "dude that's so fucked up like what? makes absolutely no sense",
    "Apparently some people went to talk to him about why they could not come because they were doing internship man goes \"It is your mistake you took the internship\" hence even they should submit the Document",
    "you gotta spawn in your multiverse versions to battle pes atp",
    "https://preview.redd.it/asy7iwm4mu4e1.jpeg?width=479&amp;format=pjpg&amp;auto=webp&amp;s=59fc7236e72c6fdd0418a9591fb8a0c6ae8c4385",
    "alfadelta10010 ?\n└── Why would I care to type so much, I was at the talk 😂  \nOP is right tho, and they have cancelled ESA reviews until further notice, time has been given till Jan 1st\n    └── Sir might think it's you, so I asked.",
    "The Department of Electronics and Communication Engineering at EC Campus has always been committed to preparing students for their future careers. The recent placement talk by an esteemed alumnus is a testament to the department's efforts to provide valuable industry insights and opportunities for students to learn from real-world experiences.\n\nBalancing academic commitments like the NPTEL ESA course and the insightful TL Verilog talk by Steve Hoover can be challenging. However, the department’s emphasis on attendance and active participation in such events highlights the importance of making the most of every opportunity. Dr. Ajey S N R’s passionate response reflects the department’s dedication to fostering discipline, accountability, and a professional mindset among students.\n\nAlthough these measures may seem strict, they are aimed at motivating students to engage fully with the resources and events designed for their benefit. By addressing challenges proactively and maintaining open communication, both students and faculty can work together to uphold the high standards of excellence that define the ECE department at EC Campus.\n├── what in the chatgpt is this\n└── account with only one comment, 20 days old, sounding like an AI while praising PESU?\nmust be 100% real and authentic"
  ]
}