{
  "title": "Sincerely, screw the ECE department and their stupid power trip",
  "content": "For context, I had 74.7% attendance in a subject. They informed us that people with attendance shortage (below 75%) need to submit some stamped paper affidavit worth 200Rs to them. I tried to get the affidavit, but they told us on a Friday, and the registrar's office is closed on weekends and I had to submit it on the following Monday. So it was literally impossible for me to get it submitted.Thing is, I thought having 0.3% below the requirement was no biggie, as is the rational conclusion. Guess what? They just fucking withdrew me from the course?! My ESA is tomorrow and now I can't fucking write it?? What the fuck man? Are they going to harass me further tomorrow when I state my case? Will I really have a backlog over 0.3% attendance. I swear to fucking god I will burn this hellhole to the ground if they don't let me write it tomorrow.",
  "metadata": {
    "id": "1h6jhsr",
    "author": "Admirable-Guava7505",
    "url": "https://www.reddit.com/r/PESU/comments/1h6jhsr/sincerely_screw_the_ece_department_and_their/",
    "permalink": "/r/PESU/comments/1h6jhsr/sincerely_screw_the_ece_department_and_their/",
    "score": 60,
    "upvote_ratio": 0.91,
    "created_utc": 1733327992.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "So, did you end up writing the exam?",
    "huh what why you blaming the department, mate you are an adult they have clearly mentioned it should be above 75% to write the exam . you could have atleast gone and submitted a letter to the teacher asking for attendance or spoken to them, they would have added attendance many of my friends have done this and got their attendance above 75\n├── A backlog for 0.3% is indeed petty, but tbf they have always been rigid with attendance. Even years ago when 85% was the requirement, having anything lower than that meant instant trouble. For some reason they take attendance way too seriously here. Its honestly best to just play by their rules and be safe rather than risk things.\n│   └── Yeah I learned my lesson now. Took the s&amp;h department's leniency in the first year for granted. Really don't know what kind of kick they get out of doing things like this, absurd. Like I get it if I was 5-10% below the criteria, I would accept that backlog. This is just baffling to me.\n│       └── I can understand. I had an 82 or so in my 3rd semester. I remember being anxious until the last week. Luckily I was able to scrape through because of TAS and some other things that kept pulling me out of classes which helped me claim attendance. Although afaik, all that has been cancelled now. Back then, it was pretty hectic to maintain 85%+. You could only miss a few classes per course.\n└── I'm blaming the department because this wasn't ever a problem in our first two semesters. Even teachers in my current sem said hey look, keep it above 70. I've had it below 75 (but close to it) in multiple subjects in previous semesters, wasn't an issue at all. It's just that this particular department is especially finicky, which I was not aware of. Sure, some of it is on me maybe I was a little irresponsible. But do you really think sticking to that rule, not allowing for a margin of 0.3% and handing out a backlog is FAIR? Anyway all I need to do now apparently is beg the HOD tomorrow for a new hall ticket, but I'll probably lose some writing time. Do you really stand by this ridiculous system? Because oh they've already set rules and I should adhere to them despite this barely being an infringement? AND the fact that they've been reasonable about it before?\n    └── The S&amp;H department functions independently. You can try requesting but unfortunately as I said before, they're very rigid with the attendance system. That, along with the placements cell, are two systems you don't fuck around with here. Doing so is basically fucking yourself over.",
    "The problem with not being strict with the attendance thing is that when u get in for having even 0.1% less, people will start getting in for the same, slowly but surely this will repeat and attendance \"required\" would go lower and lower",
    "How many chances are give to write re-exam of esa if we have backlogs?",
    " which campus you in btw?",
    "Wait really? Are you in rr campus? I was in ece campus and I had like 50-60% attendance in 3 subjects in sem 3 and I had no problems at all. Teachers didn't even ask me for a reason\n└── Your flair tells it all.\n\nThis college is achieving new lows every other day, just see the recent posts\n    └── My graduation is literally tomorrow so I'm technically still in PES lol. Plus I don't see how anything could be worse than the things that happened this year, but I get what you mean. I'm just happy to be done with this shithole\n        └── Congratulations tho!"
  ]
}