{
  "title": "Did any of you get the Spotify student discount?",
  "content": "Do we have to enter our '.pes.edu' mail id or to upload our ID or something?\n\n\n\nEdit: Successfully obtained the discount.\n\n1.Enter your pes.edu mail id\n\n2.They will reach out to you via mail and provide you a link to submit a document which should contain ur full name and the validity (Typically ur student ID).\n\n3.Blur the phone number,address etc and post the pics of ur ID and wait.\n\n4.They may send you an email again to resend a different document,In that case u might have blurred too much info(that's what happened to me) so i made sure that the validity and date of birth is clearly visible and posted again and I got my subscription.",
  "metadata": {
    "id": "1h81w0s",
    "author": "PYUchiha7",
    "url": "https://www.reddit.com/r/PESU/comments/1h81w0s/did_any_of_you_get_the_spotify_student_discount/",
    "permalink": "/r/PESU/comments/1h81w0s/did_any_of_you_get_the_spotify_student_discount/",
    "score": 26,
    "upvote_ratio": 0.97,
    "created_utc": 1733493380.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "Same question. I tried a hundred times and stupid shit didn't work for some reason. Worked for some friends though.\n└── So how did they do?\n\nBy entering mail id?\n    └── they uploaded a pic of their ID. Not sure about mail. I guess they somehow did it even before pesu mail IDs were given out for our batch last year, no idea how.\n\nIt didn't work for me when I tried both, so I gave up. I have a different plan now and I pay 30 rs a month so I'm happy.\n        ├── I did it last week and all you need is your email.\n        └── which plan if you don't me asking? 30rs is mad cheap\n            └── Family plan (6 premium accounts for 180 a month). I split with 5 others, so it's 30 per person.\n                └── ahh okay, makes sense",
    "U have to verify thru sheerID, use ur \".pes.edu\" mail. Afaik that's it.",
    "Yes enter ur pesu mailId and submit a photo of ur ID card",
    "I've been using Spotify student ever since I joined PES in 2021. You have to use your [prn@pesu.pes.edu](mailto:prn@pesu.pes.edu) to login to SheerID. There it will prompt you to some weird website from PES itself where you'll have to enter your PRN and the password (given to you from your librarian). If not then you can send a photo of your ID card or something.",
    "I used it through my entire engineering, I forgot exactly but that one part where you have to log in to sheer and it asks college id, I think you have to give the PRN found in the back of your id card",
    "i just uploaded a pic of my id card using that sheer id thingy.... didnt need pesu email",
    "I got it a year back lol. With your student id card verified you get to pay only 59 rs. a month. It's a little buggy process tho.",
    "There's a better option. Just find 4 more friends who want premium and get the spotify family thing. It's less than 1 rupee per day and it lasts for the whole year. That's what almost everyone ik did",
    "Use your library login creds. That’s what worked for me",
    "where do i see my 'pes.edu' email id?",
    "I am not getting scholarship from past 1 year and u r worried about student discount🙃🎀"
  ]
}