{
  "title": "People aren't believing the ibm's 140 offers 😭 man never thought ki inka itna gand jalega. ",
  "content": "Bro also confirmed from his sources wtf 😂😂",
  "metadata": {
    "id": "1h84260",
    "author": "[deleted]",
    "url": "https://i.redd.it/8x35ibknz85e1.png",
    "permalink": "/r/PESU/comments/1h84260/people_arent_believing_the_ibms_140_offers_man/",
    "score": 112,
    "upvote_ratio": 0.97,
    "created_utc": 1733499381.0,
    "flair": "Meme :snoo_dealwithit:",
    "nsfw": false
  },
  "comments": [
    "lmao tell them about Apple 40 and let them lose their minds 🤣🤣\n├── Damn it's 40 now? Insane xD\n\nik a couple people who got after the first 20 but didn't think it was so many.\n│   └── Do you know how much CGPA cut off they kept for diff roles? SWE, IS&amp;T etc.?\n│       └── 9+\n├── Wait apple seriously came?? That's crazy\n└── insane, how much did they offer?\n    ├── 90k stipend for internship no clue about fte\n    │   └── Ahh okay\n    └── 64 LPA is CTC\nbut base is not that crazy, 18 or so I believe.\n        └── Still bhai 40 people getting 64 lpa is insane, are you sure this happened? As in were there 40 openings or did they offer 64 lpa to 40 people? If it were true then it would have been all over the news by now\n            ├── ik of at least 23 people who got this offer, so yes good chance it happened for 40\nAlso I believe Apple has some kind of non-disclosure thing for recruitments in PESU, they don’t let the students publicly announce the offer and also PESU is not allowed to mention it for advertisement purposes. Probably this is the reason there isn’t much news.\n            └── Its 100% ture i know 20+ people personally who got the offer. And yes they took 40 people in total.\n                └── Won't this alone bump your average up by an insane amount? Do uk what the average package is currently?",
    "Heard that they shut their office in China or something and are bulk hiring in India.",
    "lmao inter iit/nit wannabe colleges lafda",
    "Even ramaiah got 45+ offers from IBM this time for 18lpa\n└── is there a student made spreadsheet tracking the placements?\n    └── [link](https://www.linkedin.com/safety/go?messageThreadUrn=urn%3Ali%3AmessageThreadUrn%3A&amp;url=https%3A%2F%2Fdocs.google.com%2Fspreadsheets%2Fd%2F1bjWjA1i39o5EnT2XtrIVjAj73RMcCvL3%2Fedit%3Fusp%3Dsharing%26ouid%3D100530950606938097471%26rtpof%3Dtrue%26sd%3Dtrue&amp;trk=flagship-messaging-android)\n        └── page not found",
    "Typical DTU/NSUT student behaviour.",
    "Understandable that it's not easily believable lol but it did happen.",
    "https://www.reddit.com/r/Btechtards/s/5OK06KoV6X\n\nFucker has lost his mind, check this out if you're free..\n├── why do you care so much about what a bunch of strangers on the net choose to think about an unrelated college. let them be idiots if they want to.\n│   └── Nah I'm actually enjoying how their ass is getting burnt lol\n│       └── Sounds like youre irritated, since you went on to make a post about it\n└── Bc inki khud ki nhi lag rahi to iska matlab ye thodi pure desh me kisi ki nhi lagegi",
    "Irony is he has chill guy pfp",
    "one of my neighbor's son got 18 lpa package from ibm from pesu.. i want to know if ibm actually took people with 18 lpa ..in my time in pesu ..they took student for 11 lpa and mostly cse\n└── Yes it’s true. This is for the ISL branch so the package is high, it’s lower for the services branch of IBM.",
    "Contrary to his dp, he is not a chill guy.\n\n![gif](giphy|Tg9jENf7x11tdJnyMQ|downsized)",
    "Bhai bench mate ko sources nhi bolte 🥺"
  ]
}