{
  "title": "4th year SENIORS please help!! deadline tomorrow (6th sem electives)",
  "content": "Which are easiest in terms of SYLLABUS and Assignments/lab Loads\n\nE3:\n1.Blockchain         \n2.Algo for IR.    \n3.Digital Twin.    \n\nE4:\n1.Information Security       \n2.HP.      \n\nPlease\nGive us detailed information asap\n\nAll ESA result graphs are almost similar!! \n\n\n",
  "metadata": {
    "id": "1h8tza9",
    "author": "Key-Actuator-3372",
    "url": "https://www.reddit.com/r/PESU/comments/1h8tza9/4th_year_seniors_please_help_deadline_tomorrow/",
    "permalink": "/r/PESU/comments/1h8tza9/4th_year_seniors_please_help_deadline_tomorrow/",
    "score": 8,
    "upvote_ratio": 0.9,
    "created_utc": 1733582860.0,
    "flair": "Study Help :table:",
    "nsfw": false
  },
  "comments": [
    "New electives spawning like new characters every year. Can't really help you with that lol.\n\nBut if you're only keen on blockchain and cybersecurity then it would be worth learning.\n└── we had the same elective in 6th sem. are you from batch of 25?\n    └── Yea\n        └── yeah then u also must’ve had all those electives, unless u r from ecc\n            └── Since I took blockchain and information security I spoke from that perspective.",
    "Copy pasting my previous comment: \n\nThe easiest course is the one you have a prior interest in. Passion and interest goes a long way in driving motivation, effort and making a course easier. I've always found myself performing better (on most occasions atleast) in heavy but interesting courses compared to lighter but bland ones. \n\nRegardless, if you want an easy/lightweight course, AIWIR is by far the simplest choice. Don't know too much about the rest, but since this is a question repeated every year, search this subreddit or PESU Discord. You'll mostly end up finding my old comments or messages on discord. I remember ranking all the electives on workload 1-2 years ago.\n├── AIWIR is screwed now, they’ve added a lot of bs\nDigital Twin is the easiest E3 effort wise right now, but no one can predict with certainty how easy an elective will be, there’s a lot of unknown factors- new anchor might give hard papers(case in point HCI and NVP). So yeah like rowlet said try to go more by interest and how good a professor engages you in class, these 2 things make it very easy to score in any subject.\n└── I am not able to find your old comment...if u can please share the link",
    "deadline's on the 10th. that's tuesday.",
    "If you know which stream you want to go in future. pick the ones that helps. some help in getting specialization so you can consider that too. as for easiest it depends on who's teaching and wheather you understand the material.",
    "Could you share the esa graphs for electives(if you don't have for all subjects , blockchain,dbt,is and autonomus robots would be helpful)"
  ]
}