{
  "title": "How tough is deep learning as an elective? ",
  "content": "I was planning to take airw and deep learning. How hard are the isas and esas + the project? Some comments on this sub mentioned you had to do a paper for it too. Will ML for graphs be an easier option? \n\nAlso, are the projects and assignments in DBT as hard as they were in BD?\n\n(Sorry if this question has been repeated before! I tried searching the sub about this, still didn't get much clarity on how tough it is exactly. + Someone forwarded me a screenshot of the isa averages for deep learning and it showed about 189 who scored 0-5 which freaked me out lol :') ",
  "metadata": {
    "id": "1h996hz",
    "author": "Individual-Strategy1",
    "url": "https://www.reddit.com/r/PESU/comments/1h996hz/how_tough_is_deep_learning_as_an_elective/",
    "permalink": "/r/PESU/comments/1h996hz/how_tough_is_deep_learning_as_an_elective/",
    "score": 14,
    "upvote_ratio": 0.95,
    "created_utc": 1733626424.0,
    "flair": "Study Help :table:",
    "nsfw": false
  },
  "comments": [
    "I took DL in ECE, but I think both CSE and ECE have the same textbook. There were a lot of algorithms from what I remember, but our exams always used to come from single Question Bank, so DL was good for me. Idk about how CSE is. In general I liked DL a lot as a subject\n└── thank you! I'm a little hesitant to take it because I don't want to tank my cgpa more, but in general I'm interested.\n    └── Check the textbook and see if you want to take it. I think this textbook was by Ian Goodfellow",
    "tdl covers way too many topics in way too short a time for any proper in depth understanding. I say take it if you like ml and would like to dive deeper into certain topics yourself. I took tdl and found it shallow but quite nice since i did out of class studying as well.\n\nidk abt the profs for mlg tbh. who's taking it?\n├── Dr. Surabhi Narayan\nDr. Uma D.\nProf. V.R. Badri Prasad\n└── In EC campus afaik Bharati R teaches it. Had her for data analytics this sem. Horrible experience lmao."
  ]
}