{
  "title": "placements",
  "content": "for placements as long as we get through the cutoff gpa its only the skills that matter right? or is it like a person with 9.2 gpa will be preferred over a candidate with 9 gpa? is starting dsa from 1st sem in python a good start for placements?",
  "metadata": {
    "id": "1ha8wpj",
    "author": "BeginningBreakfast26",
    "url": "https://www.reddit.com/r/PESU/comments/1ha8wpj/placements/",
    "permalink": "/r/PESU/comments/1ha8wpj/placements/",
    "score": 16,
    "upvote_ratio": 0.81,
    "created_utc": 1733748325.0,
    "flair": "Placements 🤑",
    "nsfw": false
  },
  "comments": [
    "Higher ygpa will definitely help",
    "depends on the company. but I would highly recommend maintaining a good gpa of 8.5 absolutely minimum, because of the student count. there are so many students (in cse at least) that some companies wont be able to administer tests/interviews for all, and so they'll do a gpa shortlist first. also gpa adds to your resume so why not\n\nalso about language, again I highly suggest java and cpp. there's just a lot more content in java and cpp like YouTube videos for solving dsa problems, and also certain companies do like it if you use them.\n└── when i read the faqs it said after u get through the cutoff gpa,gpa takes a back seat and skills are all that they look at,is 9 sufficient or do i have work more to improve my gpa(as studying subjects like chem honestly waste time,i world rather start doing leetcode),should i work for a better gpa or start building on skills?\n    └── yeah after you get through the cutoff gpa it doesn't matter anymore at all. a very very small number of companies want crazy high gpas of 9.5+, but yeah it's only a handful.\n\n9 is more than enough. I was planning on doing a masters from a really good uni from 1st year only, so I maintained it pretty high, but that's based on your future plan.\n\nhonestly try optimizing for gpa, skills and leetcode. learn all 3 and never put your eggs in one or even two baskets just for safety\n        └── im just working on placements,so should a 9 be enough?\n            └── yes, it'll actually be more than enough in most cases but better to be safe",
    "brother almost every shortlist that came out last year was based on cgpa",
    "I've written about this in detail in the FAQs, so just posting a summary here: \n\n1. GPA is important, it is used to filter candidates for the interview shortlist and also for any tiebreakers. Many companies are known to shortlist 9+, and a handful have 9.5+. Usually, having an 8.75+ at the very minimum in CS is needed if you want to get placed early in a T1 company. \n2. Once you are through to the interviews, GPA isn't that important. Your skills, experience, projects, and how they align with job requirements matter now. If you don't have any skills, projects or anything to show that you are industry ready or what the company is looking for, you'll get rejected pretty early. These rounds often focus on finding out your technical abilities. They're not going to hire you just because of your GPA. \n3. TLDR - you need both to get placed. GPA helps you clear cutoffs, your profile helps you land the job. Both need to go hand in hand. Explore CS, figure out your interests, upskill in your desired field and align your profile towards specific job roles if possible. At the same time, practice DSA well enough to clear the assessments. And ofc, hope a bit of luck is on your side.",
    "GPA matters no doubt. It will be used for any tiebreaks. \n\nYou don't **need** to start DSA from sem 1. I'd recommend understanding the languages first. It won't hurt to do DSA from Sem 1 but don't prioritise it over other things. After Sem 4 you should absolutely give priority to DSA. \n\nTl;dr: GPA important. DSA from Sem 4/5. Not required from Sem 1.",
    "First year here\nBro u got time for maintaining a 9+cgpa AND time for doing dsa ? And isn't dsa something u do in c?\n├── well i see dsa being thought even w language independent videos,just wanted to know from a senior\n└── very possible to do both. also for dsa I'd suggest cpp or java instead of c. while c is reallly nice, it doesn't have ready to use data structures that you can simply import and use. in java and cpp you can.\n    └── Doesn't that make C better (just curious) ?\n        └── I feel like I didn't make my points clear xd.\n\n\nfor *learning* data structures, c is goated because you'll have to implement stuff yourself, and it also runs fast.\n\nbut for leetcoding, OAs and interviews, what matters is being able to solve a problem. you'll frequently need to use dsa for this, and *every time* you solve a problem, you'll have to implement those data structures and algorithms. imagine implementing a hash map every single time you solve a question needing one. you're gonna waste a lot of time and effort. plus you'll already be in enough pressure as it is lol, you don't want to do extra stuff that's not necessary\n            └── So learn in C, and for competitive coding switch to C++ ?  (java scares me)\n                ├── yeah that's usually what people do. your dsa course will be in c anyways. and the jump from c to c++ isn't too bad for competitive coding, a lot of the same concepts overlap\n                └── yeah that's usually what people do. your dsa course will be in c anyways. and the jump from c to c++ isn't too bad for competitive coding, a lot of the same concepts overlap between the two languages"
  ]
}