{
  "title": "Order of Preference for Faculty in \"Topics in Deep Learning\" Elective (BTECH-CSE, 6th Semester)",
  "content": "Hello, everyone!\n\nI'm planning to take the \"*Topics in* *Deep Learning\"* elective course in the 6th semester, and I'm trying to decide on the faculty. For now, the available faculty members are **Dr. Surabhi Narayan,** **Prof. V. R. Badri Prasad** and **Dr. Uma D.**\n\n**Please provide the optimal order of preference that i need to choose for these three faculties in the form.**\n\nI’d love to hear from those in their *4th year or above* who have taken this course with any of them. **and also please share your experience about the course (its complexity, exam pattern, evaluation....etc.)**\n\n  \nAny input would be super helpful in making my decision! Thanks in advance!",
  "metadata": {
    "id": "1ha8tpz",
    "author": "Interesting-Gur4025",
    "url": "https://www.reddit.com/r/PESU/comments/1ha8tpz/order_of_preference_for_faculty_in_topics_in_deep/",
    "permalink": "/r/PESU/comments/1ha8tpz/order_of_preference_for_faculty_in_topics_in_deep/",
    "score": 12,
    "upvote_ratio": 0.94,
    "created_utc": 1733748052.0,
    "flair": "Study Help :table:",
    "nsfw": false
  },
  "comments": [
    "Surabhi the goat\n\nteaches well, doest gaf if you don't listen also. i took her class last sem for tdl, no regrets\n└── Thanks for the comment, Could you also share your experience with course, regarding how tough the assignments, project, ISA-ESA would be, and a technical report also needs to written, could you please expand on this.\n\nAlso do you have any idea about the other two teachers (badri prasad sir and uma madam).\n\nThanks in Advance.\n    └── course was just fine. won't say its v easy, but not too much math also. it doesn't go deep into any specific concept also, but just an overview of different deep learning domains.\n\nwe didn't have assignments, only a course project iirc. the course project required a technical report which was kind of like a draft research paper. you can choose to do something fun or something relatively simple also, depends on your time and interests. I know a few people who actually published papers from their course project as well.\n\nisa and esa are simple as long as you cover the course material in the slides.\n\nidk much abt badri Prasad sir, but Uma maam teaches well I've heard. the only thing is she's strict abt using a laptop in class, and wants you yo focus only on class and nothing else.\n        └── Thanks a Ton!",
    "Any seniors, please help with this.",
    "Is it too hard? Is a publication necessary to get full marks?\n└── Nope"
  ]
}