{
  "title": "wait do we also get a holiday tom?",
  "content": "",
  "metadata": {
    "id": "1hb0ewk",
    "author": "Potential_Diamond562",
    "url": "https://i.redd.it/ljeg71ebj06e1.jpeg",
    "permalink": "/r/PESU/comments/1hb0ewk/wait_do_we_also_get_a_holiday_tom/",
    "score": 42,
    "upvote_ratio": 0.94,
    "created_utc": 1733832876.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "Delulu ain't solulu here",
    "We were forced to give isa offline during peak covid, you really think they’ll give a holiday?\n└── Stole my line",
    "https://preview.redd.it/0a7h4da9l06e1.jpeg?width=706&amp;format=pjpg&amp;auto=webp&amp;s=2e7ddd03a50d4a90b8b9cc961a678bfc895f8289\n\nCheck your mail\n├── They really said\n\n![gif](giphy|7k2LoEykY5i1hfeWQB)\n├── Nice try\n├── Where is it?\n│   └── I got a mail regarding this\n│       └── Didn't get the mail if we get seating info then we will have exam tomorrow\n│           └── But seating info comes at mindnight... if theres holiday they will have to declare before 9 or no holiday\n└── 1st years haven't recieved the mail yet.",
    "Even if they give a holiday.. theyre gonna keep classes on saturday... which is better?",
    "lol, i hope we do. But its pes bro, idts theres gonna be holiday",
    "No way lol",
    "PES still categorises people that have dropped out of courses as absent in their registers, so, that should tell you something",
    "LOL imagine pes giving holiday for something not on the calendar",
    "Unless you hear directly from Vc in PESU, there won't be. They even conducted exams on campus during covid.",
    "PES? Holidays? yeah no way",
    "https://preview.redd.it/pdtxmbhvm06e1.png?width=780&amp;format=png&amp;auto=webp&amp;s=9cce93b92dc19d19f6d9c0f8d4c52e09af332a42\n\namaatra has holiday, so pes prolly does\n└── In case you did not realise, you are at PES, not Amaatra. They are run by independent management bodies, although they might be under the same umbrella of a parent org.\n    └── yes but whenever pes has holiday, amaatra usually does, so just saying"
  ]
}