{
  "title": "How would you describe the hostel experience at PESU?",
  "content": "",
  "metadata": {
    "id": "1hb0v3g",
    "author": "Twinkling_Paw",
    "url": "https://www.reddit.com/r/PESU/comments/1hb0v3g/how_would_you_describe_the_hostel_experience_at/",
    "permalink": "/r/PESU/comments/1hb0v3g/how_would_you_describe_the_hostel_experience_at/",
    "score": 10,
    "upvote_ratio": 0.92,
    "created_utc": 1733834464.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "Regarding RR Campus\n\nHonestly not bad at all.\n\nThe rules are firm , but they are not followed at all unless there are exceptions, so you're pretty much chilling if u return back before 10pm and follow basic procedure.\n\nThe mess is actually great. There's 3 messes and according to their tastes , everyone ends up finding one which they like the most and there is quite a lot of option.\n\n  \nFor first years , the New Block ( NBX / NB ) rooms are great . ( 3 sharing with attached bathroom ). The IT Block rooms are good but the washrooms are a problem , but everyone learns to manage at the end of the day and finds their suitable timings to adjust with the common washroom and crowd etc\n\nSo far the hostel staff are pretty nice. The guard ocassionally asks to show a pic of the ID card and there's attendance everyday from 9-10, and that's pretty much the only regular interaction u will ever have with them.\n\n\n\nThe only problem is that when you order items , the guards at the front gate may not let them in so u have to speak to them on the phone to bring ur delivery guy inside and that's annoying sometimes. And in some corner rooms the internet isn't great ( 5-10 mbps max ). There's also websites that are restricted , so might as well stick to using hostpot if you have a good plan.\n\n  \nThe laundry system is decent , I've heard that clothes do go missing but everyone always finds it and personally it hasnt happened to me ever yet. \n\n  \nThere's a reading room and a playing area ( table tennis + treadmill + foozball ) in the hostel main building basement which can be used whenever needed , and the reading room is pretty chill cuz u can be there till as late as 5am at night for studying during exams or whatever.\n\n  \nThere's a vending machine that has some cool options for late night snacks and is refilled every morning at around 8am\n└── Did the hostel get a vending machine?\n    └── Yeah there's one near the entrance of NB/NBX/IT Blocks ( Next to Hostel Office )\n        └── Damn everything gets better as soon as we leave fr",
    "In the ec campus, for the first years,  \nIt's shit, the curfew is 7 pm, yes 7pm for boys and 6:30 for girls, you can't do shit here ,it's so far inside, you have to travel atleast 45mins-1 hour to go anywhere meaningful,  there's a tennis and 2 basketball courts but you don't have the access to it, you do have the access to the track till 6:30 pm.  \nThe warden is a son of a bitch, always yelling for no reason, the only good thing is the friends you make",
    "Bro speaking on behalf of the EC campus hostels, the current girls warden is way better than the previous one\n\nthe boys warden was always the best at his job, you just need to known how to Handel people, an absolute chad guy who legit gives no shits unless it is threatening his job,\n\ncompared to the on campus hostel you have access to a lot more things around walkable distance, there is nothing in the range of 3 kms from the campus gate of ec campus."
  ]
}