{
  "title": "Amaatra hosteller guide ",
  "content": "1. If you're ever trying to plan when to come back to hostel, just make sure you reach Hosa Road bus stop by 6 at max. \n\nAfter which you could take a bus from there or even a share auto.\nLatest bus time from that stop is 6:10pm ish. You'll reach amrutha college bus stop by 6:27ish and then speed walk back into hostel. \nOR this is what I do, i take a share auto from there, it's only 30rs per person. \n\nHave attached the picture for the Hosa Road Bus stop and Share Auto Stand.\n\n2. If you ever miss the college bus in the morning, you could go to amrutha college bus stand again to catch a bus. The only bus you can snag is MF-500EB. You have to tell them konappana agarhara bus stop, that's the signal right after PES where you can get off at. \n\nThese are the timings from amrutha stop: 7:45, 8:15, 8:45, 9:45, 10:15, 10:30, 10:45, 11:00, etc \nAgain these are approx, to get the exact location of the bus, you can live track them at the app Namma BMTC. This app is literally a lifesaver for anywhere in Bangalore for you to track buses. If you face difficulty with it you can use Moovit, but it's feature to track is paid. \n\nIt's not even 20rs to take the bus so it's convenient, but if you're a woman with karanataka address, it's free for you anywhere in Bangalore to travel free lol, lmk if you need a fake like mine. \n\nHave added the picture of the amrutha college bus stand too.\n\n3. Also, if you are running late, hosa road traffic is an absolute nightmare for most parts. There's a shortcut however from central jail, there's a left turn and then lots of turns inside which helps you avoid the most jammed part of hosa road, on the way to our hostel. But that shortcut works only for autos and uber two wheelers, and a small car too. \n\nHave highlighted that shortcut route in the picture too.\n\n4. Okay probably last thing, if you need to know what's close by the hostel to get shit done, \n\nLeft of hostel- printing shops, stationary shops, kfc, paradise, subway, fortune supermarket, mrps, laundry shop, tailor shop, smoke shops, shopping outlets, etc (better food areas to chill with friends)\n\nRight of hostel- dominos, momos, pani puri, happy family mart, lassi corner, medical shops, etc",
  "metadata": {
    "id": "1hb1yxx",
    "author": "caramel_drizzl",
    "url": "https://www.reddit.com/gallery/1hb1yxx",
    "permalink": "/r/PESU/comments/1hb1yxx/amaatra_hosteller_guide/",
    "score": 19,
    "upvote_ratio": 0.95,
    "created_utc": 1733838030.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "Edit: you can take share autos anywhere if you miss buses. From amrutha college bus stop also you can catch share autos till hosa road for 30rs"
  ]
}