{
  "title": "attendance bar raised to 85%",
  "content": "My class co-ordinator randomly announced that the minimum attendance to sit for the esa has been raised to 85% and that mail has been sent to the parents of students with attendance below 80. I might be cooked cus even if I attend all my classes, one of my subjects will just be below 85. Are they bluffing to make us attend the rest of the classes or are they serious?",
  "metadata": {
    "id": "1hceo3v",
    "author": "Lanky-Reporter1084",
    "url": "https://www.reddit.com/r/PESU/comments/1hceo3v/attendance_bar_raised_to_85/",
    "permalink": "/r/PESU/comments/1hceo3v/attendance_bar_raised_to_85/",
    "score": 44,
    "upvote_ratio": 0.98,
    "created_utc": 1733983406.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "They are most prolly bluffing\n└── idts  \nfor us 1st sem was 85,2nd sem was 80,3rd onwards it was 75\n    ├── In first sem people got away with 60-70 too so even if they say 85 , keep it above 80 atleast to be safe\n    │   └── I remember my friends got away with 50%\n    │       └── with or without affidavit ?  \n(I remember parents being called if it was below 85% and the end)\n    ├── Because it was when they were changing the policy. Nothing to do with you being in first year.\n    └── That's false , I personally got away with 70",
    "mfers cant they say at the start of the sem , everything for me is below 80 , above 75.",
    "me when i lie",
    "Just in case. Is the average attendance taken or per subject attendance taken?\n└── Per course",
    "Wait wtf , didn't they say 75 ???\n└── i swear what is wrong with them?",
    "My parents have received no mail even though my attendance is  less than 85 , so most likely a bluff",
    "can someone please confirm if this is ture?",
    "bluffer stfu\n└── I wish this was a bluff bro",
    "\\*true",
    "Bro ts is bluff\nIt's 75 %\nThey can't just say ts and the end of the entire sem",
    "Proof?\n└── If it’s confirmed your class coordinator will let you know in the coming days",
    "Only very strict teachers care about attendance. But max leniency is 75% attendance.",
    "give them a medical certificate either they won't let you sit in esa\n├── If it’s like 1 percent difference. Is it fine\n│   └── Search this sub - you'll see someone's post where they are in trouble for a 0.3% deficit. So yes, they can and will be petty about this\n└── Do they verify and perform background checks on medical certificate?"
  ]
}