{
  "title": "Chem lab and matlab",
  "content": "Helppp my mentor said lab exams would be held between 23dec-3jan(exact schedule not shared) but i will be out of station for 4 working days between these days, what happens if I miss a lab exam? Do I lose those 20marks ;-; or do i get to retake it incase i miss is it?",
  "metadata": {
    "id": "1hcrcm1",
    "author": "Sure_Land_3000",
    "url": "https://www.reddit.com/r/PESU/comments/1hcrcm1/chem_lab_and_matlab/",
    "permalink": "/r/PESU/comments/1hcrcm1/chem_lab_and_matlab/",
    "score": 10,
    "upvote_ratio": 0.92,
    "created_utc": 1734027181.0,
    "flair": "Study Help :table:",
    "nsfw": false
  },
  "comments": [
    "You loose it\n└── Fuck",
    "how will the chem lab exam and matlab exams be conducted? can someone explain?\n└── Disclaimer : PES changes the way it does stuff every year so don't curse me if what I said is not the same for you.\nThe matlab exam will be conducted in cbt mode just like isas. For us all questions were mcqs. The marks you score in matlab will be added to the math assignment marks so do well in it.\nThe chem lab exam was pretty chill we didn't have to conduct the experiment at all! we just had to write down the procedure, graphs etc and chem sketch part you do on your own laptop soo.. it won't be hard!\n    └── thanks",
    "Chem lab (for us it was**) - 10m for Submission of record \nAnother 10m - Viva, experiment and one chem structure.\n\nMatlab - U lose everything,cause it will be conducted like how ISAs are done\n└── Can I atleast get those 10marks of lab record if I submit on a later date;-;\n    └── Your best bet is notify your teacher beforehand why you would miss the exam .",
    "No one cares for Matlab. Didn't even appear for any final for it and still got top marks.  Chem labs on the other hand have more weightage and affect gpa. Lab exams usually happen around a week before ISA 2 or before the ESA. They'll tell don't worry.\n└── Okay thanks for the info!",
    "Lol I'm in the same boat as you. Ig I'll lose 10m."
  ]
}