{
  "title": "Do T-1 Companies come during the 8th semester as well or is 7th semester the last chance?",
  "content": "5th sem won't be good for me and to bring my cgpa up to 8.5+ I need minimum 2 sems\n\nSeniors please help",
  "metadata": {
    "id": "1hfpom3",
    "author": "Independent_Loss_746",
    "url": "https://www.reddit.com/r/PESU/comments/1hfpom3/do_t1_companies_come_during_the_8th_semester_as/",
    "permalink": "/r/PESU/comments/1hfpom3/do_t1_companies_come_during_the_8th_semester_as/",
    "score": 22,
    "upvote_ratio": 1.0,
    "created_utc": 1734373401.0,
    "flair": "Placements 🤑",
    "nsfw": false
  },
  "comments": [
    "but they just consider your cgpa upto 6th sem doesn't matter if you are in 7th or not?\n└── Yeah but in 8th sem, your 7th semester's GPA is available. So the most recently available GPA would be your 7th semester GPA. Although it's important to note that since there are few credits in 7th semester, the overall improvement from 6th semester will be marginal\n    └── uh huh i see",
    "Imma be honest brodie, it’s really rare to see T1 companies in 8th sem.",
    "usually T1 companies come in the first few months only. Most of the companies will come and go by December. Plus, the last 2 sems don't have many credits and at this point, it will barely affect your cgpa tbh\n└── So what's the gpa distribution like ? I always thought it's 25% of total for every year :/\n    └── Nah, you'll have just 10 credits for last 2 sems excluding capstone. Most of the credits will be done by sem 6. You'll have 160 credits total. Do the math",
    "In 8th sem, very less companies come, I dont think T1 companies will even come\n└── this was the case last yr ig but this yr many are expected to come",
    "Study hard in the last three sems. Especially sem 6 n 7.\n└── Companies come year round. If you like take the companies details so that you'd at least have their info for reference.\n    └── Probability of companies coming for placement in the last month's of 8th semester vit for 2025 batch?\n        └── They come year round. You need to keep an eye out and apply once they do. You'll get added to the placement email...so you'd know",
    "What about T2 companies?\n└── ditch."
  ]
}