{
  "title": "Missed ISA2 Review 3rd sem",
  "content": "is there a way if i can do review, like last time they gave a Google form to fill out for all those who missed it, these people really messed up by giving 'all' cse people just 1hr for review",
  "metadata": {
    "id": "1hgacjq",
    "author": "ElonMosquitoX",
    "url": "https://www.reddit.com/r/PESU/comments/1hgacjq/missed_isa2_review_3rd_sem/",
    "permalink": "/r/PESU/comments/1hgacjq/missed_isa2_review_3rd_sem/",
    "score": 9,
    "upvote_ratio": 0.91,
    "created_utc": 1734441270.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "Bro my friends and I went in with ECE/AIML students at like 3:30 itself, there was barely any crowd at the time. You could have gone and finished it off quickly because by the time I came out there was a crowd the size of China on the corridor.\n├── There were a lot of ece peeps in aiml slot I had to wait for 30min 😭\n└── hmm my fault didn't know, I thought the management would organize for a smooth flow, they could have peacefully kept it on Thursday :(\n    ├── &gt;management would organize for a smooth flow\n\nTch tch tch, amateur mistake.\n\nAlso next time, remember that they only divide you into slots to distribute you over time slots. You can go for review at any time on the same day.\n    │   ├──  last sem we werent allowed to do that. we had our physics esa that particular day. everyone crowded around the room for isa review right after the exam ended, the teachers shooed us away like stray dogs lmao. I had to stay 4 hours in campus after the exam ended just to wait for my section's turn.\n\n\nI even snuck in earlier, but that shitty thing blocked me from logging in because it was not in the duration of my alloted time slot.\n    │   │   └── Haha some of us slowly in name of collecting stuff, waited and quickly opened the desktop and did the review once teachers left\n    │   └── U can't do that anymore \n    └── Next time try go a bit earlier than the allotted slot lol. There are 700 people, it's bound to get crowded.",
    "Highly doubtful they would do that again"
  ]
}