{
  "title": "How do you balance academics and extracurricular activities while studying at PES?",
  "content": "Help me in Tackling this. ",
  "metadata": {
    "id": "1hh03u6",
    "author": "TheDoodleBug_",
    "url": "https://www.reddit.com/r/PESU/comments/1hh03u6/how_do_you_balance_academics_and_extracurricular/",
    "permalink": "/r/PESU/comments/1hh03u6/how_do_you_balance_academics_and_extracurricular/",
    "score": 14,
    "upvote_ratio": 0.89,
    "created_utc": 1734523398.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "Disclaimer: I'm not someone who had the greatest GPA, I had an 8.7. But I did graduate with far more on my resume than what I could have imagined and had what I would like to call a solid profile, arguably better than most of my batch, with awards to show for it. It all goes down to two things: (1) time management and (2) prioritisation of commitments, and these both go hand in hand. Let me break down what worked for me: \n\n1. **Time Management**: A bit self-explanatory, but you need to manage your time effectively here. If you're a freshman, you'd know by now that last minute prep doesn't work here and in general, there's a lot of academic rigour here from assignments to labs. Planning out days in advance (I used to plan out a week in advance), being systematic about using the time you have and optimising for efficiency is the key. If you know a course is going to take time, start preparing in advance. If you know a course has a project, don't wait until they announce it - start at the beginning of the semester. If you travel, use that travel time to either read up on stuff or catch some rest (I used to take quick naps on the metro and I needed to travel from Indiranagar to Mysore road). Don't spend time behind things that don't matter or won't add much value in the future. \n\nYou should also try allocating time systematically for studies and other work. I used to follow a 0-1 policy for this. Until 2 weeks before an ISA, I wouldn't touch academics except (1) labs and assignments and (2) difficult theoretical courses which needed memorisation. So 90% of my free time beyond academics were spent in other things - founding a club (HSP&gt;&gt;&gt;), representing PES at contests, organising fests, etc - no academic work unless absolutely required. 2 weeks before the ISA, I'd stop everything else. No other work, it was college-study-repeat. This reduced the context switching that was needed and always helped me focus better. I never bunked classes (except emergencies). I'd maintain as close to 100% as possible. Now if you've done the math, you'll know that you can skip ~2.5 weeks of classes. 2.5 weeks before the ESA, I'd disappear, only showing up for lab exams and 1-2 classes. This gave me time to prepare in a relaxed manner. \n\nSo managing your time well, planning out days and efforts in advance and ensuring you give the right time for the right tasks is very important. Effective and efficient planning is extremely underrated and can do wonders. Start things early, finish them early. Don't leave prep until the very last minute. Make the most of whatever time you have. Don't waste time on things that don't help you. When you're doing something, make sure you're 100% efficient (don't use your phone while studying!). Draw a timetable for yourself if it helps you.  \n\nNow, giving time for things is important, but it's also important to know *how much time* to give something -\n\n2. **Prioritisation of Commitments**: This is very important and many don't do this. Draw a boundary for every commitment that you have in life: whether it's that CGPA, a lab for a course, a project, something beyond academics, etc. Put in as much effort into something until you hit the boundary for it, beyond that, stop. These boundaries need to be such that hitting them gives you the satisfaction of being happy with doing that activity but going over it comes at the sacrifice of reducing the boundary of something else, leading to dissatisfaction in another venue.\n\nTo give you an example: I laid down a GPA boundary of 8.75 for myself in my first sem. Was I capable of getting more? Ofc, no doubt about it. I knew if I focused only on academics I could even hit a 9.2+. But I knew that doing so meant I would sacrifice other things. When it came to labs and assignments, I did the bare minimum to get a perfect score. When it came to projects, I put in the bare minimum for courses that wouldn't reward my efforts and put in my 150% for courses that mattered, which helped me build good projects (many of which eventually got published at great conferences). At any time if I felt like I could do more and had the bandwidth to, I'd adjust the boundary I set for myself. If I felt I was dedicating too much time to something, I'd reduce it. By putting in as much effort as needed for something to make myself satisfied, I was able to prioritise other things like extra learning and research I pursued on the side. So the next time you feel an assignment/lab/project is taking too much time and if you submit it as is you'll be okay with the marks and extra effort isn't worth it, do it. Save the time for something else. You should judge and decide where your boundaries are drawn. But remember that you *must* hit the boundary for everything, because only that guarantees you being satisfied. You can't set a GPA boundary of 8.5 but only put in efforts to get an 8. That breaks this system and you don't achieve what this approach hopes to. \n\nTo summarise, I'm not saying what worked for me will work for you. But this is what I followed, and it did help. Maybe you can adapt something similar or better for yourself. At the end of the day, it's how you juggle your time between multiple activities.\n├── Bro you seriously have so much patience to sit and properly deliver a well written answer. Respectt ++\n├── How do you have your life figured out?? like dam.\n│   └── That's the best part: I don't. Nobody has their entire life figured out. \n\nRemember that every single person around you is experiencing the present for the first time. Nobody has prior experience in anything they are going through now. But they do have past experiences, which they can share with others.\n\nI went through undergrad at PES, so I share suggestions on what worked for me or what I should have done, hoping that they can help you all out too. Similarly, you guys have just completed schooling, so you're in a position to do the same to your juniors. Right now, during my Master's, I reach out for advice to my seniors who have already completed it. \n\nLife is all about experiences: collecting new ones and learning from old ones. Insights from someone's experiences are always valuable. Nobody has their future figured out, they only know what they could have done to make their past better.\n│       └── Another thing that helps is having a supportive group of friends in college who are also more or less aligned with your goals ( u/rowlet-owl being one of them)\n│           └── Awww\n├── Hey bro, can we connect on LinkedIn? I’m a first yr from bmsce and wud like to learn from ur profile\n│   └── Sure, DM me your profile link.\n└── Hey, where can I find your projects that were published in conferences?\n    └── Google my name. You'll find them.\n        └── Found it. Also cool website!",
    "Either you do pes or extracurricular activity.\n\nGraduated already.\n\nSpeaking from experience.",
    "That's the neat part. You don't ",
    "You may have to skip some classes especially if you're timetable is full 8hrs. Tell your teachers before you do...so they can mark attendance. Probably have to self study a bit.",
    "thats the catch. you dont"
  ]
}