{
  "title": "Advice on ISA and ESA prep",
  "content": "Hi, I'm a first year student about to give my ISA-2 and ESA in Jan. I scored slightly above average in ISA-1, with all my individual subject marks higher or same as the batch average. So far, I've completed nearly half of the syllabus for ISA-2, haven't really started preparing for ESA yet. I think I might be able to cover QB and ESA PYQ's (very surface level prep basically), but may not be able to go through the textbooks, or even learn any concepts in-depth, will this be enough(if I'm aiming for 8.5+gpa) or is there any better approach or any more resources I should prioritize above these? (Btw: I have gone through the FAQ's, but I just need some genuine advice, coz so far everything I do wrt my exam prep just seems to be wrong😭)",
  "metadata": {
    "id": "1hoa4s8",
    "author": "Independent_Camp_317",
    "url": "https://www.reddit.com/r/PESU/comments/1hoa4s8/advice_on_isa_and_esa_prep/",
    "permalink": "/r/PESU/comments/1hoa4s8/advice_on_isa_and_esa_prep/",
    "score": 19,
    "upvote_ratio": 0.89,
    "created_utc": 1735405903.0,
    "flair": "Study Help :table:",
    "nsfw": false
  },
  "comments": [
    "Make sure to cover all the slides and notes thoroughly.\n\nI recommend referring to Vibha Notes for your revision if you are short of time or else you can make your own sheets/short notes for revision \n\nAdditionally, go through PYQS (Previous Year Questions) to get an idea of the question paper pattern. However, be prepared for a few unexpected or tricky questions that deviate from the regular pattern,\n└── Also, aim a little higher-9+ GPA- since you mentioned that you still have ISA2 and ESA remaining,Which gives you enough time to put in consistent efforts. Maintaining a good GPA record is always safe imo 🥲\n\nGood luck!\n    └── Alright, thank you so much!",
    "kys\n├── Most sane answer fr\n└── 😭",
    "Just study\n└── There's no proper guidance as to how to study the slides are shit in most of the subjects with surface level stuffs in it and they ask beyond stuffs in exam no one here is giving genuine reply as to how to study...the teachers just teach for namesake atleast for me except one or 2 subjects..please someone tell me If not others what you guys honestly do for exams\n    ├──   There’s no secret formula to study for esa that we seniors are hiding. It’s literally as simple as just studying as for some people just slides are enough to get S grade while some need extra help. It differs person to person ,but I’ll breakdown how I studied in first year (I have 8.66 cgpa)Depends what cycle you are, for math understand the concepts from av summary or YouTube videos and be through with class work and question bank problems, mechanics is the easiest as they ask the same questions without any change in isa and esa so just be through with all prescribed questions, python study from notes and you should be good, chemistry and epd I studied from my own notes so cannot tell you much about those but slides were good enough. Physics first read through PESU notes and then Faizal sir slides do all numerical in both slides and notes, EEE slides were enough just be clear with the concepts and solve every numerical you get it’s an easy scoring subject, mechanical just reed through the slides like a story book and do slides numericals use pyq as guidelines to understand the type of questions they will ask in exam but don’t expect to do well with just solving a few pyq.\n    │   └── Thnx! This is really helpful...\n    ├── You need to understand that it's a university, and things here are highly dynamic and unpredictable. Even we, as seniors, can't always predict which suggestions will work in your favor and which might backfire. So, stick to standard plans and consider adding a strategy like maintaining short notes to refer to a day or even a few hours before the exam. This will help you get a quick overview of the entire syllabus. Even if unexpected questions come up, you can make a decent attempt, hoping for the best later on.\n    │   └── Thanks sir\n    └── So true, that's exactly why I asked this q...",
    "Tell me which cycle you're in and I'll help, i have a 9.5 in first year (telling you for credibility, not to flex lol)\n├── Chem cycle\n│   └── dm me\n└── Physics cycle\n    └── dm",
    "Know what ur teachers want in ur answers. Look through textbooks and old papers."
  ]
}