{
  "title": "Minors ",
  "content": "Are these courses going to be of any help? \nI'm really confused if I should apply for these minors ",
  "metadata": {
    "id": "1hoyilm",
    "author": "Turbulent-Spinach360",
    "url": "https://www.reddit.com/gallery/1hoyilm",
    "permalink": "/r/PESU/comments/1hoyilm/minors/",
    "score": 23,
    "upvote_ratio": 1.0,
    "created_utc": 1735486856.0,
    "flair": "Study Help :table:",
    "nsfw": false
  },
  "comments": [
    "I love minors\n├── ![gif](giphy|26ghbWoXv3G6ypo8o)\n│   └── ![gif](giphy|81xwEHX23zhvy)\n├── Diddy is that you ?\n├── P in P.Diddy stands for PES\n└── https://preview.redd.it/20z0bv8xuv9e1.png?width=1071&amp;format=pjpg&amp;auto=webp&amp;s=48fb3f45b54890913f058c3cff6633027044864f",
    "Can't speak for your course.\n\nBut for engineering students it's mostly useless. Everything useful is already available online",
    "Pocso lagega",
    "If we don't take them now,when and how do we have to claim those 4 credits?",
    "Mat kar illegal hai\n└── Agar me khud minor hu tho?\n    └── karke soja",
    "Just one piece of advice, for any one struggling to decide the courses.\nI have a PhD in management, and while I have realised based on how most of my students today choose their electives.\n1. I want to do something in this domain (usually finance) so I will take this course.\n2. There is a high demand for this in industry (consulting or in this case business management) so I will take this course.\n\nDon't do that.\nWhatever course you take is going to give you an idea of that subject. You wouldn't get any expertise on that subject based on one or two courses. Cause you took say 2-3 electives of management companies wouldn't give your brownie points or prod mgmt role and as someone who sits on student recruitment (admission) you wouldn't get points for your MS/MBA based on your elective too.\n\nElectives are meant for you to learn about a field you can think about more. For instance, if you take an introduction to psychology you would learn about behaviour and if you are doing ML to your degree a big part of modern day Psych is applied to ML to help detect depression, read micro expression, now instead of blindly throwing data (everyone X or Y) at it you'll understand the basic language of psychology if you do so and those X will make sense and you may be able to do a little better than others. \n\nIf you want to study say finance , for some reason most of the GenZ (I'm a 97` born too) things studying finance makes money, a management degree teaches how to build business. No it doesn't. A finance course will teach you the meaning of the words, at best you'll be able to read annual reports partially after a couple of good courses. Management is different from Entrepreneurship. Management teaching administration, not Entrepreneurship. \n\nPersonally speaking, if you like to understand behaviours take a psych course (can refer for an interesting supplement https://youtube.com/playlist?list=PL44ABC9278E2EE706&amp;si=8F-LE-n_6qbBJlId) or go for microeconomics (refer https://youtube.com/playlist?list=PLUl4u3cNGP62oJSoqb4Rf-vZMGUBe59G-&amp;si=XRC3JSGu_giqh76V)\nPsychology teaching how people/group/organisation work and Economics teaches how markets/money and resources work. Both help you in everyday decisions you don't even think once before taking.\n\nRest choose wisely and enjoy the learning process.\n└── Thank you so much for your reply!. I just thought I'd give it a go in case it would help me later. But my gpa is down in the gutters and more load on me would just make my gpa worse I think I'll just try some online courses instead so that I can learn new things on my own! Any recommendations would be really helpful! Since I am a cs student and don't really have any experience with other fields of study I really appreciate your guidance!\n    └── It depends on your interests, if you can share the broad areas I can recommend some good options.\n        └── Psychology or business management please\n            └── I would suggest going for either economics or intro to psychology only cause these are courses which have online support plus are too foundational so the chance of getting a good faculty is much higher.",
    "+1 ,\n\nsome of the subjects seem interesting to me…\nNeed advice\n└── I know same! But I need to know if they'll be worth the hardwork and I'm also scared what if the courses are not taught well",
    "Damn Imagine Imagine business management at MBA level ( if they teach properly )\n├── Supplement your topics in class with good books and top universities free lectures and you'll be Golden. I scored extremely well for an engineer during finance and strategy cause of this practice than a lot of BCom guys during my MBA courses at IIMX. \nSadly, others are also right about the syllabus and quality is a bit worrisome in PES for management It's okay for engineering also but we produce great engineers anyway, so it could happen for management too, be optimistic and enjoy.\n│   └── I’m considering to appear for CAT , will prepare for it have a profile of 9/9 and afaik I would target 8.5 for in all sems so 9/9/8 would . If I pick any of these business management courses and further if I get some certificates ( professional ) on top of these courses then would it help me in getting a call from IIM A/B/C ? 0 workex I wanna attempt CAT in 4th year itself. I’m GEM btw\n│       ├── I hate to say it but unless you get a 99.5+ you have absolutely no chance. And even with a 99.5 you have at best a 20-25% shot at C, and even less for A or B.\nThe criteria are as such, you lose a lot right out of the gate on academic diversity and gender diversity. \nAhmedabad will call the top 100 engineering profiles, that's a tough tough bar to clear. Bangalore gives a good weightage to experience so you'll not get ahead of the crowd there as well. Calcutta is losing its charm so you might face lower competition there.\nRather try for ISB, it's a better school and would get a big scholarship too.\nhttps://www.isb.edu/en/study-isb/post-graduate-programmes/pgpyl.html\n│       └── Also none of the professionals, even the govt medals would get you till you get into the PI round. That's the only place where your subjective excellence could even be tested. Rest all is objective and there are no points on resume\nPS: Those would surely help when you get into a college for getting summers.\n└── Even for MBA students they won't \nThis is PES man",
    "During my bachelors I only got two minors: business and computers. If you get any other departments then your lucky.\n└── Ohh!"
  ]
}