{
  "title": "Regarding GPA - Per Course",
  "content": "Just to clarify, I wanted to confirm: if someone scores 81, he receives an 8 GPA, and if someone scores 88, he also receives an 8 GPA. Is there no distinction between scoring 81 and 88? Am I correct, or is my understanding incorrect?",
  "metadata": {
    "id": "1hq83u8",
    "author": "AdFirst3371",
    "url": "https://www.reddit.com/r/PESU/comments/1hq83u8/regarding_gpa_per_course/",
    "permalink": "/r/PESU/comments/1hq83u8/regarding_gpa_per_course/",
    "score": 9,
    "upvote_ratio": 0.72,
    "created_utc": 1735623997.0,
    "flair": "Study Help :table:",
    "nsfw": false
  },
  "comments": [
    "Once again requesting kids to read the FAQs instead of posting redundant questions T_T\n└── Apologies, Sir, if I have repeated any questions. My intention was not to ask how GPA is calculated—I have already gone through the FAQs and previous posts. My query is more about the fairness of the GPA system. For instance, if one student scores 81 in all 5 subjects and another scores 88 in all 5 subjects, there is a clear difference in their overall marks. However, under the current GPA system, both receive the same GPA.\n\nWouldn't it make sense to rethink the system? For example, someone scoring 81 could get a GPA of 8.1, while someone scoring 88 could receive 8.8. The only exception would be for scores above 9, as the maximum GPA is capped at 10. Might be 9+ students can awarded something like 10+O , 10+A something... In my opinion, such an adjustment could make the GPA system more reflective of the actual performance.\n    └── You don't have to call me sir lmao. \n\nI get your point. Obviously, a difference of 7*5=35 is significant. Unfortunately, that's just how GPA is calculated. I guess the main objective of the GPA system was to build some form of performance range where everyone performing in the same range would be rewarded equally. This is probably built on the assumption that everyone in the same performance range is equivalent and there isn't much difference in academic ability between two students in the same range, that is, someone who gets an 81 on one day can also get an 89 on their good day, and someone who gets an 89 can similarly get an 81 on their bad day. However, people in two performance ranges do have some difference in academic ability so they are rewarded differently. \n\nIt does promote fairness, but I get your point too. I guess there will always be people who will call it a design flaw and some who call it a beneficial step.",
    "Most of the time, in each subject, scoring 81 - 90 (both inclusive) will get you an A grade which is 9 GPA. \nAnd 91 - 100 fetches an S grade, which is equivalent to 10 GPA.\nHowever, these numbers may change from subject to subject if the college decides to perform relative grading for that particular subject.\n\nThere is no difference in scoring 81 or 88, as both will fetch u an A grade",
    "81 and 88 will both be 9(A grade). It is however subject to moderation - they might make it 85 cutoff for 10(S grade) instead of 90, then 81 would be 9 and 88 would be 10.",
    "Yes, you are correct. The grades depend on the ultimate 'range' in which your marks lie. \n\nHowever, the range isn't always the same. At least from my experience, it depends on the subject and whether the grading is absolute or relative.",
    "they also look at the class average and make a moderation. Assignment, ISA marks matter too"
  ]
}