{
  "title": "New Year's Resolution : Read The FAQ's",
  "content": "95% of the posts I have read this year are doubts that have been addressed in the FAQ's. If it hasn't been answered in the FAQ's, it has been answered under a post that has already been made by a guy who had the same doubt when he was a junior. It is highly unlikely if you are a junior that someone has not had the same doubts as you in the past. So please exhaust every source of information available before posting. In fact as a general rule of thumb in life you should always ensure you have made every effort possible to find the answer to your questions before seeking third party help. ",
  "metadata": {
    "id": "1hqd0mg",
    "author": "Sudden-Cow-2930",
    "url": "https://www.reddit.com/r/PESU/comments/1hqd0mg/new_years_resolution_read_the_faqs/",
    "permalink": "/r/PESU/comments/1hqd0mg/new_years_resolution_read_the_faqs/",
    "score": 56,
    "upvote_ratio": 0.97,
    "created_utc": 1735645195.0,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false
  },
  "comments": [
    "Yet they will post the same questions again. Wait and watch.\n├── I've started deleting a lot of redundant posts. You'd be surprised to know how many people still post the GPA question.\n│   └── We understand the concerns of juniors, because we were there in their position at some time, but there's a thin line between concern and stupidity.\n│       └── Exactly. I understand where the questions arise from. But almost all of these have been answered multiple times.\n└── its not that deep bro, itna kyu marta hai",
    "Someone please add some content related to electives also in FAQ'S\n└── What content are you referring to? \n\nRegardless, the reason we don't add elective info to the FAQs is because,\n\n1. Electives tend to be shuffled around between semesters and they also can change from one batch to another. \n2. Syllabus keeps changing every year and an elective which is easy in a certain year can be challenging the next year. Popular examples are HCI and AIR in CS. \n3. They also depend on the prof taking it. A good prof can make a difficult elective easy and vice versa. \n\nSince there's a lot of variation every year, the suggestion is to always ask the previous batch about elective information.\n    └── Oo ok then it's hard to add,anyway thanks 😊"
  ]
}