{
  "title": "Masters abroad",
  "content": "Im currently a 3 rd sem ECE student who wants to persue masters in ece mostly frm usa. I am planning prep the entire 4 th sem fr GRE and then get done with the exams in the 4 th sem holidays (since the gre scores are valid fr 5 years, and i think 3 and 4 th yrs are too hectic to prep fr both gre and capstone and studies). Seniors who've written gre , do u think this is the correct approach? Also where did u get the materials and study from? (books, coaching , yt videos ) Please do suggest anything that has helped you or you could have done better !",
  "metadata": {
    "id": "1hrl88g",
    "author": "Fast-Consequence6360",
    "url": "https://www.reddit.com/r/PESU/comments/1hrl88g/masters_abroad/",
    "permalink": "/r/PESU/comments/1hrl88g/masters_abroad/",
    "score": 26,
    "upvote_ratio": 0.96,
    "created_utc": 1735790872.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "Most people prepare for GRE/TOEFL only after 3rd year because that's when they get more time over the summer. Plus, it also helps you plan better because many unis nowadays don't need the GRE, so a lot of people skip writing it. So if you spend some time figuring out which programs you want to apply to, you might realise that you don't need it. Additionally, the TOEFL is valid for 2 years only, so writing it too early makes no sense. Most people start the MS admissions process about 8-10 months before the cycle begins, so yes, you're too early. \n\nRegarding books, I recommend using all the ETS prep books for all sections, Manhattan 5lb book for quant, Gregmat and Magoosh flashcards for vocabulary. There are other books as well but these are good to start with and should cover your prep. You can get soft copies of most of these books online. \n\nThere's a discord server of PES kids applying for Masters (and currently pursuing MS). I think some resources have been shared there. DM me if you want the link.\n├── Thankyouu sm!!\n└── Could you please DM me the link ?",
    "For GRE ,Gregmat (5$ a month)is the best for verbal and quant ,follow the books he suggests and his 2 months course is quite hectic and enough to cover.\nFor TOEFL  , I used TST prep templates free on youtube\n├── Thankyouu sm!!\n└── Agree 100% with TST Prep for TOEFL. The videos are all that you need to get a great/perfect score",
    "4th year is when you get more time bruh"
  ]
}