{
  "title": "I've confirmed my ESA registration for the 1000th time but this message isn't going away. Is this normal or has it not accepted my confirmation?? (Already tried on both mobile and web btw)",
  "content": "",
  "metadata": {
    "id": "1huw1si",
    "author": "me_da_Supreme1",
    "url": "https://i.redd.it/2jwf8kdqocbe1.png",
    "permalink": "/r/PESU/comments/1huw1si/ive_confirmed_my_esa_registration_for_the_1000th/",
    "score": 23,
    "upvote_ratio": 0.97,
    "created_utc": 1736159246.0,
    "flair": "Study Help :table:",
    "nsfw": false
  },
  "comments": [
    "yo redditmods i feel like there should be an FAQ section dedicated to just the insane number of technical bugs in pesuacademy cuz every year we'll have new junior's discovering PESU's incompetence\n└── Good suggestion, will do",
    "No issues this will persist, only if you want to withdraw any course it’s needed by default you’re enrolled in all.\n├── Alright thanks for confirming!\n└── What happens if we withdraw\n    ├── it's a backlog I believe...\n    ├── Search the subreddit, someone asked this a while ago.\n    └── Means you will take again some othertime but its marked as W. You need to finish the course to get your degree. Drop is when you don't.\n        └── Will a withdraw affect your SGPA or CGPA negatively? I scored really well in math in ISA1 but due to unfortunate circumstances couldn't do the same in ISA 2 and that's obviously going to affect my grade. I was aiming for \\~9.5 CG just for context. What happens if I withdraw from math rn?\n            └── It just means you need to take it again some other time...like a regular subject.\n                └── So how will this semester's SGPA calculated? If previously they were calculating out of 600 marks (all 6 subjects), they'll only consider 5 now? So out of 500?\n                    └── Yes\n                        └── and for the next sem it'll be out of 700?",
    "Its a very normal thing for pesu app and website lol DW\n└── Just click Esa Registeration for the amount of subjects you have and leave it.",
    "Heard seniors 7 years ago also had the same problem , idk y can't they fix it lol\n└── its not a bug, its a \"feature\"\n    └── Oh damn",
    "It is normal dw, it doesn’t go away. If you’ve done it once thats enough.",
    "Just do it once, it will get recorded. This problem has been there since I was in my first year back in 2021 lol\n├── Make that my first year in 2018 lol\n└── Why have they still not fixed it lmao 😭\n    └── if it gets the job done dont fix it.",
    "first of all why do these people want to provide options like this and simply panic us\n\ninstead they can be liberal and provide choices in ISA and ESA",
    "wait if you click on drop or withdraw, it shows that instead of 'Enrolled' right?\n├── You are treading dangerous waters buddy\n│   └── Oh, I didnt mean it like that, just wanted to confirm in case i misclicked while enrolling somehow (anxiety fr)\n├── Do you want to do that?\n└── I guess so, don't wanna check though 🫡\n    └── understandable lmao",
    "You can enroll once but beyond that its useless. Can withdraw or drop",
    "should work on the 6900th time, else skill issue\n└── Tried it 5900 more times and it's still not working, PESU website has skill issue"
  ]
}