{
  "title": "cse sem4",
  "content": "can any of the seniors share their study plan for each  sub of sem4  \n&lt;yt videos,  references........&gt;",
  "metadata": {
    "id": "1hv0dzj",
    "author": "Tech_savvy_Jnr3206",
    "url": "https://www.reddit.com/r/PESU/comments/1hv0dzj/cse_sem4/",
    "permalink": "/r/PESU/comments/1hv0dzj/cse_sem4/",
    "score": 18,
    "upvote_ratio": 0.95,
    "created_utc": 1736174089.0,
    "flair": "Study Help :table:",
    "nsfw": false
  },
  "comments": [
    "I've forgotten which courses are there for sem 4 now, but I think these are the ones:\n\nMPCA, OS: Read the textbook. Please. These textbooks are among the best for these concepts and far better than your PPTs can ever hope to be. Yes they are big, they take time to read, but they delve into the topics far more comprehensively than points on a slide. You will understand the concepts better if you learn from thee book because they are explained in detail. PES tends to also pick questions from the book for ISA/ESA, so its a win-win if you solve them too while learning. You can use the PPTs or other resources to revise.\n\nDAA: Practice as much as possible. Work on building your logic. There are multiple websites from hackerrank to LC to practice and build your aptitude. This is arguably one of the most important courses in UG CS. Remember that the stronger your logic, the easier your placement season becomes. Learn concepts thoroughly so you can fast-track placement prep. \n\nLA: Was pretty straightforward, mostly matrix math. I used notes I had made during class. Just pay attention I guess, its usually a straightforward course (and interesting too) if you listen. \n\nCN: Absolutely hated it personally and found it really tough (biased but it is what it is) but it had a good textbook as well. Same things for MPCA/OS apply here.\n├── tks a lot :)\n├── I thought CN would be the easiest one\n│   ├── As I said my opinion is biased since I had no prior interest in it. The easiest courses will usually always be the courses you have prior interest in.\n│   ├── 1st 2 units are easy . Last 2 are difficult \n│   └── Same here\n│       └── Yeah buddy\n└── You're the only one for me to stay alive on this sub 😅\nThanks a lot man."
  ]
}