{
  "title": "Leaving pesu after 2nd year.",
  "content": "I'm planning on leaving pesu B.tech course in the after second year, will I have to pay all of my tuition fees for all 4 years? Please guide me I really need to make a decesion.",
  "metadata": {
    "id": "1hvis49",
    "author": "anastusuh",
    "url": "https://www.reddit.com/r/PESU/comments/1hvis49/leaving_pesu_after_2nd_year/",
    "permalink": "/r/PESU/comments/1hvis49/leaving_pesu_after_2nd_year/",
    "score": 38,
    "upvote_ratio": 1.0,
    "created_utc": 1736222207.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "Question (and you can choose not to answer): \n\nWhy leave after 2nd year? After the 1st year is understandable because of numerous reasons. But after 2nd year you're done with half of your degree. I'd say practically you're done with *more* than half of your degree since the only actual \"year\" left is 3rd year. 4th year is capstone, placements/internship and Masters admission prep with no offline classes. College is practically over after 6th semester, the final year, although very important to your career, is almost a formality when it comes to college related stuff. Surely, it must be easier to just stay for 2 more years, right? Especially given that PES doesn't transfer credit. \n\nI'm pretty sure you have a reason but I'd like to hear it if you don't mind sharing.\n└── Do we have to pay full fees for 4th year ?",
    "As a junior I want to know what lead to this as I would like to be careful\n└── OP is a first year themself.",
    "If you are leaving I would recommend finding a uni where you can continue from where you left, so you don't lose out on years or money on condition you like to continue studying B. Tech,\n\nAs far as I know you don't have to pay the full 4 year tuition fee unless from the management seat.\n└── Huh!!? So bro if I’m from management and I want to leave then I’ll have to pay for all 4 years?? Please let me know, and how credible is it??",
    "No",
    "My friend left in between the first year and he only had to pay the fee for one year",
    "Can you specify the reason for leaving?",
    "Just don't pay....we pay on a year by year basis.\n└── What about the certificates?\n    └── What certificates? Any scholarship ones will not be given since you're not continuing.\n        └── The marksheets of 10,12 and stuff\n            ├── Just go to admin office and they’ll give it back to you. I was planning to leave after 1st year and got mine back right after 1st sem\n            └── That you have to collect of course. Talk to your department office"
  ]
}