{
  "title": "Did I fuck it up",
  "content": "due to heath issues I didn't do quite well in sem 1 and it feels like it's gonna be the beginning of the downfall. I didnt perform as expected in isa1 and I can see a similar trend in isa2 and mostly esa also. I can't bring myself to study rn coz it's just bothering me how I could've done better but still didn't. \n\nI am also in chem cycle which means I just let go of the most scoring sem of my college life and I just can't stop worrying. What do I do?",
  "metadata": {
    "id": "1hvowvo",
    "author": "[deleted]",
    "url": "https://www.reddit.com/r/PESU/comments/1hvowvo/did_i_fuck_it_up/",
    "permalink": "/r/PESU/comments/1hvowvo/did_i_fuck_it_up/",
    "score": 43,
    "upvote_ratio": 1.0,
    "created_utc": 1736247337.0,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false
  },
  "comments": [
    "Even if you do end up getting an unsatisfactory GPA, it's easiest to change your CGPA in first year. It gets harder and harder as you progress since CGPA is a weighted average of credits x grades. More credits you obtain, harder it is to change your CGPA.",
    "Study for the other sems and prove to yourself you don't need help from easy subjects to get a good gpa. Just pretend that all sems were hard anyway.\n\nTruth be told there is no \"easy sem\". It's all relative and if you study you will score. It's that simple\n\nJust because you lost some marks here and there, doesn't mean you throw all of it out the window",
    "Answer to whether you fucked up : yes \n, it happens , forget it  , move forward and ace the next set of exams , it will sting a bit but u can only control the future rit",
    "Doesn't matter much in the long run. That is true that 1st year is little easy because most of the topics are familiar.\nYes, you can study to improve your average GPA, but still unless there is some cut-off for placement of a specific company(like Wipro) or you are planning to study further, it's all fine.\nWork on your skills that will help you more to get the job not just the marks.",
    "brother chill out we got 8 sems\n└── To fuck it all up",
    "I was in the exact situation a few years ago. \nLike others have pointed out, as long as you perform better in the upcoming semesters, your CGPA will gradually improve. \nIn my case, I was able to improve my CGPA by 3rd semester. (It can also be better than this)\nIt takes some hard work, but starting semesters is when you can put your effort and energy. \nGoodluck.",
    "https://preview.redd.it/rc7441g79pbe1.jpeg?width=640&amp;format=pjpg&amp;auto=webp&amp;s=aecaf4c044c6fb887120bc2104dc99fc12579b7a",
    "You can still turn it around. Trust me",
    "You just answered your own question."
  ]
}