{
  "title": "Am i cooked",
  "content": "Im in first sem(chem cycle) and I'm aiming for cnr scholarship,my isa 1 marks are 26-28 in all subjects and my isa 2 will also mostly be 25-32, assuming full marks in lab and assignment, how much should I score in my esas for cnr?🫠\nAlso, I saw someone ask in discord for the sgpa cutoffs for scholarship but no-one answered.\nJust give me an approximate number that I can set as a target.\n\nPs I tried using the calculator in faqs but it doesn't have the weightage of the 2 credit course  and doesn't count the lab marks of the 5 credit courses :(\n",
  "metadata": {
    "id": "1hwjqod",
    "author": "Sure_Land_3000",
    "url": "https://www.reddit.com/r/PESU/comments/1hwjqod/am_i_cooked/",
    "permalink": "/r/PESU/comments/1hwjqod/am_i_cooked/",
    "score": 20,
    "upvote_ratio": 0.92,
    "created_utc": 1736341357.0,
    "flair": "Study Help :table:",
    "nsfw": false
  },
  "comments": [
    "Cooked\n└── Nah I'll cook😈😈😈\n.\n.\n.\n.\n.\n.\n....myself",
    "When I was in chem cycle as first sem, cnr was minimum 8.6+, so A/B in all subjects is MINIMUM(80+/100 OVERALL). Lab marks everyone usually gets full so you can nullify that, just focus on your isa/esa/assignment\n├── Is the correction of assignment(open book test) strict or will they give 9+ to everyone?\n└── My seniors said that they don't release previous year esa questions so I'd like to know how hard is it to get 85+/100 in esa actually? How much can someone who scored above 25 in the isas score in the esa?\n    └── that depends on your esa prep I've seen people with like 8/40 or 12/40 in ISAs pull a C or even B grade in a subject, so just do your best, aim for full, don't think about 85+/100 bec pes always have a weird relative grading",
    "&gt; Im in first sem(chem cycle) and I'm aiming for cnr scholarship,my isa 1 marks are 26-28 in all subjects and my isa 2 will also mostly be 25-32, assuming full marks in lab and assignment, how much should I score in my esas for cnr?🫠\n\nUse the GPA calculator \n\n&gt; Also, I saw someone ask in discord for the sgpa cutoffs for scholarship but no-one answered.\n\n8.75+ is a safe bet for most times\n\n&gt; Ps I tried using the calculator in faqs but it doesn't have the weightage of the 2 credit course  and doesn't count the lab marks of the 5 credit courses :(\n\nThere are explicit instructions for editing the credits per course and adding rows for more courses. Did you try that? The calculator is a tool, you will need to actually use it by manipulating the values.\n└── Yeah I tried to add a row but then i realised they never explained how the grading for constitution worked like there's no assignment for it so idk what to enter in the assignment marks column🫤 and also the chemistry score is out of 120 which is reduced to 100.\n    └── If there's no assignment, it's 0. \n\nI believe all scores are first scaled down and then added, instead of first adding and then scaling. That's what we used to do anyway."
  ]
}