{
  "title": "Doreswamy and bouncer fanfiction",
  "content": "  The university campus was a quiet place on most days, especially in the early mornings before students poured in for classes. Doreswamy, the chancellor of the university, was an early riser, known for his calm demeanor and meticulous attention to the workings of the university. His days were often filled with meetings, decisions, and overseeing the overall well-being of the academic community, but he had a soft spot for those moments of solitude before the rush began.\n\nOne such morning, as he walked through the campus courtyard, he saw him again—the bouncer. The giant figure stood tall near the gates, his presence like an unspoken promise of safety. With his broad shoulders and towering height, he was an intimidating figure to most, but Doreswamy noticed the way the bouncer moved with purpose, his posture one of quiet strength rather than aggression.\n\nDoreswamy had always admired him from a distance. Their interactions had been brief, and the bouncer never spoke much, but there was something about the way he carried himself—a calm that balanced out Doreswamy's own busy, often chaotic days.\n\n\"Morning,\" Doreswamy said one day as he passed by, offering a polite smile.\n\nThe bouncer simply nodded, his eyes never leaving the campus grounds, but there was a slight warmth in his expression, a quiet acknowledgment of Doreswamy’s presence.\n\nDays passed, and their routine encounters continued, but it wasn’t until a late evening event on campus that things began to change. Doreswamy had stayed behind to oversee the event, ensuring everything was in order for the distinguished guests. As he exited the hall, he found himself alone in the dimly lit courtyard. A group of unruly students had gathered, creating a scene that was quickly escalating.\n\nDoreswamy’s instinct was to step in, but before he could, the bouncer was there, moving with silent authority. With calm words and subtle gestures, he diffused the situation in seconds, the tension melting away like snow in the warmth of the evening.\n\n\"Thank you,\" Doreswamy said, his voice filled with gratitude. \"I didn’t even have time to react.\"\n\nThe bouncer only gave a short nod. \"It’s my job, sir.\"\n\nBut there was something in his voice, something softer, that Doreswamy couldn’t quite place.\n\n\"Still,\" Doreswamy continued, \"I’m glad you were here.\"\n\nThe bouncer glanced at him, his expression unreadable, but there was a flicker of something—maybe appreciation—before he returned his gaze to the students, making sure everything was back in order.\n\nOver the next few weeks, their conversations grew from mere pleasantries to something more. Doreswamy found himself seeking out the bouncer’s quiet presence during his daily walks through campus. Their brief chats—about the weather, about the students, about the little things that made up their day—became a comforting routine.\n\nIt was late one evening, after another successful event, when Doreswamy found himself standing beside the bouncer once again, watching the campus slowly settle into the stillness of the night.\n\n\"You know,\" Doreswamy began, his voice soft, \"I never imagined that the most peaceful moments of my day would come from these encounters with you.\"\n\nThe bouncer shifted slightly, his gaze never wavering from the horizon. \"I guess some things don’t need words to be understood.\"\n\nDoreswamy smiled, his heart warmed by the simplicity of it. \"I think you’re right.\"\n\nAs the days passed, they began to find moments where their paths crossed more intentionally—at the end of the day when the world was quiet and the chaos had settled. Doreswamy found comfort in these fleeting moments, and in the unspoken bond they were forming, a bond that neither of them had anticipated but both were quietly cherishing.\n\nNeither of them was sure where this connection would lead, but there was an undeniable pull between them—two souls, so different, yet somehow, perfectly balanced in the silent space they shared.\n\nAnd for once, Doreswamy realized, the quiet strength of the bouncer was exactly what he needed.\n\n\n\n\\-- ....   To be continued    ---\n\n\n\n  \nGet this post 100 likes to get part 2 for this fanfiction",
  "metadata": {
    "id": "1hycjdq",
    "author": "Special-Quantity-797",
    "url": "https://www.reddit.com/r/PESU/comments/1hycjdq/doreswamy_and_bouncer_fanfiction/",
    "permalink": "/r/PESU/comments/1hycjdq/doreswamy_and_bouncer_fanfiction/",
    "score": 324,
    "upvote_ratio": 0.99,
    "created_utc": 1736537015.0,
    "flair": "Pride Of PESU",
    "nsfw": false
  },
  "comments": [
    "We got Doreswamy fanfiction before GTA VI\n└── See bro this is the result of all the research you people do in NLP\n    └── Glad to know that training data for future GPT models will include fanfiction on PESU characters",
    "https://preview.redd.it/zmbrhxxv0ace1.jpeg?width=1179&amp;format=pjpg&amp;auto=webp&amp;s=3c1ed5dadc26442105dba028ec21d2fb98938b18",
    "someone put this gem on ao3",
    "I need part 2. I'm gonna make fake accounts if I have to.",
    "https://preview.redd.it/jlcse8qnw7ce1.png?width=1076&amp;format=png&amp;auto=webp&amp;s=89a54e92e11e3e158b08f27592153a08d1f86784",
    "https://preview.redd.it/6wqbspi3d8ce1.jpeg?width=1170&amp;format=pjpg&amp;auto=webp&amp;s=6a85c9ebb0ccfeac60b13661d6f935c6b1d1c970\n└── https://preview.redd.it/iezprmytjace1.png?width=989&amp;format=png&amp;auto=webp&amp;s=8bf251e91067093c20a2c1c48d2d013d5f397cd4",
    "Upvoted and approved.",
    "https://preview.redd.it/he1jn8bz2bce1.png?width=498&amp;format=png&amp;auto=webp&amp;s=1ba12895b34485f7fadf971bf7bc01d044afcf97",
    "![gif](giphy|Whpfk0Qdx8dEFDddsx|downsized)",
    "Wake up babe , another fanfiction arrived\n└── ANOTHER???",
    "I'd pay to get more of this.",
    "When is the hot steamy s-",
    "Luca Guadagnino wants to know your location",
    "https://preview.redd.it/uikf020kmlce1.jpeg?width=1125&amp;format=pjpg&amp;auto=webp&amp;s=ba3ec0346438d92cfdf9233ca2a6108bcb312638",
    "Where's part 2",
    "Imagine the writer being doreswamy himself🤣",
    "https://preview.redd.it/ip6qucybl4ee1.jpeg?width=1170&amp;format=pjpg&amp;auto=webp&amp;s=1cc4901b0f9504ff4297952f5d75a9177c36d99b"
  ]
}