{
  "title": "placements",
  "content": "does ur salary depend on cgpa?what cgpa is considered decent in pes \\[eligible to placement\\]",
  "metadata": {
    "id": "1i2qjfm",
    "author": "Particular-Curve-445",
    "url": "https://www.reddit.com/r/PESU/comments/1i2qjfm/placements/",
    "permalink": "/r/PESU/comments/1i2qjfm/placements/",
    "score": 14,
    "upvote_ratio": 0.87,
    "created_utc": 1737038942.0,
    "flair": "Placements 🤑",
    "nsfw": false
  },
  "comments": [
    "Dont expect good placement if your cgpa is lesser than 8.25 \nMost of my friend above 8 got teir one there are people who got tier two and tier three as well\nNo one under 7 cgpa got above 7lpa",
    "Indirectly, yes.\n\nGPA is used at various stages for screening. PES has a filter of 6.5+ to be eligible for placements. Some companies keep a filter of 7.5+ to sit for their tests. Further, some companies keep a filter of 9+ to shortlist for interviews after the test. Bigger companies that pay more tend to have higher cutoffs, so your GPA does apply a bound to the maximum package you could get. However, once shortlisted for interviews, your GPA is irrelevant. A company offers the same package to all students that it finally selects, irrespective of their GPA.\n\nKeep an 8.5+ to be eligible for most opportunities. Having a 9+ is ofc, best.",
    "Students with cgpa above 6.5 are allowed to sit for companies,rest the companies decide the cutoff,A cgpa above 8 will allow you to sit for 99% of companies.\nAnd many companies shortlist higher gpa students in the process.\n└── is more than a 9 enough for tier 1 and dream tier? like it would make more sense to do dsa and work on ur skills instead of working on a higher gpa,like lets say x got 9 and y got 9.4 will y be considered for a higher package than x bcoz of a higher gpa?\n    ├── A company offers the same package to all students that it selects, irrespective of their GPA.\n    └── Yea ,above 9 is a very good gpa in pes,a company visits a college with a fixed salary which is same for everyone, once u get till interview cgpa doesn't matter much.",
    "My best friend with 7.2 CGPA got 16LBase package and total CTC was 24/25. This company was on campus and they took only 2 students. So yeah it matters but if your resume, DSA, etc etc is really good you can secure and package like this. One more friend got Arcesium which is giving 1.25 stipend per month and 20L Base Package for FTE, he is also in 7s. But yeah CGPA Matter but yeah skills also matters\n└── damn having a 7gpa and getting 20 base is really good congratulations to them",
    "I also have a question, after what cgpa does it become irrelevant? Like say 2 students are shortlisted with say x and y gpas, x&gt;y. But if the student with y cgpa is even slightly more skilled and is more relevant to the company's needs, they pick that student. When does that happen, after a 9+?\n└── CGPA is irrelevant after you get through to the interview rounds. After that, all that matters are your skills and their relevance to a company's requirements. That is why the suggestion is to keep a \"high enough\" CGPA that is enough to get shortlisted by companies if you have cleared the aptitude test, which is usually a 9+ to be safe. Anything beyond that does not help you much.",
    "I saw some companies in the attached link. Some top companies just keep a cutoff of 6, but they filter most of the candidates in DSA round.\n\n\nhttps://docs.google.com/spreadsheets/u/0/d/1XlMrrHTpp9tggKM6L5a9XHAajcK3cuYgibYcxyRWe88/htmlview#",
    "Its 6.68 and above. You do the math...",
    "but we have heard so many stories of 7s and 6s getting T1 jobs is it true ?"
  ]
}