{
  "title": "IM STRAIGHT UP FEELING S*cidal!!!!",
  "content": "I just got my Isa marks my total is &lt;65. my ISA 1s were better I did so horrible, my ESA's that happend so far went worse.\n\nnone of this makes any sense to me, my head hurts so bad I should not be doing engineering (the fact that I really wanted to do engineering before joining pes annoys me more) especially not from pes where the papers are so bloody hard, I am not fit for this, everyone around me is a genius they read something once and remember it like its nothing. I am not fit for this I dont think I'm capable of this. If anyone has any realistic advice for me other than \"GO STUDY\" I'm really looking forward for some cause I most certainly am COMPLETELY LOSING IT",
  "metadata": {
    "id": "1i4veul",
    "author": "Less_Philosophy_8651",
    "url": "https://www.reddit.com/r/PESU/comments/1i4veul/im_straight_up_feeling_scidal/",
    "permalink": "/r/PESU/comments/1i4veul/im_straight_up_feeling_scidal/",
    "score": 118,
    "upvote_ratio": 0.95,
    "created_utc": 1737281530.0,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false
  },
  "comments": [
    "As a guy in 8th sem right now I only have one thing to say none of these isas or esas will not matter in the end. it comes down to your luck and destiny.Everything works out for everyone just the way it has to.Just give your best and the rest will be taken care of.Your luck is proportional to your hard work.Dont overthink and just go with the flow.One day at a time and in no time you'll be done with pes and kinda missing it for some wierd reason.\n(I have seen the dumbest of people nearly landing 30+CTC just because there was no competition and no Gpa cut offs towards the end of placements and at the same time dumbfucks getting admissions in international Universities or have found their passion post pes and are so happy about their lives. And I know you are better than all the above the examples and you will do well. Good luck human - you'll need it)\n├── man thats the best thing ive read all year. thanks bro\n├── man, thank you\n└── G stands for gyaan.",
    "Hey dude 👋 I joined PES in 2019 and passed out in 2024 instead of 2023. I absolutely loved CS,  Engineering was always my passion but during Covid for some reason absolutely lost interest and hated Engineering. Marks dropped, I even failed in a few subjects as well. I felt the same things you are feeling and it obviously didn’t help that all of my close friends were absolute geniuses. I can reassure you 100% that things will get better. A couple of semesters marks won’t affect you much. Now please prioritise your mental and physical health and relax for a while please and  also PLEASE DON’T TAKE ANY UNNECESSARY DECISIONS. You’ll do well my friend and I’m sure you are an amazing person as well. Don’t give up on yourself due to few exams please 🙏\n└── thank you so much for this dude",
    "As someone who was feeling the same when I joined PES, the only advise I give is please do not compare yourself with anyone. Everyone lives a different life, they experience different things, it’s okay not to score well, it’s okay to fail your classes. At the end, what matters is you not giving up on yourself. Try exploring different hobbies college is not everything.\n└── ill make sure i try that dude, thanks",
    "I'm really sorry to hear you're feeling this way. It's important to know that you're not alone in this, and many of us have gone through similar struggles. I understand how overwhelming it can feel, and I've been there too. Sometimes, it seems like everyone around us is effortlessly excelling while I'm struggling to keep up. But trust me, it's not impossible, and you can do this.\n\nWhen I was in your shoes, I felt the same frustration and self-doubt. I struggled with remembering things and often had to put in more effort to learn what my peers seemed to grasp easily. It felt like an uphill battle, but with time, patience, and persistence, it did get better. The more I practiced and engaged with the material, the more manageable it became. \n\nYour worth is not defined by your grades, and one rough patch doesn't mean you can't succeed in engineering. It's a challenging field, but you're capable of overcoming these obstacles. Take it one step at a time, focus on small improvements, and celebrate your progress, no matter how minor it may seem.\n\nYou have the strength within you to persevere, and with time, you'll find your rhythm. We're all on this journey together, facing our own challenges, and you are not alone in this. Keep pushing forward, and believe in your ability to grow and succeed. You can do this! Take a break and sit with yourself for a while, your first sem grades might not be grade and that's totally okay! (Ps I barely passed first sem math) You will improve with time do not worry. \n\n\nRemember, it's okay to ask for help and seek support from friends, family or professors. I've seen many professors in PES who actually care about the students and they might offer some good advice. If you feel you can talk to them then please do so. They can offer different perspectives and study techniques that might resonate with you. Try talking to your friends or family you can trust and open up to. There is always light at the end of the tunnel! &lt;3\n└── Thats so wholesome man",
    "Trust me, we all have been there, its okay, take some break, see what u r good at and do that, no need to compete with the photographic memory nerds, all the best okay",
    "All of us have screwed up at some time and it's totally alright. Eventually we learn and we improve. I won't doubt your capabilities because you may be better than this. You need to relax first. If you don't think straight, there's nothing you can do. Always look at your problem in a different perspective. You'll figure it out eventually. Don't worry.",
    "I totally relate to you!! That's exactly what I've been feeling as well... Either way, in some fucked up sense, I'm glad u made this post bcos surprisingly, there are many nice comments here which made me feel a little better. They're not the usual \"go study\".\nSo yeah thank you! And wish you all the very best for ESAs. I hope we do better in it than in ISA 2\n└── The last thing I expected was all these amazing comments makes me feel so much better like I'm not the ONLY person going through this exact same thing\n    └── Fr.. I hoped while opening reddit that I would find something like this bcos I was feeling so down. ISA 1 went alright, but this was just..... something else..\nAnd it's not like I didn't study... So that just made me feel very worse. And istg, ppl in PES r soooo intelligent. Not comparing, but just saying. I didn't expect THIS level of competition when I joined here.",
    "Don't take so much stress brother....\nThere's always a way out.....I'm sure most people haven't found out their true passions yet...just gotta be curious and try to do the right thing whatever your mind says at that moment... eventually with some amount of goodwill things will be alright...you'll do well in life...\n\nThe only time someone fails is when they lose the zeal and motivation and desire to live....so just think about the nice things that has happened to you and try to manifest them more that's all....good luck",
    "Im surprised by the number of wholesome comments y’all turned reddit into a nice place loving this",
    "I can assure you that there would be nothing to worry about just work hard. If you're satisfied then that's good. Job somehow you'll get there is no need to worry. And also please seek help",
    "Come on man I had a 6 in my first sem and last sem I scored a 9\nIt will screw you over if you let it.\nAlso if you think about the broader picture, a grade comprises of 20 marks so as long as you do well in your esa you’ll be just fine(remember it’s 50%)\nJust focus and lock in for your esa \nAtb my guy\n└── Thanks dude  \nu went from 6gpa to 9??  \nand what do u mean a grade comprises of 20 marks\n    └── Yeah I did \nMy first sem was really bad lol\nBut make sure you do well now since u have time too\n50% weightage is a lot \nEvery grade as in : C-&gt;B-&gt;A and so on requires a 20 mark jump in your esas\nSo if you can pull off the esas, you’re good to go\n        ├── wait explain again pls cuz i didnt understand\n        │   ├── Suppose grade B is 70-80 and grade A is 80-90 and S is 90-100\nThis is gonna be graded based on your isa + esa\nBut let’s say you have 40/50 in isa so to get a B grade you’ll need 70-40=30 x 2=60.\nNow even if u get 79-40=39 x 2=78 you still get a B\nSo the real deal is to try to do really well in the things you can change ie esa in this case\n        │   │   └── ![gif](giphy|fs6e9kDwsta5QnGhJh)\n        │   └── Bro for example: grade B is from 160-180. So even if u get 161 you get a B and 179 is still a B.\n        └── tysm dude",
    "Chill bro , you'll do good next time as all might says belive in yourself.\n└── i believe in all might but not myself",
    "love that all the comments are wholesome\n└── ikrrr",
    "I was feeling the exact same way my I fucked up my isa's as well it's nice to see someone who relates cuz in class everyone scored good and wayyy better which got me hella depressed\n└── istggg",
    "Life is too long and amazing to be so bothered about one exam or semester score. I won’t say scores don’t matter, they do and will help you get a better starting point but that’s about it. But a lot of other things determine what you make of yourself. I know toppers who got placed in first few interviews but got laid off in a few months due to factors completely out of their control while I also know below average students excelling in life. Keep your focus on learning and building your skill set. Understand the power of compounding. Your skill set is something no one can take from you. Marks will be forgotten post your first job. Try to look at the bigger picture. You only live once!",
    "Maybe try and focus on doing summer term internships and stuff and winging it.\n└── do they boost sgpa?\n    └── SGPA can be boosted if you have backlogs. But don't purposely get backlogs to boost. It can be boosted if you do minors...but if you do badly in minors it'll affect your gpa. I suggested doing internships to boost your overall portfolio and resume.",
    "Challenges is a part of life how to handle that is the art of life and this is the art  your learning earlier / trust on God/ stay positive/ SAB THIKA HAI / SAB THIKA BHAI / SAB THIKA HAI / ALL IS WELL / ALL IS WELL / ALL IS WELL\nSay this type of things to your brain and your subconscious mind release good chemical be happy...",
    " I joined pes in 2019 in first year I didn't study at all and my sgpa was 4.55 with 1 backog. After first sem due to covid 19 I was in home. I thought the same way I literally thought I should leave engg.i thought to join other college for other course but to my luck we got promoted in 2nd sem I was the happiest person because without writing exam my sgpa in 2nd sem was 6.19 this was the point in life I decided to give my best I tried for higher sgpa from 3rd semester and graduated with cgpa of 7.2 in 2023 also got placed in MNC. my point is don't compare with others compare with yourself. You should feel you did it better than last time. It's not like you vs others it's always you vs you. You should focus on yourself and if you fail that's fine start from scratch but never give up bro. In end of the day these things doesn't matter one day you will get job and while travelling somewhere you remember these things and smile automatically that's the life man. Make memories, make friends,try hobbies ,try crazy things and enjoy your life. If you are not fitting into something even after giving your best maybe god has some other plan for you try other things find yourself, relax and maybe take a break and decide what actually you need in life but once you decide give a strong comeback in that but never take wrong decisions in life please...All the best 👍",
    "Analyze your mistakes, look what subjects you're weak in, focus on them, you still have your ESA's left, just read slides and do the pyq's",
    "Look instead of just studying, I advice you to take an interest in the subject first, it makes studying much easier, trust me and it won't feel like you haven't studied anything before an exam. Just surf YouTube, lot of videos exist which are very interesting and its the same subjects we learn in clg too!\n└── ill try that dude thanks",
    "https://www.reddit.com/r/PESU/s/dWOM7kDt4W\n\nAttaching this one old comment of mine.\n\n2 main things to add to this:\n\n1. Make sure to keep your GPA above 7 at any cost\n2. Dont forget the first rule\n└── dang bro thanks",
    "What 😛 \nWhy would you care so much?\n└── wdym",
    "bro how did u get into pes?? nice cet score or payment?",
    "Whatever it is pls do it on Mondays or Fridays\n└── That's absolutely wild",
    "Beyond MFA"
  ]
}