{
  "title": "Seniors clear my doubt",
  "content": "So I've got a doubt. Some people have gotten internship only and some have gotten internship +  fte. Now what if a student doesn't perform well in the internship? Does he loose his fte offer? Is there anyone who hasn't gotten an fte offer after completing his internship? If yes what did you do.",
  "metadata": {
    "id": "1i6asto",
    "author": "PuzzleheadedFan3092",
    "url": "https://www.reddit.com/r/PESU/comments/1i6asto/seniors_clear_my_doubt/",
    "permalink": "/r/PESU/comments/1i6asto/seniors_clear_my_doubt/",
    "score": 22,
    "upvote_ratio": 0.93,
    "created_utc": 1737434667.0,
    "flair": "Placements 🤑",
    "nsfw": false
  },
  "comments": [
    "&gt;Now what if a student doesn't perform well in the internship? Does he loose his fte offer?\n\nYep. Your offer isn't final until you sign on the offer letter (applies to both FTE and intern). So if you have a verbal or email saying you have been selected for intern + FTE, they are meaningless until you sign it. That is why most companies will roll out the FTE offer letter only towards the end of your internship after assessing your performance. If you do not perform well enough, they will simply notify you that you will not get the offer letter for FTE.\n\n&gt; Is there anyone who hasn't gotten an fte offer after completing his internship?\n\nIt was uncommon during my time and is probably similar now. But yes, it has happened, especially during the hiring freeze in 2023 and mid 2024, and it can definitely happen again. Not being extended a return offer while unlikely in intern+FTE informal offers is always possible, that is why its important to perform well during the internship.\n\n&gt; If yes what did you do.\n\nI mean its pretty straightforward: apply aggressively for FTE roles.\n├── Could you please give some advice on how to perform well in the internship so you can get PPO? Especially when you are competing with 100 other interns across India who are equally if not more smarter than you?\n│   └── Perform well and always give your 100% if you cannot give more. Be curious, learn as much as you can about your role, why you are in that role, how it affects others both inside and outside the company and ofc, be as skilled as you can with your tech stack, whatever you use. Always show you are ready to learn and contribute more and don't say no to more work. Keep learning on the job not only about what you are working on, but also what your teammates are doing and show interest in everything your team is responsible for and not just your duties. Finally, be nice to your manager and teammates, get along well with the team and show through your performance and actions that your presence matters.\n\nEssentially, make it feel like you are full time member of that team. Your team shouldn't feel like you are a temporary intern who would be gone in a few weeks: your work should be consequential such that people never forget about it and who worked on it after a few weeks. Make an impact wherever possible and try to accomplish as much as your teammates (this will be difficult given interns aren't given as much work, but do whatever you can, try helping your teammates out). Try bringing up bigger ideas that can help your team out in different ways, always take part in discussions and say whatever you feel is right (it doesn't have to be correct - you are here to learn!) and always make sure your voice is heard. If there is a vote on something, give your views for/against it. Make yourself a cog in the team that cannot be replaced.\n\nQuick 2 examples from my experience: \n\n1. During my internship, as a \"test\" application, I wrote a small script that would visualise some real-time data. It was primarily a testing script I had written to test APIs as they were being developed, with some added stuff for \"extra fun\". Turns out they really liked the \"extra fun\" was really good and halfway into my internship they expanded it as part of the suite and converted into a large open-source project that my company actively maintained, even showing it to companies (including FAANG) and using it to market the product even.\n\n2. During my full time (not really relevant to your question but might encourage you), I had bundled a couple of scripts together to check for data consistency while we were working on our data engineering pipelines. It was never asked of this, I just used to run those scripts once in a while to check for certain constraints and it helped me find and report some issues. My team lead liked the concept and asked me to build upon it and a few weeks later we had a full end-to-end system for it which is probably (hopefully?) being used even today.\n\nSo you see, impactful work often also happens from going out of your way to do things that can help your team.\n└── Thank you sir 🙏🙏. Your the boss 🏆\n    └── \\*You're\n\nAnd yes, yes I am\n\n![gif](giphy|9EDHvl8L5WbbTDJG3N)",
    "You don't need an immediate offer. Take it as you gaining experience. Your time will come when it does.",
    "Yes if you don't do well in your internship, you will be asked to leave."
  ]
}