{
  "title": "Don't do what this student did. The old tale of Arpith the proud.",
  "content": "Back years ago a student by the name Arpith GR was the smartest guy in class. He studied 24/7 had a 9.5+gpa, a loving girlfriend and amazing parents. \n\nOn paper Arpith had everything. But, such success breeds pride, and proud Arpith was. \n\nThe issue with pride is that becomes impossible to lose, a proud man cannot stomach loss, it is unbearable.\n\nDuring placement season, our proud friend was unable to get a job, mind you it was only 2 weeks into the season. Seeing his friends get tier 1 jobs Arpith's pride was broken.\n\nHe finally took the impossible step and [https://www.newindianexpress.com/bengaluru/2017/May/04/engg-student-kills-himself-1600832.html](https://www.newindianexpress.com/bengaluru/2017/May/04/engg-student-kills-himself-1600832.html) \n\n\"Pride makes us artificial and humility makes us real\". \n\n",
  "metadata": {
    "id": "1i73c42",
    "author": "Few_Safety_2532",
    "url": "https://www.reddit.com/r/PESU/comments/1i73c42/dont_do_what_this_student_did_the_old_tale_of/",
    "permalink": "/r/PESU/comments/1i73c42/dont_do_what_this_student_did_the_old_tale_of/",
    "score": 95,
    "upvote_ratio": 0.92,
    "created_utc": 1737521311.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "Rip \nBut remember never compare each other it makes you even worse",
    "Comparision is a thief of joy",
    "What about my friend, he has 2cgpa, uska kya\n├── Unless they have at least 7 GPA at the end of 3rd year, it's going to be practically impossible.\n│   └── Sorry but impossible to do what\n│       └── Not sure why I'm being downvoted for stating facts.\n\nPES has a filter of 6.5-7 GPA to even be eligible for placements. If you do not have that, you simply cannot sit. Even if you somehow scrape by and have lets say a 7 GPA, companies have their own filtering criteria and sometimes keep it as high as 7.5-8 to sit for their placement test. Now lets say you have a low-8 GPA and are eligible for their test, you will still face hurdles because companies shortlist way higher than the said GPA, sometimes as high as 9-9.25 for their interviews.\n\nTo summarise, if you have a low CGPA, you are going to have trouble getting placed. Like it or not, your CGPA will be used to filter you at multiple stages. Before people come at me saying \"off-campus is the way to go\" - While I agree that off-campus opportunities have lesser GPA related constraints (I myself got an internship off-campus, so I know how the situation is), its simply far more competitive. During placements, you have probably a few hundred applying for a few positions at a company. For off-campus, you can easily have 5-10x the number applying for the same few positions.\n│           ├── While i agree with you, i don't think it's right to put these students down saying it's not possible to even land a job. It's competitive as fuck yes, but not impossible. I'm just saying that low gpa isn't the end. Even with the worst possible grade, backlogs, attendance or whatever, college life isn't the end of the world. As long as they realise that they fucked up in college and try harder to do better, they can get a job. They can get raises, grow their careers and have a great life. With the recent increase in students suicides, we should help these kids find a way instead of telling them they can't do it. Having a great gpa is what every student should strive for in college, it's guaranteed success, especially from a college like PES. But it's not the end if you don't. You'll just be trying much much harder than everyone else\n│           │   └── Okay I don't see why you're getting so defensive about this.\n\nFirstly, my comment has nothing to do with the original post. All I did was respond to the question about what would happen to on-campus placements if someone had 4 CGPA, to which I factually stated that with that GPA they won't be able to sit for it at all and they need 7+ atleast by 6th sem. There is no other possible outcome here, I just mentioned the guidelines. There would be no point in me lying and saying \"you still have a chance\" when PES clearly says you need a 7+ to sit for placements. Lying to them only misleads them. \n\nSecondly, I never put anyone down in my comment. You asked for an explanation, I provided it. I nowhere mentioned that having a low GPA would end all hopes - all I said was that it would cause a lot of trouble and issues and highlighted how GPA is used to filter candidates at various steps. I even mentioned that off-campus would be the way forward if you have a low GPA. \n\nYou're misconstruing me saying a low GPA would be impossible for on-campus placements as a low GPA is the end of the world. I never said the latter.\n│           │       └── Yeah the confusion is because placements wasn't mentioned in the original comment. I may have gotten defensive after reading \"it's impossible (to get a job)\", which is not the case. I'm a living breathing example. But yes I agree with you that without a good gpa placements is not possible. Again, I'm an example\n│           └── As someone who's about to mostly likely enroll in PES can you give me a realistic expectation of how many hours I need to study a day get a GPA of 9? And some maybe other tips to do better if you have any, thanks!\n│               └── Atleast 20 to 30 hours a week. The more the better, also it's not just about giving the time, you have to give quality time and make sure you make proper use of the hours and the resources.\n│                   └── I see, thanks for the response!\n└── Yoo is minimum pass cgpa 4 or 5?\n    └── There's no pass gpa, your backlog subjects' credits combined should not cross 24, thats all\n        └── ik that. But I have seen ppl with 4 gpa get promoted to further sems but there are ppl with 4 gpa who get detained due to verticle mobility. whats the logic ? Dont u need a minimum of 5 in every subject to pass ? Which equals 5 gpa ?\n            └── nope, I know people with 2,3 gpa who are promoted, you do need 5 in all subj to pass yes, but not get promoted, to get promoted all you need is your backlog creds&lt;24",
    "Placement is essentially equivalent to getting a job(Naukri). By taking up a job, you are essentially serving as an employee(Naukar-Servant). There’s no need to be overly proud of it, as even a CEO can be dismissed with just an hour's notice. Remember, it's just a step on your journey, not the ultimate goal. If you truly believe in your talent, consider staying in our beautiful country instead of chasing a higher-paying job abroad or a Tier 1 position. Instead, aim to build your own company, create opportunities, and generate jobs. That is where real respect lies.",
    "Please don't spread these things here it hurts many people. Nobody knows real reason I asked few seniors but even they were disappointed because of this incident. He didn't write any suicide note so it's not clear what was going in his mind don't just conclude without knowing the real fact.",
    "RIP. If that was his attitude he wouldn't have achieved anything. Rejections are a part of life...and we need to take them as a learning opportunity.",
    "The guy posting this is a Russian vatnik, check profile"
  ]
}