{
  "title": "Any advice that you would like to give to someone who wants to join PESU ??",
  "content": "",
  "metadata": {
    "id": "1i8occ1",
    "author": "Your_Friendly_Panda",
    "url": "https://www.reddit.com/r/PESU/comments/1i8occ1/any_advice_that_you_would_like_to_give_to_someone/",
    "permalink": "/r/PESU/comments/1i8occ1/any_advice_that_you_would_like_to_give_to_someone/",
    "score": 22,
    "upvote_ratio": 0.89,
    "created_utc": 1737696565.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "first year whose sem1 just ends this month from ec campus.  \nIt isnt all gloom lmao, definitely could improve a LOOOOOOT  \n tho heres a rant of the things i hated.  \n  \n1)Cs teachers dont know how to write code nor explain jackshit, just read loudly from slides. Only saving grace is few COULD give attendance if yours is below 75.  \n2) Only one student recreation centre, which is always crowded anyway.  \n3) Cafeterias are overrated as fuck here. Always crowded, limited variety , at least compared to rr anyway, new mrd cafeteria is nice tho.  \n4) Very few fests and other cultural events. If thats a major thing for you then u wont like it here.  \n5) College kinda is lifeless after classes end.  \n  \n  \nFor what its worth, infra and the 'college vibes' at rr are much better than ec. Theres a lot of things to do for hanging around once college ends around the rr campus than ec.  \nFew things i liked  \n1) Literally no ragging  \n2) Seniors are mad helpful.  \n3) Teachers most of the time would respond to doubts and issues you have pretty quickly.( hope that doesnt change going forward)  \n4) Regular events, active clubs( fewer in number but theyre good from what ive heard).\n\nIf you really wanna come to pesu, visit both campuses ,explore properly. Try for RR anyway( so that u dont have fomo if u do join later)  \nagain, not some t69 college experience, just uh underwhelming ig.\n└── Infra is not that big of a problem also according to me. If you're talking about the labs, worth mentioning ec has better research labs (quantum computing lab in mech block) idk about rr tho. Want to add that the fomo part will feel real but when you come out of the cutoffs delusion of 12th, it's really not that bad. EXCEPT THE DAMN COMMUTE EVERYDAY AAAAAAA\n    └── Oh yeah hostels here aren't cheap btw OP 💀 \nTho they're worth it from what I've heard if u really need them",
    "Dont",
    "Don't\n\nP.s: I like the unity here.",
    "dont",
    "Don't",
    "Don't",
    "i cant like all the comments guys😭\nBut seriously don’t",
    "Don't",
    "Don’t",
    "Did you catch that? In case you missed it, don't",
    "If you couldn't see because the text was too small: DON'T",
    "Don't",
    "don't",
    "Pls don't",
    "Absolutely don't",
    "Don't",
    "Don't!",
    "Don't",
    "Don't",
    "Don't bro😭",
    "Don'ttttttt !!!",
    "Save yourself while you still can. Don't",
    "dont",
    "Don’t",
    "Don’t",
    "Don't",
    "Don't",
    "Don't",
    "Yeah don't",
    "Don't",
    "Well, this is a good college if you're out of options and don't want to waste a year.\n\nIf you work hard, you'll get a good placement, and that's it.\n\nIf you do find yourself here, do make sure to have good friends. My friends are the only part I deeply miss about college life."
  ]
}