{
  "title": "4 years is toooo long!",
  "content": "",
  "metadata": {
    "id": "1ia9vtq",
    "author": "[deleted]",
    "url": "https://www.reddit.com/r/PESU/comments/1ia9vtq/4_years_is_toooo_long/",
    "permalink": "/r/PESU/comments/1ia9vtq/4_years_is_toooo_long/",
    "score": 31,
    "upvote_ratio": 0.87,
    "created_utc": 1737882201.0,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false
  },
  "comments": [
    "Waiting for u to post \"How tf did 4 years fly by so fast?!\"\n└── I swear lol, y'all will only miss college once you're out and realise how simple and carefree life was back then. Enjoy it now, at the end of the day all that's left are memories\n    └── In 4th sem rn.Idk how fast 3 sems went by and we have only 2 and half sems(roughly 4+4+3 months) left to be with homies\n        └── Understandable. I'm 25% done with my MS already and it feels like I visited my department and met my friends for the first time during the orientation just yesterday.",
    "Lmao those years are gonna fly by so fast you won't even realise. And it's basically just 3 years since final year has no classes\n├── 0 classes?\n└── 0 classes in final year? Wth?\n    └── Online classes with no attendance\n        └── Ohh wt abt the exams anol?\n            └── 7th sem 2 subjects exams usually easy asf, 8th sem nothing",
    "Dayumm, I usually finish in 10 mins.",
    "we lasted through 12 years of school, dw bro you'll get through this fine",
    "Idk but the 1st sem was too short..\n└── Fr",
    "It'll pass don't worry. Depending on what your branch is the final year would be project work with few subjects.",
    "It’s a very bad ride and i am still waiting for someone to tell me that “oh i want those 4 years back”\n├── I want those 3 yrs back (Covid batch)\n├── I want those 4 years back\n└── Yes ,I want them . I went to college after graduation and felt so empty without all your friends and batchmates ,it feels very alien as if you don't belong here .",
    "Compare it to other institutions, we are far away of month's from them.",
    "Just imagine about 5yrs",
    "Bro olny i can feel you ig (not even one perfect dude exist)"
  ]
}