{
  "title": "Help!!",
  "content": "Is getting 3-4 backlogs in the first semester really bad? Are there many others who get them? I need to know because my mental health is at an all-time low right now.",
  "metadata": {
    "id": "1icr2h6",
    "author": "SurpriseAsleep5171",
    "url": "https://www.reddit.com/r/PESU/comments/1icr2h6/help/",
    "permalink": "/r/PESU/comments/1icr2h6/help/",
    "score": 16,
    "upvote_ratio": 0.85,
    "created_utc": 1738147518.0,
    "flair": "Study Help :table:",
    "nsfw": false
  },
  "comments": [
    "just focus on what can be done to fix this, prepare in advance for the backlog exams, other people getting backlogs should not make a difference on how u try to deal with this situation.  \nGo thru the slides properly and u will be able to ace the backlog exam if u start early. Dont be afraid to ask doubts in the college WhatsApp groups   \natb.",
    "3-4 backlogs out of 5 courses in the first semester? I think you already know the answer to whether the situation is bad. \n\nI've discussed this in an old comment of mine (go and search for it) but you need to really put in more hard work from next semester. Things are only going to get harder because first year is arguably the easiest and lightest year. So if you're struggling now, it's going to rain down trouble from 3rd sem. Figure out why you aren't scoring well and see if there are other contributing issues. \n\nYou need to introspect and reflect on why you performed terribly. You can definitely turn things around but you won't be able to do it unless you identify the mistakes you've made and why you've made them.",
    "Chill brodie, it's not too bad. I had covid during my ESAs in first year and I failed 5/7. I had 9 backlogs by sem 3 but I was able to clear it all by sem 5 pretty peacefully. And in some of the harder subjects, I actually got a better grade than my friends because backlog papers are usually easier than ESA. In the end, me and my frnds ended up aith similar cgpa. Chill, don't stress too much. Think of backlogs as your second chance and don't fuck it up. You'll be fine. Cheer up!\n└── If I failed all my subjects in the first semester of a B.Tech program , will I be allowed to continue to the next semester? please kindly inform me\n    └── Nope. They implemented a new vertical mobility system in my final year. If you have more than 24 credits back, you can't go forward until you clear them, so you'll probably have to write it with your juniors. Not the end of the world tho, ik 2 ppl who joined with me who are one year behind. They're chilling\n        └── \"Student Eligibility for Promotion to next higher semester (Vertical Mobility)\":\n\nA student will be promoted to next higher semester, if he/she has less than or equal to 24 pending credits (including F grade &amp; W grade) from the previous semester/s. Any student having more than 24 pending credits (including F grade &amp; W grade) from all previous/lower semesters will have to clear the subjects in the examinations whenever conducted next by the University. Once the student becomes eligible, he/she should enroll and continue in the next eligible semester as per academic calendar of the university.\nBro they had sent this",
    "There are only 5 subjects and if half of them you get backlog what do want the answer to be. \n\nBut what went wrong",
    "If you do end up getting a backlog then what's done is done there is no point thinking about it. Learn from what went wrong and do not repeat the mistakes again. You will be able to retake those subjects whenever the backlight exams are held so take them up and do well in them. Try to clear your backlogs as soon as possible. One positive thing about backlogs are that, they don't consider your ISA marks or your internals, you will be graded out of the 100 marks you write the backlog exams for. If you manage to score S or A grades in them your gpa will increase. You can't change what has happened in the past you can only change your actions in the future, so be accountable and do not repeat what you've done so far. All the best!",
    "Cooked",
    "which subject are you passing?",
    "When will be the backlog exam",
    "Most of my batch had backlogs in first year. Its normal. But a word of advice don't get any grade below C if you want a good gpa. This is something I wish I'd known sooner.",
    "Mental health depends upon you only because no one help for this type of issues in college because in first sem I had 5 backlogs in that time except our friends no one helped\n└── how hard was it to clear...? like did it hinder ur sem 2 ISA's and Esa's?\n    └── We had 5 Isa and 1 esa our clearing subjects was very easy but scoring was bit difficult \nFor backlogs contact teachers refer last 2 years paper you can pass easily except M1 and M2"
  ]
}