{
  "title": "About the internship and the capstone project",
  "content": "I'm in my 4th sem rn and I'm a bit confused to select the capstone project , I don't know in which domain I need to do the project.\n\nHow to approach the professors about this topic and I'm confused like which domain I've to select AIML , cyber security or IOT .\nIs it good to do an internship in PES itself or to look for an internship outside.\nI've a quite interest towards the AIML , should I go with that????\n",
  "metadata": {
    "id": "1iebkg1",
    "author": "conscious_mind01",
    "url": "https://www.reddit.com/r/PESU/comments/1iebkg1/about_the_internship_and_the_capstone_project/",
    "permalink": "/r/PESU/comments/1iebkg1/about_the_internship_and_the_capstone_project/",
    "score": 17,
    "upvote_ratio": 1.0,
    "created_utc": 1738318026.0,
    "flair": "Placements 🤑",
    "nsfw": false
  },
  "comments": [
    "I think you're a little confused\n\nCapstone and Internship are 2 independent things. You cannot replace one with another. \n\nCapstone is a research based project in your 4th-8th semesters. Choose a topic that you (and your teammates) are interested in and approach a prof who works in the same or related fields. Pick a topic and then contact profs. \n\nInternship is a different thing altogether. Check the FAQs for details on internship durations and credits.",
    "Right now focus on finding a topic in Capstone. You're only in fourth year theres no rush . Find something you're passionate about. As for internships you have time. It's better to do paid, if upaid you need to take a special topic for two credits.\n└── Hi! I’m a bit confused about the Capstone project timeline. Does it officially start at the beginning of the 5th semester and continue till the 8th, or are we expected to complete it by the 6th semester itself and then prepare for placements? Also, could you give a brief idea of how the work is split semester-wise? I’m planning to prepare for GATE/GRE alongside, so I just wanted a clear picture to plan things better.\n    └── You need to find your topic by 5th semester otherwise you'd have to take a topic that one of the teachers are doing. \n\nPlacements have to be done simultaneously. \n\n  \nIn 6th you need to do the literature review. In 7th you do your experiment, in 8th you publish your paper.\n        └── Thanks for the breakdown",
    "Spend time on a great Capstone,\nYou'll be able to get better Internships after 6 months.\n\nOne mistake to prevent, don't take someone else's data, apply someone else's algorithms to someone else's problem. That's someone else's project.\nYou'll not be able to sell it as your own.\n\nSomething you need to find is either a new problem (there are a lot), a good open source data that you can curate, label, stimulate or the hardest, apply a twisted algorithm to do better."
  ]
}