{
  "title": "How much is enough?",
  "content": "Today our ma'am tells told us to aim for 10 for those who got 9.5+.  Like is it even worth the hassle to get everything thing perfect?\n Ik cgpa matters but when it is just the cutoff for companies what difference would a 9.5 and 9.6 have?",
  "metadata": {
    "id": "1im3w6g",
    "author": "Arjun9514",
    "url": "https://www.reddit.com/r/PESU/comments/1im3w6g/how_much_is_enough/",
    "permalink": "/r/PESU/comments/1im3w6g/how_much_is_enough/",
    "score": 19,
    "upvote_ratio": 0.88,
    "created_utc": 1739186551.0,
    "flair": "Study Help :table:",
    "nsfw": false
  },
  "comments": [
    "No one gives two fucks about your results after a few days (or perhaps even one day) tbh, but still it is better to keep improving yourself.",
    "She stupid asf cgpa does matter but that's not the only thing, 8.8+ is safe bet, 9.2+ is extremely good for placements.",
    "Tell her to get a life!",
    "Beyond a 9.5 or so, your CGPA is not really relevant. Focus on building your overall profile as others have suggested. You can read my old comments on this for more details.",
    "I mean can atleast aim for it and have a goal right? Would definitely help as a reserve for the future, cus later semesters may just be tough. She's just encouraging you to improve. Ik who you're talking about btw, she's one of the few teachers who actually cares and wants to see you improve in all aspects while also literally covering everything in the syllabus. No nonsense and perfect. As for a difference, it matters a lot for dream companies ig as seen in the placement sheet (especially the internships) but yeah I agree focusing only on cgpa and ignoring every other fest/opportunity for exploring is very bad.",
    "There’s ntg like this much is enough…\nYou can try to aim for higher cgpa always…\n\nMore than CGPA focus on improving skills on core subjects it will be really helpful:)\n└── Hey I'm in second semester now. I'm kinda confused about this talk of 'skill improvement'. It always seemed quite vague so could u explain wdym by it",
    "It might act as cut off that’s it , but most of the companies go after what you know and your application skills not your CGPA"
  ]
}