{
  "title": "Graduates/alumini, what do you miss most about pes?",
  "content": "I'm doing my internship rn, and god.. I miss clg more than anything. I get really emotional when I think about my time there. I used to complain sm about that place but now I can't wait to get there for my isa 😭. Anyone feels the same?",
  "metadata": {
    "id": "1imrvc1",
    "author": "Sensitive_Ladder5259",
    "url": "https://www.reddit.com/r/PESU/comments/1imrvc1/graduatesalumini_what_do_you_miss_most_about_pes/",
    "permalink": "/r/PESU/comments/1imrvc1/graduatesalumini_what_do_you_miss_most_about_pes/",
    "score": 24,
    "upvote_ratio": 0.91,
    "created_utc": 1739253414.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "Sutta gali paratha , \nShawarma \nRose milk and sutta gali food .\nSunsets at 13th floor , studying sessions at 13th floor library.\nGetting drunk till passing out after Isa .\nHostel bakchodi etc .\nmeeting friends post graduation got difficult and became a bit dry 😔\n├── That life ain't coming back man... And it sucks!\n└── The shawarma stand in sutta galli is the best I’ve ever had",
    "Sutta Galli tea. Double crunchy Oreo and that maggi near Cheta's spot. \nEvening bun samosa and chilli cheese sandwich at Stop n joy used to hit.\nThe thirteenth floor canteen had opened when I was in the second year (I guess) and I used to love that. We could finish lunch and sit in the quiet space library behind. \nHonestly I never got to experience gjb block apart from the final grad ceremony, it was partially done.\nEnjoy it while it lasts bro...10 years down the line, the feels will be unbelievable",
    "Sutta galli veg maggi, I've never found better taste than the last interior shop anywhere.\n\nGoing to terrace during night and just staring at sky and huge buildings.\n\nNamdhari mess. The best complete meal I used to have, now just eat in fractions.\n\nHaving confidence of getting assignments from someone till the last day of submission.\n\nAnd many more!",
    "Sutta gully stop n joy, SLN bar, working out in college gym (no other gym comes close), messing around in hostel, watching IPL and other matches with friends in hostel. God miss those good days.",
    "Cheese vada pav opposite stop n joy. Idk what crack he puts in it but just hits different"
  ]
}