{
  "title": "ECE or CSE",
  "content": "I have taken ECE in ECC. I am in first year. My sgpa was good. If I want, I can get CSE in 2nd year. But I am not sure to do so or not. I think I can do better in CSE but seeing the number of students pursuing CSE is depressing for me. If you think, 14L+ CS graduates came out last year and the number is increasing, how will I end up getting a job after 4 fking years?  If I continue with ECE, I could grind hard and do fine. But ECE in PES is not good in terms of placement. I need a practical advice. Can seniors please guide me? If the answer is ECE, should I change my campus?",
  "metadata": {
    "id": "1ino89i",
    "author": "Doppel_Ganger69",
    "url": "https://www.reddit.com/r/PESU/comments/1ino89i/ece_or_cse/",
    "permalink": "/r/PESU/comments/1ino89i/ece_or_cse/",
    "score": 14,
    "upvote_ratio": 0.9,
    "created_utc": 1739357559.0,
    "flair": "PESSAT/Admission",
    "nsfw": false
  },
  "comments": [
    "India is the most populated country in the world so complaining that there are 14 lakh CS grads is pointless. Every career field here is overcrowded and it’s a cattle ground no matter what you choose. the only thing that matters is whether your interests align with ECE or CSE. take a few days, talk to people from both branches and those working in the field, explore the subfields each offers, and do your research. \n\nIf you’re set on ECE, try to transfer to RR next year. The HOD in ECC is a fucking retard, my friends there are miserable.\n└── But from what I've heard... overall the teachers in ECC for ECE is better than RR\n...\n    └── teachers in ecc for ece aren't that bad imo.. they're just a little old school.",
    "Before elaborating further, where does your interest lie?\n└── I find both equally interesting but CSE has an upper hand as I have studied it more and find it fun.\n    └── Then, I'd recommend go with CSE itself",
    "You might actually hold edge if you do something different. With the amount of software devs India is pumping out currently, there's bound to be high demand for other engineering streams in the future.",
    "If you take my advice, I'll say continue with ECE. It teaches you basic coding which you'd need for interviews and despite getting disregarded ECE has a lot of scope. The next boom will be manufacturing of electronics in india, and semiconductors for the rest of the world. So definitely you can aim big in ECE..",
    "Go for CSE :)\n└── Could you elaborate please?"
  ]
}