{
  "title": "I THINK I KNOW THE REASONS .",
  "content": "After reading all the RANT or depressing reddit posts here , I don't know why but it felt so relatable ,\n\nmainly the posts about how irrespective of  so many ppl being around us but yet we feel lonely and left out ,\n\nhow we know that studies is not the only main thing in our lives.\n\ncuz anyone who can sit prior to 2 weeks of the test  and get a decent A grade or even S .\n\n\n\nThe reasons:\n\n\\- look many people here are either too mature to their age or too immature there is no middle ground here and when the these 2 ppl are in same room they  feel left out or they get irritated\n\n\\- for some  ppl the cool things are  normal and for some ppl its vice versa\n\n\\- and now as we have an alternate option to get entertained or not to feel empty we have our phones in our  hands   and even  during breaks we feel occupied\n\n\\- before when there were high restrictions of bringing cell phone inside the campus (11th,12th , school days )  , we had to make friends and we had to go roam around the corridor due to which we used to feel occupied but those days are long gone now.\n\n\n\n\\- coming to relationship  topic \n\nsee women now are  in a stage where they date only for two reasons that is : \n\n1) either they want a stable and  smtg long lasting  , building their career and future together type of        ships\n\n2) or the ones where they fulfill  all there adventures and college dream life \n\n3) maybe they want someone to validate there insecurities and give them company in their own dream path\n\n\n\n\\- now in case of boys:\n\n  sorry to tell it out ladies but we feel a bit like not scared and shit but we feel that you ladies may leave us or not respect us even though we pour in all our efforts and time on you guys , im not telling everyone are like this but majority of the time this is the case . and due to past trauma of the guy in school or 11th and 12th , we kind of lost the  ability to love someone now as the the butterflies are dead\n\n\n\nik this post was a bit big but this is what is really going go in our clg life( summarized) ,  hope i made sm  ppl realize about these.\n\n  \n\n\n\n\n\n\n\n\n\n\n\n",
  "metadata": {
    "id": "1ipwf2e",
    "author": "Humble_Steak_8176",
    "url": "https://www.reddit.com/r/PESU/comments/1ipwf2e/i_think_i_know_the_reasons/",
    "permalink": "/r/PESU/comments/1ipwf2e/i_think_i_know_the_reasons/",
    "score": 27,
    "upvote_ratio": 0.82,
    "created_utc": 1739605069.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "bro it's not that deep... enjoy go with the flow man",
    "\"women date only for two reasons\"  \n\\*lists 3 reasons\\*\n└── Sorry bhai flow me tha",
    "Ok?\n└── No this was to ppl who were going through sm sad phase u can ignore it\n    └── bro half of these are troll posts, especially the relationship ones you talk about. last week there was a u/sad_pesu_boi account and then yesterday a u/sad_pesu_girl. lmao.\n        └── Chudh  gay guru",
    "Correction for \"in case of boys\", we want big tiddy goth gfs",
    "Hotel motel holiday inn 🏨",
    "Nice one 🙂‍↕️",
    "There's no need to think so much about things that don't make sense. There are better things in life.",
    "You need to know what to prioritize. Grades, Experience or having fun those determine your future."
  ]
}