{
  "title": "OP needs some advice",
  "content": "is is true that student suicide is quite common in pes?\n\nMy cousin is at PES University, Electronic City campus. About a year ago, when I visited Bangalore, he mentioned that student suicides had become quite common.I am from Pune, and I really want to get into a good college in Bangalore. Is PES a good option then?",
  "metadata": {
    "id": "1iq16gh",
    "author": "[deleted]",
    "url": "https://www.reddit.com/r/PESU/comments/1iq16gh/op_needs_some_advice/",
    "permalink": "/r/PESU/comments/1iq16gh/op_needs_some_advice/",
    "score": 16,
    "upvote_ratio": 0.87,
    "created_utc": 1739625597.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "This cllg makes me suicidal each day, would not recommend 🙏",
    "NO. Pes is not a good option.\n└── why tho?\n    └── https://www.reddit.com/r/PESU/s/oJL1tOI0pW\n        └── thanks\n\nchanged my mind now\n            └── good work lmao this is how we need to dissuade naive kids who want to come here to \"enjoy\". Wish that posted existed before I joined.\n                └── Tbh we shouldn't dissuade. We should give them all the information and make sure everything is transparent. The decision is upto them.",
    "So I graduated in 2022 (seems like forever ago now lol) and here are my 2 cents: \n\nSuicides can happen anywhere. However if you do want to compare numbers, PES has had significantly fewer (totally 3-4 in history) compared to other colleges, including T1 ones. While the academic pressure is indeed high, it's often a mix of reasons that lead people to take the final step. Students have joined and also graduated with far more academic pressure than what exists today, so blaming *only* the pressure isn't valid. The real problem lies in how PES handles these events and that's why in recent years there's been a steady decrease in its reputation among students. Someone else spoke about this so I won't iterate these points again. \n\nObjectively speaking, sure PES is great: for the tier it belongs to, it secures solid and good placements every year (18LPA average if in CS) and it didn't suffer during COVID years too. It has a pretty updated syllabus and has good infrastructure too. The crowd is too notch and you'll find alumni either working at top MNCs including FAANG or studying at top places for MS/PhD like CMU/UCLA/UCSD/NYU. When it comes to the BLR colleges, PES is definitely one of the top options, usually considered 1st/2nd. \n\nHowever, every place has its problems. There are far too many problems at PES today from a shitshow management to poor faculty. Management struggles to take well informed decisions that benefit everyone and most profs here aren't really interested in what they're teaching, and if they are, they aren't equipped to teach well at an UG level. Research labs are in a sorry state and most research published from PES are at predatory venues. The academic rigor is extremely high - you will need to grind and actually put in a large amount of effort to score a satisfactory grade. Given the number of students here, GPA is used as a filter for many things so having q high GPA is crucial. Academics usually takes up 80% of your time here. \n\nGenerally speaking, you could get similar benefits at other colleges, with a fewer disadvantages. PES is very expensive, especially if you aren't from CET. You could get the same advantage by paying significantly lesser at other colleges. So is PES is a good option? Yeah definitely. Metrics wise, it's great. If you want a good job after BTech, PES will do that. But it's nothing more.",
    "Trust me, there are much better options for college. PES is not what it used to be back in the day, and I can vouch for that.\n├── How far back r u reffering to tho? I don't think it was that bad like before 3rd Yr for me (during the time of 5 isa and no bouncers).\n\n My batch ppl were cool too cause we had just come out of lockdown and were equally awkward lol 😅.\n└── what options would u recommend?\n    └── RVCE, after that PESU.\nBMS and RMSIt after that, they are trash in comparison to pesu tho.",
    "Do or don't its your choice. At the time of exam don't get into any situation that you can be accused of malpractice. Sometimes life gets hard...don't let it get to you.  Its not common but it comes up from time to time...you're there for an education.",
    "In BLR pes is the next best after RVCE, suicides are not common here, it's just that it's a bit higher than other colleges, every college has suicides. \nAnd it's also that the college dealt with a suicide quite poorly last year and hence pes got this bad name. \nThe college itself is fairly good. Definitely worth joining pesu over bms or rmsit. \nThe PPL on this sub are mostly losers who joined pes even after knowing its a slightly rigorous college and then complaining about it. \nTldr: for colleges in BLR for cse try for RVCE, if u don't get it join PESU."
  ]
}