{
  "title": "Tips to ace in Chem Cycle",
  "content": "Hey seniors nd phy cycle ppl(currently)!🙋\nCurrently i m in chem cycle nd since u ppl might hv aced ur chem cycle , plz help me with ur advices to score good(9gpa) in this sem like wt all resources to follow nd wt not to(for all subs).Ur advices will be appreciated as it will help many of us..Thank you!😊\n\n",
  "metadata": {
    "id": "1iqtl62",
    "author": "Potential-Cod1070",
    "url": "https://www.reddit.com/r/PESU/comments/1iqtl62/tips_to_ace_in_chem_cycle/",
    "permalink": "/r/PESU/comments/1iqtl62/tips_to_ace_in_chem_cycle/",
    "score": 16,
    "upvote_ratio": 0.86,
    "created_utc": 1739716867.0,
    "flair": "Study Help :table:",
    "nsfw": false
  },
  "comments": [
    "\n\n# I am currently in P-cycle and managed to score an sgpa of 9.1 in C-cycle , so hope this helps , for obvious reasons i cant add anything in either Maths-2 Or C\n\n Mechanics(statics)- The textbook is a godsend—almost all the questions for the ISAs and ESAs come directly from it. They won't even change the values, so it's essential to be familiar with every problem. If it's too much to practice every single problem, focus on memorizing some of the harder ones. Make sure to practice the orange and jackfruit problems more, and really understand the logic behind them.\n\nFor ISAs, the questions are very easy as they mostly consist of theory-based MCQs. To prepare, read the theory from both the textbook and slides, and you'll get the hang of it. Some of it is even just common sense.\n\nOn the other hand, ESAs are a different ballgame. The questions can be quite challenging, so practice and understand the overall logic behind the more difficult problems. I found Unit 4 (Friction) to be the hardest, so spend more time practicing this unit. Unit 3 is easier as it's mostly about applying formulas.\n\n Doing well in the ISAs can really save you during the ESAs, so focus on them. The takeaway is to focus on the textbook for numerical practice and the slides/textbook for theory.\n\n# \n\nEPD-Units 1 through 3 are pretty straightforward, with Units 1 and 2 continuing from the semiconductors you studied in 12th grade. There are a few derivations to remember, but mostly, it's all about applying formulas. Make sure to memorize all the formulas, especially in Units 2 and 3 , make sure when and where to apply each one of them\n\nPay close attention to the diagrams, particularly in Units 1 and 2. Unit 4 is quite different and doesn't follow the same flow as the previous units, but it can be quite easy if you listen during the class\n\nPay attention during lectures, memorize the tables, and understand the logic behind them. If you do that, you'll find Unit 4 much easier. Overall Make sure to go through the slides in depth and practice questions regularly and this will be an A or S.\n\nChemistry- I found chemistry to be the easiest in the C cycle. Unit 1 is straightforward with basic numericals—just study each one from the slides. Unit 2 focuses on electrochemistry, and once you get the hang of it, it becomes fairly easy. This unit also has corrosion as a topic and it involves a lot of memorization, which continues into Unit 3 which does require you to byheart a lot of concepts especially at the end. There's quite a bit to memorize, so don't expect to cram it all the night before the exam. If you can stay consistent and study regularly , this is an easy S grade , just remember to do the lab before the ESA\n\nUnit 4 is organic chemistry and nanoparticles, and it's mostly easy. Be thorough with the slides\n\nconstitution-For this, memorizing the questions a day before the exam . Units 3 and 4 is literally common sense, and you'll probably only need 2 hours  the day before the ISA or ESA to secure an S grade. Just don't be too complacent like I was—I ended up with an A after fumbling an easy S.\n├── For mechanics, did you completely do the tbk like even the problems in between theory apart from the exercise questions? And for epd is it mostly just numericals in the exams?\n├── Thanks a ton bud!\n├── Thanks..means a lot!!\n└── howd u study for epd, like did u refer to slides only and is the tb they mentioned worth using? also how much did u get in epd",
    "If anyone can add something for C , it would be really helpful..\n└── Check previous posts or comments. It's asked every year.",
    "Dont get any grade below C if you want a good gpa"
  ]
}