{
  "title": "PESU captive portal: a masterclass on how *NOT* to internet",
  "content": "there is no way this level of inconvenience was an accident.\n\n\"If words of command are not clear and distinct, if orders are not thoroughly understood, then the general is to blame.\" – Sun Tzu, The Art of War the system is trash, the people in charge are the problem. PESU had one job—set up a working internet system—but their incompetence made it a frustrating mess.\n\nThe One-Device Limit is Bullshit\n\nWhy. Why does this even exist? In 2025, when literally every student has at least a laptop and a phone, PESU decided, \"Nah, you only get internet on one device.\" which also means that if the captive portal randomly logs you out (which it does, ALL THE TIME) you can’t log back in for the rest of the day. So if you were working on something important? Too bad. If you had an assignment to submit? Hope you have mobile data (which also is dogshit on campus for some reason, but maybe thats just my sim card being gae).\n\nIt’s Not the Software, It’s PESU\n\nHere’s the kicker I actually worked at a company that used the **exact** same software PESU uses for their captive portal. And guess what? It worked fine. They didnt have random disconnects, no weird restrictions, just functional internet.\n\nThe Dumbest Website Blocks Ever\n\nI get it—maybe you want to block torrents or *certain* websites. But why in the world would you block **MY DOMAIN?**\n\nNot even kidding my domain used to work, and then, two weeks ago, they just decided to block it. No reason. And it’s not even like they blocked all new domains. Other fresh domains still work! Just mine got screwed for no reason. ITS NOT EVEN LIKE I WAS SMUGGLING DRUGS ON THAT SITE, ITS LITERALLY JUST A PORTFOLIO REACT APPLICATION.\n\nPESU, what the **hell** are you doing? Is there some **secret blacklist lottery system** that randomly decides, *\"Hmm, let’s make this student’s life miserable today?\"*\n\nEC Campus Has It Even Worse\n\nIf you think this is bad, EC campus students are actually suffering. Not only do they have to log in through this shitty captive portal, but they have to keep the login page open just to stay connected. If you close it? Disconnected. What kind of backwards, janky, caveman-era system is this?\n\nWhy is the system different for both campuses? Are you seriously telling me that PESU’s bureaucracy is so disorganized that they have two entirely different captive portal setups, with one significantly worse than the other?\n\nI've seen government offices that were more efficient that whatever the fuck PESU's got going on\n\nIts not even like its unfixable\n\ndude, just, take a day out, get a decent fucking IT team, and ask them to setup a basic login system, or better yet *HIRE ME TO DO IT* CUZ I COULDA MADE A BETTER FUCKING SYSTEM EVEN IN 9TH GRADE",
  "metadata": {
    "id": "1is5dw9",
    "author": "pesu-hater",
    "url": "https://www.reddit.com/r/PESU/comments/1is5dw9/pesu_captive_portal_a_masterclass_on_how_not_to/",
    "permalink": "/r/PESU/comments/1is5dw9/pesu_captive_portal_a_masterclass_on_how_not_to/",
    "score": 110,
    "upvote_ratio": 0.98,
    "created_utc": 1739856554.0,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false
  },
  "comments": [
    "Adding to this, here's a short story (which I've probably narrated before but oh well):\n\nBack when I was TAing for a course, we set up a submission portal to automatically grade the coding assignments. PESU blocked that IP for some reason on a random day of the week. We started receiving complaints that the portal was unreachable and we were extremely confused because half the students could still access it. Even the TAs and the profs were able to access it, but there was a large number of students who couldn't. We broke our heads over it for multiple hours trying to figure out what could be the reason. We even logged into the portal through the student IDs to verify it worked on our end.\n\nWe started asking for debugging information and finally we realised the only difference was that **the ones who couldn't access were accessing it on PESU WiFi**. Everyone who had taken the course and was trying to access the portal on campus wasn't able to but people on mobile data or accessing it at their homes were able to. We lost our shit that day.\n\nPESU blocking their own student assignment submission portal has to be the dumbest shit ever.\n└── its a automatic thing, not some manual guy blocking bruh, so whatever website that automatic \"thing\" thinks is sus, it blocks it",
    "PESU has one of the worst IT support who at the same time boast about their most decorated CSE course.",
    "This is exactly why most of the people I know don't use their own IDs lmao   \nThey use random ones cuz of this device limit bs",
    "These guys made me download vpn",
    "Oh man wait till get one of those outages u have a connection but no internet so stupid just talk to some teacher and get some lab id which have less restrictions \nAfter those u will probably be fine cuz they reconnect without the limit\n\nPs some special id have higher bandwidth and stuff it is lottery cuz they remove em randomly and add it back u need like 5 of em minimum if need to have a peaceful life actually\n└── As someone who had access to special IDs, I agree. Its a lot less tedious and comes with more benefits.\n    └── how to find the special IDs?\n        └── You can't just \"find\" them. They're handed out based on need like if you're part of research clubs or for different events like organising fests. Not guaranteed to get them but sometimes you can request access when you do something like that.",
    "username checks out",
    "I completely agree, the system is terrible. But for the past few weeks I've been using the client authenticator that you can download once you login after choosing to change your password. It has at least mitigated the maximum login problem for me. I can just kill and relaunch the app when I get randomly logged out. I don't have to deal with the shitty login page at all.",
    "was studying in the library and my wifi randomly stopped working. jio also doesn't work anymore so no hotspot.\n\nmailed the IT dept and they responded saying they fixed it. after 30 min it stopped working again.",
    "ec campus always get a bonus kick or what😭"
  ]
}