{
  "title": "my club review (mostly tech clubs)",
  "content": "i see hella freshers going around asking irl and on this subreddit about clubs so heres my take on all the clubs (that i can remember off the top of my head), disclaimer, these are all my OPINION based on what ive heard about the clubs from other people, and based on my experiences with members of these clubs, and this post is dated feb 19th 2025 so depending on when you read this, some or all of this information might be inaccurate, I AM NOT CLUB EXPERT AND IM FAR FROM INVOLVED IN MOST CLUB EVENTS, im just a second year that has a lot of opinions speaking purely out of word-of-mouth\n\nRR Campus:\n\nMUNSoc: i see them winning hella competitions outside college and bringing in hella money, me personally, i dont understand or really respect the concept of MUN, but clearly the MUN society in PES cooking and kudos to them for perfecting their craft so well.\n\nDebSoc: i've had the oppertunity to talk to the heads of this club, they're nice, they also rep the college outside campus pretty regularly\n\ndo take the glazing of debsoc and munsoc with a grain of salt though, after all, as a club, its very easy to represent a college in a MUN or a debate competition than it is to represent the college in, for example, a hackathon. that being said, i do fw MUNSoc and DebSoc, if you're into that, go ahead and join em\n\nDCOP (dance club of PES): among all the dance clubs at pes, the only one i really regulalry hear from is team trance, and lowkey, i scroll their insta a lot and they cook w their choreography, team trance is nice, idk about the others, theres apparently a team sanskrithi and a few others too but idk much about them\n\nShunya (the math club): they're friendly people, i liked arithmenia last year, its yet to happen this year, probably gonna happen in late march or mid april, lets see if they cook, until then i cant say much about their club, they're all really smart too\n\nKannada Koota (kannada club/karanataka cultural club): they do some of the biggest events on campus, their logistics team has gotta be some of the best in bangalore, last year they got raghu dixit to perform on campus, and also they're like the proudest club too, rightfully so, they do kinda get favouritism treatment from the dean of student affairs, which may dampen their ops&amp;logs achievements a little bit, but overall, i have mad respect for the kannada club, if you speak kannada and wanna help around with cultural fests, this is a great one to join, i think.\n\nAura (AIML Club): i get the name is kinda memey but jokes aside, i think aura club lowkey a lil on a nerdy side, even in terms of club culture, i feel like most of the members ive come across are the quintessential computer engineers, i.e, talented at what they do but kinda socially inept, then again this might be selection bias, they do have epoch 2.0 coming up soon, its a datathon, they might cook, lets see, overall, i think this is a REALLY good club if you're into AIML, and if you're able to befriend some of the techy people here, they'll be able to help u a lot in your pursuit of learning AIML concepts\n\nHackerspace RR (open source club): they used to be really good, even the name sounds cool, but lowkey i havent heard from them in a while, the heads of the club are cool people, but i dont see them actually doing events o club stuff, i think its an inactive club currently, not sure tho. people are nice, but club kinda ded\n\nNexus (the \"we do everything\" CS club): in terms of just technical talent of the people in the club, i cant really comment, they've got some really incompetent people in their core team and some decent people too, its really hit or miss, they have like 18 people in their core team, which feels a little.... bloated &amp; beaurocratic, they did host nexgen 2.0 recently and it apparently went really well, or so i hear from people that attended it, they clearly have a great ops&amp;logs team and marketing team cuz they get hella hype, but my personal opinion is that its kinda just a hypetrain club, they dont really have a niche they focus on like all the other clubs and so they understandably struggle with projecting confidence in any single field, i dont really like the club\n\nMahilAi (women's security club): They were kinda ded last year and they're tryna revive the club atm, lets see how it goes, personally i feel like theres a lot of potential in this club but right now its a bit too early to comment on wether its good or bad, they did have an event last weekend and from what i hear, a lot of people enjoy it, so maybe they doin a major comeback this semester, lets see if they keep up the momentum, anyhow i think its a up &amp; coming club\n\nIEEE CS (another generalist CS club): they're smart, they hosted confluence and do workshops every once in a while, last year they were kinda ded but they seem to be back and doing well now, i think its a good club, they have some really smart and passionate people and they got some inhouse projects going, the heads are really helpful and passionate about their field, join this club if you can, they also claim to be generalist but they dont really overstretch themselves, overall i like this club.\n\nThe Alcoding Club (Competitive Programming/DSA Club): They had a bit of a rough start last semester but seem to have gotten their shit back together, i like their coding contests, very leetcode-esque, if you're into competitive programming you may have some fun in them. the heads are approachable and seemed pretty enthusiastic about their field, overall its a decent club and you should join if you're into competitive programming type stuff.\n\nACM-W (Women-only CS club): they do some sizeable events on campus and some of the members are indeed talented, but me personally, im a 19M so i cant really comment on club culture or anything, i think its a good club purely on the basis of the number of events they be doing on campus.\n\nAatmatrisha: you already know them. you dont need me to review them stfu\n\nGronIT (green computing club): they did a 24 hour hackathon recently but i hear from my friends that it wasnt great, its a new club so they'll probably take some time to settle with a stable club culture, when i talked to the heads of this club i couldnt really decern how good they were at programming. overall i think theres potential in this club but its still kinda the new guy so it'll be very hit or miss in the coming semesters\n\nWeal (health-tech club): ngl i dont really get the point of this club, they did do a hackathon recently but i hear it was kinda scuffed, mostly as a result of major budget cuts from dept. of CSE, aside from that one hackathon i havent really seen them do anything on campus, so idk if they ded or not.\n\nEmbrione (they do kodikon): i checked the official website of the club before writing this cuz i didnt remember what they do, and its literally just defined as \"the club that does kodikon\" which i think is apt, they just do one hackathon every year and then kinda die for the rest of the year, but kodikon is like the largest hackathon that happens at pes, its a national level hackathon and they lowkey cook every time, i like this club, the people are really nice and i think its worth joining if you get a chance.\n\nAppex (App development club): its a good club, the members are friendly, the events are nice, i really enjoyed horcrux, and the heads are approachable, nothing much to say here, its like the poster child of what a good tech club should be, if you're into app development, join this club, i like.\n\nTEDxPESU (TED organising club): i like the chill club culture, i mean they have like 1 event they do which is hosting TEDxPESU but they do it pretty damn well\n\nHoPES and Pixels (media clubs): istg they drop the hardest edits on their instagram page, i be scrolling thru their pages like once every week, if you're into video editing or photography/videography, these are some decent clubs to join.\n\nEquinox (Astronomy Club), Qforest (Quantum Computing Club): im like 75% sure these are ded, i havent seen em around in a WHILE\n\nIEEE RAS (robotics): they're pretty smart, they represent the college in some events in other colleges and apparently bring hella moni, idk about the people tho, they seem smart but kinda mean to me, if you fw the members you should totally join, but i dont fw the people, W club tho.\n\nChangemaker's Society (they change stuff in society): ngl, outside of terrathon i have no clue what these guys do, the members seem pretty chill tho\n\n\n\nEC Campus Clubs:\n\nIm not an ec campus student, but from what i can tell, Hackerspace ECC (open source club), ACM and IEEE PESU ECC are the most valid fucking clubs in ec campus, they got W people and do W events, overall i LOVE all 3 and all of em cook with their events\n\nCodechef ECC: i think they tried doing sum stuff during the beginning of last semester but i havent really heard from them since, i remember them being goated asf, they might still be goated asf but personally i dont really see them around much\n\nPixeloid (photography club): they release insane edits, the only issue is that they release event edits like 5 years after the event already got over and everyone graduated, they seem chill but lowkey could work on the speed.\n\n\n\n\nBoth campuses:\ntheres some departmental-type \"clubs\", all of the following are really good and have perks if you are able to join so do join them if you can, i highly reccomend (idk if they're technically counted as clubs tho):\n- ISFCR (cybersecurity)\n- PESU IoT (robotics)\n- PES Innovation Lab (generalist CS/ innovation)\n- RAIS (more robotics)\n\n\n\nAnyway, this isnt all the clubs but its all the ones i can think of rn, if you have opinions about any of the clubs i reviewed or opinions about a club i missed in this review do comment it so that my mental incompetence is reaffirmed",
  "metadata": {
    "id": "1iswmbi",
    "author": "Prestigious-Web-5812",
    "url": "https://www.reddit.com/r/PESU/comments/1iswmbi/my_club_review_mostly_tech_clubs/",
    "permalink": "/r/PESU/comments/1iswmbi/my_club_review_mostly_tech_clubs/",
    "score": 65,
    "upvote_ratio": 0.98,
    "created_utc": 1739938178.0,
    "flair": "Club Post :upvote:",
    "nsfw": false
  },
  "comments": [
    "As a graduate (and founder of one of the \"dead\" clubs) it's sad to see so many of the major clubs that were active in my time and for years before us not being included on this list or being considered dead. \n\nHackerSpace, PESOS, CODS, Equinox, WriteAngle, TTL, DSGNR etc were some of the bigshot clubs\n└── WriteAngle is not really dead I feel. It only works as FYI now, for all events and handles reports etc of all clubs. DSGNR has only one annual event now afaik, Design Sante\n    └── It always used to handle reports, but that was one of its side gigs. They used to host open mics and publish their own work too. DSGNR also used to be the default designer club of PES for all events and fests.",
    "Folks, does anyone know what's up with Haya Racing  nowadays? This was one of the clubs I was most excited about when I joined PES. They only recruit 2nd and 3rd years, but I was fixated on joining them next year (I'm a fresher). I bunked my BT bootstrap and went to their workshop. They were really nice ppl and showed me around.\n\nI heard they took their car to Buddh, but didn't clear tech inspection (some guy on whatsapp said this idk much). The last thing they posted on their insta is the ppl who were selected (this was in Oct '24). Since then, the club seems to be kinda ded. All their stories are promoting other clubs' events.\n└── Me too, one of the reasons i joined PES is cz of haaya. The seniors I met during the bootstrap were super cool, helpful and really passionate. Unlike most of the other club seniors(not all, ofcourse) \nThey seem pretty ded to me too. I really hope it gets revived. Really do.",
    "There’s a club that u did not mention from EC CAMPUS \n\nPARALLAX (game development and ARVR club) : \nWe just conducted a workshop on the software blender where 106 people attended and followed every single thing. So I would say our club is valid as fuck\n└── BEST CLUB EVER!!",
    "Hopes core team fell off hard after the previous seniors istg\n└── they're heading the media domain for AT'25 now so let them cook",
    "And Linguista! Best club in both\n└── Amen brother",
    "https://preview.redd.it/ob1gdou8d1ke1.jpeg?width=899&amp;format=pjpg&amp;auto=webp&amp;s=be51cd3397c36a447697ae4d990599ff8d71bfcd\n\nWhat happened to Avions? This was back in 2014. Highest position by any Indian team until then in that competition 😁\n├── We came AIR 4 in DDC 2024, and won 2nd in Best Technical Presentation as well! We are pretty active in EC Campus, you'd see us in the cricket ground flying and testing out our drones.\n│   └── Glad to hear that. :) \n\nWonderful. Congratulations. Has the team stopped going to the international aero design? Back then we used only participate in the international aero design in Texas or florida. \n\nAlso, thank you for carrying forward the initiative (Avions) that I started way back in 2011. It took a lot of efforts to start something of this sorts without any aerodesign expertise available at the college. We had to self learn from the aerospace texts about conceptual design, stability and performance. We were from the ECE branch. \n\nHaha yes, cricket ground and there was lot of empty space beside the boys hostel back then. That used to be our short testing ground. For regular flights we used to go to a few open spaces in attibele, hosakote and a few other places. If i get time, I'll post some videos. \n\nThank you for replying back and best wishes to the entire team :)\n\nWe think, We Fly, We Rule The Sky. (This used to be our tagline).\n└── Omg LOCKHEED MARTIN SPOTTEDDDD\nwha- \nDo we not have this now?",
    "loads of love from ieee pesu ecc student branch! &lt;3\n└── Yo, never seen the application for joining IEEE ecc pop up. When does it happen\n    └── It happens in odd semesters",
    "how did u miss ecell in the list? literally everyone in AT is an ecell person😭",
    "Haya Racing 🏎️🏎️🏎️🏎️",
    "My advice for juniors trying to join any clubs, as a person who has been and is in a lot of clubs \n\n1. Manage Your Expectations: Don’t hold high-quality expectations from any club, and please do not put them on a pedestal. Clubs can sometimes be overhyped, so it's better to approach with a balanced mindset.\n   \n2. Marketing Reality Check: Before or while joining, club marketing can make them sound extra cool. Often, even the basic stuff is glorified. Understand that being in a club doesn't automatically mean you'll gain all the experiences and learning they promise.\n\n3. Unexpected Learning: This doesn’t mean you won’t learn anything. You’ll often learn a lot, especially things you wouldn't expect. Clubs can teach you about life, handling people and situations, and even about yourself. Be open to learning and have a growth mindset.\n\n4. Politics and Drama: Almost every club has politics and drama. Be prepared to deal with that. You'll soon learn that life isn't fair, and things can go downhill quickly. Your experience might be amazing or terrible—it all depends on your perspective and what you learn from the situations you find yourself in.\n\n5. Set Your Priorities: Don’t hyperfixate or spend too much time on a club (unless it’s a technical club and you’re doing something actually useful). Set your priorities straight and don’t sacrifice your academics for club work.\n\n6. Network Wisely: Use clubs as a way to network and build connections. The people you meet can offer support, opportunities, and friendships that last beyond your college years.\n\n7. Balance Club Activities: Participate in club activities, but ensure a balance between them and other aspects of your life. Involve yourself in activities that genuinely interest you and contribute to your overall development. And learn to say 'No' for your own good. \n\n8. Stay Informed and focused: Understand the club's mission, goals, and current projects before joining. This way, you can see if it aligns with your interests and what you aim to achieve.",
    "Damn that's a nice summary!",
    "Needs to be added to faqs",
    "Both QForest and Equinox are active, organizing events and gaining traction in their domains. However, they remain somewhat overshadowed by the more mainstream clubs.they do try to conduct events at a larger scale on par with the bigger clubs but both the fields look scary from the outside so many shy away from the events.",
    "When I was in PES, equinox was genuinely one of the nicest clubs we had. They had great club leads, welcomed everybody who was interested, and were smart about who they picked for leadership positions. Great group of people."
  ]
}