{
  "title": "Guys, please help me find something I lost in RR campus",
  "content": "Guys I have lost my hydron collider somewhere near BE block. I am in a desperate bid to get it back.\n\nIt's a high energy hydron collider, approximately 1.5 meters in height, with a cylindrical stainless steel housing and a series of superconducting niobium-titanium alloy coils. It operates at a nominal energy range of 14 tera-electron volts, capable of accelerating proton beams to 99.999% the speed of light. The collider is equipped with a cryogenic cooling system to maintain operational temperatures near absolute zero, and its integrated diagnostics panel features a high-resolution liquid crystal display for real-time monitoring of particle trajectories, beam luminosity, and collision events.\n\nThe exterior is marked with several hazard warnings, including “Caution: High-Field Magnetic Containment” and “Risk of Microsingularity Formation,” as well as a serial number (HC-0420) etched near the base. The collider emits a low-frequency hum at approximately 60 decibels, consistent with the operation of its cryopumps and vacuum systems. It also has a distinct blue Cherenkov radiation glow when active, due to the relativistic particles traversing the surrounding medium.\n\nIf you’ve encountered a device matching this description perhaps misidentified as an industrial grade espresso machine or a avant-garde art installation—please contact me immediately.Thank you.",
  "metadata": {
    "id": "1itstki",
    "author": "Chemical_Weekend_85",
    "url": "https://www.reddit.com/r/PESU/comments/1itstki/guys_please_help_me_find_something_i_lost_in_rr/",
    "permalink": "/r/PESU/comments/1itstki/guys_please_help_me_find_something_i_lost_in_rr/",
    "score": 46,
    "upvote_ratio": 0.97,
    "created_utc": 1740035883.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "https://preview.redd.it/rf1otw6ec9ke1.jpeg?width=320&amp;format=pjpg&amp;auto=webp&amp;s=a7beadff32183444a1b4222e5d999a82a17c2f67",
    "https://preview.redd.it/zvjqrow7lake1.jpeg?width=478&amp;format=pjpg&amp;auto=webp&amp;s=44a31f983bd01ae32f9984418346861d27902e33",
    "![gif](giphy|5t9wJjyHAOxvnxcPNk)"
  ]
}