{
  "title": "No wonder pes has so many suicides",
  "content": "I was feeling extremely depressed and numb in class yesterday so I went out and called the PES helpline. They asked me to come to the admission centre and they told me they were counselors. I told them my problem and they just kept asking me if I want to quit PES. \n\nLater they asked to me go visit the HOD of my department, I didn't want to coz how would that help, I wanted to meet a psychiatrist.\n\nWhen I refused they yelled at me saying I'm not a small kid and they can't do shit to help me and it's my own problem and I either have to quit PES or go to my own class. They were so rude I was on the verge of tears after that.\n\n\n\n\n\n\nI can only imagine how many times students asked for help and were treated like this, it was rude enough for somebody to take that step.",
  "metadata": {
    "id": "1iuj2l6",
    "author": "Maybewtfwtf",
    "url": "https://www.reddit.com/r/PESU/comments/1iuj2l6/no_wonder_pes_has_so_many_suicides/",
    "permalink": "/r/PESU/comments/1iuj2l6/no_wonder_pes_has_so_many_suicides/",
    "score": 425,
    "upvote_ratio": 0.99,
    "created_utc": 1740114216.0,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false
  },
  "comments": [
    "OP please reach out on here if you ever need any help. Don't turn to this wretched college. Apart from a few trolls most of the people here go through similar shit and will be willing to always help you even if it comes to relationships or studies. DM's always open. Take care my friend.",
    "I realized this in the very 1st sem, how every teacher is kinda trained to say the same exact things. My mentor somehow made me feel that I was the problem. People do feel numb and depressed and most of the mentors I'll get just don't want to deal with it. \n\nLater, I just started meditating and being ruthlessly honest with my family. Like I tell them literally everything, what I feel and what I have done. It cools things down a bit. \n\nNow I feel like a literal stone, with my parents behind my back, nothing can damage me. I go attend lecture, make notes come home study and move on. It's only a few more sems and it's over. I know it shouldn't be done this way, it's still makes me feel numb but that's what keeps me going. \nOnly a few more sems and over.",
    "Bro meet basavaraj MB sir . He is a chem faculty....and a psychologist. He might help you\n└── He was my chem teacher in sem 2, he's a very nice person",
    "Animals are treated better in pes Wtff\n└── So damn true !",
    "make new friends, take a break/gap year, drop out, or run away\n\ndo literally anything, but please do not kill yourself\n\n  \naint no degree worth dying over man, dont for a second believe that your life is just this one thing, it really isnt\n\n  \nits just a degree, you can get it later on in life or choose to not get it at all, if you need help please call a helpline run by a charity or an NGO, the public ones and the PESU ones are all dogshit",
    "I’m so sorry that happened, that’s absolutely trashy of them :(((( Here if you need anything, feel free to hmu anytime &lt;3 🫂",
    "Reach out to your seniors or friends or even a few teachers there are alot of nice teachers in the sea of bulls*it ones. Counselors are idiots in this college. Seniors would be helpful too",
    "I went to the counsellor too and had a horrible experience. She told me to stop being dramatic lol. I just realised that I needed to take charge of my own life and use my own wisdom to get out of a rut. Take everyone, specially the professors with a grain of salt and please know, that your life is valuable and not worth wasting over this godforsaken college.",
    "Why tho any explanation??",
    "virtual hugs bro dw",
    "Completely useless and hopeless college!",
    "Come to BMS habibi. Same shit here. We will take over you guys one day sadly.\n└── Take over already bruh",
    "Depression and Numbness according to me source out from lack of self belief fuelled by negativity shown by others - can be direct/indirect but the effect stays the same. I graduated from this college a year ago and I have been in a similar situation despite good grades. At the end of the day it's about doing what we love in life. Obviously there's gonna be horrible times in our lives, but suicide is really not the answer. I lost someone who I was close to and I never knew what they were actually going through. I think at the end of the day it's about how we stand together as students and support one another. Yes, we get pushed around a lot and I still do but developing the mentality to persist is something we need to force ourselves to develop. I'm not taking anyone's side here, but all I can say is keep hope and trust in God. Even if you don't believe, just pray for positivity in your life.\n\nIn case any of y'all feel burdened or heavy, feel free to dm me. Remember, you are worth it and you will find a breakthrough, just don't lose HOPE. (hold on pain ends)",
    "Stay strong buddy. They can just threaten you. They can't do anything apart from that",
    "bro fresher here... im assuming you r rr campus.... pls meet reena ma'am(physics teacher).... she's open to all sorts of conversations and helpful.... she whole-heartedly can address any of your problems, make you feel comfortable and help you. reach out to her on whatsapp as well .... unlike some faculty i've seen more like a friend and easy going..... lol atp i dont want to give u any more spoilers.... did i forget to tell you that she's the best physics teacher u can ever find in IIT blr lmao??",
    "Bro I was thinking of joining pes uni next year .But now \n...............\nCould ya pls tell how the uni is iam a 12tie now and wanted to seek advice from one's who r already there...\n├── don't\n├── Just dont!\n└── Read this before you decide to join\n\nhttps://www.reddit.com/r/PESU/s/oJL1tOI0pW\n    └── 😱,never expected such a harsh reality of pes uni.thanks for enlightening with this \nLike any avg twelfthie  fantasies abt college life and knowing this is very disheartening  very thankful to all your advices ....\nAlso which cet college in banglore is good considering \nAll over?? Any advices\n        └── look man, very college comes with its own set of pros and cons. any student will criticize their college if you ask them. the issue with PES is that it's extremely academically oriented, and it can be really tough if you're not naturally academically inclined—it messes with your head. plus, the management here is run by some authoritarian control freaks. try for RV, BMSCE, or MSRIT through comedk or kcet.",
    "Hey man are u ok ? This was on my suggestions , hope u are doing ok now , if anything please reach out to someone you trust , I've been through something like this so I can understand how difficult and frustrating it is OP. Don't do anything stupid. You need some rest take care .",
    "The same happened with me in the beginning of my course, but I am 3yr now and I am counting days I am telling to myself that I didn't even enjoyed properly.\n\nI think you have to stick to what you like(game or else) just don't look in to other people shit's.\n\nMany people compare them self to others even I too did it 🤣 but I laugh on myself now like how dumb and nurd I am in the beginning days.\n\nTake it as a challenge you have to get ready to fight with the world champ 🏆 till your graduation, here you are not fighting with yourself only for your betterment.",
    "all im gonna say is never ever trust a college/company counselor, ever.",
    "My guy, I get it. Please dm if you wanna talk, unlike them imma be chilk with you buddy.",
    "Bro honest advice coming from my heart. Don’t term yourself as “depressed”. It’s fine to be sad all humans experience sadness grief but making a big deal out of it makes it worse. Find something meaningful to do regardless of whether you are sad or happy. Feeling depressed? Hit the gym no gym do some pushups,learn something new get more knowledgeable. Fuck depression.",
    "I am from PES 2013 batch. I at 3rd sem almost felt I cannot do it or finish it. I left the internal exams and went for a movie and came back. Talked at home and decided to carry on just to pass. No pressure. Till last I went on to perform very well. I did not even sit for placement in campus but somehow got a job outside and is doing well. There are episodes of sadness that will go away. Do not coin it to reject yourself. You'll bounce back and do well. OP needs to relax and it's not just the degree that matters in life. You will find your niche slowly.",
    "I called the same number on my first week here and they directed me to the counsellor. While I can't say she's bad, she's no good either. I feel like it's a waste of my time atp, but since I started going to her, I can't stop now. (I mean she said I have to continue no matter what)",
    "hey OP, not saying that you should kill yourself, but, if you're planning on doing it anyway, can you also take out a few people as u go?\n\ndm me, ill send u a list of some of my opps i need taken out"
  ]
}