{
  "title": "Three phones stolen in ECC football ground",
  "content": "Had the inter dept volleyball match today and me with 2 other teammates had kept their bags near one of the small goalposts. When we returned from our match all three phones were gone. The thieves left the third guy's ipad and laptop but kept the phone. They also didnt take any wallets or cash either, just the phones.\n\n Although the staff was very helpful with giving camera access there was no camera pointed towards the football ground which was surprising. \n\nJudging by all the data we have from find my phone, the culprit has to be from the college\n\nIs this the first case of a stolen phone in campus or is has it happened to anyone before?",
  "metadata": {
    "id": "1iuxkbd",
    "author": "Lem0nGuy",
    "url": "https://www.reddit.com/r/PESU/comments/1iuxkbd/three_phones_stolen_in_ecc_football_ground/",
    "permalink": "/r/PESU/comments/1iuxkbd/three_phones_stolen_in_ecc_football_ground/",
    "score": 33,
    "upvote_ratio": 1.0,
    "created_utc": 1740161671.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "-Block your sim card(s)\n\n-Block UPI id by calling the bank \n\n-Reset all passwords (This includes apple id if you had an iphone)\n\n-Delete data if you can remotely (such as any important notes)\n\n-Log out of all the devices once you reset your passwords\n\n-Block all the cards if you had saved any, on any of the apps\n\n-File an FIR\n\nFor ceir you need to block the sim card and get a new one with the same number (because OTP is sent on the number which is stolen, don't know why)\n\nDo not answer to or reply to any of the mails/calls you receive asking you to share any protected details such as passwords.\n\nAnyone reply to this comment to add anything that I forgot.\n└── did all, thanks",
    "fml ,new phone it was",
    "My friend's 2000 rs worth cash got stolen from his bag which was kept in class.",
    "cant have shit in ecc bruh",
    "Legend has it, there used to be a dude who would steal next to everything in EC campus. From cycle to laptop to pens anything. Funny thing is he never stole anything, he'd burried all of those near his apartment. He would go as far as changing t shirt right after theft to make him seem legitimate. \n\nMy 1st sem Mech professor told me about him."
  ]
}