{
  "title": "Club Details for all the freshies",
  "content": "Hey everyone,  \nSo I recently had the chance to talk to a few juniors about what they think of clubs and how the each domain functions, and a lot of them were not sure as to what it would hold for them. I think this might help as a template for generic structure of a majority of clubs in PES, so here goes\n\n1. Operations - Simply put, it makes sure you dont get screwed by the management, the club relies on you to be the bridge between the management and them. The workflow includes writing letters for specific requests like venues, hostel permissions, parking permissions, utilities and many other followed by the club heads reviewing it, which is then forwarded to the Dean of Student Affairs ( Dr. V Krishna ) and in some cases also to the \"respected\" VC.\n\n2. Logistics - As the name might suggest, it involves carrying things around from one place to another. Most events have a lot of stuff like custom ID cards, T-shirts, stationary, items needed for decoration etc etc which is to be bought from outside college, you get to do it. The club relies on this domain to get them the cheapest deal out there and save a lot of money. ( Some club distinguish the money dept as Finance but mostly it is Logistics who handles it )\n\n3. Design - One of the domains which has the most impact on how a event will do, but you will find most clubs struggling with it for 2 reasons, one the designing is tiresome and extensive which the design students feel is not much worth their time and second its not everyone's cup of tea. But if you have a knack for creativity you should surely go for it\n\n4. Event Management - The most sought after domain in all recruitment drives I have seen, the domain which plans what the event will be, the club relies on you to plan attractive themes and ideas so that the events dont become repetitive. These clubs will be a platform for you guys to try stuff out and implement ideas at a stage where the stakes are not that high yet accomplishing them teaches you a lot of stuff.\n\n5. Public Relations and Campaigning - Planning event is one phase of any event, attracting crowd is the next. Simply put, you get to try stuff that will engage more crowd. It is all fun till you have to plan a timeline for how to market this event, when what has to be rolled out and how. I actually landed a freelance job because I handled this domain, fun stuff indeed.\n\n6. Marketing and Sponsorship - There is a always a confusion between campaigning and marketing, the simple difference is campaigning is for an audience who will take part in your event and marketing is for a audience who is interested in how many eye balls your event can catch. You see all these stalls in the OAT, this domain is responsible for bringing them in ( usually for money ). A very crucial domain, probably the most as it helps cope up the budget cuts clubs have seen recently\n\n7. Hospitality - Excited to meet the guests coming to the event, this domain gets you that opportunity. The club relies on you to handle all needs the guests have during events may it be from food, to transportation and any other impromptu ( sometimes way to specific ) demands that they may have. Nobody wants a unsatisfied dignitary.  \n  \n8. DISCO - Short for Disciplinary Committee, you get to be the bouncers who you hate so much, let me tell you ( its fun ) lol, but yeah crowd management and making sure as VK says it \" no hanky panky \" business happens is your job  \n  \nThis covers it the major structure for all the clubs, but events like Aatmatrisha, Chords, Kannada Koota, Samarpana might have a few more cuz well, more work.   \n  \nTo all the first years out there, join clubs, dont chicken out. It might not be the most comfortable thing to do at the start but these events will be part of your college memories for long and hopefully you find a group of friends through them as I did   \n  \nFeel free to drop in any questions you might have :)  \nPs : - A Third year, part of multiple events and a current club head.  ",
  "metadata": {
    "id": "1ivjn1s",
    "author": "No-Implement7066",
    "url": "https://www.reddit.com/r/PESU/comments/1ivjn1s/club_details_for_all_the_freshies/",
    "permalink": "/r/PESU/comments/1ivjn1s/club_details_for_all_the_freshies/",
    "score": 40,
    "upvote_ratio": 1.0,
    "created_utc": 1740233679.0,
    "flair": "Club Post :upvote:",
    "nsfw": false
  },
  "comments": [
    "Quick question, why are these being called \"clubs\"? Aren't these just different domains that handle different angles of organising fests?\n└── Is it the title that is misleading?\n    └── Not exactly, just that there was a previous post that called these domains \"clubs\" and I got confused a bit too cause most clubs don't need all these domains and this exhaustive list usually applies to fests (most clubs don't really need a DISCO team)\n\nAlso you missed the technical domain I think.",
    "Also general advice for any freshers dealing with the PES management for any matter, be extremely polite and courteous. Sometimes some of them wake up on the wrong side of their mattress and take it out on you. So don't get into trouble and be extremely careful on what you speak and how you speak especially if you are in operations domain of any club.",
    "I had a doubt too what exactly does the technical part of a club do? Is it just making some coding questions?  what exactly is the function of this domain?\n└── mostly going to be club specific; some clubs have a tech domain to keep their websites up and running while a few others have a tech domain to deal with coding contests. A lot of the times these guys would also double as mentors when it comes to hackathons.",
    "Finance?",
    "most of these names are self explanatory, lowkey if you couldnt guess what the \"public relations\" domain does, you shouldnt be allowed to participate in human society\n└── Who hurt u ?\n    └── PES\n        └── Hater"
  ]
}