{
  "title": "My friend got 3.7gpa, how cooked is he for placements like even for bare minimum",
  "content": "Also I'm not pes, my friend is in ece campus studying aiml",
  "metadata": {
    "id": "1ivml6c",
    "author": "Loose-Week6717",
    "url": "https://www.reddit.com/r/PESU/comments/1ivml6c/my_friend_got_37gpa_how_cooked_is_he_for/",
    "permalink": "/r/PESU/comments/1ivml6c/my_friend_got_37gpa_how_cooked_is_he_for/",
    "score": 47,
    "upvote_ratio": 0.96,
    "created_utc": 1740241786.0,
    "flair": "Placements 🤑",
    "nsfw": false
  },
  "comments": [
    "Not just cooked. Probably roasted and burnt at this point. Hopefully they are in their first semester and can turn things around.\n\nContext: [https://www.reddit.com/r/PESU/comments/1i73c42/comment/m8k2fah](https://www.reddit.com/r/PESU/comments/1i73c42/comment/m8k2fah)\n└── How do I convince this guy to work more hard tho, he keeps watching movies and stuff\n    └── You can only tell your \"friend\" about the consequences. It's upto them whether they want to put in more effort. If they don't want to achieve success or are simply too ignorant about their future, there's only so much one can do. At the end of the day, only they are responsible for their career.",
    "Cook ah?\n\n\nCollege intake is so effin high, evtg depends on CGPA, not just placements \n\nEven guide allocation for projects in one of the centres at PES was based on CGPA if PS clashed\n\nHigh time he starts studying bruh🥹",
    "dude what.\n\nyou get a 5gpa just for existing 💀💀\n└── true",
    "cgpa or sgpa? , cgpa means yeah , he is beyond toasted , if he is in second sem then with consistent hard work you can atleast get it to an 8+\n└── Sgpa, now 2nd sem chem cycle\n    └── yeah , if he consistently works hard and manages an 8-8.5+ in the remaining 7 sems , he can deffo sit for placements and also crack it , but it does require a lot of hard work and consistent efforts.",
    "That's not possible,.blud has backlogs he isn't telling u that,u can't get below 5 even if u want to, if he clears them he needs to focus on next sem",
    "I had 3.9 sgpa in my very first sem. Got placed in the end somehow. Not the proudest thing i have to say about, but i actually did some sorta comeback tho",
    "bad. 6.68 is the criteria threshold"
  ]
}