{
  "title": "Addressing the Rumours",
  "content": "Hey everyone,\n\nI know most of you have already seen *the video*. It's been circulating for a while now, and while I’d love to clear things up with full transparency, I **won’t be posting it here** out of respect for the privacy of the individuals involved. (Yes, that includes myself. And, of course, the statue.)\n\nFor those who *somehow* haven’t seen it yet, the footage in question allegedly depicts me engaging in **inappropriate** behavior with the Doreswamy statue in GJB, up the ramp. Let me address these rumors head-on:\n\nI was **not** engaging in any sort of *intimate*, *romantic*, or *otherwise questionable* activity with the statue. What you saw was **a structural integrity assessment**—nothing more. As a concerned member of the PES student body, I felt it was my duty to ensure that our statues are well-maintained and structurally sound. If my methods appeared... *thorough*, that is simply a testament to my commitment to the cause.\n\nNow, I understand that **certain angles** of the video, combined with my **unfortunate choice of hand placement**, may have led to some misunderstandings. I also acknowledge that my **facial expressions** (which were purely those of deep concentration) may have been misinterpreted. However, I **categorically deny** any allegations that this was an act of *passionate engagement* with the statue.\n\nSome of you have even suggested that this was **not** an isolated incident. Let me be perfectly clear: Any claims that I have been seen **visiting the statue at odd hours** are **completely unsubstantiated**. The idea that I was there on **Tuesday at 2:34 AM** is absurd, and frankly, I don’t know why anyone would even bring up such a specific time.\n\nMoving forward, I will be conducting all future statue assessments **from a respectful distance** to avoid any further controversy. I hope this post clears up any misconceptions.\n\nThat said, I would *deeply appreciate* if people could stop making false allegations regarding my relationship with this 1 year old statue. Some of you are too creative, and it's getting out of hand\n\nSincerely,  \nyour friendly neighborhood statue inspector",
  "metadata": {
    "id": "1j0fazz",
    "author": "pesu-hater",
    "url": "https://www.reddit.com/r/PESU/comments/1j0fazz/addressing_the_rumours/",
    "permalink": "/r/PESU/comments/1j0fazz/addressing_the_rumours/",
    "score": 113,
    "upvote_ratio": 0.96,
    "created_utc": 1740769024.0,
    "flair": "Meme :snoo_dealwithit:",
    "nsfw": false
  },
  "comments": [
    "sooo, how was said \"**structural integrity assessment\"?**",
    "Someone share video",
    "Send proof or fake!!",
    "https://preview.redd.it/nlsn4xnwizle1.jpeg?width=1080&amp;format=pjpg&amp;auto=webp&amp;s=79a95717a20cdc58c578c744aded9bc7a7fea3a0\n\nsure buddy",
    "Pes student denying allegations w dore statue before gta 6",
    "I'd tap on dat too",
    "Dorediddy\n└── 💀",
    "The things people would believe if its in a reel. Like really?"
  ]
}