{
  "title": "PESU Admission 2025 based on JEE",
  "content": "Pls drop your JEE percentile and the branch offered &amp; PES campus based on JEE score. PES has not published the list, above will help folks to know the trend.",
  "metadata": {
    "id": "1j0r014",
    "author": "NoChampionship4072",
    "url": "https://www.reddit.com/r/PESU/comments/1j0r014/pesu_admission_2025_based_on_jee/",
    "permalink": "/r/PESU/comments/1j0r014/pesu_admission_2025_based_on_jee/",
    "score": 23,
    "upvote_ratio": 1.0,
    "created_utc": 1740802444.0,
    "flair": "PESSAT/Admission",
    "nsfw": false
  },
  "comments": [
    "96.x for ECE @RR campus (selected first preference as CSE and second ECE)\n└── jee mains seats share is 40% now right?\n    ├── 45, I saw it just today on the website, missed registration so couldn't upload first attempt jee marks\n    └── yes",
    "94.3 and dint get anything\n└── hows that possible? I saw a comment in different grp stating 92.8 he got ECE in ECC campus\n    ├── may be 92.x guy selected first preference as  EC campus..seems EC campus is less preferred than RR campus \n    │   └── https://preview.redd.it/v8cuam1y51me1.png?width=1469&amp;format=png&amp;auto=webp&amp;s=0401bc251af14a6ec6465e105c655ee26a52073b\n\nThis was my preference list btw and they say the preference number has no bearing so that cant be it\n    │       ├── What nonsense is this who the hell chooses biotech over a branch u like just to get the campus, are u insane? Do u even know about biotech? Also eee? Are u sure u can do core?\n    │       │   └── calm down man they make you choose 9😭. If it were up to me i would have opted only for cs\n    │       ├── Bro branch&gt;&gt;&gt;campus.\n    │       └── bwahaha this was my exact pref order as well and i didnt get shit 🤣.\n    ├── How much for cse at ec campus and rr campus??\n    └── its damn fucked up my friend who got 90%tile got cs in ec campus. I had called them and i dont think they found my application💀. Anyways they asked me to send a mail and i did so ig we will see what happens\n        └── PES is new to online counselling... so maybe they messed it up...",
    "Clearly PES has messed up big time. All they had to do was to create a relative ranking based on JEE percentile of all the applicants and fill the seats from top to down as per preference and availability. If an engineering college can't do even this much is it even worth it!\n└── Maybe they are considering other factors like state residence, 10th marks etc in addition to jee percentile?",
    "guys any idea what is the cut off thru mains for cse/aiml at rr campus??",
    "95 %ile got this 🤣\n\nhttps://preview.redd.it/p303ychc51me1.png?width=815&amp;format=png&amp;auto=webp&amp;s=32bdcfa57590c05177df86043801e7f28539067f\n├── did you opt for EC campus too or just RR?\n│   └── mate i thought the priority order works like how it works for mains so i went  \ncs rr , ai rr , cs ec , ai ec  \nlooking back i should have probably put cs ec in first knowing i woudnt have gotten cs rr. But what kinda bs is this that i dont get cs ec just cause its my third choice compared to someone's first choice when i clearly have 2-3 %ile more than them.\n│       └── in the website it mentions that the preference order has no bearing in seat assignment so its not that fs they probably just messed something up\n\nEdit:\n\nhttps://preview.redd.it/mzgs8y3m71me1.png?width=1465&amp;format=png&amp;auto=webp&amp;s=1f4f29530c4a0cca6fa8c5096739e85f3029ff34\n└── LMFAOOO GOT THE SAME MSG AT 94.3%TILE. PES is just a hater fr lmfaoooo\n    ├── 😭😭😭 did you try connecting w them? cause ive seen a couple of people who've gotten much lower get in\n    │   └── ye i called them and they asked me to mail it to them and i did. I am waiting to hear back but honestly i dont have much hope left\n    │       └── any updates? did they respond back?\n    │           └── nope\n    ├── got the same msg at 95.5xx\n    └── same message at 94.2 as well they fr playing with us lmao",
    "95, got CSE at EC\n└── Was this filled as ur first preference?\n    ├── Did you not get anything for a similar %ile asw?\n    └── No 2nd, I had cse RR as 1st",
    "94",
    "Will I get anything in 91% jee main in cs? I have not registered yet so I don't know\n└── same doubt"
  ]
}