{
  "title": "Forming capstone teams",
  "content": "\n\nI'm in my 4th sem of CSE and some of my friends are already forming “unofficial” capstone teams and ass kissing potential mentors. No idea why this early, but it's Giving me anxiety.\n\nHow do people generally form teams? Do you just stick with your friends, or if that’s not an option, are you supposed to randomly ask around for people who fulfill the diversity criteria? And does this gender and cgpa diversity actually matter or is it just some formality? I’m a female with a cgpa bw 8-9, can I just be in a team that's all female. Most of my friends are girls, and we fall in the same gpa range. I’ve done projects with some of them and know they’re decent enough when it comes to getting work done. \n\nAlso, what do you look for in a mentor? And how do you convince them to pick your team? I’ve heard bad stories about mentors being extremely nasty and generally unhelpful, so I’d like to know what to watch out for. And what happens if you don't find a team at all lmao.\n\n",
  "metadata": {
    "id": "1j0w7ld",
    "author": "[deleted]",
    "url": "https://www.reddit.com/r/PESU/comments/1j0w7ld/forming_capstone_teams/",
    "permalink": "/r/PESU/comments/1j0w7ld/forming_capstone_teams/",
    "score": 36,
    "upvote_ratio": 0.95,
    "created_utc": 1740823293.0,
    "flair": "Capstone 🏗️",
    "nsfw": false
  },
  "comments": [
    "Ok there's a lot to unpack here:\n\n&gt;Also, what do you look for in a mentor? \n\nGetting a (good) mentor early is extremely crucial for your capstone work. There are at best a handful of good research advisors: ones who actually care about you and the work you do, are not only experienced/knowledgeable in their field but are passionate about research in it, have quality research publications and a track record of helping their students get a good paper, are known to stand up for students and actively help out by almost being a 5th teammate etc.\n\nThese are often the top picks for most capstone teams and they include bigshot names like Gowri, KSS, BJD etc. These are profs who do a fantastic job at guiding and mentoring teams and if you're working with such a guide, getting a great paper (provided you also show interest and effort from your end) is almost guaranteed. Also, this leads to them also giving significantly better and standout LORs for MS applications.\n\n&gt;I’ve heard bad stories about mentors being extremely nasty and generally unhelpful, so I’d like to know what to watch out for.\n\nDon't go for profs who publish just for the sake of publishing. Go through their publication history and experience, see what papers they publish, where it is being published, and how many people cite it. If you cannot figure these out, you can always ask a senior (like me) for help. If their previous research experience looks questionable with poor papers in predatory conferences, do not go for them. &gt;80% profs at PES will be like this. You will need to find the good ones who actually care about doing good research work over churning out a trivial survey paper.\n\n&gt;No idea why this early\n\nPeople start approaching these profs almost a semester early and that's the ideal timeline to approach them. When registrations officially begin, all these profs will already be booked out. So the *only* way to get them is to approach them extremely early and keep in touch with them over the course of the previous semester. So yes, what your friends are doing is actually right.\n\n&gt;And how do you convince them to pick your team?\n\nApproach them after doing your research on what they specialise in and their previous research work. Show that your project ideas (does not have to be concrete but needs to have a general direction - just \"NLP\" is vague, multilingual NLP is a good direction) align with their past work and interests. Show that your team has the skills/experience to work on it through projects, internships etc. You might need to also send a small research statement to make your approach more concrete. But to summarise, ensure whatever you and your team have got aligns well with their interests and your cumulative skills show potential to succeed under them.  \n\n&gt;How do people generally form teams?\n\nYou should pick teammates whose interests align with yours and are willing to work towards the same research goals. Also, ensure they're as serious about capstone as you. Unless all of you care the same about this research project and have the same shared research interests and goals, it'll be very difficult to find a common problem statement. Since this is basically a 1.5+ year long endeavour, unless you're extremely passionate about what you're doing, you're going to lose interest quickly. Once that happens, your grades will dip. So before you go pick your friends, first ask yourself if their interests align with yours. As much as picking friends is easy, it mostly doesn't work out (worked out for me and I was lucky). At the end of the day, put the project and yourself first. Reach out to people in the batch and find people with shared interests, relevant experience in what you're interested in and whether they have the relevant skills to pull it off. You'll eventually get along and become friends as you work together.\n\n&gt; And does this gender and cgpa diversity actually matter or is it just some formality?\n\nWe did not have strict diversity criteria so maybe someone else can comment on it. Should be okay to choose whoever you want. But pick wisely. Sometimes choosing people you know best isn't the best approach.\n\n&gt;And what happens if you don't find a team at all lmao.\n\nIf you don't have a team, you get randomly assigned as far as I know. Although you shouldn't let it get to that stage.\n├── Thanks a lot for this comment, it really clears a lot of things up.\n\nUnfortunately, I'm in ECC, so I don’t know much about the teachers you mentioned. Some of my friends wanted me in their team just because we’re friends, but they have no idea what they’re doing or even a domain in mind. I’m honestly just as clueless and still figuring things out myself. A lot of seniors I’ve spoken to are miserable in their teams, so at this point, if I can't find a decent mentor (which is likely given the quality of professors here), the least I could do is  have good teammates.\n│   └── &gt;Unfortunately, I'm in ECC\n\nFigure out your interest and which domain you'd like to work in. Once you do that, you can ask seniors for suggestions and/or ask around on discord/reddit. Dw, its pretty easy to find out who is good and who isn't, but you're going to have some form of direction first.\n\n&gt;I’m honestly just as clueless and still figuring things out myself\n\nThat's ok, you have time. But you're going to have to double down your efforts and start looking into it soon. Explore and see what interests you and spend some time on whether you want to work on a 2-year long project on it. You're approaching your 3rd year now - you should have begun developing *some* form of affinity towards certain fields, if not specialising in something. If you haven't, then you are a bit behind, but you can always catch up! This is something you need not only for capstone but also placements and your future career. Reach out to seniors/alumni for help if you need any. There are multiple just a text away who are ready to help.\n\n&gt;A lot of seniors I’ve spoken to are miserable in their teams, so at this point, if I can't find a decent mentor (which is likely given the quality of professors here), the least I could do is have good teammates.\n\nI guess this is an understandable conclusion to get to, however, you don't need to always pick friends to have \"good\" teammates. If you check out discord/reddit, you will find multiple posts complaining about capstone teammates and how there is a disparity in the effort being put in and seriousness about the entire project. In almost all of these posts, its a group of friends working together. One thing that also comes with friendship is the loose boundary between members when working on projects, which *can* lead to lack of accountability, responsibility, slacking off and the general \"they're a friend, its ok they will understand if I don't put in the work now\". Make sure the friends you pick to form a team with are as serious about the project as you and encourage others in the team to also put in the effort. Otherwise, you are going to end up struggling to get them to do work. I am not saying this *will* happen, but this is one of the most common problems to occur with teams formed among friends.\n│       ├── I think I'll have a better idea after we choose electives next semester. I don't understand why capstone is in the 5th semester now, since that's when we pick electives that help us figure out what we like and give an insight into more nice areas. I hope they move it to the 6th semester for our batch.\n│       └── What is the criteria for picking team members? Diversity as in having one or two female members or members with different cgpas or both combined\n│           └── Usually both.\n└── \"If you don't have a team, you get randomly assigned as far as I know. Although you shouldn't let it get to that stage.\"\n\nik this is an old post, but I just wanted to clarify on why we shouldn't let it get to that stage? would they just randomly assign teams or  pair according to research interests/goals?\n    └── &gt;would they just randomly assign teams or  pair according to research interests/goals?\n\nMy sweet summer child, after spending 2 years here, do you really think PES is going to go the extent of finding common research interests and pairing students? They just assign the remaining randomly since the ones remaining usually don't have any specific goals. Which is why if you *do* have an idea/goal, do not let it get to this stage.\n\nAlso, 3 months ago is by no means an old post. I've had people reply to my comments from 3 years ago lol\n        └── oh god lol that's fair enough. is it fine if I pm you? had a couple more doubts about this.\n            └── Sure go ahead",
    "Do aiml and ece people are also made to do capstone project?\n└── Yes\n    └── Can we make an inter branch team? Like aiml ,ec ,cs ppl in a single team ? And can u give details abt mentors?\n        └── You might think that this is convenient cause you get to team up with your friend from another branch, but its way more of a hassle than ease. There are various T&amp;C PES imposes about choosing guides and the team setup. Its much easier to go with everyone from the same branch. During my time, maybe 1-2 teams went for cross-branch and they all ran into various hurdles.",
    "\\+1",
    "It depends on what you want your Capstone topic to be on. If your friends want the same topic as you good otherwise just post in your class chat for members who are willing to partner with you."
  ]
}