{
  "title": "I don't know what's happening to me",
  "content": "My roommate. My stupid, annoying, perfect-looking roommate.\n\nAt first, it was normal. Just bro things. But then I started noticing him too much. The way his voice is deeper in the morning. The way his cologne stays in the air after he leaves. The way his shirt lifts when he stretches, showing just a little bit of skin.\n\n\nAnd now? Now, when I’m making love to my girlfriend, I close my eyes… and I see him. His hands, his breath, his body pressed against mine. I try to focus. I remind myself that I like women. That I have a woman. But I don’t admire them anymore. Not like before. Not when he’s walking around our dorm, shirtless, stretching like he has no idea what he’s doing to me.\n\nI used to love women’s bodies. Their curves, their softness. But now? Now all I think about is him. His smell, his strong hands, how he pulls his shirt off after a workout.\n\nI ask him the dumbest doubts just to hear his voice, just to watch the way he ruffles his hair when he’s thinking. When his intelligent mouth speaks, I don’t even listen, I just get lost in his dark brown eyes. The way he talks, the way his lips move when he explains something, slow, careful, teasing like he knows exactly what he’s doing to me.\n\nWhen he leans over my laptop, his arm brushes against mine, and it’s ridiculous how much I feel it. When he laughs, deep and unfiltered, I want to bottle up that sound and keep it for myself. When he’s fresh out of the shower, towel slung low on his waist, drops of water trailing down his chest, I have to grip my desk to stay in place.\n\nI came to IIT Bangalore to study engineering, not to have a full-blown sexuality crisis. \n",
  "metadata": {
    "id": "1j2f2fq",
    "author": "Dry-Variety2859",
    "url": "https://www.reddit.com/r/PESU/comments/1j2f2fq/i_dont_know_whats_happening_to_me/",
    "permalink": "/r/PESU/comments/1j2f2fq/i_dont_know_whats_happening_to_me/",
    "score": 114,
    "upvote_ratio": 0.93,
    "created_utc": 1740994842.0,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false
  },
  "comments": [
    "I think you should marry your roomie",
    "Can't tell if this is genuine or satire 😭",
    "Dude use wattpad not Reddit 🥸🥸🥸🥸",
    "This is obvious satire man how are people confused\n└── Right. I'm so chronically online that I can look at the first line of any  post and tell it's a shitpost",
    "10/10 writing skills regardless\nU should consider BL novel author as a job",
    "https://preview.redd.it/4i37nn6afgme1.jpeg?width=2048&amp;format=pjpg&amp;auto=webp&amp;s=a89ac0dc219c3b96a874e8e24f451cdfcbc55ac7\n\nRoom scenes",
    "It's the universe showing you signs \nIt's time to move on from your girl, your next partner is right by ur eyes",
    "If it's satire, it's satire. If it's not then,\nComing from someone who is bi, maybe you should consider the possibility that you're bi too.... Good luck figuring it out!\n└── How did u figure out, and fought against \"ideal (that's what they think) society norms\" ?\n    └── I'm not gonna be of much help with the how did u figure it out part bcoz I just always knew. When I realised there was a word for what I felt, I was relieved. And talking about \"societal norms\", firstly, fuck them. Society doesn't matter. Secondly, it's a fight everyday. My dad found out recently and it's been terrible ever since. But it is what it is 🤷",
    "you would be a hit on wattpad. please, I implore you to join. and post your stories. THERE.",
    "Sir this subreddit is not your personal diary 😭",
    "Who injected estrogen into you 😭💀",
    "BECOME BISEXUAL",
    "You only know that",
    "God if u truly exist kill me",
    "So, lemme tell ya now you should tell him how unconditional your desire for him is and get him to kiss you and make out with each other eventually. \nSoln no 1 -\nYou can catch him off guard while he's busy in his laptop or somewhere he is chilling, get behind him and call him while he turns kiss a tight kiss on the lips yummy. \n\nAnd then go on and gaslight him so that he thinks that wasn't intentional. \nIn this way you get the kiss and you fulfill your well lil bit of you desire for him.  \n\n\nAnd then as the days pass confess, now how do you do that-  \n\n\n Soln no 2- well typically the next step would be to get him to allow you to wash his clothes for him in this way you get a good whiff of his genital essence and you get to sniff his underwear. Talk about freaky. \n\nNow all that is a speculation proceed with caution. \n\nThere shall be a time where you witness his love and care and longing for you.",
    "Do you dream about being humped or banged by this dude? If not then you are probably just bi-romantic to say the least..."
  ]
}