{
  "title": "General queries regarding PES",
  "content": "Hey, so I might be joining PES in the upcoming batch and had a few queries\n\n  \n1) I read the FAQ on cs vs cs-aiml, but it hasnt been updated in 2 years and wanted to know if any changes have have happened to the cs-aiml course since then.\n\n2) How hard is the first and second sem ( P and C cycle ), is it like really really hard to score a good sgpa, or if you put in consistent work ( like one would for jee ) can you still end up with an 8+ sgpa\n\n3) How is the library? Is it a nice place to study and chill while working on some programming stuff?\n\n4) Can we take notes with ipads/tablets in class or is it only notebook? ( I've sorta been writing on an ipad for sometime now )\n\n5) Any prerequisite material I should read up for the first two sems?\n\n6) Can day scholars leave campus at their own will and time, if they have their own transport?",
  "metadata": {
    "id": "1j32eim",
    "author": "_swan__",
    "url": "https://www.reddit.com/r/PESU/comments/1j32eim/general_queries_regarding_pes/",
    "permalink": "/r/PESU/comments/1j32eim/general_queries_regarding_pes/",
    "score": 16,
    "upvote_ratio": 1.0,
    "created_utc": 1741061635.0,
    "flair": "PESSAT/Admission",
    "nsfw": false
  },
  "comments": [
    "Okay so \n\n1) CSE-AIML has been updated and its syllabus is mostly the same as CSE core as of right now. The only thing you're missing out on is that it's a little restricted if you're not interested in AIML ( which is purely mathematical by the way ).  So CSE core is still slightly preferred but both branch graduates will mostly end up in similar jobs as there's less AIML jobs for undergrads specifically.\n\n2) If you put in consistent work like you would for JEE then it's a little too much tbh 😂. It's not that hard at all. Make sure to read the slides and study on weekends at the very least and you'll be fine. Most of the batch ends up with 8+ in their first year , don't worry too much about it, the subjects aren't that hard. Physics cycle is said to be comparatively harder but honestly if you are consistent it's not a problem. Also don't spend your first year engrossed completely in academics ( like one would for JEE ) , there's many more fun things to do.\n\n3) The library in GJBC is one of the best places to chill and study. You can go there alone and find peace with your laptop/books/library books or with a group in one of the many conference room cabins in the library. \n\n4) This is very teacher-dependent , but most teachers allow notes on ipads , atleast in my class it's allowed but you have to be sincere and not do anything distracting on the device. \n\n5) Not really. Everything , including the programming languages is taught from scratch but you might wanna get a good grip on Python/C if you're into CS . Otherwise you can just chill until the semester starts , or gather resources/slides/materials for your respective cycle ( Physics/Chemistry ) \n\n6) Yeah they can , for sure.\n└── Thanks a lot, I didn't quite understand what you mean by AIML might feel restricted if I'm not interested in it.\n    └── You're welcome and I meant that once u chose AIML the elective options that you have are restricted to the AIML field only. For core cse students the electives are different and have more options in different branches too\n        └── Ah yeah that makes sense, that doesn't seem to bad for me. Thanks.",
    "How are you so sure that your joining pes"
  ]
}