{
  "title": "Aatmatrisha",
  "content": "What is the cost of aatmatrisha concert ticket?? Is it better than MAAYA?? ",
  "metadata": {
    "id": "1j6aivm",
    "author": "FlakyDragonfruit8712",
    "url": "https://www.reddit.com/r/PESU/comments/1j6aivm/aatmatrisha/",
    "permalink": "/r/PESU/comments/1j6aivm/aatmatrisha/",
    "score": 16,
    "upvote_ratio": 0.85,
    "created_utc": 1741412949.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "Maaya has the same budget as a club event in RR campus 😭😭😭😭",
    "mostly ranges from 700-1100\n└── Can confirm,Also AT is far better than Maaya\n    └── Yes it better be its like 10x the budget of maaya\n        └── Not sure if you’re aware of the lovely kalesh PES Management does but it’s certainly not 10x,not even close.\nWe just sell more tickets,have better revenue streams and actually call an artist that people know.\n            └── 1cr vs 7lakhs no shit you have better sales\n                └── 1 crore brother?💀 it isn’t even 15-20% of that \nThe difference between the amount of money maaya gets from PES and AT gets from PES is less than the fees most people pay for a year\n                    ├── So you're telling me you guys got shaan for 20L 😭.\n                    │   └── PES only gives a fraction of the money we use for fests.\n\nThe breakdown is as follows:\n\nPES given budget \nTicketing \nSponsorship \n\nThe difference in the total budget for either event is because AT sells more tickets,we receive more money from in-house events and our sponsorship turnout is better.\n                    └── let's not kid ourselves lmfao, AT gets more than 5 times the budget from PES itself\n                        └── I can give it to you in writing that it isn’t that much,I’ve been connected to AT proceedings for the last two years trust me 💀\n                            └── I've been a part of maaya for the past 2 years too lol, I've seen the way the management treats both the campuses. It's quite obvious AT gets a lot more money from the start"
  ]
}