{
  "title": "Ask Me Anything - HR Professional with 15+ years experience :)",
  "content": "Ask Me Anything - HR Professional with 15+ years experience :)",
  "metadata": {
    "id": "1j857ux",
    "author": "Neat-Broccoli-2009",
    "url": "https://www.reddit.com/r/PESU/comments/1j857ux/ask_me_anything_hr_professional_with_15_years/",
    "permalink": "/r/PESU/comments/1j857ux/ask_me_anything_hr_professional_with_15_years/",
    "score": 21,
    "upvote_ratio": 0.93,
    "created_utc": 1741630301.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "How effective is cold mailing?\n└── Chances are very low. The best way to get your self shortlisted for an interview is through referrals. LinkedIn is the best forum for the same. Well prepared and specific requests to potential connects make the difference.",
    "Have a bunch of questions, would love to discuss some over DM as well! \n\n1. What trends are you noticing in the tech job market, particularly for freshers and junior developers?\n\n2. Are there specific companies or sectors actively hiring for backend/ML roles right now?\n\n3. When exploring job opportunities, is it more effective to connect directly with the hiring team or reach out to HR first? Are there situations where one approach works better than the other?\n\n4. What are some effective strategies for negotiating salary with HR? Are there key points or techniques that can improve the chances of securing a better offer?\n\n5. During conversations with HR, what important factors should I keep in mind? Additionally, in situations like layoffs, how can one navigate the discussion to avoid feeling pressured or manipulated to take a low ball offer? \n\n6. As a fresher in Tech(less than 1 Year of Exp) \nwho is laid off, for how long does the gap in resume work (1/3/6 months?)",
    "Hi Sir/Ma'am,Are you looking to hire?\n└── We do hire. Fresh graduate hiring is through campus programs.",
    "Hey, not sure if this is real.\n\nOne question i would like to ask is, How has AI shaped your Hiring experience as an HR, be it in a positive or negative way?   \nand what are some hurdles u face commonly in hiring process?\n└── AI is yet to make an impact on hiring process. There are automation tools being used by most organisations to filter resumes even before all these AI hype. What I have observed is candidates are able to prepare well with the help of AI basis the organisation they are applying for jobs.\n    └── Oh thanks for the reply",
    "Have you seen anyone get internships in 2nd year\n└── Not in my organisation under my vertical and I am from a FAANG. Not sure of tech roles. Need to check.",
    "I am doing MCA and I am pretty good in DSA (Leetcode). Do I have a chance in getting into a good PB company.",
    "how does it feel asking college girls to be their sugar daddy?",
    "How can I get microsoft internship if I am in 2 nd year of btech??\n└── I will have to check this. I don’t work for Microsoft."
  ]
}