{
  "title": "AT artist reveal",
  "content": "who were the artists revealed for AT this time?",
  "metadata": {
    "id": "1jaezv9",
    "author": "Unusual_Sky5634",
    "url": "https://www.reddit.com/r/PESU/comments/1jaezv9/at_artist_reveal/",
    "permalink": "/r/PESU/comments/1jaezv9/at_artist_reveal/",
    "score": 32,
    "upvote_ratio": 0.97,
    "created_utc": 1741880649.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "Mohit Chauhan - AT nite\naaditya kulshreshth -comedy nite\n├── Damn not bad, huge improvement from our trash ATs\n│   ├── Didn;t your batch get Biswa if I am not wrong? xD\n\nAlso its unlikely any batch will be able to get a great artist + standup comedian combo. The budget is big but not unlimited. Compromises need to be made *somewhere*\n│   │   └── we got biswa but his \"jokes\" that night really sucked. And it started really really late so many of us were tired already.\n│   │       ├── He sucked? Damn I liked his jokes on yt shorts. \n│   │       │   └──  He just kept harping on about his biotech degree from IIT was useless lol. felt like low-hanging fruit. and as I said both biswa and Shaan showed up really late to the event, and the whole fest was very poorly organized, so people were already pissed by the time everything started. Shaan was amazing tho XD and great at entertaining the crowd, I'm still glad I got to see him live.\n│   │       │       └── People who all saw Jasleen royal live and i forgot the name of that Stand up guy, will say this combo was miles better\nBoth of them sucked big time, the only positive abt that AT was Nitin kamath (kannada stand up comedy)\n│   │       └── his humour and your humour frequency prolly dont match\n│   └── We got Shaan in our final year and Pineapple Express was fantastic as well\n│       └── thats cuz it was golden jubilee not for like AT purposes i think\n│           └── No that was for at nite\n│               └── oh okay wow AT budget seems way higher than maaya budget ngl\n├── There are two artist coming for comedy nite right ?\n│   └── yes Kullu and Shravan for comedy nite\n└── horrible\n    └── mohit chauhan's damn good bruh  \nidk who the comedian is tho\n        └── Kullu from Tanmay Bhat's reaction videos lol. Fun dude but never watched his actual standups.\n\n*insert clip of Kullu drinking water from vodka bottle*\n            └── https://preview.redd.it/ntumrdbvrhoe1.png?width=1144&amp;format=png&amp;auto=webp&amp;s=178313c2bfb5b777a296ac50e5b0a9575833be9b\n\nLMFAO i love the fact that you know him ! lowkey i feel like thats what keeps my sanity on point .",
    "Op comedian",
    "also what are the dates of AT ?\n└── April 4th and 5th",
    "Last year combination would have been the best but yeah Biswa couldn’t perform well, tbh even when he tried crowd interaction I think people were not that interactive as you see in crowd work too lol",
    "Can alumni come?"
  ]
}