{
  "title": "Aatmatrisha critic",
  "content": "Just share your opinions on aatmatrisha both positive and negative \n\nMy opinion ( No hate if I am wrong pls correct me)\n\n1.Why do they keep aatmatrisha just before ISA why can't they keep it atleast a week before.so.that atleast we can enjoy fully without overthinking much about ISAs\n\n2. What is this method of buying tickets why make it complicated, I am not complaining and I know it's not an easy task but still you could have made this course easy only.\n\n3.why pes does not make maaya as aatmatrisha \n\nHope this event turns out good as well as your ISAs ",
  "metadata": {
    "id": "1jb6xma",
    "author": "Frequent_Purple3443",
    "url": "https://www.reddit.com/r/PESU/comments/1jb6xma/aatmatrisha_critic/",
    "permalink": "/r/PESU/comments/1jb6xma/aatmatrisha_critic/",
    "score": 65,
    "upvote_ratio": 0.99,
    "created_utc": 1741967031.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "AT and maaya are complete disasters compared to fests in other colleges, and not because of budget or scale, but pure incompetence and disorganization. AT last year was a fucking joke. they delayed everything, made everyone wait in line in 36 degree heat for 3 hrs, and the volunteers were useless. maaya wasn’t any better. they held a paid diwali \"party\" that some of my friends went to, started ridiculously late, and wrapped it up in just 30 minutes.\n\ni've had fun, but only because of my friends. these fests are not worth the money otherwise.\n├── This time too volunteers are no better. It happens every time most of them are noobs/ first timers. Once you are inside the concert, you are forced to buy overpriced stuff a 10 rupee water bottle is sold twice-thrice its price. Trust me, you will have fun only if you are with your close friends else forget it, everything will be annoying. Be ready to stand in line for upwards of 3 hours. Dumb organisers can’t even plan out the registration and frisking properly.\n│   └── the volunteers don't  gaf about the fest. they only signed up to bunk classes and get free attendance.\n\nthe water bottle situation was ridiculous. i was dizzy from thirst after standing for hours in the heat, and finally i got to a stall sellig water, only to see a massive crowd fighting for a single bottle. i have no idea how i made it out of there alive, but i know for sure i’m never going again lmao.\n│       └── The least they can do is give everybody a frigging water bottle after taking so much money for that pass lmao but nah lets churn out MORE MONEYYYY\n└── Sh!t at PESU ALWAYS starts wayyy later than its scheduled, this shows that they have no value at all for others' time. \n\nPart of the reason why I don't attend any of the PESU bs events.",
    "1. Mostly cuz its only First Year who has their ISA just after AT, rest all have it later.\n\n  \n2. Agreed, but else will they generate the \"hype\"  if everybody buys online?",
    "Hard agree on 2. The ticketing system is overcomplicated, they should either keep it full online or full offline",
    "Maaya &gt; AT . Who tf is buying a ticket for 1000\n├── Well AT does get more expensive artists tho.\n└── Me unfortunately. Seeing the reviews on reddit kinda makes me regret buying tickets.  I am going with friends tho so I'll make the best of it ig lol",
    "Bro it's aatma Trisha not rcb unbox event just chill and wait for the reality hits."
  ]
}