{
  "title": "Regarding Game Hackathon conducted by Parallax",
  "content": "So, I endured a Game Hackathon at PES University Electronic City, organized by the Parallax Club. Let me save you the trouble: DO NOT ATTEND ANY EVENTS CONDUCTED BY THIS CLUB.\n\nLet's just say, 'hack' was the operative word, and they definitely hacked my patience.\n\nFirst off, ₹250 for what? A masterclass in disappointment? The 'dinner' was average, the 'breakfast' was a crime against humanity, and 'snacks' were a mythical concept, unless you wanted to pay more at the stalls they conveniently set up after charging us.\n\nMidnight snacks? Let's not even go there. I'm still trying to identify what that... substance was.\n\nGoodies? Oh, they delivered. A keychain that would excite a five-year-old and a radium band. Because, you know, we're all about to go rave in a dark coding cave.\n\nThe 'rubrics' were apparently written in invisible ink, because no one saw them. No paper reviews, just vibes. Bad vibes.\n\nThe schedule? A chaotic masterpiece. A final review at 11 AM meant we foolishly rested at midnight, only to be ambushed with a 5 AM review. Then, at 8 AM, they decided to dramatically eliminate half the teams. Without warning. Seriously, why not just tell us at 5 AM? We were still working!\n\nVolunteers? Picture a pack of grumpy toddlers wielding clipboards. No AC in the sweltering heat, and the event hall was basically a mosquito breeding ground. It was like coding in a swamp.\n\nInstead of that useless radium bands they could have given lays. Lays are better than that radium band.\n\nThis wasn't a hackathon; it was a psychological experiment. I'm pretty sure I saw someone coding in Morse code using mosquito bites.",
  "metadata": {
    "id": "1jbzftf",
    "author": "Mongolian_Cheese",
    "url": "https://www.reddit.com/r/PESU/comments/1jbzftf/regarding_game_hackathon_conducted_by_parallax/",
    "permalink": "/r/PESU/comments/1jbzftf/regarding_game_hackathon_conducted_by_parallax/",
    "score": 100,
    "upvote_ratio": 0.88,
    "created_utc": 1742057452.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "&gt;The 'dinner' was average, the 'breakfast' was a crime against humanity, and 'snacks' were a mythical concept\n\nHostelites:\n\nhttps://preview.redd.it/ba1x0ice8woe1.jpeg?width=674&amp;format=pjpg&amp;auto=webp&amp;s=f093795390d9b6bacf109ebc6e1eb280c2f82b71",
    "Well well well!!!\nOp u summoned the whole club into this thread.",
    "![gif](giphy|uWzS6ZLs0AaVOJlgRd|downsized)",
    "To all the dick riders of the club, rather than shifting the blame onto the college itself why don't you take the criticism and rather improve stuff in your upcoming events. I have been observing lately but the last few posts regarding such events paint a sad picture of your management of those clubs.",
    "Club events r really declining in quality. Even unicon hosted by MUN last week was dogshit fron what I heard from people\n├── See it depends on the team who organises. Read this chat I am getting to know this EC campus Game Dev club is not that good. Every club is started with a great determination, but what can be done if the successors of it are just doing timepass using its name. Better not to conduct if you can't make it the best:(-\n│   └── I feel a lot of club heads these days and even members are just power hungry n show offs and they don't have that determination so because of that their events r shitty\n├── Aren't these the same retards who started that shit show drama in the EC '27 WhatsApp gc? They suck balls.\n│   └── woah what drama??\n└── tbh unicon among blr circuit is one of the more tougher mun events, so not all beginners would've felt the same about it. And considering what happened in Pecon (rr mun) last year, Unicon was handled way better in terms of management",
    "It's a college hackathon, relax",
    "As a participant myself, most of your complaints seem more directed towards the campus rather than the club   \n\\- food was provided by the college canteens  \n\\- goodies were well received from what i saw  \n\\- the halls for the students and its facilities(working or not) is again part of the campus  \n\\- the schedule was shared before the event started so you not knowing seems like a personal skill issue innit?  \ni do agree there were problems and it could've been better but most of these seem like personal vendatta( did you not make the top ten lil bro?)\n└── Food/Campus related problems are understandable upto some extent .But they didn't mention anything about elimination in schedule.\n    ├── honestly i get the elimination criteria being a big surprise since we had to be up at 5:30 and all  \nthey should've mentioned that beforehand.. but any hackathon i've been to has had the concept of top 10 so i did see it coming here (again i understand your frustration about it)  \nregardless of all that..at the end of the day, even they're all students trying their best to organise and give us a good experience, being this rude to them just cause some things didnt work out isnt okay innit?\n    │   └── I've expressed my frustration. This is intended as helpful criticism, not as an insult.\n    │       ├── I understand.. but the words were just a bit too harsh if it was intended as just criticism\n    │       └── \"this wasn't a hackathon, it was a psychological experiment\"\nIf you're insulting someone, don't deny it bro.\n    │           └── Lol what’s even insulting about this? The guy is just stating his opinion. Yall need to relax and stop hounding him over nothing.\n    │               └── I'm not saying he shouldn't state his opinion. I'm saying if he's insulting someone and gets called out for it, he shouldn't scurry back into his hiding place. If someone called any event a waste of time or money, that's more of an insult than an opinion, don't you think?\n    │                   └── Buddy, you logged into this account after months just to defend your club? 😭😭 Are you guys running PR or what? The way so many of you are suddenly popping up and getting this defensive is funny asf. Learn to take criticism.\n    │                       └── I love how you went through my profile and shit. If anything, it's suspicious how much effort you're willing to put for an online argument.\n    │                           └── &gt;how much effort you're willing to put for an online argument.\n\nironic. saying this as if you guys didn't gather half your club to brigade this post lmaooo\n    └── So what you're saying here is 90% of your post is bullshit\n        └── It wasn't that one thing was bad, it was that nothing was good",
    "You got eliminated didn't you",
    "Hey buddd, wanna know a cool fact ? it seems like your just talking about something that is obvious. you paid 250 rs, want me to break down the unit economics ? here we go : \n\nhttps://preview.redd.it/ytegofcb9woe1.png?width=1418&amp;format=png&amp;auto=webp&amp;s=1f738949d9f568af972e86f1a275cb8e1144aad4\n\nso now from the 250 bucks, you have just paid 20 bucks for paneer, 20 bucks for dal and another 50-60 bucks for rice, chapati, midnight snacks, tea etc.   \n\\-we are left with about 150 bucks after cutting about 100 bucks for food per person ( NOW IMAGINE BUYING 24 HRS OF FOOD WITH 100 BUCKS ? TELL ME WHERE THE FUCK CAN YOU DO THAT ?)\n\n\\-further dissecting the 150 bucks, you prolly paid 15-18 rs for electricity, water supply.  \n\\- 50 bucks prolly goes towards managing the promotion and the props needed for the event, \n\nwe are left with about 70 bucks \n\ndont forget, all the incharges of food and security worked OVER FUCKING TIME, you paid some portion of their income too, remove another 35 bucks for that\n\nwe are left with 35 bucks now...\n\nwondering where that 35 bucks went ? THE RADIUM BAND AND THE KEYCHAIN.\n├── Electricity and water charges are not charged by the university.\n├── &gt;\\-further dissecting the 150 bucks, you prolly paid 15-18 rs for electricity, water supply.\n\nBruh r u Fr?\n\nOh u forgot ₹10/- for breathable Air!!\n│   └── Don't forget ₹5/- for everytime you use washroom...lol\n│       └── Pay or put it back.\n├── See I worked in AT and many prestigious clubs in RR campus. I don't understand your split up here dude. Food Court takes around 100rs for dinner, 60rs for breakfast and 20-30rs for snacks. So if you think for food it goes around 200rs, but a question peeks into my mind what happened to the budget provided. Generally the budget completely takes care of the food and prize pool. \nLiterally this breakup is meaningless. Don't try to patch up things.\nTry next time to make a better event, I understand it may be new to you people to organise such events but don't lie.\n└── Lol, bruv u just made a meme outta urself\n    └── who gives a shit im too unphased rn with what any1 says to me\n        └── And this is the mentality of why the clubs in college are shit today\n            └── oh yeah ? how have you made anything better ?\n                └── Alright,I will not take it in the sarcastic way that you have intended, and I'll give you a bit of advice as your senior (I have passed out so pls). \nFirstly, if a lot of people tell negative stuff about your event, then there is a high chance the event was conducted poorly. Own up to it, and learn from it. Do not cry Abt it.\nSecondly, please remove this mentality of \" I am always right the world is always wrong my way is the perfect way\", no one is perfect, no event conducted is perfectly. I was part of a few clubs, and to be Frank one of the pop up events we conducted was an absolute flop where the volunteers and the organisers had no connect and the participants suffered. We did not tell deal with it, instead we took it as a good feedback and did better in the next event.\nThirdly, there is a point to be made that your budget planning was horrible, because of you are comparing to what someone has to buy from outside to make a dish for let's say even 3 people, to how much one person eats? Then there is something wrong. Usually the college will not ask you to pay any money from the organisers side as this budget is taken out from the hackathons funds. That budget guarantees free food and snacks, so unless there has been some golmal with the funds, u cannot put that money and give subpar items to the participants.\nFourthly, speak to your heads and your official professor in charge about all this budgets and stuff, and especially to VK sir, as they will help you in planning and arranging. \nFifthly, telling participants at 5am in the morning that they are disqualified is horrible planning, as if the participants want to leave after this, there is almost no reasonable transportation at this time. Something the organisers have to think about\nFinally, here is some advice as your alumni, dude this attitude which you and I see a lot of your generation has is really horrible especially in the corporate world. Cause if you show that your like this to your managers, they will fire you. These events are a time where you hone in your leadership skills and how you perform in a team, and if the event has gone like shit, then admit it and next time do better.. there is always a next time so I don't get why your resisting against criticism so much.. I'll repeat it for you, this is an opportunity for you and the club to grow and learn. Do not waste it. \nNext time, make a checklist of things you need to do. Make it known to the participants about the timings of the review,  basically from what I see, this hackathon flopped cause of the poor planning before and during the hackathon. \nI hope you will read this message in it's entirety and learn, and not take it out of context and make this an ego competition. Believe me, yall are still fledglings sheltered by pes.\nSo a short summary, learn to take criticism, learn to bow your head down when the general consensus is against you, especially in events where the participants feedback is the most important, and every opportunity is a learning opportunity, dont waste it(yes this one has been overused, but as you grow older you will realise how much meaning this one line has.) \n\nIf you have anymore questions or want advice or something, reach out, at the end of the day we are all PEST's 😆\n                    └── want to know the crazy part : im not even part of this club, I just hate people cribbing about what they paid for like thats average \"indian\"  mentality ? \n\n  \nanyways all cool\n                        └── Dude from the feedback I saw and I did a little bit further digging into this, it seems that almost all these points were true lol. Eh it's all cool and I hope some of the organisers see that message.. chill out and have fun my man, it's just college"
  ]
}