{
  "title": "In Parallax's defence.....",
  "content": "Hey so i saw a post about someone ranting about the deltatime game development hackathon conducted by parallax, and i got a few things to say\n\nTo say things like \"dont attend events by this club\" and cite reasons like the food being bad is just an admission that you dont realise how little of control clubs have over their budgets.\n\nCollege Clubs, for the most part, dont get a say in how much money they spend in their club, how that money gets spent and in some cases they dont even get to pick which companies they are allowed to take sponsorships from.\n\nI'm not saying deltatime was good or fun, im saying that singling out the club is not only unfair to the parallax team, who, again, had nothing to do with most of the issues you stated, but it diverts attention from the real culprit, which is fucking ceaseless cut-throat budget cuts all the clubs are facing and the bullshit policies the college has with respect to stalls and sponsorships.\n\nIn my opinion, parallax is an amazing niche club and a lot of people that I've met in that club were really talented and had a genuine interest in their field, something that i cant say for a lot of clubs unfortunately.\n\ngiven rhe circumstances that the college leaves its clubs in, its a fucking miracle that a club is able to pull of any sort of event at all, and the fact that deltatime was able to happen without the college damn well burning down, is something i think the parallax team should be commended for.\n\nIm not saying dont bitch about events, i agree that the quality of events at pes is headed nothing but down, im just saying that the club's arent really to blame for it",
  "metadata": {
    "id": "1jc9brs",
    "author": "pesu-hater",
    "url": "https://www.reddit.com/r/PESU/comments/1jc9brs/in_parallaxs_defence/",
    "permalink": "/r/PESU/comments/1jc9brs/in_parallaxs_defence/",
    "score": 37,
    "upvote_ratio": 0.73,
    "created_utc": 1742084961.0,
    "flair": "Club Post :upvote:",
    "nsfw": false
  },
  "comments": [
    "Finally some much needed subreddit drama since the bed throwing incident",
    "For the sake of my sanity I will not get into another kalesh right during my exam week. Please go ahead and fight it out, you have my full support. This is just the entertainment I need\n\n![gif](giphy|uWzS6ZLs0AaVOJlgRd)\n├── What exams you writing unc\n│   └── Midterms\n│       └── midterms is crazy and also why do MS unis even ask for midterms, shouldnt they just consider it based on, in your case, RnD and projects and stuff???\n\nanyways good luck soldier\n│           └── Depends on the course. Most midterms here aren't \"exams\" but large deliverables you need to meet and are meant as progress checks on your ongoing research for that course, but yes, some courses do have traditional exams and I have one such course this semester. \n\nAnd thank you :)\n│               └── ohhhh enjoy\n└── Why are you scrolling through reddit during your exam week"
  ]
}