{
  "title": "Mental help",
  "content": "I’ve been feeling unmotivated and uninterested in things I used to enjoy. Even on breaks, I don’t feel rested. I wake up feeling like I should be productive but end up doing nothing and feeling guilty. Activities like video editing, anime, or even things that used to excite me don’t feel the same. Even when I try something refreshing, like going for a walk, the feeling doesn’t last. I don’t know if this is burnout or something else, but I want to understand why I feel this way and what I can do about it.\n\n\nI also feel the last time I was completely free (without any actual tensions) was in my 9th.\nI constantly long for holidays but end up doing nothing , and feel sad for going to clg the next Monday.\nHow do resolve this problem asap, I wanna do quite some thing and if it's my  current self then I definitely can't do those \"things\"\n\n\nPs: according to chat gpt i am experiencing existencial crisis\n(Btw in my 4th sem now) ",
  "metadata": {
    "id": "1jcme3j",
    "author": "Radiant-Contract-460",
    "url": "https://www.reddit.com/r/PESU/comments/1jcme3j/mental_help/",
    "permalink": "/r/PESU/comments/1jcme3j/mental_help/",
    "score": 87,
    "upvote_ratio": 0.97,
    "created_utc": 1742134555.0,
    "flair": "Study Help :table:",
    "nsfw": false
  },
  "comments": [
    "Idk if you had seen my past posts \nI had posted ( 2 months ago ig) a post in which I talked about my social problems like I had difficulties in talking to new people( especially when it comes to girls)and making friends but now things changed a bit since I am now socially a bit active compared to myself few months ago.\n\nBasically what I wanted to tell you is that look where you lag behind and try to overcome it. As you watch animes I think you can  join their respective sub reddits and have a discussion about the anime you prefer during your free time \n\nFinally try dancing  to some desi songs while you are bathing I think it might help you feel motivated 😺 \n\nAnyway stay motivated and be happy that atleast you are not indulged in some wrong activities\n├── \"Dancing to desi songs\" so cute 😭😭\n│   └── yeah dancing to soni de nakhre reallyyy helps bruv trust me on this one\n│       └── Will try tmrw for sure🥰\n└── Dancing or vibing is an instant cure, trust me... I do it regularly. Be careful if u r doing it in bathroom.. 😅",
    "You sound burntout bruv 🫂",
    "\n\nYou are not alone\n\nEven I have been feeling the same since COVID. I also have ADHD, which makes it hard for me to get through daily life. I struggle with a lack of confidence, overthinking simple things, and experiencing a lot of stress due to confusion .like If I take an exam, I keep thinking afterward—Did I choose the correct answers? Did I fill out the OMR sheet correctly? These thoughts keep looping in my mind, and I still haven’t found a way to stop them. (I feel like this will stay with me for life.)\n\n(Even i am in 4th sem) \n\nNote: My grammar is bad, so I corrected it using gpt.\n└── Lmao",
    "i relate to every single word of this post. 🥲",
    "I feel tired and less motivated when ever I watch reels or shorts",
    "Watch my [video](https://youtu.be/KUwRjipe1gw?si=J-P_a3ZydHi5wcBW) it cures depression",
    "brother/sister, if you are in CSE:  \ndo you have any tips on trying to code while feeling like this? i dont feel interested in coding anymore as much as i was before i joined pes"
  ]
}