{
  "title": "any channels for PESts going abroad for MS?",
  "content": "basically title. thinking about going to US, wanna talk to people in the same dilemma",
  "metadata": {
    "id": "1jfisam",
    "author": "Remote-Tough4396",
    "url": "https://www.reddit.com/r/PESU/comments/1jfisam/any_channels_for_pests_going_abroad_for_ms/",
    "permalink": "/r/PESU/comments/1jfisam/any_channels_for_pests_going_abroad_for_ms/",
    "score": 23,
    "upvote_ratio": 1.0,
    "created_utc": 1742452705.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "join the main discord server \nthere in links channel you will find \"pesu study abroad\" server . it's pretty active server\n\n\nhttps://discord.gg/pesu-discord-742797665301168220\n└── thanks!",
    "interested\n└── Join the PESU Study Abroad Discord server. It's pretty active.\n    └── Could you please share the link\n        └── Follow the instructions in the other comment or DM me.",
    "There is a chat channel called discussion with alumni, maybe leverage that\n\nIf you want me to add another chat channel specifically for this, let me know\n└── would be nice to have a specific channel, idm using the alumni channel if you think that keeps things simpler\n    └── Done",
    "It's crazy people still want to go abroad\n└── Why not?\n    └── Job market. Immigration policies\n        ├── Even in India job market isn’t good, OP mentioned US where as of now it doesn’t seem that great but is still better compared to India. Even if OP doesnt find job there, he still has ample opportunities to explore research fields, as well as get industry exposure thru his uni. Main reason people chose to study abroad is not just for jobs, but the exposure.\n        └── Any sane person would chose abroad to avoid the cut-throat competition, and most of the times, it works out well for them. They get much superior exposure, industrial experience and determination. Most importantly they get to enjoy their lives alongside work, unlike in India, as soon as you start working, taxes, traffic, bad roads, politics, language problems, religion problems, chapris, gangsters what not.\n            └── Relax, reality is not like that. I am writing this from abroad and I know how it is.\n                └── Well.. then no argument.. should have made it clear in the beginning"
  ]
}