{
  "title": "Its like rubbing my face against a peice of sandpaper for 9 hours every day",
  "content": "Every day i wake up at 6 or 7 am and try to reach college by 8:45am, every day its a struggle to get out of bed\n\nevery day i worry about if traffic will make me miss the first hour, and every day i spend vast sums of money just tryna GET TO COLLEGE\n\nevery day i sit in class and try to figure out a way to pass the hours,\n\ni sit there and waste my youth away, minute by minute\n\nIts not that I don't like studying, its just that the topics they cover are always either: shit i already know OR shit that i couldn't even hope to comprehend\n\nand guess what? i HAVE TO BE THERE, the 75% attendance requirement means i cant just sit in the library and study the syllabus at my own pace, i HAVE TO be in the room and pretend to listen to my professor yapping about sum shi\n\ndont get me wrong, i dont blame my professors, its genuinely difficult to make 90 minute session engaging for everyone, and everybody inevitably learns at their own pace and it's impossible for a single person to cater to all 60 students at the same time\n\nand just when i thought that the week was getting repetitive, i look at the calendar, and its a FUCKING TUESDAY\n\nLITERALLY MOST OF THE WEEK IS STILL LEFT\n\nAND I EVEN HAVE A LAB SESSION LEFT+TOMORROW I HAVE SCRIPT REVIEW SO I CANT EVEN DIP EARLY\n\n3 more days until the weekend, 10 more weeks for the semester, and 2 more years until i get my degree, idk if ill make it to the end intact\n\ni need a hug but all my friends are so busy actually being productive and accomplishing something in life (im so proud of them) and im sitting here, doing absolutely nothing\n\nit feels like i just wake up every day to pay half of my life savings to some auto driver so he can take me to a giant piece of sandpaper that i can rub my face against for 6 hours\n\nevery. single. day.",
  "metadata": {
    "id": "1jjou5f",
    "author": "Anga205",
    "url": "https://www.reddit.com/r/PESU/comments/1jjou5f/its_like_rubbing_my_face_against_a_peice_of/",
    "permalink": "/r/PESU/comments/1jjou5f/its_like_rubbing_my_face_against_a_peice_of/",
    "score": 226,
    "upvote_ratio": 1.0,
    "created_utc": 1742923385.0,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false
  },
  "comments": [
    "I get more mood swings \nLike morning I will be in fresh mood\nBy afternoon I will be frustrated and then at night reading reddit and sleeping just to REPEAT THE CYCLE AGAIN 😭",
    "everyday I wake up then I start to break up\n└── lonely as a man without love\n    └── Everyday i start out then i cry my heart out\n        └── Lonely is a man without love\n            └── Every day I wake up, then I start to break up",
    "PES so wise they are giving you a first-hand experiennce of corporate life\n└── facts",
    "Everyone's stuck in the same cycle bruv 🫂",
    "You not alone bro",
    "Posts so hot 🥵",
    "Literally can’t wait to enter 4th year just to avoid these garbage classes",
    "fr tho they should lower the attendance requirement or make the classes nicer to attend ( The later is definitely not happening)",
    "😭😭😭",
    "Bruv my schedules even more hectic but I can understand where you are coming from",
    "Bro, this is the realest thing I’ve read all day. College really be feeling like a side quest with no rewards. But fr, you’re not alone—we’re all just surviving at this point. Every dark night has a lit morning waiting on the other side. Just gotta push through, and before you know it, we’ll be looking back at this like the bad PESU WiFi connection—annoying as hell but temporary. You got this, my guy!",
    "Very poetic dear same 2 same",
    "Reasonable crashout 😔🫂",
    "been there, dreaded all the classes till last day sitting at the last bench and then cracked the highest internship stipend from mech showing fuck off to them, have a greater purpose, use this to fuel your anger in what place are you in, what are you in that shitty campus and shitty college in the first place? Only you can help yourself.\n└── How much stipend do u get bruh\n    └── you can go on the 6/7th floor, Be Block and see it on the screen.",
    "Hey i want to take admission in PESu in MCA department so I want to know about the infrastructure and mainly concerned is placement",
    "skill issue, that's just how college works. Drop out instead of crying if it's so hard.\n└── the post is tagged vent bro what are you on about.."
  ]
}