{
  "title": "AT confirmation delayed or was I ripped off?",
  "content": "Context: Student from EC Campus. Bought the ticket 3-4 days ago.  \nThe issue is that I still haven't received confirmation of my ticket on my email. Now when I went &amp; bought the ticket, the person asked me to type my contact details into her phone's notes app. I assumed that she'd have to manually put my details into the system later but seriously? It's been almost a week now and I haven't gotten the confirmation yet.  Unfortunately, I don't have contacts of anyone who'd come to our campus for selling the tickets so I can't personally speak to anyone about it. If you guys could help me out, it'd be greatly appreciated.\n\nhttps://preview.redd.it/2ojlngjsxfre1.png?width=1084&amp;format=png&amp;auto=webp&amp;s=bb0f4a10d902be1f023b4c90faee58ff85b2a233\n\nAttaching proof of payment:  \n  \n",
  "metadata": {
    "id": "1jlwdsi",
    "author": "leoxplr",
    "url": "https://www.reddit.com/r/PESU/comments/1jlwdsi/at_confirmation_delayed_or_was_i_ripped_off/",
    "permalink": "/r/PESU/comments/1jlwdsi/at_confirmation_delayed_or_was_i_ripped_off/",
    "score": 24,
    "upvote_ratio": 0.91,
    "created_utc": 1743172173.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "Reach out to the AT team members on instagram",
    "Contact the AT heads asap.\nI asked around when they came and they told us it will come.\nThat day or the next day they posted a story smth about confirming our tickets with SRN or smth \n\nAnyway lmk if u get any new info\n└── Thanks. Do you have their contact info? I don't know who the heads are\n    └── It's on the website.",
    "Hey, AT org here, We have still not started sending the ticket confirmations for RR or EC, wait for a bit, we will get it sorted!",
    "What's the issue I am a vol",
    "As for anyone experiencing these issues please don’t worry. On the Day of AT there will be a tech team present to verify your payments. Keep the proof of payment in hand so you can show the tech team. Please note the above applies only in the case that you don’t get a mail in the next few days. - From a member of the AT team."
  ]
}