{
  "title": "Bro, How Are People So Smart??",
  "content": "I swear, I blinked and suddenly everyone around me has an internship, is working on some crazy side project, or has already secured a job offer. Meanwhile, I’m just trying to understand wtf was covered in today’s lecture.\nLike, are these people built different? Do they sleep? Do they have 48 hours in a day instead of 24?\nI try my best to study, but every time I check LinkedIn, someone has posted “Excited to announce…” and my self-esteem crumbles into dust.\nTo all the seniors,if I don’t have an internship by 6th sem, will I still have a chance at placements? Or do I just start mentally preparing for my backup career as an auto driver?",
  "metadata": {
    "id": "1jnw0vz",
    "author": "AuthorityBrain",
    "url": "https://www.reddit.com/r/PESU/comments/1jnw0vz/bro_how_are_people_so_smart/",
    "permalink": "/r/PESU/comments/1jnw0vz/bro_how_are_people_so_smart/",
    "score": 188,
    "upvote_ratio": 0.98,
    "created_utc": 1743398737.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "as 1st year dude, ye same how tf do people do so much (1st year peeps itself). there are people who are alr fsd or andriod devs or aiml researchers or have finished like 20 courses and 50 projs and have 9-9.5+ cg\n\nand ive seen it so much atp idc that much anymore lmao",
    "Stop comparing yourself to them. Sooner or later, they will also have a burnout. You do you , build your fundamentals better.\nSome of them have people who guide them, some of them did it themselves. You will have your time to prove also, so don't take it too hard.",
    "I'm an alum, and I started early. I studied from some of the best portals (MITOCW, Stanford Online) the courses that were taught in classes. Never had a certificate for it cause they were free. Most of my friends started with Coursera and Udemy filled their profiles with courses, projects (of the course) and I was blank. I actually then did some courses which I already knew the content of paid for them to get a certificate and add some projects. Didn't help much. \n\nInternship isn't hard to get if you want to learn and genuine efforts can be placed. Only problem is when you have 10 things going on and you can't dedicate time for any. \n\nI thankfully had a prof (senior most at the time) help me understand that I can't do it all, I have to choose one and finish. Easier said that when it appears everyone was doing 48 hrs of work a day.\n\nCan't really say it's easy to get over it, but try to narrow it down. Choose one field, and learn, apply , build around it. Sadly Bachlors used to be about exploring things but you have to now finish that exploration quick and get on specialization from 2/3rd Sem.\n\nFrom my position now, I have a few current students working under me and I can tell they are good but they don't have time. I'm guessing the same is the issue with you too.\nMy suggestion is to pick a stream and jump into it. Do courses, build projects, apply internship and keep going into one project. But don't target a output focus on being the best f-ing engineers in your subject and you'll end up learning , enjoying and in good time even earning based on that.",
    "Everybody has a different path. You're going to be in this profession for the next 40 years of your life, so don't make it about competition. Explore, find something you like, and have fun while learning. Best believe, the crackness shall follow.",
    "its ok , you are never too late. You must start internships now if you intend to",
    "I wouldnt worry about it. As far as ive seem a lot of people get summer internships through parents' or friends' parents' connections. If you can do the same, then do it. \n\nOtherwise, Its fine if you dont do a summer internship. What you need is just something to put in your resume and to talk about in your interviews (getting to that point means good grades and good OA results, but Im assuming you are already preparing those), that can be an internship if you did it, or a particularly good project you did either personal or for college. \n\n Also theres a reason our college start the Capstone so early. Its so you have the chance to explain it in detail for interviews. You dont need side projects if you put your best effort in the Capstone and other college project. My own resume is only filled with college projects atm.\n\nWhats important is the way you can present and how you speak about your experience.  Work on that if you arent confident. Prepare beforehand what you would say if asked specific questions in an interview. And dont ask ChatGPT, since its answers are usually to broad and common. Pick up and talk about specific details that would make your project or internship speech unique.\n\n  \nDont worry too much, everyone goes at their own pace.",
    "i felt the same...its not mandatory u get a summer internship\\[",
    "Uninstall LinkedIn.\nFocus on yourself.\nYou don't have to prove anything to anyone, you gotta work for yourself remember that."
  ]
}