{
  "title": "Rude volunteers at Aatmatrisha",
  "content": "I dont want to be like this on a fun day but I had to rant.\nI just got screamed at by two volunteers for not dressing according to a dress code they never mentioned specifically.\nI checked the guidelines post for AT and I was actually following it. We showed them the post and they had no answer. They kept say we were told this by so and so person but never showed us where it was announced.\nThis happened at an in-house event. \nThey didn't want me to 'roam around campus in my inappropriate clothes' (it was flared jeans+top that is not sleeveless and it covered everything also I was wearing three layers).\n I told them my friend is bringing me a jacket she's not here yet and I'll wear a jacket then. They didn't agree and wanted me to wait with them until I wear a jacket.\n I don't know why they behaved that way my day is ruined. My professors are more chill with dresses that are worse .\nI just hope it never happens again.No one deserves to get screamed at so rudely by a stranger. \nThe volunteers need to be taught how to speak politely with strangers.\nThe orgs there were literally wondering why I'm even getting dresscoded.\nI am thankful to the orgs that helped me out in the end.\nThere were people in crop tops and sheer tops they were allowed without any question.\nSorry for the rant and thankyou for reading. ",
  "metadata": {
    "id": "1jryybt",
    "author": "Turbulent-Spinach360",
    "url": "https://www.reddit.com/r/PESU/comments/1jryybt/rude_volunteers_at_aatmatrisha/",
    "permalink": "/r/PESU/comments/1jryybt/rude_volunteers_at_aatmatrisha/",
    "score": 202,
    "upvote_ratio": 0.99,
    "created_utc": 1743842145.0,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false
  },
  "comments": [
    "Yeah volunteers were rude to us too some of them just don't listen!  Thay just kept yelling at us to GET OUT OF THE CAMPUS, we had to attend that AMD PC building event which was at 12 and somehow most of the volunteers didn't know this and kept blocking us every few steps and acted as if we did something wrong\n└── Basically the \"heads\" of the AT committee shout on these people, and they inturn shout on the participants",
    "They are just low life people man, this is the only thing they are good at. Have nothing else in life to look forward to.\n\nI couldn't even go to Library today, even when there were people inside.\n├── Deym I dodged a bullet today then, I planned to come to library too\n└── They wouldn't let me in too, I specifically mentioned that my friends are there in library and they kept saying that WE ARE GOING TO CLOSE LIBRARY TOO and they'll also leave the campus",
    "Absolutely true, I just saw two volunteers screaming at a girl for not standing properly in the VIP girl line. That student looked so upset and disappointed, she turned away. And after that, they were still trashing about how that girl doesn't have common sense blah blah between each other. Plus they started telling our of nowhere that no makeup is allowed. This includes lip balms as well so they started confiscaring it. So disappointed by the volunteers this year.\n\nAlso I'm in the comedy night right now and it's a mess. The show has been delayed by 1 AND A HALF HOUR. And the host comes in saying that the artist is still on his way. This is really unacceptable behaviour by the management team. \n\nSo sorry to hear that from you though, even my friends got dresscoded several times yesterday for not even wearing something that bad, just sleevless blouse. This is such a disappointing behaviour from not just the volunteers but also the management team.\n├── Yeah they confiscated my lip balm too, I genuinely didn't understand the need to do that?? The organisation was just so shit\n│   └── This happens every year lmao\n└── When waiting for the artist to arrive they weren't even letting people go out to the restroom or even to drink water lol, idk what to say",
    "Aatmahatya\\*\n└── ![gif](giphy|u07Eq016TuYAFpmpfp)",
    "So it's the entitlement every year then.. last concert they made the same issue for a friend of mine , while literally one of them didn't follow shit and they let them in and also their friends in \"not appropriate\" clothes by bringing them jackets until they cleared the gate..",
    "I too organised a national level fest but i have not been this rude to anyone",
    "Same experience I had yesterday for ethnic day one volunteer randomly stops me and says this isn’t appropriate what you r wearing it’s violating Clg dress code I was like tf bro it’s not even deep neck she literally made me cover with my Pallu where as I literally see ppl wearing fckng tube tops , strap sleeves, off shoulders all over the Clg.\n├── Ikrrr same one of them just came up randomly to me to tell how i was violating the code like that bish was hunting me down for the whole week ,she came to me multiple times this week to tell me that i was giving stripper  .yest she even threatened that she will have to escort me out like wtff. Like gurl you are literally wearing the same strap sleeves as me. Like these people are hypocrites on to the next level\n│   └── They themselves were high man on the Dj night and they come and say us about violating the rules 🤡\n└── Exactly they were just picking on some people while letting others be",
    "The Volunteers were extremely rude, no manners whatsoever, people are here to have a good time and they keep screaming at our faces? for like no reason, we were kicked out of college almost 2.5 hours before letting us back in thru the lines which they couldn't manage at all. We were being screamed at while leaving from AT in house events..being screamed at while entering back ...no resources for water or food while entering totally being irresponsible of having the thought that people are coming from such distances to attend this fest of yours, atleast atleast water bottles?? the genius volunteers picking up the ones fainted in the line while entering comedy nite and making them sit back in the sun only wow. What's the point of kicking out people at 11am from the college when you let everyone in back at 1:30pm, where they said gates would open at 12pm for entering. 1.5 HOURS OF STANDING IN THE SUN IN THIS SEASON W NO WATER. I think yall volunteers need to stfu and consider before you yell at someone who's there to have a good time trying to figure out things in the college which yall dont really know how to mention or spread awareness about, what was that dresscode issue??? w absolute no sense, no justification, just the 'yelling' here as well, where the volunteers have no answers to ab where \"they mentioned it before\", they did it to boys as well. I have been to much much bigger fests controlled by much bigger event handlers, going by the logic, they should have a 1000x the ego yall had today, but it isnt the case, they treat everyone politely/kindly because WE ALL PAID FOR A GOOD TIME. Moving on to the blunder of comedy nite, i dont even know what to tell, starting off w what every vip for comedy nite people know, the genius seating arrangement where they allowed people who came late to sit near the stage and the ones who were here hours ago to go rot in the corner in the dark, and the beautiful sound system on the first floor, just wow. It was just embarrassing for a standup comedian to come and see that his voice doesnt reach the first floor. Management team have no idea whats going on, kicking people off the campus at 11am, opening gates at 1:30pm (w no water provided and js standing under sun w no movement for hours), comedy nite delayed by 1.5 hours, cant see anything going right. Extremely disgusting handling of the crowd today. Super disappointed in the volunteers this fest, only thing yall were good at was making people upset. But im glad the people still made sm out of it, even tho after all this bs, i love how kullu brought a smile to everyones faces,killed it. Mohit Chauhan performing a legendary set to make a memorable night for rest of our lives, saw people laugh, sing and dance, so so wholesome. Advice to volunteers, go get yourselves humbled. sorry for the rant, needed to be out there, thank you for reading &lt; 3\n└── I agree the only good thing about the fests were friends and artists everything else was an absolute mess",
    "Was with her when this happened, they lacked basic amount of respect while talking to us. Continuously screaming in our faces, acting like they own the place. We tried to tell them we're leaving campus to get a change of clothes, they had a problem with that too, 'If you get dress coded by faculty WE'LL GET SCREWED'. They weren't even letting her leave the venue of the in-house event because of this reason.\nWe finally somehow did managed to get out of there, but seriously man ruined our mood.",
    "Honestly the timelines and schedules were soooo messed up this time…How was the wait time so bad for every single event? The inhouse events timings were not clear and neither were we informed in prior about the locations and timings of each. A lot of my friends were not even in the whatsapp groups meant to be for informing the participants and refunds aint possible as well. To top all of this, the lines. The long wait. A shit show the organisation behind culnite was. Loved all the sets ngl but the vols and organisation pissed me off. Were the vols even given basic training regarding etiquette? Constant screaming and unnecessary attitude just made the whole experience worse. Worst ever organisation to this day lowkey.",
    "the irony ... because i saw some of the volunteers and core members wear stuff that was against the dress code during the dress up days.",
    "Don't be shy, tell us who the vols were and we'll make sure they don't get to be a part of AT'26",
    "Dude the lines to let us into concert ground was so horribly managed. They didn’t let general (concert-only) move until the vips and comedy nite people were let into the ground. No lines were maintained at all. The entirety of the road(?) in front of dcb bank was FILLED with people. We stood there without movement for an HOUR. Everytime they let some people from the general line (can’t even call it that because it was just a huge herd of people) go, everyone would start running because obviously no one wants to be stuck in a crowd with no space and barely any air to breathe. And when we finally got to the road infront of the football field, they started yelling at us to move and form lines because mohit chauhan scar was coming. Move WHERE?! There was no space at all. I have no idea how someone could be THIS incompetent. And all the orgs and core team are posting on their insta stories, patting themselves on the back and calling themselves goats. My brother in Christ you almost started a stampede.",
    "If I got screamed on recklessly like that, I would've crashed out and broken something no cap"
  ]
}