{
  "title": "Almost saw a guy get harrassed at AT yesterday",
  "content": "So I was minding my own business near the Baskin Robins stall trying to get ice cream through all the crowd.\n\nThat's when I saw this senior girl walk upto this random guy in like this loose white shirt and beige pants(I dunno his name but ik he's in my batch only), and they started chatting.\n\nThe guy was clearly not into it and was shuffling around looking for an excuse to cut off the conversation and leave. I saw him consistently take a step back, only for the girl to close the distance again and again, not getting the hint.\n\nI wanted to interfere, but I still wanted ice cream so I ignored that and focused on the task at hand. I looked back again after a few minutes and saw the guy walk away with his friends and the girl walking back to a larger group of girls.\n\nAnd the ice cream was meh tbh.",
  "metadata": {
    "id": "1jsvdvn",
    "author": "ExtremeGaming18",
    "url": "https://www.reddit.com/r/PESU/comments/1jsvdvn/almost_saw_a_guy_get_harrassed_at_at_yesterday/",
    "permalink": "/r/PESU/comments/1jsvdvn/almost_saw_a_guy_get_harrassed_at_at_yesterday/",
    "score": 117,
    "upvote_ratio": 0.94,
    "created_utc": 1743949776.0,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false
  },
  "comments": [
    "Waiting for Javahar's POV\n└── He was also getting ice cream with me",
    "Nigga study for your ISA tomorrow\n└── 😭😭😭😭 Im doing that only",
    "This is true. I was the ice cream man.\n└── This is true. I was the stall.\n    └── This is true. I was the ice cream.\n        └── This true I was the spoon\n            └── this is true i was that gandhi statue",
    "Bc JEENEETards lite banadiya sub ko 😭",
    "Disgusting. Pls tell us more about this girl so I can avoid her when I see her.",
    "which flavour ice cream bhai?\n├── Nutty flavour\n└── Mint green",
    "Its true. I was the tree behind the guy and The girls purse too (vegan leather)",
    "Why am I getting deja vu reading this"
  ]
}