{
  "title": "AT'25 : The pro night, a stage now draped in gray, Its memory stings, \"Don't ever join that disarray.\"",
  "content": "I don't understand how hundreds of volunteers who were screaming for no reason suddenly vanished when the queues for general line got out of control especially behind b block near the atm we payed 950 for both concert night and comedy night to witness a grand total of two performances.Pathetic management.How could a event take place without the people who paid for the event.\n\nOrganization wise was one of the worst, missed performances, incredibly long wait times, chaotic lines this one had it all.\nI was part of AT team last year. I feel the juniors core team's coordination was the worst I seen in my life.\n",
  "metadata": {
    "id": "1jtmce2",
    "author": "[deleted]",
    "url": "https://www.reddit.com/r/PESU/comments/1jtmce2/at25_the_pro_night_a_stage_now_draped_in_gray_its/",
    "permalink": "/r/PESU/comments/1jtmce2/at25_the_pro_night_a_stage_now_draped_in_gray_its/",
    "score": 81,
    "upvote_ratio": 1.0,
    "created_utc": 1744035490.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "AT committe is pathetic as always , can't do their actual jobs but they'll stroke their ego boners and keep screaming thinking they're doing a wonderful job.\nI think it's like some requirement to be retarded to join the AT committe. Mfs on a power trip for no reason , they were asking people to leave the campus even though some were there for a completely different event and didn't want to join their pathetic excuse of an AT fest. Like man ,  it ain't that deep 🙏",
    "Surprisingly, it's always the area behind B Block where things go wrong. This was definitely the worst management I've seen across all the events so far.\n\nThere was almost zero coordination, and it was incredibly unfair to the people who bought tickets for the comedy show.\n\nTo the volunteers at the back gate: Bro, what were you even yelling at us for? You were the ones at fault, at least own up to it, stay calm, and stop acting like you were doing us some huge favor. If you couldn't handle volunteering properly, the least you could do is not pretend you were doing a great job.\n\nAT'23 was definitely the only AT I've genuinely enjoyed so far it was really well planned. AT'24 was decent too;"
  ]
}