{
  "title": "New auction center @PES",
  "content": "Today I witnessed pure stupidity at our dear campus Mart like straight up the lady at the counter was debating with a girl and asked the girl to pay up Rs40 for something that was clearly priced 20 like broooo that’s straight up daylight robbery. Like, MRP means MAXIMUM retail price, not “Made-up Random Price” just ‘cause she feels like it. The audacity to tell someone the printed MRP is wrong and ask double?? DOUBLE??? Is she running Campus Mart or an auction center.\n\n\n\nHonestly, someone needs to tell her this isn’t a black market stall in the middle of nowhere—this is a COLLEGE CAMPUS. Students are broke, stressed, and running on caffeine and trauma—last thing we need is someone extorting us for a Frooti.\n\n\n\nLike damn, “Swalpa common sense illva ???” You can’t just slap random prices like it's a damn auction. What next? “This Maggi is vintage, so it’s 150 now”?",
  "metadata": {
    "id": "1jtnrgk",
    "author": "Minute-Session-5022",
    "url": "https://www.reddit.com/r/PESU/comments/1jtnrgk/new_auction_center_pes/",
    "permalink": "/r/PESU/comments/1jtnrgk/new_auction_center_pes/",
    "score": 109,
    "upvote_ratio": 0.99,
    "created_utc": 1744039048.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "Avoid campus mart at all costs. Those guys quote random prices even for a freaking printout lol \n\nI always take printouts from the shops in Sutta Gully and other refreshments from the other stalls in front of BE block.\n\n  \nIt always seems like they don't wanna do any work lol with that bad attitude and bored face lol",
    "Bro my friends and I once had to pay 190rs for like 9 pages of colour print cause apparently \n1) the print was too black\n2) the printer printed extra copies ( we asked for one copy each) \n\nShe basically bullied us and other students who took a print that day into paying extra cause her printer malfunctioned.\n\nWord of advice to anyone going there, don't interact with her at all. There is usually an old uncle who sells at MRP and is generally way more sweet and chill than her.",
    "bro so many times while printing she charges extra, now i don't go anymore to the great \"campus mart\"",
    "Which shop is this ? Is it the campus mart opp to be block??\n└── yup that's the one. She has been doing this for so long its actually sad no one else has complained",
    "For printouts on campus go to central library cheap and best",
    "What did that girl brought?"
  ]
}