{
  "title": "placements prep",
  "content": "im a 4th sem aiml student with a gpa close to 8.5,since the placement sheet hasnt been updated recently i wanna know if that gpa makes me eligible to sit for most t1 companies,also have been working on a lot of dsa and leetcode recently,should i prioritise working more on leetcode or focus on a better gpa in my next sem?",
  "metadata": {
    "id": "1juexqf",
    "author": "Which-Potential-5457",
    "url": "https://www.reddit.com/r/PESU/comments/1juexqf/placements_prep/",
    "permalink": "/r/PESU/comments/1juexqf/placements_prep/",
    "score": 23,
    "upvote_ratio": 0.96,
    "created_utc": 1744122571.0,
    "flair": "Placements 🤑",
    "nsfw": false
  },
  "comments": [
    "Jayashree mam, the HoD of AIML was planning some placement prep thing, last year right? is it still going on? what happened to that?",
    "same question,also why are the placement sheets not updated?\n└── the placement stats are maintained by the seniors so when they get placed they stop updating (which is understandable)\n    └── Also adding that this is a fully manual task. PES doesn't release details so the only way they can update the sheet is by reaching out to people, checking emails and finding out details to enter one by one. Add in the factor that this is a thankless job where nobody except a few knows who maintains the sheet. So when people start demanding frequent updates and there isn't any incentive to continue working on it, it quickly gets outdated\n        └── I was trying on an automation script using Google App scripts to atleast try to get basic details from the mail itself but again its a tedious task, tbh, bcoz of the way the mails vary for each company",
    "I think the best thing would be to work on both, I’d say consistently start solving Leetcode probs if you haven’t started already, along with regular contests, gpa wise 8.5 puts you in a decent spot for t1, so if you get really good at problem solving with that gpa you can bag a good offer.\n\nSpeaking numbers wise this year(2025 batch) 8.5 would put you eligible for around 85% of t1 companies in given that you’re a cse student , but that might change depending on your branch/market scene/no of students in branches, however the best thing would be a 9 or slightly above that would make you eligible for almost all t1(99%) , 8.7+ is a great spot to be too as I’ve seen a lot of shortlists cutoff at those. \n\nOverall 8.5 is not bad and puts you in a good place if your problems solving skills are solid, but bumping it up will definitely open more opportunities and increase your chances of bagging a t1 offer. \n\nAlso for placements you’ll have to be thorough with CS fundamentals including operating systems, computer networking, dbms and have a proper resume with projects which you understand properly. \n\nHowever DSA skills and gpa still remain the most critical factors for on campus placements. \n\nStill in 4th Sem so you’ve got plenty of time to level up💪\n\nAll the best!\n└── Can I dm u ?"
  ]
}