{
  "title": "Dead Tech Clubs Alternative",
  "content": "I'm sure most of are in atleast one club which is practically dead. There were recruitments for a club in Sem 1 and we were promised that we'd get an intro to the club, how events are held and so and so forth after the seniors were done with their ISAs (this was last semester) and to put it shortly, that never happened. What's the point of going through all the efforts to recruit members by holding interviews if you're not going to do anything about it?\n\nIs there not a group or community that is active? I know some clubs are active but I think recruitments will only start Sem 3? I'm aware some clubs recruit in even sems also so please let me know if there are any active ones.\n\nI'm not necessarily looking for a club? I guess I just want to be part of a tech community with ambitious students. ",
  "metadata": {
    "id": "1jui3bi",
    "author": "leoxplr",
    "url": "https://www.reddit.com/r/PESU/comments/1jui3bi/dead_tech_clubs_alternative/",
    "permalink": "/r/PESU/comments/1jui3bi/dead_tech_clubs_alternative/",
    "score": 23,
    "upvote_ratio": 1.0,
    "created_utc": 1744130432.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "PIL\n├── Thanks. Just joined the WA group. It's admins only though?\n│   └── how'd you join the whatsapp group?\n│       └── look up PIL PES and you should find the invite on their website\n└── what's that?\n    └── Pes innovation labs",
    "Take up initiative to do something in the club...\nAfter all, it's a student run club, and waiting for someone else to tell you what to do is pretty much useless.\nAnd if the club isn't very enthusiastic about it or discourage you for no valid reason, you can choose to leave the club.",
    "Joined tech talks group?\n└── Yes. there's a lot of promotion on that group nowadays though\n    └── fair, true.\n\nBut what kind of tech are u particularly interested in?\n        └── If I had to choose a niche, I'd say I'm into AI, ML. But as long as the group is active and it's talking primarily about tech, I wouldn't have a problem with it. I just want to be exposed to new tech so I have something extra to meddle with apart from uni"
  ]
}