{
  "title": "The AT Experience",
  "content": "Last year, I bought VIP tickets for Shaan’s concert, and it was actually worth it , limited spots, breathing room, and a real good experience. So naturally, when Mohit Chauhan’s concert rolled around, I thought, *\"Sure, let’s do VIP again\"*\n\nAt first, the VIP tickets weren’t even that much more expensive than General. Smart, right? More people would opt for VIP, ensuring a better crowd. But then , they decided VIP wasn’t exclusive enough. So what did they do?\n\n\"Phase 1, Phase 2, Phase 3\" VIP tickets.\n\nOh yes, they kept selling more VIP tickets at increasing prices, turning what was supposed to be a good experience into a sardine-can situation. \n\nBy the time the concert started, the \"VIP zone\" was so packed that I couldn’t even raise my hand without elbowing someone.\n\nSo let me get this straight: You oversold VIP tickets to make extra cash. You didn’t control the crowd, making the \"exclusive\" zone feel like a Black Friday sale.\n\nLast year, VIP tickets were ACTUALLY LIMITED. Once sold out, they were sold out. This time? Nah, let’s just print more tickets and pretend we didn’t ruin the experience.\n\nOh, but here’s the best part , while we were struggling to get in, the backgate was wide open for:\n\nFriends of volunteers\n\nClub members’ buddies\n\nRandom people who knew a guy who knew a guy\n\nI personally know people who wanted to come but couldn’t because tickets \"weren't available\".  Meanwhile, half the crowd was just connections flexing their \"I know the organizers\" privilege.\n\nDo I have a problem with people getting favors? No.  \nDo I have a problem with HYPOCRISY? ABSOLUTELY.\n\nIf you’re gonna allow outsiders, then OPEN IT TO EVERYONE. And you guys could have made much more money like that .Otherwise, stop pretending this was about money and admit it was just a power trip for the insiders who got to play \"Don’t worry, I’ll sort it for you.\" A good friend ? Sorry in this situation maybe just boosting .\n\nOh, let’s talk about the real stars of the show , the **volunteers** who suddenly morphed into mini dictators \n\n\\* Randomly yelling at people? Check.\n\n\\*  Acting like they’re guarding the gates of heaven? Check.\n\n\\* All this for a *college fest*? Hilarious.\n\nI get it—you’ve got a job to do. But yelling at people for breathing wrong doesn’t make you cool; it makes you look like you’ve never held an ounce of power before. And guess what? You ruined the vibe for no reason.\n\nThe best part? The decorum vanished the second their friends showed up.\n\ni. Random attendee tries to cut the line? \"No, back of the line!\"\n\nii. Their buddy waves at them? \"Oh hey! Come right in!\"\n\niii. Not just one group each volunteers sometimes two friend groups\n\nI saw it happen. More than once. And the funniest part? They weren’t even subtle.\n\nAnd also Watching people beg volunteers to help them cut the line was peak cringe. \"Can you get this person here \" \"Can i just go talk to someone\"\n\nLet’s be real , I know people too. Half the crowd probably did. But some of us chose to wait like normal humans because:\n\nIt’s not that deep , The \"advantage\" was laughable. Oh wow, you’re 10 minutes earlier into a sweaty, packed zone?  I didn't want to humiliate myself for this.\n\nAnd i feel its not their fault , at least most of it is not , the volunteers should have been stricter and pretty fair like dude you got ONE JOB , do it properly , if you go flaunt your power obviously they will take the bait\n\nOh, let’s not forget how the General ticket holders were treated , we got in and the VIP was filled and they hadn't let general in yet , Organizers: **If you sell a ticket, you deliver an experience.** Not \"stand around for an hour wondering if you’ll ever get in.\"\n\nBut why do you care ? You were let in !!\n\nYeah, I was. And guess what? I have eyes. Seeing a sea of people stuck outside ,*after paying* was plain sad.\n\nThis isn’t about me ,it’s about **basic competence**. If you’re gonna host an event(which you signed up for):  \nPlan crowd flow.  \nStagger entry if needed.  \nDon’t punish attendees for your bad math.\n\nBut no. Instead : \"Let’s pat ourselves on the back like we didn’t fail at the ONE JOB we had!\" and go around labelling yourself as the \"best team\" or \"how much work we did\"\n\n\"But events are hard!\" Sure. But this wasn’t a small hiccup *,* this was avoidable chaos and very much avoidable if i may stress on it.\n\nSome of you who read this might think why this rant , like why care so much ? Take it as a feedback , that's allowed right .This isn’t nitpicking  , it’s basic accountability. And also the fact that people can see and are very much aware about your actions. People **noticed**.\n\nIf you host an event, own the mistakes instead of acting like attendees are just \"haters.\"\n\n\"We already did so much!!\"  Yes and so did we , we paid , we showed up , we expected what you advertised .\n\nIf your defense is \"cut us some slack,\" then maybe cut the ticket prices next time too.\n\nThis Isn’t Hate , It’s a Wake-Up Call\n\nWant applause? Earn it. Plan better. Train volunteers better. Respect all ticket holders, not just the \"connected\" ones.\n\nOr keep pretending it’s petty\n\n(Also giving credit when its due , The stage setup was legit cool ,  LED screens? Confetti? A+ for visuals.  Concert actually started EARLY?! Shocking. Miraculous. *We appreciate it.* And Moihit was great)",
  "metadata": {
    "id": "1jve3pz",
    "author": "Temporary_Load_7877",
    "url": "https://www.reddit.com/r/PESU/comments/1jve3pz/the_at_experience/",
    "permalink": "/r/PESU/comments/1jve3pz/the_at_experience/",
    "score": 164,
    "upvote_ratio": 0.98,
    "created_utc": 1744225985.0,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false
  },
  "comments": [
    "100% agree with you. I had also purchased a VIP ticket, and my friend and I had to move towards the edge of the VIP section just to get some breathing space — it was that overcrowded. Definitely not what you expect when you pay extra for a \"premium\" experience.\n\nThe management before even entering the arena was just as disappointing. We were asked to arrive at a specific time, only to be left standing in the sun for over an hour with barely any communication. Volunteers were way too aggressive without actually helping the situation — it felt more like they were trying to show authority than manage the crowd properly.\n\nAnd the fact that they were selling ₹10 water bottles for ₹20 just summed up the attitude — treating attendees more like easy targets than guests. It’s not about the extra ₹10, it’s about how little respect they had for the people who showed up and trusted them to deliver a good experience.\n\nHonestly, the whole thing just felt poorly planned and badly handled. It's a shame because events like these could be so much better with just a little more accountability and basic crowd management.\n\nNot trying to hate — just honest feedback. People notice these things, and if the goal is to build a better experience year after year, it starts with respecting the attendees first.",
    "The volunteers were so annoying🤡🤡",
    "100% true",
    "Believe me these guys are fkin clowns 🤡🤡🤡 only one word to say for all volunteers - fucking clown ass 🤡🤡"
  ]
}