{
  "title": "Will PES delete my .edu mail id after i graduate??",
  "content": "graduating in a year so...",
  "metadata": {
    "id": "1jxkxv0",
    "author": "This-Action-9362",
    "url": "https://www.reddit.com/r/PESU/comments/1jxkxv0/will_pes_delete_my_edu_mail_id_after_i_graduate/",
    "permalink": "/r/PESU/comments/1jxkxv0/will_pes_delete_my_edu_mail_id_after_i_graduate/",
    "score": 22,
    "upvote_ratio": 0.96,
    "created_utc": 1744474608.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "For sure.\n├── they are yet to deactivate mine and I graduated in 2023. I still use it for student discounts\n└── That's just sad man\n    └── Just stop using pesu mail everywhere that's all I can say.\n        └── i had some subscriptions on some apps they will get nuked",
    "I never even used PES mail id for anything important till now lol including the Google drive.\n└── me too lol",
    "Want that sweet sweet free Github pro, student discounts and Perplexity pro.\n├── lucky for yall, 2028 batch will never get a .edu mail\n│   ├── Batches until '2023 batch did not have one either lol. They started handing those out from COVID times.\n│   │   ├── We did have them in older batches (2019 and older). Maybe they stopped for a few years in the middle.\n│   │   └── oh didnt know, but wonder why they just decided to suddenly stop, now we cant even avail any student discounts or free student software :(, that too after paying \\~5lakhs\n│   │       └── Although I agree with you, let me play devil's advocate: It costs a lot of money to offer student email accounts to everyone, especially if you're offering a lot of storage with it. This is a recurring cost for them every year, and since the number of students joining every year increases, it's a constantly almost exponentially increasing cost. Beyond a point, it becomes too much to handle. \n\nUnis will need to draw the line at some compromise. At my uni, we get 20 GB of storage on our uni email address. But it's lifetime access. So we get much less storage but it's always with us. The other compromise would've been to increase storage but have an expiry date. \n\nSo yes while I agree that PES should give students email addresses, they also need to find a way to handle the costs for it.\n│   │           ├── I mean the get @pes.edu for almost no cost when they purchase domain. All they have to do is restric larger files than 27MB like GMail 💀.\n│   │           ├── I know this is an old post but i gotta say this.\n\n\nSee this kinda wierds me out. I mean they are giving us a .onmicrsoft.com email. But like i know for a fact that in the admin panel of even the most basic acedmic (institution wide) subscription package(in office suite)...theres an option to add a domain other than the one that microsoft gives you as like a default setting up thing. I dont see why pes doesnt just create another subdomain cuz as far as i know, it costs them nothing extra.\n│   │           └── fair, didnt consider the crazy expenses, but quite a few private colleges in bengaluru provide students with .edu, skimping on students' education is pretty harsh after they also take in a lot of pessat and management students\n\nbut on the other hand, we get the opportunity to earn scholarships, so i guess that makes it even\n│   │               └── Yeah, the money is after all not unlimited. If you provide scholarships, something else has to go under the axe. And given that scholarships might provide more benefits especially to students who need financial help, it was an easy decision to make. Most students don't use their provided email accounts except for signing up on different platforms for free benefits. Many of these platforms (I agree not all) also allow you to verify using other methods so it should still be doable.\n│   ├── Tough luck.\n│   │   └── thanks, appreciate the insight\n│   └── wdym? I'm availing student discount on Spotify\n├── caught gone\n└── How? I'm logged into perplexity with my email but I still use the normal perplexity.\n    └── Student emails will get you Perplexity pro for a month.\n        └── I'm logged in with my edu email, doesn't seem like I got it. Maybe they stopped it?\n            └── nah dude it's still there. I can even give you my referral [link](https://www.perplexity.ai/referrals/ELQMHT6X)",
    "lucky for yall, 2028 batch will never get a .edu mail\n├── lucky till you forget your login credentials at the time of submission and you can't just do forgot password.\n└── Why not\n    └── no clue, they didnt tell us anything after that, the teachers (in first year) also dont quite know\n        └── Did they explicitly tell you that u won't get it, or u just haven't received it yet?\n            └── explicitly",
    "Ofcourse",
    "Yes",
    "the outlook or gmail bcoz i still have access to my gmail .edu account",
    "WHAT? All my life's work is in the GitHub account linked to my .edu account. Should i move them all?",
    "Yes for sure",
    "obviously, why wouldn't they?",
    "yes",
    "Nope buddy I’m a 2024 graduate and we done i still use it for all my spam apps/trash things that i use\n└── interesting"
  ]
}