{
  "title": "Total fees of 4 years through jee mains",
  "content": "I am planning to join pesu through jee mains so wanted to know about total fees for 4 years in college including everything, like what's the average cost of whole 4 years for jee student  \nI checked on their website they have only mentioned 5LPA that's most prolly the academic one ig  \nexcept that there is hostel fees and mess fees and is there anything else?  \n",
  "metadata": {
    "id": "1jy201r",
    "author": "JobWorking",
    "url": "https://www.reddit.com/r/PESU/comments/1jy201r/total_fees_of_4_years_through_jee_mains/",
    "permalink": "/r/PESU/comments/1jy201r/total_fees_of_4_years_through_jee_mains/",
    "score": 19,
    "upvote_ratio": 0.96,
    "created_utc": 1744528415.0,
    "flair": "PESSAT/Admission",
    "nsfw": false
  },
  "comments": [
    "26 lakhs including hostel coz the hostel fee + mess fee is around 1.5lpa\n└── 26 is crazy bro ,Is it worthit?\n    └── Lol not at all, pes is only worth it thru cet which costs 4.8l totally for four years\n        ├── Wai 4.8 isn't fees like 1.5 per year (I am gonna join not sure yet I just saw a yr old circular here)\n        │   └── Not 1.5l 1.2l it is thru cet\n        │       ├── Damn nice ty for the info g\n        │       └── Also 1 more doubt \n\nHow much is the hostel fees\n        └── Ok ok and the people with good KCET rank will be the  one getting 9+ CGPA and good offers majority of the time I assume?\n            ├── PCM solving abilities don't translate to GPA. You'll find many who struggle to score a high GPA even after scoring well in CET. Usually, it's the people who work hard + are actually interested in their course who score that well, with the latter being the primary reason.\n            │   └── Yeah, interest is the major point.\n            └── No even pessat people do good. Also by that logic jee mains kids will do even better because their cutoffs are like 98%tile +\n                └── RIP PESSAT 2025",
    "Around 20 lakhs +, which I think is a lot for an engineering college.\n└── See VIT sir",
    "5 lakhs for CSE + miscellaneous + hostel fee"
  ]
}