{
  "title": "Internship credits after 2nd year",
  "content": "Basically the title, I've recently heard from my batchmates that they're gonna give some credits in doing internship after 2nd year or taking some special topic course in college in summer term. How are they gonna give credits to people who don't land at any internship and doesn't take any summer courses. \nAlso, if I get an unpaid internship will they consider it to give credit? ",
  "metadata": {
    "id": "1k2tmet",
    "author": "wtfabcd1234",
    "url": "https://www.reddit.com/r/PESU/comments/1k2tmet/internship_credits_after_2nd_year/",
    "permalink": "/r/PESU/comments/1k2tmet/internship_credits_after_2nd_year/",
    "score": 22,
    "upvote_ratio": 1.0,
    "created_utc": 1745060093.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "They give credits after your entire project from the internship is graded. Internship after 2nd year is not compulsary but you have to do an internship during 8th sem. Usually they don't consider unpaid internship from outside.\n├── What's the minimum amount you need to be paid to get credits if you're doing an internship from outside?\n│   └── 5000 per month\n└── Okay gotcha! Thanks though",
    "checkout [this](https://www.reddit.com/r/PESU/comments/1k24r5i/comment/mnslurx/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button) comment on how internship credits can be claimed.  \nppl who dont get an internship from any company will be allowed to apply for a research center at pes. you can work there and claim your credits as well.  \nwe can claim credits through unpaid internships, most of these unpaid internships are from govt entities like ISRO,DRDO,HAL etc. You need to collect an NOC from the placement co ordinator for your intenships if your doing in these govt entites.  \nIF your doing an unpaid internship in a compay(not a govt entity), Make sure to get it approved by the placement co ordinator by sending them your offer letter.\n└── Cam i dm you? I've some doubts regarding this.\n    └── yes sure"
  ]
}