{
  "title": "T1 offers",
  "content": "So if someone gets one T1 offer are they now ineligible to sit for any other T1 companies? Irrespective of whether they accept or reject?Also if an internship leads to a PPO will that be considered as an offer and won't be allowed further companies? \nHow does all of this work? Insights would be greatly appreciated!",
  "metadata": {
    "id": "1k47gb7",
    "author": "Khayali-Biryani",
    "url": "https://www.reddit.com/r/PESU/comments/1k47gb7/t1_offers/",
    "permalink": "/r/PESU/comments/1k47gb7/t1_offers/",
    "score": 15,
    "upvote_ratio": 0.95,
    "created_utc": 1745219435.0,
    "flair": "Placements 🤑",
    "nsfw": false
  },
  "comments": [
    "If you get a T1 offer, you're not allowed to sit for any other T1 offers, regardless of if you accept or reject. The last part about 'regardless of if you accept or reject' I'm not a 100% sure about. \n\nIf you get a T2 offer, you're eligible for T1 offers only\n\nSimilarly, if you get T3, you are eligible to participate in T1 and T2 offers. \n\nThere is another tier called 'dream tier' with companies like Apple, Google, Microsoft, etc. You're eligible to participate in these regardless of your current placement status, given you meet the company's eligibility criteria. \n\nPPOs are usually offered at the end of your summer internship, aka beginning of 7th semester. This is just weeks before placements start, and you'll be given about a week only to either accept or reject. So, you'll need to make a decision before placements start.\n├── do placements start at the beginning of 7th sem? i thought companies start coming from 5th sem,this is what i heard correct me if im wrong\n│   └── Placements usually start in 7th sem, 5th sem its usually companies looking for interns, while some companies may come in for early placements (like Jpmc did a month ago), it’s highly unlikely\n│       └── so 5th sem is for on campus summer internship and 7th sem onwards is on campus placements?\n│           └── Summer internship = summer between 3rd and 4th year, spring internship = 8th semester, placements = after 8th semester. \n\nCompanies visit to hire for any of these roles. If they're looking for summer interns, they visit in the 5th semester. If they are looking for spring and/or job hiring, they visit during placement season which begins at the end of July. \n\nGo through this subreddit, this has been asked multiple times over the years.\n└── what if someone gets a summer internship at a T1 company and a ppo from the same. are they eligible to sit for furthur t1 placements??"
  ]
}