{
  "title": "Here's what Grok thinks about PES ( its preety accurate answer considering its AI)",
  "content": "PES University in Bangalore has a mixed reputation based on available insights, with strengths and weaknesses that depend on what you’re looking for in a college. It’s known for solid placements, especially in Computer Science and Engineering (CSE), with nearly 100% placement rates for CSE students and median packages around INR 8 LPA for B.Tech in 2023, according to NIRF reports. Top companies like Cisco, Amazon, Deloitte, and Tech Mahindra recruit from the campus, and the highest packages can reach up to INR 46 LPA for certain courses. The university also has a strong alumni network and industry connections, which help with internships and job opportunities. For instance, students often get internships at places like NIMHANS or through university-arranged programs, though some report no stipends for these.\n\nAcademically, PES has a rigorous curriculum, especially for engineering, with experienced faculty, many holding PhDs, particularly in mechanical engineering. The university emphasizes practical learning, with modern labs, simulation facilities, and opportunities for research through its eight Centres of Excellence. It’s ranked highly, like #1 among private universities in Karnataka by KSURF 2019 and #42 among engineering colleges in India by NIRF. Students appreciate the focus on hands-on learning, hackathons, and extracurriculars like robotics, dance, and IEEE clubs, which foster skills beyond academics.\n\nHowever, there are notable drawbacks. The campus, particularly at the Banashankari location, is often described as small, crowded, and perpetually under construction, which some say is a tax-avoidance tactic. Infrastructure gets mixed reviews—classrooms are well-equipped with AC and LAN, but the campus lacks open spaces and greenery. The academic pressure is intense, with strict attendance policies and back-to-back exams, which some students find overwhelming, even linking it to mental health struggles. Fees are high (around INR 3.2–4 lakh per year for B.Tech/MBA), and while scholarships exist, they’re competitive, covering only 20% of students.\n\nEmployee reviews paint a less rosy picture of the work culture. Faculty often complain about low salaries, poor career growth (rated 2.8–2.9/5 on AmbitionBox), and a management that prioritizes revenue over welfare. Favoritism and excessive administrative workload are also issues, with job security rated moderately at 3.4/5. Work-life balance is a highlight, though, scoring 3.5–3.6/5.\n\nOn the flip side, PES has a vibrant student life with active clubs and events, and its Bangalore location is a plus for industry exposure. However, some argue it’s overhyped, with declining quality in non-CSE branches like electrical or pharma, where placements are weaker (e.g., 3–4 LPA for B.Pharma). Admission processes (via PESSAT, KCET, or JEE) are straightforward but can feel rushed or unclear, and the finance department has been called out for inefficiency.\n\nSentiment on platforms like Reddit and Quora is polarized. Some praise the placements and brand value, while others warn about high fees, strict rules, and a stressful environment, suggesting it’s only worth it for CSE or ECE. One Reddit user noted, “Join for CS. Ditch for everything else,” which sums up the sentiment for non-core .\n\nIn short, PES is a strong choice if you’re aiming for CSE, value placements, and can handle a high-pressure environment. But if you’re considering other branches, prioritizing campus life, or looking for affordability, you might want to weigh alternatives. It’s not perfect—management and infrastructure need work—but it delivers where it counts for many.",
  "metadata": {
    "id": "1kajgmi",
    "author": "Hope_ai",
    "url": "https://www.reddit.com/r/PESU/comments/1kajgmi/heres_what_grok_thinks_about_pes_its_preety/",
    "permalink": "/r/PESU/comments/1kajgmi/heres_what_grok_thinks_about_pes_its_preety/",
    "score": 76,
    "upvote_ratio": 0.93,
    "created_utc": 1745917485.0,
    "flair": "Meme :snoo_dealwithit:",
    "nsfw": false
  },
  "comments": [
    "&gt; PES has a vibrant student life\n\nMust have studied at the wrong PES then"
  ]
}