{
  "title": "Internship or Building skills?",
  "content": "Hi, I'm currently in my 4th sem- AIML and I'm not sure whether to do an internship at the college during the holidays or focus on practicing aptitude/DSA or even learn Java since I’ve heard that C and Python won’t be very helpful.. especially for interviews... I asked a couple of people about this and got a variety of answers. Some advised me to do internships outside the college rather than the ones offered within but I feel like I don’t have the skills to apply anywhere except for the ones in college. Others suggested that I should focus on improving my skills first. I'm just really confused and don’t know what to do...",
  "metadata": {
    "id": "1kehc38",
    "author": "Plastic-Hornet1318",
    "url": "https://www.reddit.com/r/PESU/comments/1kehc38/internship_or_building_skills/",
    "permalink": "/r/PESU/comments/1kehc38/internship_or_building_skills/",
    "score": 30,
    "upvote_ratio": 1.0,
    "created_utc": 1746356995.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "Hey! Just a small suggestion try doing an internship on campus. It’s a great way to get some real experience. There are some pretty cool research centers like ISFCR, IOT, CDSAML, CCBD, PIL, Cave Labs, etc., where you can apply.\n\nJust a heads-up don’t join Rapid, it’s kinda meh 💀\n\nInternships are usually around 6 weeks, so while you’re at it, maybe start brushing up on DSA or dive into full stack stuff (Next.js is a solid choice). You could also build some fun mini projects on the side.\n\nAnd trust me, the internship won’t go to waste. It seriously adds value to your resume and LinkedIn, and gives you experience working in team.\n├── Can you please elaborate on rapid\n│   └── Last year the mentors were worstt,   \nIf you are applying for RAPID, apply if your guide is BJD sir\n│       └── What is the sir's full name.\n│           ├── Bhaskarjyoti Das\n│           └── Check his profile most of the team who worked under him got best Capstone project awards.\n└── I applied for ISFCR (AI for Cyber Security), CCBD &amp; CDSAML, RAPID, C3I(The Center for Cognitive Computing and Computational Intelligence). Which one would be better among these??\n    └── In **CCBD**, **CDSAML**, and **ISFCR**, you’ll be expected to build a project, write a research paper on it, and aim to publish it either in a conference or a journal.  \nYou will get the credits when you publish the paper or else 2 credits goneee.\n\nFor **CCBD** and **CDSAML**, most of my friends were given problem statements like improving an existing model or codebase. Usually, they’ll hand you a paper and ask you to enhance it—like improving accuracy or performance. The themes are mostly around **LLMs, NLP, sentiment analysis, deep learning, reinforcement learning**, etc.\n\nHonestly, we already do similar stuff for our ML projects. These days, coding from scratch isn’t the norm vibe coding is trending (not the best practice, but yeah, that’s the reality for ML). Writing everything from the ground up can be pretty intense.\n\nIf you’re genuinely interested in **pure ML, DL**, or similar areas, these centres might be a great fit.\n\nBut if you’re leaning more towards **security**, then **ISFCR** could be a better match. They focus on **security principles**and offer problem statements like:\n\n* How to protect user data and networks\n* Finding vulnerabilities in LLMs\n* Integrating ML for enhanced security\n\nYou’ll also get some exposure to **networking and OS concepts** (though not super deep into OS).\n\nAt the end of the day, it’s totally your choice ’m just giving you the info so you can decide better. Hope this helped and you got the clarity\n        └── Thank you soo muchh for helping me out!!",
    "Dont companies come for internships in the 6th sem?\n└── Yesss companies do come for internship in 6th Sem.\n    └── Have a doubt.. what if someone accepts a PPO off campus after 6th sem internship... is he/she allowed to sit for placements in the 7th sem ?\n        └── No"
  ]
}