{
  "title": "Can we have a PESU shitposting / memes subreddit??",
  "content": "IK there are some memes in this subreddit but, I was wondering if we can have a seperate subreddit for shitposting no \"how do i study for 69 hours a day?\" no \"i have ISAs next week and i broke my edging streak what do i do??\", \"i am expecting to get 1000th rank in jerkmate ranked what are the chances of me getting PESU CSE\" kind of posts, it would be fun to have a subreddit for shit like fanfictions, \"i was the ice cream vendor at AT\" kind of stuff\n\n",
  "metadata": {
    "id": "1ki0lfv",
    "author": "Imbatmanfromyear69bc",
    "url": "https://www.reddit.com/r/PESU/comments/1ki0lfv/can_we_have_a_pesu_shitposting_memes_subreddit/",
    "permalink": "/r/PESU/comments/1ki0lfv/can_we_have_a_pesu_shitposting_memes_subreddit/",
    "score": 34,
    "upvote_ratio": 0.91,
    "created_utc": 1746736711.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "sure lets call it okbuddypesu\n└── Fellow man/woman of culture I see",
    "Having a separate shitposting sub is not going to stop people from shitposting here, so it makes the entire system redundant. Just go ahead and shitpost here -- we mods generally allow shitposts unless you are a bot and spamming every other day.\n└── Speaking of spam, there has been an increase in \"Can I get X seat at Y rank\" and various bot accounts spamming the sub. If you see anything, report the posts. While tagging me also works, reporting makes it a little easier since the other mods can get to it before I can (timezone differences).\n    ├── Any way to automate the spammer blocking? so that it reduces intervention of mods everytime\n    │   └── Automod exists, but not sure how to do it effectively and reduce the false positives.\n    │       └── Hmm okay, let me see if there is a way to do that\n    └── Have u guys thought of making any juniors as mods (not the 2028 batch)? so that they can handle such stuff\n        └── Nope. The mods are all grads. Simple reason is that this sub does not need any kind of advanced mod duties. We scroll, we find something that violates the rules, we remove. These are duties we can still carry out effectively. Maybe one day when we find life is keeping us too occupied, we might look into it.\n            └── yeah fair, makes sense"
  ]
}