{
  "title": "Is this really PES EC campus",
  "content": "I thought everyone in this subreddit complained about the infrastructure but is this really PES at EC campus? Is EC campus getting new classrooms for btech as well?\n\nhttps://preview.redd.it/vschoi6wpzze1.jpg?width=2414&amp;format=pjpg&amp;auto=webp&amp;s=e4557eebcbf8b2228115453a1c58a6d3a561020f\n\n",
  "metadata": {
    "id": "1kjfguo",
    "author": "Capital-Armadillo793",
    "url": "https://www.reddit.com/r/PESU/comments/1kjfguo/is_this_really_pes_ec_campus/",
    "permalink": "/r/PESU/comments/1kjfguo/is_this_really_pes_ec_campus/",
    "score": 23,
    "upvote_ratio": 0.93,
    "created_utc": 1746897855.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "&gt;I thought everyone in this subreddit complained about the infrastructure\n\nLiterally no one complains about the infra, that's the only good thing here",
    "That's the mrd building, barely a year old\nNew grade are lucky, infra is improving \n\nUsually when u hear complains abt infra it's stuff like few open drains, rain water clogging , few broken chairs in the pixel canteen and 4th floor\nJus visit the campus ull know what I'm talking abt",
    "But still EC campus infra pales in comparison to RR",
    "yes that is ec campus, the mrd student center is very nice.  \nthe examination center is quite new too.  \nidk about new classrooms but there are some renovations going on in the sem halls.  \nwe did get a new robotics lab from KUKA.  \nThey did also fix a stupid swamp like place and made into a nice garden sort of thing.  \nThe three points above are stuff they have done this year.  \nEC infra is ok ish in comparison to RR.  \nRR infra is next level.\n\nBtw in terms of classrooms, well other then lack of AC ( some classes have but never seen them turn on) they are sufficient, good wifi, plugs on all the walls, a fairly big TV instead of a projector.\n\ntldr: its OK, not bad not good. \n\nside note: one crossroad near the main block flooded like 2-3 times during peak rainy season, like 1 foot of water stagnated.   \nthe actual building was fine\n├── You guys don't have AC?\n\n\nRR seems nice but conjusted and crowded. \n│   └── only sem hall and labs have AC, the auditorium is obv AC too.   \nyeah rr does have high crowd, i honestly dont know how bad it is on a normal day, i have only been for some events.\n│       └── How do u survive in class? Won't it get really hot later on?\n└── Is this mrd centre available to all students or is it paid? And how much do we have to pay\n    └── only gym is paid, rest is free.  \nGym is 6k a year."
  ]
}