{
  "title": "Rats in food court",
  "content": "Saw this little something at food court idk what to do, the food court came and kinda called me off. Someone please place it in the awareness of the food court people....",
  "metadata": {
    "id": "1kn9qu3",
    "author": "anastusuh",
    "url": "https://v.redd.it/jqizqcr3iy0f1",
    "permalink": "/r/PESU/comments/1kn9qu3/rats_in_food_court/",
    "score": 109,
    "upvote_ratio": 0.98,
    "created_utc": 1747319651.0,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false
  },
  "comments": [
    "Damn their race just got over and they are already here, I thought their admission has not yet started",
    "![gif](giphy|nJ2PObJA3EVgc)",
    "They dont even wash the spoons and plates properly, we see previous leftover food sticked to spoons, filthy but cant help it and they won't change.",
    "I have nothing to say, just adding to the collection of Ratatouille gifs\n\n![gif](giphy|Xhfnu2973Wy2Y)",
    "Even RVCE Sub got rats in dining hall months ago .RVCE Rats vs PES rats\n└── Bruh u tryna rat wars..?\n    └── Well there is ratrace why not rat wars ???\n        └── Correction , * it is  a ratrace 🥲\n            └── Ok Corporate Ratrace vs Rat Ratrace\n                └── Thats more like it , \nCave man likes it, \nGovernment likes it,\nEveryone likes it :,-)\n                    └── To bheek ke naam pe upvotes dede baba\n                        └── Bhai tere liye toh mein teen account banake upvote dunga\n                            └── Thank you Bhai aapke muh mein dahi shakkar",
    "![gif](giphy|wNDa1OZtvl6Fi)",
    "I don't know how to say this but meet Tim. He is the emotional support pet of the canteen guys and an undercover Assassin, (also doubles his role as a spy too) aka \"Tim cheese\".\n└── bruh, agent 5.5 rules",
    "tht is food inspector wdym!!!",
    "Where tf is this.",
    "UGH...just go the gjb canteen.",
    "That’s nothing, I’ve seen rats 2-3x bigger than that near FC during my time",
    "That's why Lnmiit better\n├── Buzz off mate\n│   └── What ? Ik it's unrelated but lnmiit is wayyy better than PESU lol\n│       └── Good for you\n└── Bro really thinks pesu is PEC lol.. no wonder you are dumb\n    └── Lol even mentioning pesu and PEC in a statement is criminal , one isn't even a top 5 college in BLR and another is the best in chandigarh lol\n        └── That’s why u were seeking advice from PESU about PEC? lol very smart boi u r\n            └── When did I do that mr wannabe RVCE btech student ?"
  ]
}