{
  "title": "Can someone explain the placement policy of PESU? in simple words!",
  "content": "",
  "metadata": {
    "id": "1kq6d08",
    "author": "Mundane-Frosting3624",
    "url": "https://www.reddit.com/r/PESU/comments/1kq6d08/can_someone_explain_the_placement_policy_of_pesu/",
    "permalink": "/r/PESU/comments/1kq6d08/can_someone_explain_the_placement_policy_of_pesu/",
    "score": 13,
    "upvote_ratio": 0.89,
    "created_utc": 1747642336.0,
    "flair": "Placements 🤑",
    "nsfw": false
  },
  "comments": [
    "The Placement Policy if any of you are confused: -\n\n1) If you get a T1, u cannot sit for any other company (FTE/FTE+Int)\n\n2) If you get T3, u can sit for T2 and T1.\n\n3) Maximum 2 offers of any Tier allowed\n\n4) U cannot get more than 1 Internship offer.\n\n5) consequence of (4) is that, if you get T2 Intern+FTE u cannot sit for T1 Intern+FTE only FTE of T1 will be allowed.\n\n6) If you reject a T2, u can only sit for T1. similiarly, if you reject a T2 Intern+FTE then u can sit for Intern + FTE of T1 ONLY (note the difference pls)\n\n7) If you get a T2 IT, u can also sit for T2 Core. Similiarly, if you reject a T2 Intern+FTE IT u can also sit for T2 Core intern+FTE\n\n8) If u get internship which gets converted, you have the right to reject/accept it and sit for FTE as placement cell treats it as just as internship.\n\n\n\n\nThis was posted on Discord by a senior a couple of weeks ago.\n├── While this is mostly accurate, the exact policy is whatever the placement cell decides when you ask them lol, since they are very non-decisive with the rules they enforce. There is no clear instruction, but to summarise, these are the broad instructions:\n\n1. For full-time offers, you can have a max of 2 offers. Once you accept an offer, or you have *received* 2 offers, you are kicked out of the applicant pool. Note that this means once you reject 2 offers, you are out of the pool, even though you are unplaced.\n\n2. Once you receive an offer from tier N, you are only eligible for tier 1 to tier N-1. So if you reject an offer from tier 2 companies, you will only be eligible for tier 1 and above. The only exception is the dream tier, where everyone is always eligible.\n\n3. For intern roles, you can have at most 1 offer. After that, you can only apply to companies that offer only FTE, with the same conditions applied as in (1).\n│   ├── summer internships don't count right? you can still apply to spring internships? \n\nalso, is it alright to reject a ppo from a summer internship?\n│   │   └── Yes you can. Although if you get a PPO from a summer intern it counts against your 2 offers.\n│   │       └── ah got it thank you!\n│   └── acc to (1),can we have 2 tier 1 FTE?\n│       └── No. Once you get a tier 1 offer, you're only eligible for the dream tier. It's explained in (1) and (2).\n├── if you get a t1 ppo through a summer internship can you still sit for t1 placements??\n├── Some people say if you have less than 60% in 12 u will not get placed in good company is that true ?\n│   ├── I have no idea coz I'm a fresher so passing this to u/rowlet-owl\n│   └── Nah, 12th is irrelevant. Haven't seen any companies pose restrictions on Boards score.\n│       └── Some companies ask for 60% aggregate throughout 10th 12th and UG\n│           └── How many is \"some\"? &gt;95% don't ask\n└── There is one more thing to take into consideration. If you reject an interview on-campus, you will be blocked from all further placements. They never say this rule to you, unless you go and explicitly ask them. There are many such unsaid rules, especially when it comes to placements."
  ]
}