{
  "title": "Jee counselling",
  "content": "What is the jee rank list about. In important dates sheet it says it's gonna come out tomorrow.\nIs it a list of all people who applied or those who got a seat according in any kf their options.\nEAC round guys please help",
  "metadata": {
    "id": "1ksrqcq",
    "author": "channykakarot",
    "url": "https://www.reddit.com/r/PESU/comments/1ksrqcq/jee_counselling/",
    "permalink": "/r/PESU/comments/1ksrqcq/jee_counselling/",
    "score": 4,
    "upvote_ratio": 1.0,
    "created_utc": 1747923135.0,
    "flair": "Admissions",
    "nsfw": false
  },
  "comments": [
    "bro from what i read i think they will release a rank list based off your jee mains crl, they will conduct counselling (in person) on june 7 and 8, during this councelling you can select a different branch from what you selected in eac or it can simply be used to get a seat during counselling if you did not get an eac seat.  \n\n\nFor example if you got aiml in rr campus and you have a good enough rank to get cs there you can switch branches(i think) and i think the same applies to cse ec --&gt; cse rr/ aiml rr\n└── Thanks...so if my name is in tomorrow's list I will be called for counselling??\n    ├── only if you want to get your branch or campus changed(assuming you will be eligible)\n    │   └── Oh ok...thanks a lot dude\n    └── I think everyone's name will be there in tommorow's rank list",
    "Is it for us as well, I mean I missed the each round but did register for the June counselling\n└── Yes even I missed eac round but the eac merit list was given long ago even the last date fkr payment is due. Tomorrow's list is for us\n    └── So at how much rank can I get cse either campus, getting 93.475 percentile in mains\n        └── No idea bru.even I got similar %Ile.first time they are accepting jee so no idea.\n            └── Ohh how much\n                └── 93.1\n                    └── Ohh, btw at what time will the list come\n                        └── Idk.They didn't mention that."
  ]
}