{
  "title": "Tier of pesu?",
  "content": "Im tryna search up tier of pes (both rr and ecc) but aint getting anything of recent ,(apart from 2005-06 daa) ,can someone psl proved a reliable source?? Pls provide naac credited list if possible or any dox related to it?",
  "metadata": {
    "id": "1ksskws",
    "author": "[deleted]",
    "url": "https://www.reddit.com/r/PESU/comments/1ksskws/tier_of_pesu/",
    "permalink": "/r/PESU/comments/1ksskws/tier_of_pesu/",
    "score": 11,
    "upvote_ratio": 0.92,
    "created_utc": 1747925239.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "The tier system is vague and subjective. There is no official metric that determines how colleges fall into tiers. But the reality is that unless you are going to an IIT, NIT, BITS, IISc, IIIT, or one of a few other *extremely* well-recognized colleges, nobody cares where you are from, and that is the case with PES; you will thus not find any \"reliable\" source to tell you about its tier.\n\nFor its reputation, it does a great job with placements and is absolutely average at everything else. It is nowhere near the colleges I listed, but it is definitely a good choice for most looking to study CS if you can't get into them.\n\n*Of course, we are also known as IIT Bangalore, but there are other reasons.*\n└── Please check you dm, hope im not bothering you tho, but dont ignore me",
    "PES falls in A+ category\n└── Yeah , but can u provide any context/docs relsted to it??? Ik it competes with few tier 1 colleges (personally visited pesu), so doubt bout its pros, but i want it to be mentioned by naac or atoesst iirf or any such institue ( it realky helps for pg studies ,so im askin)\n    └── https://preview.redd.it/hox1da05mc2f1.png?width=1919&amp;format=png&amp;auto=webp&amp;s=28d9cf3f0fd9ede94f4c3ec615938cb319c1380e\n        └── Thank u bro, i hope u land 1cr+ job🥹🥹\n\n\nBut A+ ---&gt; 1.5 tier aint it??\nCuz\nA++ -----&gt; tier 1 isnt it??\n            ├── Lol thanks for your wish\n\nDont stress too much about tiers. You can be an absolute idiot in \"tier 1\" or a mindblowing geneius in \"tier 300\". It all depends on you and the skills you make.\n            │   └── Thanks mate, i didnot bothered about tier of colleges , until i visited jeetards and saw few posts claiming tier of college in india matters a lot ,if one wamts to pursue phd/ pg studies in us, so i asked to be on safer side, thankfully pesu got what i need\n            │       └── please dont get info from jeeneetards!\n            │           └── Ok bro\n            └── Manipal is A++ but it's considered tier 2 though\n                └── What??💀💀 Then these grades ain't supposed to say the tier??? Who TH invented this tier system?? And why is it soo confusing broo😭😭\nAnyway made up my mind ,that imma join pesu, regardless of tier, after talking to few alumni I felt better\n                    └── What is your percentile if I may ask?.\n\nI think manipal and pesu are in the same level in academics\n                        └── I might get into CE or ME in any tier 2 nit/iiit, if my lucks with me ,or I could get into tier 3 for core cs, with my percentile \n                            └── Same \n\nCan I get CS in ai/ml rr campus at 94.56?\n                                └── Yeah might be possible, I've heard rr gon place cutoff of 95/96, anyway I ain't going to pesu thru jee",
    "Satire\n└── Absolutely humourous ",
    "Pls reply dm sir"
  ]
}