{
  "title": "OUT OF ACADEMICS!!!",
  "content": "Most probably i will be joining rvce or pes(rr) circuital branches,but bcoz of this jee prep of 2 years it has been 0 social life and hectic \n\nwhich one is better wrt social life,fests,work load,baddies (not a perv). I am a day scholar pes is closer to me thru metro ,i know pes comes after rvce in placements but placements diff will not matter but 4 yrs should be better .which one RV or PES?\n\nAnd i am a sportsman ,will they encourage if a student plays national or states and will they give attendace?",
  "metadata": {
    "id": "1ktfc9t",
    "author": "Rich-Mix2955",
    "url": "https://www.reddit.com/r/PESU/comments/1ktfc9t/out_of_academics/",
    "permalink": "/r/PESU/comments/1ktfc9t/out_of_academics/",
    "score": 5,
    "upvote_ratio": 0.78,
    "created_utc": 1747992886.0,
    "flair": "Admissions",
    "nsfw": false
  },
  "comments": [
    "you ain’t getting attendance for anything unless it’s suppppper important(death) and very medically serious\n├── ok ,got it\n└── Never heard of anyone getting attendance cause of a death. Club activities can claim a certain percentage / have a lower cutoff, but i believe they changed it for the semester that just got over\n    └── this semester got no attendance for at or any club activities;\nwhen i was in first sem a guy lost a parent\nhe spoke to the coe and sorted it out\n        └──  Thats not getting \"attendance\" is it? \nI wonder what the upcoming semester's club policies will be. \n\n\nOne System, One Semester 😍. Love the management❤️‍🔥 (/s)",
    "Bro, these are engineering colleges. Social life is decent, fests are a good time, work load is over the roof, baddies… cough cough… (gender ratio to blame). Sports.. though it’s highly biased to non btech students.. so there you go..\n└── every btech students answer ,thanks",
    "well PES has not engineering courses in same campus, so gender ratio on campus is good - ie more baddies.   \nIdt Btech students get encouraged that much for sports, btw the Indian U19 women's cricket team captain is from PES.  \nI would say RV is more chill, but RV subreddit says RV is more strict. Honestly my friend in rv seems to be having it quite hectic, exams are easy but random assignments and shit. \n\nOverall dont expect some movie type life, its still fun tho ( depends on ur friends).\n└── Okay thanks for a valid answer",
    "Don't do engineering if your not interested in academics &amp; engineering. Especially circuital or core courses. Non-interested people join and ruin them\n└── Man you are the first engineer I am seeing who is being nerd ,ig you don't enjoy life/s ,and at this time every students who want to join clg gets ques in their mind after their hectic 2yrs ,so I was just clarifying.\n    └── Kinda true i'm more on the nerd-ish side and have a few small social groups but I've had my good share of clubs &amp; other stuff happening, a lot more which I tried to do. I told this after seeing some of things you have mentioned, and if you really want those you won't be able to do them without feeling hectic.\n\n&gt; Most probably i will be joining rvce or pes(rr) circuital branches,but bcoz of this jee prep of 2 years it has been 0 social life and hectic \n\nPES will be hectic. Especially for a lot (not all, and you might be one of them) of people in their 1st year as you try to get used to the system. EEE seems more chill than ECE, with ECE ppl seeming to be more dead after exams :) \n\n&gt; which one is better wrt social life,fests,work load,baddies (not a perv). I am a day scholar pes is closer to me thru metro ,i know pes comes after rvce in placements but placements diff will not matter but 4 yrs should be better .which one RV or PES?\n\nI'm not sure of the social life RV, but PES can give a variety of options depending on your friend group(s). Many people have high GPA and good lives, many don't and many in-between.\n\nFests/clubs, PES has them better even though the support and quality is varying/lower compared to a few years ago. \n\nWork load, both will give you work just maybe in different areas for different stuff. Can't really escape work if you want to be a good engineer.\n\nBaddies: Every batch seems to get hornier. No further comment.\n\nTransportation, seems like you have figured out both routes so uoto you.\n\n&gt; And i am a sportsman ,will they encourage if a student plays national or states and will they give attendace?\n\nUsually most of the sports people are in BBA. An F4 driver, U19 cricket captain, etc. Doable, yea probably. But you'll also need to spend time practicing. You might not enjoy clubs (both tech &amp; non-tech), subjects, or whatever you want to do as much with so many things planned. I'm not a sportsman, but I did want to do a lot more. I did some things, wished I could to do them better, but now I'm doing good. And more money &amp; time to do those missing things now than when I was busy &amp; broke with college. I'm not sure of how RV is, but wouldn't be surprised if its similar-ish. In the end, its upto the individual to see if they can balance GPA, interests, time, mental wellbeing despite external factors wanting to ruin all of them\n        ├── Thanks you for the answer , but above I did mention /s ,I had heard engineers are chill and they would give chill replies so just said my thought and I felt your answer a bit rude , sorry for that .And yeah I will limit all those things at the right time and manage engineering in a right way.\n        └── Are you a day scholar ,I mean you are from Bengaluru?\n            └── i'll just reply to both your replies in this msg. i was a bit rude ngl, so no problem. i've just had bad experiences with ppl doing multiple commitments at once. \n\nye, i was a day scholar. used to go by clg bus, but got a scooter and was much faster (and allowed to me to do other stuff easily). 30-40 min to go in morning, 1-1.5 hr in afternoon/evening\n                └── I will commute from metro as it is 15-20mins.All the best for your future .\n                    └── thats a pretty good time. get a good friend group, and you'll enjoy a decent chunk of pes. all the best for you too"
  ]
}