{
  "title": "Counselling doesnt guarantee admission, so why are they asking full fee before counselling?",
  "content": "",
  "metadata": {
    "id": "1ktqev8",
    "author": "BirjuAllen",
    "url": "https://i.redd.it/i4nbgfn7ok2f1.png",
    "permalink": "/r/PESU/comments/1ktqev8/counselling_doesnt_guarantee_admission_so_why_are/",
    "score": 18,
    "upvote_ratio": 1.0,
    "created_utc": 1748023807.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "Don’t you think they should ask for the fees after the first round? It feels a bit unreasonable that they are asking for 5 lakhs in advance especially with such a strict process",
    "Ok guys see, you are paying 5 lakhs as tution fee and 10k as administrative fee. So it is 5.1 lakh.\n\n(I'm a pessat student and i had to go for physical counseling)\n\nIf you dont select a seat, you dont pay anything, its like just coming to the campus for a visit.\n\nIf you select a seat, then later surrender it, they will return you the 5 lakh tution fee and keep the 10k, if there are further rounds of counseling.\n\nIf you surrender the seat after last round of counseling is over, you dont get anything back of course, since it will be a loss for them.\n\nBut are they a chor? Kind of yes since a kcet and pessat student get same treatment.\n├── So if I get a better option after getting a seat, and I decide to leave pes before college starts, I'll get 5 lakh refund?\n│   ├── as long as there are more rounds of counseling left, yes.\n\n  \nnot just pes, but any other uni like manipal, amrita, etc. will not refund the full tution fee if you leave after the last round of counseling is over.\n\n  \nbecause if a student gives up their seat after all the counseling rounds are over... that seat would be empty for 4 years, so they will lose out on some money right?\n\nimagine many people doing this, they would lose a lot of money then, so thats why they dont refund the tution fee in this case\n│   │   └── I'm asking because comedk results gonna come out on 7th, bits counselling is in July ig and I also have manipal cse (kinda confirm), I wanna choose the best college mainly giving me high returns through placement and also the network\n│   │       └── afaik, pesu has better placement than manipal, at the cost of quality of life\n\nfrom what i have heard, manipal is good for all an all-round development, its not just about gaining tecnical knowledge there.\n\nif you are strictly looking for good placement, i'll recommend pesu over manipal\n\ni dont much about how things are at bits\n│   │           └── Placements kinda matter to me more honestly plus I have family living in Bangalore (grandparents), also I have 190X rank , so any guess on what I can expect branch wise\n│   │               ├── i dont really know, based on 2024 counseling data, a pessat rank of 2000 was a guaranteed cse in ec campus.\n\nbut this year things are very different, the way seats are allocated has changed, and now you people are having an online counseling also, so no one really has any idea\n│   │               │   └── But still depositing 5lakhs at once sounds like a very big amount for me\n│   │               └── If you don't mind, at what percentile did you get 190X rank?\n│   │                   └── 93.45\n│   │                       └── Thanks\n│   │                           └── What's your percentile btw\n│   └── They will give some last date, before that yes u can take back any time, u will get  5 lakhs back, thats how it is in all colleges.\n└── If I visit campus do i still have to pay 5.1 lakh before getting a seat or pay after i get the seat ?\n    └── Yes, after choosing the seat.\n\nThey will first do some presentation about the good parts of pesu in the auditorium\n\nYou can watch this presentation and go home for free if you are not interested in pesu\n\nThen rank wise they will call people on the stage, where a person sitting with a computer will select the seat of your choice, you will see the number of available seats live on the screen for each campus and branch\n\nMaybe you have to submit the DD for 10k over there at the stage\n\nAfter that, you have to walk to another counter outside the auditorium exit where finance department guys collect the remaining DDs for the tution fee\n\nAnd then finally you walk to admissions office to submit documents and get a temporary id card\n        └── Is this valid for jee counseling also?",
    "This is such a shit system honestly. They want us to fill a google form for the online counselling process and fee payment receipt?! Why dont they have proper full fledged online counselling like other colleges?\n└── Honestly offline counselling is better, i do not trust online counselling of VIT and all, they can easily rig it.",
    "Where did you get this?\n└── Gmail",
    "Lmao wtf are those fees, I'd never join this clg for 5 lakhs",
    "Also what if I go for offline counselling, then I won't have to pay 5 lakhs upfront right?\n└── Same question ",
    "Is 5L complete fees Or is it only tution fee, if so then what will be the cost of hostel+mess\n└── 1.5 lakh for hostel and mess",
    "5 lakhs....\nThat too non refundable \nNo thank you!!!!\n└── Bruh u will get 5 lakh back if u dont take anything.",
    "Vahiii tohh bc ye kya matlab haii mtlb pehle se he bacche bahar kar rahe haii abhii socho agar kisi ne boht acha rank score kiya hoga agar uski koii financial issue ya kuch bhi ho agar bychance paise jama nh karpaya toh usse seat nh milegii??? What the bakchodi on the earth is thiss??",
    "Counselling ke pehle paise maangna he kyuu haii??tum wapas karo ya na karo\n└── Haan Bhai, mai to VIT ko chor samjhta tha...ye log to usse bade Wale nikle",
    "U do get refund immediately i assume, for our batch they take the dd the moment u accepted ur seat.   \nWe did have to take out a DD for it so ig its not that different."
  ]
}