{
  "title": "Should I use this to get an idea of cutoffs?",
  "content": "Is it realistic to use this to get an idea of this year's cutoffs? (non-CET cutoffs).",
  "metadata": {
    "id": "1ktr7h9",
    "author": "Glad-Class-2427",
    "url": "https://i.redd.it/sh61f6f2uk2f1.jpeg",
    "permalink": "/r/PESU/comments/1ktr7h9/should_i_use_this_to_get_an_idea_of_cutoffs/",
    "score": 16,
    "upvote_ratio": 0.94,
    "created_utc": 1748025769.0,
    "flair": "Admissions",
    "nsfw": false
  },
  "comments": [
    "Yes kind off but jee has slightly more seats now that it was through pessat",
    "Is hisaab se to I can get CS at EC campus 3049 rank (89.1 percentile) which is quite unbelievable \n└── it went down to 5k last year in round 2.. so cant tell anything rn...",
    "Question , so pessat seats are now both jee and cet so will the jee cutoff really be same as last yr pessat ..or less/more\n└── Some are saying they incr pessat seats or smn also ? Is it?",
    "Same question getting 19XX rank so according to that I can get ec campus cse\n└── What did you get alloted??\n    └── Counselling hasn't started",
    "22xx mein kya mil skta h?\n├── What was your jee rank?\n│   ├── What can I get for 5xx rank is cse possible\n│   │   └── Probably not\n│   └── 1.09 Lakh\n└── ECE in first round and AIML in 2nd round for RR Campus you can get cse in ec campus\n\nThis is according to previous year pessat ranking\n    ├── Wb 190X\n    │   └── Same as above as per last pessat cutoffs cs usually closes in under 1k\n\nIDK how will it be this time for you guys as jee is taken into consideration cut offs may vary it is completely new.\n    │       └── Ok so AIML in RR possible and cse in ec campus toh more or less confirm\n    └── My jee percentile is 89 and my  pessat rank is 3300. Can I get cse In ec  campus or ece in rr campus",
    "do any of you all know how much percentage seats was reserved for pessat?",
    "Can we change the branch preference already filled ??",
    "what can i get for 61XX rank??\n└── whats ur jee rank?",
    "any idea on what I might get at 16XX rank ?",
    "How many seats are there in pes for cse and cse aiml combined??",
    "13xx pe kya milega! lol idc 5.1 lakh nhi fukna iss college ke liye",
    "For cs you should 1k in kcet and for aiml 1.5k in kcet",
    "From jee main if you can to go you need 98 percentile for cs",
    "so do i have a higher chance of getting cse(ai ml) through jee (91 %ile) than getting it through kcet (44XX) ?",
    "Bro i got 3604 rank in pessat can i expect atleast ece in ec campus"
  ]
}