{
  "title": "Counseling Advice Posts Based on JEE Ranks Will Be Removed",
  "content": "Any posts that request counseling advice based on JEE rank will be promptly **removed**. We have enabled warnings to alert you before you make a post. Trying to game the system by bypassing the filters will not only lead to your post being deleted but also a **30-day ban** (or more, if you are a repeat offender) on the subreddit.\n\nWhy the ridiculously strict decision? This has been implemented for *you*, not us. This rule isn’t here to restrict you — it's here to protect you from misinformation and speculation that could seriously impact your future because:\n\n1. **There is no data to use to make predictions**. This is the **first** time we have JEE for admissions.\n2. **Users offering predictions are just like you** \\- *aspirants* looking for colleges. You aren't getting answers from experts or even actual students at PES. Why? Simply because of (1), we can't make predictions.\n\nSo you're effectively receiving counseling advice from those who (1) have no idea about the system since they are going through this process for the first time, and (2) don't have any facts or data to make predictions. This is a classic case of the blind leading the blind, and all of you look stupid offering each other advice.\n\n**Choosing a college is one of the** **most important decisions you'll make** \\- treat it with the seriousness it deserves. Taking advice from those who lack expertise, have no reliable data, and are going through the same process as you doesn't just lead to uncertainty — it means relying on **completely untrustworthy sources**. If you *really* want to look at previous cutoffs, please refer to [this](https://www.reddit.com/r/PESU/comments/1ct5ujc/which_branch_can_i_get_at_no_dont_make_such_posts/) post.\n\nPlease be better informed, seek guidance from credible sources, and respect the rules we've put in place to maintain the quality of this community. To the other members of this community, if you see posts or comments that violate this rule or spread misinformation, please **report** them to the mods.\n\n\\- Your friendly neighbourhood rowlet",
  "metadata": {
    "id": "1ktzb6o",
    "author": "rowlet-owl",
    "url": "https://www.reddit.com/r/PESU/comments/1ktzb6o/counseling_advice_posts_based_on_jee_ranks_will/",
    "permalink": "/r/PESU/comments/1ktzb6o/counseling_advice_posts_based_on_jee_ranks_will/",
    "score": 61,
    "upvote_ratio": 0.97,
    "created_utc": 1748047870.0,
    "flair": "ANNOUNCEMENT :snoo:",
    "nsfw": false
  },
  "comments": [
    "Hello do you have any idea how many people registered through jee mains this year, or through pessat + jee last year\n└── This year 40k have registered source -admission office of PESU\n    └── That's it?\nPessat had more if I remember\n        ├── Pessat also have around same only\n        └── Pessat had the same. But only 20000 had any chance and 5k is where most ranking ends\n            └── In my batch only top 8k even got called for counseling.\n                └── Got called but doesn't have a chance if it's pessat unless too 4k decide not to participate\n                    └── Yup",
    "worth to be pinned",
    "Hi PESU seniors, I just wanted to confirm whether the seats for CSE are increasing in both campuses?   \n  \nThank you!",
    "Jee main basically replies pessat right. So u cud just compare pessat closing rank and pes jee main ranklist rank\n└── That is a flawed assumption. The number of people who write JEE is *significantly* *higher* than the number who used to write PESSAT. Most people who write PESSAT do have at least *some* intention of enrolling here if given a choice. The same does not carry over to JEE - there will be many who would have opted to receive a rank through their JEE% but will not show up for counseling (just check the previous posts discussing the fees). \n\nAdditionally, it is an entirely new ranking system comprising a whole new demographic. Most PESSAT rankers were those who also scored in KCET and similar level tests, so PES was a fairly good option for them to enroll into. Given the shift to JEE% for ranking, the topmost ranks here will also be taken by those doing pretty well in other more reputed colleges as well, so PES might not be their top option and just a backup (if not an option at all).\n\nThese are just the factors off the top of my head that could affect the shift in closing ranks. There could be more if you spend more time thinking about it. To summarise, no, do not draw a correlation here because things could be **extremely** different.\n    └── I dont think many people are applying here thru jee mains. My jee main crl glitched out to 10lakh and i got a rank of 7k\n        ├── Given that JEE is their only mode of admission, you cannot really say *how* many are applying through it. Do not make predictions if there is no data to go by. And the glitch you faced is irrelevant to the discussion here.\n        │   └── If sm w 10lakh jee main rank is getting a rank of 7k isnt it reasonable to assume that the no of applicants thru jee main isnt very high\n        │       └── Since you seem pretty firm on this, quick question for you - what do you think you'll get with 7k? You could either get CS if none of the top performers showed up, or you could not get any branch at all. Can you say where your rank will lie in branch choices?\n        │           └── Bro i dont think u get my point. What im tryna say is if someone w 10lakh rank in jee mains cud get a rank of 7k in the pes ranklisnt isnt it probable that the no of applicants thru jee main is low\n        │               ├── But *how* low? Is 7k the median, or the tail end? Do you know where you stand? Earlier, most of the top 300 would show up for counseling, is the trend still the same this year? Previously, 7k would not fetch you the top 3-4 branches. Can you say with the same confidence now? \n\nThere are many variables here. Your individual rank determined through your % is not enough information to say if you can get a specific branch, which is the point of the entire post.\n        │               │   └── I dont think anyone w 10lakh in jee main is making to pes man😭😭\n        │               └── Yea but that just makes it better who avged out in jee at 90, they would end up getting more seats cause ppl at that rank would end up getting 3k rank in pes afaik the ones who scored better obviously have better opportunities so it just comes back to these ppl cause there's less ppl\n        │                   └── Yea thts what im saying\n        └── I went to their office yesterday and they said 40k registration have been made till now\n            └── Weird 10 lakh rank w 7k rank. So theres 33k ppl w lower rank than 10 lakh in jee main?\n                └── Ig yours was an technical issue  only\n                    └── Hope they fix that shit and put my correct rank🕊\n                        └── tap oatmeal grandfather straight melodic alive offbeat plant caption wipe\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*\n                            └── 81k",
    "I have a rank of 45XX through JEE mains, I am in the last round of counselling. So can someone please explain to me how online counselling works ?\n\nLike suppose they offer me a seat in X branch. Do I have to take the decision on the spot ?\n├── did you not understand the post good sir? this question is no longer allowed in the syllabus of this holy subreddit\n│   └── Brother, I am not asking that if I have Xx rank will I get Y branch. I just want to know how the counselling works.\n\nWhat is the use of this sub if we can't even help others about the processes and other basic stuff ?\n│       └── If you want to know how PESSAT counseling used to work, search this subreddit. Nobody knows if JEE based counseling will follow a similar process, we do not want to take guesses and give you guys the wrong info. \n\nAny other questions related to admissions, branches, syllabus, placements etc are welcome. We don't know how anything in the new admission system will work. \n\nHow do you expect us to help you? By making up stuff?\n└── On a scale of 1-10, how much misinformation would you like to have? Based on that, one of us can help you out. \n\nIn case you still haven't figured it out, we have no clue how the new system works. Figure it out and tell us."
  ]
}