{
  "title": "ELECTIVE HELP for ECE Sem 5",
  "content": "As I’m about to start my 5th semester in ECE, I need to finalize my elective choices. I’d really appreciate it if someone could share their experience with the various options. Are the electives more theory-based, application-driven? Any guidance would be really helpful.",
  "metadata": {
    "id": "1ku9p9p",
    "author": "SufficientWinner5960",
    "url": "https://i.redd.it/qavrq722wp2f1.jpeg",
    "permalink": "/r/PESU/comments/1ku9p9p/elective_help_for_ece_sem_5/",
    "score": 18,
    "upvote_ratio": 1.0,
    "created_utc": 1748087150.0,
    "flair": "Study Help :table:",
    "nsfw": false
  },
  "comments": [
    "I would like to tell you something just get to know what each thing and Choose the ones you like be it hard or easy see if you take this way you might not regret at the end, don't take something just because some one said it's easy or tough\n└── I am definitely going to choose something i like but I just want to know about all the subjects because i cant really find a lot on google about all of them",
    "If you're looking for a chill teacher and good subjects at the same time. You'll have to consider CLP and QEQC. The grades were pretty high for our batch. Plus if you're good with basics you'll understand the subjects pretty well.\n├── Agree with the fact that teacher is amazing and subjects are intriguing as well\n\nbut high grades were only due to it being project based lol , there is no guarantee itll be project based again ,so not a good point to emphasise on imo 😅\n│   ├── Aye the isa averages were good too in 5th sem\n\nhttps://preview.redd.it/ul4sue2p5s2f1.jpeg?width=1116&amp;format=pjpg&amp;auto=webp&amp;s=38678042f341de953492e539d8d722d48a4b7bb9\n\nIt's not just about the project.\n│   └── https://preview.redd.it/0iv3fom76s2f1.jpeg?width=1110&amp;format=pjpg&amp;auto=webp&amp;s=8bc2ef7520e766500ce282e0079e094255d491f4\n\nThis was for QEQC, the averages are high. These weren't project based\n│       └── yes but the same cant be said extended to ESAs lol , ISAs were easy because the range of questions which can be asked for it is limited \n\nthere has been no quantum subjects ESA till 6th sem of this year , so you arent really guaranteed S or A grade as it was for project based imo 🤔\n└── Every year CLP and QEQC are graded based on our project? And there won't be any changes this year right?",
    "Ann is pretty easy and the teacher is chill\n├── bro is it very theoretical or you write codes and stuff and do you use python or just matlab codes\n│   └── It isn't very theoretical,you'll get things pretty easily also the ta in our case was pretty chill so we didn't have to write new codes just build upon previous ones which he had given as reference\n└── The syllabus being pretty old and all the stuff basically available on gpt is it worth taking this up as a course? Also I've heard that the teacher just copy pastes others slides and makes it their own\n    └── Yeah the subject is pretty easy and I don't think she copies slides but s grade is pretty easy if you take it..if your goal is to learn more then take something else more akin to your your interest",
    "It really depends on what your domain of interest is and are you aiming for actual knowledge or just want to boost your GPA \n\n  \nfor elective 3 id suggest DSD personally since it mostly builds up upon CADD from sem 3 but CLP is also a good one to take if you want to explore a new domain of interest (both the subjects have excellent teachers as well , so thats a W as well)\n\nfor elective 4 , id suggest to choose between QEQC and ANN , both introduce new concepts but they are pretty well connected to the stuff you have learnt in your prev sems (but they can get math intensive , so be wary of that)\n\nthey will release a drive link with all the courses and their syllabi in them , thatll be a better way for you to judge what you want to take tbh , use the comments in this post only if you are really confused , dont get completely swayed by them lol\n└── For the ANN, the teacher is not so good right?",
    "Option1:There r 4 domains, if u have any bias towards a domain just look into the details of the subjects which lie in that domain. Compare and choose.\nOption2: If u have no idea about domains and is still exploring...just think about the 3rd 4th sem subjects, identify the subjects that u studied/learnt with a good amount of interest, then choose similar subjects.",
    "Where did you get the list from ? Or is it last years ?\n└── last years",
    "Can you get one for cse as well",
    "I graduated 6 years ago, and the best elective to pick will always be the one that you are interested in. Nothing else matters in the long run. \n\nDecisions taken based on the difficulty of the course are short term optimizations which lead to an overall worse quality of life for yourself.",
    "Qeqc and clp r the best options for getting ur gpa higher n the teacher is chill n the subject is fun.",
    "Wanted to know more about speech and NLP , Artificial neural network"
  ]
}