{
  "title": "Guys is cs core better or cs(ai/ml) better",
  "content": "",
  "metadata": {
    "id": "1kv6gsm",
    "author": "Brave_University3267",
    "url": "https://www.reddit.com/r/PESU/comments/1kv6gsm/guys_is_cs_core_better_or_csaiml_better/",
    "permalink": "/r/PESU/comments/1kv6gsm/guys_is_cs_core_better_or_csaiml_better/",
    "score": 7,
    "upvote_ratio": 0.74,
    "created_utc": 1748190062.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "This has already been answered in the FAQs. From a future career as well as Masters point of view, core CS is the clear better option. Don't pick specialised degrees unless you know you will be interested in it, core CS allows you to specialise in whatever you are interested in. Recruiters today would still prefer generic CS grads over any specialised degree. \n\nRead the FAQ for a very detailed post about the same.",
    "CS core is better, but u learn the same things in both.\n90% of the syllabus is the same. The remaining 10% can be covered up by electives and stuff. \nJust that having CSE written ur degree is slightly ( like rly slightly) better than CSE (aiml).\n├── Ukw I talked to a graduate and he said he would take cs core\nRecruiters prefer core.\n│   └── If I have to choose btw ai/ml and ece is ai/ml a better option?\n│       └── Ece and cse(aiml) are very very different.\nThat depends on ur interests. U can't even compare the two.\nDecide btw the two and then choose college.\n│           └── No like if I don't get cs core, is taking a specialized branch like ai/ml worth\n│               └── Don't take ece anywhere as a compromise for cse.\nIn fact these speciality ones are a good compromise compared to core.\nLike i said there is barely a difference between cse and cse(aiml)\n└── Im getting pes rr aiml should I choose that over pes ec cse?\n    ├── That's kinda up to ur bias.\nLike i said there is not much difference between cse and cse aiml.\n\nU have common placement in both campuses so again no difference long term.\n\nRR infra is better but it's more crowded then EC\nAgain upto ur bias.\n    ├── I was in the same situation last year , I chose cse core in ec and I don't regret it . I can change my branch to rr aiml even now with the cgpa I'll have . I would recommend cse core but yeah upto you brother . \nCheck faqs too\n    │   ├── Thank you will keep this in mind!!\n    │   └── Will you stick with it? Or do you plan on changing?\n    │       └── I'll stick with core cse\n    ├── U got ur options in eac counseling?\n    │   └── Uh no through kcet!\n    ├── What's ur percentile bro\n    │   └── I'm not going through JEE rankings im going through kcet rankings\n    │       └── Ohh okayy\n    ├── Bro i was also in same situation i asked everyone they just tell there options at the end you are the one to choose . I decided cse in ec over aiml in rr but still ended up in rr because of my parents so best of luck buddy\n    │   └── Should I take cse in ec instead of aiml in rr? I'm not sure if I'm ready to specialize and I've heard that cse in ec is the same as cse in rr because of placements teaching and curriculum being the same the mod has also mentioned that there is no bias between campuses and companies won't know which campus you're from it even won't be mentioned on the certificate.\n\nWhat should I do?\n    └── Pes rr aiml\n        └── Are u a student in PES?",
    "Can I get cse core ring road (rr) campus for 800 pessat jee rank",
    "aiml bro....literally no cons for them atp and papers also much chiller",
    "Bro honestly choose AI ML \nCuz the syllabus is the same and for placements all that matters is gpa and there are chances for better gpa in aiml due to easier papers \nIn aiml pyq’s are enough but for cs papers you gotta tb and work much harder for same gpa\n\nAlso the teachers are mostly same\n└── Why are u getting downvoted\nEverything u said is true\n    ├── Because people should choose a branch that they have prior interest in, something they want to pursue and study, something they want to build a career in. **Not one which helps you score a higher GPA**. GPA is only used as a filter, anything above a certain threshold will provide you access to the same opportunities. \n\nBesides, the logic is flawed since it depends on the difficulty of the question papers being set in that year. If CS-AIML gets harder papers the next year, would OC change their stance on which is the better branch?\n    └── Hods may change, paper setters can change , hell the whole grading system has a change sometimes. So you can never assume who gets the \"easier papers\" and which branch has moderation.   \nThats why choosing branch based on  the difficulty level of PYQs is wrong."
  ]
}