{
  "title": "had anyone paid 5.1 lakh for pes councelling?",
  "content": "idk i'm not gonna pay and lock my money there as there are many other councellings which haven't even started... so i'm not gonna pay that amount for now. but this is a shitty decision by pes!",
  "metadata": {
    "id": "1kve6u5",
    "author": "Wizard_1857",
    "url": "https://www.reddit.com/r/PESU/comments/1kve6u5/had_anyone_paid_51_lakh_for_pes_councelling/",
    "permalink": "/r/PESU/comments/1kve6u5/had_anyone_paid_51_lakh_for_pes_councelling/",
    "score": 22,
    "upvote_ratio": 0.96,
    "created_utc": 1748210163.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "Yes, it can be very unpleasant that you have to lock 5lakhs.\n\nBut college needs assurance that people will join. If someone applies for counseling, takes a seat, and then doesn't join in the end just because he got a better seat somewhere else, PES will be at a loss and remain vacant. To get a guarantee that a student may join, they take this. It is basically like a security deposit. \n\nIf you are really sure about PES, you will pay that amount and block your seat. Else someone else who is in absolute need of a seat will take it.\n└── While the principle is sound, I think the issue most people have is the fact that they are requesting the *entire* fee to be paid. I'm pretty sure the criticism would've been softer if they had reduced their amount. Asking for the entire fee (which btw, isn't a small sum) before many colleges have had their counseling is a little extreme.\n    ├── But if I get a better seat and surrender the pes seat, how much refund will I get, or will I not get any refund\n    │   ├── No clue. As said earlier, this is the first time this is being done.\n    │   ├── the full fee will be refunded before a certain date after which no refund will be given... check the website the date is 7th July ig\n    │   │   ├── Hey it's 20th June but that's for early admission commitment, any idea for those who are applying for the first round or is it 20th June for us also.\n\nhttps://preview.redd.it/2srd74r4x13f1.jpeg?width=1080&amp;format=pjpg&amp;auto=webp&amp;s=e00cd31da2d44a9660b0b951f2b4a69d3314f1e6\n    │   │   │   └── https://preview.redd.it/7vgm3qokx13f1.png?width=1579&amp;format=png&amp;auto=webp&amp;s=4616cbc94f9b4b2b8583d263fd9a160c03900baf\n\n[https://admissions.pes.edu/registration/Impdates.html](https://admissions.pes.edu/registration/Impdates.html)\n    │   │   └── Ohhk thank you\n    │   └── In case you do rescind your seat, your entire amount of 5 lakhs will be refunded to your account except for the 10k which they take as administrative fees.\n    │       └── K thanks\n    └── Yeah valid\n\nEven when I took admission last year, we were asked to bring a DD worth the full fees of the first year(4.8L). So it is a common practice for them to take full fees at the time of counselling.",
    "Don't you need to pay to attend the counseling, as per the new rules?\n└── Weird thing is someone put a screenshot from the site in our college grp saying the rules are the same as it was for our batch, where u just bring DDs.\n    └── Dds is there for the offline one, online people have to make the payment on or before 5th\n        ├── Oh \nThen it's fair.\n        └── wait there's online counselling too?\n            └── For those who are not residing in karnataka\n                └── oh ic",
    "Bro even for my sister we had paid a few yrs back ….this is just to lock the seat ….when we asked for refund we got it within a day ….so if u have the money rest assured that they will refund promptly so I would suggest to pay it and lock the seat",
    "i don't understand  \nis the 5.1L just to attend counselling or it for blocking the seat AFTER counselling ?\n\nor is OP talking about students who have gotten early admissions ?\n└── If its offline, u pay after seat is picked. if its online u pay 5.1 to attend counselling, If u pick a seat based on the fees for the seat the extra will be refunded, if u pick no seat then all fees will be returned ( i think they 10k)\n    └── so you need to pay 10k to attend the offline counselling ?\n        └── for our batch u did not have to\n            └── i see , thankyou"
  ]
}