{
  "title": "Placement advice needed (cse/ece)",
  "content": "Is there any way one can aquire a starting salary of/near 12Lpa (campus placement)\n\nIf yes , then how rare is it (cse/ece branch)\n\nAlso what steps would one need to take to aquire said placement \n\nAny advice will be greatly appreciated ",
  "metadata": {
    "id": "1kvoof7",
    "author": "MFmxmba",
    "url": "https://www.reddit.com/r/PESU/comments/1kvoof7/placement_advice_needed_cseece/",
    "permalink": "/r/PESU/comments/1kvoof7/placement_advice_needed_cseece/",
    "score": 20,
    "upvote_ratio": 0.92,
    "created_utc": 1748245494.0,
    "flair": "Placements 🤑",
    "nsfw": false
  },
  "comments": [
    "[placement 2025 stats(unoffical)](https://docs.google.com/spreadsheets/d/1TfR17y3iPGzHFmCfWGwAXBpwCHvbxEK0wOP_Kx8FOG8/edit?gid=582730064#gid=582730064) this is the stat sheet of 2025 batch maintained by students, it is outdated at the moment.  \n[placement stats official(nirf)](https://pes.edu/naac/doc.html?file=upload/nirf/NIRF_2025_PES_University_Engineering.pdf) this is the stat sheet of 2025 official from college website.\n\nTo answer your questions:  \n1) yes , it is possible to aquire a starting salary of 12lpa  or more in campus.  \n2) it is not very rare in cse , ppl having gpa 8.5+ and some cse fundamentals knowledge and skills  get these offers quite comfortably.  \nIf you check the placement stat sheets you will see that Tier 1 offers(T1) are all 12 and more than 12 lpa packages and the median (not average) package is 12.5 lakhs(approx).\n\n[comment from a graduate](https://www.reddit.com/r/PESU/comments/12bdawn/comment/jewdwb9/?utm_source=share&amp;utm_medium=web2x&amp;context=3) , checkout this comment to know what you need to do and also read the [FAQs](https://www.reddit.com/r/PESU/comments/14c1iym/faqs/) before posting a question that might have already been answered.\n└── Thank you g",
    "Join the college first lil bro\n├── Bruh everyone had same excitement before joining clg not only him\n│   └── Fr ik it's gonna sound corny .... But it feels like a new start\n│       ├── Make sure you have a good journey not only good start\n│       └── It is a new start just make sure you don't make the same mistakes from school. I'm pretty sure you will miss school as well.\n│           └── Ye let's hope for the best\n└── Damn can't even ask for advice\n    ├── You're asking placement advice even before getting a seat here. Ironic no?\n    │   └── Well I will decide using that info if I want a seat here or not\n    │       └── You asked for steps to get such placements. I doubt that is relevant to choosing a seat here. The rest of your post is fine.\n    │           └── Well I would like to if I don't take a seat here \nWhat would be the steps would be to get placed . \n\nSteps like avg cgpa needed. Or if there is a zero attendance criteria or something like that . Are there internships companies that prefer a higher cgpa uk the usual one would need to know before taking a life altering decision\n    │               └── Cool cool. I believe most of it is covered in the placement sheets.\n    │                   └── Ye thanks  to everyone here all my doubts are cleared (sry if I came off as rude\n    └── Worry about the subjects, skills, project building, CGPA, scholarships....internships.....then worry about job....come on dude....I understand you come with some big expectations....they all will break ones you step in....worry about the above things...placement will take care of itself...eventually....\n        └── Yes brother you are right \n\nBut I need this data so I can tell/convince my parents \n\nBut no worries I got it now",
    "Is it hard for ece student to get 12 lpa job, like how often ece students get 10-12 or even atleast a 8 lpa job."
  ]
}