{
  "title": "How ECE is at ECity Campus - A starter guide",
  "content": "A little guide on how ECE really is at ECity Campus and how it's different from [RR](https://www.reddit.com/r/PESU/comments/1cyvucb/the_pros_and_cons_of_pes_university_of_ece_at_rr/). (the true path to salvation ✨)\n\n# ECE at PES University Electronic City (ECity) – My Experience\n\n## Why Choose ECE at ECity?\n\nECE at ECity is considered the better choice if you're choosing between RR and ECity for ECE. The professors are strict but extremely knowledgeable and respected in their fields. Many of them have good industry connections, which helps a lot with internships and placements(they are ready to recommend your name). If you maintain a decent GPA and show genuine interest, you’ll have no shortage of opportunities.\n\nJust make sure you’re not taking ECE just because you didn’t get CSE. You’ll need to put in more effort than your CSE friends. Expect a heavier workload, including the possibility of Saturday classes and additional sessions. Placements currently aren’t the best, but that’s partly due to the market and also because some students dont take things seriously. If you're committed, you'll be fine.\n\n## Professors and Teaching Quality\n\nThe professors at ECity are strict but they know what they’re doing. Most of them are highly knowledgeable in their specific domains like VLSI, analog and digital design, embedded systems, and computer architecture. They're also well connected with industry and research organizations.\n\nThey’re approachable when you need help or clarifications, but they also remember faces — it’s a small department. Don’t expect to get away with slacking off or bunking too often. That said, the quality of teaching is high and they recommend the right resources. Some profs may seem intimidating, but they genuinely want to see students do well at the end of the day.\n\n## Peer Group in ECE ECity:-\n\nThe peer group is a mixed bag. You’ll find:\n\n* Some students who are just doing the degree for the sake of it and are not interested in learning.\n* A bunch of students who are willing to learn but need someone to push them to take initiative.\n* A small group (maybe 5-10 out of a batch of 100) who are truly passionate, skilled, and work on independent or guided projects.\n\nIf you're someone who takes initiative and explores topics on your own, you'll stand out quickly.\n\n## RR vs ECity – Main Differences\n\nWhile RR and ECity are both under PES, the cultures are different.\n\nRR campus has professors who specialize more in AI, Computer Networks, and Communication Systems. ECity campus professors have expertise in VLSI, analog and digital design, quantum computing, and computer architecture. ECity also has two Centres of Excellence: the Quantum and Nano Devices Lab (QuaNaD) and the Centre for Heterogeneous and Intelligent Processing Systems (CHIPS). Students are encouraged to get involved with projects under these labs from second year onwards.\n\nIn terms of opportunities, ECity offers better quality workshops, internships, and research trips (e.g., upcoming CeNSE IISc visit to learn about chip manufacturing). RR students get more half-days and possibly a more relaxed routine, but ECity offers better technical exposure if you're willing to put in the effort.\n\n## How to study in ECE?\n\n### Textbooks, Notes, and Exams \n\nTextbooks are essential for ECE, and the professors usually provide PDF versions. They also clearly mention which textbook to follow for each course — and their recommendations are generally excellent. If you prefer hard copies, you can get them cheaply from Avenue Road (around ₹200 per book).\n\nFor notes, it's strongly advised to take down everything the profs write on the board. Don't rely too much on seniors for notes — most of them forget what they studied after a year or two. Build a habit of reading textbooks regularly.\n\nThe coursework isn’t impossible, but it does demand your attention and planning. Ideally, you should start studying three weeks before your exams. Some courses are easier and can help boost your GPA, while others are tough and can bring it down if you’re not careful.\n\n## Summary and Advice\n\nA TLDR incase you wanna pick ECE at Ecity:\n\n* Be prepared for a busy schedule, especially from the fourth semester onward.\n* Plan your studies and start preparation early for exams.\n* Don’t get caught bunking — the department is small and profs remember everyone.\n* Write proper notes because seniors may not be reliable for academic help.\n* Don’t compare yourself to your CSE friends. The journey is different and that's okay.\n* The professors will support you if they see that you’re putting in genuine effort.\n\n## What to Do After 1st Year – Summer Break\n\nTake it a little easy during your first summer break. But don’t waste it either. Use this time to figure out what ECE actually includes. Look up the various domains (embedded systems, robotics, VLSI, signal processing, etc.) and see what interests you.\n\nYou can also start tinkering with electronics — an Arduino starter kit is a great place to begin. There are tons of tutorials online and plenty of documentation to guide you. Most importantly, get into the habit of reading good textbooks and understanding concepts properly — this will help a lot in the long run.\n",
  "metadata": {
    "id": "1kvxk0k",
    "author": "Pale_Ad7275",
    "url": "https://www.reddit.com/r/PESU/comments/1kvxk0k/how_ece_is_at_ecity_campus_a_starter_guide/",
    "permalink": "/r/PESU/comments/1kvxk0k/how_ece_is_at_ecity_campus_a_starter_guide/",
    "score": 69,
    "upvote_ratio": 0.94,
    "created_utc": 1748274139.0,
    "flair": "Study Help :table:",
    "nsfw": false
  },
  "comments": [
    "Great post, added to FAQs! Thanks for your contribution ✨",
    "ajey sucks ass at teaching except him rest all the teachers are fine. Ajey is extremely knowledgeable in his field but holy fuck bro can't teach.\n└── Agreed, he's famously known for not finishing portions on time and making sure the students struggle. No doubt about his knowledge, he knows his stuff in and out but fails to teach and complete portions on time.",
    "While most professors here are well versed with their subjects, some aren't really great as \"professors\"  \n  \nAjey and Shreyus sir are very well versed in their respective fields, but they both can't teach for shit.  \n  \nArpita ma'am is alright for math, but avoid taking any of her electives, didn't have a great experience with wireless, and robotics was a mess this time.\n\nOther professors are alright, and some are just lazy lmao",
    "1. Is the peer group significantly different from RR- not just within ECE but as a whole? \n2. Are there any things you feel like RR does better or that you miss out on in E-City, and vice versa?\n3. Do you get enough time to learn and practice for IT placements, and do ECE students usually do that at PES?  (I know I should be focused on ECE completely but yk, in case I wanna keep my options open)\n├── 1. Not entirely sure, but this is what I've heard. The students at RR are more inclined towards academics and since RR has more intake than ECity, they tend to have more students who have higher GPAs. Like maybe ECity has 8 students with 9+ CGPA but RR might have those numbers in 20-25. And of course, they do work on projects but I'm not aware on what type of projects these are.   \n2. Nah, what I need is right here at Ecity. I don't miss out on anything.  \n3. It is advised by my faculty to learn and scratch the surface of DSA for interviews, but I'm just not interested. You get time to learn DSA from either NPTEL courses or textbooks. People do read DSA for IT placement prep  and some ECE students do pick CSE minors which includes subjects like DSA, DBMS etc. If u wanna know whether I do that, then nope I do not. And there's nothing wrong with picking up these CSE courses too.\n├── For (3), check FAQs. There are detailed answers there. \n\nI'll let someone else answer (1) and (2). Although for (2) I think people will mostly talk about fests and infrastructure of RR being miles ahead.\n│   └── &gt;Although for (2) I think people will mostly talk about fests and infrastructure of RR being miles ahead.\n\nyeah, RR's annual fest is miles ahead than ECity's. But that's not something really to regret cause students are allowed to both fests. The club culture is slowly dying at both campuses almost, but few technical clubs are much better at Ecity than RR. All of this info can be found in the FAQs.\n│       └── IMO it shouldn't be counted as a discriminator. At the end of the day the campus matters only for 3 out of 4 years. Objectively they are the same. Choose the campus where you get your preferred branch. If you get the same at both campuses, choose the one where the subjective factors align with your interests\n└── Asking the right questions fr...",
    "Can we have this for cse pls 😢\n├── wake up -&gt; watch yt shorts for a while -&gt; relax a bit -&gt; when 6 hrs left for exam begin prep -&gt; read Reverend Insanity -&gt; score 9 gpa -&gt; do leetcode and dsa -&gt; secure job at couchbase\n├── There are many posts already on CS. Check the FAQs, or search the subreddit. You will find that most of these posts have been made by me over the years.\n└── check [FAQs](https://www.reddit.com/r/PESU/comments/14c1iym/faqs/)"
  ]
}