{
  "title": "Guys how is ece going on for you guys.. Are the placements better than previous years.. My only option for ece is pes.. Is it worth it?",
  "content": "",
  "metadata": {
    "id": "1kwmbcc",
    "author": "Brave_University3267",
    "url": "https://www.reddit.com/r/PESU/comments/1kwmbcc/guys_how_is_ece_going_on_for_you_guys_are_the/",
    "permalink": "/r/PESU/comments/1kwmbcc/guys_how_is_ece_going_on_for_you_guys_are_the/",
    "score": 8,
    "upvote_ratio": 1.0,
    "created_utc": 1748349868.0,
    "flair": "Admissions",
    "nsfw": false
  },
  "comments": [
    "Good as long as you know how to make best use of it. The college can guide you and give you opportunities, for sure, but 90% of it depends on how you utilise it. Contrary to what others say about ECE in this college, I personally know people who have made big in life by pursuing ECE here, but they are some of the hardest working people I have ever known.\n\nIf this field/domain does interest you (and you do not have have a faint heart, because trust me, it will give you many instances), then sure, go for it. Professors here are well versed with their domain, provided you understand and are able to make best use of it\n└── Thanks a lot bro",
    "https://www.reddit.com/r/PESU/comments/1kvxk0k/how_ece_is_at_ecity_campus_a_starter_guide/",
    "why not CSE or AIML? or do u have deep interest in ECE? if so, why?\n├── I got 1.4k rank.. Cse might be tough.. Doing aiml in btech isn't worth coz doing core engineering is better and then doing specialization during mtech is better... So i thought of considering ece.. Hence my question regarding it in pes\n│   ├── What's your interest in? CS or ECE? If you want to pursue a Master's in CS, then it's better to choose CS-AIML over ECE. Your undergrad degree needs to be related to the degree you intend to apply for later.\n│   │   ├── If I narrow down for cs specialization rn ie. Ai/ml in btech  might narrow down my opportunities right.. I wouldn't be doing mtech in cs related stuff if I take ece..see with my rank there is a slight chance I'll be getting cs core.. If I get cs core I would take it.. Then there's cs with specialization in ai/ml which might narrow down my opportunities in future.. Hence I may consider ece.. Do you think btech in ai/ml is worth it because I asked my uncles and aunts who are in a pretty good position in good companies and they said narrowing your field at the start isn't a good idea.\n│   │   │   └── Bro that aiml degree is like 90% same as the core \nThe difference in syllabus can be covered up with electives.\n│   │   │       └── You're barely in first year. You aren't really qualified to answer the after effects of choosing specialised branches lol, you haven't seen the industry and how it works.\n\nI'd suggest not giving misinformation to someone making a career affecting decision\n│   │   │           └── I am giving this answer based on answers from my seniors, when I was doing college hunting. \nBut yeah ur right I should shut up\n│   │   └── Degree doesnt matter much for Mtech CS admission... its based on gate score right?\n│   │       ├── it is, based on GATE Score, but the exam itself is based on your degree, better to take AIML or CSE Imo\n│   │       │   └── Ig doing Mtech in CSE after doing CSE Btech in PES isnt worth it... a 2 year work experience would better in that time frame... Doing Mtech in ECE in the other hand will be more valuable (If its from the top IIT's)\n│   │       │       └── &gt; Doing Mtech in ECE in the other hand will be more valuable (If its from the top IIT's)\n\nWhy do you say this and what is the logic?\n│   │       │           └── Maybe mtech helps in mastering a specialization in ece and because it's from an iit the companies will prefer them right? This is clearly seen also in the placement statistics of mtech..\n│   │       │               └── Oh you meant MTech in ECE after doing a bachelor's in ECE. My bad, i misunderstood\n│   │       │                   └── No problem... Idts anyone's mad enough to do ece mtech after btech cse lol\n│   │       └── Ohh alright.. But doing cs with specialization would decrease job opportunities or would make me less flexible right? Recruiters prefer cs core at least during btech.. Am too confused with doing btech in ai/ml..idk if it would be worth it in another 4/5 years\n│   │           └── I'd say pick core CS bro, its better\n│   └── Cse at 1.4k should be easy right\nAt least aiml is very much obtainable.\nAlso aiml in pes has like 90% same syllabus as core and difference can be covered in electives.\n│       └── Thanks bro\n└── bro i want to dm you regarding ece at pes rr\n    └── sure bro, DM me\n        └── But i can't,  It's showing I cant dm you"
  ]
}