{
  "title": "Mechanical engineering placements",
  "content": "Is the department good? Are the placements good? Any other colleges you guys might recommend for mechanical engineering?",
  "metadata": {
    "id": "1kwugh3",
    "author": "[deleted]",
    "url": "https://www.reddit.com/r/PESU/comments/1kwugh3/mechanical_engineering_placements/",
    "permalink": "/r/PESU/comments/1kwugh3/mechanical_engineering_placements/",
    "score": 4,
    "upvote_ratio": 0.84,
    "created_utc": 1748369660.0,
    "flair": "Placements 🤑",
    "nsfw": false
  },
  "comments": [
    "What placements? /s\n└── Campus recruitment.... Are they good?\n    └── You can check the placement sheets for details. \n\nThe summary is, no. They aren't. PES is known only for CS placements.\n        ├── Okay thank you. How is the department in general? Is the faculty good? Is the syllabus up to date?\n        │   ├── I'm not qualified to answer this. Wait for someone else to respond or ask on the Discord server.\n        │   ├── Ask on Discord server, u can find a few mech students there.\n        │   └── DM me for questions, most ppl in this subreddit are cse kids. Oh also rowlet is true the placements are nothing compared to cse but this year atleast, considering the market and mech standards, they're pretty good.\n        └── Even for ece?\nLike not even a few core placements?.\nI am really confused now, ete at msrit vs ece at pes(I already posted this and the god of this sub replied {you}).\n            └── You can find the placement sheet maintained by students in this sub. Albeit, it might not be complete for ECE &amp; core companies, it'll give an idea. There are a core placements, but the number is low. And there are people who do if off-campus as well, which is untracked &amp; unaccounted for. This is the same case for all core branches, all throughout India.",
    "I would recommend going to RV, BMS, MSRIT if its through KCET/COMEDK. Manipal is ok too. In all honesty, mech placements will be low in all colleges. 2025 batch of PES got lucky somehow, but that hasn't be the case for the rest. With so many faculty leaving, reduced intake, decreased department budget, broken equipment, etc. The same is true for almost all colleges in India, and honestly you shouldn't take mech in pes unless you got absolutely no other option\n└── I haven't done well enough to get into RV, BMS or MSRIT. With my current rank I might get DSCE or maybe NITTE. Are those any good?\n    └── dont go to DSCE. NITTE is decent. but remember, if you really want to get a good life your gonna have to work hard, step out of comfort zones, do projects and stuff. Being down is fine, but you gotta keep your head up and move on\n        └── I'm willing to work hard..... Idk if I should be the one telling this but I've always been average or above average at studies. Kinda fucked up 2nd PU and CET and ye I think I'll do good in projects and stuff especially group projects since I'm pretty extroverted. I just need a seat in a decent college with good opportunities\n            └── are you interested in mech? take mech only if your interested in it\n                └── I am. It's not even about the money I might earn anymore. Ofc everybody needs money but what is the point of me taking cs just to be doing a 9-5 job I don't even enjoy. \n\nHow humans went from sticks and stones to flying metal containers fascinates me. I want to further understand designing and flying of aircraft and spacecrafts alike\n                    ├── honestly we need kids like you to kick off mech in PES. The 2025 placement stats for mech has been pretty good and our off-roading team did pretty well in baja this year. some of the faculty is pretty shit but some are freaking amazing and they aren't leaving anytime soon afaik. you'll get a few good profs who bring in a lot of projects, and a few who have good connections with IISc and the industry in general. I'm your immediate senior so I'm still just finishing first year but from what I've heard, from my immediate senior, it's not half bad if you're genuinely interested.\n                    │   └── I am genuinely interested but then again a seat.... That is the only thing stopping me rn. Do you know of anybody I can talk to regarding seats?\n                    └── aight. keep up that passion, but you will need to improve on your studying &amp; time managment skills. will be useful for future too. next thing is to get into contact with good professors at whichever clg you go to. you can also contsct professors in iisc/iit/nit for internships in the summer there (2nd year onwards).\n\nbeyond that, check if they are active clubs, labs etc. to participate it in. There are competitions for cljbs to participate in and will be useful. A good professor will also explain abt research papers.\n                        └── Will do. Yes I'll do that. Yes I've already met a few professors from iisc and I've started doing some research abt any courses I can take simultaneously in my 1st or 2nd sem so that I'll be a lil different from the other students at the campus. My only issue rn is getting a seat which is almost impossible due to my ranking. \n\nI'm pretty extroverted and hence won't have an issue getting along with people and/or joining clubs. I'll pray to god that somehow I'll get a seat in PES if not then I'll have to probably join DSCE and do what I am planning on.\n                            └── &gt; courses I can take simultaneously in my 1st or 2nd sem\n\nDon't do it. Enjoy your first year. Explore &amp; find out information, thats fine. This can be reading &amp; finding textbooks, info, reading abstracts &amp; introductions of research papers (since you won't understand the content at this level).\n\nIf you want to learn stuff like CAD modelling, don't take any courses. Install Fusion360 using a student email-id/hobbyist edition (or) use OnShape on a browser. Start modelling everyday stuff and just practice what all features are. You can YouTube on how to use certain features.\n\nIf you want to learn simulations, there are free courses by Ansys called Ansys Innovation Center &amp; on YouTube. \n\nSince you mentioned planes &amp; rockets specifically, i'd assume your into aerospace. Check out stuff like XFLR, OpenRocket, subreddits on them, etc. There's a lot of stuff for you to just see and explore. Keep increasing your complexity as you go into 2nd &amp; 3rd year. \n\nBooks &amp; papers you can get on sci-hub dot se or annas-archive dot org.\n                                └── Forgot to add, you can check up stuff like ASME, SAE competitions"
  ]
}