{
  "title": "Would it be a right decision?",
  "content": "i think i will get ME from previous years cutoffs of pessat in rr campus. Would it be a wise decision to join the college and aim for branch change to ECE in the first year ? How difficult will it be ?",
  "metadata": {
    "id": "1kxc8f9",
    "author": "Ok_Strategy4085",
    "url": "https://www.reddit.com/r/PESU/comments/1kxc8f9/would_it_be_a_right_decision/",
    "permalink": "/r/PESU/comments/1kxc8f9/would_it_be_a_right_decision/",
    "score": 6,
    "upvote_ratio": 0.88,
    "created_utc": 1748422383.0,
    "flair": "Admissions",
    "nsfw": false
  },
  "comments": [
    "As stated many times before never join with the intention of changing branches , there is a chance you may not get what you want and you might HATE the only option your left with.\n└──  But still would not be it easier to change branch to any circuital branch (any campus) like EEE , ECE etc than taking drop and grinding hard ? If u were in my place would u drop or aim for branch change atleast to EEE in any of the campus ? I heard the cutoff for cse in ec campus was 8.05 i think it is easier than grinding in drop year, if i am wrong pls correct me\n    ├── You shouldn't join any college with the intention of branch change because it's a system that cannot really be predicted. It depends on how many seats are left in each branch, how your batch performs relative to you and how you perform in your first year too. If any of those three factors don't go in your favour, your chances will hit zero, and the chances of branch change are always slim to begin with: hundreds apply for a branch with a difference in 0.0x between their GPAs. Getting an 8.0 GPA is arguably not that hard, but you also need to outperform your batchmates, which is the hardest part. \n\nI'd suggest joining PES if and only if you are absolutely sure that you are ok with staying back in ME if you aren't able to switch branches. As someone else said, pursuing a branch you do not like will only lead you to hate it, and this is something that could affect the rest of your college life as well as your career. \n\nI am not going to comment on whether you are capable of switching branches, since that is on you. Neither can I comment on whether you will do better if you take a drop year. Just here to present the facts that branch upgrade is not likely for 99% of the population here and choosing the wrong branch for undergrad will lead you down a spiral.\n    │   └── Thanks for the detailed answer. I have made up my mind and i am going to drop\n    │       ├── No problem. All the best!\n    │       └── Wait u seriously going for drop?\n    │           └── Yeah\n    │               └── Did you gave comedk?\n    └── Cant really comment on what will be your best option. But choosing the branch which you are interested is very important. Because you will spend next 4 years studying it. If you dont make the right choice, you will hate the branch.\nAs per your other option of taking drop, it really depends on you.if you are taking drop , you will want to perform better and you should know whether your capable  enough to avoid distractions for another year and not to repeat the mistakes you have already done.",
    "Also my other option is drop"
  ]
}