{
  "title": "Which club should I join? Please Help",
  "content": "So I am finishing my first year this month (RR campus), and i had joined a 2 clubs, but like there is little to no activity. I want to join a club, technical/non tech, where i can meet more people, talk to seniors and make new friends, can you please help me suggest some clubs i can try joining?",
  "metadata": {
    "id": "1kxgcta",
    "author": "Signal-Cat2063",
    "url": "https://www.reddit.com/r/PESU/comments/1kxgcta/which_club_should_i_join_please_help/",
    "permalink": "/r/PESU/comments/1kxgcta/which_club_should_i_join_please_help/",
    "score": 9,
    "upvote_ratio": 0.84,
    "created_utc": 1748436913.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "In terms of a friendly community, I highly recommend Linguista. Lot of chill friendly people",
    "Hsp and Acm for tech related.\n└── Sorry can you please tell the names, i am not familiar with the short forms\n    └── Hackerspace and  association of computing machinery",
    "Which campus?\n└── RR\n    └── If you are into languages, you can try \"Linguista!\". The community is vibrant. Though there aren't many events they host, it's a pretty chill and welcoming club. I can't say much about the other clubs tho..\n        └── Okay, im actually kinda interested in german, have been learning it in duo for like an year now, does it help?\n            ├── Knowing a language isn't really a requirement to join the club, a general interest and passion to learn is more than enough to get in.\nAnd yes, the club does have regular language workshops in various languages that are open to everyone . The club has a higher community that has regular discussions on books, poetry, anime languages and much more..so do check it out whenever ur free\n            └── Okay so there are people who already know german or are learning rn. You can talk about something you have learnt, get your doubts solved, solve others' doubts and even teach in language workshops.\n\nThere will be recruitments in the upcoming semester. Keep an eye out for them!",
    "None",
    "Dm??\n└── Nobody will DM you. If you need help, post your questions here or DM someone. We aren't here to be commanded around."
  ]
}