{
  "title": "MIT MANIPAL CSE VS PES CSE (EC CAMPUS)",
  "content": "I'm getting mit manipal cse and pes cse at ec campus and in further rounds might get aiml in rr campus, which one is better? Pes is through the main exam. Someone help please.",
  "metadata": {
    "id": "1kxzkc9",
    "author": "BulletFist1107",
    "url": "https://www.reddit.com/r/PESU/comments/1kxzkc9/mit_manipal_cse_vs_pes_cse_ec_campus/",
    "permalink": "/r/PESU/comments/1kxzkc9/mit_manipal_cse_vs_pes_cse_ec_campus/",
    "score": 1,
    "upvote_ratio": 0.53,
    "created_utc": 1748485507.0,
    "flair": "Admissions",
    "nsfw": false
  },
  "comments": [
    "For Christ's sake, please use the search bar. And core CS &gt; CS-AIML &gt; AIML. Again, read the FAQs why.\n\nhttps://preview.redd.it/logn2rzo1n3f1.png?width=871&amp;format=png&amp;auto=webp&amp;s=13bb04a09e120eca1f77ec7f75220a6ee86a11ce",
    "Both of them are on a similar side when we are comparing the fees. However, MITM is 2L more expensive. But the campus life compensates for it. If you have any other affordable options like BMSCE/MSRIT/RVCE. Ig that will be a lot better because the fees will be around 15L lesser than PES &amp; MIT.\n└── I'm getting 103 marks in comedk so idk what I'll get through that but I might get scholarship in manipal (kinda a full fee waiver)\n    └── is your met predicted rank under 100???",
    "Just judging off of placements and what I have heard from seniors, pes would be better\n\nKeep in mind I don't have knowledge about the hostel campus and other stuff\n└── Posts last year are saying manipal is better, I just want to know the scene this year because I'm confused between these two options\n    └── College life is known to be better in mit.\nIf ur coming through kcet pes is a steal. \nIf it's thru jee, they both are more or less the same imo\nBoth have pros and cons.\n        ├── whats the diff between the 2 modes (as in pros and cons)?\n        │   └── Kcet is just cheaper that's it\n        └── Can you list down the pros and cons",
    "Pes",
    "Mit manipal is better",
    "Do u know a search bar exists in reddit?",
    "Pes has a much better crowd than manipal (Go to manipal) pes has better clubs and opportunities (Go to manipal) There's not much difference when it comes to fees and placements (Go to manipal), lastly PES is IIT Bangalore there is no comparison duhhh (Go to manipal).\n└── Hey, are you from PES? I have a few questions, can I dm you?\n    └── sure"
  ]
}