{
  "title": "Doubt regarding pes rr cse",
  "content": "Hi,so I will be joining pes rr cse this year and I have a few doubts.i read through all the pro and cons mentioned in the faq section of the subReddit and I was able make out that pes is academically rigorous ,but I just wanted to ask will I get time in pes to learn stuff besides college academics,will I have  enough time to join non technical clubs,and also how many hours would i need to study on a daily basis to get a cgpa of 8.5+(like is 1.5 to 2hr everyday sufficient) .it would be really helpful if someone took the time to answer.",
  "metadata": {
    "id": "1kyjn54",
    "author": "[deleted]",
    "url": "https://www.reddit.com/r/PESU/comments/1kyjn54/doubt_regarding_pes_rr_cse/",
    "permalink": "/r/PESU/comments/1kyjn54/doubt_regarding_pes_rr_cse/",
    "score": 20,
    "upvote_ratio": 0.92,
    "created_utc": 1748546545.0,
    "flair": "Admissions",
    "nsfw": false
  },
  "comments": [
    "\"rigorous\" is a very relative word, and i will agree that pes relative to most other comedk colleges is a little harder with the portion. And it doesn't help that the students themselves take the exams very seriously and study quite a bit more than they should. It's cause of the scholarship, touche jawahar. \n\nBut that being said, the \"seriousness\" I'm talking about is basically studying their asses off on the exam week, not like jee, not like boards. nobody cares about them to study for months before the exams. Think like 9th.\n\nYou'll mostly be fine if you start some basic studying 1-2 weeks before the exam. Pes doesn't teach us rocket science, it's not that hard, so chill out\n└── Thank you for taking the time to answer",
    "Quality of study &gt;&gt;&gt; hours of study.. I know people have have studied last minute and scored better than people who have studied for 2 days. \n\nIdeally it’s 50% understanding in class and 50% learning and practising it yourself. \n\nYes, you do get time away from academics, but only if you manage it wisely\n└── Thank you for taking the time to answer",
    "\nBro chill out\nStart studying a month before exam and you’ll easily get 8+ peacefully and easily \nYou don’t even like have to study like 4 hours a day \nJust start a month before\nAnd yore sorted\nAlso you’ll have a hell lot of time\nDw about that and all\nIt’s not like you only have to study \nYou can do non tech stuff , fuck around all while getting 8+\n( but remember START EXACTLY ONE MONTH BEFORE EXAM. Don’t start 3 weeks before not 2 weeks before but 1 Month before )\nHave fun bbg\n└── Thanks for the reply bro"
  ]
}