{
  "title": "How to upgrade yourself in this holidays",
  "content": "What skills should I learn these dayss like am a bit confused whether to make projects or go with dsa help me",
  "metadata": {
    "id": "1kzo7mz",
    "author": "CommissionEast1199",
    "url": "https://www.reddit.com/r/PESU/comments/1kzo7mz/how_to_upgrade_yourself_in_this_holidays/",
    "permalink": "/r/PESU/comments/1kzo7mz/how_to_upgrade_yourself_in_this_holidays/",
    "score": 20,
    "upvote_ratio": 0.95,
    "created_utc": 1748664824.0,
    "flair": "Study Help :table:",
    "nsfw": false
  },
  "comments": [
    "It's not easy to answer this one, primarily cause the things today are extremely dynamic. But taking a bit of a systematic approach, a more calculative one\n\n1) For those looking for a job after your Bachlors, you can't afford to spend two months without going a load of leet code and other such platforms not only in terms of hours but habit building. I haven't been the best of the coder myself compared to my peers at PES but most of them would agree to this now after 5 years in industry, doing 6 hrs on Sunday is not enough but a dedicated hour between 6-9 will make you much more efficient. Build a habit to code daily that will improve your ability without causing fatigue (it will happen if you do too much too early).\nSurely in addition to that you can take a project, some good advanced AI courses (Stanford online, MITOCW, deeplearning.ai or any such free courses)\n\n2) For those planning to pursue Masters Abroad:: Your coding skills while very valuable later don't help with the resume scores. As someone who has sat in the policy making room for international students I can tell you no one checks shit, so learn how to put your achievements and get ones that matter to the grade search committee. For instance, do a research project (not necessarily going and presenting a poor paper in IEEE) BUT show you can help your profs when you get admission in their research, be a good TA which I understand is an option for you to do in PES as well now, do some social good for your peace of mind and brownie points. We don't pick students only based on acads here, so it would help if you can show some leadership qualities (at least on paper? Use the summer to go for such.\n\nOpen source contributions help with both, learning music or to learn a rare instrument helps a lot for the 2nd instrument. There are open research projects under some of my peers at IISC and IIITB but you can just as well do a remote internship under anyone.\n\nApart from that at least spend 2-3 hrs watching movies, hanging out with friends, attending some good events having fun especially if you are in your first/second summer cause you can explore random stuff today which will be free, but will not be possible for you after a few years.\n\n\nDo ask if you want to know anything particular."
  ]
}