{
  "title": "To all the lateral entrants, How much rankk did y'all secure in DCET to get admission in PES(mention brach)?",
  "content": "If you were to arrange MIT (Manipal Branch), MSRIT, BMSCE, RV AND PES in hierarchical order how would it be?\n\nI scored 60 marks in DCET and 9.2cgpa in diploma. Rankk‎ predictor suggests I can expect a rankk‎ of 2000. \n\nIf youre not a lateral entrant but know a lateral entrant, please ask them and share here. Thank you.",
  "metadata": {
    "id": "1l0go4a",
    "author": "Plane-Original-2786",
    "url": "https://www.reddit.com/r/PESU/comments/1l0go4a/to_all_the_lateral_entrants_how_much_rankk_did/",
    "permalink": "/r/PESU/comments/1l0go4a/to_all_the_lateral_entrants_how_much_rankk_did/",
    "score": 5,
    "upvote_ratio": 0.78,
    "created_utc": 1748753529.0,
    "flair": "Admissions",
    "nsfw": false
  },
  "comments": [
    "Be within 1100 DCET rank. \nSufficient to get into EC campus CSE.\n└── Hey bro, can you please check DMs?",
    "Which branch of engineering are you interested firstly?\n└── AiMl and ECE\n    └── \nyou know both are completely different right?\n        ├── Yes Im interested in both. Ill do pretty well in either of em. I did my diploma in ece but I also liked coding so learnt C and dsa parallely, my 6th sem project in diploma was based on ML and CV.\n        │   └── ohk. then peace\n        └── Are you a lateral entrant ? Please check dm.\n            └── im not lateral emtry. i'll check DM after work",
    "I am a non-karnataka student, so the only options for me to do lateral entry from was PESU and MIT Manipal, I went to bangalore and there I gave what I think was the PESSAT, afterwards I gave an interview and they said I qualify fora seat, the seat booking fee was the tuition fee + registration fee so I was in quite a dilemma, I visited the RR Campus for Mechanical, the campus was good and was in central part of bangalore. As for manipal I gave the documents and got selected but by then my interest was in to join PES after looking the crowd and facility. I'll suggest you visit the campus of college you want to join and then only proceed.\n└── MIT MECHANICAL&gt;&gt;&gt;&gt;\n\nBro you messed up.\n    ├── possibly. but fees are also higher and everywhere in India, mech quality is dropping. If one can afford MIT Mech, they should take it mostly just due to their clubs. Faculty seems to be ok-ok. Of course, PES Mech has dropped hugely since covid\n    │   └── He probably paid almost same ampunt for PESU\n    │       └── rip then even worse if true\n    └── Nah I wanted to stay in bangalore, plus I was seeing better benefit by being close to other Universties and Colleges. Well, good for you.",
    "2k ,it's hard to get a seat in ec or rr tbh , 3rd round u might get i guess .\n└── Which branch can I expect?\n    └── Ec or mech in rr maybe but I doubt you'll get cs or aiml\n        ├── RR is main campus right ? is ec good there ?\n        │   └── Rr ec doesn't matter as placements are together so doesn't make sense for more info on this see faq .\n        ├── What are your opinions on BMS ?\n        │   └── Don't know but I know they increased their seats a lot last year and this may affect placements as  more number of seats added.\n        └── &gt;Ec or mech in rr\n\nOh you meant electronics city or mech in ECE? 😭😭\n            └── Ec or mech in rr means electronics or mech in rr bruh 🤯, you could try for ec in electronic City campus too."
  ]
}