{
  "title": "Seniors have you gotten Summer Research options after 2nd Year",
  "content": "I was asking chat gpt whether IISc Bangalore gives opportunity to students from other colleges and most places it said yes. My question is whether a senior or alumni has done it from PES and what other options can I get in PES relating to research, specifically in Aerospace.",
  "metadata": {
    "id": "1l0h9b4",
    "author": "Lucius-Lionheart",
    "url": "https://www.reddit.com/r/PESU/comments/1l0h9b4/seniors_have_you_gotten_summer_research_options/",
    "permalink": "/r/PESU/comments/1l0h9b4/seniors_have_you_gotten_summer_research_options/",
    "score": 9,
    "upvote_ratio": 1.0,
    "created_utc": 1748755676.0,
    "flair": "Placements 🤑",
    "nsfw": false
  },
  "comments": [
    "Yes, many have gotten opportunities at IISc over the years. I even know one from the current 2nd years (if I'm not wrong) who got in. \n\nI'm not the right person for Aerospace, so I'll let someone else comment on that.",
    "I'll be interning there this summer (just finished my 3rd year).\n\n\nAlthough you should keep in mind that things vary a lot between different labs and departments: Chances of getting in, criteria for recruitment, etc.\n\n\nI've got no idea about the scene for Aerospace though.",
    "Well, there are research centers on campus u can try out there. Did u try in CCBD / CDSAML, ISFCR, C-IoT, PIL (already closed now) etc? \n\nIISc is the best, but getting there is little tough, but u can try ur best\n└── Alright I'll look for getting into them, thanks alot for your input.",
    "&gt; I was asking chat gpt whether IISc Bangalore gives opportunity to students from other colleges and most places it said yes.\n\nDon't rely on ChatGPT or AI for everything. \n\nInstitutes of higher learning are always ready to get interested people to intern (paid or unpaid, completely depends on the professor, department, field of study, etc.)\n\n&gt; My question is whether a senior or alumni has done it from PES and what other options can I get in PES relating to research, specifically in Aerospace.\n\nYes. I've done in a lab there related to wave mechanics. Go to the faculty page of IISc Aerospace department, see the professors of which field you'd be interested in working under and e-mail them. Be aware though, as a 2nd-year, you know absolutely nothing. You'll want to brush on basics if they call you up to meet them and stuff. If they don't reply like within a few days or week, they might be busy or abroaf for other work. Don't take it personally.\n└── Thanks I'll keep that in mind"
  ]
}