{
  "title": "Seniors help needed regarding fees",
  "content": "I have heard that some colleges ask for extra fees in addition to the fees said by KEA, seniors who joined through KCET last year have u faced any issues like that, and what's the total fees u had to pay for CS/ECE",
  "metadata": {
    "id": "1l0ky6k",
    "author": "Commercial-Driver219",
    "url": "https://www.reddit.com/r/PESU/comments/1l0ky6k/seniors_help_needed_regarding_fees/",
    "permalink": "/r/PESU/comments/1l0ky6k/seniors_help_needed_regarding_fees/",
    "score": 3,
    "upvote_ratio": 1.0,
    "created_utc": 1748770471.0,
    "flair": "Admissions",
    "nsfw": false
  },
  "comments": [
    "we had to pay 1.07 lakh to KEA after securing the seat and clg ask 23k(10k scholarship optional) after some 2 months of college ,so the total fees we have is 1.30 /1.20 lakh\n└── Thank you, Btw should we pay 1.07L to KEA every year?? and what do u mean by scholarship please explain why we would have to pay 10K for it\n    ├── there are 2 scholarships  \nfor the top 5% of students 50% of fees is returned ie 50% of 1.3L so around 65K  \nthe next 20% get 40% of the fees back ie 40% of 1.3L so 52K\n\nto get this 65 and 52K theres an extra fee of 10K which would still mean a scholarship of 55 and 42K respectively\n    │   ├── Oh ok, thank you very much for clearing this doubt\n    │   └── Btw would you recommend ECE at PES or ETE at RV, I have heard a lot of people say don't take ECE at PES, it's good only for CS blah blah, what is ur opinion on it\n    │       ├── honestly idk im still in first year havent heard anything much about ece\n    │       └── &gt; blah blah\n\nEvery blah blah has a hint of truth.\n\nRV is better for any electronics/electrical-related stuff. Been the way for a long time, and until PES cares about its non-CS branches more this will not change.\n    └── Only for the 1st year you must pay to KEA ,2nd year onwards we must pay the entire fees to college itself afaik",
    "for cse- base fees was 107495 there was a misc fee included which brought this up to 1.2L and another 10K for the scholarship fee so the total was 1.3L\n└── Oh ok, can u tell if we have to pay the same fees every year or it's different\n    └── yeah its 1.3L for 3 years and 1.2L for the last because no scholarships applicable"
  ]
}