{
  "title": "Placement Statistics Compilation - 2022 to Present",
  "content": "Hi everyone,\n\nThis post is intended to serve as a central reference for the placement statistics across different years. Note that these are **unofficial** **resources maintained by students**, but I believe these are fairly accurate since they almost always match with PESU's yearly placement report.\n\nI've compiled the links below so that prospective students and anyone else interested can easily access this information in one place. If you have anything to contribute to this post, DM me, and I will add it.\n\n&gt; ℹ️ I'm not the maintainer of the links — just the post itself. I cannot comment on the technical details and specifics. If you are the maintainer, please DM me and I will credit you. \n\n&gt; ⚠️ **This post is NOT meant for conversations on quality, distribution or other discussions, and only serves as an announcement board**. Use your discretion before commenting.\n\n# CSE\n\n* [2025](https://docs.google.com/spreadsheets/d/1SnSNM_GnuTwIJ0oI3bHt9nAnDQXfqwIhT8JHEwq727g) (updated); also see: [2025](https://docs.google.com/spreadsheets/d/1TfR17y3iPGzHFmCfWGwAXBpwCHvbxEK0wOP_Kx8FOG8/edit?usp=drivesdk) (outdated/unmaintained)\n* [2024](https://docs.google.com/spreadsheets/d/1YZ7HtUcvA9jqWZ04DuwTT66aTV7gU7DUlXyO2BewpII/edit?usp=drivesdk)\n* [2023](https://docs.google.com/spreadsheets/d/1a-eaEBcTeOJESck3f8W_I3uJqRRiEc_7d5O1Xc3nIUg/edit?usp=drivesdk)\n* [2022](https://docs.google.com/spreadsheets/u/0/d/18BzbVvG80LRJ5p2jQdZ446IqL8rUbaEyrGxpOnW2PBY/htmlview#)\n\n# ECE\n\n* [2025](https://docs.google.com/spreadsheets/d/1GN0hXmrWHRGo75Y9vAlBFVkdVYi0lXYoLAncGVhW7CY/edit?usp=sharing)",
  "metadata": {
    "id": "1l16bng",
    "author": "rowlet-owl",
    "url": "https://www.reddit.com/r/PESU/comments/1l16bng/placement_statistics_compilation_2022_to_present/",
    "permalink": "/r/PESU/comments/1l16bng/placement_statistics_compilation_2022_to_present/",
    "score": 90,
    "upvote_ratio": 0.99,
    "created_utc": 1748829893.0,
    "flair": "ANNOUNCEMENT :snoo:",
    "nsfw": false
  },
  "comments": [
    "do they allow mca students to sit with cse for placement for every companies?\n└── Some companies allow\n    ├── do you have any stats for MCA ?\n    │   └── Nope\n    │       └── Can I DM u??\n    │           └── Sure.\n    │               └── Bro there is no option to message u, is it my glitch?? or can u please DM me, if it's working for you\n    │                   └── sent u a message\n    └── how are placements for MCA",
    "Are these the final cgpa cutoffs for shortlisting",
    "Does thie have only cse or cse aiml\n└── If I am correct, the first CS-AIML batch is yet to go into their first placement cycle, since they joined in 2022. Their placement stats will be compiled as part of a future &lt;2026&gt; link.",
    "Thank you very much man !!",
    "According to this ece placements are quite really bad like out of 540 students only 73 are placed, are the placements are still ongoing or some data is missing?\n└── Or somebody has ece placements 2024 stat?\n    └── Sorry, I don't have the information to answer your questions. Usually, its a combined list for IT placements like this one. This post simply aggregates the links.\n        └── I just want to know is ece placements are only this much or there is atleast 50% students get placed whether it be IT or core jobs.",
    "can someone please tell me what FTE means and do the numbers under fte indicate the number of people that are joining the company?\n└── FTE = Full Time Employment. So people who are receiving job offers. The number indicates how many *received* an offer. For obvious reasons, that may not be the *actual* number of people joining the company."
  ]
}