{
  "title": "What can i choose BMS EEE VS PES (EC) AI?",
  "content": "So my kcet ranking is around 8600 so by last year round cut off I get this both which one to choose if not if any better option please comment",
  "metadata": {
    "id": "1l18cxj",
    "author": "CeleryImmediate9415",
    "url": "https://www.reddit.com/r/PESU/comments/1l18cxj/what_can_i_choose_bms_eee_vs_pes_ec_ai/",
    "permalink": "/r/PESU/comments/1l18cxj/what_can_i_choose_bms_eee_vs_pes_ec_ai/",
    "score": 0,
    "upvote_ratio": 0.33,
    "created_utc": 1748836360.0,
    "flair": "Admissions",
    "nsfw": false
  },
  "comments": [
    "You can't compare across branches. Please read the FAQs.\n└── There is general things there which are also available in google not so different though\n\nOhky can't compare the branch why not mann?? \n(Tons of ppl do it every year) \nOhh it requires some effort to comment about it right!!\n    ├── You cannot say branch X is *better* than branch Y because no **universal** **metric** allows you to compare. Different branches lead to different outcomes and careers. How can you compare between a career in CS and a career in ECE? What are your parameters? What are you going to compare against? The nature of work? These are all apples-to-oranges comparisons and they will never make sense. Its like saying a zebra is better than a lion. Based on *what*? We can help you choose between colleges offering the same branch, but a comparison between two branches at two different colleges does not make sense unless you tell us which one interests you more or what are your future plans, at the very least.\n\nAt the end of the day, you should choose the branch you are most interested in. If you cannot figure that out by yourself, you are in the wrong field. Nobody is going to spoonfeed you and make you figure out what you are interested in. \n\n&gt;Tons of ppl do it every year) Ohh it requires some effort to comment about it right!!\n\nAnd yet among the \"tons\" you come to us for help. Don't be smug, especially if *you* are the one who needs assistance to figure out what they like.\n    │   └── I laud ur patience in dealing with losers like this guy.\n    └── well, lets see. we can list out the subjects, but obviously after 1st year(which has common subjects for all), it'll get pretty long. but EEE will have, well, ELECTRICAL &amp; electronics related subjects (power systems, control systems, zap science shit). and well COMPUTER SCIENCE will have, idk, computer stuff - OS, DBMS, and stuff related to computers.\n\nAnd i'm pretty sure everyone knows core jobs don't pay well in the beginning &amp; pay well/equal or more to CS later on. CS jobs tend to have nice pay from start. Of course, both cases have exceptions.\n\nYou can also see how big each batch size, roughly say which has more teachers, and what else do you want to compare?\n\nYou can go on Google and search stuff related to EEE &amp; see where the prospects for that there easily. Or even think for a second, and use better search terms to find company names. Similar thing for CS. \n\nIg some would call it requiring some effort to search about it right!!",
    "if you're not interested in any branch in particular, you should probably choose cs or allied branches.\n\nand i don't know how it works in other colleges, but at pes if you really wanted, you could easily switch to rr ece or worst case ec ece after the first year. just by maintaining a reasonable average cgpa.\n\nbut it is not as easy the other way around. don't join ece thinking you'll switch to cs without a problem"
  ]
}