{
  "title": "What will be the approx. expenditure for my 4y Btech at PES?",
  "content": "Please help me out regarding some of my questions as the placements seems impressive I'm looking to join PES maybe...\n\n1. I am outside KA student so what can be the expenses for my upcoming 4 years at PES? \n\n2. if i didn't paid the fee before councelling for the first round then will i be able to sit for 2nd round of councelling?\n\n3. can i take hostel outside campus like if i wish not to live in university's hostel?\n\n4. do i have to take kannad as a compulsory subject and appear for exams.. as i heard somewhere many colleges in karnataka conduct exams as a compulsory for non-ka students?\n\n5. apart from hostel and any other fee does the annual tution fee increases every year? or it is the same 5lpa per annum i.e. 20 lakhs for 4 years?\n\n6. I have jee percentile 95.18 and pes rank 13xx can i get cse in main campus(ik it's dumb to ask but still...)?\n\nGod always helps the helper... please help out your bro...",
  "metadata": {
    "id": "1l1g1p6",
    "author": "Wizard_1857",
    "url": "https://i.redd.it/dfcgg3n34i4f1.png",
    "permalink": "/r/PESU/comments/1l1g1p6/what_will_be_the_approx_expenditure_for_my_4y/",
    "score": 35,
    "upvote_ratio": 0.97,
    "created_utc": 1748865211.0,
    "flair": "Placements 🤑",
    "nsfw": false
  },
  "comments": [
    "I can answer a few  \n3. Yes you definitely can  \n4. Kannada is not a subject at PES but afaik you need to study it in few other colleges like bms for example  \n6. I don't think seniors would be able to answer this\n└── thanks bhai what would you recommend like taking hostel outside the campus or incampus? are the in-campus hostels strict?\n    └── Sorry I’m a day scholar and not a hostelite so I don’t have knowledge about the hostel\n        └── alright!",
    "Others have been already answered so i will answer these\n\n1)if u get cse its 5.1L per yr thru jeem quota ig and other expenses depend on individual.\n\n2)most probably yes, but not sure.\n\n5)No the annual fee is same for all years for respective batches.\n\n6)cant comment on counselling this yr.\n└── thanks a lot"
  ]
}