{
  "title": "Help in selecting 5th &amp; 6th Semester CSE Electives (comment on both semesters)",
  "content": "Hey folks,\n\nI'm currently in my 4th Sem, B.Tech. CSE, having queries regarding the electives on 5th &amp; 6th semester for the year **2025**. I'm aiming for electives which are easy scoring, lighter on assignments and case studies. But, primarily comparatively easy scoring **ISAs** and **ESA**.\n\nKindly suggest electives in **AI-ML** and **Cybersecurity** which align to the above requirements, because I would like to take a blend of both, not to specialize in one. Do comment on both 5th and 6th semester electives.",
  "metadata": {
    "id": "1l2zq7i",
    "author": "Astute-Dapper",
    "url": "https://www.reddit.com/r/PESU/comments/1l2zq7i/help_in_selecting_5th_6th_semester_cse_electives/",
    "permalink": "/r/PESU/comments/1l2zq7i/help_in_selecting_5th_6th_semester_cse_electives/",
    "score": 13,
    "upvote_ratio": 1.0,
    "created_utc": 1749023292.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "[comment from rowlett](https://www.reddit.com/r/PESU/comments/1dkbkk4/comment/l9gn0j9/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button) , this is a comment from rowlett.  \nSome stuff may have changed but he has explained very nicely how to choose an elective at the end.\n\nExtra Tip : Dont choose an elective JUST because your friend has taken it.\n└── Thank you!!. Really good overview. Just sometimes, 2021 seems a long time ago, things change dramatically in PESU over the years.",
    "If u are taking applied cryptography and cns  then plz take the labs and assignments very seriously as there is heavy plagiarism check in these. Iot and cryptography are the easy electives for e1, for e2 take whatever u are interested in as all are pretty difficult in one way or the other, gta has really o tough isas , moderate esas and ez assignments , others have tough assignments and moderate to tough exams. (Last year we had only big data, cns and gta as choices).\nFor e3 blockchain and digital twin are the easier ones, in e4 info sec and robotics is ez\n└── Thank you very much for your holistic advice.",
    "Brilliant, I'm so proud as a senior to see the students get it by the end of year 2 itself.\n\nIf you know your objectives life is easy (we charge 3 lakh to give this gyan over a weekend to CXO s😂)\n\n- Pick courses which are easily less time taking assignments if you know you aren't here to learn that material. You can at max anyway learn 1-2 courses a semester.\n- Don't take courses , choose/reject the known \"prof\", you want marks that's the profs jobs it has nothing to do with the material of the course.\n- New Courses are always risky. Beware\n- For learning you have the opportunities online offline everywhere. Do those. \n\nYou get into the Interview based on your CGPA so maintain a 7.5/8+ but you'll get hired for your skills(coding) and knowledge (project) so instead of spending 1000 to go from 8.1 to 8.5 use that to go for skills. (My after 8 semesters was 8.007 rounded to 8.0🤣 lucky)\n\nSadly, profs (most) don't know shit about the buzz word subject. After doing my PhD in Generative Algorithm I can say I barely know enough to offer an overview cause it changes so rapidly but cause the university wants a poster for the company they force the profs and they teach you what they learn from YouTube. \nRather go for the source itself, that's also free.\n\nI don't have the list of courses but these general principles shall work. However one suggestion is take at least one course that you like in a term, it helps survive classroom hours.\n└── Sure. I'll indeed take this into consideration. Thank you.",
    "Don't take hci\n├── You should also give an explanation of why. Comments like these aren't helpful to anyone.\n└── Thank you. Can you mention other electives (both 5th &amp; 6th semester) you believe is a strict NO?\n    ├── The reason I said hci is a NO is because although studying hci seems easy don't take it for a gpa boost cause the correction is too strict (there weren't any actual answers to questions in the slides as well , cause the slides literally had no content ..half of it was just pictures ) atleast in our batch and the average grade was C ..\nThe other elective I took was GTA , very interesting if u understand the course , mostly it's easy content , only the last unit is an overdose of theory .. otherwise it's fine ..and there were no projects for us , only 3 hands on sessions of hackerrank and neo4j...It may vary for ur batch \nI can't comment on other electives ..\n    └── In 6th sem I took \nDbt and air \nBoth were easy scoring and projects were easy \nAir the slides are a bit out dated and not organised well ..but content wise both are very easy\n        └── Thanks again!! Really appreciate it.\n            └── If you are really interested and willing to work your ass off for interesting useful subjects Go for Big Data and Data Analytics in Sem 5  \nBut if you want a balance you can take IOT and Big Data  \nIOT is easy on theory ! Don't take HCI People think it's easy and get f'ed as grading is always absolute hardly 1-2 get S Grade\n                └── Thank you very much. I'll indeed look into it, to find the right fit. Could you comment between Big Data v/s CNS, an overview between the two?\n                    └── Both electives are poles apart and totally Different   \nBig Data deals with distributed systems and handling unstructured data   \nCNS will focus on security in network systems   \nTake based on your interest",
    "6th semester scm optimization using ai is an easy S grade \nrobotics is pretty easy with only a few slides and a moderately difficult esa\n└── Thank you for your suggestion. Can you suggest other electives you believe, satisfies the requirements?",
    "5th sem Elective 1 Applied Cryptography has easy ISAs as the syllabus is easy but internals are heavy with labs, case studies and one hackathon \n\n6th sem Elective 4 Database Technologies is easy, there weren't that many assignments and scoring in exams is also not that hard\n└── Thank you for your insightful advice."
  ]
}