{
  "title": "Is 5 lakhs worth it for pes or cet/comedk",
  "content": "So they are asking 5 lakh for admission through. Is pes worth the 5 lakhs or should I go through kcet and comedk.\nI am asking coz some 95+%ilers r choosing pes but wouldn't cet and comedk be better option\nSo shld I consider pes at 5lks or w8 for comedk and cet",
  "metadata": {
    "id": "1l4j8el",
    "author": "channykakarot",
    "url": "https://www.reddit.com/r/PESU/comments/1l4j8el/is_5_lakhs_worth_it_for_pes_or_cetcomedk/",
    "permalink": "/r/PESU/comments/1l4j8el/is_5_lakhs_worth_it_for_pes_or_cetcomedk/",
    "score": 0,
    "upvote_ratio": 0.44,
    "created_utc": 1749182777.0,
    "flair": "Admissions",
    "nsfw": false
  },
  "comments": [
    "Pes does not accept COMEDK score …..if u have a good rank in cet then u can wait …..u can also just book this 5 lakh seat and if u end up getting through cet they will refund the difference\n└── Oh ok...thanks.but 5lks is a huge amount honestly lol.\nYes pes doesn't accept I meant others like msrit bms\n    └── I mean if ur sure that ull get through cet u can think of the 5 lakhs as backup ….it will only be a matter of few weeks before that amount gets refunded",
    "Depends on what options you can get through CET/ComedK.\n\nIMO, 5L is a very high cost for a Bachelor's degree. But if you do not have any option which is similar to PES, you don't really have a choice.\n└── Thank you.",
    "U could try getting a seat through jee main and later if u get the same seat using kcet,they return the difference amount back (this was there in their email)\n\nAnd for 5 lakh i think its little over the bar , but its in the silicon city and placements good too. So if u uv the money go for it.\n├── What if got a seat in ec through jee but might get aiml through cet? It will still be refunded right?\n│   └── Ya they said they will in round 1 counselling. U can entirely choose a new seat\n└── no, not go for it, you can not justify 5 lakhs. any of the top 4 in bangalore will yield to a similar career path so if you're getting any of these thru kcet or comedk you should choose those.",
    "not gonna lie but if you are getting colleges like msrit and bms through cet / comedk it's so much cheaper but its upto you at the end of the day\n├── Yes that's what i was thinking. Thanks\n└── Comedk rank 11.1k any chances?\n    └── comedk isn't accepted anymore its only through kcet / jee mains / management\n        └── I mean any good COMEDK colleges at this rank?\n            └── I don't think cse milega u can try for others"
  ]
}