{
  "title": "5th Semester electives-some questions",
  "content": "Firstly, I'm sorry for asking this even though multiple posts of this has been made in the past.\n\nI'm mainly concerned with Elective-I, as I will be probably going with BD for elective II.\n\n\n\nQ1. Is Advanced Algorithms similar to DAA, with a lot of pseudocodes, or more like DSA with a lot of coding? \n\nQ2. Is the math involved in Data Analytics difficult, and is DA+BD just suicide?\n\nQ3. Is HCI as easy as some people say, as I've seen seniors tell that average grade is either a B or a C\n\nQ4. My CGPA is decent, lower 8, should I go for a more scoring subject like cryptography or something?",
  "metadata": {
    "id": "1l4tx8e",
    "author": "Fantastic_Jelly_1582",
    "url": "https://www.reddit.com/r/PESU/comments/1l4tx8e/5th_semester_electivessome_questions/",
    "permalink": "/r/PESU/comments/1l4tx8e/5th_semester_electivessome_questions/",
    "score": 24,
    "upvote_ratio": 1.0,
    "created_utc": 1749220348.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "&gt;Q1. Is Advanced Algorithms similar to DAA, with a lot of pseudocodes, or more like DSA with a lot of coding?\n\nSimilar in structure to DAA, at least that is how it used to be. It's practically DAA 2.0 in every sense. More focus on algorithms than the implementation, although that is tested through assignments.\n\n&gt;Q2. Is the math involved in Data Analytics difficult, and is DA+BD just suicide?\n\nWouldn't say its difficult. You can go through the syllabus. Unless the syllabus has changed, there is a good chunk of stats, probability and analytics stuff. Some bits of ML too. I don't think BD+DA is suicide, many take it every year - but it is definitely a hectic combination. Having prior interest does make it easier to manage.\n\n&gt;Q3. Is HCI as easy as some people say, as I've seen seniors tell that average grade is either a B or a C\n\nHCI is one of those courses that swings between very easy and very difficult every year. Some batches have had it extremely straightforward to score, some batches have had it really bad. Its a mostly theoretical course, so its purely based on memorisation. There is not much needed in terms of conceptual understanding. The slides are also pretty bad. I would not recommend this, since this course is difficult to predict.\n\n&gt;Q4. My CGPA is decent, lower 8, should I go for a more scoring subject like cryptography or something?\n\nLower 8 is fine. I'd say go for electives you are interested in. Pick ones you want to study or want to pursue a career in. No point paying so much every sem just to not study what you like. Besides, odds are, you will end up doing better in courses you are interested in rather than courses you do not like.\n├── The goat🙏 Thanks man\n└── I had doubt in Advance algorithm and data analytics.\nI heard in accordance with placements pov adv algo is the most helpfull but it's hard. I am confused between these two . I have a pretty good gpa ,so can u suggest which will be better .\nElective -2 which I will be opting is BD\n    └── Pick the one you are most interested in. That's all I would say. If you don't have an inclination towards either, pick the one that could potentially benefit your career. As you said, AA will help you during placements, so that's another factor to consider.\n        └── Oh thanks 🙏",
    "Q1. AA is more similar to DAA than DSA as you wont be learning about any specific structure but using them to optimize performance for widly used algorithms. Assignments are coding but you already have pseudo code with you so its not hard at all. Really good course and easy to score too, depends on prof though.\n\nQ4. You should take what you like , AA was something i knew i'd love and honestly best decision ever. 🙏\n\nQ3. my friends had a really bad time with this course , take that as you will (Courtesy of NVP)\n└── Thank you so much man",
    "Q1. Is Advanced Algorithms similar to DAA, with a lot of pseudocodes, or more like DSA with a lot of coding?\n\n\\* Advanced Algorithms deals with DAA but on a higher level you will be learning about lots of algorithms with maths ! So take it only if your foundation with DAA is good \n\nQ2. Is the math involved in Data Analytics difficult, and is DA+BD just suicide?\n\n\\* There isn't a lot of math involved ! You have to focus on the material provided   \nI got S grade in both DA &amp; BD and tell you that its tough because of the assignments &amp; projects. But ESA &amp; ISA will be easy to medium !   \nDA Evaluation Policy \n\nISA - 30 Marks (40 scaled down to 15) - ISA 1 ISA 2 \n\nESA - 50 marks (100 scaled down to 50)\n\nMini Hackathon - 5 marks (Unit 1 &amp; Unit 2 Exploratory Data Analysis and Regression Analysis)\n\nMajor Hackathon - 5 marks (Unit 3 Time Series Analysis)\n\nHandson Worksheets - 8 marks (2 marks 4 Handson for each Unit) \n\n  \nBig Data Evaluation Policy \n\nISA - 30 Marks (40 scaled down to 15) - ISA 1 ISA 2 \n\nESA - 50 marks (100 scaled down to 50)\n\nAssignments - 10 marks ( 2 assignments)\n\nMini Project - 10 marks with viva \n\nBut ESA &amp; ISA will be easy !! \n\nQ3. Is HCI as easy as some people say, as I've seen seniors tell that average grade is either a B or a C\n\nShort and sweet answer AVOID HCI Anchor is the worst guy !! He always grades absolutely and most of them land with C \n\nQ4. My CGPA is decent, lower 8, should I go for a more scoring subject like cryptography or something?\n\nCryptography isn't scoring my friend !! \n\nTake subjects you love and are interested in ! Don't focus on scoring myth \n\nSCORING SUBJECTS ARE THOSE WHICH YOU LOVE AND BELIEVE YOU WILL STUDY HARD FOR \n\nTAKE THIS ADVICE SERIOUSLY AND TAKE ONLY COURSES YOU LOVE I TOOK THE HARDEST 4 electives in sem 5 and sem 6 landed up with all A's and S's",
    "Q4-\nIf i had to do my elective selection over again , i would chose scoring courses in sem6 rather than sem 5.\nThe 3 compulsory courses of sem6 are harder than the 3 in sem 5",
    "Advanced algorithms was cancelled in ec campus last year so keep a backup in mind just in case"
  ]
}