{
  "title": "Is PES Hostel Good or Should I Go for a PG? Need Advice",
  "content": "I'm joining PES University this year and trying to decide between staying in the PES hostel or finding a PG nearby.\n\nI've heard mixed opinions, so I wanted to ask here:\n\nHow are the hostel facilities? (rooms, food, WiFi, rules, etc.)\n\nIs it too strict?\n\nIs the food manageable?\n\nHow's the overall vibe for students?\n\nOr is it better to take a nearby PG for more freedom and better comfort?\n\nAny tips, suggestions, or personal experiences would really help me decide!",
  "metadata": {
    "id": "1l4xdai",
    "author": "Interesting-Cod-1802",
    "url": "https://www.reddit.com/r/PESU/comments/1l4xdai/is_pes_hostel_good_or_should_i_go_for_a_pg_need/",
    "permalink": "/r/PESU/comments/1l4xdai/is_pes_hostel_good_or_should_i_go_for_a_pg_need/",
    "score": 7,
    "upvote_ratio": 0.9,
    "created_utc": 1749228790.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "Rooms - great if you get a good block like New Block or NBX ( high chance if ur from outside blr )\n\nWifi - actually kinda good in hostels. Use VPN\n\nRules - Nothing strict is actively followed . Just return to the hostel before 10pm and don't do drugs , ull be fine.\n\nNah its not too strict , theres enough scope and loopholes to do pretty much everything\n\nThe food is great personally. There's 3 messes - South Indian , North Indian and mixed. You can definitely find one of the messes to your liking ( Food Court is my preferred mess )\n\nOverall vibe is honestly decent. We have our fair share of fun during events like new year , ipls , finals' , etc etc\n\nPGs can be slightly inconvenient but they do definitely offer freedom.\n├── Hey! Is the curfew 10 pm for EC campus as well? Couldn't find info on it :/\n│   └── They take attendance from 9-10 in RR so u can return by 10pm max. No clue about ec honestly\n├── What is the process to get hostel. I am not living in Karnataka. Once I pay fees for academics, where or how to start process to book hostel\n├── how is the IT block hostel?\n│   └── It's okay. Not as good as the new blocks and it doesent have attached bathrooms but its cheaper and manageable\n│       └── At the time of joining do they put all into IT block or can we choose going for new block as well?\n│           └── At the time of joining theres a priority list based on how early you paid/ sometimes even where ur coming from ( outside blr or local resident )... So you can choose New block as well but it gets filled pretty fast.\n└── Are there single rooms or only shared rooms\n    └── Both types of rooms exist but mostly as a fresher you'll only get a 2 sharing , 3 sharing or more room\n        └── I have taken admission in MCA, I saw that btech classes started on 23rd Sep last year? I think MCA classes would also start at the same time?  \nAlso, If classes start in September, the year still ends in like July right? and then 2 months vacation?",
    "For ec campus you don’t get hostel inside the campus, it’s like 7km away in amaatra academy, the timings are 7pm which is strict for girls and a bit flexible for guys, the warden the best you’ll ever see and that’s the best thing about this hostel, rest food is okayish network doesn’t come especially Jio like zero in some rooms you can’t even make or receive a call. The crowd is decent but it’s mostly on luck who you find immediately but you’ll settle down sooner or later. Objectively PG is a better option but I personally like it here\n├── is the curfew 7pm in 2nd year as well (campus hostel)? Also do yall get to go out on weekends and stuff (not long trips)?\n│   └── In second year it’s 10PM and you can take a vac for however long you want AS LONG AS YOU HAVE A WRITTEN LEAVE application signed by your parents with a message from your parents that they know about you going\n└── Is the hostel 7km away for 1st year students only ? Or for all year students.\n    └── 1st years only, The Amaatra academy hostel\n        └── From 2nd year onwards how many people will be there in a single room ?\n            └── 3",
    "I would suggest joining a hostel if you get the attached bathroom ones or else you can look for pgs"
  ]
}