{
  "title": "5th sem electives is DA+GTA good combo",
  "content": "I have gone through the faqs and there is a lot of new options this year I wanted to know if graph and data analytics a good combo , yes I find maths easy ",
  "metadata": {
    "id": "1l50uai",
    "author": "darksage_69",
    "url": "https://www.reddit.com/r/PESU/comments/1l50uai/5th_sem_electives_is_dagta_good_combo/",
    "permalink": "/r/PESU/comments/1l50uai/5th_sem_electives_is_dagta_good_combo/",
    "score": 12,
    "upvote_ratio": 1.0,
    "created_utc": 1749237238.0,
    "flair": "Study Help :table:",
    "nsfw": false
  },
  "comments": [
    "DA- Hectic bcz of hackathons and assignments, ISAs were okayish not difficult, ESA most of us got rodded. Balanced difficulty across the units, nothing is math heavy, they even spoil the formulas at times in the question itself.\n\nGTA - Assignments are peaceful , ISAs and ESA were hard but mostly it was relatively graded. Last part of GTA is wayyy to theoretical but that's interesting to read about, algorithms in GTA would be useful during DSA Prep\n\n\nBoth should be helpful in placements/ capstone project\n\nOverall, Good Combo IMO\n├── Thanks a lot\n└── Last year's gta's esa was easy. Isa's were a little tough but they were scaled down to 15 each so no worries. And the rest 20 is all assignments, hackerrank etc.",
    "Yeah DA + GTA is good ! Would recommend DA +BD though as BD is more useful than GTA\n└── Isn't that insanely hard cus the volume is a lot for both courses\n    ├── BD is not voluminous \nThe slides are small and theory is damn easy. But assignments will take 1 week each and project will take 2 to 3 weeks. Theory is easy not overwhelming but assignments will be hard. \nIf you are average or above average student take it up. \n\n\nDA is voluminous and lot of math going on but they don't ask all that \nThey'll inform you what Equations and numericals will be asked \n    └── DA is essentially SDS (or MCSE for you) Pro Max. Keep practicing the numericals and you'll be fine. BD is very theory heavy, so some mugging up is needed. ISAs and ESA are very easy but you get absolutely fucked in the assignments and mini-project."
  ]
}