{
  "title": "does this mean there will be no vacant seats for CSE at RR campus in Round 2 of jee mains councelling?",
  "content": "my PES rank was 13xx and I could have got cse at RR but I didn't paid the councelling fee for Round 1 so in round 2 will there be any seat for RR campus CSE or just the we can get the remaining seats? like what i'm asking is assume there is 720 seats for cse at rr so all the seats got filled atm? or they fix some sort of seats like assume 300 out of 720 seats for Round 1 and then remaining for R-2... I'm asking only for the non-reserved seats i.e. seats through jee mains only not KCET...",
  "metadata": {
    "id": "1l5i4yk",
    "author": "Wizard_1857",
    "url": "https://i.redd.it/iktv4eokkh5f1.jpeg",
    "permalink": "/r/PESU/comments/1l5i4yk/does_this_mean_there_will_be_no_vacant_seats_for/",
    "score": 32,
    "upvote_ratio": 0.91,
    "created_utc": 1749293869.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "If some people who have kept these seats as backup and end up getting their seats might leave so in 2 round some seats are definitely empty nothing wrong in not going, last year many of my friends wanted to join but though their rank is too large and did not even come to concealing and regretted it later\n└── https://preview.redd.it/dhkbtrakmh5f1.jpeg?width=1650&amp;format=pjpg&amp;auto=webp&amp;s=976d154769d921696de89ed3d21c057ae9c658f0\n\nbut in ring road only cse has 720 seats out of which this round was conducted dor 320 seats only considering half the seats for KCET because this year 50% jee mains+ 50% KCET seats makes 640 seats so ig there will be good chunk of vacant seats for round 2 too...\n    ├── You're forgetting to count management seats\n    ├── The remaining 80 or so seats will be for management quota, plus they need to keep some spare for lateral entry also I assume\n    └── no bro it is 40% kea seats , 45% pes counselling seats (both KCET and jee ) and 15% management and nri",
    "i think they are filled, i attended the online counselling today (session-2) and by then only the seat count of cse at rr was 0 so the best branch I could choose was cse+aiml",
    "Can anyone let me know what percentile gets you what rank roughly\n└── 97.5%ile \\~ 750-800\n\n95.2%ile \\~ 1300\n\n91.2%ile \\~ 2550\n    ├── It's unfortunate pes is run by a bunch of muppets, a lot more people would be interested if they didn't do the \"pay before seat allotment\" bs\n    ├── 94.3 \\~ 164x\n    └── bruh so pes ec ece is taken by people at 85%ile, thats it ah.",
    "same problem, didn’t pay counselling fee rank for round 1 :/",
    "seat intake mentioned in their website is also 320 so they considered all the seats for round 1... but the thing is that many ppl will withdraw the seat who got a better seat elsewhere...\n└── During my batch there were only a handful of RR CSE seats left during the 2nd round, I think it was 5 or 6, but again, very few\n    └── last year many seats were vacant and cutoff's dropped significantly.. so its unpredictable ig\n        └── Ohhh, didn't know about that, mb\nBut personally, I wouldn't risk waiting it out for the 2nd round, just my two cents about this",
    "I didn’t attend Round 1 in PES JEE counseling. Is there round2 planned? I am looking for CSE’25",
    "reply bhi do mai koi youtuber nhi jo like kar ke aage badh jaa rhe ho 🥀\n└── Hahaha\nI would but I didn't submit my jee scores \n\nI'll get seat thought kcet ,liked for more reach so more people can see and solve ur issue"
  ]
}