{
  "title": "Please helpe choose a college",
  "content": "Pes (ec), rvce, msrit, which college would you recommend to join for cse. I was most convinced to join pes but looking through the reddit, i feel the college is very strict and hectic, I also heard also heard about the high sucide rates. I want to join a good college and don't wanna ruin my life, please help!",
  "metadata": {
    "id": "1l5rh33",
    "author": "ComfortableJaguar479",
    "url": "https://www.reddit.com/r/PESU/comments/1l5rh33/please_helpe_choose_a_college/",
    "permalink": "/r/PESU/comments/1l5rh33/please_helpe_choose_a_college/",
    "score": 5,
    "upvote_ratio": 0.86,
    "created_utc": 1749320384.0,
    "flair": "Admissions",
    "nsfw": false
  },
  "comments": [
    "This question has been asked and answered a morbillion times now. \n\nAnd the world's best search engine is free to use. How about you give it a shot\n└── I have been doing this for days, but answers contradict from reddit to reddit, i have heard people say it's unbearable there which is really scary. I could really use your guidance\n    └── Read the multiple posts and comments on this sub on this topic and form your own opinion. We're not here to make the decision for you. All we can do is provide you the facts. Use the facts and decide for yourself. \n\nWe've already said multiple times, RVCE &gt; PES &gt; MSRIT for CS. Now use this info to your advantage and take a call.\n        └── Ohk thank you bhaiya",
    "All of em are strict and hectic ..good luck",
    "RVCE CSE &gt; PES RR CSE &gt; MSRIT CSE\n├── Well this is really embarrassing to say but I really messed up my 12th, all of these are through management, my parents won't let me take drop, is rv management really worth it.\n│   ├── Nothing to be embarrassed about, once you get in it's a fresh start my guy\n│   │   └── Thank you bhaiya, that really helped me feel better.\n│   │       └── Oh yeah the relief u feel in college is soo good.\n│   └── Brother if ur going management …it’s prolly too late to get any of these colleges as management seats might be over …..reach out to em as quickly as possible\n└── EC == RR  \nthere is no difference, no way in hell is msrit better then EC",
    "If u get rvce take it, else come to PES, every college  has suicides, there has not been anything since i have joined dw.   \nbtw just so uk, rvce, msrit are more strict in many aspects, nobody talks about it thats, my friends in RVCE talk about how hectic it is too."
  ]
}