{
  "title": "Help me choose electives (CSE Sem 5)",
  "content": "So according to my research on reddit and discord i got to know that the easiest available electives are GT and CNS for e2. But for e1 there is no definite answer it is mostly AC,IOT and HCI. But people said HCI is hard to score but the syllabus is easy so im confused.\n\nCan seniors please describe these 4 subjects how those subjects are, how are ISA/ESAs , projects etc and help me choose easy electives cause my gpa is low and i wanna hit 8 cgpa by the end of sem 6\n\n(Referred Rowlet's comment but posting this again cause many ppl told for some elcectives syllabus has been changed, i wasnt sure for which subs  \nAlso there are similar posts like this but none of them describe briefly about ISA/ESAs and projects so had to post it again)",
  "metadata": {
    "id": "1l64jxw",
    "author": "PYUchiha7",
    "url": "https://www.reddit.com/r/PESU/comments/1l64jxw/help_me_choose_electives_cse_sem_5/",
    "permalink": "/r/PESU/comments/1l64jxw/help_me_choose_electives_cse_sem_5/",
    "score": 16,
    "upvote_ratio": 1.0,
    "created_utc": 1749360298.0,
    "flair": "Study Help :table:",
    "nsfw": false
  },
  "comments": [
    "Ac is easy if u do well in labs, assignments and hackathon as isas have only weightage of 10 marks each , and esa was scaled down to 40 for us so all other components had weightage of 60 for our batch with isas being only 20 so with such large weightage there is a lot of plagiarism check. \nIot is mostly theory and is an easy subject from what I heard from friends and people did much better than hci in it. Cns has a similar marking scheme like AC but has tough isas. Gta has quite difficult isas , moderate esas and ez assignments. I would suggest u to take whatever interests u for e2 especially as all subjects are difficult in 1 way or the other( if u get offered only bd, cns and gta as choices like us)\n└── Thankyou.Also on what priority are electives given to people, fcfs or gpa?\n    └── U will get what u want if u just fill the form . They will create multiple sections for most electives\n        └── Is it ok if I dm you?\n            └── Yeah",
    "AC and CNS are the easiest one's, but a lot of labs and assignments. \n\nBut it's most definitely a guaranteed A grade at least in both if you put in decent work.\n└── Whats ur take GTA/CNS and why\n    └── CNS, no stress for any exams at all, pretty much a guaranteed A grade, if Preeth Kanwal ma'am is the teacher then half the learning happens in class itself. \n\nIk some of my friends who took GT and kinda struggled for the esas, many ended up with a B.\n        └── What if we have a different faculty and not preet mam ?\n            └── Who is the teacher?\n                └── They will tell it later itseems,no info as of now."
  ]
}