{
  "title": "Questions regarding EEE course work in PES",
  "content": "I attended the councelling yesterday and chose EEE. I wanted either that or ECE, but yea.I settled with EEE.\n\nUnfortunately, Pes doesn't have a syllabus/coursework regarding EEE on their website. \nCan anyone tell me what the course includes? Should I continue with EEE in PES or try someplace else?",
  "metadata": {
    "id": "1l65or2",
    "author": "Gullible_Page3526",
    "url": "https://www.reddit.com/r/PESU/comments/1l65or2/questions_regarding_eee_course_work_in_pes/",
    "permalink": "/r/PESU/comments/1l65or2/questions_regarding_eee_course_work_in_pes/",
    "score": 5,
    "upvote_ratio": 1.0,
    "created_utc": 1749364773.0,
    "flair": "Admissions",
    "nsfw": false
  },
  "comments": [
    "Hello! The first year(sem1&amp;2) will be common for everyone across branches. It will be from the second year(sem3) onwards that you will get into your core branch. If you've chosen EEE out of passion, it should pretty good experience. Though, there are many who call it the toghest B. Tech course. The EEE faculty is mixed with some being very good while others dogshit, but overall manageable. These are the courses for sem3 to give you an idea. Please reach out for any more q's.\n\nhttps://preview.redd.it/x5a9nejunn5f1.png?width=1940&amp;format=png&amp;auto=webp&amp;s=dc631ed7ac6d545a7589cdd7316669c321e2d37f\n├── Thank you so much!\n│   └── What was ur jee percentile to get their do uh think i would make it with 75 percentile?\n│       └── I got 91 percentile. I don't know about 75, but I have a friend who got in with 81 percentile\n│           └── If uh would have told me earlier their might be chances but now pretty late uhh\n│               └── Welp. Sorry...\n├── Oh and, another question. What do you suggest I do/participate in other than the usual classes?\n│   └── There are quite a number of clubs in the RR campus where EEE is, I'd suggest looking at the discord for more, though they dont do a lot of stuff.\n└── is doing eee bad if i want to study further in something electronics related? would taking ec be better generally?\n    └── If you do pursue ECE then be prepared to study a lot of communication related topics like signal processing, transducers along with some electronics for that. If you dont have an incline towards that but still like the electronics part along with electrical too then go for EEE.\n        └── which course is better if i wanna study further in anything(say embedded) as i dont really know what my interest is as of now\n            └── If you ask me i would vouch for eee any day over ece. More project possibilities and tinkering too, your interests will develop over the sems.\n                └── but the eee syllabus lacked vlsi+embedded as core subjects so im a bit skeptical\n                    └── Both courses offered in the 3rd year. Ultimately, its upto you\n                        └── thanks for answering"
  ]
}