{
  "title": "doubts reguarding cse aiml in rr campus (already took admission)",
  "content": "could seniors please help out and answer a few questions\n\n1. faculty...are they good?...any tips reguarding specific faculties?\n\n2. do we get the same facilities as the normal cse students, the hackathons etc etc?\n\n3. how to maintain good cgpa?\n\n4. how to apply, or prepare for interships from 1st year?\n\n5. the programming language that would help me the most in this field, and the resources i can use to learn them?\n\n6. how is the situation on drugs and drinks? (not in hostel)\n\n7. how is general college life, gender discrimination, caste, sports.\n\nthansk for the help",
  "metadata": {
    "id": "1l69vxa",
    "author": "Opposite_Antelope804",
    "url": "https://www.reddit.com/r/PESU/comments/1l69vxa/doubts_reguarding_cse_aiml_in_rr_campus_already/",
    "permalink": "/r/PESU/comments/1l69vxa/doubts_reguarding_cse_aiml_in_rr_campus_already/",
    "score": 7,
    "upvote_ratio": 0.82,
    "created_utc": 1749381884.0,
    "flair": "Study Help :table:",
    "nsfw": false
  },
  "comments": [
    "\n1. faculty...are they good?...any tips reguarding specific faculties?\n\nFaculty is average, but friendly and approachable. Just make sure not to piss off any prof too much.\n\n2. do we get the same facilities as the normal cse students, the hackathons etc etc?\n\nMost hackathons are just conducted by clubs and they're usually open to everyone irrespective of their course\n\n3. how to maintain good cgpa?\n\nJust study well, don't ignore internals (isa), there will be no 2nd chances. Make the best out of your 1st year to score a good cgpa bcoz shit gets hard from then.\n\n4. how to apply, or prepare for interships from 1st year?\n\nYou'll have python and C programming in first year, shud be a good starting ground to get started with programming. Just get good with these, try to understand DSA. Either way you'll have DSA in 3rd sem. Unless you're really good at something, 1st years are usually not considered for internships.\n\n5. the programming language that would help me the most in this field, and the resources i can use to learn them?\n\nAI/ML relies on python mainly. tensorflow or pytorch, scipy, pandas, matplotlib libraries. YouTube is the best free resource for everything (freecodecamp, corewithharry, brocode, javascript mastery, programming with mosh etc)\n\n6. how is the situation on drugs and drinks? (not in hostel)\n\nYou can find it if you really try, but the situation isn't bad.\n\n7. how is general college life, gender discrimination, caste, sports.\n\nHow much you enjoy college depends on you and your friends. If you're really worried about gender and caste discrimination in 2025, you deff come from a shitty place (answer is no). Sports is non existent.  It'll be very hard to prove yourself but you can get into the clg team. Sports facility is available for u to use anytime and tournaments do happen every year.",
    "Uh wernt you supposed to enquire about all this before taking admission?\n└── i mean no shit, but i had no other option!\n\ncomedk 6k rank\n\nkcet 19k (becus boards only 77%)\n\njee mains 79k\n\nso i had no other option left\n    └── did u join thr mains?",
    "1. The faculty are good.\n\n2. Yes, any AIML student can participate in hackathons conducted by CS dept\n\n3. By studying\n\n4. By upskilling yourself\n\n6. ???\n\n7. I dont know why youre asking discriminations about caste gender in 2025",
    "1) Mixed  , some good some bad.  \n2) Tech Events are mostly open to everyone  \n3) Listen to class atleast if your not able to come home and revise everyday. Try to be consistent throughout the semester and avoid just studying 2 to 3 days before exams. For detailed answer check [FAQs](https://www.reddit.com/r/PESU/comments/14c1iym/faqs/) or search the sub.  \n4) wow buddy , calm down there. First figure out what you want to do. Get your hands dirty first, Find what domain your interested in. As a fresher [MIT's missing semester](https://missing.csail.mit.edu/) and [cs50](https://www.youtube.com/watch?v=3LPJfIKxwWc&amp;list=PLhQjrBD2T381WAHyx1pq-sBfykqMBI7V4) is the best way to get started.  \nMost companies looking for internship look for a prior experience of you working in any project or Anywhere in general. Make sure to have projects that aligns with what your interested in and mostly ppl get internships after 2nd year, but make sure you know what your doing.  \n5) programming languages depends on what you want to learn , figure out what your interested in. Many start with python and c.  \n6) Honestly No clue  \n7) Nobody gives a damn bro, No discrimination of any kind. College life depends on you, how your friend circle is , How you participate in the Tech events, networking etc.",
    "1. faculty...are they good?...any tips reguarding specific faculties? Ans: depends on luck, some are great some suck.\n2. do we get the same facilities as the normal cse students, the hackathons etc etc? Ans: yes everything is same, absolutely no bias towards them, if anything we get easier end sem papers lol\n3. how to maintain good cgpa? Ans: 28 Days before an ISA, yes, ISA make a planner to finish studying for it before ISAs even start, the day before ISAs should be for revision, not for learning something new.\n4. how to apply, or prepare for interships from 1st year? Ans: You don't need to apply to internships in 1st year, try getting thru Physics and both math subjects in sem1/2 without crying, that's more than enough. Prep from 2nd year should be good, 1/2nd yrs are not even eligible for industry internships\n5. the programming language that would help me the most in this field, and the resources i can use to learn them? Ans: python is ur holy grail, know every nitpicky detail, its a beautiful language and has the best shortcuts to solve problems\n6. how is the situation on drugs and drinks? (not in hostel) Ans: Drugs very hard to find, Drinks are not even allowed in campus. But you'll find many people to drink w, if ur into allat\n7. how is general college life, gender discrimination, caste, sports. Ans: College life depends on ur friend circle, don't make one big group w lots of girls n guys, will fall apart in 2 sems, trust me. Gender discrimination is none, caste also haven't seen much. Btech students are suffering with academics only, you won't have time from 2nd yr to use all the amazing facilities we have. pls make the most of all the courts when ur in 1st yr, but not too much cus if gpa frops first yr, vv hard to get it up before placements start, i have friends in situations where even getting all 10s will not let them sit for all high paying good companies, only the low paying, mass hirirng ones they can sit for. Hope i helped."
  ]
}