{
  "title": "Is it worth joining this college??",
  "content": "Based on this year's placements record i feel that its not so good because the number of students who are getting placed are less but the intake is getting more.\n\nIam thinking about joining this college cs rr campus should I join it??\n\nI will be getting nie also whose placement record is pretty good this year's what should I do please reply......",
  "metadata": {
    "id": "1l76o8j",
    "author": "West-Mongoose-4871",
    "url": "https://www.reddit.com/r/PESU/comments/1l76o8j/is_it_worth_joining_this_college/",
    "permalink": "/r/PESU/comments/1l76o8j/is_it_worth_joining_this_college/",
    "score": 0,
    "upvote_ratio": 0.41,
    "created_utc": 1749480335.0,
    "flair": "Admissions",
    "nsfw": false
  },
  "comments": [
    "wherever you go you have to work hard on your own to get placemet, and do your own shit, unless you're getting in bits or iit or top nits\n\nit depends on you where you want to go, it doesnt matter\n└── What about placement records??\n    ├── Blud if u are so sure about ur decision then why bother asking here\n    ├── bhai the average is 12-13 lpa...\n\nbut if you want to be average dont join!\n    │   ├── What's the median ?\n    │   │   └── https://preview.redd.it/elzrxmlglx5f1.png?width=1599&amp;format=png&amp;auto=webp&amp;s=83cafb9cd8670deacca86f3b7808d661f231b2e5\n    │   │       └── Nicee\n    │   └── Oh ok\n    └── They are good",
    "Shush",
    "No\n└── Can you say why??\n    └── The first paragraph of your post",
    "Bruh median is around 12 ….how is it bad?",
    "If you think T1 average ctc of 18.5 lpa ( \\~60 % of placed students in tier1 ) is less and 12.8 overall median ( all branches ) is less then you should target only bits/nit/iit's\n\nIf you're not getting those then I don't see why you wouldn't join for the sole reason of 'bad placements'",
    "https://preview.redd.it/fus8a1vo2y5f1.png?width=958&amp;format=png&amp;auto=webp&amp;s=73769a4b1821720877a8c9d6ac95a431fbd60bad\n\nisnt this data wrong 😭?\n└── highest is 65 , average is wrong. Also These websites are bad way to get the exact records. Its better to ask someone whose already in that college.",
    "The placement stats are not extrodinary , but at the same time they are \"not bad\". Also like someone mentioned wherever you go , you will need to put in work on your own to get placed. Its not something you get just by looking at records and just joining the college."
  ]
}