{
  "title": "Guys help me choose a college",
  "content": "I'm from Bengaluru and will probably clear KCET cutoff\n\n[View Poll](https://www.reddit.com/poll/1l8pxou)",
  "metadata": {
    "id": "1l8pxou",
    "author": "Pythagorean_Triplet",
    "url": "https://www.reddit.com/r/PESU/comments/1l8pxou/guys_help_me_choose_a_college/",
    "permalink": "/r/PESU/comments/1l8pxou/guys_help_me_choose_a_college/",
    "score": 5,
    "upvote_ratio": 0.78,
    "created_utc": 1749640427.0,
    "flair": "Admissions",
    "nsfw": false
  },
  "comments": [
    "Join NIT K if you’re interested in mech, \nJoin RVCE otherwise (for cse)\n└── Not really interested in mech, mainly want good placement",
    "was in the exact same position before, didnt really wanna do mech and was getting cyber sec in rv so chose rr cse",
    "Tf u comparing mech and cse for?",
    "Pick the best college in your options which gives you your preferred branch. Judging by the options, it's CS. So pick RVCE CS. But core CS is better than CS spec. So I'd put RVCE CS &gt; PES CS &gt; RVCE CS+spec\n└── This is  delusional btw ,pick RVCE Cs spec above PES\n    ├── How many of those spec batches have even had a batch graduate, idk about u but i wont join some course that has no graduates till now.\n    ├── give your reasons why RV + CS Spec to be above PES CSE\n    └── Firstly, idk why you are masquerading as someone who is a PESU graduate when you clearly aren't? Secondly, why don't you share your reasons if you think I am \"delusional\"? If you want to know my reasons, they have been discussed in detail already in the FAQs on this sub. Your comment just shows how misinformed you are about how the industry works.\n        └── Yeah my flair was wrong ,but i do have a 3rd year friend in PES ,He said It's getting bad ,200 People in EC did not get any internship (Even Core) ,Intake is sky high ,Fees is huge if not through KCET, RV is 100X better, + peer group will be mostly good in RV since the cutoffs of CS spec is so Low\n            └── Honestly I’d pick RVCE CSE + spec over PESU CSE too but that’s just me\n                └── PESU CSE literally Closed at 2200 ,That too in round 1 ,Thats like 92 percentile,  \nBy the rate at which rowlet owl is active here ,I wouldn't be surprised if he's either paid or working with PES management\n                    ├── Lmao trust me kid, I've got way better things to do than work with PESU management to advertise this place. My opinions are nothing but neutral and my own, after observing things around me. I've praised PES where it deserves credit and also been harshly critical where needed. \n\nI've spent time in the industry, including being in the hiring process, as well as with grad school admissions. I might not know everything, but I do know a fair share about how things work in the real world, which you are yet to see. Your sample size is limited to what you hear from your friends, my sample size is based on how the industry and the world works - big difference. \n\nYou're free to have your own opinions shaped by what you know, but discrediting mine does not get you anywhere.\n                    └── Bruh\n                        └── you are in first year ,Also this is PES sub so i understand if you don't like what i say about your college\n                            └── you're not even from pes bro. I think we both are on equal grounds atleast"
  ]
}