{
  "title": "To all the folks comparing rvce/manipal/pes",
  "content": "If you're a high performing student (8.75+/9+ cgpa and good skills) then rvce cse/manipal Main Campus CSE/pes rr campus cse is literally one and the same for you, because YOU are going to get placed based on your accolades not your college tag, these aren't iit/nit to get placed on tag, these colleges are more of opportunity bringers to people like you who will work hard and get placed.",
  "metadata": {
    "id": "1l8tafw",
    "author": "Sad_Ticket_8800",
    "url": "https://www.reddit.com/r/PESU/comments/1l8tafw/to_all_the_folks_comparing_rvcemanipalpes/",
    "permalink": "/r/PESU/comments/1l8tafw/to_all_the_folks_comparing_rvcemanipalpes/",
    "score": 76,
    "upvote_ratio": 0.99,
    "created_utc": 1749650072.0,
    "flair": "Admissions",
    "nsfw": false
  },
  "comments": [
    "\\+1",
    "does PES and RV have an added advantage cuz of its location, in terms of placement\n└── not entirely true cause there are many engineering colleges in bangalore that are behind in terms of placement...",
    "Why left ec campus when the FAQs say that RR has no edge over EC ?\n└── they all say that, but you can't ignore the fact that RR peeps get better placements than EC, that isn't because they're offered better packages, companies can't even see ur campus, it's just that quality of intake RR&gt;EC and RR students more competent (these words are said by Dean of Placements himself a couple of months ago)\n    ├── Then your differentiator has no basis. You can't say RR campus gets better placements compared to EC. It's entirely dependent on the student since the opportunities are the same. \n\nBeing in RR or EC does not affect your placements. Your own skills (and not your peer group) will affect your placements. Don't mislead people here.\n    │   └── Sorry if it came off as misleading, It completely depends on the student as rowlet said\n    │       └── You explicitly said \"RR peeps get better placements than EC\" and did not mention the EC campus in your original post. You can deny it all you want, but your inherent campus bias is very evident. \n\nYour words are very misleading. Be cautious when expressing your opinions.\n    └── But if you stand out amongst the e city crowd and commit to self studies,there is ideally no reason why you wouldn't get a good placement since placements are literally unified.",
    "Incoming students cant really know if they'll be a high-performing student in engineering\n└── Fair, but your prior academial prowess can be a good indicator\n    └── Only true to an extent. I know plenty of people who have scored below me in 11th and 12th in the same board but have much higher CGPA than me. I also know the vice-versa exists",
    "Should have added thapar too",
    "but arent rvce placements much better compared to pes and manipal?\n├── It might be better but the point op is trying to make is that if ur a top student in any of these colleges u will get similar placements\n│   └── Yessir\n└── Yk why? RVCE has ONLY/LESS quality intake, pes/manipal has quality intake + few ppl who aren't very smart thru mgmt in pes/NRI quota in manipal so ofc rvce has a better avg cus nobody is bringing their avg down unlike pes/manipal"
  ]
}