{
  "title": "Questions regarding Round 1 counselling 2025",
  "content": "People who attended counselling on 7th June, has there been any updates on how many seats remain in all the branches on the two campuses after R1 session 3 counselling? I want to know if all the seats are already taken, which helps me to decide whether I should participate in Round 2 counselling or not.\n\nIf not then can you atleast tell me whether the eee/biotech/mechanical seats are already taken?",
  "metadata": {
    "id": "1l9jwdz",
    "author": "RequirementDirect937",
    "url": "https://www.reddit.com/r/PESU/comments/1l9jwdz/questions_regarding_round_1_counselling_2025/",
    "permalink": "/r/PESU/comments/1l9jwdz/questions_regarding_round_1_counselling_2025/",
    "score": 7,
    "upvote_ratio": 0.74,
    "created_utc": 1749727169.0,
    "flair": "Admissions",
    "nsfw": false
  },
  "comments": [
    "U should participate in round 2 as many seats will open up ….but obviously whether ull get or not will depend on rank\n├── I have a rank of 51** so most probably the seats will be full by the time I reach the campus. Thanks for the suggestion though.\n└── I got 230X rank through kcet will I get anything?\n    └── Is that ur pesu kcet rank or kea kcet rank?\n        └── Pesu kcet\n            └── Not sure bro….we don’t even know how many seats will be available for pesu KCET counselling",
    "Afaik cse seats are completely over and also ece seats in rr are over, whereas there are a few in ec, there are about 23 seats in biotech and about 20 in mechanical\n└── Ok, thanks for the info. ",
    "20\n└── Thanks.",
    "CSE/CSE-AIML/ECE seats at both campuses were over by the end of round-1 counselling. EEE-2, BT-24, ME-20 seats remain ig. Not sure if thats the absolute final number but yeah\n├── https://preview.redd.it/nf17d8dj2i6f1.jpeg?width=1600&amp;format=pjpg&amp;auto=webp&amp;s=75ff24510773abda2b5255a7427c81ff9e276f22\n│   └── do you have the entire pic to get the idea of the cutoff of CS/CS-AIML and ECE?\n│       └── https://preview.redd.it/etn2sco47i6f1.jpeg?width=1600&amp;format=pjpg&amp;auto=webp&amp;s=876522616242b8a2d463e09274593cd7f7e01284\n│           └── Cool thanks...\n└── Thanks bro. Much appreciated."
  ]
}