{
  "title": "prep for next 2 months fresher?",
  "content": "Mostly Going to be joining PES rr campus cs: ai/ml, i have around 2 months before college starts.  \n\n* what are the college timings (btech)?\n* i want to start building my knowledge for the upcoming years, any advice from seniors on what to do in these 2 months to stay ahead of the crowd ( what main skills/certificates to get )\n* thoughts on cs : ai/ml by seniors? ",
  "metadata": {
    "id": "1l9k7l6",
    "author": "VirtualCartoonist333",
    "url": "https://www.reddit.com/r/PESU/comments/1l9k7l6/prep_for_next_2_months_fresher/",
    "permalink": "/r/PESU/comments/1l9k7l6/prep_for_next_2_months_fresher/",
    "score": 26,
    "upvote_ratio": 0.93,
    "created_utc": 1749728216.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "[Missing semester](https://missing.csail.mit.edu/) and [cs50](https://www.youtube.com/watch?v=h6lqxDwUmJQ&amp;list=PLhQjrBD2T383q7Vn8QnTsVgSvyLpsqL_R) , best resources to start off for your next 2 months.\n├── This^\n\nOP, these are the main things you (and every other engineer) should learn. Don't bother with anything else right now. Start with the basics.\n└── Thanks, heard many reviews on these being the best",
    "Hey, cse aiml senior here, 9+ cg after 4 sems\nI just went thru python from code with Harry (8+ hr course) and then C lang from Apna College (10 hr course)\nI wish I would have revised calculus like partial differentials and area using integration cus I struggled w that a bit. Do those 4 things and you're set for full first year\n├── Can you also recommend chapter in physics and chemistry to revise before first semester starts\n└── Do those calculus concepts come in semester exams? or how exactly does learning it now will help?\n    └── Partial diff is the CRUX of math in sem 1\nArea using Integration is a unit in math sem 2\n        └── ic, thanks",
    "Would recommend you to learn the syntax of any 1 programming language (along with basic data structures like arrays,strings) and you will get a huge advantage over others...",
    "On odd semesters ( sem 1 , 3, 5, 7 ) Classes are from 8am and they vary depending on the day ( maybe till 1:30 or 3pm or once a week till 5pm) . Even semesters it starts from 8:45pm \n\n  \nHonestly you can chill everything will be taught from scratch but if you really wanna do something , learn C or Python to a decent level through a course like CS50X or Programming With Mosh or sum\n├── do they provide some material ( some source ) from which they teach and that comes from exam, or do we have to study class notes for exam?\n│   └── they provide all notes and their corresponding videos on pesuacademy, for even more stuff you can look into betterpes or join discord for much more stuff\n│       └── when you say \" notes \" do you mean class slides, or they have notes separately on those topics?\n│           └── some topics do have notes as well - but its mostly slides on pesuacademy, but you can get all notes for every unit from the discord server, for almost every subject\n└── 845 pm?... As in night?",
    "bro plz tell...im from outside karnataka...do i have to come physically to pesu for counselling for jee based counselling?\n└── round 1 counselling has gotten over, i had assumed that the counselling was solely offline based and had gone to the campus for the counselling, but later i saw people attending online too, so ig there is an online option too\n    ├── fk man...i asked many people before round 1 and they told me it was offline too and even on the site its written offline..i could have gotten cse in main campus now i have to go to vit vellore\n    │   └── wasnt there a mail sent regarding online coucelling to non KA students?\n    │       └── bhai i didnt even register bcoz it was given in website that it was offline counselling...if i would have register then mail aata but bcoz of offline counselling i didnt go bcoz no idea of cutoffs bcoz first time jee related counselling so karnataka jane ki risk nahi le sakta tha\n    │           └── bhai offline counselling keliye bhi register karke , scorecard upload karna hota . \n\nchalo koi baat nahi , call if they will upon registrations again if not tough luck ;(\n    └── Online is only for ka people afaik."
  ]
}