{
  "title": "SEM 5 ELECTIVES - BD+DA too much?",
  "content": "I’ve got a growing interest in ML, and Networks also seem interesting, but I kinda messed up a bit in CN ESA, so I’m not really confident about taking CNS and risking my CG.\nSo I started exploring other options in E2 and narrowed it down to:\n\nBig Data, \nImage and Speech Processing\n\nBetween the two, I’m leaning towards BD, it’s industry relevant, very hands-on, and something I feel aligns with what I want. Also, Image and Speech Processing got dropped last year, and might get dropped again this year too, so BD seems like the safer and better bet overall.\n\nNow the confusion is, what do I pair with BD for my E1 elective?\n\nI was initially inclined towards Data Analytics (DA), but I’ve been hearing that BD + DA is a very hectic and voluminous combo. My CG is currently around 8.5, and I really don’t want it to drop because of taking too heavy a combo.\nSo now I’m considering Applied Cryptography (AC) or some other relatively lighter elective like IoT for E1.\n\nIf any seniors have taken BD + DA, I’d love to hear how you handled the workload. Was it manageable with proper planning, or would you recommend avoiding the combo?\n\nAlso, if anyone’s taken AC, would appreciate some insight on how it was, assignments, ISAs, ESAs, grading, etc.\n\nAny advice would genuinely help a lot\nThanks in advance!!\n ",
  "metadata": {
    "id": "1l9nhoz",
    "author": "ExplorerMain2081",
    "url": "https://www.reddit.com/r/PESU/comments/1l9nhoz/sem_5_electives_bdda_too_much/",
    "permalink": "/r/PESU/comments/1l9nhoz/sem_5_electives_bdda_too_much/",
    "score": 20,
    "upvote_ratio": 0.95,
    "created_utc": 1749737502.0,
    "flair": "Study Help :table:",
    "nsfw": false
  },
  "comments": [
    "I took BD+DA (RR Campus). \n\n\nBD syllabus is very small and if you study it correctly, isa and esa is going to be good. DA syllabus is quite lengthy and the syllabus becomes more theoretical as you move to the last lesson. \n\n\nIsa of DA was very easy compared to bd. Esa of bd for us it was straight forward, so was highly scoring. But da esa was tricky and we were asked mostly unexpected questions, so it was difficult to score but isa's made it up for us. \n\n\nDa generally has 4 assignments+ 1 mini hackathon and 1 major hackathon will be there. Out of this the assignment and mini hackathon are the easiest one's, they are literally straight forward, if you just spend 4-5 hours you will easily get full marks. Only major hackathon is the difficult one and it will take at least 7-8 hours to complete it as the questions are tricky. Overall on assignment part you easily score 18/20. For bd there were 2 assignment and 1 project. Both the assignments are the difficult, especially they have a very strict plagiarism policy. Both assignment will take atleast 3-4 days of work to complete. Its hard to score on the assignment but it's easier to score on the project as project is more simpler than assignments. Overall you can easily score 16/20 in assignment part.\n\n\nOverall, both subjects are good. Though bd demands more time and efforts, its more industry relevant than any subject also it will make cloud computing subject easier for you. Both combination is also good and though I also felt like it was very hectic in the beginning, in the end I felt the subject was too good in itself and every effort was worth it. So I recommend you to take it, but take it under a good faculty (there are few bad ones who don't even know abcd of the subject)",
    "I took AC and BD. Both subjects were a lot of fun. And I think they were among the most well-structured courses I’ve had at PES. I might be one of the few people who would say this, but I actually enjoyed the BD assignments, and our TAs were pretty helpful too.\n\nHowever seeing that you're interested in ML, DA might be a better choice. I'm not entirely sure, but a few of my friends did quite well in the DA ESAs. I also feel that DA provides better insights into ML-related projects. AC doesn’t really add much to your niche, but it is scoring.\n├── Thank you sm for the insight!\n└── what about the specialization thing?  \nI want to try this combo but I heard I wont be given the specialization....Please enlighten me.  \nIs the specialization really that important?\n    └── From what I’ve inferred, specializations don’t matter much. I’ve heard some seniors say that if we have a specialization, we’re grilled extensively on that topic in interviews. At that point of time I did not want to commit myself to either cybersec or ml so I opted for it. That said, if you an area of interest /domain having a specialization can be useful."
  ]
}