{
  "title": "PES CSE AI ML RR vs MSRIT CSE with some specs vs RVCE ETE",
  "content": "plsss seniorsss helpppp \n\n",
  "metadata": {
    "id": "1l9pj5r",
    "author": "Ayushi_2708",
    "url": "https://www.reddit.com/r/PESU/comments/1l9pj5r/pes_cse_ai_ml_rr_vs_msrit_cse_with_some_specs_vs/",
    "permalink": "/r/PESU/comments/1l9pj5r/pes_cse_ai_ml_rr_vs_msrit_cse_with_some_specs_vs/",
    "score": 2,
    "upvote_ratio": 0.63,
    "created_utc": 1749742515.0,
    "flair": "Admissions",
    "nsfw": false
  },
  "comments": [
    "I would pick pes over msrit. And both are millions of lightyears above ete at rv. \n\nWhy are your two comedk options msrit cs and rv ete? There's a lot inbetween right",
    "msrit cse",
    "msrit",
    "imo, PES CSE AIML RR......the crowd in pes&gt;&gt;&gt;msrit and then ete in rv just dont go unless u have a plan in pursuing ete",
    "Tbh at this period of time noone in this sub is interested to help and the one replying is just here to make a chance for second rounfd  seat..better do ur own research there are resources present on this subject ..just trust the mods\n├── What answers are you looking for? Everyone on this sub has been helping as much as they can. You need to realise that people are busy - either with their exams or their internships, or actual full-time work. It does not help that people post the same x vs y college every 2 days without even bothering to search for an existing answer.\n│   └── Well I did say do your own research with the s resources available at the sub 🙂 please read I know u are a graduate and I respect u for that but the guys commenting right k now are all giving false answers if u see their account they are just eyeing for yhe seat maybbe now u will say that I just want hear the answer that\"pes is better “\n└── mods ka reply kaha aaya\n    └── Go through the faqs and pros cons of pesu pinned by the mods *mr owl* those should be enough for the decision placement sheet is also available a.. on reddit"
  ]
}