{
  "title": "SEATS LEFT AFTER FIRST ROUND",
  "content": "https://preview.redd.it/2jydib713j6f1.jpg?width=640&amp;format=pjpg&amp;auto=webp&amp;s=a882a93599063b53ca839122e66d664486abf160\n\nhttps://preview.redd.it/nj9boak13j6f1.jpg?width=640&amp;format=pjpg&amp;auto=webp&amp;s=9e21719aedd046efe23058e7f0df74968a689834\n\nTHE DATA IS AFTER SLOT 3 OF FIRST ROUND OF COUNSELLING\n\ncredit goes to u/Glad-Class-2427 &amp; u/pareshan_aatmaaa\n\n\n\ni only saved the imgs and create a post so tht aage logo ko issue na ho",
  "metadata": {
    "id": "1l9rv11",
    "author": "Ayushi_2708",
    "url": "https://www.reddit.com/r/PESU/comments/1l9rv11/seats_left_after_first_round/",
    "permalink": "/r/PESU/comments/1l9rv11/seats_left_after_first_round/",
    "score": 17,
    "upvote_ratio": 0.88,
    "created_utc": 1749747999.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "I don't get why ECE at rr is preferred to CSE at ecc\n├── Everyone is running behind RR campus... idk why 🤯\n│   └── For me it was the campus, if you see the two you'll understand\n│       ├── Why plz tell?\n│       │   └── I don't know how to describe it, you have to see it\n│       │       └── Sure the campus might be slightly better, but taking ECE over cse just because of campus is kinda a dumb move imo. But then everyone has their own priorities.\n│       │           └── I have pretty good interest in both the streams and was okay with taking either of them which is why I picked the campus over the stream, I am also lucky enough to have actually gotten CSE in RR, I should've phrased my initial reply better to reflect that\n│       └── Ur changing ur career over a fancier campus 😭?\n│           └── I should've phrased it better to reflect that I would make that choice if I had to, I am a CSE student in RR but I am also really interested in ECE so I wouldn't have minded taking that as my course in RR over EC and ECC is also a huge problem for travel for me personally which again would not make it practical for me to have had taken up\n└── Som ppl select college based on distance if that is an option",
    "MODS PLS DONT BAN\n├── Why are you afraid of us 💀\n│   └── wht if u ban me as i used someone else's image ....\n│       └── Did u get these pics from the WhatsApp group\n└── Mods ban him!",
    "yoke decide towering fade repeat sort husky rain squash plough\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*\n└── therre are no seats left in CSE , CSE AI ML , ECE at both the campuses but there r high chances tht around 30 people surrender their seat as till then no KCET counselling took place nor JoSaa and JAC ... so hope for the best .... but at the end of third slot of first round no seats of CSE , CSE AI ML and ece were left ....\n\n  \nNOTE : i m talking abt the seats filled from JEE MAINS MERIT'\n    └── Do we know when the PESU KCET ranks will be out today?",
    "That's my laptop 😭😭😭😭\n├── so aapko bhi tag kr deta hu\n│   ├── no need bba 😭😭😭😭\n│   │   └── no no u deserve it ...\n│   └── Chill kro bhaiii life mei thora itna tension kon leta hai 😭😭\n│       └── hmm ... btw wht did u got in PES ... i got PES RR CSE AI ML\n│           └── took CSE in EC\n│               └── great .. congrats\n├── Ur laptop got 2 cursors ? 😭\n│   └── I clicked the photo and sent it in the grp and something clicked that photo from their laptop 😭😭😭\n└── yeah got it from the group lmao- all thanks to you! &lt;3\n    └── Hehe😂😂",
    "4000 rank equals to what jee percentile?",
    "I have a friend who has rank in 3 thousand’s …. His JEE MAINS PERCENTILE was 87.5 so his might be 80-85 ig"
  ]
}