{
  "title": "Help in choosing between rvce and pes",
  "content": "I have got two options one is rvce(ece) other is pes(cse) and pes(aiml) what should I choose.\nI know nothing about cs as iam a pcmb student would that be a problem??\nI still don't know what to do??",
  "metadata": {
    "id": "1lb5gcf",
    "author": "West-Mongoose-4871",
    "url": "https://www.reddit.com/r/PESU/comments/1lb5gcf/help_in_choosing_between_rvce_and_pes/",
    "permalink": "/r/PESU/comments/1lb5gcf/help_in_choosing_between_rvce_and_pes/",
    "score": 4,
    "upvote_ratio": 0.7,
    "created_utc": 1749896557.0,
    "flair": "Admissions",
    "nsfw": false
  },
  "comments": [
    "Bro its on u to choose ece or cse how can u ask us.. choose the one ure interested in\n└── bro is gambling his degree with our answers.",
    "If you don't have any inclination towards both these branches and don't rly have that CS craze, RVCE ECE is quite good because it's one of the top colleges in blr. But ECE is a tough branch, so maybe go thru the syllabus and decide",
    "Choose the branch you're interested in. Colleges are identical",
    "I've heard ECE is really difficult, but then again RV does have the placements, even for ECE. Go through the syllabi for both, and choose. You can find the syllabus on their respective college websites.\n└── pes placements arent all that bad though",
    "RV ECE is a very rigorous branch....check out their curriculum....I and my friend had similar opportunities,  he chose RV ECE over PES RR CSE.....and I PES CSE RR (wasn't even getting ece there)....he was interested in that branch and curriculum....so he went....if your still not sure about your interests then come to PES RR CSE....take decisions wisely...",
    "choose ece only because you want to, it is a core engineering department not something like computer science more like eee and me. so these arrent options to consider, take cs or ece thats it.\n\nif only college then rvce is better than pes. its almost on the level of an NIT",
    "If you're not sure, come to pes cse\nDon't take ece or aiml, both require more hardwork and sophisticated skills"
  ]
}