{
  "title": "Help , confused from a very long time ? 😭",
  "content": "Guys getting cse + spec in msrit and bms and getting cse core in pes ( EC campus) ...\n\nWhich one should I prefer ?\n\n**All options are through kcet (including pes)",
  "metadata": {
    "id": "1lbv4fw",
    "author": "Gudlu123",
    "url": "https://www.reddit.com/r/PESU/comments/1lbv4fw/help_confused_from_a_very_long_time/",
    "permalink": "/r/PESU/comments/1lbv4fw/help_confused_from_a_very_long_time/",
    "score": 9,
    "upvote_ratio": 0.91,
    "created_utc": 1749974876.0,
    "flair": "Admissions",
    "nsfw": false
  },
  "comments": [
    "Pes cse through kcet, thats the best choice\n└── but according to cutoffs many ppl are preferring cse + spec in bms msrit over pes ec campus ..\n    ├── cse in ec is same as cse in rr\nAlso the placements happen in rr campus only so campus doesn't matter\n\nAnd also, many people in this sub have said that cse core is better than spec\n    └── one thing people fail to understand is that you can only specialize in a subject if you know the basics well. \n\ncse core teaches u the basics which is more important than any specialization. Also, you can learn ai/ml anytime for free through coursera. These courses teach better than any money hungry university\n        └── PES also still has it's original ML related specialisation if you choose core CS too. The difference being in third year you can choose which field to give into but AIML makes that choice for you.\n            └── ^",
    "same are mine options through comedK \n\n\\-PES RR CSE AI ML ( got alloted thru JEE in 1st round )   \n\\-MSRIT CSE AI ML   \n\\-BMSCE CSE CORE ig or CSE with some specs   \n\\- RVCE ETE \n\n  \nmy comedK rank is 1930 and mains percentile 94.78%tile \n\n  \nso at the end i m thinking for PES as \n\n\\-BMS is now degrading due to 2000 seats in overall CSE + CSE with specs + ECE   \n\\-MSRIT is good but heard tht there is a lot of money influence and drugs   \nRVCE me ETE am getting but don't wanna take this branch... \n\n  \nPES is agree is 8-9 lakhs more expensive than MSRIT but as of now it's giving a better median package \n\n\"from seniors i asked MSRIT CSE AI ML it's 10-12 so am assuming 11 and for CSE in PES its 15-16 so am assuming 15.5 .... and seeing the overall growth PES is growing at a much higher rate than MSRIT and is offering  a really good package as most of the students are placed in Tier 1 companies so yeah i am choosing PES RR CSE AI ML \n\n\n\nNOTE = yes ik pes also has same no. of cse students as of BMS but yes unlike BMS , PES is getting students placed at a better position than BMS ...\n└── what would happen in next 4 or 5 years none of us knows so instead wht we can do is to see the data that we have at present times ....\n    └── I have the option of pes rr aiml as well but I'm probably gonna go for pes ecity cse (kcet) why are you choosing aiml over cse?\n        └── bcoz of RR campus 😭😭😭😭😭....and see placements are common for all so it wont be a big issue .... and if i get an option to upgrade in the second round then yeahh will do so ...\n            └── I mean yeah rr campus has better infra but also 600 more people so it's hella crowded while ec is more spacious so Ig it's down to preference and I also want to do masters so cse core is good and I have no idea if Ill actually like aiml\n                ├── ecc has 8k students while being 55 acres, rr has some 15k while being 30 acres.  \nPES has more then just btech\n                └── take core itself, recruiters dont like spec branches.",
    "PES CSE is an easy choice.\n└── but according to kcet cutoffs many ppl are preferring cse + spec in bms msrit over pes ec campus .. \n\npes ec campus cutoff goes till like 5k whereas msrit is 3k\n    └── they are stupid, dont follow crowed all the time.   \nRR cse == EC cse"
  ]
}