{
  "title": "Why is everyone choosing hci?",
  "content": "Pretty much everyone I’ve talked to has picked HCI, even though they’re not really into the subject. Most of them just want a good CGPA. Seniors here agree that while it’s easy to study, it’s actually difficult to score well in.\nSo why choose it when you have no real interest? I know few who were interested in other electives but settled with hci. Genuinely trying to understand if I’m missing something here.\nI have taken IOT and I feel like I am making a mistake. ",
  "metadata": {
    "id": "1lc6gtx",
    "author": "Gullible_Love_9908",
    "url": "https://www.reddit.com/r/PESU/comments/1lc6gtx/why_is_everyone_choosing_hci/",
    "permalink": "/r/PESU/comments/1lc6gtx/why_is_everyone_choosing_hci/",
    "score": 7,
    "upvote_ratio": 1.0,
    "created_utc": 1750009960.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "HCI swings between being too easy and ridiculously hard to score well in. Some batches had it lucky and got high grades (like mine), while some batches barely scraped past a B grade. There is no way to predict how it will turn out for your batch. If someone is struggling to hold a good CGPA, HCI in a lucky year can really boost their scores. However, there is equal risk in it tanking your GPA forever. I guess people are willing to take those chances given there is a positive outcome if they get lucky. Especially given the fact that they are halfway through their degree, and the next two semesters are their only chances of improving their GPA before placements and/or Masters. \n\nI'd suggest sticking to what you are interested in (whether its IoT or otherwise). Having prior interest in a course definitey makes learning and coursework easier to handle, and chances are you will do better. I've always found myself doing better (grade-wise, time-management wise, etc) in conventionally \"tough\" courses which I am interested in compared to the straightforward ones which I did not like.",
    "There’s always a couple of subjects like this that most people take. In my time, it was Knowledge Management and ERP (not sure if these are still there). I don’t think a single person was ever interested in these two. Everyone was just there since they were chill classes and relatively easy (myself included lol).\n\nHCI sounds like one of those.",
    "can aiml students opt for cse electives?"
  ]
}