{
  "title": "How did the admission process take place in 2024?",
  "content": "So this year, there is a separate counselling for pes through kcet, was it the same last year or did the counselling take place through kea? What were the cutoffs for last year if it were through pesu counselling through kcet or direct kea counselling, it would be really helpful to help me get a rough idea on what I'm getting. (Branches- cse, ai&amp;ml, ece) ",
  "metadata": {
    "id": "1lcl8ly",
    "author": "Hopeful_Ice6912",
    "url": "https://www.reddit.com/r/PESU/comments/1lcl8ly/how_did_the_admission_process_take_place_in_2024/",
    "permalink": "/r/PESU/comments/1lcl8ly/how_did_the_admission_process_take_place_in_2024/",
    "score": 3,
    "upvote_ratio": 0.81,
    "created_utc": 1750053259.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "the counselling for kcet purely took place through kea on their online website. cutoffs are given in the list provided by kea in their websites, (around 1.8k for CSE RR , 5k for ECE RR), AI ML thru kcet was around till 2.6k ish if im not wrong\n├── Oh alright, thanks a lot \n└── Bro I got 230X pes rank via kcet what can I get??? Pls help\n    ├── yeah aiml ig\n    └── I got 182X, and idk what I'll get :(",
    "This time there's the regular KEA counselling done separately and the one done by the college. Both on kcet rank basis. Prioritise KEA councelling over the college one, the fees is not worth it (unless ofc you have no choice)\n└── In the brochure released by kea, there is no pes since pes is conducting its own counselling, same as nitte meenakshi only, even that college isn't mentioned it the brochure, so I was confused \n    ├── https://preview.redd.it/t30tex10ga7f1.png?width=1080&amp;format=png&amp;auto=webp&amp;s=3f3b09badf6fbf452c59defa24b0b50e918d4ed3\n\nidk if something changed but there's both (credit for image: idk took it from a post here)\n    └── https://www.reddit.com/r/PESU/s/NEYF32QzLA\n\nThis is what it should look like in the kea counseling\n        └── That's last year's brochure, it's not there this year so yeah, but thanks a lot for your help "
  ]
}