{
  "title": "ADVANCED ALGORITHMS GETTING SCRAPPED NO WAYYYYY😭😭😭 How likely is it that advanced algos(EC campus) is getting scrapped considering only 25 took it? Also what will be the class strength of BD and DA considering there'll be 360 students each? Will there be multiple profs handling the same subject?",
  "content": "",
  "metadata": {
    "id": "1lcnni3",
    "author": "FormalBonus9833",
    "url": "https://i.redd.it/ajl2mbau397f1.png",
    "permalink": "/r/PESU/comments/1lcnni3/advanced_algorithms_getting_scrapped_no_wayyyyy/",
    "score": 18,
    "upvote_ratio": 1.0,
    "created_utc": 1750063137.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "Since AA has 25 it will definitely get scrapped. DA and BD will have 80-90 people per section as there are only 4-5 faculties capable of handling that subjects.\n└── Are they really going to fit 80 people in a class ? 💀\n    └── Might be, because BD only few lecturers have hold. Or they will use some new lecturers and increase the section to 6or7. For our sem there were around 300 people in bd but still they adjusted in 4 sections only, so they might increase by 1 this time\n        └── End up in animesh's class like if your in first 5 sections lucky else forget you guys gonna Saraswati in ec campus for bd , full on full tightly adjusted classes no place to sit strict deadlines this is for bd, assignments will be damn tough you will get flagged unnecessarily so Choose it wisely, i personally have taken it I loved it but put a lot of time into it, so yeah choose wisely",
    "AA will most probably get scrapped imo. Since each class has approx. 60 students, DA and BD will have 6 classes each ig. DA might have 7 though, cuz there's 386 enrolled currently and people who need to pick a different elective now might add to this",
    "AA got scrapped 2 years go(2025 batch here).\nTbh thats the best course for placements. \nI dont understand the BD DA hype in ecc. I mean most of them will take bd da , but not having enough members for AA seems criminal.\n└── If you really want this course , you can fight for it.\nWe had image processing with 30 ppl.\nSo it might not get scrapped"
  ]
}