{
  "title": "Probability of getting hostel",
  "content": "Fresher here\nWhat is the probability that I will get a hostel room and apparently my waiting list is 71 and please also recommend me pgs for boys too unisex also works..thanks in advance.\n",
  "metadata": {
    "id": "1lcpanu",
    "author": "Cold_Aside1235",
    "url": "https://www.reddit.com/r/PESU/comments/1lcpanu/probability_of_getting_hostel/",
    "permalink": "/r/PESU/comments/1lcpanu/probability_of_getting_hostel/",
    "score": 4,
    "upvote_ratio": 0.83,
    "created_utc": 1750069625.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "Huh?? There's a waiting list for hostel?\n└── Not officially but yeah\n    └── How did you get a \"not official\" waiting number of 71 then?\n        ├── are the rules for EC campus hostel really meant to be followed cuz tf you mean i need warden permission to use laptop and devices in my room. Is this a jail or a hostel ffs\n        │   └── Nah dude. Dw. The rules are nonsense, do what you wish to. The only rule they enforce is the curfew.\n        │       ├── Hii..offtopic but is PESU like school maintain a notebook or they cut internals type?\n        │       │   └── No, but they can find ways to cut internal marks in other ways.\n        │       │       └── Is there any need to make a notebook for a cse student can't we use laptops ?\n        │       │           └── From what I've heard no college allows laptops from first year to the classes. Laptops are mainly used during later years\n        │       └── Oh, what time does the curfew start because in the rules they said 7pm but if I want to play football in the college at around that time can I go? \nAnd also are the professors chill if I want to make notes on my tab during classes?\n        │           └── No clue about curfew times, I wasn't in hostel. Ask on discord. And note-taking depends on the prof - some allow, some don't.\n        └── I asked the warden and he said there are 70 people in front of us",
    "Guys I am sorry if the post is misleading regards to the waiting list all I meant to say was there were 70 parents ahead of us"
  ]
}