{
  "title": "Could someone please explain the councelling process for pes through kcet, I got 230X, can I even get anything?",
  "content": "",
  "metadata": {
    "id": "1ldso1s",
    "author": "Plastic_Reading_2361",
    "url": "https://www.reddit.com/r/PESU/comments/1ldso1s/could_someone_please_explain_the_councelling/",
    "permalink": "/r/PESU/comments/1ldso1s/could_someone_please_explain_the_councelling/",
    "score": 9,
    "upvote_ratio": 1.0,
    "created_utc": 1750179916.0,
    "flair": "Admissions",
    "nsfw": false
  },
  "comments": [
    "PES admission department says majority of the seats were filled up during JEE counseling and are non committal. \nYou should wait till the counseling to get some idea, no one has data for this as it’s the first time this kind of process is happening.\n├── hey could you elaborate on what you mean by the seats are non committal?\n│   └── PES admissions team says they can’t confirm what branches can we get based on PESU KCET rank. We have to wait till the counseling happens, that would be around 4-July. But the fees for this category will be 5L 😂\n│       ├── oh you were talking about the kcet seats. thank god, cus i thought the jee seats were not confirmed 😭 i got cse aiml in rr thru jee counselling so i was worried i might lose my seat\n│       └── Oh is it 5L through pesu kcet counselling too i thought its only for mains it will be somewhat lesser. Anyways can u tell how u got to know did u ask in campus?\n│           └── Yes it’s 5L fees for this (PESU KCET). Actual KCET counseling is yet to be announced in that fees should be around 1L.\n│               └── Thanks\n└── But 40 percent of seats are reserved kcet right\n    ├── Yes that are government seats, you'll get them through kcet counselling, which i think has not started yet.\n    └── I heard this from a friend, you can check with PES admissions office.",
    "Youll get it dont worry it like 40% reserved flr the state quota\n├── What will I get?, I got pes rank 230X not that much on kcet\n│   └── Check your category cutoff most likely it will be around that but you have a very good chance of aiml in round 2\n└── That 40% is different it's directly filled from kcet counselling which is govt run. The 45% jee mains/kcet quota uses the pes ranks for seats. I heard the kcet quota in that 45% is very low but not sure about the details.\n    └── I think op is gonna join through kea itself not state reservation in jee main quota\n        └── I believe 2.3k pes rank is around 15k rank in kcet so it's impossible to get pes through kea. And if you go as per the 45% jee mains/kcet quota there are no reservations there.Let's hope there are more seats in jee mains/kcet quota for the op",
    "Go through the seat matrix updated on kea website, clearly mentioned PES University has 40% seats reserved under govt.(KCET)"
  ]
}