{
  "title": "First internship advice from seniors pls!",
  "content": "hey guyss,\n\njust finished 1st year and i’m really hoping to get some kind of internship this summer. doesn’t have to be paid or anything fancy — i just want some exposure and to understand how stuff works outside college.\n\nif anyone here did summer internships, how did you manage to find it? like did you cold mail people? apply on some site? or did something else work?\n\nwould really appreciate any help, i’m kinda lost tbh. thanks :)",
  "metadata": {
    "id": "1lehln5",
    "author": "Designer_Cup7943",
    "url": "https://www.reddit.com/r/PESU/comments/1lehln5/first_internship_advice_from_seniors_pls/",
    "permalink": "/r/PESU/comments/1lehln5/first_internship_advice_from_seniors_pls/",
    "score": 17,
    "upvote_ratio": 0.9,
    "created_utc": 1750254571.0,
    "flair": "Placements 🤑",
    "nsfw": false
  },
  "comments": [
    " internship after 1st year  is little hard. But if your have the given skill set of the job requirements u can get it.  \nusually internships students are selected based on prior work experience in that role/tech stack or relavant research/project on that domain.\n\nSo expect a lot of rejections because 3rd year students would be preferred over you coz they have more experience.\n\nThat being said as a first year your best bet would be a referral through a family friend or some person you know. you can skip Assessments and directly sit for the interview if the companies allow you through referral .\n\nIf you dont get any even internships even after a lot of cold mails. Its your best chance to skill up. first year to second year summer is the best timeline for you to figure out your interests , what you like and what you dont . Maybe you like ML , maybe not or maybe your into web dev/ blockchain. Best way to figure out is to get your hands dirty everywhere and find what interests you the most.\n└── thanks a ton for this! really helpful and makes a lot of sense. gonna try for referrals and will build projects meanwhile. appreciate it :)"
  ]
}