{
  "title": "Doubt regarding a macbook at pes for CS",
  "content": "I already know the pros but cons depend college to college some proffesors tells to use a old software or something else wich is either paid or not available in macos . \n\n\nI Would like to hear any cons of macbook ! \n\n\nMy concerns are :- \n\n1- no extra( hefty) money for softwares \n2 - not to feel aparted from windows users in respect of learning and problem solving \n",
  "metadata": {
    "id": "1lepb2z",
    "author": "Impressive-Being9991",
    "url": "https://www.reddit.com/r/PESU/comments/1lepb2z/doubt_regarding_a_macbook_at_pes_for_cs/",
    "permalink": "/r/PESU/comments/1lepb2z/doubt_regarding_a_macbook_at_pes_for_cs/",
    "score": 6,
    "upvote_ratio": 0.88,
    "created_utc": 1750272833.0,
    "flair": "Admissions",
    "nsfw": false
  },
  "comments": [
    "I started using a mac in the 4th semester, and had no issues. Many of my friends used macs for all 4 years. No real issues at all.\n\nYou can pretty much run whatever you need - IDEs, Anaconda and Jupyter, Apache (Hadoop, Hive, Kafka, etc), DBs (MySQL, Postgres, Mongo, Redis), etc. off the top of my head without any issues. Even stuff like Scilab. \n\nSometimes it can be kind of annoying to configure some of these environments, that’s the only problem I would say.\n\nThe only time I ever noticed an issue was during this EDM production workshop we had in our first year. My friends couldn’t setup the FL Studio environment given to us on their macs so they had to watch while the rest of us learnt how to make a basic EDM track lol.\n└── No extra costing for these softwares ?\n    └── Nope, never once paid for any software, environment, plugin, whatever during my 4 years at PESU\n        └── Okay so you didn't face any problem expect in first year once\n            └── The first year thing was just a funny moment. That was just some one day workshop that happened. Not related to any class. So no problems at all",
    "Been using an m1 mba from the time I joined engineering and am in my final year now. No regrets!!",
    "RICH PEOPLE PROBLEMS",
    "🎶🎵 rich people shit , billionaire shit 🎶🎵",
    "Mac user for a long time. Never really faced an issue with anything all this while, instead made a lot of stuff easier for me. Just make sure to invest in a top model and more memory since you cant really extend it later without causing some damage. If you do plan to get into fields like AR then it’s best to use GPU heavy laptops instead.",
    "No issues in first year, I’m guessing the rest won’t be much different."
  ]
}