{
  "title": "Capstone Guide Recommondation",
  "content": "Opinion wanted on the following teachers for mentorship under the domain, machine learning\n\nRamamoorthy Srinath, Priyanka H, Surabhi Narayan, Karthik S, Dinesh Singh, Sujatha Upadhyay, Chandravva hebbi\n\nAre there any other teachers, you would recommend for mentorship?",
  "metadata": {
    "id": "1lfhed7",
    "author": "UpsetFollowing69",
    "url": "https://www.reddit.com/r/PESU/comments/1lfhed7/capstone_guide_recommondation/",
    "permalink": "/r/PESU/comments/1lfhed7/capstone_guide_recommondation/",
    "score": 6,
    "upvote_ratio": 0.88,
    "created_utc": 1750355793.0,
    "flair": "Capstone 🏗️",
    "nsfw": false
  },
  "comments": [
    "If you want to work in ML, only Rammoorthy Srinath is a good bet. The others are either profs I haven't heard of, or ones who aren't specialised for this field.\n└── pls reply i have so much confusion regarding this we are mostly doing our project on ai/ml and we are looking for mentor  is taking chairperson a better option or shd i go reach other teachers can anyone say some people were saying aswhini mam deducts marks  is this truee?? and please tell me hows priyanka H mam her domains are diverse but most of them ask who is she so any suggestions?? and Hows preeti P mam pls doo tell guys urgent ...... And if u have got any good suggestions for capstone mentors pls say and most of the famous ones are already full please do say the one who will be available and good plsss",
    "Go for surabhi mam or srinath sir if you want to work in ml; If you are specifically interested in genai then sujatha mam could also be a good option; Don't go to anyone else, other than these 3 among the list you mentioned\n└── pls reply i have so much confusion regarding this we are mostly doing our project on ai/ml and we are looking for mentor is taking chairperson a better option or shd i go reach other teachers can anyone say some people were saying aswhini mam deducts marks is this truee?? and please tell me hows priyanka H mam her domains are diverse but most of them ask who is she so any suggestions?? and Hows preeti P mam pls doo tell guys urgent ...... And if u have got any good suggestions for capstone mentors pls say and most of the famous ones are already full please do say the one who will be available and good plss",
    "pls reply i have so much confusion regarding this we are mostly doing our project on ai/ml and we are looking for mentor is taking chairperson a better option or shd i go reach other teachers can anyone say some people were saying aswhini mam deducts marks is this truee?? and please tell me hows priyanka H mam her domains are diverse but most of them ask who is she so any suggestions?? and Hows preeti P mam pls doo tell guys urgent ...... And if u have got any good suggestions for capstone mentors pls say and most of the famous ones are already full please do say the one who will be available and good plss\n└── Among the ones you have mentioned only chairperson seems to be a good option. But the only disadvantage you will have is you have to work on nlp or cv only as she prefers mostly nlp projects. Priyanka mam is capstone coordinator, she is new to the campus, so she doesn't have much experience. Preeti p is also ok, but not a recommended option. Ashwini mam is not so good if you are looking for ml projects. You can also look for badri Sir, surabhi mam, sujatha mam, preet mam and shylaja mam for ml.\nPreet mam can also be good for cybersecurity.\nI don't know who all are completely booked, so if you can give me a list of options or something, I can look into it\n    └── All of the teachers u have mentioned are already booked and shylaja mam is telling i will announce next week by looking into resume preet kanwal mam i dont think shes gonna take for us as she is with cybersecurity dept currently i have ashwini mam,chairperson(she told us to write name of our group into her book) ,priyanka mam,preeti p mam , chandravva mam, sivagamsundari mam, mailed ram moorthy sir no reply ,nagegowda ks , uma mam said she would select on problem statement (how can we think problem statemnt so early we are yet to be introduced the topics yet) ,jyothi r plss reply\n        └── Go for chairperson it's the best one you have now\n            └── thank u!"
  ]
}