{
  "title": "Anyone staying at the girls hostel in RR campus?",
  "content": "I was just checking out the living space website for the hostel options and some rules are absolutely dumb. Is there anyone who stays there who is willing to asnswer some questions I have? ",
  "metadata": {
    "id": "1lfykvl",
    "author": "luck_she",
    "url": "https://www.reddit.com/r/PESU/comments/1lfykvl/anyone_staying_at_the_girls_hostel_in_rr_campus/",
    "permalink": "/r/PESU/comments/1lfykvl/anyone_staying_at_the_girls_hostel_in_rr_campus/",
    "score": 6,
    "upvote_ratio": 1.0,
    "created_utc": 1750407204.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "aren't the hostels in RR campus filled? i heard that they're filled-\n├── Are you sure?\nHow can they just not provide hostels and how are all students nd parents ok with it?\n│   ├── Yes the boys hostel is currently full as of now \nThey college has decided to selectively give hostel services to students now means students who are staying in banglore will have significantly less chance of getting a room allotment compared to intercity students.\nAnd more over there are limited rooms so they resorted to first come first serve for the hostel applications\n│   └── omgg ikrr, especially for 1st yr students who do not belong to bangalore\n│       ├── Yeah and even if u do belong in banglore, pes is very far from most places . \n│       └── Why are they giving more seats than they can accommodate students for \n└── Where did you get to know abt this \n    └── i didnt get any info or mail from the uni, i just read it on reddit",
    "Of all I have heard from my girls hostel friends is yeah its ok\nMess food is very mid and ya an overall mid experience keeping in mind that u will have to use scheduled busses to travel to the campus as the hostel is a few kilometers far and if u are unable to catch the scheduled shuttle bus u will have to arrange ur own transport...\nSo yeah many girls join pes hostel but move out to a pg near by.\nSam athiti Pavati is a good girls pg close to campus\n├── im not worried about the food, however, the rule book had rules like 7pm deadline and not allowed to leave the room after a certain time and dress code and stuff like that.. is that all fr?\n└── Hostel is outside the campus for rr campus as well??"
  ]
}