{
  "title": "Can the freshies use the sports facilities at PES EC campus",
  "content": "Seniors please let me know if the 1st year students are allowed to use the playground coz in amatra hostel the warden said that there is no permission for students to use the field",
  "metadata": {
    "id": "1lge50a",
    "author": "ResortAdditional7726",
    "url": "https://www.reddit.com/r/PESU/comments/1lge50a/can_the_freshies_use_the_sports_facilities_at_pes/",
    "permalink": "/r/PESU/comments/1lge50a/can_the_freshies_use_the_sports_facilities_at_pes/",
    "score": 7,
    "upvote_ratio": 0.89,
    "created_utc": 1750451172.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "You cannot use the cricket Ground.\nOther than that you're free to use anything.\n(Football ground and Mrd)\n├── Wait why?\n│   └── They Rent the Cricket Ground. \nIt's not for us Lol. Just a show piece\n│       └── Oh damn \n\n\nGotta get that bread ig\n│           └── Twin they get their bread w jee and mgmt fees\n│               └── Private colleges \n\nThey want everything\n\nAgle saal se saans lene ke paise lenge\n└── So if we want to play we have to miss the bus that takes back to amatra and stay back in college ??\n    ├── Bus Timings to go back is 5pm,\nYour classes will be till 2:30. \nYou will have to wait till 5pm on campus for the bus.\n    └── i think you can use the sports facilities in amaatra aswell, never seen anyone do it tho, try asking ur warden or smthg\n        └── Nah we can't , I asked the warden about it and he said that previously they used to allow but the college students used to destroy the field break posts and created a mess thats why they stopped allowing\n            └── how about the playground behind the admin block in the skl, that's kinda old and um no one will care, maybe just don't ask the warden and go there when the gate between hostel and skl is open.. \n\nthe ground is here:\n\nhttps://preview.redd.it/h89d2h5bz98f1.png?width=785&amp;format=png&amp;auto=webp&amp;s=89ecbed05810ecd427f2eafe74a20e384eb1e6f4",
    "The interesting question is what are the sports facilities at least outdoor , and where tf are they\n└── Why ? Don't they play football in the football field ?\n    └── Everything except basketball happens there so yeah"
  ]
}