{
  "title": "A complete guide on Makeout spots in PESU",
  "content": "***Disclaimer*** *- This info might be little outdated as I graduated in 2024. GJB was still in construction and things were different back then. Also, this is for RR campus. Y'all ec campus kids don't need a guide anyway!*\n\nMakeout is fun, its amazing. Be it with your friends with benefits or a new chick you are dating, nothing strengthens the bond and feels as adventurous as doing naughty things out in college. Weather you have time to kill or being just plain horny, definitely go for it.\n\nI want to preserve up few of the things I have learnt from my seniors and tons of exploring over the years, hence this post.\n\n# Now getting down to the locations -\n\nMech lab block near the back gate. Empty affffff and usually not locked. I know about it being from mech and the non mech people are missin out fr\n\nThe top final floor of tech park. Theres even place to sit there as the small cafe located there from the Hotel management students are usually closed. Good lighting too.\n\n4th and 5th floor side of MRD building. Not many know it or go above 2nd floor even but its occupied by Visual arts department. The Terrace is unlocked there too at times. Be careful though as few sections of terrace are too visible for people in the Be block building. Windy and fun there.\n\nIn Be block, people try to make out in silent reflections, especially in its upper floor but its not worth it. They do check cameras there and I got caught once too lolol  \nFew people try to use those disabled washrooms, but that aint my thing.\n\nF block terrace is fun. Not sure if its open anymore. There used to be a satellite centre there and just wide empty place but I think its locked up now due to suicide. The F block Libraries upper floor is amazing too.\n\nGJB is the best holy place to make out fr. So many empty places due to the entire place still being in construction. There used to be drinking parties and 7 minutes in heaven or other games at the current bajaj place, 7th floor before it was fully constructed lol. The top upper floors usually have spots.\n\nCricket ground far corners are good. \n\nPeople try to make out in their personal cars parked in the corners of cricket ground. Thats all cool if you have air conditioned car as it can be scorching hot in noons. Avoid sex though. There was an MMS leak in 2022, which is a sad fuck up.\n\nThe upper floor of parking lot in GJB, in between the cars is fun too for a short session\n\nMech girls washroom. Because mech girls don't exist anyway! JK\n\nThere are few other spots too but its gatekept by certain people and I respect that.\n\nBe mindful of timings. Peak timing always has more people walking around. Campus is lil deserted post 5 or 6 pm.\n\nSidenote but PESU has the wildest parties. Legit. Its just only few know about it and are invited to it. The sex lore there is crazyyyyyyyyyyyyyyy.\n\nDo avoid having sex in college. I know quickies are fun! But there have been MMS leaks and its not worth it. Tons of good cheap Oyos nearby, highly recommend. Your girl deserves it. Condoms are available in a medical shop near Sutta Gully, including tons of flavored ones. (checkout blueberry flavored ones). You can probably order it instantly to backgate and collect it there too.\n\nAlso if things went south scenario.\n\nIf you get caught while making out, just cooperate. I got caught in silent reflections top floor while fingering someone (being an absolute noob I was but then again, I didn't have this guide like yall keeds) and they dragged me to VK. Ofc VK scared us and scolded us but let us go in the end. They wont call your parents and all. Stfu, man up and be brave lol.\n\nPesu is most likely the best college legit. Hottest babes, really good gender ratio, make the most out of it. Engineering colleges in general have bad rep for bad gender ratio with my school friends who are in IIT crying over it.\n\nI have personally went out with few nearby college girls from RNSIT, global university and even a Dayanand Sagar chick but hell nah, they dont hold a candle to the hotties at our home turf. The environment in this college is chill and relaxed. Cold approaches work too. PESU has open minded liberal population.\n\nMy final advice is that makeout isn't everything. A quick kiss in an empty lift, a gently kiss in parking lot before saying goodbye, a warm supportive hug at times, gentle squeezes, these goes a long way too. Always appreciate your partner well.\n\nAcknowledgements -\n\nThe Buddha of 2024 batch\n\nBae Ballers, the pesu pickup artists and playboys community",
  "metadata": {
    "id": "1lgtff2",
    "author": "Special-Quantity-797",
    "url": "https://www.reddit.com/r/PESU/comments/1lgtff2/a_complete_guide_on_makeout_spots_in_pesu/",
    "permalink": "/r/PESU/comments/1lgtff2/a_complete_guide_on_makeout_spots_in_pesu/",
    "score": 142,
    "upvote_ratio": 0.91,
    "created_utc": 1750501761.0,
    "flair": "Pride Of PESU",
    "nsfw": false
  },
  "comments": [
    "https://preview.redd.it/dqcwmbk7e98f1.png?width=944&amp;format=png&amp;auto=webp&amp;s=7ea46c0a47e7a6fafa16182741919c2f881cfb6b",
    "Javahar would like to thank you\n\n( you never know whos lurking in the sub )",
    "Which pesu is bro talking about\n\nhttps://preview.redd.it/rtvnxgwrj98f1.jpeg?width=216&amp;format=pjpg&amp;auto=webp&amp;s=542b7f9cc46eaf3f304e8cd1859aac63fbaaf3ec\n└── https://preview.redd.it/bgdndmy4k98f1.png?width=938&amp;format=png&amp;auto=webp&amp;s=02faf48f6f3f33ed9bf4de62857d23a145bd34f3",
    "Mfw motherfuckers will do anything except employment and complain about placements",
    "This is Javahar’s alt account, iga alli camera nadeyalide\n└── To watch it live? lololol",
    "Considering the number of CCTVs are increasing every year in this campus, expect them to be installed in the areas you mentioned",
    "Wish i could make out with myself /s",
    "Why Is there no guide for EC campus ?? 😭",
    "![gif](giphy|5WZ98RPKV0vLEdRWUM)",
    "Man, people will hate you so much from now on, leaked all the spots",
    "Bro thanks for the input but seem to that you don’t reveal these secrets as like a teachers might get cams over there",
    "![gif](giphy|WQy9FkJlhGSwl3eQ5V|downsized)",
    "&gt;The environment in this college is chill and relaxed.\n\nNot when you have exams around the corner smh",
    "https://preview.redd.it/rfyh55qjgg8f1.jpeg?width=675&amp;format=pjpg&amp;auto=webp&amp;s=80e58b2fcc2490a34f4902a051633993fd0b653c",
    "Bc ye kya padhna pad raha hai , nikal ja bhadwe\n└── Lol, no one studies 24x7  \nAlso, good way to announce that you are a virgin loser, nerd 😭\n    └── I was anything but a nerd lmao\nAnd no, u don't need to publish your crap on reddit for the world to see 💀 anyway u do u man, this generation is fucked anyway",
    "I think it's 1:3 because in our class there were 60 students out of which 20 were girls...\n└── Well then it would be 2:1 ig . Thank you for letting me know\n    └── Isn't 20/60 equal to 1:3 ??\n        └── Total = 60\n\nBoys = 40\n\nGirls = 20",
    "What is the gender ratio at PESU btw?",
    "there shouldve been an option for people to join pes after seeing this post",
    "As a professor, thank you for this",
    "What gender ratio? My section's gender ratio is like fucking 2:1 boys to girls"
  ]
}