{
  "title": "Advice from the senior overlords regarding placements",
  "content": "I've just finished my 6th sem (CSE) and would be sitting for placements in July. I had a few doubts regarding placement season and what are the best steps I should take\n\n(i) My GPA is exactly 7.492, can I write it as 7.5 while sitting for different companies who might have a criteria of 7.5+ or is the placement office going to come after me for that. Kinda really stressed about this so any insights would be helpful.\n\n(ii) I am doing leetcode problems, CN, OS, DBMS, Aptitude and Logical Reasoning, my projects are alright nothing too flashy in my resume. Aim is to finish the interview 150 problems and then do more of Leetcode. Will these things be enough or is there anything that I'm missing out.\n\n(iii) Do most of the comanies take their initial rounds online or is it offline in GJBC which would be great?(approx %) \n\n(iv) Should I do some kindof certifications such as the AWS ones to boost the resume or would it not have that much of an impact as grinding LeetCode would?\n\nThanks in advance for any help!",
  "metadata": {
    "id": "1lh64fz",
    "author": "LayneGallagher",
    "url": "https://www.reddit.com/r/PESU/comments/1lh64fz/advice_from_the_senior_overlords_regarding/",
    "permalink": "/r/PESU/comments/1lh64fz/advice_from_the_senior_overlords_regarding/",
    "score": 39,
    "upvote_ratio": 0.98,
    "created_utc": 1750537987.0,
    "flair": "Placements 🤑",
    "nsfw": false
  },
  "comments": [
    "1. you cannot write as 7.5 as Placement cell will contact department and get real CGPA from them and send it to companies, they will also send mail if wrongly filled, sometimes. Do note about it. But there maybe relaxation in some cases.\n\n2. You can also do NeetCode 150 something sheet, forgot the exact name.   \n[https://www.techinterviewhandbook.org/software-engineering-interview-guide/](https://www.techinterviewhandbook.org/software-engineering-interview-guide/)\n\nrefer all this \n\nmake sure u have a good resume \n\nFound a good checklist of things that shud be in a resume - \n\n[https://the-engineers-checklist.notion.site/e6ddc2f7ed444375911644059c482c35?v=a4aaf41b68e14617815de0844d559f9b](https://the-engineers-checklist.notion.site/e6ddc2f7ed444375911644059c482c35?v=a4aaf41b68e14617815de0844d559f9b)\n\n3. Some high paying generally do in GJBC Assessment centeres so as to prevent cheating but some do online as well. Placement cell will mail u and inform dw about it.\n\n4. Certifications dont really carry value, u can do it tho, no harm. But make sure to do some projects alongside of them."
  ]
}