{
  "title": "Presenting, \"Dream Crushed\" (A PESU Manga)!",
  "content": "I have my Mechanics ESA tommorow. So naturally, I was looking for a way to kill time. Ended up drawing a few manga panels. Yes, it's on the back of my Mechanics notebook. I don't know what I was thinking when I drew it (was definitely high on something). I just made a panel layout and drew whatever would fit in each panel. It ended up looking pretty good for a mindless, time pass sketch. I thought the title \"Dream Crushed (Dore-īmu Kurusshu)\" was pretty fitting lol. Posting it here, so it may be engrained in the PESU Memes Hall fo Fame.\n\nP.S.: Best of luck to everyone who has ESAs ongoing right now!",
  "metadata": {
    "id": "1lhk1sq",
    "author": "Speedbird-One01",
    "url": "https://i.redd.it/eib6bhol8g8f1.jpeg",
    "permalink": "/r/PESU/comments/1lhk1sq/presenting_dream_crushed_a_pesu_manga/",
    "score": 149,
    "upvote_ratio": 0.99,
    "created_utc": 1750585209.0,
    "flair": "Meme :snoo_dealwithit:",
    "nsfw": false
  },
  "comments": [
    "Yall pessat wale didn't get the money yet?\n├── Nope... I've visited the accounts department thrice now. Each time, they say 'next week', but the money never comes lol.\n│   └── We cet peop got it like bef isa1 why so late forya\n└── nope",
    "Ts is goated twn, the sad part is I can't relate💔🥀\n└── finished studying beams?\n    └── Stalker nigga, ya I'm doing truss",
    "Goat 🗿🗿",
    "This is great! \n\nA suggestion to make the Japanese look better since the rest of it looks fire. For ドリームクラッシュ, the ッ and ュ are small kana so they should be a bit smaller and slightly below the other characters. \n\nAnd for Speedbird-ワン (wan), it looks like you’ve written ワソ (waso) instead. You can make the curve slightly flatter (ン instead ソ) and your name is perfect.\n└── Thank you for pointing that out. I am not familiar with the Japanese writing system. I just used Google Translate and tried my best to copy the characters. I'll be sure to take note of that.\n    ├── No worries then. You actually did a superb job just from copying. Quite a challenging writing system for sure.\n    └── Drop a yt tutorial with your goated skills"
  ]
}