{
  "title": "Help regarding considering mechanical engineering",
  "content": "Im getting mechanical and maybe electrical at pes. Electrical is beyond me. However, mechanical is something i was interested in. Im concerned about taking mechanical here since there are no good reviews from seniors. All ive seen are complaints about horrible faculty and a bad HOD. These were from posts made a year ago so is mechanical at pes still bad? Should i take robotics at MSRUAS instead of mechanical at pes",
  "metadata": {
    "id": "1lig1zo",
    "author": "daddyboii1",
    "url": "https://www.reddit.com/r/PESU/comments/1lig1zo/help_regarding_considering_mechanical_engineering/",
    "permalink": "/r/PESU/comments/1lig1zo/help_regarding_considering_mechanical_engineering/",
    "score": 4,
    "upvote_ratio": 0.84,
    "created_utc": 1750683859.0,
    "flair": "Admissions",
    "nsfw": false
  },
  "comments": [
    "Hell nah dont do MSRUAS. Thats not the main campus. besides dont do specialisated courses in bachelors\n└── Is mech good at pes 😭\n    └── See, mech is bad everywhere in general. If you have absolutely no other option, then you can take mech at PES. Look at NIE Mysore, JSS, NITTE (Mangalore), etc. too. They got decent placements too. Thing is in PES, lots of the good faculty have left and only decent-good ones with 2 extremely good ones left. Yes, HoD is a bit of a crackhead, but you wont interact much as long as your not CR, constantly get into trouble, etc. Basically, you can reduce it to just class and once or twice signing\n        └── Also, the remaining faculty aren't \"horrible\". They are just decent, with a few good &amp; extremely good ones\n            └── Thank you so much bro. I am getting jss mysore mech from comedk. Will that be better\n                └── Just remember, work hard, do projects and find good friends who also want to do the same. Join clubs or work under a professor. Use them for references. Email professors at IISc/IIT/IITH/NIT for summer internships after 2nd year. Placements are bad for mech overall in India, and luck also plays a factor. So choose carefully, are you sure you want to do mechanical?\n                    └── Im open to other branches but i wanted to get into aerospace. Also im not getting any great branch and college options with my 55k comedk rank\n                        └── First of all, there what do you mean \"great branch\"? None of what you are using now would be possible with mechanical engineers.\n\nSecondly, you said in post that you wanted robotics &amp; electrical? Please research more carefully into what your field of interest. I can give you a few pointers. Base it on what you want to work on, on what you enjoyed in 11th &amp; 12th, etc. There are common ground between robotics &amp; aerospace, but I highly suggest whether that common ground for you is the mechanical part (machines, mechanisms, fluid, thermal, structural, manufacturing) or others -  avionics, power, electronics/electrical\n\nPlease be aware that these choices will determine your career, your interest in life and more. Sure you can get a IT job, but you will not be paid as well as a CS/IS/etc student. Same thing for EEE,ECE and other core &amp; circuital branches. While there are people who move onto other fields successsfully, like finance or business (and some even in CS, its just harder), I still recommend you to carefully research and decide. Think if even engineering is meant for you.\n                            └── I apologise for the lack of clarification. I want to pursue by btech alongside the iitm bs data science course. My interests in engineering lie in aerospace engineering/ mechanical engineering. I considered robotics at msruas due to the synergy it had with the data science course. When i said a better branch meant branches like cse/aiml. Im not into electrical or electronics at all. When i said better branch i didnt mean to insult mechanical at all i only meant that branches like cse are currently considered better to pursue due to the current state of mechanical engineering in india\n                                └── In 11th i was into maths and physics and in 12th only maths. I disliked 12th physics due to electrical"
  ]
}