{
  "title": "Any updates on the Pros and Cons given in Sub Wiki",
  "content": "https://www.reddit.com/r/PESU/s/FoZVFFidAf\n\nAs this comment is 2 years old im whether theres any changes in any of these",
  "metadata": {
    "id": "1liht4x",
    "author": "rynmuneer",
    "url": "https://www.reddit.com/r/PESU/comments/1liht4x/any_updates_on_the_pros_and_cons_given_in_sub_wiki/",
    "permalink": "/r/PESU/comments/1liht4x/any_updates_on_the_pros_and_cons_given_in_sub_wiki/",
    "score": 3,
    "upvote_ratio": 0.67,
    "created_utc": 1750688357.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "I check the pros and cons of the comment once a year. There don't seem to be any significant updates. If anyone does have any points, I can add in - but it more or less is still the same.",
    "Pros:\nMetro facility is there ( I hope  it opens soon)\n\nYou will easily get to meet all kinds of students ( I mean students interested in certain domains androidev,webtech, startups,sports wtc)\n\nEPD faculty in EC campus ( especially Anand sir ) will help u. Lot for job skills in ECE dept evn if you are in CS he will help you \n\nHolidays are less but you will enjoy them a lot\n\nAfter exams your mind will be blank\n\n\nCons:\nPressure \n\nYou will easily get demotivated \n\nUpvote :)\n├── Lot for jobs skills in ECE dept ?\n├── for ece jobs with good package doesnt one need to do M.Tech?\n└── Bro how bad is the pressurw? Like if i study a couple of weeks before exams can i manage\n    └── Math , C , python , physics( for me :/) are the subjects which depends on your smartness and knowledge. if you are strong in these subjects then you can easily manage by studying one week before\n\nRemaining subjects you can easily manage within last two weeks or one week also \nI have 8.4x sgpa currently so you can easily do I g best of luck\n        └── how do ppl get scholarships there? what was cutoff for this yr in cse in ec campus? and what is the hostel and sports seen in EC campus? (if i dont get hostel in 1st yr, can i get it in 2nd yr inside campus?)"
  ]
}