{
  "title": "Just Finished 1st Year – What Can I Learn in One Month of Holidays?",
  "content": "Hey everyone!  \nI’ve just completed my first year of college and now have a whole month of holidays ahead. I really want to make the most of this time and learn something valuable, both for personal growth and to help me in the long run.\n\nWhat are some useful or interesting things I can focus on during this one-month break? It could be related to academics, programming, tech, soft skills, or even creative hobbies. I’d love to hear your suggestions!",
  "metadata": {
    "id": "1lilu0i",
    "author": "WebCute4701",
    "url": "https://www.reddit.com/r/PESU/comments/1lilu0i/just_finished_1st_year_what_can_i_learn_in_one/",
    "permalink": "/r/PESU/comments/1lilu0i/just_finished_1st_year_what_can_i_learn_in_one/",
    "score": 16,
    "upvote_ratio": 0.87,
    "created_utc": 1750697632.0,
    "flair": "Study Help :table:",
    "nsfw": false
  },
  "comments": [
    "Setting a placeholder comment so I can get to this after work. Remind me if I forget in 24 hours.\n\nEdit: https://www.reddit.com/r/PESU/comments/1ljxi1y/just_finished_x_year_and_dont_know_what_to_do_a/\n└── Bhai zaro vo\n    └── Give me a few hours, sorry. Mondays are usually hectic.\n        └── If possible, then plz make a post instead of commenting here.\n            ├── Okay, I can do that.\n            └── [https://www.reddit.com/r/PESU/comments/1ljxi1y/just\\_finished\\_x\\_year\\_and\\_dont\\_know\\_what\\_to\\_do\\_a/](https://www.reddit.com/r/PESU/comments/1ljxi1y/just_finished_x_year_and_dont_know_what_to_do_a/)",
    "How about a new language :)  \nI'm learning Japanese right now\n└── Its sad how when i hear the word language i think of C and not english",
    "&gt; What are some useful or interesting things I can focus on during this one-month break? It could be related to academics, programming, tech, soft skills, or even creative hobbies. I’d love to hear your suggestions!\n\nHSP, (PESU-ECC)'s tech club is hosting a project mentorship program this summer called Tilde. If you have a great project in mind you can pool-in and join our weekly discord calls to showcase something you are building in public. :) If you don't have any ideas, there are a couple of projects available if you're willing to put in time. \n\nHere's a link to sign up: https://forms.gle/tywe2q6NRhN7E5J59\n\nPS. Disclaimer: (I'm part of HSP and mentored a project last year called [psh](https://homebrew.hsp-ec.xyz/posts/tilde-3.0-psh))\n└── I was part of the founding team of HSP ecc. I can attest to the process of tilde.\n\nIt teaches you to build stuff from having no clue where to start from.",
    "Read a good book, something that'll help you navigate and understand life better :)"
  ]
}