{
  "title": "To the seniors who got 20+LPA package what exactly did you guys do??",
  "content": "Obviously there was something different that set you apart from your peers what was it? An awesome internship? or perhaps good projects and leetcode? or pure dumb luck? \n\nThe thing is I got like 40 days more before 7th Sem starts and I desperately want a good job and I am totally lost",
  "metadata": {
    "id": "1ljeutj",
    "author": "Effective_Let4233",
    "url": "https://www.reddit.com/r/PESU/comments/1ljeutj/to_the_seniors_who_got_20lpa_package_what_exactly/",
    "permalink": "/r/PESU/comments/1ljeutj/to_the_seniors_who_got_20lpa_package_what_exactly/",
    "score": 88,
    "upvote_ratio": 0.99,
    "created_utc": 1750780565.0,
    "flair": "Placements 🤑",
    "nsfw": false
  },
  "comments": [
    "My personal story - needs a bit of everything if you want a good offer.\n\nShort answer: good internships at pretty well-known ML labs, good research work at undergrad level (2 published papers, 1 internal, 1 underway), a *very*, *very* specialised profile that showed clarity in career/academic goals, proven technical skills through research experience/publications, okay-ish DSA skills, decent GPA (\\~8.75), and a bit of luck. I also had a couple of other things which did not make it to my resume (TAship, volunteering, awards, etc) since industry recruitment does not prioritise those. My answer to \"Is luck needed?\" was always \"Good to have, but my skills can fill the gaps even luck cannot\".\n\nLong answer - check my previous posts/comments on what i had on my resume before placement season, what I did during my internships to go beyond what was required of me, etc. If you have stellar stalking abilities, you can even find my old resumes on discord lol.\n\nNote, I wasn't among the first to get placed. My DSA skills were average, and I did not have a high enough GPA to get shortlisted for many companies even after doing well in OAs. But I knew that once I did get shortlisted, I would stand out because not many had what I had on my profile. Got shortlisted by a top MNC at the end of August, cleared every single round (3 in total), was one of the \\~5 people to get an intern+FTE. Recruiting interviewer was so impressed, he put in a word about which team/role to assign me to as well. Ended up in a team+role that aligned entirely with my previous work.\n\nTo summarise - go beyond what is expected. You need decent DSA+GPA at the very best. Once you are in the interviews, its all on your skillset. Skill up and be so hirable that they don't have a reason to reject you. And for that, you are going to give your 100%.\n├── Quick question, u passed out 3 years ago, how are you still managing to answer almost every query and balance your work life too ? I heard corporate life is quite intense and there's almost no time.\n│   ├── Not to flex, but I'm pretty good at managing my time. People have often complimented that about me as well. Plus, timezone differences make it seem like I am chronically online during work hours, when in reality I am mostly active during the late evening/night when I have wrapped up work for the day.\n│   └── Bruh first finish yr first and then think about all these stuff\n├── u said that your DSA skills were okay-ish, how much LeetCode practice did you actually do? Like the number of questions and time spent?\n│   └── None. I had a good grasp of the fundamentals that were taught through DSA and DAA courses at PES. Anything at the PES level was 100% solvable for me. I may not have been an ace at DSA and problem solving, but with enough time, I would figure out an approach that passed at least 40-50% the test cases for most other problems. So I knew that I was, at best, average to start off with, which was better than what quite a few start off with.\n\nI did not bother putting in more effort because (1) I hated grinding CP just to beat a rat race, (2) I had other better things on my plate - I was pursuing an internship + TAship + capstone at the same time and (3) I did not feel the need to do better since I was already achieving average scores in the OAs, it was only a matter of when I would get shortlisted, not if.\n\nMy suggestion - don't focus on solving \"N\" problems. Focus on honing your skills and reaching a level where you can at least solve &gt;60% of the problem set that your see in OAs. If you see yourself struggling, you need to practice more. Some people are good at CP, they do not need to solve N problems to get there. Some need more than N. Depends on you.\n│       └── You solved none of leetcode and u still cleared OA??like howw??i have solved some 150 and yet not able to figure out shit during OAs,it is either you are a god or i am just a dumbhead\n│           └── The answer is in the first paragraph: I had a pretty good understanding of the basics and fundamentals, which let me extrapolate those concepts to harder but similar problems. Questions that were at the same difficulty level as those that would have appeared in DSA/DAA courses were always easy for me. Anything harder definitely took effort and time, and I was never able to solve 100%. But it was enough to cross on average, 50% test cases.\n\nBut I'd say that having strong fundamentals definitely gave me a step up compared to the rest who grinded LC and tried to memorize patterns rather than understand strategies. I probably could have been even better if I also worked on DSA, but I had other commitments and priorities.\n\nSo to answer, no I wasn't a god at LC compared to some others in my batch. I was average, which was better than most others in the batch, and that helped me out. If you are struggling with OAs, you might want to revisit your strategy.\n│               └── I think it also depends on students,some would need just the fundamentals to get go while others would have to solve a lot of questions,but i do agree that your method is definitely way way better than mindlessly grinding leetcode just for the sake of it\n├── Hey, how does someone who just finished their first year begin their search for internships? I just want a rough idea as to how students really get internships. Also I'm assuming you were pursuing a remote internship at the time?\n└── 8.75 is decent? I thought it was awesome\n    └── 1. Take a quick look at the placement sheets. You will see a few companies shortlist 9+, some as much as 9.2+\n\n2. There will be at least 100 kids in CS alone who cross 9 CGPA lol. An 8.75 is honestly not that high, given that the minimum required to be eligible for scholarships is an 8.5. Although I did receive a scholarship in most semesters, I was always at the lower end of the ladder and barely making the cutoffs. Once, I was even in the bottom 5 lmao.\n        ├── One more question do you receive scholarships semester wise?\n        │   └── yes\n        └── But there are many companies that allowed at 6 - 7+ too right?\n            └── Company eligibility criteria is different from selection criteria. They can allow 7+ to sit for OAs, but while shortlisting for an interview, nothing is stopping them from shortlisting 9+.\n                └── This point needs to be raised more often.",
    "Mannn these OAs are so freaking hard nowadays... I really wanna know how some seniors/recent grads tackled these stupidly tough time constrained OAs!",
    "As a 50lpa senior, u shouldn’t focus on DSA and only focus on grip strength and forearm size",
    "Combination of good grades and projects. The big thing companies look for is coding and topics in CS like OS, CN, BD, CC (if you're in CS at least) so make sure that you have a good grasp of that stuff. Having a good attitude in your interview, however, is something that takes you really far and is not obvious to \"prepare for\", but be humble and good natured while talking, and don't overly try to impress them and talk like you have a rod up your ass.",
    "+1 but coming to pes in 2025🥲",
    "Is there a possibility of having low cgpa yet  getting through tier 1 placements if you have very good skill set and top notch projects??",
    "All the people getting good jobs here have a combination of all the things mentioned. The most important thing they do have is the thing rowlet mentioned in one of his replies, which is the ability to manage your life to be a bit of an all rounder because you do need it all (DSA to pass the first rounds and a decent profile to impress your interviewer) \n\nI'd also like to kinda say that getting even a 12-13 LPA job doesn't stop you from absolutely killing it at work, and getting decent raises (I got an almost 50% raise in the 2 years I was at my old work, and was up for another pretty big promotion when I left for my MS)",
    "Yea samee I have not been able to bag any summer internship seniors plzz tell how likely is it gonna affect my placements and what should I do to get a tier 1 offer",
    "**RemindMe! 3 Days**",
    "yes can some seniors,pls reply"
  ]
}