{
  "title": "Any chance of relative grading in physics and mechanical this sem ?",
  "content": "",
  "metadata": {
    "id": "1ljg6dm",
    "author": "Formal_Obligation753",
    "url": "https://www.reddit.com/r/PESU/comments/1ljg6dm/any_chance_of_relative_grading_in_physics_and/",
    "permalink": "/r/PESU/comments/1ljg6dm/any_chance_of_relative_grading_in_physics_and/",
    "score": 1,
    "upvote_ratio": 0.67,
    "created_utc": 1750783542.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "I really hope so, but pes is infamous for not giving us relative grading during even sems, let's wait for the results\n└── &gt; pes is infamous for not giving us relative grading during even sems\n\nThere is nothing like that. It depends on how the batch performs in a course. You are underestimating how bad your batch performed, they probably did not screw up as much as you think they did.\n    └── Oh, I was told by other seniors that even when the batch performed poorly they've not given relative grading, and this time physics has been a very poor performance for the whole batch\n        └── Sampling bias. They say \"batch performed poorly\", but what are their data points to form that conclusion? Them and their 10 friends? Compared to the 500+ data points PES has to decide if the batch screwed up *enough* to loosen the grade map?\n\nI'm not denying that your batch screwed up a course. They probably did. But maybe, it's possible, you're overestimating how much they screwed up. Maybe it wasn't enough to get the grade map changed. And I believe there is no way for you to accurately say that a course deserves relative grading until you exactly see how bad your batch has done - something which PES can accurately determine.\n            ├── The averages are similar to last sem phy cycle students and they had a down scaling\n            │   └── In mechanical?\n            │       └── Yeah fs it should be\n            ├── Yeah fair enough\n            └── Yeah this is true I have like 5 people in my group who could get 92+ in phy\n. And the mech was not even that hard it was similar to past year"
  ]
}