{
  "title": "Just finished X Year, and don't know what to do? A Guide for CSE Engineers",
  "content": "This question comes up repeatedly every year, so I thought I'd jot down a few points on what I would recommend doing as someone looking to break into CS. This opinion is entirely my own, shaped by my own experiences.\n\n# Incoming Student\n\nThis is already covered in the FAQs, so I will quote most of my previous answer. **If you don't have any programming background,** [CS50](https://pll.harvard.edu/course/cs50-introduction-computer-science) **is a great course to introduce you to the basics.** However, IMO, you don't need such an intro because all CS courses in the first year start from absolute basics. So, unless you're a fan of learning different languages, it won't help you too much. Most people I know recommend it only to pick up basic Python/C skills.\n\nOn the other hand, if you want a course whose topics you'll end up using not only during your 4 years but also mandatorily in the industry, you should pick the [MIT Missing Semester](https://missing.csail.mit.edu/). It's meant to cover **tools and technologies that aren't part of a standard CS curriculum but rather are meant to be used alongside it** \\- shell scripting, using the terminal, version control, etc. These are tools you'll have to pick up yourself as you navigate college, but you will end up using every single day at work in the industry, hence the earlier you get proficient with them, the better. It's a fantastic and also pretty small course. **A lot of people in the industry also recommend it to freshers who join because of how useful it is**.\n\nI would recommend first doing the MIT Missing Semester, followed by CS50. A list of other things to do:\n\n1. Create an [industry-standard](https://www.overleaf.com/latex/templates/jakes-resume/syzfjbzwjncs) resume. Add calendar reminders to update this every month.\n2. Create a LinkedIn account, connect with classmates and seniors.\n3. Create a GitHub account, learn how to use it (MIT covers this).\n4. Dual-boot your system with Linux if on Windows, or at least install [WSL](https://learn.microsoft.com/en-us/windows/wsl/install). Learn how to use the shell (MIT covers this).\n\nSide note, I would also recommend reading the [Freshman do's and don'ts at PESU](https://www.reddit.com/r/PESU/comments/1ek15de/comment/lghpvqh/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button) that I drafted earlier.\n\n# First Year\n\nThis is the time to lay down some groundwork in programming basics, get good with Python and C, and explore CS. Don't listen to the kids who preach DSA - there is ample time for placement prep. Figure out what interests you. CS is a vast field. Over 4 years, you will need to have found a niche for yourself and specialise in it. Gone are the days when people were a jack-of-all-trades-master-of-none, and still getting hired. Today, the industry looks for people who are hirable and industry-ready, and for that, you need to carve out those skills in a field of your choice and show them you have what it takes to succeed. Alas, figuring out your interests is easier than it sounds. Some people can easily find it and have an idea growing up, while some spend years finding it. Even after people do find it, interests do change, people pivot, and things keep moving - but that should not stop you.\n\nThere is no one fixed way to find out what interests you; however, the consensus is that the only way you can find what you like is by eliminating what you don't. Some recommend forcing yourself to like something until you physically cannot, which IMO is a little extreme but works nevertheless. [https://roadmap.sh/](https://roadmap.sh/) is a popular resource to find roadmaps for different fields. However, tread with caution because it does not always guide well. Instead, I would recommend glancing through what it says, and then ask a senior/alumni working in that field for a guide. Odds are, given their experience, they will be in a much better position to advise you than a website. Before you dive into the depths of a field, I suggest you try the starter examples or tutorial equivalents; that should give you an early indication of whether you will like the field. If you cannot decide, dive deeper until you reach a point where you feel like this is what you want to do. Also, while you are at this, document whatever you learn, and keep making use of your GitHub to showcase your efforts. This will also allow you to update your resume with some basic projects.\n\nI would suggest treating the first year as a sandbox to not only figure out life at PES - exams, schedules, adjusting to college, perfecting exam strategy, etc - but also exploring CS and if not finding your interest, at least narrowing it down to a few fields you think you see yourself building a career in. That itself should give you a head start. Apart from that, keep up with classmates, seniors, and develop professional contacts with professors and alumni.\n\n# Summer\n\nSummers are usually the time for internships (and having fun!). It is slightly easier to land research internships than engineering ones. Many research labs on campus (CCBD, CDSAML, ISFCR) and off-campus (IITs, IIITs, NITs, IISc) hold summer research fellowships. You can even cold email some professors (in and outside PES) to find out if they are working on anything interesting and assist them. Many even land research internships with universities abroad this way. If you are someone who wants to learn what the world of academia has to offer, these are great opportunities to learn more. Even if you do not end up liking research, the experience from top labs is very valuable, and IMO, you should try it at least once before discarding this career direction. Additionally, some of the contacts you build here (profs, alumni) can often open doors to many better opportunities, both in and out of the country. You can find more details [in my old comment](https://www.reddit.com/r/PESU/comments/1bhk8os/comment/kvfizda/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button).\n\nFinding an engineering internship at the end of 1st year (and 2nd too) is pretty difficult. Top MNCs will not usually hire, since their resources are reserved for 3rd years or higher. Your best bet is startups, since they will practically hire anyone to get their work done. But do not expect high-quality work, since in all likelihood, they will make you do some sort of grunt work.\n\nHowever, if you do not find anything, just spend the summer having fun. This would realistically be the last ever summer vacation of your life, so make the most of it. Remember to continue your efforts to find out what interests you and dive deeper into it.",
  "metadata": {
    "id": "1ljxi1y",
    "author": "rowlet-owl",
    "url": "https://www.reddit.com/r/PESU/comments/1ljxi1y/just_finished_x_year_and_dont_know_what_to_do_a/",
    "permalink": "/r/PESU/comments/1ljxi1y/just_finished_x_year_and_dont_know_what_to_do_a/",
    "score": 96,
    "upvote_ratio": 0.99,
    "created_utc": 1750829470.0,
    "flair": "Placements 🤑",
    "nsfw": false
  },
  "comments": [
    "\\[Placeholder comment\\]\n\nI will update this for higher semesters later, when I find the time.",
    "rowlett is working overtime after his j\\*b for the pride of pesu!!!\n└── Overtime without pay\n\n![gif](giphy|3orifdO6eKr9YBdOBq)",
    "This is the second most useful guide post after the makeout spots of pes guide",
    "u the goat🗣️🗣️",
    "Is it advisable for AIML students, too?\n└── Yes, aiml has like 90% of the same syllabus as cse",
    "Which Linux distro do u recommend/use ?\n└── I personally have been using PopOS for years now. If you're new, I'd recommend using something similar to Windows like Mint, or even PopOS if you would like good support with Nvidia drivers. Ubuntu is a nice beginner choice too\n    └── I am using fedora for a while now. Works well :)"
  ]
}