{
  "title": "Pes round 2 counselling?  New registrations or old?",
  "content": "Will they start new registrations for round 2 counselling or the people who already got there pesu r a n k card can only participate ? I missed to participate in round 1 so will I have to register again ?",
  "metadata": {
    "id": "1lkk97t",
    "author": "Pretend_Picture_2341",
    "url": "https://www.reddit.com/r/PESU/comments/1lkk97t/pes_round_2_counselling_new_registrations_or_old/",
    "permalink": "/r/PESU/comments/1lkk97t/pes_round_2_counselling_new_registrations_or_old/",
    "score": 7,
    "upvote_ratio": 0.82,
    "created_utc": 1750892289.0,
    "flair": "Admissions",
    "nsfw": false
  },
  "comments": [
    "I called them, they said ki u cant register for round 2 \n\nSo its gg..\n├── Arre yr aise to phir round 2 mai nhi milega kuch shit man I should have sit in round 1 I would have got ece in rr and cse in EC \n└── bro like u can register or u cannot?\n    └── PESU KCET ranking is annouced and the seat allocation for PESU KCET Rank holder will be done on the seats surrendered by PESU JEE candidates who were allocated seats in first round. The PES mgmt is assuming that most of the seats would be filled and confirmed after PESU KCET Counselling (tentantive date 12th July) so there would be no PESU JEE second round conuselling.\n        └── Who told you this? Like jee and kcet have separate seats kcet people have their reserved seats . Please bro don't spread misinformation.\n            ├── KCET counselling is done by KEA and PES  has 40%  of its  total seats allocated to this counselling.The ranking for this quota is generated by KEA. PES has a separate quota of 45% for which admission is done by PES, for which ranking is generated by PES based on the JEE and KCET score. The first round of counselling was done based on JEE score ( PESU JEE rank) . The second round of counselling will be based on KCET score and PESU KCET ranking is generated (tentative date of counselling 12 th  July),for the 45% quota seats( note -the ranking here is generated by PES).Here the seat availability will be limited (ie the seats surrender by the candidates who got seats in first round based on PESU JEE ranking ).\n            └── Bro No misinformation this is 100% correct info . Read the Website and get clarity\n                └── Read the website it's completely written 45 percent seat reserved for jee ppl and 40 for kcet\n                    └── There is a difference between PESU KCET ranking and the KCET ranking provided by KEA. The 40% seat reserved is for KCET ranking provided by KEA .If you have uploaded your KCET score on PES website and  got PESU KCET ranking it will considered for 45% quota seats only.",
    "bro , just call them and ask they will take time , but will reply back",
    "did u call them about round 2?\n└── Nahh bro"
  ]
}