{
  "title": "SOMETHING TO WORRY ABOUT ....",
  "content": "just realised something ... \n\n  \nGuys PESU CSE and CSE AI ML total seats are 2280 across both the campuses ... and ECE seats across both the campuses ... 360+180 = 540 ... and assuming that 30% of the ECE people are gonna sit for placements for IT companies .. so 2280 + \\~180 = 2460 people fighting for IT companies right ... and chlo lets remove some non-serious ppl ( coz obv 100% serious ppl hona is very difficult ) so 2200 ig is the right no. and now tell me 2200 people sitting in placements for IT companies .... and i heard somewhere on this subreddit only that good T1 companies take 10-15 people max .... and companies are not gonna increase their intake bcoz people at PES inc their programm intake so isn't PESU turning into VIT , SRM ... bcoz they do the same thing only right ... see i m not saying that PESU is shit and alll VIT also gives high placements but the competition if fierce .... \n\nYES i agree that PES infra is better than other cllgs in Bangalore and it has an updated curriculum as tht followed by other VTU college like RVCE , BMSCE and MSRIT or maybe DSCE ...\n\nYES i agree ki anywhere i go their will be a lot of compe\\_tition and yes compe\\_tition is a good thing but the thing to worry abt is that the median of 13-14LPA of now might turn into a median of 9-10 LPA .... \n\n\n\n\" Median Package means tht 50% and above ppl are getting a salary of XX LPA \"\n\n  \nso people taking admission through JM-2025 and Managemeent Quota they are at high risk ... \n\n\n\nKCET QUOTA people for them yes i agree ROI is good but not for JM and management people \n\n\n\nOP got alloted PESU RR CSE AI ML in first round counselling and 1930 ra\\_nk in COMEDK so thinking abt RVCE ETE and MSRIT CSE with some specs .... so sorry to all the PESU lovers ....but seriously i thought this is a major issue abt which no one is talking about \n\n\n\n  \n",
  "metadata": {
    "id": "1lksxq0",
    "author": "Ayushi_2708",
    "url": "https://www.reddit.com/r/PESU/comments/1lksxq0/something_to_worry_about/",
    "permalink": "/r/PESU/comments/1lksxq0/something_to_worry_about/",
    "score": 61,
    "upvote_ratio": 0.9,
    "created_utc": 1750919064.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "The drastic increase in seats was done for 2027 batch, and 2026 batch also had an addition of a new branch AIML. The placements of 2026 batch will go in general way, but considering the market situation there might be a possibility of very large dip also. But surely 2027 batch will have huge competition, considering the number of students, so yeah it's going to be a fierce competition. Even bmsce 2027 batch also has the same intake, so both will face challenges in placing 2027 batch, but considering placement cell will gain some experience in 2027, 2028 batch placements might improve also. But it all depends on multiple factors, intake is not the only factor which affects placements. In the last 2-3 years the market situation has ruined the placements of almost every clg in India. So hope for a good market and may be if you have the right market and right skills, your batch might have highest placement record in the history also. Placement is an uncertain thing, no one can predict what will happen after 2-3 years, so hope for the best\n└── But most of us have to take admission in 2025 only and yes placements are uncertain but 2000+ people competing for Jobs is unreasonable…today we all are criticising VIT and SRM but PES is also doing the same only …\n    └── The batch is calculated based on the year you graduate, 2026 graduate means people who have joined in 2022.\n2000+ people sitting for placement has become a common trend across most of the colleges across India. That thing together with the market situation has made the placement to dip significantly, this trend will continue.\n        └── Ohkkk",
    "u/rowlet-owl",
    "So, a very valid observation. \n\nI don't want to be a bearer of bad news but, this is current reality of the job market. In college, you are honestly seeing a subset of how bad the situation is.\n\nSo instead of worrying about the numbers/%s; i would recommend, focusing on your degree + updating your skills parallelly. You need to focus on being the best fit for the job opening irrespective of the number of people applying for that opening\n\nGood Luck and i hope things get better with time",
    "Ngl I feel the placement cell itself must be under insane pressure now itself for the 2027 batch considering the intake they have to deal with. Welp hope they clutch somewhat\n└── In which year the intake increased?\nLike 2025 batch had how much intake?\n    └── https://preview.redd.it/jethgktb489f1.jpeg?width=1080&amp;format=pjpg&amp;auto=webp&amp;s=38b7a43f099cc6a838c2f18f80d736092350b3b1\n\n2025 maybe had 1900 students...\n        └── Ig no bcoz there are many branches … Mech ECE EEE BIO TECH\n            └── total eligible students include all branches...\n                └── Ohk but from now on 2282 students are alone from CSE and CSE AI ML\n                    └── yeah so maybe an increase of 1000 students since 2025\n                        ├── Shit, median gonna decline on a crazy rate\n                        └── Yep",
    "Damn, if you had given this much thinking with your brain cells, you'd have done better in exams /s\n\nBut yes while there might be a reduction in median/average due to the way statistics works (math is so fun isnt it), you would be better off figuring out how to improve your skills and resume to make your profile better than the rest. Its not like this situation is new either, high-intake has been there in places like VIT, SRM, PES, for years. Also, your assumption that only 30% of ECE people will sit in placements is cute. There are far more wanna-be CS people in ECE. Some in the rest, EEE and Mech. BT ppl are usually more interested in their branches and often do masters, so you can leave them.\n\nAnd please, take the branch that your interested in. Don't ruin core branches by taking that, and sitting for CS placements and then later in life complain about either taking a core branch or infecting future generations with the same thought process on how you took it and ended with a good paying IT job. \n\nP.S. Use English and type in English properly atleast. Hinglish is so annoying to read and makes it look very chapri",
    "Check this out, this is 2025 placement statistics:\n\n[https://docs.google.com/spreadsheets/d/1SnSNM\\_GnuTwIJ0oI3bHt9nAnDQXfqwIhT8JHEwq727g/edit?usp=sharing](https://docs.google.com/spreadsheets/d/1SnSNM_GnuTwIJ0oI3bHt9nAnDQXfqwIhT8JHEwq727g/edit?usp=sharing)",
    "It's about supply and demand. The world asked for a lot of software engineers, and the university is delivering on the requirement. If that results in a reduction of costs for the world, it's an overall good thing, because it shows that the system is working. \n\nIf the problem is genuine, pick another course or stream of education where the reward ratio is higher.",
    "You have bigger things to worry about, buddy. Like learning how to type in English.\n└── ?",
    "What this proves is that the honeymoon days of CSE are coming to an end. College will keep increasing intake for their benefits. The decision lies in us about our career choices whether you are taking a particular branch for your passion or parents/peer pressure. Either way you need to work hard to prosper. I wouldn't say that job opportunities are diminished in CSE but you just need to be prepared for stiff competition. \n\nTo the people who may not make it where they wanted to, it is not the end of your life. There are other opportunities in life waiting for you. Even if it takes time to get there its never too late for anything. keep learning.",
    "bro cse and aiml only people with more than 7.75 cgpa can sit for placements so it's definitely not gonna be more 2k students\n└── [https://docs.google.com/spreadsheets/d/1SnSNM\\_GnuTwIJ0oI3bHt9nAnDQXfqwIhT8JHEwq727g/edit?gid=0#gid=0](https://docs.google.com/spreadsheets/d/1SnSNM_GnuTwIJ0oI3bHt9nAnDQXfqwIhT8JHEwq727g/edit?gid=0#gid=0)\n\n\n\nthis sheet says something else .... people with 6 CGPA are also sitting\n    └── mb i meant only those with more than 7.75 gpa can sit for tier 1 companies\n        ├── Where tf did u get that info from , many tier 1 companies allow people with 7+ cgpa\n        │   └── that's what i was told by the professors\n        │       └── Don't believe  the shit these people say  , they do it to scare u,\n        └── Ohkkk"
  ]
}