{
  "title": "Help regarding syllabus and which college to choose.",
  "content": "I can get MSRIT ise or cs allied or BMSCE cs allied or PES rr cse what should I do which college should be my top priority. As iam going to join directly in 2nd year lateral entry and we diploma students aren't that good at math but pretty good at technical or cs related subjects. I had contacted a guy from PES ecc CSE who also got in through lateral entry he said BMSCE or MSRIT are way better for us as they don't have that much accademic pressure and he mentioned that I won't be able to take time out for learning something new. Is it true that I should consider MSRIT ise or BMSCE cs allied better than PES CSE for me (iam not implying that pes core cse is bad but it could be for me as I am not good at math) and is it that tuff to maintain a good cg there",
  "metadata": {
    "id": "1lliqgs",
    "author": "BloodAny7651",
    "url": "https://www.reddit.com/r/PESU/comments/1lliqgs/help_regarding_syllabus_and_which_college_to/",
    "permalink": "/r/PESU/comments/1lliqgs/help_regarding_syllabus_and_which_college_to/",
    "score": 0,
    "upvote_ratio": 0.33,
    "created_utc": 1750991522.0,
    "flair": "Admissions",
    "nsfw": false
  },
  "comments": [
    "On any day CSE core is better than CSE with something else or ise. Math won't be a much bigger problem in the second year, as there will be only 2 subjects+ 1 bridge course. Matrix and statistics are the base for those subjects, which are kind of easy. The only tricky part will be the bridge course, but you will have to give a bridge course across all colleges. And mostly the math syllabus is the same in all the colleges. After second year you won't see math in the syllabus. \nComing on to the time management, yeah it might be very chaotic in the beginning, but it will get better as you get adjusted to pesu.\nI would say for either join bmsce CSE or pesu CSE , don't join msrit, as its reputation has taken a dip in the last 2-3 years.\n├── Why do you think MSRIT's rep has taken a dip in the last couple years? Are BMS and PES the better options?\n│   └── There are few issues within the management that's why. I think yes, bms or pes are better.\n│       └── Ohh, isn't intake of bms too high?\n│           └── Yeah, but still the infrastructure and syllabus wise it's good. Even placement is improving\n│               └── Ohh, can you please give me a rough estimate of median placements of each of the 3 colleges?\n│                   └── For bms and msr no idea bro, they always hide their placement stats. For pes It's 12+ currently\n│                       └── All branches included or CSE alone?\n│                           └── CSE alone, as other branches don't have much demand when it comes to placements.\n│                               └── Thank you so much for your answer!\n└── I was thinking of MSRIT because everyone ranks it with pes and bmsce and the hostel cost there is also less if math is like what you said then I should just go with pes ig\n    ├── You can't avoid math. Engineering is math. There will be math in some way or the other. If you don't like math, you're pursuing the wrong degree.\n    │   └── Not like I don't like math if it's pretty easy to moderate things I can manage but some deep trigonometry shit I can't\n    └── Math is like that only, few colleges have till m6 also. PES has only m4. And the time has gone when msrit was considered to be one of the top colleges, msrit hasn't been able to cope up with neither placement nor syllabus, so pes,rv, bmsce are way better than it.\n        └── What about the intake pes has more so more competition\n            └── Yeah but if you learn a good amount of skills and maintain a good gpa, you will be in a great position. Even bmsce has the same intake, so don't worry about intake."
  ]
}