{
  "title": "Can we upgrade our seat from ec to rr campus in 2nd round of counselling?",
  "content": "Got CSE in EC Campus, is it possible to upgrade to rr campus in 2nd round of counselling?",
  "metadata": {
    "id": "1lni3te",
    "author": "Hopeful-Yoghurt-1285",
    "url": "https://www.reddit.com/r/PESU/comments/1lni3te/can_we_upgrade_our_seat_from_ec_to_rr_campus_in/",
    "permalink": "/r/PESU/comments/1lni3te/can_we_upgrade_our_seat_from_ec_to_rr_campus_in/",
    "score": 5,
    "upvote_ratio": 0.67,
    "created_utc": 1751212630.0,
    "flair": "Admissions",
    "nsfw": false
  },
  "comments": [
    "Waiting for the day when people will start calling moving from EC to RR a campus change and not an \"upgrade\". Its because of posts and comments like these that the misinformation never ends.\n├── Agreed will all the points, but even a slightly more dedicated peer group, better infrastructure is worth calling an upgrade right ? I know almost everything is similar, fests aren't a deal breaker, same exams, same syllabus, same everything.\n\nHonestly even I'm in dilemma. I live closer to EC campus, but got RR CSE in 1st round.\n│   └── Read my other comment down this thread. You cannot judge the \"better\" peer group before actually interacting with your batchmates. The kids at RR are better at grinding PCM questions. Is that your definition of being better peers? Or would you rather be surrounded by better engineers or people in tech (since you mentioned CS)? I agree that the infrastructure at RR is miles ahead, but that is a factor that will affect you for 3/4 years of college. \n\nIMO, you should factor in the parameters that are important to your career (not short term, but long term) as an individual. If you are really interested in CS and tech, I would recommend EC any day. If you want to organise the largest fests, then RR. If you like open spaces, then EC. If you want fancy looking buildings, then RR. If travel time is a concern, then EC.\n\nI usually only provide information and not actions, but if I were in your shoes, I would pick EC. The short term benefits of RR (bigger fests, more clubs, fancy buildings - none of which contributes even a line to your resume) are not worth the long term benefits (much better tech culture, more involved tech communities and peers, travel time - things which directly contribute to your resume or make life easier) of EC.\n│       └── &gt;The kids at RR are better at grinding PCM questions. Is that your definition of being better peers?\n\nBetter rankers in rr does imply that they are relatively more study focused and will likely put in the same effort for engineering as well.\n\nNonetheless we are on the same page, I'm just trying to have a healthy debate here.\n│           └── &gt;Better rankers in rr does imply that they are relatively more study focused and will likely put in the same effort for engineering as well.\n\nThe very big catch here being PCM skills do not translate to CS/software engineering skills. More often than not, the best engineers to have graduated from PES, the ones who often bag the highest packages at T1/dream companies, were never the ones who got the highest ranks in PESSAT/CET, neither were they the ones who had the highest CGPAs. Its the ones that are actually passionate about CS, ones who learnt more from outside the syllabus and books, ones who spent time tinkering with things not because they had to, but because they wanted to, and truly let their interests guide their efforts.\n\nOn the other hand, there are *many* stories of CET/PESSAT top rankers being really poor in CS because they simply lack the interest in the subject, and thus do not find their PCM abilities translate to CS skills. Effort might give you some edge, but the real advantage comes from wanting to thrive in this field. You cannot fake interest.\n│               └── PCM skills does build a strong analytical thinking, which help in CS. Many top rankers aren’t just book-smart ,they’re disciplined, fast learners, and curious too. Passion helps, but so do consistency and fundamentals. Although I stand by the mixed crowd point, just need to find people similar to my interests.\n│                   └── Partially true. While they do build aptitude and analytical thinking, CS isn't entirely dependent on that. Some fields of CS might benefit more from it, but core software engineering as a whole has very little to do with it. The skills aren't really transferable to a large extent. \n\nJust because you've got the aptitude to solve the hardest math questions, does not guarantee that you will make a good engineer (example: IITians often hold the reputation of being lousy engineers in the workforce), where there are a lot more factors. The skills you mentioned are mostly mathematically driven, and unless you're in a math field (like I am), those skills don't help at all. \n\nA large part of software engineering depends on core CS theory and fundamentals, concepts that are more focused on efficient, effective solutions, designing systems to behave a certain way, using existing tools to build large scale solutions and solve problems. Your abilities to crack the JEE Mains do not translate here, simply because, they're entirely different skillsets. Here, you need to look at things from a much larger, holistic lens, and a lot also depends on how well you code. Analytical thinking might help you write efficient code, but the goal isn't to always be efficient (the industry will always sacrifice efficiency for readability and maintenance). \n\nIf your assumption had been the case, you'd see the top PESSAT rankers being the best engineers, but that's been disproven practically every year. Discipline and curiosity to learn would help anyone, regardless of their field. But it's prior interest that actually takes the game home. Once you join, you'll see the patterns emerge. The ones leading the tech clubs, the ones part of and winning various tech events, the ones being the active tech representatives of your batch, the first to bag internships and jobs, will *all* be people who have a genuine passion for CS, regardless of their JEE scores and CGPA. \n\nThe real innovators in the field of CS are the ones with interest. You're in a field that is entirely driven by passion. Passion drives efforts. Hard work without passion doesn't lead to results here.\n│                       └── Thanks for the detailed answer. I will take up CSE in ec now \\[Parents can't say no to 2-wheeler now, yipee 🫠\\]\n│                           └── Lmao, hope you have to convince your parents to allow you to ride in that beautiful national highway. Amazing dust and traffic sense.\n└── nah, the only reason i wanted to change to rr campus was because during counselling 95+ percentilers joined rr campus so i thought rr campus would comparatively give me better peer group nothing against ec\n    ├── Claiming RR has a better peer group based on PCM/JEE scores is very invalid, given that your entrance test performance has no correlation with how you will do in engineering. Sure, there is a *slightly* better average GPA at RR, but the difference has always been &lt;0.5, making it statistically insignificant. \n\nAnd since you mentioned CS, it's worth mentioning that the best tech clubs, tech events, and even communities and people in tech have all been based out of EC for the past 5+ years in running. The tech scene at RR is practically dead compared to EC. The largest tech club is currently at EC, and it grows bigger every year. \n\nThat alone should tell you enough about your misguided judgement.\n    │   └── oh thanks for this, i read through faq’s previously and i knew there were no difference between both the campuses but in back of the mind that peer group of having 95+ percentilers was a concern so thanks for this\n    │       ├── No problem. Join the PESU Discord server. You'll find many seniors and alumni there. Many incoming students are also there, some of whom are taking part in club related events already.\n    │       └── I have 96.5 percentile in jee main but i am gonna join ec campus through kcet as per my kcet rank did not apply for pes counselling cuz of the high fees\n    └── u should change RR cse if u r getting bcz that should be ur first priority bcz definitely u deserve good peers who have same mindset like urs and is at ur level too...."
  ]
}