{
  "title": "[Question] Is joining this university worth it in cse or cse with aiml Through jee mains?",
  "content": "I am getting cse in RR campus.... but the fees is 5lakhs and if i look at pgs or hostel it will be around 6.2 to 6.5 lakhs per year.\nI am from a very middle class family would it be worth it using a lot of our savings and taking up student loans just to get btech from here?\nMy comedk/kcet rank is not good so i cant get a college of PES's level from there.... i am getting smvit or sit tumkur level colleges with 3lakhs per year as fees which is more managable\nShould i take those colleges over pes or should i risk it all and take admission  here?\nIk in the end its my decision  but i just need more new opinions.",
  "metadata": {
    "id": "1lot0dy",
    "author": "introverted_s",
    "url": "https://www.reddit.com/r/PESU/comments/1lot0dy/question_is_joining_this_university_worth_it_in/",
    "permalink": "/r/PESU/comments/1lot0dy/question_is_joining_this_university_worth_it_in/",
    "score": 5,
    "upvote_ratio": 0.86,
    "created_utc": 1751345510.0,
    "flair": "Admissions",
    "nsfw": false
  },
  "comments": [
    "Well check the faqs for knowing the pros and cons of pes , but in my opinion a student loan is a big no as it might become a burden for you .. moreover its ur descision now\n└── Yea even i was thinking that the loan will be  a big burden for myself and my family",
    "See , considering you don't have any other options ( BITS , IIITs etc ) your only choice is one of the three -  \nTake a drop , Take pes or Take smvit/sit tumkur etc..\n\nMy recommendation if you're not willing to take a drop would be to take PES and grind for scholarships ( because trust me it's not that hard to get 40 % of ur fees back every semester ) , which will drop the fees to close to ur smvit/sit tumkur fees. If not then work hard and try to make the most of the ROI because PES does have way better opportunities. (especially in cs and related branches which ull get ).\n\nIf you really can't or it requires a lot of adjusting/financial burden then you can consider kcet/comedk colleges or even a drop. Work on your skills , there's opportunity everywhere. Altho taking a loan is risky , talk to your family about that too.\n└── How do i know more about these scholarships?\nCan u give me an overview? Where can i learn more\n    └── [Scholarships - PES University](https://pes.edu/scholarships/)\n\nalso, search on this sub for more posts regarding scholarships. Plenty of people have already explained it in detail.\n        └── Will i get 40% of my total semester fees as my fees will be higher like 2.5 lakhs per semester soo will i get 1 lakhs back? Or is it capped at a certain value?\n            └── Yea the 40 % scholarship is around 1 lakh every semester if ur paying jee mains fees.  In first year the cgpa cutoff for it is around 8.6-8.75",
    "How much did you score in mains\n└── 96%ile\n    └── I think you can also get thapar coe\n        └── Wtf?? thapar is more expensive than pes bro, why would you suggest that to him??\n            └── Yea that too with similar packages and worse location",
    "Also, what is your family income\n└── 12 13lpa\n    └── Go for pes"
  ]
}