{
  "title": "[Rant] Looking for Roommate : Just Want Peace, Code, and No Drama – MCA PES",
  "content": "Since our MCA program kicks off this October, I’m looking for a roommate who’s on the same wavelength as me.\n\n# A bit about me:\n\n* I mostly like staying indoors unless I really need to step out.\n* After finishing my BCA, I worked in tech for a year, but now I’m doing MCA to aim for better opportunities and a higher package.\n* I chose PES because it’s ranked among the top 3 colleges in Karnataka in MCA— felt like the right move.\n* Not much of a socializer — I talk when I have to, but I prefer keeping to myself.\n* I’m quietly active on Reddit(this is my temp reddit account), GitHub, X (Twitter), and LeetCode — I just like to stay low-key and anonymous.\n\nDuring BCA, I somehow ended up doing **5 team projects** because people kept referring me — and I just couldn’t say no. That’s still a habit I’m trying to break. I help people even when I don’t want to, and sometimes that leaves me feeling used. So this time, I want to keep my distance from people who drain my energy or take advantage.\n\nIf you’re someone who values **peace, focus, and personal space**, hit me up. We can figure out a shared PG or flat if it works out",
  "metadata": {
    "id": "1lq3jc4",
    "author": "Frosty-Poet-6524",
    "url": "https://www.reddit.com/r/PESU/comments/1lq3jc4/rant_looking_for_roommate_just_want_peace_code/",
    "permalink": "/r/PESU/comments/1lq3jc4/rant_looking_for_roommate_just_want_peace_code/",
    "score": 9,
    "upvote_ratio": 0.91,
    "created_utc": 1751481109.0,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false
  },
  "comments": [
    "Hey dude, in pes currently right now, studying mca, same description as above, but pes mca is shit, no self time, no privacy, no opportunities to grow, just stay in your damn unless it is 75 attendance, &amp; then go full shot for your own career, don't listen to teachers, either they're too old or too young, single room very costly but go for it for your own peace, affordable means shit area, good luck with going full shot here &amp; ahead.\n\n  \nBAZINGA !!\n└── Lol, you made my stomach feel anxious for a second.",
    "Hii Dm me",
    "Hey, you up?"
  ]
}