{
  "title": "[Question]: Help me with what to do to increase my cgpa",
  "content": "Well I just saw my 1st year results and I did pretty bad my cgpa is 6 ....what are some ways I can improve my cgpa by the time of placements and also what are few skills I can learn by the time next year starts",
  "metadata": {
    "id": "1lqydn0",
    "author": "_eternally_confused_",
    "url": "https://www.reddit.com/r/PESU/comments/1lqydn0/question_help_me_with_what_to_do_to_increase_my/",
    "permalink": "/r/PESU/comments/1lqydn0/question_help_me_with_what_to_do_to_increase_my/",
    "score": 25,
    "upvote_ratio": 1.0,
    "created_utc": 1751570524.0,
    "flair": "Study Help :table:",
    "nsfw": false
  },
  "comments": [
    "study. pay attention in class. revise regularly. read from textbooks. don't fuck around till the last night before the exam. It's not for everyone.",
    "Know what the teacher wants for you to get a higher grade. \n\nSome want you to pay attention to derivatives or units or steps. \n\nAnd look at past papers if possible",
    "considering you're in cs, 2nd yr is only cs type subjects, I'll go one by one for 3rd sem\n1. DDCO: EPD unit 3 on steroids basically, revise your logic gates, USE THE TEXTBOOK and a youtube channel called all about electronics + Neso Academy, make notes, do tb qs and listen in class.\n2. AFLL: Don't need to listen in class, Watch all Preet Kanwal ma'ams videos on pesuacademy you're set for exams.\n3. DSA: listen in class, don't mug up codes, build logic by scribbling out dry runs of codes, will help tons. make notes in class\n4. web tech: trust me on this, Anchor Slides + Anchor Code Examples = S grade, pyq too\n5. MCSE: Easiest by far, slides + cw = S\nStart studying 1mo prior to ISA\n└── Thanks a lot... I'm an aiml student so are the subjects same?\n    └── I'm an AIML student too!\nIn the 160 credits you require for a btech degree from pes, only 16 credits ( the 4 electives of 4 credits each) are different from cse (if u wish it to be, u can take some allowed cse electives as well).\n90% of what u study is same\nYear 1/2/4 are same for CSE/CSE AIML\nYear 3, 6 subjects are same(core ones) and 4 electives differ\n        └── Oh ok tysm!!"
  ]
}