{
  "title": "[Resource] An Indian College Student Laptop Hunting Guide - Made by PESts, For PESts, Inspired by IIIT-B's Work",
  "content": "Looking to buy a laptop but have no clue what all these fancy names and mean? Look no further than this guide!\n\nThis guide explains some of the basic terms and things you should be looking for, as well as a brief on Mac vs Windows and some possible common nomenclature. Do you need a GPU or not (Hint: If your thinking about running AI or ML models, you will definitely be running them on a cloud service like Google Colab)? 8 GB or 16 GB RAM? AMD or Intel? Swipe to find out!\n\nHowever, this guide will not be comparing on the brands yet, it is merely meant to be a start on understanding the terms. Brands evolve and their products may get better. What is true for 1 generation, might not be true for the next. Unless its Dell, avoid Dell laptops at all costs. This guide also does not cover any particular shopping sites or times. Sales are common in India, and its upto you to find the best deal.\n\nFor any edits or corrections, please contact the Discord users mentioned in the pic (67void or Andy34G7) via DMs or in the PESU University Server. You many also leave a comment here or DM me. We will however not hold hands guide you to any particular brand or such. We'll ignore you there.\n\nI'm also looking for either direct collaborators or information on a branch-wise specific detailed section. Use the mechanical one as reference. So if your from any other branch and know well enough about tech, leave a comment or DM me. A permanent link to this is [here](https://www.canva.com/design/DAFmz_SDea0/C35otbB59HZGS3p7XJsajQ/view?utm_content=DAFmz_SDea0&amp;utm_campaign=designshare&amp;utm_medium=link2&amp;utm_source=uniquelinks&amp;utlId=h37342fe28c).\n\nFuture planned updates include: Updating the MacBook section for M3,M4 chips, adding more warnings, more branch-wise specific details, a potential build-a-PC guide, shop locations and maybe more (depending on our free time)!",
  "metadata": {
    "id": "1lrq8qg",
    "author": "protodelver",
    "url": "https://www.reddit.com/gallery/1lrq8qg",
    "permalink": "/r/PESU/comments/1lrq8qg/resource_an_indian_college_student_laptop_hunting/",
    "score": 33,
    "upvote_ratio": 0.98,
    "created_utc": 1751654704.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "If you can update the post, replace the image with a high resolution export (300dpi or higher). Otherwise, great post as usual, Daddy Hughes. Will add to FAQs.\n└── Will do\n    └── Also, please credit the IIITB post/resource as well.",
    "Thankyou father",
    "Why avoid dell ?\n└── Terrible service, bad quality for their price.",
    "As I am from AI ML branch. For what should I go for ?\n└── Are you planning on gaming -&gt; Gaming laptop\nOtherwise, any other laptop will do fine. Check your budget, a minimum i5 or Ryzen 5 processor thats at max 2 years old, and see if the display, keyboard, and build quality is good IRL stores. If you have an iPhone, an Macbook (M series) can be used too and you'll get a nice ecosystem. Otherwise, any Windows laptop (avoid Dell) will do fine\n    └── MacBook would be able to handle those heavy AI tasks? Because I saw most of the seniors use gaming laptops. Btw I have iPhone\n        └── Lmao everyone runs their fancy AI models on the cloud using smthg like Google Colab. Those seniors whom you saw are doing either of these:\n- Lied to their parents so that they can get a gaming laptop to game\n- Didn't bother to research and properly check if they SHOULD or COULD run an ML or other models efficiently in a timely manner and are now crying cause heavy laptop and little battery life\n            └── Ohh… so mac will perfectly fit for me\n                ├── yea will be fine for most things. in case you arent able to run smthg cuz its only windows only, virtualbox or other methods exist. research them\n                └── forgot to add, P.S. if its within your budget sure thing\n                    └── What is PS ?\n                        └── post script? you know the stuff you write at the end of a letter or text if want to add extra information 😭. Did your batch not have letter writing in school or were y'all giving up yourselves for the clankers"
  ]
}