{
  "title": "[Discussion]Where will you rank pes?",
  "content": "",
  "metadata": {
    "id": "1lsg7s9",
    "author": "Mid_night_knight",
    "url": "https://i.redd.it/ai20geowr2bf1.jpeg",
    "permalink": "/r/PESU/comments/1lsg7s9/discussionwhere_will_you_rank_pes/",
    "score": 29,
    "upvote_ratio": 0.91,
    "created_utc": 1751739162.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "There is no right tier system, because there is no accurate way to rank colleges into tiers. The entire concept is ambiguous. \n\nThe truth is, unless you are going to IIT/NIT/BITS/IISc/IIIT or any of the other *very* well known institutions, you do not have any significant competitive edge by being in any college. Odds are you'll do similar in your career, regardless of whether you end up joining PES, Manipal, VIT, SRM, etc. Since your college isn't going to magically open any doors for you, it's on you to study hard, pick up skills for the industry and make yourself hireable.\n└── Hm so the student's skill will decide at the end\n    └── Yes. Only your skills can land you a high paying job/good uni for Masters. Your college by itself won't do you any favours if you don't have the skills.",
    "We are better then VIT and more less same as manipal \nSo tier 2",
    "Wierd that only the pilani campus gets to be elite.\nConsidering how they all have common placements, common proffs and exams.\n├── pilani cse median is above 33L and that of goa/hyd is like between 25-28L\n└── Peer group makes a huge difference , pilani campus has very high scoring people in circuital branches.\n    └── Bro thinks scoring 20 marks more in bitsat makes them a better peer lmao\n        └── It does and placements are better at pilani campus too , pilani campus is the one most top advanced rankers choose. pilani cse median is above 33L and that of goa/hyd is like between 25-28L , quants only visit pilani campus , its for a reason lmao.\n\nare u going to hyd/goa campus?? that u've been fighting for these in all comment sections lmfao.\n            └── I'm already in Bits Goa man going to second yr. I'm just bored at home Lol got nothing to do. But yeah pilani is ofc better than goa but the difference ain't that big like you aspirants and misguided peeps assume it to be lmao.",
    "Tier 1.5 is my choice. VIT in tier 2 is jokes lol, we all know about their mass recruiting scene.",
    "what is msrit and vit vellore doing in tier-2? msrit's placements are kinda crappy(only 45 ish tier-1 companies visited) and they still follow the old vtu syllabus. VIT on the otherhand is a \"dream college\" because they provide \"dream packages\" of 6 Lpa at your dear mass recruitment companies. So generous of them to be fair :)",
    "Would create a new tier called ELITE+",
    "MSRIT is in the list, WHERE'S PES😭\n└── In our hearts",
    "Tier 1.5",
    "This post randomly popped up but never in the last 10 years was MSRIT ranked higher than VIT Vellore and MIT Manipal by anybody.",
    "1.5 ig"
  ]
}