{
  "title": "[Admission] Last date to apply for full refund?",
  "content": "I got admission in pes rr nagar thru jee, but i might get bms thru comedk in rd 3. But the comedk counselling process is immensely late so i wanted to ask when the last date for applying for full refund from PES is.",
  "metadata": {
    "id": "1luseq4",
    "author": "TheVulcanReaper",
    "url": "https://www.reddit.com/r/PESU/comments/1luseq4/admission_last_date_to_apply_for_full_refund/",
    "permalink": "/r/PESU/comments/1luseq4/admission_last_date_to_apply_for_full_refund/",
    "score": 7,
    "upvote_ratio": 1.0,
    "created_utc": 1751990450.0,
    "flair": "Admissions",
    "nsfw": false
  },
  "comments": [
    "15th July is the last date to submit original docs and to get refund incase u wanna withdraw you're seat\n└──  in the \"FULL REFUND\" what amount from 5.10 lakhs will they deduct? and should i have a admission letter from any NIT or BITS to get a refund is this true?\n    └── they will give u 5 lakhs back and no that is not true , u can withdraw if u want but yeah before 15th\n        └── so overall 10k is deducted right?\n            └── yep\n                ├── alright thanks!\n                └── Bhai I'm other than KA student so if I visit the campus in BLR at 20th then I will have to pay the 5.1lakhs after the seat is alloted or before the councelling itself to sit for the councelling?\n                    └── Did u get a seat in the 1st round?\n                        └── no I was asking for round 2 jee councelling on 20th july",
    "15th july, i think going through comedk is better due to fee difference\n├── what should I consider RVITM CSE or PES CSE I have 13xx rank in PES rankcard and 11.1k rank in comedk so Comedk ke through college lena worth rhega ya PES CSE?\n│   └── pes is better for academics and slightly better in terms of placement, but if you're getting rvitm at comedk fees take that itself\n└── also in the \"FULL REFUND\" kitna amount deduct krte hai 5.10 lakhs jo liye the usme se kitna refund krenge?\n    └── 5 lakh\n        └── is it true that we should have an admission letter from any NIT or BITS or any other institute to be considered for refund? also where are you getting that refund last date data?\n            └── no that isn't true at all, it is mentioned on website, they will deduct 10k and refund only 5 lakhs\n                └── alright! thanks brother I appreciate you for the help.\n                    └── np\n                        └── Bhai I'm other than KA student so if I visit the campus in BLR at 20th then I will have to pay the 5.1lakhs after the seat is alloted or before the councelling itself to sit for the councelling?\n                            └── for outside karnataka students, last time online counselling was held, and they had to pay fees in advance, if you're travelling to Bangalore you have to give them DD which will be verified before they let you inside for counselling, I'm from Bangalore so i had to submit DD but not sure exactly what non-KA students have to do"
  ]
}