{
  "title": "[Question] Electronics and communication Engineering at RR campus",
  "content": "For Context, I have read FAQs (The post about ECE at RR campus was deleted by OP), I have searched r/PESU subreddit about ECE, these are the questions for which I was not able to find answers for, any help would be greatly appreciated\n\n  \n1)I have heard from a senior only few core companies come for placements and majority of ECE students go for IT jobs so the management doesn't put efforts in increasing the number of core companies come for placement, instead they put 90% of their efforts in IT sector, is it true??\n\n  \n2)Im also getting AIML in PESU RR, but I'm confused if I should go according to my interest(ECE), which I have heard bad opinions about, or go to AIML( for which I have heard good opinions, I know core CS is better but for my rank it's not possible) so it would help if any ECE/CSE/CSE AIML senior could give their opinion \n\n  \nThank you",
  "metadata": {
    "id": "1lvea7a",
    "author": "Commercial-Driver219",
    "url": "https://www.reddit.com/r/PESU/comments/1lvea7a/question_electronics_and_communication/",
    "permalink": "/r/PESU/comments/1lvea7a/question_electronics_and_communication/",
    "score": 14,
    "upvote_ratio": 0.89,
    "created_utc": 1752052947.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "I'm not from ECE, but from another core branch with worse repute, its more than just \"management not put efforts in increasing the number of core companies coming for placements\". Thats what people who don't understand the industry say. Core companies in general itself hire much lower numbers than IT or consultancy companies. This is for some reasons - people in core companies stay for longer times as experience is valued and and they don't want to retire earlier in general, companies don't need the same amount of engineers as IT or consultancy, training freshers takes time and effort + it take a longer time for them to trust you with the serious work. You will get the boring side of stuff at first and you have no choice but to either prove your more worthy or try to change teams to something more interesting. All of this is the general truth, and you can see them across all nations. Even people in the US or Europe don't necessarily get the jobs. MNCs are slowly allowing Indians in India to have more active roles, but that is different in different companies. Indian companies face their own issues, especially with culture and lack of growth compared to an MNC. Startups are one way to learn a lot in a short period of time in a more risky setting and potentially less paid situation but a potential to pay off. In any career path, you need to work hard and rely on luck more than what any of us can say is comfortable. Is it impossible? No. Is it hard? Yes. The IT sector in India is big for its own reason. \n\nNow, your only probably 17 or 18 and this will be the big choice you gotta to make. Is your interest in ECE strong enough for you to be motivated to take up this challenge? Are you willing to spend more time trying to work on projects, making them better, improving your skills and resume and spending time to work as an unpaid research intern or a low paid corporate intern somewhere else in hopes of a better full-time job? This does not mean you cannot have fun. Fun is what you make of it along the way. You will meet similar people and others interested in core engineering. Think about, explore the fields that are intriguing you in any amount. If you have a good, close relative in the same field, talk to them. Interest, hard work, a lot of work and luck and how you can manage yourself will determine. It might not be the straightforward answer you might want to expect, but IMHO, you this is not something that should be a straightforward answer. You need to critically decide, then adapt and change and grow, or fall\n├── Bro can I dm I want to talk\n│   └── That does not sound threatening at all 💀\n└── I have been interested in electronics for as long as I can remember, I'm also willing to put in the efforts to succeed in this field, my only concern is, will PESU be able to give me the opportunity to do so, and I also need to support my parents by earning, so I have been in this confusion, my other options are ETE at RV, but as I have heard it's not as good as compared to ECE, but thank you for ur reply\n    └── PES doesn't have the best resources. You prolly already found more details on ECE at RR vs ECE in all the posts and stuff. But no place in India will also have the best resources for any core branch. All are relatively, to be frank, dog shit. You need to make do with what you get and have. You can probably find many PES ECE people doing fine in core roles. \n\nIf your financial situation is dire, then take the safer path. You can pursue electronics as a hobby later on, or perhaps even do stuff in it when your situation is to get better. No harm putting family first. But if you are relatively alright, think more. \n\nI can't speak of RV ETE as I dont much about it, but just make sure you did a thorough search of details and introspection before your choices.\n        └── Ok, thank you\n            └── Take ete at rv brother , u can sit with placements along with ece students and the course is 90% the same.\n                ├── if its true, sounds like an alright compromise\n                └── Yeah I have compared the difference in syllabus of ECE and ETE at RV, from 4th sem onwards the major difference comes, ETE will focus on 5G technology, satellite communications(Communication), while ECE focuses on VLSI, Embedded Circuits(Electronics)"
  ]
}