{
  "title": "[Question] for 2nd years and above",
  "content": "Why does everyone hate ddco? Is it that hard? If yes, why\n(Just wanna be prepared beforehand)",
  "metadata": {
    "id": "1lw9b6t",
    "author": "serein04",
    "url": "https://www.reddit.com/r/PESU/comments/1lw9b6t/question_for_2nd_years_and_above/",
    "permalink": "/r/PESU/comments/1lw9b6t/question_for_2nd_years_and_above/",
    "score": 13,
    "upvote_ratio": 0.85,
    "created_utc": 1752143404.0,
    "flair": "Study Help :table:",
    "nsfw": false
  },
  "comments": [
    "ALL ABOUT ELECTRONICS and Neso Academy are your only saviours",
    "If you get a good teacher, listen to them and make proper notes and follow them as they teach DONT create your own personal study backlog especially in this subject and do solve problems from the textbook. \n\nIf you feel your teacher isn’t good enough then REFER TO THE TEXTBOOK along with youtube videos if you want visual representation suggesting - NESO ACADEMY.\n\nProperly understand the verilog part, dont get carried away with using chatGPT during lab sessions\n└── &gt;\" DONT create your own personal study backlog\" What do you mean by this?\n    └── Meaning study as and when they teach dont leave it for later, they may go far ahead in syllabus and you might get left behind and each topic is related to the other so it gets difficult to catch up",
    "I am among the very few who actually enjoyed ddco to the point it was my favourite subject of 3rd sem.\n\nI won't disagree with the retarded subject structure of ddco and the lack of cognitive abilities of ddco teachers.\nI was blessed with a decent enough faculty who made the subject most fun for me and actually clarified doubts.\nBut no matter what how much a teacher can explain you still might have more doubts left one day before isa than you had in class. \nSo the only way to actually love or even make the subject decently more fun irrespective is to treat the textbooks like your 1st source of information and reference material. You can literally say fuck you to slides and just keep them to check if a topic is in syllabus or not maybe.\nBut when you lock in for ddco, you have your syllabus, textbook and notes(if u made in class or want to make on ur own).\n\nI understand the amount of hate most of my peers have to DDCO was mostly them crying about it being \"soo ece based\", \"why do we need this in cs\", \"why do we have to study ece stuff in cse\" type of things, but yes they are right and wrong.\nDDCO like subject literally forms one of the few basics of you plan to become a person who might someday work on the borderline of ece/cse where uk at times the conceptual border won't even exist.\nIt's not for everyone yes but it is very required, to understand how the basics of your computer works and it's not irrelevant believe me.",
    "NESO ACADEMY FOR THE WIN.",
    "Just be curious to know how binary works under the hood.",
    "Bruh unit 4 epd slides itself were shit.\n└── Lol , u haven't experienced the shit slides from 2nd year onwards , truckloads of material in each unit in many subjects. Glad that we only have 2 credit subjects in 4th year"
  ]
}