{
  "title": "[Discussion] Confused Between Colleges for CSE – Prioritizing Good Campus Life, Hackathons, and GATE Prep",
  "content": "Hey everyone,  \nI’m in a bit of a dilemma and could really use some advice from people with experience.\n\nI’m only interested in Computer Science and related specializations — not open to any other branch (i am bad at anything else). Based on my KCET rank, I’m comfortably getting into most of the \"big name\" Bangalore colleges like BMSCE, RIT, and PESU (South campus), but unfortunately not RVCE.\n\nHere’s what I’m looking for:\n\n* **My top priority is a decent, balanced campus life** — I don’t want a super strict or toxic environment.\n* I want exposure to **good coding culture, hackathons, project-based learning, and competitions**.\n* I'm **not overly concerned about placements**, because I’ve already started preparing for **GATE**, and I’m quite set on pursuing [M.Tech](http://M.Tech) in the future.\n* So the only thing I want from my undergrad is a **supportive environment** for GATE prep, coding events, and personal growth — not just marks and mass recruiters.\n\nIf you’re someone studying or who has studied at any of these colleges (BMSCE, RIT, PESU, or others in Bangalore), I’d love to hear:\n\n* How is the **overall campus life**?\n* Are there **active clubs or communities for tech and competitions**?\n* How much **freedom/flexibility** do students get?\n* Any unexpected pros/cons that you’ve seen?\n\nAppreciate any insights — I’m trying to make a decision that aligns with my long-term goals, not just brand names.",
  "metadata": {
    "id": "1lwg7zo",
    "author": "SwarnavChand",
    "url": "https://www.reddit.com/r/PESU/comments/1lwg7zo/discussion_confused_between_colleges_for_cse/",
    "permalink": "/r/PESU/comments/1lwg7zo/discussion_confused_between_colleges_for_cse/",
    "score": 0,
    "upvote_ratio": 0.25,
    "created_utc": 1752162687.0,
    "flair": "Admissions",
    "nsfw": false
  },
  "comments": [
    "You took the time to write out a long question but did not spend even 10% looking up answers on the subreddit, did you? Everything that you have asked for - campus life, clubs, freedom and pros/cons - all of them have either been discussed multiple times in various posts, or have a dedicated FAQ for it. Please use these resources before posting duplicate questions.",
    "&gt;I'm **not overly concerned about placements**, because I’ve already started preparing for **GATE**, and I’m quite set on pursuing [M.Tech](http://M.Tech) in the future.\n\nHow have you started preparing for GATE? You haven't even entered college yet. It's fine if you want to think that you want to do masters in the future, but are you don't seem to have mentioned any research aspirations anywhere so I doubt its for that\n└── Your question is valid. Actually I have an elder sister who is already doing Mtech from IITK and has given me contacts of CSE seniors, who have given me the sources and guide for preparing from first year. So far it's going well. I didn't mention any research interest because it was not really the topic for which I was looking for suggestions, because that would be too far fetched for now.\n    └── No, I'm just curious as to why you want a MTech so much that you have started preparing for GATE so early. Especially considering GATE syllabus is based on what you learn in BTech/BE, where I'd assume actual engineering classrooms or assignments to be more useful in learning for whatever branch, than some coaching center-like material\n        └── It's practically in our culture to turn everything into a rat race\n            └── ![gif](giphy|PMxnYeZ3q2ZUBcRip9)",
    "BIT and RIT coding culture is great.\n├── I find that hard to believe\n└── Thank you for suggesting, I will look into it. :)"
  ]
}