{
  "title": "[Admission] Second round counselling update",
  "content": "https://preview.redd.it/j4mf6unc0ecf1.png?width=1431&amp;format=png&amp;auto=webp&amp;s=c2880dd66344d0bae08998794afec2d76d8d359a\n\nhttps://preview.redd.it/xlbzwsnc0ecf1.png?width=1478&amp;format=png&amp;auto=webp&amp;s=f62d8026d776adf1581a51084617753651deed13\n\n",
  "metadata": {
    "id": "1lxtgsi",
    "author": "Intelligent-Cat8630",
    "url": "https://www.reddit.com/r/PESU/comments/1lxtgsi/admission_second_round_counselling_update/",
    "permalink": "/r/PESU/comments/1lxtgsi/admission_second_round_counselling_update/",
    "score": 4,
    "upvote_ratio": 0.83,
    "created_utc": 1752301239.0,
    "flair": "Admissions",
    "nsfw": false
  },
  "comments": [
    "[campaigns.pes.edu/2025/counseling/3101/](https://campaigns.pes.edu/2025/counseling/3101/)   \nhere is the link",
    "My rank is the same as the last round, but many students registered after Round 1 counseling. So why hasn’t my rank changed even by a single digit? Are students who registered after Round 1 not being considered for Round 2 counseling?\n└── Go to the link , It says we can participate in round 2 for upgradation don't know how they are gonna give seats based on pesu rank . My rank is also same as round 1",
    "can i get my rank card generated even if i have not participated in the first round , at this point i have paid the fees  but unable to upload my jee main scorecard\n└── U got to apply for round 2??\n    └── I registered but after round 1... So I couldn't upload my jee scorecard",
    "is registration over for this round ?\n└── Yes\n    └── is there any way i can still fill the counselling with my jee main score ?? 🥲\n        └── They will open again on 22nd july\n\nhttps://preview.redd.it/ka4jh776becf1.png?width=1080&amp;format=png&amp;auto=webp&amp;s=9981ec6c07d2f98fdec9a377110345f75776d3b8\n            ├── do u k the cutoff ? , i got 95.5 in jee , will i get any cs related branch ?\n            │   ├── easily brother, u will get at rr campus too.\n            │   │   └── is it better than thapar coe , lnmiit ece or pec mech ?\n            │   │       ├── between pes and thapar , take pes. (but like if fees is not a problem u can go for thapar, much much better college life than what pes will give for similar placements)  \nBut if ur interested in ece then go for lnmiit ece , but if ur taking ece just for the sake of cs placements then go for pes itself.  \nMech is a completely diff branch so cannot comment\n            │   │       └── Same options bhai pes ke liye register nhi kiya 😭 regret ho raha hai 96.6 percentile hai lnm cce aur thapar copc aur dtu mech options hai\n            │   │           └── Well tere saare options pes cs se better hai\n            │   │               └── Idts pes ka avg bohot jyada hai ig lnm ka infra aur location shit hai dtu mech mei placement nhi hai thapar is the only okaish option …..vapas khulegi kya registration?\n            │   ├── What's your PESU JEE rank. Depends on that\n            │   │   └── i havent registered yet\n            │   └── You may get, but keep the backup ready.\n            └── can i get my rank card generated even if i have not participated in the first round , at this point i have paid the fees but unable to upload my jee main scorecard\n                ├── Did u get to apply for round 2??\n                └── How u paid fees without getting a rank. Did u get management seat\n                    └── I was able to submit 1200 but then it said \"can't enter application number detail as portal is closed\" . They did take 1200 from me so I am wondering if I can fill the details now ."
  ]
}