{
  "title": "[Question]Union bank in second year",
  "content": "I am going to 3rd sem currently and haven't made union bank account yet.Is it too late to make one and get future scholarships?I joined through kcet\n",
  "metadata": {
    "id": "1lzcufv",
    "author": "Muraligog",
    "url": "https://www.reddit.com/r/PESU/comments/1lzcufv/questionunion_bank_in_second_year/",
    "permalink": "/r/PESU/comments/1lzcufv/questionunion_bank_in_second_year/",
    "score": 2,
    "upvote_ratio": 1.0,
    "created_utc": 1752466331.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "Have you paid the scholarship fund fee? If no, then you can't get a future scholarship otherwise yes\n├── btw for people who have not paid scholarship fees for the first year which amounts to 1.13L, we have to pay the same amount as fees for next years right since we are not eligible anyways\nThe fees structure says we gotta pay 1.30L\n│   ├── Yeah you have to pay 1.13 L only in all upcoming years. But if you have paid 1.30L in the first year then every year it stays same .\n│   └── 1.2 lakh not 1.13 right?\n│       └── yea my bad\n1.07L to KEA and 13k to PES\n├── How much is scholarship fund fee\n│   └── Depends on your batch, for our batch it was 10k.\n├── We have to pay a fee to receive the scholarship??\n│   └── For KCET students yes, for others it is included in your fees.\n│       └── alright thank youu\n└── No I haven't.So making a union bank account for this purpose is useless then?\n    └── If you haven't paid then also you should have a union bank account, if you get a sgpa above 7.75 you will get dac award(2k), which will also be credited to union bank account only; So atleast if you score 7.75+ for next 6 semester you will get 12k without paying any scholarship fund fee.\n\nSo, do open it as soon as possible; there is no condition that the account should be with union bank pes branch only, so you can open it in your hometown and use it for general uses also;"
  ]
}