{
  "title": "[Resource] Tips for ECE Students",
  "content": "This doc is based on over two years of firsthand experience in PES ECE, offering a brutally honest take on what to expect, how to survive, and how to make the most of your four years. Whether you're here by choice or chance, read this before diving in. It myt feel a bit biased to a few students based on how rigorous the course is or since there's no sugarcoating on it, but that's how your next 4 years will be. This doc just sums up how ECE will be irrespective of the campus you are in.\n\nIf you have taken ECE, let’s hope it's because you actually like the subjects in it or are genuinely interested in them and not only because you didn’t get CSE/AIML or thinking that you can get into both, SW/HW after doing ECE, cause those are the biggest misconceptions ever. If you have taken ECE due to any of these reasons, just change ur branch or else you’re in for a roller coaster ride for the next 4 years. \n\n\n\n1. ECE in PES is a bit different from ECE in other colleges. You will pretty much be learning the same subjects with an exception and a few subjects in earlier semesters and ECE isn’t a cakewalk, it is definitely harder than other depts (mech included) with the only possible exception being EEE maybe.\n2. EPD will be the only subject you will be learning in 1st year from the ECE dept. This subject will form the broad basics of what you will be learning in the next 4 years and all the way up to your placements as well. Yes, companies test your **basics of electronics** for the major part and then your area of interest or core concepts. \n3. Like everyone’s said before, it's not that all teachers are good and better, there are teachers along the entire spectrum, from bad to worse and even some of the best teachers for that subject you can find than in any other college. Each sem will be different, you might get a clutch of all good or all bad or mixed, which is always the case.\n4. Coming to the subjects in ECE, most of them are **math intensive** and need you to be strong with your fundamentals such as probability, statistics, different series and transforms, even integration is needed. They are not easy per se, but you will have a light subject every semester to lessen the load such as Maths in 3rd sem and digital VLSI in 4th sem. The other subjects will be of different difficulties, sometimes one being harder than the others. Take it with a pinch of salt and study all the subjects without deflecting any of them.\n5. You will have good teachers, so make the best use of them, keep asking them doubts until it's cleared and don’t leave them until you do. Learn from your peers, **read TBs which are very important and make sure you get the concepts clear before exams**, which will ensure that you can score well in exams and not depend on rote learning.\n6. **DO NOT BYHEART STUFF OR ROTE LEARN ANYTHING IN ECE, YOU WILL END UP LOSING MORE THAN LEARNING. GET YOUR CONCEPTS CLEAR FIRST AND LEARN TO APPLY THEM IN PROBLEMS AND REAL WORLD**. Solve as many numericals as you can for any topic and even basic GATE level questions because the exam papers (both ISA and ESA) will have questions from GATE papers or of that level at least.\n7. Peer pressure is real guys and do not let anyone tell you otherwise. Due to the above mentioned reasons, you will see students of all sorts in ece; ranging from nerds to people who have fun but still score well to mediocre students to failures and anyone in between and all this adds up to give you a skewed gpa graph that varies semester to semester. Do not take that too much to your heart and keep your efforts consistent. **CONSISTENCY IS THE KEY TO SCORE WELL IN ECE**. Keep yourself regular with studies and do not pile up towards the end and you can comfortably have a good GPA throughout your journey in PES.\n8. There will be labs for most of the subjects, do not limit yourself to lab programs and assignments. Explore the tools and do something of your own (labs get over pretty soon, so you’ll have a lot of time on your hands). More importantly, notice where you’re applying theoretical concepts and knowledge. Make sure that you are continuously improving your skill set and do not lack anywhere. It can be anything, from running basic codes on matlab or using design tools but make sure you do have something. If you feel like you still wanna improve, you can always approach teachers and work under them with summer projects or even internships.\n9. During exams and exam seasons, it's common to see more ECE students in the library or study centres more often than your CSE counterparts. Do not worry, because it's a given that an ECE student needs to put in more effort to score the same (excluding the exceptions ofc). \n10. Comparison is healthy among peers, but do not make it an unhealthy competition or obsession like a few do. If your CSE friends are scoring more, do not worry. Placements are different for both branches unless you're aiming for CSE based companies.\n11. In between all this, don’t forget the most important part : **to have fun. Go join clubs, take part in events and hackathons, attend fests and go out with people.** PES can make your college life beautiful if you make the right use of it. So make sure y’all enjoy your 4 years here and make tons of memories!!!",
  "metadata": {
    "id": "1m09h7z",
    "author": "Sunnysnivellus123",
    "url": "https://www.reddit.com/r/PESU/comments/1m09h7z/resource_tips_for_ece_students/",
    "permalink": "/r/PESU/comments/1m09h7z/resource_tips_for_ece_students/",
    "score": 39,
    "upvote_ratio": 0.91,
    "created_utc": 1752557355.0,
    "flair": "Study Help :table:",
    "nsfw": false
  },
  "comments": [
    "Damn\n\nI'm thinking of switching my branch to ECE, so this will be pretty helpful\n\nThank you for this!\n└── Switching from what? And why?\n    └── I mean, I know this will never really happen because of factors beyond my control, but..\n\nI want to switch from CSE to ECE\n\nAs absurd as it sounds, let me clarify that I do not intend to downplay CSE as a branch, however, it looks like ECE is better suited to my interests and needs, even if it may be harder than CSE from what I've heard from seniors\n\nEPD and Math were my favorite subjects last semester so I hope you understand where this feeling is coming from\n\nOn another note, I've gone through the sem 3 syllabus of both CSE and ECE quite a few times and I think ECE subjects like NAS and Signal Systems are more compelling for me than CS subjects like AFLL and Webtech\n        └── I know someone who has shifted from CSE to ECE",
    "I'd recommend putting the content into the post. Linking to an external doc also exposes your identity. But good post, will add to FAQs.\n└── done, I've added the content to the post. Thanks for the suggestion!!",
    "Everyone says that ECE is math and physics intensive and we need to keep our basics strong, can anyone actually tell what fundamentals I need to focus on the most? (Yes i read the document and I saw stats, integration and all that but Im asking in general for both math and physics)\n├── Lmk if you get to know that too\n└── Definitely it is both math and phy intensive, math will deal with different series and transforms for conversions and so on. Phys comes into picture when ur talking about quantum and electronics part i.e circuitry or flow of current. The most important aspect of physics being used is in quantum followed by Electromagnetic Field Theory i.e ur class 11 and 12 topics consisting of electricity and magnetism.\n    └── What would you recommend to learn/revise before coming to college then\n        └── Nothing much actually, you'll be taught EPD in 1st year which is Electronic Principles and Devices which gives u an insight into what you'll be learning, but you wouldn't be needing to learn anything before you come as 1st years have commin subjects irrespective of your chosen stream.",
    "thankyou, kind senior!",
    "can you recommend me some books or yt channels so that I can gain a lot more  interest in ece subjects"
  ]
}