{
  "title": "[Rant] A story from a time much simpler than ours",
  "content": "**Hello** r/PESU **– newcomers, seniors, and my fellow batchmates,**\n\nI come to you today with a story.\n\nA story from a long, long time ago, yet one so scarring that I remember every detail as if it happened yesterday.\n\n\\----------------------------------------------------------------------------------------------------------------------------\n\nIt was a cold June morning when I got a DM on Discord from my homie:  \n**\"Results are out.\"**\n\nThat night, I opened the provisional results on pesuacademy. And like most others on results day, I was deeply disappointed.\n\nEven in subjects I had studied for *years*, I received poor grades.  \nI discussed it with my friends, and immediately, something felt off.\n\n\\----------------------------------------------------------------------------------------------------------------------------\n\nUsually, for *most* subjects in *most* semesters, the grade curve is skewed toward an A, with maybe a couple hundred students scoring S grades.But this time, Things were different.\n\nIn one subject, the curve skewed toward a B, and only six people scored an S.\n\nSurely, this couldn’t be right.\n\nEven the smartest people I know, folks who always ace everything, got poor grades. They all advised me to go for ESA reviews.\n\n\\------------------------------------------------------------------------------------\n\nSo I opened my wallet.  \nA fly flew out.\n\nBut I coughed up the currency from my already-dwindling resources, and went ahead with the reviews.\n\n\\------------------------------------------------------------------------------------\n\n**Review Day.**  \nMy jaw dropped.\n\nThe answers were *wrong.*  \nAnd not just one or two, I found five or six that were clearly incorrect.\n\nAnd I don’t say this out of ego. I fully understand the irony of an undergrad calling out a team of PhD professors, but some of these mistakes were *inexcusable*.\n\nI remember one clearly: it was a Dijkstra algorithm question.  \nTheir answer was 14.\n\nBut I, being a human with working eyes, traced out a path of **13**.  \nI went home, re-solved the problem, still got 13.\n\n\\------------------------------------------------------------------------------------\n\nMind you, this wasn’t some advanced AI algorithm.  \nIn CS, a basic graph problem with 10 nodes isn’t rocket science.  \nIt’s like solving a maze from the back of a Classmate notebook, even a kid could do it.\n\nAnd that was just *one* question.  \nThere were many more like it.\n\nYou can imagine my shock when I realized:  \nA team of \\~20 PhD professors couldn't correctly solve an undergrad-level paper that **they themselves set**.\n\nThey really will give *anyone* a degree these days, wont they?\n\n\\------------------------------------------------------------------------------------\n\nThey say incompetence has no emotion.  \nBut among the PESU faculty, even *shame* seems to be in short supply.\n\nStill, I did the obvious thing, I forked up *even more* of ***my money*** to send my paper for re-evaluation.\n\n\\------------------------------------------------------------------------------------\n\nTwo weeks passed. No update.\n\nI eventually found, from a friend, that the fuckass mobile app shows outdated data unless you update it via Play Store.  \nApparently, these PhD *computer science* professors can’t implement a backwards-compatible API.\n\nAnd guess what?  \nNo change in my grade.\n\nOut of 30 people I asked, **not a single** grade had changed.\n\nIt really did feel like Jawahar just **stole my money**.\n\n\\------------------------------------------------------------------------------------  \nI tried talking to professors.\n\nAll I got was:\n\n&gt;“We can’t do anything about it.”\n\nAnd that’s when it hit me.  \nI am but a speck of dust in this tsunami of destruction through indifference.  \nI cannot stop it, and I cannot change it.  \nI cannot save my juniors from it.  \nAll I can do is warn the newcomers:\n\n&gt;The institution does **not** care about you, or fairness, for that matter\n\n**To the Reddit mods considering removing this post**:  \nI'm not criticizing the college or its processes maliciously.  \nI *fully understand* how hard it is to correct 1000+ papers with zero mistakes.\n\nAll I'm saying is, you, the reader, and probably my junior, need to understand this:  \nThese numbers? They’re **somewhat arbitrary**.\n\nOf course, Try your best to maintain a good GPA. But if you can’t,  \n**Don’t punish yourself.**\n\nThis system fails even the smartest people.  \nAnd often, your failure might not even be your fault.\n\n**I love you.**  \nTake care. 💙",
  "metadata": {
    "id": "1m0g500",
    "author": "complainboxofpesu",
    "url": "https://www.reddit.com/r/PESU/comments/1m0g500/rant_a_story_from_a_time_much_simpler_than_ours/",
    "permalink": "/r/PESU/comments/1m0g500/rant_a_story_from_a_time_much_simpler_than_ours/",
    "score": 136,
    "upvote_ratio": 0.99,
    "created_utc": 1752581533.0,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false
  },
  "comments": [
    "We've *never* removed posts that criticise PESU, unless they contain false or misleading information. That's what this sub was built for. \n\nThe only posts we actively remove are duplicates. We hate them with every bit of our soul.",
    "When have the mods removed posts of criticism against PES 😭?",
    "r/usernamechecksout",
    "If new people  joining this college see this post they won't be considering it anymore ig😭",
    "Tbvh, the reason the PESU app sucks has nothing to do with the profs and their educational qualifications. It's more to do with the incompetence of whichever IT consulting firm PESU paid to build the app for them",
    "6 PPL S grade so u must be talking about CN (4th sem)\nThe results graph which they show include both CS and AIML batches\nSince aiml batch got one of the old pyq as it is ,maybe they decided for strict evaluation"
  ]
}