{
  "title": "[Placements] Placement Statistics - 2025 batch",
  "content": "This is the placement stats of 2025 batch from Placement office. it is official.\n\nhttps://preview.redd.it/p1oft9nlwgdf1.png?width=2124&amp;format=png&amp;auto=webp&amp;s=58bb8c1f2071405a1bcf4e11ac39563480bd22fe\n\n",
  "metadata": {
    "id": "1m2dc4i",
    "author": "SoftwareDev54",
    "url": "https://www.reddit.com/r/PESU/comments/1m2dc4i/placements_placement_statistics_2025_batch/",
    "permalink": "/r/PESU/comments/1m2dc4i/placements_placement_statistics_2025_batch/",
    "score": 62,
    "upvote_ratio": 1.0,
    "created_utc": 1752772448.0,
    "flair": "Placements 🤑",
    "nsfw": false
  },
  "comments": [
    "Not even half the ece batch is placed wtf\n└── I’ve always felt that PES revolves around the CSE branch and the other branches are pretty much just an afterthought\n    └── 500 cs students also unplaced bro",
    "Ece and eee core 🤡🤡\n└── Mann but think of it eee is still better our of 60 22 or smtg is placed so 33 percent almost and the other branches are still worst",
    "Scary stats",
    "yea this was scary, few days back i went to rr campus to submit my documents and then went to the placement cell to see the placements the guy sitting over there told us that they have put out placement statistics outside But since i was getting admission in ec campus next day i went there and apparently they too had a placement cell where the placement head was a professor who taught 3rd year onwards and he had detailed placement statistics in his room where RR CSE came out to be 17 EC CSE was 14.5 Total CSE Average came out to be 15 and no. Of students placed were much higher so yea idk which one to actually trust since i saw both being claimed true by the respective placement heads\n├── Hey hey can u plz share that?\n│   └── I really wish i had clicked that but i didn’t, anyone from ec campus can go into placement cell and share that, that’d be really helpful he had everything written on a whiteboard in his office\n│       └── No one's doing it 😭 fine thx for the info\n│           └── that’d be great if someone shared it would literally contradict these stats😭\n└── Maybe off campus included \n    ├── Off campus and PPOs aren't counted by PES in their stats.\n    └── What kind of off campus placements have students pulled off that mean salary reached 17?\n        └── Bro maybe it's around 17 for on campus placements as well..\n            └── Yea that’s what i was saying and RR campus’s placement head idk he felt off to me but when i talked to ec one he knew alot and discussed everything in depth\n                └── Yeah he's nice... ",
    "This sheet shows the placements of RR+ECity combined as they happen together right?\n\nAlso, AIML is merged with CS?\n└── AIML first batch of placement will happen this year ie class of 2026. So till now there is no stat about aiml.\n\nAnd it consists of both the campus together.",
    "What was the total batch strength of cse?\n└── probably around 1300 or 1400, so kind of 1/2 student is unplaced\n    └── But then how can the median be 12lpa or 14lpa (the figures generally quoted)....do they just take the median of placed students and forget about the rest?\n        └── Yes. That is how they calculate metrics in all colleges. It's always the stats of the placed students. \n\nIt's actually a difficult problem if you think about how to account for unplaced students, because using a \"0\" for them would highly skew the results.\n            ├── Ah ok understood..but the stats r kinda scary...1 out of 2 students in cse is unplaced😭\n            │   └── The number isn't completely accurate because the total also includes students not sitting for placements. Eligible here only refers to those who could have sat for placements. Many choose Masters, off campus, etc.\n            │       └── Yea that's kinda reassuring\n            └── Is 1243 the no of eligible students from both campuses ?\n                └── Yes",
    "For CSE number of students placed are 767, but FTE are just 362 rest all are just internship without fte ah?\n\nDoes this mean like out of 1243 students only 362 students got fte others didn't??\n\nPlease clarify seniors!!\n└── I'm guessing it means 362 got internship along with FTE and\nThe rest got only FTE\n    └── I don't know why seniors are not replying...please tell us about this\n        └── A lot of my friends aren’t getting converted unfortunately",
    "What's the average and median?\n└── Donno, ask in placement office maybe",
    "‘25 here, ask away any questions y’all have\n├── Are placements really not that good in PES ?\n└── What the median and % placed in cs",
    "This is scary\n└── It's actually considered good lmao 😂, better than many nits.",
    "Does this include off-campus placements ?\n└── No",
    "Does T1 refer to like 10LPA+?\n└── 12L &amp; above\n    └── got it! Thanks!"
  ]
}