{
  "title": "[Placements] Highest package in the history of PES",
  "content": "Hello everyone, As I'm going to join pes soon. So i just wanted to know the highest package of pesu. I just could get to know it was a 1.5 Cr. But didn't get the detailed information as who was the one to bag it. What were the skills,the qualities required to get such a huge package. I believe it must be a fintech company. \nSo yeah,any pes seniors who would let me know please. Thank you for your time ^_^",
  "metadata": {
    "id": "1m3v6h1",
    "author": "_ash_ketchum_6",
    "url": "https://www.reddit.com/r/PESU/comments/1m3v6h1/placements_highest_package_in_the_history_of_pes/",
    "permalink": "/r/PESU/comments/1m3v6h1/placements_highest_package_in_the_history_of_pes/",
    "score": 22,
    "upvote_ratio": 0.77,
    "created_utc": 1752928548.0,
    "flair": "Placements 🤑",
    "nsfw": false
  },
  "comments": [
    "Sarang was placed for 1.5cr. Although it's not a very accurate story since his job location isn't in India. As for what skills are needed - whatever skills are needed to land any T1 job + *very* good negotiation skills lol. From his profile, there isn't anything standout (at least the last time I had checked when this news has broken out) compared to other people who tend to get T1 offers. He played his cards right + was a bit lucky too. Dude used his existing offers to negotiate with the company to offer him a higher pay. Odds are if you do it today, you'll be rejected, so don't even try.\n└── Like why be getting rejected?. I didn't get it\n    ├── 1. You're in absolutely no position to be negotiating with recruiters. You're a fresh grad bringing 0 years of experience and barely what is needed to the table. \n2. The job market today isn't what it was years ago. If you try to play smart, they'll just move on to the next shortlisted candidate who is willing to join at their proposed package.\n    │   └── Oh, got it. Thanks for elaborating it!\n    │       └── No problemo, Ash\n\n![gif](giphy|OaomGL55IkfXKynnQS)\n    │           └── 🤣😆😆\n    └── market is very bad , so bad that even having a job is considered a win.\n        ├── Honestly, social media makes it seems way way more worse and makes it seems as though we're totally cooked. Idk about immediate jobs after btech but when jumping jobs, it's not that tough. You can negotiate too\n        │   └── Negotiation is effective only when you have some form of leverage. As a new grad with 0 years of experience going through the on-campus placement route, you aren't really an in-demand talent they are desperate to recruit, and thus have no upper hand here.\n        └── \nOhh",
    "[Sarang Ravindra](https://www.youtube.com/watch?v=HYUNk48n05k) 's Roadmap on what actually happened and how did he get the offer.  \nThe video uploader is not him , the one speaking in the video is.  \nAll the things you asked has been told by him in the video , watch it fully.\n└── The comments on that video is.... concerning.",
    "If u join the PES Discord server or maybe search in this subreddit, maybe u wud get some info"
  ]
}