{
  "title": "[Placements] I saw 2 different stats",
  "content": "It’d be really helpful if any senior can throw some light on this, Few weeks back i visited RR CAMPUS To Submit My documents And We Went to Placement Cell Where The Placement Head told us Average is 10-11 Lpa and only 55% have been placed* (they only included fte) interns they didn’t include, When asked why the nos. Are so low he said it is what it is, but I Got CSE in EC campus and next day i visited the placement cell of EC Campus, Ig He was a Professor Who Taught from 3rd year onwards and he had totally different stats in his office on a whiteboard where RR CSE came out to be 17.   EC CSE Came out to be 14.5 or 15 can’t remember and Both the campuses Average and Median Cse came out to be 15 and 14 respectively And he said 75-80% got placed, 5-10% went for higher studies, some off campus, some obviously would go unplaced and some had their own startups so why do these no. Differ so much? And It’d be really helpful if anyone from EC Campus Can Share the stats shown in placement cell here, Both The Figures totally contradict each other ",
  "metadata": {
    "id": "1m4bglu",
    "author": "Hopeful-Yoghurt-1285",
    "url": "https://www.reddit.com/r/PESU/comments/1m4bglu/placements_i_saw_2_different_stats/",
    "permalink": "/r/PESU/comments/1m4bglu/placements_i_saw_2_different_stats/",
    "score": 30,
    "upvote_ratio": 0.93,
    "created_utc": 1752971360.0,
    "flair": "Placements 🤑",
    "nsfw": false
  },
  "comments": [
    "The RR campus dude,most likely either Mr.Someshekar or Dr.Sridhar told you about the placement stats for BTech as a whole and as mentioned he didn’t include internships as those usually come with a performance based conversion type scene.\n\nThe EC campus dude probably told you about just CSE placements which tend to be a lot higher and most CSE folks do end up getting placed.\n\nCheck the subReddit for placement stats\n└── Idk the names but we asked specifically for CSE AND IN RR WE GOT 11 LPA AVERAGE While In EC everything was written in detail and stats differed alot And I saw the placement sheet, average would be much higher than 11 considering the data given in the sheet",
    "Check out the following post. It'll give you a good idea about the placements here\n\nhttps://www.reddit.com/r/PESU/comments/1l16bng/placement_statistics_compilation_2022_to_present/?share_id=wc8J2iRmoCbY4K2kCBOAu&amp;utm_medium=android_app&amp;utm_name=androidcss&amp;utm_source=share&amp;utm_term=2",
    "placements are fked up lol median is 7-8 lpa and considering \\~2400 students will sit for CSE placements only it's going to be blood bath!\n├── I mean atmost 1800 are eligible for placements considering many go for higher studies and everything, and 1800 is a decent amount almost every college has these many students sitting in the placements so yea and atleast the companies are coming here rest is on us so can’t blame them\n└── How 2.4k? CSE students are 1440 and aiml students are 800ish no?\n    └── that also make up to 2240 students and considering some Electronics branch student will sit for cse placements too so it's fucked up!"
  ]
}