{
  "title": "[Question] What happens if we dont collect the temporary id card after document submission?",
  "content": "So from the title, u can see I kinda messed up. Basically noone said I have to collect a temporary id card after document submission. I got to know about it from freshers grp. So now, how do we fix this? Will I be allowed to collect it on orientation day?",
  "metadata": {
    "id": "1m4mo25",
    "author": "Swarno007",
    "url": "https://www.reddit.com/r/PESU/comments/1m4mo25/question_what_happens_if_we_dont_collect_the/",
    "permalink": "/r/PESU/comments/1m4mo25/question_what_happens_if_we_dont_collect_the/",
    "score": 6,
    "upvote_ratio": 1.0,
    "created_utc": 1753011049.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "ok nothing that serious , just show your pesu app at the entrance while coming , cet ppl got it like after 3 weeks lol , we used just show our pesu app",
    "Nothing's gonna happen, they'll give you official ID cards 1-2 weeks into classes.",
    "I didn't even know there was a temporary ID card. If you manage to solve this issue please share",
    "Bro is there any PES WhatsApp group? And can u help me a little \n└── Are you in discord? U can find the link there\n    └── I am not on discord, don't even know how to use it \n\n\nAnd one thing, civil branch still exists? I saw few seats (4) in comedk's seat availability pdf \n        ├── Comedk? Is pes even in comedk? From what I know, civil branch doesn't exist anymore.  Also pes takes only through kcet and jee mains (and management quota) from what i know. (Also u aren't missing out on anything major if u are not in that grp)\n        │   └── Yes sorry, its PES college not PES Uni\n        └── Join Discord. PESU runs on discord - various clubs, events etc are all managed primarily through discord. Might want to get used to it. \n\nAs for ComedK: PES does not take in admissions through ComedK. And there is no civil engineering anymore.\n            └── Yes thank you and sorry, i didn't know PES college is different and PES uni is different "
  ]
}