{
  "title": "[Discussion] Do you all link your resumes on your portfolio sites?",
  "content": "Is it safe to include resume with phone number on the portfolio?\nOr is it better to avoid adding a downloadable resume altogether due to privacy concerns?\n\nDo you upload your resumes publicly? Redact contact info? Or just skip the whole resume link and rely on LinkedIn/GitHub?",
  "metadata": {
    "id": "1m66lb6",
    "author": "Known-Anxiety-4407",
    "url": "https://www.reddit.com/r/PESU/comments/1m66lb6/discussion_do_you_all_link_your_resumes_on_your/",
    "permalink": "/r/PESU/comments/1m66lb6/discussion_do_you_all_link_your_resumes_on_your/",
    "score": 4,
    "upvote_ratio": 1.0,
    "created_utc": 1753165137.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "When you're putting it out publicly (on your portfolio site, GitHub or pretty much anywhere it can be accessed freely) upload a version without your phone number. \nUse the one with your phone number only when you're applying on portals.\nDownloadable resumé should be fine I guess, I've seen a lot of people do it. It'll have only your mail ID and GitHub/linkedin, so shouldn't be much of an issue.\n└── Ahh niceee. Only replacing the digits with XXXX, works right ? Or just remove the whole thing ?\n    └── Either should work, but if you're replacing the digits with something make sure you don't use non ascii symbols. It won't get parsed properly by an ats scanner.\n        └── Alright, thanks.",
    "In my experience of hiring, if we do come across your portfolio and we do not see a resume/contact details; we just skip because we don't have the time to reach you out otherwise \n\nSo, what you can do is, in sites where you genuinely can get a job from, i would recommend adding your contact details \n\nOnce you get a job, you can always remove those details\n└── * My portfolio already includes all details except the phone number, my only concern is that attaching a resume there would make my number publicly visible\n* So, is it fine to exclude the phone number from the version linked on my portfolio ?\n\nAlso can I DM ?\n    └── Yes you can DM\nWe'll continue the conversation there\n        └── Please check."
  ]
}