{
  "title": "[Discussion]bmsce vs msrit vs pes -need to know few things abt these",
  "content": "help me I need to know fews things\n\n1. better college life\n2. less strict like proff attendance and stuff \n3. which is more study focus \n4. placement \n5. abroad perspective like for ms/mba \n6. overall clg life rest of the stuff like exposure and all which gives more except just studying",
  "metadata": {
    "id": "1m7aqg3",
    "author": "BYTEOCITY",
    "url": "https://www.reddit.com/r/PESU/comments/1m7aqg3/discussionbmsce_vs_msrit_vs_pes_need_to_know_few/",
    "permalink": "/r/PESU/comments/1m7aqg3/discussionbmsce_vs_msrit_vs_pes_need_to_know_few/",
    "score": 9,
    "upvote_ratio": 0.85,
    "created_utc": 1753280872.0,
    "flair": "Admissions",
    "nsfw": false
  },
  "comments": [
    "&gt;5. Abroad perspective like for ms/mba\n\nFor this MSRIT is the best, they have extremely light acads. Getting a 9+ CGPA there is comparitively easy. Also lighter acads means more time for extra curricular which means you can also focus on research oppertunities within Bangalore\n\nMy brother studies there so ik",
    "For doing an MBA abroad, the university and CGPA matter partially, but great work experience is crucial. If you’re planning to do an MBA later on, go to the university with the best placements.\n\nPESU had much better placements than the other two when I graduated many years ago, but I don’t really have the knowledge to compare them today\n\nRegarding MS, a large number of my batchmates, classmates and friends have completed/pursuing their MS from the US, Canada, Europe and Australia. Lot of people from PES go abroad",
    "3 , 4 , - PES\n\n5 - PES and the only reason id say maybe MSRIT could be better is only because its easier to score but if ur a smart student who studies sincerely it doesent rly matter on the college ull do well anywhere   \n1 , 2 - BMS\n\n6 - PES is good overall the fests and extracurriculars , hackathons , peer group etc isnt bad but gets harder in later years so maybe BMS/MSRIT here , not too sure\n└── How serious are the proffs about the attendance and what are the different kinds of fests that happen ?"
  ]
}