{
  "title": "Sharing my tier 3 to FAANG journey [He is from PES University as mentioned in his CV]",
  "content": "",
  "metadata": {
    "id": "1magyvs",
    "author": "Unusual_Sky5634",
    "url": "/r/Btechtards/comments/1magmlb/sharing_my_tier_3_to_faang_journey/",
    "permalink": "/r/PESU/comments/1magyvs/sharing_my_tier_3_to_faang_journey_he_is_from_pes/",
    "score": 29,
    "upvote_ratio": 0.87,
    "created_utc": 1753604142.0,
    "flair": "Pride Of PESU",
    "nsfw": false
  },
  "comments": [
    "There is a lot of misdirection in that post. I wouldn't recommend using it as a blueprint or taking any of it as advice. \n\nPES is nowhere near T3. It has great placements and people regularly end up at Amazon and the like if they work hard on upskilling and being hireable. For a college that boasts a median and average of 12-14L and a highest of 50+L, if you don't end up with a good job then it's on you for not putting in the hard work when it matters, or for not being industry ready and being eligible for the roles they come hiring for. You can't blame the college for being mediocre when you were mediocre yourself.\n\nAnd once you start working, there is no concept of \"off campus\". *Everything* is off campus, and which college you come from is completely irrelevant. All that matters is your work experience, how you performed at your previous role to advance in your career, and what you bring to the table. Nobody looks at your college once you've spent enough time in the industry; if you're good at what you do, you're a good candidate to interview. The entire story of \"making it off campus from T3\" is logically flawed here because it isn't even relevant to the discussion.\n\nLuck will only take you a short way. Everything else depends on your hard work. Put in so much effort that your own skills can take you places luck cannot. And focus on your CGPA. It matters. Everywhere. All opportunities from jobs, placements, internships, higher education - all depend on your CGPA. Don't screw this up. \n\nFair praise to the dude for making it to Amazon. But stories like these are one in a thousand. Kids, there are no shortcuts in life. If you want success, you're going to have to earn it.",
    "PES is literally the IIT of Bengaluru /s",
    "How is PESU tier 3 eh? Bcz of less percentage of placements? I though it was considered tier 2\n└── It is  not lmao.\nHis reason for it being tier 3 is that he got admission without a competitive exam.\nI mean he paid 40 lakhs for management back then.\nThat's only 10% of the seats.\nEdit: typo, I meant pes is not tier 3\n    ├── I don;t think a college which has a median of 12-14L can be considered \"T2\", irrespective of how ambigious the entire tier system is. You are forgetting that there are many collges in the country which have averages at &lt; 50% of PES' median.\n    │   └── Shit typo, I meant it isn't tier 3\n    ├── Heyy do you study in PESU rn? If so, any idea about the placements percentage of PESU RR CSE? I got it in KCET mock allotment but my friends said it has very less percentage of placements. Is that true? I am confused between RV ECE and PESU CSE. I am interested in programming as well as electronics. So hell of a lot confused. Could anyone help?\n    │   └── Yeah I study in pes rn.\nI don't know what the placements for rr specifically are as placements are done together for both campuses.\nCse is 70% placed I think and the median is like 15ish.\nThat's with 1500 seats in cse.\nUr gonna have to decide btw cse and ece man, they are very different.\nDo more research.\ncse in rr is a safer bet if u can't decide btw cse and ece\n    └── It kinda is now, no? Jee mains cutoff was below 90 percentile which is a joke.\n        └── For what mech?\nCse rr got over above 95 itself afaik\nAnd it's only the first year without pessat, so acceptable ig\n            ├── And for cse as well, it was below 90. Like other tier 3 colleges.\n            └── Cs is not the only branch that exists. Mechanical engineering matters too. All branches make up the college average and median.",
    "no way PES tier 3",
    "Bro had the most important skill, LUCK 😂",
    "Pes is tier 1.5-2",
    "If pes is tier 3 iit is tier 4 cuz pes &gt;&gt;&gt;&gt;&gt; iit"
  ]
}