{
  "title": "[Question] is there a builder vibe at pes ec campus?",
  "content": "curious if people are working on startups, side projects, or trying to build something of their own?",
  "metadata": {
    "id": "1mat3ph",
    "author": "Ok_Government8355",
    "url": "https://www.reddit.com/r/PESU/comments/1mat3ph/question_is_there_a_builder_vibe_at_pes_ec_campus/",
    "permalink": "/r/PESU/comments/1mat3ph/question_is_there_a_builder_vibe_at_pes_ec_campus/",
    "score": 7,
    "upvote_ratio": 0.9,
    "created_utc": 1753639470.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "As a third-year student who hasn’t been heavily involved in most clubs or organizations, I still want to share some observations for anyone wondering about opportunities here:\n\n* There are several vibrant labs and clubs at PESU, like the PESU Innovation Lab (PIL) and various Centers for Excellence, where students are encouraged to learn and experiment together. While these environments may not have the cutting-edge resources of top research facilities, the collaborative culture and exposure to hands-on work make them great platforms for growing your skills and building lasting connections with like-minded peers.\n* Startup Support: The university has set up a venture capital fund of around $500,000 (please correct me if the number has changed recently) to support student-led startups. This means that if you have a promising idea, there are actual pathways and resources to help take it from concept to reality.\n*   The faculty here are approachable and many are actively involved in research and industry projects. Several professors are more than willing to mentor enthusiastic students, help refine ideas, and even support you in exploring new domains, both within and beyond your curriculum.\n\nTo say that there are \"no opportunities\" is simply not true. While the ecosystem is still evolving and has its gaps,as any institution does.there are definite avenues to learn, build, and even launch your own ventures if you take the initiative. Opportunity is very much present for those who seek it and are willing to get involved",
    "Yeah plenty of people are doing shit on their own.\nLots of start up paglus. \nU can join clubs like HSP, avions, parallax, entrepreneurship club etc."
  ]
}