{
  "title": "[Placements]What if someone doesn't get placed",
  "content": "[Placements] Guys just a question like what if someone doesn't get placed in the placements, what happens then considering the competition out there like going off campus gonna be too difficult, what if someone doesn't get the 6 month internship, how will they cover those credits.., just asking out of curiosity",
  "metadata": {
    "id": "1mauk3q",
    "author": "PuzzleheadedSpite274",
    "url": "https://www.reddit.com/r/PESU/comments/1mauk3q/placementswhat_if_someone_doesnt_get_placed/",
    "permalink": "/r/PESU/comments/1mauk3q/placementswhat_if_someone_doesnt_get_placed/",
    "score": 17,
    "upvote_ratio": 0.95,
    "created_utc": 1753642974.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "If u don't get an internship u have to join one of the centers in pes to cover credits. \n\nI think everyone who tries and has a gpa of 7+ will get placed, may not be a good role or good pay, but if u try for all companies that visit, everyone will get somewhere imo\n├──  according to the recent statistics given from placements office, despite it being July now, there are still quite a lot unplaced, right?\n│   └── People who aren't placed yet either have a really low gpa or are really selective about the roles/ companies they sit for. Or have a serious skill issue\n│       └── Dude 500 cse peeps r unplaced\nAre u saying 500 ppl don't wanna get a job\n│           └── Some of them might go for higher studies \nSome might hve gotten off-campus\n│               └── 373 higher studies from 2025 batch as per latest placement record. so rest only, so out of these some might opt family business or enterprenurship\n└── I already did one at ccbd in 2nd year again going there??, would be real bad then have to grind\n    └── Try ur best for on campus and keep the centre internship as a last resort\n        └── Definitely, like I am giving my full effort, but that fear not getting anything and ending up somewhere shit always there....",
    "Nothing would happen. \n\nYou don't need to do a six month internship in 8th sem. You can do 4 with a 2 credit special topic\n└── Bro recently they said we can't compensate with a course\n    └── I graduated in 2014 and it was valid for me. You need to talk with your HOD"
  ]
}