{
  "title": "[Discussion] barely holding it together (help)",
  "content": "I'm currently going to 5th sem nd I still have 4 backlogs from 1st sem...\n\nHad some family issues during 1st sem nd fucked up, but learnt my lesson and tried harder the consecutive sems didn't have any backlogs from 2nd sem onwards..\n\nbut here's the issue no matter how hard I try to study for my backlog subjects its just I'm finding it real hard to score above 40 marks... promised my parents that I would clear them all this summer, but its not going to happen...\n\nHaven't told my friends that I have 4 backlogs and its getting real hard for me to pretend everything's going to be fine... I feel like i again slipping back to how I was during 1st sem... the same depressed thoughts, questioning life, living everyday with guilt of disappointing ppl who trust me. Ngl I'm pretty disappointed in myself too... like its hard to see myself be so sad about it when it was my mistake that I had backs during 1st sem..\n\nnow going to 5th sem with 4 backs.. and idk just feel so lost, not telling anyone about my problems nd stuff.. its overbearing to keep all these thoughts to myself and not have a single person to talk abt it .. ",
  "metadata": {
    "id": "1mb6ooi",
    "author": "Certain-doom1017",
    "url": "https://www.reddit.com/r/PESU/comments/1mb6ooi/discussion_barely_holding_it_together_help/",
    "permalink": "/r/PESU/comments/1mb6ooi/discussion_barely_holding_it_together_help/",
    "score": 44,
    "upvote_ratio": 1.0,
    "created_utc": 1753676386.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "ok , tbh just start studying for the easiest of those 4 subjects first and clear it in the first shot , repeat the same until ur left with that one hard subject , for that try consulting ur mentor , and ngl patience and consitence is a must in these kind of situations ( ik its easier said than being done but this is the only resort ) , keep grinding bro  ! atb",
    "Parent here.\n\nI think, you must be honest with your parents. A home must be a place where one can be vulnerable and honestly express oneself. Please tell them and the reason why you didn't tell them before. Sure, they will scold but that's fine. Please don't take any of these scolding personally. You can assure them that you are trying your best and request them for their support. Atleast you don't have to pretend anymore and you can be at peace. It's important to be authentic to yourself even if it makes others uncomfortable.\n\nAbout study, i think you must make a sensible timetable with breaks for a walk, lunch, even some phone time but make sure you get back to study and stick to the timetable no matter what. The other thing is, revision. No one can understand a subject in one go. So revisions are amust. Look up the topic on YouTube and you will find several good videos too. Keep distractions at bay. Eat healthy because you will need the energy. From the time you wakeup, the only goal in your mind must be to clear your backlogs and your timetable. If you have many backlogs, suggest you to take up what you can handle and focus on clearing those.\n\nWhen your mind, heart, and sense organs are all in alignment, your energy will flow into your work and you will definitely attain success.\n└── We got parents in pesu reddit before gta 6 💀\n    └── https://preview.redd.it/cr028r1c6lff1.jpeg?width=1080&amp;format=pjpg&amp;auto=webp&amp;s=7505d2f4af3fcdc8740b66da6f3a222e09afdb37\n        ├── Help why does this middle aged person have a sense of humour\n        │   └── Just cause we're old, doesn't mean we're not cool ✅\n        │       └── Couldn't agree more\n        └── Though I posted this meme, I think OP or anyone for that matter, must do things for himself and not for his parents or his friends or anyone else. \n\nI think a lot of youngsters seem to seek validation from others and fear being judged by others. This makes them set very high standards for themselves just to please other people. This conflict of who they actually are and what they are trying to project to others can make one depressed and sad and it can easily drain their energy. \n\nTherefore, one must review their authentic self and see what they are really passionate about and what they want to make out of their life. If their passion enables them to make money, it's really good. But if the passion won't fetch much money or will take time to make money, one may need to force oneself to study, get a job and make some money to sustain a livelihood. Some of this earned money can be set aside to follow one's passion to feel happy and satisfied. \n\nIn essence, stay connected with your true self. Love yourself. Follow your passion. Other people and their opinions really don't matter to be happy and wholesome. But since we are adults and we have to make a livelihood, we may sometimes have to do things we may not really like and that's ok as long as we are doing things we really like side by side, even if it's gta!\n\nFrom a parent's pov, parents know their child's  passion but they are scared and unsure if it will click or not. They are aware there is too much competition. So they insist that the  child  at least graduates and secures a job and first learn to become independent.\n\nBeing a parent, I say, once you get a job, let the job fund your passion. Work on your passion side by side until the passion starts fetching you money and one day you can follow your passion completely leaving your job which you may not like so much. And, when the mind, heart, sense organs are all in alignment, definitely you will achieve great success and there won't be room for depression and sadness etc.",
    "In a very similar situation, had 3 backlogs in 1st year and 2 in 2nd….contrary to what many would think i worked harder than my peers, as im one of those who need to work more than others just to get to their level. Ive been giving backlog exams since 2nd sem, going to enter 5th soon, really broken, its not even the subject thats hard, its just these exams have drained me completely and so im unable to pass them, problem now is if i dont pass this time, ill be held back, my anxiety is through the roof, its hurts thinking even being so good, ive come to this situation. Its a very 50-50 chance, do they push you to pass if you get around 30?\n└── Idts cuz i pretty much got 33 or 32 in my previous esas nd failed",
    "Hey there...I am a recent graduate and I could not help but respond after reading through your problem. I have talked to multiple seniors of PESIT and majority of them told us 2-3 annoying subjects would always wreck their GPA and lead to missed company shortlists. My friend who is also from PESIT has built some kind of algorithm that will can figure out what to study from your syllabus, what is important and get instant answers to all your doubts. Like a hack for last minute preparation.  \nBut he won't build it for a course unless sufficient interest is received from students. If you are interested, you can fill out your interest for the required courses here. He says many students from VTU colleges have signed up for it  \n[www.kplor.com](http://www.kplor.com)",
    "Just get a tutor for a month n clear them,\n\nAnd if you are in some depressed deep shit ill tell you something: I have currently 13 backlogs and 25lpa job, so just know things can always go right, if you are bad at studies just learn to be better at skills, humans are made to survive n figure things out, just have confidence in yourself and work hard.\n\nI haven’t graduated yet and still have 1st Year and 3rd Year backs\n└── ...you do realise that you won't be able to join the company until you clear them, right?\n    ├── It depends on the company, and if you are going through campus placements, just know companies dont just hire from colleges and not all companies care about your college, they care much more about your skill\n    └── Btw have already completed a year in the company, batch 20-24"
  ]
}