{
  "title": "[Question] Laptops allowed during all lectures 2nd year onwards?",
  "content": "Coming into 3rd sem next week. I prefer using my laptop for taking notes. Will we usually be allowed to use laptops for all courses? Is it more flexible than how the first year was?",
  "metadata": {
    "id": "1mb93kr",
    "author": "leoxplr",
    "url": "https://www.reddit.com/r/PESU/comments/1mb93kr/question_laptops_allowed_during_all_lectures_2nd/",
    "permalink": "/r/PESU/comments/1mb93kr/question_laptops_allowed_during_all_lectures_2nd/",
    "score": 15,
    "upvote_ratio": 1.0,
    "created_utc": 1753685119.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "It really depends on your teacher, some might allow while others might have problems with it.\n├── Got it, thank you.\n└── So pretty much same as first year",
    "**3rd SEM**  \nDSA - yes (70% of classes)  \nWT - hell yeah  \nDDCO - (15-25% of the classes)  \nAFLL - nope  \nMATH - hands on sessions\n\n**4th SEM**  \nDAA - hands on sessions  \nCN - maybe (10-15 classes)  \nMPCA - (15-25% of the classes)  \nLA - hands on sessions  \nOS - only for some topics\n\nAgain , it depends on the teacher .   \nSome of 'em are so don't-care type , they let you use it all classes even if the subject they teach has nothing to do with it .   \nSome deny you the permission to use it , even if it is actually needed .\n└── Thanks for clearing it up. Wish they were more lenient but it is what it is lol",
    "joining for first year soon are laptops not allowed in classes?\n└── They are, for some courses. You can use them for your CS classes all the time. For other lectures like electronics and mechanics, the teachers prefer students use their laptops only when it's related to presentations etc. It really boils down to who's teaching you. Some prefer students to open up the course slides on their laptops and use them as a reference for teaching. Some people prefer to bring an external keyboard that they keep below their desks in very theoretical subjects like mechanics where you'll almost never use your laptop and code mid-classes (using a tablet for screen mirroring on their desks so it doesn't look like you're not paying attention lol). Towards the end of a semester, almost everyone's using their laptops freely either due to the syllabus getting over or for assignments.\n    └── got it thanks alot!!"
  ]
}