{
  "title": "[Question] How to maintain a good CGPA ???",
  "content": "Was talking to a senior, so he told me it is really difficult to maintain a good cgpa in pesu so I just wanted to confirm is it really difficult to maintain a good cgpa like 9 or more than 9 ??? Also am not good in jee maths (like I am very bad in integration) so will that affect my college studies??? Please Help 🙏 ",
  "metadata": {
    "id": "1mbgy9r",
    "author": "pareshan_aatmaaa",
    "url": "https://www.reddit.com/r/PESU/comments/1mbgy9r/question_how_to_maintain_a_good_cgpa/",
    "permalink": "/r/PESU/comments/1mbgy9r/question_how_to_maintain_a_good_cgpa/",
    "score": 20,
    "upvote_ratio": 0.92,
    "created_utc": 1753711193.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "Go through previous discussions on this topic. It's been explained before, multiple times. Check the FAQs. \n\nIf you want to do well and get a 9+, it means you need to cross an 80/100 on average on the overall score for each course. While this sounds like a simple directive, the difficulty lies in execution. Each course can have assignments, quizzes, projects, etc (depends on how the course is planned). Since *everything* adds to your final grade, the only way to do well in a course is to do well in *everything*. \n\nSo to do well, you simply need to put in consistent efforts throughout the semester. This isn't a place where you can study overnight or 1-2 days before the exam and slip through. Your GPA will suffer if you let all deliverables overwhelm you. Start assignments/projects early, be on top of deadlines, plan your week ahead in advance, set fixed goals, manage your time between fun and study efficiently. Most top performers at PES aren't the ones who work their asses off like donkeys a few days before the exam or are geniuses in their field, they're ordinary folks who know how to balance their time, and most importantly, they put in moderate but consistent efforts over the semester rather than cramming overnight. \n\nThere is no overnight academic success story at PES. If you want to do well *and* not lose your sanity, the only way to do it is to be smart about *how* you study rather than *how much*. Many people cross a 9, it's not that difficult if  (1) you dedicate time and effort and more specifically, (2) at the right time.",
    "1. Study atleast the tough topics in syllabus before the ISA/ESA begins. Not 1 day before or in the exam gap.\n2. (very imp) Learn how to frame your answers well if it's not a mathematical/arithmetic oriented subject.\n3. Pray that the qp setter knows his shit. Your knowledge doesn't matter if the qp is not worded well or is very tough to crack.\n└── Noted, Thank you ☺️",
    "source: 9.7 cgpa after 4 years\n\nit's not hard, but it does take effort and time. common things to do are, as mentioned elsewhere in the comments, to start studying earlier and take notes of concepts. try to find the best way you absorb information, for me I preferred a visual way to connect topics so my notes were structured like a web of info, so I can relate topics with each other. specifically about studying for tests, you'll have a good idea of what's important from previous years papers or asking the prof, and you can focus on some topics deeply while maybe only a surface level understanding of something else is ok\n└── Noted, Thank you ☺️",
    "Hey there....I am a recent graduate and know something that might help. So maintaining consistent CGPAs is tricky, I know of alums from PESIT who wrecked their GPAs with just bad performance in 2-3 subjects. They ended up missing their placement shortlists despite strong skills and placement prep.  \nMy friend who is also from PESIT has developed an algorithm of sorts that can figure out what to study from a course syllabus, what is important and get instant answers to all doubts. It is currently under trial, but he is gathering interests from students across multiple VTU colleges. It is like a hack to improve grades, but will be built only when a minimum number of interests is received. Don't mean to spam you, but if you are interested, you can just add it here and invite like-minded people too  \n[www.kplor.com](http://www.kplor.com)",
    "You shouldn't get any grade below a C to maintain your gpa above 7"
  ]
}