{
  "title": "[Rant]\nTea on the EEE Dept in the RR Campus",
  "content": "Howdy all. \n\nFirstly, going anon for obv reasons. 2025 Batch passout huduga. Secondly, this writer of this post WILL resort name calling because that is the only way this kopa will go after 3 years in this dept. \n\nYall must be tired of reading CSE posts why not switch it up with the most ignored stream in pesu- EEE.  \nFreshers- DO NOT be swayed by any adverts or anyone who says that all streams are equal here, it is the eternal truth that PESU was is and will always be a compsci college. You might as well rename it to PESCSU.  \n  \nThe dept, or what is left of it now is a lukewarm water at best. Almost all the good profs have either left or are on the verge of leaving this sem- As i wil explain further. Contrary to what is expected from such an exciting field- filled with circuits and tinkering - there is NOTHING that goes on here apart from academics.  The labs are empty apart from classes and 8th floor is as quiet as China is on Tiananmen square.   \n  \nOnto the profs, I will be using their name abbreviations. Feel free to dig into the staff website if your curiosity wants a dive.  \n  \nRJ: Self declared big daddy of the dept. Promoted to chair the earlier year after sucking idk whos dick. This man is a living Hitler who might be a good researcher in his right but is dogshit as a person as well as a teacher. I reckon not a single person has understood his teaching to date. Probably the most hated of the entire roster. Holds grudges, only acts according to his whims and fancies, does not give a single shit about students lives beyond college. being the chair NO ONE confronts him. Drives a cycle to college - I hope you come under a bus.\n\nVN: The lap dog and certified cuck. Pathetic excuse for a man and 0 testosterone. Cant teach for shit and does whatever the chair asks him to. Mobile seizer who says \"mobiles make you distracted in class\" and then makes you write a fucking handwritten note to get it back if caught in class. \n\nCPK: Iffy unc. Knows his subjects to an extent but DO NOT ask him anything beyond it- he will not know it. Anger issues and overall tense environment in his class but a jolly guy outside. Light years better than the the aforementioned fucks.\n\nSM: Nice lady. Probably the best among the lot. Knows her domain well, very patient and understanding. Steers away from the politics but supportive upto a level. \n\nSD: Iffy lady. The most knowledgeable among all. On one hand pretty strict and no nonsense, sets the hardest papers known to mankind. On the other, understands student probs and uses her discretion where she has to. Bestie to SM and professional hater of VN. Lowkey might leave too.\n\nGDB: Kammanahalli karen. The mostest**©** useless prof who NO ONE respects. Cant teach for shit and opens ppt in class and sits. Complains about how bad students are any chance she gets and starts up petty fights. \n\nKBK: SBI avare. Former chair and ex prof who does not teach anymore. Very old style in his methods of teaching back in our days but ultimately did what was best. Okayish at teaching not that it matters now.\n\nVMN: Oldest unc. Ex prof who was the cornerstone of every engineering college. Taught mostly from books and a caterpiller walked faster than he talked but a good egg at heart.\n\nMJV: Nice unc. The most qualified among all of em, taught pretty well too. Did numerous projects besides courses and involved students as much as he could. Sadly, put in his papers this sem and to be ex-prof.  \n\n\nRest are asst profs who arent worth mentioning- same as their salary.  \nHon mention: SS whos only teaches 1st year ee per se, nevertheless a joyful lady .\n\nThere. I said it.  \n  \nThe intention of this post was not to affect anyone's upcoming or current exp here and mods i hope it makes the cut.\n\nSigning off.",
  "metadata": {
    "id": "1mbjqcr",
    "author": "HomoDeuss666",
    "url": "https://www.reddit.com/r/PESU/comments/1mbjqcr/rant_tea_on_the_eee_dept_in_the_rr_campus/",
    "permalink": "/r/PESU/comments/1mbjqcr/rant_tea_on_the_eee_dept_in_the_rr_campus/",
    "score": 102,
    "upvote_ratio": 0.98,
    "created_utc": 1753717568.0,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false
  },
  "comments": [
    "Please make smtng like this for ECE too🙏🏻🙏🏻",
    "PESCSU😭😭😭",
    " ece dept in pes rr ,is it also not given the importance as of cse?\n└── Its not. OP is true when he says not all departments are treated equally. Although idk who told him that there are ppl telling that the departments are equal. I thought it was well known that PES is not the first choice but not the worst worst for core/circuital branches.\n    └── M gona choose pes rr ece hearing this makes me think taking pes ec cse better.\n        └── Its got its Ws, but you wont get as much support for non CS branches as CS does",
    "Kammanahalli Karen 😭😭😭",
    "2022 Mech Passout.   \nCan anyone give me a similar wrap up for mech? I know the dept was dog shit by the time I left."
  ]
}