{
  "title": "[Question] 5th sem electives easier to score ones",
  "content": "Seniors help me select electives that are easy to score even if they are not easy to understand (ignore the already selected ones  I simply marked them) my cgpa is 8.97 I need your help to cross 9 🤞",
  "metadata": {
    "id": "1mc5zv4",
    "author": "darksage_69",
    "url": "https://www.reddit.com/gallery/1mc5zv4",
    "permalink": "/r/PESU/comments/1mc5zv4/question_5th_sem_electives_easier_to_score_ones/",
    "score": 10,
    "upvote_ratio": 0.92,
    "created_utc": 1753777844.0,
    "flair": "Study Help :table:",
    "nsfw": false
  },
  "comments": [
    "Gta has definitely been the most lucrative for me,even though the syllabus is a bit lengthy,and isas were a bit tough,the esa result was crazily inflated,and as for elective 1 just do NOT choose HCI,the most useless and worst course for gpa\n└── Any recommendations for elective I\n    ├── I am not much aware of other courses but i think the grade graph for all the elective 1 courses are pretty much similar(except HCI ofc),just choose whatever interests you and you’d be fine\n    │   └── R u saying that HCI graph was high or low? Like was it difficult?\n    │       └── Hci is a course that will neither improve your gpa nor your skills,i dont remember exactly but during my time for ec campus,nearly 60-70% of student got C or worse\n    ├── Ac is good choice. Easy to score as long as you read the slide well\n    └── advanced algo is really easy to score if you take notes in class. All questions from isa and esa come from what is done in class.",
    "Image processing all the way 😅\n└── Is image processing easy? I need to boost my gpa and im thinking of taking ac and image processing. What do u think about that combo?",
    "ROS for autonomous systems was a 6th sem elective for our batch. It was pretty chill for our batch. Both ISAs were only MCQs  \nIt was called Mobile and Autonomous Robotics for our batch",
    "CNS if you like Cyber Security, and there’s a lot of Relative Grading as well.\nAC is definitely the most chill"
  ]
}