{
  "title": "[Discussion] What are the darkest things you know about PES?",
  "content": "",
  "metadata": {
    "id": "1mc8lrg",
    "author": "Fearless_Owl437",
    "url": "https://i.redd.it/2jpbsck84qff1.png",
    "permalink": "/r/PESU/comments/1mc8lrg/discussion_what_are_the_darkest_things_you_know/",
    "score": 48,
    "upvote_ratio": 0.9,
    "created_utc": 1753787579.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "The 6th floor of gjb is quite dark (no lights there)",
    "Microsoft and Amazon stopped hiring SDEs from PES (on-campus) because they were fed up of the placement officers.\n├── what's the lore? i've heard of it many time but no one told the full reasob\n├── https://preview.redd.it/no4h5obvguff1.png?width=1080&amp;format=png&amp;auto=webp&amp;s=a61ca96992461ac82a7327365cfcd1137c3641c3\n\nAWS does, Amazon doesn't\n│   └── Do you have the full photo?\n├── Don't Amazon still visit? And Microsoft's fallout was more than just placement officers.\n│   ├── no , amazon and ms stopped visiting\n│   │   └── That's weird, I thought Amazon still visited\n│   ├── yep they came for our batch, for some Cloud Support role, probably coz they *perhaps* hired SDEs or other better roles from IIT / NIT / IIITs\n│   └── microsoft came 2 years ago for summer internship  , not sure about FTE.\n└── Damn so no more Microsoft or Amazon hiring from PES?\n    └── yeah been a thing for few years",
    "May not be dark but funny af.\n1. The chancellor’s married daughter sleeps with her own cousin. \n\nThere was an account of her ex Boyfriend invaded their house and lived in her bedroom secretly for few weeks before being caught and kicked out. \n\n2. A faculty was suspended once for referring to a Muslim student as Osama Bin Laden.\n\nEdit:\n\n3. The Pes hostel was built on occupied slums with the help of a former  warden Kabdi .M.  He was an alcoholic who died as a result. He was a big time rowdy and bully who had multiple arrest warrants on him.\n├── The 2nd one is wild 💀\n└── 2nd one was in Manipal Institute of Technology not PES",
    "PES placement cell is a joke(recent gs hiring situation)\n├── what happened\n│   └── idk gs never sent the oa link and the placement cell doesnt have any idea what happened\n└── What 💀 that's the only reason I'm joining\n    └── its still a decent college, better than most privs\n        └── I'm choosing it over Ramaiah sjce etc 😭\n            ├── Bruh, chill. Still better than those\n            ├── yeah its better , the avg and median are still very decent considering how bad the market is\n            └── ramaiah is better than pes, how are you getting it?\n                └── I'm getting both through kcet and yeah I'm preferring pes to msrit\n                    └── oh you can decide based on distance to location and other factors then",
    "The current mechanical Chairperson supposedly had a sexual harassment/assault charge against him when he grabbed a girl's boob. He was sent on a sabbatical where he taught in a college Noida (visible in staff page). However this is only a story I have heard, and it does explain things....\n└── s\\*tish?\n    └── What no? RR Campus. Satish sir of ECC seems like a pretty good guy in my interactions with him\n        └── He's a good guy not a good teacher",
    "Saw real copies of invoices of biotech equipment worth 45+ lakhs just lying around in the lab",
    "It's the IIT of Bangalore 😉",
    "Can someone please confirm the rumours of the placement cell and what is the scenario?",
    "better question :\n\n# What are some non-dark things you know about PES?\n\n[](https://www.reddit.com/r/PESU/?f=flair_name%3A%22Discussion%20%3Asnoo_shrug%3A%22)",
    "https://preview.redd.it/xtqcc272fxff1.png?width=1064&amp;format=png&amp;auto=webp&amp;s=6e4543bdc4b1ffcb2c5d4cb8ea86aa65968a5505\n\ndoredaddy sr. is no more 😭😿😢🥀"
  ]
}