{
  "title": "[Placements] Clarification: Placement statistics 2025",
  "content": "https://docs.google.com/spreadsheets/d/1SnSNM_GnuTwIJ0oI3bHt9nAnDQXfqwIhT8JHEwq727g/htmlview#\n\nIn this sheet which is 2025 placements stat.\nMany companies at last for all tiers. FTE/interns are empty. Does this mean they NOT SHORTLISTED ANYONE or this SHEET IS NOT UPDATED??\n\nPlease any seniors tell me about this ",
  "metadata": {
    "id": "1mcjuen",
    "author": "Key-Actuator-3372",
    "url": "https://www.reddit.com/r/PESU/comments/1mcjuen/placements_clarification_placement_statistics_2025/",
    "permalink": "/r/PESU/comments/1mcjuen/placements_clarification_placement_statistics_2025/",
    "score": 10,
    "upvote_ratio": 0.86,
    "created_utc": 1753814760.0,
    "flair": "Placements 🤑",
    "nsfw": false
  },
  "comments": [
    "Probably not updated. You should know that placement stats at PES are not 100% transparent. I;ve discussed this before - the only way to update these entries is by manually reaching out to people and/or hoping the company themselves send the data to all candidates (most do not). Quite obviously, its not as simple to reach out to everyone and get a number when you don't even know who \"everyone\"  is/.\n└── There’ll be more than 1300 this time around or next year onwards as AIML will also sit with CS",
    "Thanks for the info,\n\nAnd one more thing, do you have any idea about just cse placements, like there are around 1300 students are from cse both campuses combined...how many CSE students get placed, I have seen in one of the official sheet that from around 1200 only around 700 got placed which is just around 55-57% placements which is very less Right?? Some are ineligible i know but not like 40% are ineligible and also not many people will go for higher degrees...so I am confused whether placements of CSE are around ~60% only??\n└── 700 was for only FTE.. there is a column \"Internship only\" which is around 400 for CSE.. most of the Internships receive a PPO...\n    └── The 700 number is total students placed.\nFte +( intern+fte) \nRemaining 500 sumth r not placed (either higher studies or unplaced).\n        └── In the stats, there is a column called \"Internship only\" along with FTE and FTE+Intern, there were 400 offers under that... so Im guessing most of them will turn into PPO...\n            └── Internship only is \"internship only\" by the name if fte was recieved it wud add to students placed\nSee 22-23 batch stats : 820/850 wr placed so current batch is 700/1200 eod\n                └── according to the placement sheet maintained by students there were 830 FTE offers excluding the internship only offers... and according to PES the number is 843.. which is very close\n                    └── You are saying correct bro"
  ]
}