{
  "title": "[Placements] To everyone concerned about placement %age",
  "content": "https://docs.google.com/spreadsheets/d/1SnSNM_GnuTwIJ0oI3bHt9nAnDQXfqwIhT8JHEwq727g/edit?usp=drivesdk\nTier 1 2 3 incudedl gives 872 offers not even including ppos from summer and spring internship and they have shown 861 which is close to tier 1 2 3 offers combined and excludes ppos from spring and summer internships ig\n\nImo 536 internship offers are there 50-70% of them get converted to ppos so still %age of students placed atleast in cs would be around 70%+ (excluding off campus)\n\nThey have mentioned internship offers though they haven't incl number of students placed through ppos which I got to know from previous post/answers by seniors pesu doesn't incl ppos that are on campus even which supports the stats as apple came for internships and took 25 students if they have incl ppo stats the highest on campus ctc would be from apple 62-84lpa",
  "metadata": {
    "id": "1md4bn4",
    "author": "Nuts_Blaze",
    "url": "https://i.redd.it/age5cba110gf1.png",
    "permalink": "/r/PESU/comments/1md4bn4/placements_to_everyone_concerned_about_placement/",
    "score": 55,
    "upvote_ratio": 0.92,
    "created_utc": 1753875739.0,
    "flair": "Placements 🤑",
    "nsfw": false
  },
  "comments": [
    "I think one massive thing that's missed while calculating placement % is that many people hold multiple offers in different tiers.\n└── Ik but that adjusted also gives a decent %age placed cuz more people get tier 1 job offers so mostly they don't try any more hence %age placed would only change by many be -(3-5)%",
    "Ps- many of the seniors got ppo from apple I researched it on LinkedIn\n└── ALL of them(20) got PPO , 1 guy did not accept , as he had a better FTE offer.\n    └── Damm better fte than apple 😱",
    "Isnt average usually 14+?\n├── Market sucks rn + ppos aren't incl else it would have been higher\n│   ├── oh alright that makes sense\n│   ├── I thought average was around 17 and median around 14. Did Other clgs placements also suffer?\n│   └── Wait is this of all branches? Then it would make sense\n│       └── All branch + ppos aren't incl in this if they were incl it would be higher / placement %age would also be higher if they were incl + off campus isn't incl\n└── Market is also kinda bad rn",
    "Wt about ece though?\n└── No idea didn't check ece stats 🥀",
    "is apple visiting? I don't see it in the sheet but it's there in the image attatched\n\nhttps://preview.redd.it/92q1r01c01gf1.png?width=1080&amp;format=png&amp;auto=webp&amp;s=935d77c09bb8bc3be9407bf1442d36d6e8c35b82\n├── [https://docs.google.com/spreadsheets/d/1SnSNM\\_GnuTwIJ0oI3bHt9nAnDQXfqwIhT8JHEwq727g/edit?usp=drivesdk](https://docs.google.com/spreadsheets/d/1SnSNM_GnuTwIJ0oI3bHt9nAnDQXfqwIhT8JHEwq727g/edit?usp=drivesdk) Spring internship section row 1\n\nhttps://preview.redd.it/4qfho2ic91gf1.jpeg?width=1800&amp;format=pjpg&amp;auto=webp&amp;s=a735eca9b9cc1abe6590f38775a81b0965d44c93\n├── Sir can you send whole sheet photo pls (that specific page)\n│   └── that pic is taken from placement office , you can go and check there anytime.\n│       └── Okie\n│           └── It's already available on reddit just search\n│               ├── Here it is : [placement 25 pesu](https://docs.google.com/spreadsheets/u/0/d/1SnSNM_GnuTwIJ0oI3bHt9nAnDQXfqwIhT8JHEwq727g/htmlview)\n\nAll tiers + internships offered\n│               └── I had this I thought the paper had something more than this\n└── Btw should I post this on btechtards cuz some person was trying to create false agenda against pes",
    "Any stats for MBA? Please post them if you find them",
    "MTECH ECE. Only 3 people got placed out of 35. Thank you Pesu",
    "So just to basically confirm, are u saying the actual number of students placed is roughly 1.3k+ out of 1.8k eligible?\n└── 70 ish percent placed for cse I didnt consider all the branches bro as I have said in post atleast 70% placed for cse",
    "Is this data of all branches? Then it would make sense. Cuz isn't avg usually 16-17 for cse\n├── All branch + ppos aren't incl in this if they were incl it would be higher / placement %age would also be higher if they were incl + off campus isn't incl\n└── Read the post explained everything 🥀"
  ]
}