{
  "title": "[Resource] Hostel guide-Mostly focused towards ec campus hostel-1st year",
  "content": "* Medicines (get a sheet of dolo and a sheet of citrezen u will get alot of colds)\n* First Aid Kit (Bandage, cotton, some ointment)\n* Tablets (Headache, Fever, Diarrhea, Vomitings, Cold/Cough)\n* Hand wash, wet wipes(to clean the seat trust me), tide soap for ur socks and undies.\n* Brush/Tongue Cleaner\n* Toothpaste Soaps/Body Wash Facewash/Handwash\n* Combs NailCutter hair dryer\n* Shaving Cream/After Shave/Razor/Trimmer\n* Shampoo/Conditioner get good once as banglores water fucks ur hair over\n* Moisturizer/Sunscreen (this is for rich peepal)\n* Extra Creams/Serums/LipBam (get citaphel trust me)\n* Perfume/Deodorant (the days when u wont have hot water, yes some days u wont)\n* Towels (get 2 so if u give 1 for washing u can use other one)\n* Tissues (get 1 box for wiping face 1 more for cleaning up the shit u do in ur room)\n* Bucket/Mug/Soap Case/Brush Stand \n* Accessories /Room Stuff  (go to ikea u will find everything u need and u will understand what else to get)\n* Mattress (u will be given a gayy ass matress which will hurt u if u try to sleep on it for some lucky people u will get nice matress)\n* Bedsheets and Blankets (get two sheets same reason as towels)\n* Rug Pillow/Pillow Covers (u WILL need to get a pillow)\n* Mosquito Repellent/all-out/fast-cards\n* Clock (optional but looks cool)\n* Markers/Duster (optional cuz u will never write on the white board they provide, they also give you a bulletin board)\n* Clothes(Daily Wear, Clg Wear, Winter Wear)\n* Raincoat (\\~\\~just get wet bro its fun\\~\\~ its hard to carry in the bag and walk to the hostel buses is like 1 min)\n* Shoes/Sandals/Slides/Footwear (get a pair of bathroom slippers, regular wear, crocs, shoes)\n* Socks (minimum 4 pairs)\n* Belts (1 for wearing and the other one for birthdays)\n* Cap (to look cool)\n* Umbrella (u wont carry it anw cuz rain is unpredictable)\n* Water Bottles/Cups (get 2 or more bottles it will be a long walk to water filters at 1 am)\n* Table Lamp\n* Pen Stand\n* God Photo\n* Watch/Rings/Wearables/etc\n* Sunglasses\n* Wallet(Imp cards, Aadhar, PAN etc)\n* PES Related Documents\n* Extension cord (trust me, u will be given only 1 port)\n* Eye mask (if you can't sleep with lights on)\n\n  \nUnorthodox shit:-\n\n* kettle to boil maggie at odd times.\n* hair dryer\n* egg boiler\n* speaker\n* incense sticks and a lighter\n* a mini fan if u cant tolarate heat.\n\nsnacks:- \n\n* Anything haldirams sells is goated.\n* amul chocominis (best bang for buck) (costs around 140 and will last u a week)\n* maggie ofc\n* There is an app called swish in which for around 140 rupees u will get a nice meal like extremely nice meal (fast food and healty ones too)\n* lion dates...\n* GUYS dont forget achaar (pickles) the food tastes soo bland u would want to killl urselfs \n\n&gt;the food tastes soo bland u have to deepthroat 4 cocks at a time for it to go down ur throat (some days) (it is good but tastes bland... know the difference guys) \n\nIf i remember anything else i will mention in comments and dont feel shy to ask me any questions.\n\n  \nalso message me on discord for any unorthodox shit u wanna know (anything) zoro._.roronoa",
  "metadata": {
    "id": "1md5o1d",
    "author": "EmuIndependent9986",
    "url": "https://www.reddit.com/r/PESU/comments/1md5o1d/resource_hostel_guidemostly_focused_towards_ec/",
    "permalink": "/r/PESU/comments/1md5o1d/resource_hostel_guidemostly_focused_towards_ec/",
    "score": 33,
    "upvote_ratio": 0.95,
    "created_utc": 1753879616.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "&gt;the food tastes soo bland u have to deepthroat 4 cocks at a time for it to go down ur throat (some days)\n\nunreal description\n├── So true. It's not bad yk. U might feel it as repetitive but it's not that bad. And mind u, these are all not *absolute* requirements but it wud be nice if u had them\n│   └── Food absolutely tastes good. But its bland af might as eat plain rice\n└── Its true tho 😭😭",
    "bro do first year students need to stay in outside campus hostel...?\n└── Yes but they will provide busses for u guys\n    └── ohh kk",
    "https://preview.redd.it/kfcc9gv387gf1.jpeg?width=1200&amp;format=pjpg&amp;auto=webp&amp;s=90e9ec721c749ec76b04a7ca1077c4ee2df52471\n\n  \nCosts less than 4 Rs per tablet . (A sheet with 15 tablets costs 50-60 Rs)  \nin just 100-120 Rupees per month , Everyday you are going to add Almost every vital vitamin with 80-100% RDA .\n\nTrust me , the hostel food is good but not the most nutritious . At the cost of a single Shawarma , you are getting what you should be getting for 30 days !"
  ]
}