{
  "title": "[Placements]Low CGPA After 2nd Year CSE, Can I Still Get Placed?",
  "content": "I just finished 2nd year in CSE with a CGPA of 6.64. I've mostly just gotten by each semester and my skills aren’t that great yet. I’m aiming to improve my CGPA to around 7 before placements, but I know that’s still considered low.\n\nWhat are my actual chances of getting placed? And what can I do differently to stand out despite my CGPA?\n\nI’m not aiming for FAANG, just want a decent, stable job. I know I’ll be competing with others with similar CGPAs, so I want to focus on ways to make my profile stronger.\n\nAlso, how important is LeetCode for someone like me? I’m pretty bad at DSA and problem-solving, is it still worth pushing through?\n\nIf anyone here had a similar CGPA and still managed to get placed, I’d really appreciate it if you could share what worked for you. (I used Chatgpt to make myself more clearer)  \n**TL;DR:**  \nCSE student, CGPA 6.64 after 2nd year (aiming for 7). Not aiming for FAANG, just want a decent job. Weak at DSA/LeetCode — is it necessary? What can I do to stand out despite low CGPA?",
  "metadata": {
    "id": "1mda64l",
    "author": "obv_throwaway1105",
    "url": "https://www.reddit.com/r/PESU/comments/1mda64l/placementslow_cgpa_after_2nd_year_cse_can_i_still/",
    "permalink": "/r/PESU/comments/1mda64l/placementslow_cgpa_after_2nd_year_cse_can_i_still/",
    "score": 26,
    "upvote_ratio": 0.96,
    "created_utc": 1753890575.0,
    "flair": "Placements 🤑",
    "nsfw": false
  },
  "comments": [
    "my benchmate had a GPA of 6.84 and he is rn placed for 8 LPA at a startup.  \n  \nDont give up yet, you may start slow at first, but if you love what your doing. You will eventually get the job your looking for. \n\nwork on DSA , do not leave it.  \nFocus on your profile more , while others may have a GPA advantage over you , best you can do now is have a good profile which includes some deployed projects , also maybe add some experiences if you have done any internships.\n\nyou still have 3rd year left , try your best to maximize your GPA, the more it is the better.",
    "its probably answered in FAQs before. There are few or some companies that come with no GPA cutoff, you can apply to those. Check the criteria for each company. \n\nIts necessary to learn LeetCode as its useful for ur interviews and placement tests. And anyway u have a whole long year ahead, so dont worry, try to get it to a little above 7 if possible, that should be it, then u can write many tests.",
    "My CGPA after 4th sem was 6.8... now currently stepping into 7th sem , I have cgpa of 7.4. Just dont give up.. That's it.👍",
    "Realistically I don’t think your CGPA matters that much. Maybe I’m biased because it didn’t affect me but considering I ended with less than 8CGPA, in mechanical, and still got two offers from campus and settled for one outside campus, I think your skills and your network matters more than your CGPA.",
    "i got 3887 rank through kcet score issued by pes\n\nis there any chance i can get cs related branches?"
  ]
}