{
  "title": "[Discussion] Everything i require for masters abroad.",
  "content": "Hey seniors , I want some of my doubts to be solved, some may be dumb but many of other students like me have the same doubts . I have a very less knowledge about this and i have just graduated from pu so don't mind . \n\n1) Afaik cgpa should be 9+ ( correct me if I'm wrong) \n\n2) does nba accreditation of a course like cse increase my chances of getting a seat abroad compared to a student who has done pure aiml while having same cgpa as me\n\n3)If i have done for example a course like csds, ece , am I still able to choose other courses for masters like cyber , cse , ise etc \n\n4) does nba accreditation of a course increase my chances to get scholarship to study abroad. Apart from this how can I claim scholarship for masters and what are the requirements to get the best of the scholarship.\n\n5)Which are all the best countries to do MASTERS abroad (manageable and safe for indians while giving a good standard of living and getting the best CTC )\n\n6)GRE and TOEFL are the exams I just know their names and no other shit , while mentioning the countries pls mention college and their exams too 🙏) \n\n7) what will be the minimum expenditure as a whole for whatever duration the masters is (college fees + cost of living)\n\n8) is spending that much money worth it and why ? \n\n9) Problems students may face in that particular country for masters or just any country. \n\n10)pls cover any other points too which I have not asked about .\n\nLets keep this post to know everything a student requires, faces, gets , to do masters aboard. \nAnd thanks in advance 🙏. ",
  "metadata": {
    "id": "1mdebqd",
    "author": "eatenzack",
    "url": "https://www.reddit.com/r/PESU/comments/1mdebqd/discussion_everything_i_require_for_masters_abroad/",
    "permalink": "/r/PESU/comments/1mdebqd/discussion_everything_i_require_for_masters_abroad/",
    "score": 22,
    "upvote_ratio": 0.92,
    "created_utc": 1753899921.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "Firstly - way too soon to think about Masters. Why? Depending on your field of interest, you may not even need one, or 1-2 years down the line you might realise you are better off without one. MS is a big investment and should only be undertaken if it helps you. Many of your questions get clarified only after 1-2 years of undergrad, when you realise what you want to specialise in, if you need a Masters, what you want to build your career in, etc. Right now, as an incoming student, its way too soon. But for others, if you do want answers from someone pursuing their Masters, here it is: \n\n&gt; Afaik cgpa should be 9+ ( correct me if I'm wrong)\n\nIt helps. CGPA isn't the *only* factor but it is a primary factor. A high GPA is often a foot through the door at most unis, and the more reputed the uni, the higher the average GPA of admits. A 9+ puts you in a comfortable position to compete, and there is no ceiling here.\n\n&gt; does nba accreditation of a course like cse increase my chances of getting a seat abroad compared to a student who has done pure aiml while having same cgpa as me\n\nNBA accrediation does not matter as much as the degree you pursue. I have discussed this earlier already (check FAQs), but your undergrad degree needs to be relevant to the grad degree you want to pursue, + you have covered all the necessary background course requirements listed. Some unis are stricter than others too, and prefer core degrees over specialised ones.\n\n&gt; If i have done for example a course like csds, ece , am I still able to choose other courses for masters like cyber , cse , ise etc\n\nYes. Check prev. question.\n\n&gt; does nba accreditation of a course increase my chances to get scholarship to study abroad. Apart from this how can I claim scholarship for masters and what are the requirements to get the best of the scholarship.\n\nFor Masters in the US, 95% of programs are unfunded or without scholarships. The only way to get paid while pursuing MS is to work as RA/TA. There are a lot more nuances to getting these roles, and these depend on the uni so there is no way to generalize and give a blanket answer.\n\n&gt; Which are all the best countries to do MASTERS abroad (manageable and safe for indians while giving a good standard of living and getting the best CTC )\n\nEach country is different. Most to the US for STEM degrees. Some also go to the UK and some to Australia.\n\n&gt; GRE and TOEFL are the exams I just know their names and no other shit , while mentioning the countries pls mention college and their exams too 🙏)\n\nGRE is being waived off and rolled out, and TOEFL can be exempted (depends on admission requirements at each uni). Other countries may have other exams they prefer (like IELTS).\n\n&gt; what will be the minimum expenditure as a whole for whatever duration the masters is (college fees + cost of living)\n\nDepends on the uni, the location, your quality of life, etc. No straightforward answer, but upward of 60L.\n\n&gt; is spending that much money worth it and why ?\n\nSomething only you can answer. Everyone has a different reason for pursuing Masters. Whether their reason justifies the cost is upto them. Its been worth it so far for me. Others might feel otherwise.\n\n&gt; Problems students may face in that particular country for masters or just any country.\n\nStaying away from home, culture, doing everything on your own, homesickness, high costs, racism, etc. Anything and everything is on the table here.\n\n&gt; pls cover any other points too which I have not asked about . Lets keep this post to know everything a student requires, faces, gets , to do masters aboard. And thanks in advance 🙏.\n\nThere is a lot to unpack. And as I said - way too soon. If you want to keep up with what kids from PES are doing in and after their Masters, join the PESU Study Abroad discord server. We are pretty active and talk to each other regularly.",
    "I have researched and know a bit ,  \nCgpa alone won't be considered , but I will have an impact (30 percent) and rest of the things depends on the projects , skills , LOR(Letter of recommendation) ,SOR and internships\nI have no idea about NBA.\nHaving some course will definitely improve ur chances but it alone won't be enough (doing a project with the knowledge of the course is a good practice)\n\nGood countries are Canada and Australia (easy pr)and if u don't have any money related issue the USA(ignoring the upcoming changes in rules for international students and visa issue) \n\nGRE and TOEFL depends on particular university, I suggest to write both , as it increases the chances slightly and compromises for an average cgpa.(If u write it u can apply for University having that criteria)\n\nAnd expenditure is a tricky part , depends on the country ,it can be between 50 to 70 lakhs for 2 years , including tution fee, cost of living ,health insurance , can reduce it with a part time job\n\nI completely feel it's worth it , you will have 2 more years to build yourself , get international connections and a single degree in the future will be more common (completely my perspective) and who knows the value of a dollar can be around 90 , and also u can come back and with a international degree if u want to\n\nMany face loan issue and visa issues ,\n that's all I know as of now\n└── Thanks 🙌",
    "Also if anyone could give their opinions on whether it's advisable to do MS after say 2 yrs of work experience or immediately after graduation?",
    "Where is the pride of pesu 😔( I'm waiting for his reply)\n└── Asleep. I'll update this comment later",
    "Hi, I finished my MS and now doing a PhD. \n\n1. You do NOT need a 9+ GPA. I would definitely recommend having good grades and not failing a class. \n\n2. Your application is very holistic - so taking a course on something you are interested about if you have substantial knowledge will look good on your applications. It may or may not put you on a pedestal - but it can look good based on how you shape your SoP with it.\n\n3. Yes, but as a university, you would definitely prefer looking at somebody who has a background in a subject if they want to do a graduate program in the same subject. However, they might askl you to complete some perquisites before you join the program. If you get this, try to see if your university will accept an online course or certification for the perquisite, it can save you some money.\n\n4. Sorry, I don't know much of this.\n\n5. I am in the US, I cannot speak for other countries but I've found it very city dependent.\n\n6.  Some schools use IELTS and maybe a local language for a few places in Europe - check your admissions page of schools you are interested in.\n\n7. In the US, tuition + insurance + living + food + phone. All universities in the US have tuition calculators that are very informative. While you might get a TA/RA that can help cover your expenses, these poisitions are very competitive and sometimes reserved for PhD students - so definitely plan financially for your entire masters. If you get an assistantship or an on campus job, you'll save some money. You don't want to be in a position where you don't have the finances to finish up your degree.\n\n8. If you have a solid passion to learn and pursue a higher education, absolutely. Universities offer tons of resources to explore, learn, and collaborate.\n\n9. Food, weather, culture, homesickness.\n\nHope this helps!\n└── Thank you, and good to see you doing masters aboard in US . Can you please elaborate on the expenses in  US( groceries, rent , and other expenses regarding living there ) . And also mention any difficulties you have faced there and to go there 🙏.\n    └── Absolutely. Are you looking for a particular university? If so, please DM me :)\n        └── Tbh I don't know any much universities yet ( i have 4 years to decide more about it ), can I DM you after some months?\n            └── Absolutely. Always happy to help"
  ]
}