{
  "title": "[Question] Are hostel curfew timings strictly enforced \"freshman\"",
  "content": "im about to join pes rr campus and had a few questions about the hostels. the boys hostel curfew was told to be 7 30 in the briefing session. is this timing followed by students or its also one of the rules only in the rule books and never followed. cause most other hostels have curfews at around 10 pm and 7 30 feels too strict",
  "metadata": {
    "id": "1mgc8sp",
    "author": "Rudraksh_1234",
    "url": "https://www.reddit.com/r/PESU/comments/1mgc8sp/question_are_hostel_curfew_timings_strictly/",
    "permalink": "/r/PESU/comments/1mgc8sp/question_are_hostel_curfew_timings_strictly/",
    "score": 4,
    "upvote_ratio": 0.84,
    "created_utc": 1754202407.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "You can return anytime before 10pm. Even 9:59 works . They take attendance from 9-10pm , you just need to be back before it's over.\n└── so they arent that strict if ur not back before 7 30 cause they mentioned giving 10 dw points or smth\n    ├── Yeah dw points and stuff isnt that strict unless u do some crazy stuff , u can give hostel attendance anytime from 9 pm to 10pm.. u cant go out of hostel after you give attendance .. so try be back around 10\n    │   └── they also mentioned getting a gate pass if we return after 7:30 pm?\n    │       └── Idk what gatepass ur talking about .. never used that\n    │           └── they told abt gate pass in the briefing session\n    │               └── Ohh my mad i probably dont remember , i dont think its compulsary and stuff , all i did was get the LGPO book permission if i wasnt at hostel for night or more , otherwise i just walk out of the gate without any perms and gate passes\n    └── Nothing of the sort, you just can't leave the hostel after 9 and you can enter anytime before 10\n\nFood court is literally outside hostel premises and dinner starts at 7:30",
    "Guys please before posting your questions search the sub, this question has been answered multiple times\n└── The world would be a better place if they could do that"
  ]
}