{
  "title": "[Question] Regarding placements",
  "content": "Companies have been visiting almost everyday. Sometimes even 2 companies conduct test on the same day. So far I've been applying to all, so I don't find time to actually prepare. Most companies expect us to come to campus, which is far from my home. By the time I reach home, I'm already tired.\n\nIn this case, is it better to choose which companies to apply for or should I continue applying to all?\n\nI fear I might lose out on opportunities to get a tier 1 offer if this keeps happening.",
  "metadata": {
    "id": "1ml19i0",
    "author": "Easy_Tough7730",
    "url": "https://www.reddit.com/r/PESU/comments/1ml19i0/question_regarding_placements/",
    "permalink": "/r/PESU/comments/1ml19i0/question_regarding_placements/",
    "score": 46,
    "upvote_ratio": 1.0,
    "created_utc": 1754673660.0,
    "flair": "Placements 🤑",
    "nsfw": false
  },
  "comments": [
    "Apply to *all* companies, unless (1) it is a role that you *really* don't want to end up in (but 90% of companies do not come with a specific role), or (2) you do not like the pay. I would suggest not skipping any T1 and T2 companies and selectively applying to T3. Right now, given the market and competition, it would not be wise to be too picky.  Just apply to everything that comes your way and matches with your intentions and hope for the best.\n└── Since everyone can apply for any number of jobs till you decide on one, assume that a person gets selected for 3 and in the end chooses one of them, what happens to the other 2 jobs? After the person rejected the offer of the other 2 companies, will the companies try to hire another candidate to fill the vacancy?\n\nLooking at the long run, isn't this favoring the person who has loads of skills and has the capabilities of getting multiple offers, but deserting the ones who are mediocre in skills?\n    └── I think you are unaware of the placement policy. You can *receive* at most 2 offers. The moment you accept an offer, you are out of the placement process (even if it's the first offer you receive). After you receive 2 offers, whether you accept the 2nd or reject that as well, you're out of the placement process too. \n\nAnd that's how life works. If you're mediocre, you will be in a tough spot. It's not \"favouring\" because the person with a higher skill level is being rewarded based on merit.\n        ├── Yeah, got it. The point of my message was not to specify getting 3 offers. It was regarding what happens if a student has rejected an offer. Will the company hire someone or not? Assuming they still have a vacancy.   \n  \nAnd yes, I agree to your point about how being mediocre will lead you to a tough spot\n\n&gt;After the person rejected the offer of the other 2 companies, will the companies try to hire another candidate to fill the vacancy?\n        │   └── Mostly no. Most companies just move on and don't keep a waiting list.\n        ├── Are we allowed to sit for fte roles if we get performance based conversion internship with potential tier 1  ctc\n        │   └── Once you get an intern+FTE offer for T1, you can only sit for dream tier companies. So to answer your question, nope, you cannot.\n        │       └── I am asking Abt the PBC(performance based conversion) ones with no certainity Abt fte\n        │           └── If you get just an intern offer, you are eligible for 2 FTE offers. Now if during that internship you get a full time offer, that's outside the placements process since it wasn't originally through campus.\n\nIf you get an intern + FTE offer, you are eligible for 1 more if you reject this company, or if you accept, you are out of the placement pool.\n        └── What if we reject an offer ? Can we apply for other offers then?\n            └── Read the comment again. It says you can reject 2 offers before being removed."
  ]
}