{
  "title": "[Question] Is attendance adjusted after branch change?",
  "content": "I am changing my branch in 3rd sem. The counselling is on 14th. We will be 2 weeks behind from other students. I have a few doubts.\n\n1. Do the classes start from scratch?\n\n2. How are the new sections decided?\n\n3. Is the attendance shifted to other branch coz I am attending most of my current classes.",
  "metadata": {
    "id": "1mlv888",
    "author": "Doppel_Ganger69",
    "url": "https://www.reddit.com/r/PESU/comments/1mlv888/question_is_attendance_adjusted_after_branch/",
    "permalink": "/r/PESU/comments/1mlv888/question_is_attendance_adjusted_after_branch/",
    "score": 8,
    "upvote_ratio": 1.0,
    "created_utc": 1754760869.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "Your attendance will start from the day they tell u to report to ur new class. Everything before that will be considered as if there was no clg itself.\nUsually theyll assign u a class but u can try to ask them for ur prefence they will allow if seat is vacant.\n├── Like where and when we have to ask them for the section do we want?? During counseling itself in auditorium or after that in office or somewhere\n│   └── When they call for counselling there will be a guy on excel and the list of all students highest cpga first will be displayed. In order they will call and ask what u want. The dude there will change the seat numbers live.\n│       └── Oh thanks\n└── If we don't end up taking a seat, we continue with regular attendance stats in our regular classrooms right?\n    └── Yup\n        └── Thanks",
    "I have few questiobs asw, do we really have to attend the counselling procedure at rr campus, afaik they will automatically allot the seat to us right? I mean do we have to be there to accept the seat or something? And what abt the people who have already taken hostel in the other campus\n└── They wont Allocate automatically. U have to be there. Idk about hostel but when u go for finalizing the change to the hod u can ask."
  ]
}