{
  "title": "[Question]:how are the sports facilities in PES EC ?",
  "content": "Hi there,\n\nI am joining the PES EC campus (CSE). I went to see the campus. While the indoor facilities and cricket ground looked great, the football ground (atleast when I went), looked like it was in need of repair (a big hole in the middle of the pitch). Was it always like that or something due to rains ? and did the management fix it ? \n\nthanks,\n\na first-time user of reddit",
  "metadata": {
    "id": "1mmcuu6",
    "author": "RepulsiveSyllabub664",
    "url": "https://www.reddit.com/r/PESU/comments/1mmcuu6/questionhow_are_the_sports_facilities_in_pes_ec/",
    "permalink": "/r/PESU/comments/1mmcuu6/questionhow_are_the_sports_facilities_in_pes_ec/",
    "score": 20,
    "upvote_ratio": 0.95,
    "created_utc": 1754812971.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "Idk Abt others But From my experience -Cricket don't expect anything from that, ground is for only showoff[ Management rents the ground for others]. If you also get into University cricket team, Hardly you will play 2 matches per sem if you are lucky enough , those also practice matches!!  There is no coach until last sem , Now may be or not.  Also there is no proper nets in EC campus. There is no discipline in daily practice. Let me tell you , what will be your  fate (90 per of time)--\n  1) In  your First sem , [Aug - jan] it's rainy season we all know , daily practice or matches will get cancelled if it's showers also, and in your 4 months of sem classes , 2 weeks of isa's and they will stop practice before 1 week of isa's and in this sem , u will get an opportunity for play an tournament which has least probability of getting into playing Xl because it's mix of both campuses..and if you not get into that you will be for volunteering like scoring etc And boom.... ur esa will show up and practice will be resumed in next sem \n2) In even sem -  exactly like first sem those exams schedule... And They will conduct interdepartment sports challenge And your practice will be resumed after that, it will go for months and boom ur 2 nd sem also over \nThis is the loop which we and our seniors had faced..!!\n└── thanks so much for the reply. i did hear that PES is much more academic-focused than other colleges. hope it gets better tho.\n\nis the team selection the same for other sports like football and basketball too ?\n    └── Yeah , they also have Team selection Every year , tbh\nidk much Abt them, u can  get info once your regular to campus"
  ]
}