{
  "title": "[Admission] First time living in a hostel...",
  "content": "Do you guys take food from the hostel during breakfast for lunch at the college or buy at canteen??? ",
  "metadata": {
    "id": "1mmjkyu",
    "author": "CardiologistCheap588",
    "url": "https://www.reddit.com/r/PESU/comments/1mmjkyu/admission_first_time_living_in_a_hostel/",
    "permalink": "/r/PESU/comments/1mmjkyu/admission_first_time_living_in_a_hostel/",
    "score": 12,
    "upvote_ratio": 0.94,
    "created_utc": 1754835060.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "Lunch is provided on campus in the mess. So you don't have to pack it or anything. Maybe just see what is being served and if you don't like it there are a lot of options to buy from too.\n└── For free??\n    └── Mess is part of hostel fees. Obviously buying food outside the mess isn’t free\n        └── So the mess at the college is free for hostlers... I just wanted to know that...\n            └── Yes ng how did they not explain this to you during orientation\n                └── Lol cuz orientation hasn't happened yet it's on the weekend before college starts which is kind of late for ppl who need to settle in and stuff",
    "Ok i am gonna give you a brief idea , usually there is 45min of time for lunch and during that time , u can go to the mess, grab a plate and eat food , simple",
    "😂",
    "bro, u are literally paying for the mess... so eat whatever your mess gives at whichever part of the day\n└── but like isnt our hostel 6km far\n    └── Brother the hostel mess is on campus. The same campus where your classes are being held. Do you follow?",
    "You need to plan your breakfast time well, most of the time, people just skip or eat early\n└── No I mean for lunch at the college...do you guys take tiffin from the hostel itself or buy at a canteen??\n    └── Your wish bro, you can do what you want 😂",
    "What's the scenario like for day scholars. Can I choose to eat only lunch at mess if I pay, for instance??\n└── Yes, as far as I know you can pay and eat in both food court and hostel mess, not sure about namdhari"
  ]
}