{
  "title": "[Question] How is the network in the hostel? (is there any Wi-Fi or is personal Wi-Fi allowed in the hostel?)",
  "content": "Is 5g good in the hostel?",
  "metadata": {
    "id": "1mrkrmo",
    "author": "utsav_meda123",
    "url": "https://www.reddit.com/r/PESU/comments/1mrkrmo/question_how_is_the_network_in_the_hostel_is/",
    "permalink": "/r/PESU/comments/1mrkrmo/question_how_is_the_network_in_the_hostel_is/",
    "score": 7,
    "upvote_ratio": 1.0,
    "created_utc": 1755318769.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "its dogshit every site is blocked cant even use spotify unless u got an real vpn you cant bypass that  \nmobile hotspot works but depending on your hostel block and floor it may or maynot work\n└── Which sites are blocked ? Give some examples\n    └── Anything flagged entertainment is usually blocked by pesu wifi\n        └── Even YouTube ?\n            └── Nah youtube,reddit,twitter,insta these are allowed \nUse cloudwarp vpn to access all sites \nI used that only\n                └── Ok thanks",
    "You can use ur personal hotspot(the internet might be slow depending on ur room) or just use a vpn to bypass.\nCloudfare warp used to work for me till last year but it stopped working now, rn I'm using urban vpn and it works fine.\n\nEdit: you cant play games tho, even if you use vpn. It shows low ping but jitters a lot(atleast for valo it did)\n└── What can you do with hostel wifi then ? 😭\n    └── Without vpn only the basic social media, and some of the pirated sites are also unblocked i think. With vpn, you can use anything so without vpn it would be hard. But yeah vpn sometimes reduces the speed a lot so it becomes hard when th3 speed is low. But if you have 5g it shd be fine ryt, it mostly works everywhere\n        └── Can you like use steam, epic games store or is it too much to ask ?\n            └── With the vpn you can browse the store,  but playing fps games is hard. You can prolly play story games"
  ]
}