{
  "title": "[Placements] Cooked Situation for 26 Batch?",
  "content": "No decent companies have come for placements after the first week (after Meesho, Zomato, Couchbase, Flipkart). Compared to the 2025 batch seniors, where more than 20 companies had visited by this time, it feels pretty disappointing.\n\nThe only good companies in terms of brand or pay seem to be LAM (who usually hire just 1 CS student) and StockX (which only looks at 9.5+ CGPA). The rest are either mid-tier startups like Titan Email or MNCs like Dover, which aren’t really ideal for CS students.\n\nWhen are companies like Okta, Juniper, Palo Alto, IBM, Oracle, or Amazon expected to come—if they’re even coming? The issue is, if we apply to some random startup now and end up getting an offer, we’re stuck because of the restrictive placement policy. That means we won’t even get the chance to apply if better companies come later.\n\nUnlike seniors, who were at least told which companies were coming in a given month, we haven’t been given any information. We didn’t even have a proper placement orientation.\n\nIt honestly makes you question the point of maintaining a 9.2+ CGPA and building strong skills when so much of this process feels luck-based—like whether you get an easy or tough DSA problem compared to your peers. On top of that, companies are now exploiting freshers by expecting them to know everything, including LLD, right from the start.",
  "metadata": {
    "id": "1mrlwzz",
    "author": "Glum-Bodybuilder-801",
    "url": "https://www.reddit.com/r/PESU/comments/1mrlwzz/placements_cooked_situation_for_26_batch/",
    "permalink": "/r/PESU/comments/1mrlwzz/placements_cooked_situation_for_26_batch/",
    "score": 124,
    "upvote_ratio": 0.99,
    "created_utc": 1755322319.0,
    "flair": "Placements 🤑",
    "nsfw": false
  },
  "comments": [
    "Don't lose hope so soon. The peak is usually on September or October where most of the good companies come.\n└── The thing is I dont know if I should Gamble and leave some companies coming now in hopes of better ones ( cuz the current companies dont seem to pay well or have big reputation or growth)\n    └── How were internships/ppo for your batch? ",
    "At the time of writing this comment, exactly 21 companies have visited / are yet to visit campus. It's not exactly too great, but it isn't down the drain yet either.\n\nI was rather annoyed by how Netcore Cloud went about the whole shortlisting + interview process (all on campus btw). That entire day was a waste of time, with people freely being able to cheat and still get shortlisted.\n└── Let me tell you, as someone from the 2025 batch, placements constantly feel like a punch to your gut. The amount of cheating, the sheer greed of people who are placed during this season will drain you out physically and mentally. You'll see the true colours of a lot of people who seem to be \"good\" people. \n\nAlso. something similar happened for major companies such as Apple, where many people wrote their tests from home and had a much easier second round(a friend of mine got asked some pretty basic linked list related questions). \n\nFor your own good, please don't be too hung up on one company, because it will just hurt you.\n    └── So you remember which month apple came?\n        └── Going through my e-mail, Apple had their OA on the 21st of August which didn't happen because the website(Codepad) ran into some issues, so their actual OA was on 23rd August.\n            ├── They kept the OA next day in campus so I think they considered only those who actually attended the test\n            │   └── Nope, OA was shared with everyone, friend who wrote the exam and got shortlisted was in her native\n            │       └── woah damn\n            └── Can you DM me the job description?",
    "I'm from the 2025 batch. \n\nOkta came around this time for us, so did IBM but Oracle came much later- sometime in September or October. They came once again in December. Oracle also recently did layoffs, so take that as you will.  Amazon never came to PES for a traditional SDE role, but rather a Cloud Support Associate Role, but it was also in September-October and not now. Palo Alto never conducted their OA. \n\nWe were never told which companies are coming every month, it was just during August-September along with the orientation. \n\nAlso, what's wrong with Dover? The pay seems okay and you're working in their software division anyway, a lot of students would like to work there. \n\nWhat a lot of people did was get placed in a reputed enough tier 2 FTE, like Deloitte which came around August- September and then got better placements as more companies came.\n└── Dover issue is they didn't mention base salary \nThey came with 2 salary range 11-13 or 15-16 ctc based on interview performance.\nBut that's ctc base could be low \nIts prolly fine if u get 15-16 offer (base might be 11-12)\nBut ig u get the other offer (which I'm guessing they will give a majority of ppl) - base would go very low\n    └── You'll unfortunately see a lot of companies not giving a complete breakdown of their pay. I think 11-13 CTC is still a good amount, since your switch depends on your previous CTC. Along with this, the CTC breakdown varies heavily across companies. Some include a bunch of unnecessary costs in it, others don't. Also, depending on your lifestyle and whether you'll need accommodation here or not people's priorities will be different.",
    "It's actually very concerning scenes for our batch.. Only startups are coming and their recruitment procedure is very random and non-standard compared to bigger companies..\n\nAlso Okta and IBM won't be coming this year from what I know. Juniper is acquired by HPE now so mostly they won't come separately to hire. Actually f\\*cking cooked scenes\n├── Ur sure of IBM?  \nCuz I thought they will save the day(considering they hired a lot last yr)\n\nI heard they went to MSRIT this year and hired some 25 ppl? similar to last year\n│   └── Source?\n├── Yep, can confirm, okta is not coming (work there rn). \n\nOne of Somu or animesh pissed off the recruiting lead at okta...\n└── I heard the same from a person like my friend no clue what the source is",
    "Same thing happening in VIT too"
  ]
}