{
  "title": "[Question] Laptop Recommendation (yes i have gone through the FAQ’s)",
  "content": "I can’t decide what would be better Asus Zephyrus(G14) Or Macbook? I mean the only Upside In Zephyrus would be Gaming I Suppose If any senior or any can help me between these two would be really helpful ",
  "metadata": {
    "id": "1ms2g9e",
    "author": "Hopeful-Yoghurt-1285",
    "url": "https://www.reddit.com/r/PESU/comments/1ms2g9e/question_laptop_recommendation_yes_i_have_gone/",
    "permalink": "/r/PESU/comments/1ms2g9e/question_laptop_recommendation_yes_i_have_gone/",
    "score": 2,
    "upvote_ratio": 1.0,
    "created_utc": 1755366719.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "Short answer: If you do not game, do not buy a gaming laptop\n\nLong answer: Go back and read the FAQs, cause it seems you missed this very big paragraph:\n\nhttps://preview.redd.it/rxftp851xhjf1.png?width=709&amp;format=png&amp;auto=webp&amp;s=96be109b14a615015d8da13a3bb358cd9926318c",
    "I have been using a MacBook, no concerns till now in cs but Windows ppl have some problems like using 100 apps for opening different types of pdf and such things that is easy work in Mac. Yeah there are down sides like gaming, but in other work it's very good faster and easy to use\n└── Considering you’d have friends who have gaming laptops and you yourself have used mac if you were given a choice what would you choose?\n    └── I would choose mac\n        └── can i dm you if you don’t mind?\n            └── Yeah",
    "Zephyrus is not available in India afaik, if smtg goes wrong, ull have to go through a lot of hell trying to get it repaired. Even if International warranty can be applied, if a model isn't sold here, they don't repair it\n└── It’s available in Vijay sales\n    └── Peace then",
    "you need to also mention what is your requirements.  \nif u game or not , if you do , do u play light games or triple-A games.  \nI would recommend macbook because :  \nLight weight , can carry everywhere.  \ncharger is also pretty small unlike the gaming laptops.  \nLong battery life.  \nUnix based , So u dont need to dualboot/WSL.\n\nThese are my opinions because i travel a lot, u might have different based on your requirements."
  ]
}