{
  "title": "[Question]is learning web dev worth it",
  "content": "currently 5th sem i dont know jack shit about webdev WT jus studied for marks, watched hell lot of tutorial but can build a simple project on my own as well.  \nso is it worth it to learn web dev (thinking in placements perspective as well )",
  "metadata": {
    "id": "1msg1lp",
    "author": "Then-Tradition-6284",
    "url": "https://www.reddit.com/r/PESU/comments/1msg1lp/questionis_learning_web_dev_worth_it/",
    "permalink": "/r/PESU/comments/1msg1lp/questionis_learning_web_dev_worth_it/",
    "score": 20,
    "upvote_ratio": 0.96,
    "created_utc": 1755400381.0,
    "flair": "Placements 🤑",
    "nsfw": false
  },
  "comments": [
    "Yes it is worth it , but dont keep it as priority for placements. DSA is more important for placements. you have subjects like DBMS , SE , CC  where you need to do a mini project with a bit of web dev knowledge , Complete all these projects deployed before the 7th sem placements.\n└── But without web dev, what other projects can we do? \n    ├── There is a world beyond web dev. You do not need web dev to get placed. I do not know who is spreading this misconception, but you should build your profile around what interests you. The more specialised you are, the better the odds of you finding a niche and being skilled in that field, which in turn makes you more hireable than a generalist SWE.\n    │   └── Sorry if I sound ignorant , but apart from webdev/appdev, I heard there aren't many positions open to a fresher?\n\nML/Ai roles as you said mostly don't hire freshers.\nCould u pls let me know what else options do freshers have then?\n    └── +1",
    "If you are not that much interested in Web Dev, its better to avoid it. Recently AI also has been getting better with frontend so unless you actually delve deep into web dev and gain a certain level of mastery over it, with actual detailed and good projects, it won't be worth it as much. You could rather spend your time doing dsa and maybe some other tech stack like ML.\n\nIf you still wanna go for web dev, refer to my goat's comment over here:\nhttps://www.reddit.com/r/PESU/s/YMK1O7sBMj"
  ]
}