{
  "title": "[Question]What are the class timings for ec campus ( cse )",
  "content": "also , how many half days will we have in a week",
  "metadata": {
    "id": "1mtje7j",
    "author": "Antique_Rub550",
    "url": "https://www.reddit.com/r/PESU/comments/1mtje7j/questionwhat_are_the_class_timings_for_ec_campus/",
    "permalink": "/r/PESU/comments/1mtje7j/questionwhat_are_the_class_timings_for_ec_campus/",
    "score": 17,
    "upvote_ratio": 1.0,
    "created_utc": 1755516612.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "All days in odd sems like sem 1 start at 8 am here.\n\nMy section had 2 half days in a week, thats is till 1pm.\n\n2 days ended at 3:15 pm\n\n1 day at 4 pm.\n\nAlso, there is an online class on Saturdays for EVS/constitution, timing depends on section.\n\nEdit: one of the half days is guaranteed to be Wednesday, for all sems\n\nFor even sems simply shift the above timings ahead by 45min.\n├── is this schedule the same even for cs+aiml students?\n│   ├── Ye ,first year you PPL have combined classes based on your name ,no branch wise classes\n│   └── Yes\n\nActually, in 1st year you will be in a classroom where ppl from all branches - cse, ai and ece are there, so branch doesn't matter.\n\nFrom 2nd year you will be with people from your branch, based on the order of srn\n│       ├── And do you remember when college ended for you on the very first day among these three timings?\n│       │   └── I don't currently remember\n\nAlso the first week is actually bootstrap week where you will work on activites related to various engineering branches, and every day, it will all end at 4pm most likely.\n\nThe attendace for that week doesnt count anywhere so there's no use of attending bootstrap. After that week classrooms are alloted and classes start right away.\n│       │       └── So you're telling me that I can skip classes next week. Thanks for letting me know lol!\n│       └── is the timings same if I join after round 2?\n│           └── i wasnt in a section with kcet round 2 students, but from what i had heard, there are extra classes to cover up the syllabus you miss, so you may not get half days\n│               └── ![gif](giphy|TW8Ma1a8ZsZ8I)\n└── Schedule is very hectic 😔",
    "Cfbr"
  ]
}