{
  "title": "[Capstone]\n\nhow does the whole thing work; like from the 5th sem to final year; there is a faq about capstone but it doesnt really answer all my questions; i wanted to know how the grades are awarded and what happens each sem till graduation",
  "content": "i",
  "metadata": {
    "id": "1my2d2j",
    "author": "Wrong_Arrival_6875",
    "url": "https://www.reddit.com/r/PESU/comments/1my2d2j/capstone_how_does_the_whole_thing_work_like_from/",
    "permalink": "/r/PESU/comments/1my2d2j/capstone_how_does_the_whole_thing_work_like_from/",
    "score": 13,
    "upvote_ratio": 1.0,
    "created_utc": 1755957940.0,
    "flair": "Placements 🤑",
    "nsfw": false
  },
  "comments": [
    "Yeah so it simple you take the very easy electives. Cause it doesnt matter even if you dont do specialization. Hardly anyone asks for it. They will say its good and shit but dont listen to them. Your CGPA always prevails you in the placement exams. The companies always prefer above 8.5 so its always safer to be on that boat rather than doing hard electives and gaining nothing. \n\nJust do the basic amount of study everday. PPT's are always good because thats the very lifeline of PES exams, but yeah concepts has to be understood. So 5 subjects, 3 core and 2 elective for 5th sem. You have to do good in the core subjects. Just focus on your ISAs and if you choose easy electives then you will get SGPA above 8 for sure. \n\nThe capstone is one that makes you a little anxious cause its something new to some ppl without any guidance. There are some who knows because of the long link of communication line they have established and trust me they wont share a single thing to you. They act like gullibles but they know everything. Be aware and stay away from these dipshits. \n\nSo the first step is to find a good professor with good amount of knowledge in his/her field, i mean everyone has but you can tell apart who has more fun way of teaching. You must have you fav. Then the next part is knowing which domain you are comfortable. Then meet the domain heads. They will tell you everything about the current job market and which path you have to take. \n\nThen comes the choosing part. What actually you are good at. Suppose you want to VLSI domain then you might be good at the EDA tools. So team up with someone who has good core knowlege. I mean not the top level but the basic like whats the main use of comparators, how does you SAR ADC works, how you can integrate the Memresistors into the medical applications. So you have to choose some topics. You will always have a idea if you know your domain and you will get a clear insight once you talk to the domain heads.\n\nLastly once you have finalised the topic, go and research some of the papers related to it. What you have been thinking has already been done 10 years ago. But you can always combine your ideas with theirs. \n\nNo need to worry about the presentations. If you can speak no one will ask you questions. They will be convinced by you communication only. And if you can speak then you can tell anything. The only tough part is in the 7th sem where you have to bring you idea to real life. And i mean you will only have 3 months of time to do it. And you have two option either do the summer internship in June/July after 6th sem or do the capstone. I would suggest if all team members dont get internship dont waste time finding one after another. Just go for capstone. You will get a good conference if you publish your paper early, i.e before October month. \n\nSO DONT WORRY ABOUT CAPSTONE, ITS ALWAYS GETS DONE IN THE END. WE ARE ENGINEERS AND WE ALWAYS WORK IN THE HEAT OF MOMENT.  AND KEEP YOU ISA SCORES CLEAN YOU WILL HAVE A GOOD CGPA LINE. \n\nALL THE BEST... HAIL HYDRA...",
    "It's better if you know your topic by 5th sem. 6th sem is literature review, 7th is the experimentation phase and analysis. \n\nIn 8th sem you just focus on publication"
  ]
}