{
  "title": "[Question] Masters vs Job after CSE undergrad – Need advice from seniors",
  "content": "Hi seniors, I’m in CSE undergrad and a bit confused about whether to go for a master’s right after graduation or start working first. Would love to hear your experiences:\n\nFor seniors who chose Master’s:\n\t•\tWhy did you choose master’s over working right away?\n\t•\tDid you feel a CSE bachelor’s wasn’t enough, or was it due to job market conditions?\n\t•\tHow has your master’s experience been compared to undergrad?\n\nFor seniors who started working:\n\t•\tWhy did you skip/postpone doing a master’s?\n\t•\tAfter some job experience, do you feel the need to study further?\n\t•\tDo you think industry exposure is more valuable than academics?\n\nAny insights or advice would help a lot 🙏",
  "metadata": {
    "id": "1mypvco",
    "author": "iampewdsfan",
    "url": "https://www.reddit.com/r/PESU/comments/1mypvco/question_masters_vs_job_after_cse_undergrad_need/",
    "permalink": "/r/PESU/comments/1mypvco/question_masters_vs_job_after_cse_undergrad_need/",
    "score": 33,
    "upvote_ratio": 0.95,
    "created_utc": 1756022936.0,
    "flair": "Placements 🤑",
    "nsfw": false
  },
  "comments": [
    "I worked for 2 years before going for Masters. I've also got friends who went immediately, and some who worked for a longer time and then went. I'll be primarily highlighting from my experience, but you can get more relevant opinions from the PESU Study Abroad server since it appears the comments so far are one sided from those who aren't pursuing one right now. \n\nThe primary reason I decided on a Master's was based on my primary career interests. I realised in my 3rd year that I wanted to get into research and research-adjacent roles. I even intend to get a PhD later on. Given this, the scope of such opportunities in India are a fraction of what the US provides. There's a whole world of difference when you're in India and working at a small lab and being forced to carry out in depth research on something you aren't passionate about, compared to my current experience right now where I'm working with profs who made groundbreaking movements in my field, and whose papers I've read and learnt from. Being in the same room as them is humbling, but also surreal at the same time. There are way more opportunities both on and off campus to pursue *good* research, work with profs, make connections in academia and advance the field, compared to India where only a few companies have research divisions and labs, and even if they do, they either don't work on any major problems, or sometimes are very specific about hiring from T1 colleges like IITs. Regardless of where your research interest lies, you'll eventually find at least 10x opportunities to work on them here. And an additional note - most if not all core research positions need a Master's, so this was always going to naturally be the next step for me. \n\nAs for why I chose to work for 2 years - I was in a research-adjacent position already at a top MNC. Although the scope of research was very low, it was the best that a fresher right out of undergrad could be offered. However, there was a good alignment with the kind of research I was interested in, although there wasn't any depth to it. At that time, I also chose to work 2 years because I was earning well and I knew the financial support would help me when I eventually left for my Master's. Masters is very expensive, and any kind of additional financial support really helps you live a slightly more comfortable lifestyle. There were other personal factors as well: my friends were also planning to go after 2 years of work experience, and it made sense to go through the process together (one of them is my flatmate now haha), and I also did itch for a break from academics after PESU. I also felt that my current role in a top MNC would help me vastly make industry connections when I'd be looking for jobs/internships here (it did, a LOT). \n\nThis is my POV. I'm sure you'll get at least 10 more if you ask on the study abroad discord server. At the end of the day, many of your questions will be answered by you based on your objectives. Depending on your field, you may realize you don't need a Master's, or you might not want to study anymore either. Sometimes, people land a great job and get comfortable there and don't want to explore a Master's anymore since they're satisfied already. There's no one answer to any of your questions, most people have a different answer.",
    "I got a job basically for the money.\nAs for why I skipped masters, well money again.\n\nMasters abroad are a really good way to relocate if you want to, but it is expensive as fuck (unless you are smart enough to get a scholarship).\n\nI also wanted the experience so I got the job since I thought that masters with experience is better.\n\nBut now that I am working, there is no incentive to do masters unless I want to relocate.\n\n\nAt least that was my reasoning to get a job.\nIf you want the real story about masters you gotta ask the peeps doing masters.\n└── Thank you",
    "i did not want to study any more, so i just started working. Maybe after 2-3 years i might change my mind.  \nIf i want to get into AI/ML roles , yes i would want to have a masters (preferrably from abroad).  \nBut otherwise i would like to work , get promoted or maybe try switching.   \n\n\n&gt; Do you think industry exposure is more valuable than academics?\n\nSome Masters program will have industry collaboration directly with Research assistantships and Internships."
  ]
}