{
  "title": "[OffTopic] Does luck matter in placements?",
  "content": "Just wanted to know if luck really matter in placements or is it just sheer skills and hard work?\n\nSeniors you can drop your placement stories too if any.\n",
  "metadata": {
    "id": "1n17tp1",
    "author": "Unusual_Sky5634",
    "url": "https://www.reddit.com/r/PESU/comments/1n17tp1/offtopic_does_luck_matter_in_placements/",
    "permalink": "/r/PESU/comments/1n17tp1/offtopic_does_luck_matter_in_placements/",
    "score": 59,
    "upvote_ratio": 0.93,
    "created_utc": 1756269717.0,
    "flair": "Placements 🤑",
    "nsfw": false
  },
  "comments": [
    "A lot of biased opinions here, but here's the truth: luck matters everywhere in life. But the extent to which it helps you depends on how well you capitalise on it. \n\nMost people here think that they didn't get shortlisted because they were \"unlucky\" or that others did because they were \"lucky\" to get easier questions. What people forget is that luck simply opens a door but it's still on you to walk through that door and drive it home. \n\nIf you aren't getting shortlisted even after solving the OAs 100%, it isn't because you're unlucky. Not sure what people expected, but solving them 100% *never* guarantees shortlisting. It's often a combination of various parameters, some visible (CGPA, how many solved) and invisible (how long the candidate took to solve a certain question, resume). If someone solved 50% of what you did and their resume was a better fit, I don't see why you'd get shortlisted over them. That was never guaranteed. \n\nThe only time luck has a very evident presence is the set of questions you get asked in the interview. Some draw the short straw and are questioned on their weakest points. But again, people forget that even if you don't get interviewed on your weak points, its still on *you* to actually do well. You're still going to have to be strong at something to clear the interviews. \n\nLuck can make placements a little easier, that's it. At the end of the day, it's still 75-80% your own hard work. People who say that \"luck is all you need\" simply don't know how shortlisting works, or never had anything else on their profile so luck is literally all they had.",
    "Luck matters alot more than you would think lol",
    "It matters so much, it feels like skills don't matter at all. The selection process is completely random",
    "Yes it's 80% luck mostly.",
    "just like anywhere in life , ofc luck matters",
    "Hard work is non-compromisable but in campus placements, it yields nothing if you're just so unlucky to get the most grilling or many times interviewer who's not interested only.",
    "LUCK MATTERS ALOT, Sometimes the selection process is so random.",
    "It matters a lot than you think",
    "When it comes to  placements, luck plays a much bigger role than most of us realize. I’ll share a few real examples from my own circle\n└── One of my friend was extremely strong in competitive coding  literally a master at DSA. From the first year itself, I remember him skipping dinners just to participate in CodeChef contests. He didn’t have many projects though, and he was very stressed during the 6th semester about whether that would hold him back. During the semester break, he finally built an Android app on his own. In the interviews, this app turned out to be the differentiator. No other candidate had built something like that, and it caught the interviewers’ attention. He eventually got placed at Meesho with a 56 LPA offer in an Android development role.\n\nHere, his skill and hard work mattered, but luck also played its part  the fact that his unique project stood out at the right time.\n    ├── Lord hashir\n    ├── Another friend had a GPA of around 8.4. He wasn’t active on Leetcode, barely solved a few problems here and there. For the online assessment, he somehow managed to get shortlisted despite not being great at coding(Def GPT). Surprisingly, in his interview, there were no DSA questions at all. Instead, the panel focused on core subjects and his resume. He was very good at explaining his projects, connecting his experiences, and carrying the conversation confidently. That storytelling ability and subject clarity helped him crack the interview.\n\nHere again, luck played a role  the interview never touched on his weakest area.\n    │   ├── Then there’s another friend who went for a Business Analyst role. He wasn’t strong in DSA either, but he had decent skills in Python and SQL. During the interview, he couldn’t answer many of the direct SQL questions. However, when scenario-based questions came up, he gave clear, structured solutions and explained his reasoning confidently. The interviewers were impressed more by his clarity of thought and confidence than by the technical details. That’s what helped him secure the role.\n    │   │   └── Luck definitely influences placements. Sometimes it’s about the project you build at the right time, sometimes it’s about the interview panel not asking the questions you fear, and sometimes it’s about how you carry yourself when you don’t know the answer.\n\nAt the same time, CGPA does matter. A higher GPA opens up more opportunities by allowing you to sit for more companies. But once you’re in the room, **your confidence, communication, problem-solving approach, and personality** often make the difference.\n\nIn short, placements are a mix of preparation, skill, and a little bit of luck showing up at the right time.\n    │   │       └── Thanks for sharing all this! Very insightful\n    │   └── Again, not luck. If your friend actually had a great profile with projects and experiences, *that* is what interviewers would always focus on. Read my FAQs, you'll understand more on how interviewing works. Interviewers only focus on core DSA when there is nothing worthwhile on your profile that stands out and can be interviewed on. That's not luck, that's simply how the system works. If you're getting questioned on core DSA during interviews, that should be enough of a feedback to know that you don't have a good fit with the roles they're hiring for or you don't have anything that stands out. \n\nThat's not being lucky, that's again your friend putting in efforts at the right time. There's maybe a sliver of luck that your friend didn't have DSA *at all* but focusing entirely on his projects/experience is standard procedure and not the exception. As I said, DSA during interviews is a fallback.\n    │       ├── ![gif](giphy|YExAAySmC0I9u2TjKJ|downsized)\n    │       └── I disagree. I know someone on a Slack community who sucked at DSA but has a stellar profile(Open-Source Contributions and positions of leadership within the organization too). Still, the first filter for her interview was DSA(After giving an OA). She eventually got a great job but DSA was what prevented her from getting a job much, much earlier. The market is pretty bad now and they want to filter as many people as possible and DSA is the best way to do that. Projects and experience come much, much later when they're convinced of you through DSA.\n    │           └── Cherry-picking examples that support your argument does not help. I have been on both sides of the interviewing process since 2021 - both in India and here in the US (for the latter, I have only been on the receiving end), so my opinions come not only from my own observations of processes I witnessed when we were hiring at work, but also interviewing experiences over the last \\~4 years. While I will agree that *some* companies do emphasize DSA during interviews as well, a vast majority of the \"first round\" interviews are to evaluate a potential fit with the role(s) they are looking for, rather than evaluating your experience in that role.\n\nInterviewers will typically rely on DSA during interviews if they (1) don't see a good fit or are (2) unable to decide anything within the first interview, or (3) see some potential in your experience/skills in field X being transferable to the field Y that they are hiring for and finally (4) nothing on your resume stands out, so they need some other metric. Having great OSS contributions, GitHub profiles etc, is amazing to have, but if your experience, skills, and contributions are not *relevant* to the roles the company is hiring for, odds are you will be tested on DSA to filter you out before evaluating how well you can adapt to the new role. Today, if I sit in interviews for a completely irrelevant role, I can very well bet on it that there will be some component of problem solving involved (may not be a very high amount since I am not a \"fresher\" anymore, but it will exist), compared to if I sit for an interview for a role that I was previously in.\n\nYes, the market is bad, but the only thing that has changed is how competitive the OAs have gotten and the % of candidates being eliminated. Interviewing standards have more or less remained the same, and I've been seeing this process closely over the years. \n\nThis isn't what most of you want to hear, so I know you will downvote me, but my opinions are entirely based on facts and experiences averaged over multiple data points, and you cannot run from that, regardless of how much you do not like it. Not getting shortlisted can be due to a host of reasons, but \"luck\" is not the primary one.\n    │               └── To be honest, I agree with you. You're correct but at the same time, a lot of things depend on Companies, how aggressively they're hiring, the interviewers you get and so on. It also depends on what people around you are doing and how honest people are around you. I did type the answer in a hurry too, and I want this to be a healthy discussion too. \n\nI can give many examples from my own batch(2025)- Apple and IBM, a lot more in DMs rather on a subreddit, since I know some teachers read messages here. Lots of people I'm talking about in these examples are my friends. They have pretty normal PESU standard resumes which I've seen. (aka most of the people mention projects from within their coursework, they have one paper out which is their capstone)\n\nWhen people went to the IBM Interviews, they were split into two groups- Automation and Data&amp;AI. Within Data and AI, I had a friend who got asked multiple questions on core subjects such as OOAD, Networks and OS. On the other hand, the second friend got an HR-cum simple interview round- asked about the types of ML, their applications and eventually STAR-format questions. Keep in mind, both these people have done a lot of their projects together as a team. The second person got a more lenient interviewer than the first one. How was this determined? The second person got lucky. I know a few other people who also gave IBM interviews- and a lot of them were asking people about their plans to study abroad. Some interviewers saw it as a deal breaker, while some people still got the offers despite saying they are planning to do their masters'.\n\nI can say the same with another company- Apple. The OA platform ran into an issue and we were all called to college the next day to write our exams. They were not checking whether you were physically present in the examination center, only Sridhar sir gave a talk on ethics and how we should uphold them. Many people wrote the OA from their home/hometowns. They were taking a big gamble, but they got lucky, a lot of them went on to the next interview rounds after this. Even during the interviews, some people got asked HR round questions, some people were asked DSA again. \n\nWhat you said is right and should be the standard. I know many software engineers in my family who are based in India and abroad and reached out to them for interview insights during my own placement season and a lot of people mentioned that they don't like asking DSA questions during interviews- they're often given the question on short notice too and its just much easier asking people about their resume and projects since they find that it flows much more naturally and follow-ups are also easier to ask.\n\nA lot of them also mentioned that its much harder to verify projects as a result of AI, so DSA becomes a more verifyable metric to them. I had a relative tell me that she once saw hackathon wins and projects as a very good talking point, since it showed initiative  and also provided many insights into their design thinking. However, now with AI she finds that people are unable to talk about their projects they way they used to be able to. So as a result, the question sheets now include more DSA, which once again does align with what you said.\n    ├── Good intention but wrong example. Luck did not play a role in his project standing out. Your friend's hard work at the right time stood out. There's a world of difference. He did not get placed because he was \"lucky\" to make the app. You're underestimating your own friend that way, be better.\n    ├── What was his gpa ? ( If u don't mind sharing)\n    └── can i ask what his gpa was?",
    "Yes, a lot. a LOT.",
    "Yes",
    "when you try so hard to compensate for your bad luck . Then you realize luck is the only thing that matters.",
    "It does matter a lot. Like few companies just took people so randomly. Especially our year Apple placements were so random. Everyone was asked questions of different levels and all. But don't worry in the end you will get what u deserve."
  ]
}