{
  "title": "[Discussion]  doubts from juniors",
  "content": "is it actually useful to join pr , logs , evm, hosp ... (non technical domains) of any club?? or is it just running around to get the work of the core members done? this yr i specificlly wanted to join the tech clubs (tech domain) but i am wondering if joining the non tech domains are gonna be of any use to me ?  - i request the seniors to give an honest review",
  "metadata": {
    "id": "1n1byjs",
    "author": "No-Willow-1446",
    "url": "https://www.reddit.com/r/PESU/comments/1n1byjs/discussion_doubts_from_juniors/",
    "permalink": "/r/PESU/comments/1n1byjs/discussion_doubts_from_juniors/",
    "score": 8,
    "upvote_ratio": 1.0,
    "created_utc": 1756285437.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "I personally think all the clubs have lost it’s charm by the time I graduated but don’t know what is the status now, but by joining the clubs you can build up a good network",
    "Wait till you find out that joining tech domains of clubs won't directly help you either!",
    "For sure. QQC got me laid.",
    "Bro there is no use of joining in pesu clubs bro , it not worth at all they don't see and also no one will ask , it better to do something e online course, it's ur wish finally",
    "pesu clubs arent like other college clubs , each club has 1 big event every year and they only work around the time of the event , maybe the top tech clubs and cultural clubs like meraki or kannadakoota are more active but idk. The only way to feel the club culture is if you are in like 7-8 clubs. Answering your questions , joining non tech domain is useful if u intend to socialise and make friends with people across the college else its not.",
    "I was a club head of a tech club i revived back, and during initial days I nearly did all the work mentioned here, PR, logs, evm, etc. etc. and put in a lot of effort, so I think I am entitled to answer this \n\nSo, see, in any tech club, the non tech domains exist because that X domain people can focus on that only, and others can focus on other domains, thus the segregation, so will it be of use? we don't know, it depends on you, do you like doing all that kind of work, like running from pillar to post for permissions for events, handling hellot of excel sheets, and spreadsheets, gathering market research data, and get sponsors, hire new talent to the club, like to serve and take care of guests, organize events, marketing? then, yes go ahead. But don't ask if it helps in placements, as very less or no companies really come for that.\n\nits just a fun experience for you, that is all I can say. No harm if u dont join such domains, as u may have no interest, join whichever domain u like, then u will lead a happy life in that club."
  ]
}