{
  "title": "[Question] Can anyone please help me clarify doubts on how credits work for interships in the 8th semester?",
  "content": "\\[Urgent\\] I had worked as a summer intern in a pesu research lab and I got the corresponding 2 credits for summer. I have 142 credits after completion of 6th semester. Due to this I only opted for 1 special topic (2 credits) in the 7th sem. However I heard from a friend that because I got 2 credits from the 2 month summer internship, I can only get 6 credits from the 6 month internship during 8th sem instead of the full 8 credits.\n\nI am feeling really scared now because if this is true then I will not get 160 credits needed to graduate college. Can someone please answer this question? Will I still be able to get the full 8 credits from the 6 month internship?",
  "metadata": {
    "id": "1n1ku1d",
    "author": "Miserable_Goat_6698",
    "url": "https://www.reddit.com/r/PESU/comments/1n1ku1d/question_can_anyone_please_help_me_clarify_doubts/",
    "permalink": "/r/PESU/comments/1n1ku1d/question_can_anyone_please_help_me_clarify_doubts/",
    "score": 8,
    "upvote_ratio": 1.0,
    "created_utc": 1756310027.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "Yeah you should have opted for 2 special topics this time. It was very clearly mentioned in the orientation thingy. But you can do an extra special topic in the 8th semester i think. Talk to some faculty and find out for sure.",
    "The credit split for 7th sem is 2(spl topic) + 2(spl topic) + 4(capstone) = 8 and 8th semeter its 8(internship) + 4(capstone), so in total 20 credits for the final year, but as ISFCR summer internship credits were given as spl topic credits, some students had 142 and required only 18 more credits, so as a relaxation they can take only 1 spl topic in 7th semester, coming to 8 credits from internship, 2 weeks of internship = 1 credit, so 4 months of internship = 8 credits, which we can get easily as most of the spring internships are for 6 months\n└── Wait so the ISFCR/IOT internship will be taken as special topic credits? Could you please confirm this? I did internship in the IOT lab ( I think it was the same as the ISFCR one - UE21CS32AC Experimental Case studies in Cyber Security and IOT)\n    └── https://preview.redd.it/1rkyesk8mllf1.jpeg?width=1080&amp;format=pjpg&amp;auto=webp&amp;s=11e8b07fbfd3815f6ef115fd209c89f246613a36\n        ├── Thanks a lot man. I was so scared that it was counted as internship credit. Did you also take one special topic (technical writing) for 7th sem\n        └── ISFCR is scam bro, they dont consider it as internship, its special topic. I also faced this, mfers made us work for 8 hours a day offline for nothing. I hate them"
  ]
}