{
  "title": "[Discussion] PESU-Alumni ask me anything",
  "content": "Hi there , \n\nI am pesu graduate from ece department got admission through PESSAT when it was a thing didn’t get a nice cgpa but got placed into a tier-1 company after giving interviews to 8 companies so , ask me anything from hostel to placements everything I can share my experiences ",
  "metadata": {
    "id": "1n21vmg",
    "author": "Stunning_Estate_3564",
    "url": "https://www.reddit.com/r/PESU/comments/1n21vmg/discussion_pesualumni_ask_me_anything/",
    "permalink": "/r/PESU/comments/1n21vmg/discussion_pesualumni_ask_me_anything/",
    "score": 38,
    "upvote_ratio": 0.95,
    "created_utc": 1756352231.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "How did you prepare for placements? Did you do an internship in 3rd year? If yes did you get it through campus or from a referral?\n└── I started preparing for my placements from sixth semester doing leet code and striver sheet , yes i did my two months internship in third year which i got from a referral but it doesn’t help much in your interviews or while resume short listing until and unless the company which you are giving interview is in the same domain",
    "how is the competition in pes? Is it really that hard to get 9.0+ cgpa? Also I'm in first year so I don't know much.. also those people who got 10cgpa wtf did they do?😭😭 How do college exam even work?? And mainly HOW TO STUDY FOR ITTT\n└── Competition in PES is very high and I personally feel it is hard to get a 9.0+ gpa",
    "What was the avg package for cse last year...?\n└── better question is what is the median package ?",
    "Which year did you graduate?\n└── 2023",
    "How is pes for ece if u want core?\n└── Mid, core placements are only 10 percent",
    "Assuming you got placed in a CSE based company, What exactly should ECE students learn to Crack the OA+Interview.. can I only do DSA and still get placed or do i need to do something more ?\n└── I did my minors in CSE with my experience in placements DSA is pretty much enough for an ece students because u already will be knowing networking by fourth year and little bit of dbms concepts you are ready for placements\n    └── Are tech related projects also important... will the chances of getting placed increase?",
    "Does networking matter for high paying jobs ??",
    "Did you get into technical or non technical jobs?\n└── Technical currently I work as a sde in a financial company",
    "Without a minor in cse, can we still sit and have the same impact as others who have minors? Also what are all the resources u used to crack (im assuming) SDE role?\n└── You can absolutely, I mean no one cares whether you have a minor degree or not until u have knowledge on the stuff they ask , for Dsa strivers I have used strivers sheet\n    └── You can only demonstrate your knowledge if you get invited to interview in the first place though. Getting invited to interview is harder than the interview itself\n        ├── Indeed very much true that is where you need luck\n        └── People who do well in the OA only get called for the interview right?\n            └── Yeah but for each oa in the starting months anywhere around 1000 people sit for it out of them 50-40 percent of people write the same answers how will they short list some 10-15 people so luck plays a huge part",
    "what was ur gpa(if u don't mind)? how hard was it to maintain ur gpa in ece?\n└── My gpa was less only it was 7.76 , i got a good gpa in first year but it dipped in second year",
    "What is ur advice for current 2nd year(CSE)\n└── Focus on your core subjects in second year because if you are strong in your core whether u are going to masters or trying for placements it will help you long way and u can start cp in your third year , and build good connections in your class it will make your college life cake walk\n    └── Core subjects as in? \nDSA,DAA,CN and OS?\n        └── Add web tech to it as well and will dbms be in second year of third year?\n            └── 3rd year",
    "Any advice for first years?\n└── Enjoy your college life and make some good friends that’s it because u won’t get your first year back and try to score some good cgpa because first year is the easiest\n    └── Thanks.. Gotta grind for the scholarship 😭.",
    "Could u tell more about ur DSA prep..which lang u did in nd how did u started ,would be better if u share ur roadmap..was strivers sheet enough or u were solving que on some other platforms also?\n└── First I started with python later shifted to Java , initially I started solving hackerrank questions post that I solved strivers sheet",
    "How satisfied are you with your career\n└── I mean on the career front I am satisfied, but on the personal front pretty depressed and lonely because when you are in college you have your friends and everyone around you but once you step into corporate you lose the connection of touch with them because everyone will be busy with their life",
    "Hey Senior, if you could provide some general advice about CGPA, anything we need to do in the 4 years, how to manage the hectic schedules and how to prepare for campus placements. Also if you could provide some insights on how you managed to get into TIER-1 company with such a low CGPA."
  ]
}