{
  "title": "[Question] Have regular classes started?",
  "content": "Hey guys, just wanted to check if REGULAR classes have started or if they are still doing orientation and intro sessions. (For 1st year students)\n\nI'm still waiting for my 2nd round results ;(",
  "metadata": {
    "id": "1n226be",
    "author": "_ash_ketchum_6",
    "url": "https://www.reddit.com/r/PESU/comments/1n226be/question_have_regular_classes_started/",
    "permalink": "/r/PESU/comments/1n226be/question_have_regular_classes_started/",
    "score": 6,
    "upvote_ratio": 0.8,
    "created_utc": 1756353178.0,
    "flair": "Admissions",
    "nsfw": false
  },
  "comments": [
    "I think bootstrap is still going on, so, no regular classes yet\n└── For students joining pes through 2nd round, will they have separate bootstrap pgms n all?\n    └── no not at all! you just join and then you'll have to catch up with the syllabus( around 1 or 2 weeks worth content is what you'll miss out on ig)",
    "Usually bootstrap goes on for the first entire week",
    "Mope bruh,monday will start,i guess\n└── Bro I am neet double dropper I will give jee mains next year acurrently currently I am enrolled in a govt college in west bengal i if I get pes next year my age will be 20 will i face any problem in placement and is there any second dropper is the in this collcollagecollage\n    └── nah nobody cares tbh by the time u come for placement u would be 24 or 25 so i dont think thats a problem\n        ├── My dob is 29 may 2006\n        └── What is percentile should I target for pes rr campus cse in jan\n            ├── 98 or above for cse\n            │   └── Nah 98 is prolly too high even for core cs. Considering that they're increasing intake every yr don't think that much will be needed.Did not go that high this year either. Before when PESSAT was also a mode of admission,a 98 would have been needed via JEE for core cs but currently I've a couple of friends with around 95-96 percentile in rr cse core via jee.I personally missed out by a couple of ranks and got AIML via jee before upgrading via PESU KCET. So dw.Cutoff ain't gonna be that high.They wouldn't charge 5lpa if it was lol.\n            │       └── oh i got in through kcet so i was thinking its 98, so what's the percentile for jee ?\n            └── this year it cse core closed around 95 and aiml around 93.1"
  ]
}