{
  "title": "[Placements] Samsung summer internship",
  "content": "Samsung has come for summer internship for 3rd year peeps . They shortlisted people who have gpa between 7.5-8.5 and no one above 8.5.\nIt might have been resume based but I dont think the gpas would be soo strictly in this range.\nSo grinding for gpa doesn't make sense now. \nI wanted to ask seniors does lot of companies do this ?",
  "metadata": {
    "id": "1n2zpfp",
    "author": "Medium-Specific9145",
    "url": "https://www.reddit.com/r/PESU/comments/1n2zpfp/placements_samsung_summer_internship/",
    "permalink": "/r/PESU/comments/1n2zpfp/placements_samsung_summer_internship/",
    "score": 43,
    "upvote_ratio": 0.96,
    "created_utc": 1756447988.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "If I recall correctly, Samsung shortlists people only if they have attended the PPT. Was there one?\n└── No",
    "There can be multiple possibilities:\n1. They might have shortlisted based on 10,12th and ug\n2. They might be looking for a particular skill only\n3. They might be doing resume based shortlisting \n4. You might have missed to attend any event hosted by them or in some cases the company sends the link multiple times and you have to apply.",
    "Bro wtf 😭",
    "Hardware-Digital, Hardware-Analog, Software-Embedded \n\nFor us, samsung semiconductors came only for above roles tbh, they had put 7 CGPA as shortlist. \n\ndepends on company to company, not all do this thing. resume based shortlist is there for couchbase only afaik",
    "Only people with 90+ in both 10th and 12th boards have been shortlisted\n├── I know people with 90+ in both who didn't get shortlisted\n└── Pretty sure it's a combo of both, GPA lesser than 8.5 and 90+ in 10th and 12th\n    └── Yeah\n        └── what is the sense of picking &lt;8.5 GPA only?",
    "Bruh I couldn't get the offer today cuz of having cg in lower 9s compared to the other folks with higher 9s🤡 It does matter and is only 1 step behind luck when it comes to placements\n└── cvent?\n    └── Yeah.. they took only 1 girl bruh..\n        └── Damn cvent only took 1girl fr?even though I heard they have alot of profiles and decent ctc\n            └── Yeah, a whole day procedure with 2 OAs and 3 rounds just to see them take 1 student 🤡"
  ]
}