{
  "title": "[Discussion] 3rd/ 4th year seniors - does the college help for learning you with the stuff needed for interviews and everything for companies or one needs to do their own side hustle and study evrything from own to get selected?",
  "content": "Reply please ",
  "metadata": {
    "id": "1n34lhq",
    "author": "Awkward-Simple3265",
    "url": "https://www.reddit.com/r/PESU/comments/1n34lhq/discussion_3rd_4th_year_seniors_does_the_college/",
    "permalink": "/r/PESU/comments/1n34lhq/discussion_3rd_4th_year_seniors_does_the_college/",
    "score": 6,
    "upvote_ratio": 1.0,
    "created_utc": 1756466128.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "Yeah,you learn everything you technically need for placements.The projects part is also mostly done in college as well but I’d recommend doing more in depth projects where you actually know every bit.",
    "It's kind of both; You learn the majority of things during your 2nd and 3rd year; But still you have to do things like project and other practical skills on your own.\nThe clg doesn't hold any placement preparation classes, you have to use your knowledge from all the semesters or study the major things on your own",
    "It Gives you some stuff in the form of hands on and projects.  \nProjects from Subjects like Big Data , Data Analytics , Blockchain , DBMS , cloud computing etc are very helpful in your resume, given you explore stuff on your own and apply the concepts taught to you in class.\n\nPes has standard industry level TextBooks for theory subjects like CN,OS,DBMS for interview level prep.\n\nconclusion is you dont need to study everything on your own , but doesnt mean you should also expect everything from PES itself.",
    "DSA you need to do on your own. Technically they do teach you DSA in college but there's no way it's enough to pass OAs and sometimes interviews. Other than that OS, CN, DBMS it's all taught well. Obviously you might need to brush some specific company or interview related question at the last moment but yeah everything is taught in the coursework. BD and DBMS helps you in projects but I'll recommend going to hackathons for projects. And also do competitive programming, will help a lot clearing OAs."
  ]
}