{
  "title": "[Placements]  “IBM 17 LPA annual remuneration offer – what’s the actual in-hand salary?”",
  "content": "Hey everyone,  \nIBM has come for campus placements this year and mentioned the following package:\n\n* **Compensation (Regular):** B.E/ B.Tech / M.E/ M.Tech / M.Sc / Integrated (B.Tech+M.Tech) / Dual (B.Tech+M.Tech) / MCA → **INR 17 Lakh Annual Remuneration + 1.5 Lakh one-time Premium Component + 25,000 one-time Settling In Allowance**\n\nI wanted to check with seniors who are already placed in IBM (through campus) or currently working there:\n\n* How much of this 17 LPA is the **actual in-hand monthly salary**?\n* Does IBM have a big variable component, or is most of it fixed?\n* How are the one-time components (1.5L premium + 25k settling-in) paid—immediately after joining or later?\n* Any deductions (PF, gratuity, taxes) I should be aware of that bring down the take-home?\n\nBasically, I just want to understand the **realistic take-home per month** after all deductions.\n\nWould really appreciate any insights from seniors who are placed in IBM previous year, or anyone who knows these details 🙏",
  "metadata": {
    "id": "1n41j5b",
    "author": "Immediate_Gold_2218",
    "url": "https://www.reddit.com/r/PESU/comments/1n41j5b/placements_ibm_17_lpa_annual_remuneration_offer/",
    "permalink": "/r/PESU/comments/1n41j5b/placements_ibm_17_lpa_annual_remuneration_offer/",
    "score": 21,
    "upvote_ratio": 0.96,
    "created_utc": 1756560178.0,
    "flair": "Placements 🤑",
    "nsfw": false
  },
  "comments": [
    "17 lakh is the actual base no variable component .Out of this 1.2 lakh goes towards pf and gratuity , so 15.8 is take home before taxes .After taxes and pf you get 1.24 Lakhs per month.on top of that the joining bonus is 1.75 lakhs paid after 1 month of full time .\n\nfor internship you get 35 k relocation allowance if not from Bangalore .\n\nOn top of this if the department you are in does good you get some bonus\n└── Thank you so much for the details!",
    "Do you have any prior internship experience?\n└── Interned at CDSAML-PESU, Last summer."
  ]
}