{
  "title": "[Placements] Understanding the 47% Placement Rate",
  "content": "The placement rate is reported to be 47%. I am concerned about this statistic and would like to understand it better. Does this mean that approximately half of the students do not secure a job placement? I am willing to put a lot of effort into my studies and ofcourse skills and want to ensure I have a good chance of being placed after graduation. Could you please provide a clear explanation of what this placement percentage entails, using full words instead of abbreviations?\n",
  "metadata": {
    "id": "1n46z5n",
    "author": "Consistent-Formal483",
    "url": "https://www.reddit.com/r/PESU/comments/1n46z5n/placements_understanding_the_47_placement_rate/",
    "permalink": "/r/PESU/comments/1n46z5n/placements_understanding_the_47_placement_rate/",
    "score": 14,
    "upvote_ratio": 0.9,
    "created_utc": 1756573857.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "https://preview.redd.it/g344ak1cw6mf1.png?width=511&amp;format=png&amp;auto=webp&amp;s=8e0fe70c899ec1e676f3cc773e3430ed7fa1e1d1\n\nSource \\^\n└── I think this does not include internships converted to ppos?. Plus this includes branches like mech and biotech, but ya the batch size for 2029 is gonna be a problem if you dont work hard.\n    └── Yep it doesn't",
    "The number increased to 1041 but still a bit scary tho\n└── Yeah close to 400 unplaced out of 1843",
    "https://www.reddit.com/r/PESU/s/6HgVCFfDgx\n└── Too complicated bro, I wanted to have a comprehensive and simple discussion here to be a easier representative to the Juniors\n    ├── The placement % numbers will never be accurate simply because there's no way to accurately determine it. PES only has the data they have access to. PPOs offered to students at the end of their summer/spring internship are usually between the company and the student, so PES doesn't have any information here. Additionally, many students apply off campus and get into different companies (sometimes abroad as well), and these aren't on PES' record either. \n\nThe *only* record PES has is the number of students directly placed through their placement cycle, which is absolutely not representative by any means.\n    └── Basically the figures you posted / given by pes don't include ppos\n        └── Right so does this significantly improve the statistic tho?\n            ├── Like atleast 65% placed for cse\n            │   └── Isn't that a point of concern aswell? Cus there is no shot that 35% of the individuals went towards masters. How does this statistic stand in comparison to other UNIs like BMSCE, MSRIT, RVCE or DSCE.\n            │       └── Some of them didn't get placed and hence they were put in that category some genuinely went for masters and some got placed off campus this 35% includes all\n            │           └── The latter half?, are those universities also at the same statistic (Thank you for the clear, summarized explanation; it's extremely helpful.)\n            │               └── Imo you should really check the company wise sheet and count the total offers of T1 T2 T3 SUMMER INTERNSHIPS AND SPRING INTERNSHIPS you will get a good idea\n            │                   └── Do nothing just count total no of offers\n            └── Yes incl the ppos stats are better"
  ]
}