{
  "title": "Campus placements",
  "content": "Hey,\n\nIm in 6th sem ,to Any of the seniors out there, how serious is the 8.5 gpa cutoff for placements and how frequent will the companies come during the peak season?",
  "metadata": {
    "id": "onwyff",
    "author": "[deleted]",
    "url": "https://www.reddit.com/r/PESU/comments/onwyff/campus_placements/",
    "permalink": "/r/PESU/comments/onwyff/campus_placements/",
    "score": 26,
    "upvote_ratio": 1.0,
    "created_utc": 1626764543.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "This was a \"Placement Orientation\" uploaded by the college, check it out!  \n\n\nFile: [Placement Orientation](https://drive.google.com/file/d/17zEt7xdUs2cVWytO770XDjkSuvO7xO9O/view?usp=sharing)\n└── Thank you! I have checked that out.\nMy gpa is on the edge of 8.5 and i have heard in many placement talks for maintaining the gpa above it.\nI wanted to know how much will i loose if my gpa drops given the esa options n all.A rough idea at most, ik no one can say exactly,  but how was it last time? What percentage of companies say 8.5 n above for eligibility? \n\nN also wanted to get an idea for how many companies come in a week , like say 4 in a week,\nLike how much busy can it actually get?",
    "Hey, graduated this year from CSE. Bit late but just thought I'd drop a comment\n\nWrt to GPA: If all you care about is placements, 8+ should really be fine for most companies, even big names. 8.5 will make you eligible for everything without worry. That being said, the higher the better - companies do like it if you're doing well academically. Just don't bother breaking your head trying to get a 9.5 and stuff like that. If you're planning to do a masters though, try and shoot for a 9+. Makes life a lot easier\n\nWrt to companies:If you're in CS or in ECE and you're ok with a dev job, plenty will show up for placements. Hell, tier 2/3 companies are still showing up for us, with the occasional T1 startup. Can't comment on the other branches.\n\nNot sure about the options you have and the current situation, but feel free to ping me via a reddit DM for any queries. Happy to help\n└── Thank you for the clarity. I really appreciate it."
  ]
}