{
  "title": "Feeling hopeless right now",
  "content": "Vent incoming...\n\nI'm a part of the CET batch and our entire first semester was fast forwarded. We had classes for long hours and were bombarded with assignments and the portions weren't complete until the very end.\n\nI'm just one semester in and I messed up both my ISAs and won't be doing well in my ESAs either. Everyone talks about how important CGPA is to get anywhere and here I am, just one semester in, with terrible grades. I don't have the motivation to study further or do anything. All I want to do is sit and cry.",
  "metadata": {
    "id": "tj8kbu",
    "author": "National-Car-",
    "url": "https://www.reddit.com/r/PESU/comments/tj8kbu/feeling_hopeless_right_now/",
    "permalink": "/r/PESU/comments/tj8kbu/feeling_hopeless_right_now/",
    "score": 50,
    "upvote_ratio": 1.0,
    "created_utc": 1647858071.0,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false
  },
  "comments": [
    "it's just one sem and u can cover your grades easily in the upcoming sems.Just don't think about what has happened and study well in the next sem.I'm sure that u can cover your gpa coz many people experience this coz this is your 1st year and your sem is abnormal.\n\nJust perform well in the next sem.\n\nAll The Best.\n└── this",
    "I went through the same shit when I joined, It's a lot of stress and confusion, I almost made the decision to leave this place but somehow I made it till year 3. I realized looking at others and seeing them do miles better than me is the worst thing that I was doing to myself. It stopped me from living like myself and gave raise to a whole lot of other problems which I still suffer from.\n\nTake a breather, meditate if you want, don't let these thoughts overwhelm you. I know its easy to say all this and actually being in the situation. \n\nThis comment is all over the place but, this is just my experience and how I managed. Please don't be discouraged by someone else, you can always bounce back \n\nI wish you the best",
    "Lol",
    "Leave BTech and take BBA in same college bro.  jk you're gonna be fine you have 5 semesters left to improve your CGPA, its gonna get better, hold on."
  ]
}