{
  "title": "Sleeping place",
  "content": "What's the best place to sleep peacefully on campus after bunking class. A place without any noise, if we can lie down that's a bonus + AC.",
  "metadata": {
    "id": "u6yj7n",
    "author": "FickleAd4141",
    "url": "https://www.reddit.com/r/PESU/comments/u6yj7n/sleeping_place/",
    "permalink": "/r/PESU/comments/u6yj7n/sleeping_place/",
    "score": 20,
    "upvote_ratio": 0.96,
    "created_utc": 1650349842.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "13th floor rooms, the security often comes and annoys you if you lay down on the cushion and sleep, but just sleeping with your head on the table is fine, and done by everyone.   \n\n\nBesides that, a few odd floors have a cushion bench right outside the elevator, like 11, 9, random floors. \n\nEven football field is a decent place when it's deserted. \n\nThe 13th floor wide bench area outside has been my favorite spot to take a nap on Sundays. \n\nYou can try getting into the upper floors of the mrd auditorium, nobody will bother you there, and there are cushions. \n\nLibrary's also a great place but you can't really lay down.\n\nStaircases are often deserted, but once I ran into bouncers there, so I can't say it's safe all the time, just most of the time.\n\nThe staircases that lead to basements are deserted all the time, they're nice.\n\nIf you're fine with outdoors, there's always pircubed and OAT, which have nice wide areas to lay on. And there is a pathway next to South Thindies, which leads to a grassy area behind F (panini) block. Nice deserted place with grass, just you may sometimes find insects.\n\nAnd if you enter that door right next to G block (Amaatra block), you'll first be greeted with the stench of the PES swimming pool, but if you walk beyond that, there is a path that goes behind hostels. Just find a nice spot out of the sight of hostel security, and you'll be left alone.\n├── Such details\nExperienced person!\n└── real",
    "Duuuuuude, today I needed to bunk C lab and sleep, I got to use my own advice and it was pretty  awesome.\nI first slept at pircubed, but after a while decent bouncers woke me up and said I could sleep at hostel instead. I didn't really want to, so I went behind boys hostel bakery, and walked a little, found a cool place with a tree (hence shade),  no insects, and a decent platform. I nicely slept there for 2 hours, rate it 4 out of 5 stars, cause maybe it would have been more comfortable with a cushion, but at least it was flat and smooth, and absolutely no humans in sight.",
    "Any place to chill wid chick\n├── focus on your studies\n│   └── Itna late kese laga dekhne me\n│       └── kyuki hm bekar logo p dhyan ni dete h\n└── Outside college xD"
  ]
}