{
  "title": "Urgent Help Needed!",
  "content": "Hello Guys! I am currently studying in 4th sem I Section \\[CSE(RR Campus)\\]\n\n\\[Also I just kept my name as Sakshi, just to be anonymous\\]\n\nMy PES Mail has been hacked. I am not sure if the person just logged into my account and then changed the password or hacked it. And if so? Why did he/she do it. I am helpless now.\n\nHe/she told me that if I don't share my private stuff, he/she will post my pictures that he/she took screenshots from my Instagram account on dating apps.\n\nAnd also said that PES Mail ID is very important because I will receive notifications about Placements through my College mail and that I won't get placed at all.If I fail to send my private stuff,My pictures would be posted on dating apps and then that I would receive lots of calls from guys around India or Parts of the world. Its been a month since he/she said that and since I haven't shared anything I have been getting calls from many people and texts. I stay in the hostel. He/she has my dad's number .IDK How they got it.\n\nHe/she knows what I wear, and which bench I sit in. Which class I am attending and which classes I am bunking. I am doubting if any of my classmates\n\nI have been getting messages from random accounts. He/she is misusing my photos and uploading it to dating apps mentioning my phone number and instagram account handles\n\nI am clearly helpless. I don't want to tell my parents or go to the police since I don't want to make my parents feel that I am unsafe here. And if they get to know what I am going through maybe they will find a way to stop me from studying which is why I came out of my hometown.\n\nIf any seniors or anyone can please help me out that would be of a great help",
  "metadata": {
    "id": "uhh3a6",
    "author": "[deleted]",
    "url": "https://www.reddit.com/r/PESU/comments/uhh3a6/urgent_help_needed/",
    "permalink": "/r/PESU/comments/uhh3a6/urgent_help_needed/",
    "score": 32,
    "upvote_ratio": 0.96,
    "created_utc": 1651587356.0,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    "Hiii\nSince it's your offical college Pesu Id, it sounds pretty serious.\nI'd suggest you talk about it with Prof V Krishna who's the dean of student affairs.\nHe usually handles such issues on a daily basis.  \nHe'll talk to the relevant departments and sort it out.\n└── +1 Also, because this is the official ID we're talking about, it would be very easy for the Workspace admins to find out exactly which system logged into it at what time. This can be used to pinpoint the student who did this by cross-referencing the login time and lab computer IP with the CCTV footage in the labs.\n\nIf it was a personal device, they can also look up the MAC/HWID on PESU Academy logins or campus Wi-Fi connections.\n\nThis is pretty serious and I definitely suggest looping in ISFCR to find this guy.",
    "This is a very serious issue. I'd say you're very late in letting someone know, but better late than never. I'm sure the mods will help, I can atleast make sure of that.\nNow a couple things I want to clarify.\n\n1. For us they gave us a form so that we can give any email ID to get subscribed to the placement cell emails. I don't think it HAS to be your PESU ID. Now I'm not sure who your admin is for emails, but talk to the HOD about your PESU ID being compromised. They'll gladly help you.\n\n2. Was there any email someone sent that included pesu email IDs and passwords of everyone in your class? If yes, then someone from your class is doing this or provided the perpetrators with the information. Stuff like your phone number and insta is easily available to people of your class (WhatsApp class groups and mutual friends)\n\n3. What kind of calls and messages have you been receiving? If they're personal or threatening, screenshot/record them. Keep them. It'll be important. Do it as soon as you see this.\n\n4. I'm being completely honest here. As much as we are seniors, this requires scrutiny from authorities. I do not see how I or for that matter, any senior would be able to navigate this issue otherwise. I'd recommend you create a timeline of what's happened so far, then you can file a complaint [here](cybercrime.gov.in). If you still aren't convinced, [National Commission for Women](ncw.nic.in) is a non profit org that will help you navigate this issue. Looking at the tone of your post, I'd say start with ncw.\n\nPS. I have not asked her to contact parents (btw, **you should**) because I am very well aware of the type of situation she's in. For those unaware, families that have that mentality are MORE than ready to disrupt her future if they even as much as feel funny about anything.",
    "Dude just fuck dean , HOD , chairman all , just file an  complaint in nearby police station and let Cyber crime do their job , if that person messing up with ur private pics and messages then only POLICE can teach him a lesson , dean or hod will just change the username and password and u are get to go ,  , see u can approach some women organizations they will help u without ur parents knowing about it , police have handled such cases I know very well u can go ahead with law and orders,"
  ]
}