{
  "title": "Is PESU really that bad?",
  "content": "So…I’ve spent some time on the subReddit, and I’ve heard nothing but negative comments abt PESU…I have counselling in like 36 hours, and I just wanna know how good is PESU actually? Ignoring placements, is PESU really a bad uni, or is it decent? \n\nI personally LOVED the classrooms when I came in to write PESSAT, and I would’ve loved to join with that impression in mind, but I wanna hear from the seniors if the campus really isn’t that good after all\n\nPS: there’s a running joke in my school (NPS RNR) that PESU is basically a NPS reunion…so some NPS alumni shedding some light on this would be terrific",
  "metadata": {
    "id": "w4pts8",
    "author": "BLITZ_275",
    "url": "https://www.reddit.com/r/PESU/comments/w4pts8/is_pesu_really_that_bad/",
    "permalink": "/r/PESU/comments/w4pts8/is_pesu_really_that_bad/",
    "score": 24,
    "upvote_ratio": 0.96,
    "created_utc": 1658432734.0,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    "Like tbh atleast for the CS department the facilities are good and surprisingly enough the curriculum is rather up to date, atleast for my batch that was the situation. I actually used things that I studied in my day to day work. \n\nIt really depends on what you want from your college experience - if you're the kind of person who wants to have a great social experience with events (especially sports), this isn't the place for you. Academics is the priority here. That being said, I loved the club I was in and it's given me one of my strongest group of friends ever. \n\nI'm not a fan of the management, but I had some profs who were very influential and rather helpful (I do not know how many of them continue to teach), but I need to give college credit for the opportunities I was given because, quite frankly, things for me are very smooth thanks to that. Unfortunately these opportunities are skewed to favour CS, which really shafts the other departments.\n\nAlso\n&gt;PESU is basically a NPS reunion\n\nKek yes\n└── This is exactly the reassurance I needed while sitting in pessat counselling lmao\n    └── Talk to current final years/third years for a better idea of the current situation. I graduated in 2021 so my info is a bit out of date, but if you have specific questions, feel free to DM.\n        └── Of course, of course, thanks for the help:)",
    "The best way to summarise it is\n\nPES is academic first everything else second\n\nNow that philosophy can be a good/bad thing\n\nBest example is\nThe entire covid time, when all other colleges were slacky in exams and shit, PES had their exams and we (my batch) graduated on time... This didn't affect any of by batch's placements/career\n\nHowever other colleges recently just finished their college, and now they can officially get full time offers etc..\n\nI would say the hustle PES made us do paid off..",
    "&amp;#x200B;\n\nThe college does have its share of flaws flaws like the ongoing construction, the high intake and such. It also has its pros like great student quality, better oppurtunities, updated syllabus and such. Consider both things well before joining.\n└── Sure…could you comment on the faculty if possible? Does that fall into its pros, or cons?\n    └── It has both great teachers and few bad teachers. Id say its pro. Unlike VTU techers, nearly most are very knowledgable in their fields.\n        └── That’s great:D…thanks a lot:))",
    "Basically, the vice chancellor sucks\nFaculty are leaving like Jews left Nazi Germany because of him\nI’ve personally heard this from multiple profs and some of the rules being implemented are genuinely unreasonable\n\nThere used to be a bunch of professors who left insanely high paying top jobs in the industry who joined PES out of a love for teaching. The fact that PES made them go back to the industry and ruined their love of teaching really says enough doesn’t it",
    "Basically, the only thing you get to see on the outside is the placements (which are great if you are in CSE at least) which does wonders for advertising this place. There is partial truth to the fact that it does boast about having really great placements with a lot of major companies coming in to recruit students. Apart from that, the other good thing is the syllabus which keeps getting updated frequently so it does keep up with the times and is always up-to-date. But beyond these, it does not have much to offer.\n\nHowever, don't get me wrong but this entire institution is flawed. Bad (and super inefficient) management and faculty who aren't well equipped and qualified fill up this place. Just last year, a whole set of really great faculty members left and the only ones left are the poor ones. Academic pressure is really high, and the newly introduced examination system now forces you to give 25 tests, 15-20 assignments, 4-5 projects, 10-15 lab submissions, and 5 exams PER SEMESTER. As for time, beyond the enormous time given to these deliverables you aren't left with much time to focus on what you want to do or honestly to take a few moments to breathe.\n\nThe research clubs are now almost non-functional, since all the main faculty members heading them have left. As for clubs, some weird thing happened last year which resulted in all student formed clubs to be inherently replaced with teacher headed ones, thus they have control over what activities you do as well. There are like 2 fests that happen every year, although primarily it is only one and the other one is for high school students. Beyond life in the classrooms, there isn't much of a campus since 90% of it is under construction without any kind of open spaces. \n\nThese are only some of the issues that plague this place. I'm sure if you read this subreddit you will find more. What I can say is, if you are getting your preferred branch in PES and nowhere else, only then join here. If you get your preferred branch in other equivalent ranking colleges, its better to look at them. On the other hand if you are here because you saw a PES ad in the newspaper (or all around the city), then you should definitely look elsewhere.",
    "There r only a few plus points(that too depending on  ur branch,teachers etc)... But overall for the amount of money u r spending for 4 years(pessat Or management) is absolutely not worth it and the plus points are far outweighed by the negatives.",
    "Decent but no social life"
  ]
}