{
  "title": "Placement stats for 2023 batch (ONGOING)",
  "content": "Hi guys, me and a couple of my friends are maintaining this sheet of ongoing placements of the 2023 batch.\n\n[https://docs.google.com/spreadsheets/d/1a-eaEBcTeOJESck3f8W\\_I3uJqRRiEc\\_7d5O1Xc3nIUg/edit?usp=sharing](https://docs.google.com/spreadsheets/d/1a-eaEBcTeOJESck3f8W_I3uJqRRiEc_7d5O1Xc3nIUg/edit?usp=sharing)\n\n\n\n&amp;#x200B;\n\nLet me know if you have any suggestions or any queries regarding the same :)",
  "metadata": {
    "id": "xyl4cs",
    "author": "pillarsOfSaltAndSand",
    "url": "https://www.reddit.com/r/PESU/comments/xyl4cs/placement_stats_for_2023_batch_ongoing/",
    "permalink": "/r/PESU/comments/xyl4cs/placement_stats_for_2023_batch_ongoing/",
    "score": 69,
    "upvote_ratio": 0.98,
    "created_utc": 1665209305.0,
    "flair": "ANNOUNCEMENT :snoo:",
    "nsfw": false
  },
  "comments": [
    "Nice initiative,boss. But sheet not opening for tiers other than tier 1. Thanks again\n└── ah not sure why that's the case for you, I opened it in incognito and it opens everything for me, try from your laptop once?",
    "Bro can u add from which branch these students got placed it would be great if u do this\n└── ah yes, gotta do this, but yea, its mostly CSE+ECE or CSE+ECE+EEE for T1 IT jobs. Mech, civil and BT are rarely included.\n    └── Haa that's grt to hear that, the reason  i asked bcz i wanted to hear how many non cs students get t1 jobs especially circuit branch students",
    "Bro could you add cgpa creteria and other  creteria for participating companies",
    "folks might also wanna read this for some placement tips from my side: https://discord.com/channels/742797665301168220/1025016706868985947\n└── It is not working\n    └── you gotta join the PESU discord server with a valid SRN for that\n\nthis is the link to the discord server: [https://discord.gg/eZ3uFs2](https://discord.gg/eZ3uFs2)",
    "Yes if possible,mention branch wise. Thanks",
    "Is this fully updated??Has it been a bad year for pes? :(\n└── https://drive.google.com/file/d/1tvdfHXMPP\\_JjSB5h55VneBZoSAvMKCdv/view?usp=share\\_link\n    └── Are the 877 ppl out of 1200ppl (720 rr + 480 ec) for cse? u/Thick-Fix-9957\n        └── Yes.This data is for both RR campus AND EC Campus and the 877 ppl are **CSE** peeps from both campus who have above 6.75 cgpa.\n            └── Does it include ppl who are going for masters too?Or are they excluded ?\n                └── Yes, they are included as long as they satisfy the  above 6.75 cgpa criteria. Some of my friends are going for their Masters and they are represented here.The Placement stats doesn't care if you're going for masters or not.\n                    └── How many Tier 1 companies approx can i be eligible for if i have a shade below 8 gpa? u/Thick-Fix-9957 Sry for the ping\n                        └── You're going to be eligible for almost all the tier 1 companies. Most of the time companies put cutoff as 7.5. but there may be few companies which may put 8 as the cutoff.\n                            ├── do you have any similar stats for MCA? or PG courses\n                            │   └── I don't have stats for PG courses.Sorry.\n                            └── Hey man I have 74.8% in in my 10th boards.Will i be shortlisted for tier 1 companies.\nBackground context:I got cse at PESU ec campus in 2nd round of kcet but rn I'm having second thoughts about it and thinking of taking up ise at msrit.\n                                └── There may be couple of companies u won't be able to sit but almost all the t1 companies put cgpa criteria only and don't look for 10/12th percentage(Most of the t1 companies I checked (6-7) either only put cgpa as criteria or internally shortlist after receiving all of the students profile after registration ) . I don't have any clue about ise at msrit but cse in pes university placements is very good.",
    "Bro howz MTech CSE placement in pesu?, do mtech students have to compete with btech students for placements?",
    "Bhai\n2024 ka bhi kuch kar do pls?",
    "I am in cs-aiml right now, planning to go with EEE through Cet and opt for a Cs minor...what would you recommend?\n└── imo, you should go ahead with AI-ML if money is not much of a concern, cuz its beneficial from a placement point of view and even for masters, but again, if you're really interested in EEE, then go ahead with it :)\n    └── Will I need a mtech degree if I'm majoring in cse(aiml) at PESU for getting placed in good companies with great pay??",
    "The sheet is not getting opened. \nIt says it has been deleted",
    "how many of these hired from cs only?\n└── 85% of this is from CS. Not a lot of non CS folks got T1 jobs\n    ├── would you suggest taking ece in pes? could i bank on changing my branch if i manage to secure &gt;9.5 and how feasible does that seem?\n\nsorry if these questions are annoying lol\n    │   └── Firstly, these questions are very valid and aren’t annoying. Regarding changing your branch. The chances of that are extremely minimal and you should absolutely NOT bank on it. If you’re taking ECE then be prepared to deal with it for 4 years. Just one or two people had changed their branch from ECE to CSE. Anything might happen with your CGPA. If the paper that year happens to be extremely tough and what if you end up scoring 8 and end up with ECE for 4 years. So if you’re taking ECE, then don’t make the mistake of thinking that you’ll change your branch after 1st year. It rarely happens. The probability is 0.001%\n    │       └── ty for answering; I am fine with doing ece or cse; dont really have interest in either(nothing else interests me, you could say this is what i find \"least uninteresting\")\n\nSecondly going back to my question 2 days ago, are placements in ece that bad; do the people from ece who get placed in the said t1 jobs learn coding by themselves or is their course's subject matter enough to make them employable in those jobs(sorry i dont know much about any of these college courses XD)\n    │           ├── Even CSE folks learn coding by themselves. Cuz what gets asked in coding rounds is different from what they teach (true in every college). ECE folks take up minors in CSE to cover DBMS, OS, CN and OOPS. These things get asked in interviews. And yes placements in ECE are horrible compared to CSE. A lot of companies don’t shortlist ECE folks for interviews for some reason. I think they’re not able to solve coding questions, whereas But if you can maintain your coding despite studying ECE, then you’re at no loss. A lot of ECE folks struggle to find time to code cuz of the syllabus load. Whereas CSE is about coding so you have to make little effort to learn DSA\n    │           └── But keeping future prospects like MS also in mind, I’d recommend going with CSE if you wanna take the least uninteresting subject. Cuz from what I’ve heard ECE is pretty bland\n    │               └── i see..  thanks, you were very helpful :)\n    └── Makes sense",
    "Could you please say how's CTC different from base ? I'm thinking that if company gives some stock options all that are added to CTC regardless of vesting time .. is it correct ? Else CTC is for just an year ( considering only stock vesting for year )",
    "Does CGPA Cutoff given as \"-\" mean the info is not available or is there no cutoff at all for them?",
    "Hi, Thank you for making this insightful sheet. I was going through the post, The sheet shared , mentions the CGPA cut off was about 7-8 for most T1 companies, but did they strictly follow it throughout the hiring process or do they filter out people based on CGPA in later stages of the process, if so what is the range for the filtered CGPA. \n\nThank you once again",
    "Yeh Trilogy Innovation (code nation) har saal aati hai ?? Aur Microsoft Google aati hai ? Aur yeh saari placements on campus hai na ?",
    "I calculated the total FTE +(FTE +INTERN) offers of Tier 1 there are more than 500 offers 💀💀Are all of these on campus ?(ig on campus because companies like Google Microsoft aren't added in the spreadsheet) .\nSo 500+ tier 1 offers (CTC 15+ (IN MOST CASES ) ) \nthe total batch strength ig is 1200 and the total eligible students might be 1000 \nGreat \n\nAnd there are a lot of companies offering good CTC but they didn't recruit any reasons for that ?"
  ]
}