{
  "title": "do we really get holidays here",
  "content": "in the orientation many things were told, \n\n1. some things had missing details or a catch like they said gyms, badmintons courts and all that are available, but not until recently i found out about the 10k per year fees for them.\n2. other things were straight up lies, like the metro station being just 500 meters from campus. like really? why would you lie so openly\n\nanyways coming to my question, the great vice chancellor also told outta the 365 days in a year we will have only 160 days of college, does this statement have a catch or is it lies again? and are there anything else to take into consideration about this place? thank you",
  "metadata": {
    "id": "y5mggi",
    "author": "[deleted]",
    "url": "https://www.reddit.com/r/PESU/comments/y5mggi/do_we_really_get_holidays_here/",
    "permalink": "/r/PESU/comments/y5mggi/do_we_really_get_holidays_here/",
    "score": 18,
    "upvote_ratio": 1.0,
    "created_utc": 1665941120.0,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false
  },
  "comments": [
    "PES doesn't really give holidays during the year. Instead you get close to 2.5 months off for summer (last week of May to first week of August) . You usually get about 10 days for Christmas. The remaining are scattered here and there. The 2024 and 2025 batches haven't experienced this because of the late session starting dates which took up their summer.\n\nThe number you said doesn't add up numerically though, but be prepared for less holidays during the year and one large break every 2 semesters. \n\nOh also about all the lies? Welcome to PESU :')\n├── We have an exam during Christmas lol . Isa 5 i think  1st yr\n│   └── Yeah as I said, the session needs to start in August for you guys to get the proper scheduled breaks. Hopefully from the next batch it gets sorted out.\n└── &gt;2.5 months off for summer (last week of May to first week of August) . You usually get about 10 days for Christmas. The remaining are scattered here and there\n\n53 weekends(106 days)+summer(90 days)+christmas(10 days), around 200 day,. of course mr v.chancellor had to include the weekends too\n\nthanks a lot for the detailed answer mate",
    "Days where you can sit back and relax? In PES? Ahahaha nope. Sadly no. I'll go cri in some corner now ༎ຶ⁠‿⁠༎ຶ\n\nAlso, metro station IS 500 metres from campus. From EC campus that is. Idk if it's exactly 500 meters, but it seems walkable. Ps: it'll take another 5 years for that station to finish getting constructed\n└── &gt;Days where you can sit back and relax? In PES? Ahahaha nope\n\nlike credit card debt, the last few years of goofing off have piled up and now i no longer have the liberty to do it anymore\n\n&gt;metro station IS 500 metres from campus\n\nthat is good news... for the next batch. \n\nthanks for the answer mate\n    └── Np :)",
    "Umm for 2021 batch, a lie, others there might be a slim chance.\n└── :(",
    "Welcome to pes... Where there is a catch to everything.\n└── &gt;Welcome to pes... Where there is a catch to everything.\n\nslowly getting used to it..."
  ]
}