{
  "title": "Who's the worst professor you have had here in PES ?",
  "content": "I am currently in first year Physics cycle. My mechanical professor sucks, he literally makes me want to question my decesion of coming here. All other professors are ok, I rlly liked my Physics and Electrical professors because they teach well. But the mechanical guy is terrible. He doesn't even teach and expects us to learn everything by ourselves. He just comes and yells like a mad guy. But if you approach him personally, he will actually explain well,I don't know why he doesn't do that in class. Btw he's actually a civil engineering professor who shifted to teaching first year mechanical as well as mechanics cause his department is practically gone now. \n\nWhat's been ur worst experience with any professor?",
  "metadata": {
    "id": "ycva7q",
    "author": "[deleted]",
    "url": "https://www.reddit.com/r/PESU/comments/ycva7q/whos_the_worst_professor_you_have_had_here_in_pes/",
    "permalink": "/r/PESU/comments/ycva7q/whos_the_worst_professor_you_have_had_here_in_pes/",
    "score": 16,
    "upvote_ratio": 0.9,
    "created_utc": 1666670301.0,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false
  },
  "comments": [
    "KJ moment\n└── 😂😂🙌\n    └── He's ok compared to C O Prakash our computer teacher.\nOr they belong to same level.\n        ├── Atleast our computer teacher teaches something although he doesn't do it well. KJ doesn't even teach.\n        └── COP is really good for Compiler Design, don't shit on him\n            └── He's not taught us that topic but he teaches us Python and trust me it feels boring not for me but for all the students he teaches in A and P section.",
    "Unfortunately a large majority of the professors you'll meet here are such specimens. Most of them aren't great and honestly not qualified enough to teach the subject. And for ones that are qualified, they struggle to teach because they quite simply cannot teach well. The best professors are the ones who not only know the subject well but also can teach it well, and unfortunately PES has extremely few teachers who possess both skills. In fact a good portion of them left in the last few years so in a way it's gotten even worse. \n\nAnd to answer your question, worst professor I ever had was in 3rd year when a certain professor taught us the *wrong* stuff in class and we all had to go watch another professor's lecture videos to re-learn the concept. Also said in class that \"your assignments are not worth my time\". Thank god he's left.",
    "Dw man, not just u, even us, chem cycle- mechanics people have the same issue😎😂",
    "Srinivas, that old fart who used to be HOD and that Tamil lady who's body quivered while teaching pointers in C"
  ]
}