{
  "title": "ADMISSION TO PES THROUGH KCET",
  "content": "Now that KCET counselling sessions are going on, many people have been asking details about admission in PES. I too got a seat in PES through KCET, so I thought I'll share my experience.\n\n**CHOICE OF OPTIONS**:\nFirst of all, congratulations on securing a seat in PES! When the choice of options are put forward, you have 4 options to choose from:\n\n- Option 1: Yes, I'm happy with this seat, I'll lock it and get admission. Farewell, CET! Thou hast been a loyal companion.\n\n- Option 2: I'm happy with this seat, but I wanna push my luck further in the next round. So I'll lock this seat and participate in the next round.\n\n- Option 3: Nah fam, didn't like this seat. Just ditch it, we'll try our luck in next round.\n\n- Option 4: I don't think I'll get a seat through KCET. Bye-bye KCET!\n\n\n**OPTION 1**\nI really don't know the procedure when you choose the other options, but here is when you choose the first option.\n\n- The link \"Download Challan\" gets activated in your option entry portal. Click it, and you have two banks to choose from: Union Bank and Indian Bank. Note that these are the destination banks, not the banks from where you have to pay. \n\n- Choose a bank, click OK, and you get the challan. Take a color printout (c'mon, it's an important document) in landscape orientation, for god's sake.\n\n- The challan has three partitions column wise: Bank copy, Student Copy, and College Copy. Take the challan, along with the cheque book of the bank through which you wanna pay your fees. Note that this need not be the bank you chose before.\n\n- Ask the cashier, \"I wanna pay Rs. X (whatever your fees is) through cheque, to be transferred to this account (college account) through NEFT, please tell me the total amount after adding cheque charges.\" Usually they add around 4 rs and tell you the final amount. \n\n- Draw the cheque for that amount, and in the To section, write \"YOURSELF\". I repeat \"YOURSELF\". Ask the bank once for safety.\n\n- Give them the cheque and challan, they will process it, seal and sign it, tear out the Bank copy, and give you the remaining stuff. In around 10 minutes you get a DEBITED message.\n\n- After an hour or so, the \"Download Admission Order\" link gets activated. Download it, and take atleast two copies of it. They might ask for two copies.\n\n- Take the admission order, and go to the college with ALL the documents required for admission, as listed in the PES website. After that PES will take care of the further process. \n\nDisclaimer: the process and its elements might change, so I want you to enquire once more with the concerned authorities before taking any steps.\n\nAll the very best for a beautiful life ahead in PES! If you have any doubts, just comment on this post!",
  "metadata": {
    "id": "z2shml",
    "author": "SilicoFlare",
    "url": "https://www.reddit.com/r/PESU/comments/z2shml/admission_to_pes_through_kcet/",
    "permalink": "/r/PESU/comments/z2shml/admission_to_pes_through_kcet/",
    "score": 30,
    "upvote_ratio": 0.98,
    "created_utc": 1669218459.0,
    "flair": "ANNOUNCEMENT :snoo:",
    "nsfw": false
  },
  "comments": [
    "Not all superheroes wear capes...Some just use fingers to type this long for other people !\n└── Thanks a lot! You made my day.. Just ping me if you have any doubts\n    └── Thanks to youu!",
    "u/ChromaticChaos pin\n├── Done\n└── I'm honored to have made such a contribution.. thanks a lot to give me the space to help others!",
    "Thanks a lot 👍",
    "Any extra fees they’ll ask ? Like student development fees ..etc or 92k that’s all\n└── I think 92k is the full fees.. better ask a senior\n    └── 👍\n        └── There is an additional exam fees of 25k to be paid before the 1st semester ESAs. Atleast this is what happened for the 2021 batch. \n\nFrom the 2nd year, both the tuition and the exam fees are collected together\n            └── Should we pay 25k every semester??",
    "Thanks a lot brother, this is really helpful ‼️"
  ]
}