{
  "id": "1029qg3",
  "title": "Information about Capstone Project with Industry Partner",
  "content": "My team and I plan on doing the capstone project with industry partner. We appreciate any input / information on what we can expect , in terms of workflow and guidance.\n\nTIA",
  "metadata": {
    "author": "Alarming_Lie6685",
    "url": "https://www.reddit.com/r/PESU/comments/1029qg3/information_about_capstone_project_with_industry/",
    "permalink": "/r/PESU/comments/1029qg3/information_about_capstone_project_with_industry/",
    "score": 8,
    "created_utc": 1672756551,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "j2sht4h",
      "body": "Hey...I assume you're starting off from sem 6. What's the industry ? Is it manufacturing - automobiles etc? Need more details. I didn't have any friends who did such a project but I can try helping.\nFirst- search for any other project which might have been done already with the partners and see any trends (delays, rejections by your guides+hod) . Mech peeps had NRM as hod and he was a pain in the ass. \nSecond- Money is a big part. In case your project entails you spending money, do not expect college to refund that amount. \nThird- workflow. All capstones generally follow the path starting from literature survey. See if you have any valid papers to refer to. Maybe the partner can help. Do not expect much from your guide. \nFourth- take lead of the project and assign work to your team. Have open conversations if possible with your guide. Maintain a tracker.xlsx with Gantt charts mapping your timelines etc. With every step, know what has happened in each task.\nFifth - Your work is more important, ultimately your grade can differ big time if you demonstrate the ability to learn, lead and apply concepts. In case your teammates are lazy and are dragging their feet, move ahead anyways.\nAll the best. I hope the others can also give some pointers."
    },
    {
      "id": "j2smx9k",
      "body": "Thank you for the detailed response :)\n\nThe industry is healthcare. We have been going through problem statements that we got as part of University and Industry collaboration through mails from CIE.\n\nImage and Video processing are our main areas of interest and we are willing to include other domains too. We are trying to reach others who have done an industry project."
    }
  ]
}