{
  "id": "102atev",
  "title": "T1 companies CGPA Cutoff",
  "content": "What's the average CGPA cutoff for Tier-1 companies? (This year's or last year's)\n\nAlso are the RR campus students preferred over EC campus students during placements since the students are clubbed together branch wise during placements?",
  "metadata": {
    "author": "Content-Walk9994",
    "url": "https://www.reddit.com/r/PESU/comments/102atev/t1_companies_cgpa_cutoff/",
    "permalink": "/r/PESU/comments/102atev/t1_companies_cgpa_cutoff/",
    "score": 4,
    "created_utc": 1672759434,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "j2s43oj",
      "body": "Both campus are valued the same and above 8 should be good."
    },
    {
      "id": "j2w10nl",
      "body": "In general above 8 CGPA is good enough. There's a few companies like JP Morgan, Goldman Sachs, etc. that have higher cutoffs (8.75-9 being the highest I've seen).\n\nStatistically, for T1 companies if say 10 students are accepted in total then 8 will be from RR and 2 will be from EC campus. There's multiple reasons for this, make of it what you will."
    },
    {
      "id": "j2wsl4l",
      "body": "May I know in which year you graduated?\n\nAlso do companies still differentiate between EC campus students and RR campus students? I talked to a few seniors who are in 4th year and they said companies don't even know about the campus of the student."
    },
    {
      "id": "j35obyc",
      "body": "Nope, companies do not differentiate because there is no way to. They only have details about your branch and SRN (and email and other personal details), but not your campus.\n\nThe reason you see more RR kids getting selected is because of the massively higher number of students here (600-ish in CS in RR vs around 300 if I am not wrong in EC). Add the other branches that are also eligible to sit in CS placements (ECE and EEE), you will see that there are way more RR kids attempting a test than EC. There isn't any kind of preference at play here, the only reason is the number of students from each campus.\n\nEdit: I graduated in 2022"
    },
    {
      "id": "j373943",
      "body": ">They only have details about your branch and SRN\n\nThey still can figure out the campus by SRN right?!? Cuz it's PES1 for RR and PES2 for EC.\n\nThanks for giving more insight on this."
    },
    {
      "id": "j37473k",
      "body": "True, but do you think they really know that lol. The interviews are on campus as well, and everyone has it on the same day. There isn't really any difference that's visible to them"
    },
    {
      "id": "j3g8biy",
      "body": "I graduated in 2022. And yes the companies don't have that kind of visibility until they've offered you a role."
    },
    {
      "id": "j3gefdd",
      "body": "Makes sense."
    }
  ]
}