{
  "id": "103s5pe",
  "title": "Class change",
  "content": "I had a branch change in round 2 of PESSAT  counselling . Will my class change for 2nd SEM, Also which of the classes in 1st year are AI/ML",
  "metadata": {
    "author": "Sea_Mail_2026",
    "url": "https://www.reddit.com/r/PESU/comments/103s5pe/class_change/",
    "permalink": "/r/PESU/comments/103s5pe/class_change/",
    "score": 5,
    "created_utc": 1672901343,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "j30skyt",
      "body": "Nope, classes only change once after first year ends, after that they remain the same until graduation. After first year you get put into sections in your branch.\n\n\nNone of the classes in first year are AIML because first year courses are the same for everyone (in the same cycle). Branch wise classes are all from 2nd year onward"
    },
    {
      "id": "j30srf8",
      "body": "ohk thanks boss"
    },
    {
      "id": "j30st5f",
      "body": ">only change once after first year ends, after that they remain the same until graduation. After first year you get put into sections in your branch.  \n>  \n>None of the classes in first year are AIML because first year courses\n\ni meant which sections in 1st year have majority AI-ML peeps"
    },
    {
      "id": "j30tjui",
      "body": "As far as I know they are randomly assigned (atleast was this way for us?)"
    },
    {
      "id": "j314uun",
      "body": "Wait so our sections won't change even after the end of 1st sem?"
    },
    {
      "id": "j316kzs",
      "body": "Ohk coz my class has majority ECE students."
    },
    {
      "id": "j36ms9a",
      "body": "Varies batch to batch, for the previous 2 batches it did, before that it didn't. For you guys I'm guessing slight shuffle in 2nd sem too because of the large gaps between PESSAT and different rounds of KCET"
    },
    {
      "id": "ke1qtep",
      "body": "So there would be no changes in classes after 1st sem for us?23-24 batch"
    },
    {
      "id": "ke2ozwg",
      "body": "Only if you changed branches"
    }
  ]
}