{
  "id": "106pfvc",
  "title": "Student Email ID",
  "content": "Do we get student email ID in our University so that we can avail some student discount on apps like UNIDAYS and some other websites too.",
  "metadata": {
    "author": "HotFix7183",
    "url": "https://www.reddit.com/r/PESU/comments/106pfvc/student_email_id/",
    "permalink": "/r/PESU/comments/106pfvc/student_email_id/",
    "score": 4,
    "created_utc": 1673200434,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "j3jer2t",
      "body": "Yes you'll get it in a month. And also, please tell me which websites you can get discounts on, I wanna know too."
    },
    {
      "id": "j3jqrkh",
      "body": "I don't actually know any other app but yeah I do check for student discount on any of the branded product I am buying"
    },
    {
      "id": "j3jrc0a",
      "body": "https://www.studentcrowd.com/article/websites-for-students-to-find-deals-discounts-and-competitions-on-just-about-anything"
    },
    {
      "id": "j3lyws7",
      "body": "I'm a first sem student (CSE) and we've already gotten ours. Login to pesuacademy.com and check, you might have gotten yours too."
    },
    {
      "id": "j3m6ovs",
      "body": "That email id won't work I've tried"
    },
    {
      "id": "j3mh77k",
      "body": "It worked for me. I was able to get Github Pro for free using it."
    },
    {
      "id": "j3mukkx",
      "body": "Did you use the pesuonline.onmicrosoft email id?"
    },
    {
      "id": "j3uegjk",
      "body": "Its for teams. [...@pesu.pes.edu](mailto:...@pesu.pes.edu) is the one you should use. Use Gmail with this account. Password is your SRN/PRN"
    },
    {
      "id": "j3uq33e",
      "body": "We have not got this email id how do we get this one??"
    },
    {
      "id": "j3vbodr",
      "body": "[...@pesuonline.onmicrosoft.com](mailto:...@pesuonline.onmicrosoft.com) \\-> Teams Mail[...@pesu.pes.edu](mailto:...@pesu.pes.edu) \\-> Got mine while we were given MatLab Access (1st Year)\n\nYou can use the latter one to avail some student discounts on apps and websites."
    },
    {
      "id": "j4ldxlb",
      "body": "Hey does anyone have an Aussie student ID for a unidays account they’d be willing to allow me to use as a one off for Apple Music? I’m more than happy to direct deposit whatever you feel is appropriate for the transaction. Truly appreciate your help with this issue if you so choose to assist me in crime hahahaha."
    }
  ]
}