{
  "id": "10oan9p",
  "title": "Maths esa sem1",
  "content": "Can someone please tell me what all I’ll need to do just so that I don’t have a backlog in maths. I can manage the other subjects but I highly doubt I’ll know anything in maths.",
  "metadata": {
    "author": "Youcrap-andsmile",
    "url": "https://www.reddit.com/r/PESU/comments/10oan9p/maths_esa_sem1/",
    "permalink": "/r/PESU/comments/10oan9p/maths_esa_sem1/",
    "score": 8,
    "created_utc": 1675007138,
    "flair": "Study Help :table:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "j6dig6q",
      "body": ">please tell me what all I’ll need to do just so that I don’t have a backlog in maths\n\nPray lmao\n\nOn a serious note, the 2 math courses in first year are arguably among the harder courses you will have during your BTech and most people tend to do bad to okayish in them. Getting a B or a C is actually extremely common. A good portion of the concepts come from the textbook, but they do not always pick the exact questions from there. So starting off, make sure you cover everything in the books. The only way is to practice everything and make sure you can solve everything. This is easier said than done, so prioritise your strengths if it seems too much for you. Then cover whatever is done in class - notes and assignments. Usually the book should by default cover 90% of these things as well, so this part should take lesser time. Make sure you actually practice these by hand too, because the papers are known to be extremely lengthy as well so solving speed and time management are as important as knowing how to solve.\n\nMy batch did not have MATLAB but from whatever I know, it is part of your syllabus now. I am not sure about this part so you will have to ask someone from one of the more recent batches (current 2nd years preferably)."
    },
    {
      "id": "j6dpz9t",
      "body": "TIL there's a textbook for Maths"
    },
    {
      "id": "j6dtbuq",
      "body": "Don't you guys have Ramanna and Grewal as the prescribed books? Those books were like the Bible to us lol"
    },
    {
      "id": "j6dtx5r",
      "body": "They are but I've never used them, pesuacademy questions were more than enough for ISAs so far"
    },
    {
      "id": "j6dykff",
      "body": "Hmm alright then. Back in my first year we only had textbooks and whatever notes you wrote in class. Those sections on pesu academy did not exist until much later, so textbook was a much needed thing to do before the ESAs."
    }
  ]
}