{
  "id": "10rcyfw",
  "title": "What is capstone project ? Which sem this is done ?",
  "content": "I am in 1st sem. There are several posts in the group about the capstone project and out of curiosity i am asking this question. I understand this is the final project. But, can you please tell me \n\n1. in which sem it is done ? \n2. Any earlier prep needed to do this project ? \n3. Will college professor assign this project ?\n4. Besides this project one also has to do internship after 6th sem ? \n5. If one is doing internship then, any projects done during this time can be considered as capstone project ?\n\nThanks",
  "metadata": {
    "author": "General_Comedian_983",
    "url": "https://www.reddit.com/r/PESU/comments/10rcyfw/what_is_capstone_project_which_sem_this_is_done/",
    "permalink": "/r/PESU/comments/10rcyfw/what_is_capstone_project_which_sem_this_is_done/",
    "score": 9,
    "created_utc": 1675301917,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "j6v525u",
      "body": "Capstone Project is essentially your final year college project that spans over 6th, 7th and 8th semester. Most projects are research based ones where you pursue some novelty in a field, but there are also a few non research based projects. Capstone totally adds up to 10 credits so it greatly affects your CGPA and cannot be taken lightly and requires genuine work from your end to actually do well in. \n\n1. 6-8th semesters\n2. Not really, but ideally by the time you reach 6th semester, *most* people develop interest in a field and people usually end up pursuing a project in this field (example, Computer Vision) and also find other batchmates interested in the same field. So while it isn't required as such, people do tend to find teammates with common interests and some background experience with a field to make things easier\n3. Usually you are free to pick your own and the professor will make suggestions, but in case you have no clue on what to do, the professor will always have a few backup project ideas of their own\n4. Internship is a completely independent component on its own. You can pursue an internship during the summer between 6th and 7th sem, or throughout 8th sem. There are various guidelines and policies which determine how many credits you'll get, not going into the details here since that's not relevant right now\n5. No, because in >98% cases, your work during your internship cannot be shared publicly beyond your organisation. Besides as mentioned earlier they are separate components and college will end up making you work on a complete project separately."
    },
    {
      "id": "j6vk6nj",
      "body": "Thank you for the very detailed information. It is very helpful"
    },
    {
      "id": "ne8t1i6",
      "body": "https://preview.redd.it/1nll3ln7c7pf1.jpeg?width=1204&format=pjpg&auto=webp&s=d0606c94545bf483d649f5ab97011876bc73f083\n\nThere have been a few changes (2027 batch onwards), just wanted to update."
    }
  ]
}