{
  "id": "10tedyx",
  "title": "Special Topic and Electives",
  "content": "What are special topic and electives? What are we supposed to do in them? and, when do we have them?",
  "metadata": {
    "author": "Prestigious_Unit_331",
    "url": "https://www.reddit.com/r/PESU/comments/10tedyx/special_topic_and_electives/",
    "permalink": "/r/PESU/comments/10tedyx/special_topic_and_electives/",
    "score": 2,
    "created_utc": 1675510500,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "j77ji8g",
      "body": "Special topics are 2 credit courses available that are essentially an *introduction* to various topics. You'll find stuff like C++, R, Julia etc in CSE. Idk about the other branches. Special topics need to be taken up through semesters 3-7. *If you don't have enough credits to graduate because you dropped a course, or didn't get an internship in 8th semester*, only then will you be required to take up more in 8th semester. Special topics are also available in the summers where you can take up extra courses to add more credits. These are usually extremely easy and straightforward, people almost always do well.\n\nElectives are mandatory 4 credit courses that need to be taken up in 3rd year (2 each semester). Electives in a branch might also be split into specialisations (like AIML/MIDS, Security etc in CSE). If you choose all electives from the same specialisation group you get the specialisation on your degree. Electives are much harder cause they're proper courses like the other courses you have now."
    },
    {
      "id": "j77oehs",
      "body": "Thank you so much🙏"
    },
    {
      "id": "ksbmy85",
      "body": "Hey, I already have an internship but my cgpa is low. Would taking up additional courses in 8th sem help the situation? (considering I do well) and what's the procedure and fee per credit if you know. I mailed the coe but there's no response."
    },
    {
      "id": "ksbqnw4",
      "body": "It might help you, but remember that you cannot graduate with extra credits, and you can only take up more special topics (2 credits each) not 4-credit normal courses. \n\nBack when I was in college, if you took up extra credits using STs, you could swap with existing STs you had taken earlier. While this sounds good, it doesn't help too much because (1) most people already do well in STs, with most getting an A. So the scope of improvement is very low and (2) if you do swap an A grade for an S (or any kind of improving grade), then the shift in your GPA is *at most* a 0.1 (because the difference in consecutive grades in an ST is 2, that divided by the number of credits in a semester is 2/24 = 0.08, or ~0.1). Spending money to take up STs and then balancing work and prep isn't worth it if you can only lift your GPA by 0.1 per ST. And let's say you can swap *every* ST you've taken in the past, you can probably lift your GPA by at most 0.6.\n\nI don't remember the fee per credit. But before you go ahead with it, you should think about whether it will actually substantially help you or not. Meet the HOD and discuss with them how the swap can take place along with which courses can be swapped in your list. Once you get an idea on that, look at the best case scenario CGPA you can end up with and the current CGPA you will end up with. If you think the difference is worth it, only then go for it."
    },
    {
      "id": "ksbthk7",
      "body": "Thank you! That was really helpful."
    }
  ]
}