{
  "id": "10yt9wp",
  "title": "What percentile should I get in JEE to get admission into PES rr campus",
  "content": "more specifically, CS or AI/ML branch",
  "metadata": {
    "author": "machinegun2187",
    "url": "https://www.reddit.com/r/PESU/comments/10yt9wp/what_percentile_should_i_get_in_jee_to_get/",
    "permalink": "/r/PESU/comments/10yt9wp/what_percentile_should_i_get_in_jee_to_get/",
    "score": 6,
    "created_utc": 1676039084,
    "flair": "Study Help :table:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "j7zj1vq",
      "body": "TIL that PESU takes admissions via JEE as well (although you might want to get this fact checked since this did not exist in my time)  \nAlso if you are preparing for JEE you are better off writing PESSAT to get a better rank with an easier test"
    },
    {
      "id": "j7zj5jj",
      "body": "honestly just try to get into an NIT or IIIT it is not worth coming here through JEE/PESSAT (same fee structure for both btw)"
    },
    {
      "id": "j7zl4dx",
      "body": "Bruh out of every person on planet i Thought u would know"
    },
    {
      "id": "j7zla3k",
      "body": "I mean it did not exist when I was writing entrances. Besides after you get into college you tend to care less about admission related news"
    },
    {
      "id": "j7zp09x",
      "body": "hmm but i prefer to go a college in bangalore itself"
    },
    {
      "id": "j7zrrfj",
      "body": "IIIT-B exists although idk if you'd agree with the fees they ask...but if you do go there I've heard you're practically set in CSE...insane placements and stuff"
    },
    {
      "id": "j80001n",
      "body": "True that"
    },
    {
      "id": "j80415j",
      "body": "RUN AWAY!"
    },
    {
      "id": "j81zzqz",
      "body": "Try your best in kcet/comedk. Pes is not worth the pessat fees. Rvce, bmsce and msrit are similar colleges."
    },
    {
      "id": "j82z4bj",
      "body": "I highly advice you to go go to any other college other than PES. Here, the stress is unlimited.In 1st year, they will make you do B.Sc syllabus, it's hectic af. You can try for NITK or IIITB or RVCE or BMSCE or MSRIT. And also you can check PES Eligibility criteria in their official website http://pes.edu/"
    },
    {
      "id": "j834inc",
      "body": "Dude don't write jee with the aim to get into pes😭."
    },
    {
      "id": "j841tem",
      "body": "Then get in through KCET. I joined PES this year and I have friends in BMS . I'd say join BMS if you're a student who can study even in a chill environment. There is way less competition. The campus is green too.\nHowever, if you are a person who tends to be more productive under pressure like me , I'd suggest choosing PES."
    },
    {
      "id": "j8ghwr2",
      "body": "thanks ill check it out"
    }
  ]
}