{
  "id": "1174y5y",
  "title": "I f’ed up",
  "content": "My first Sem is destroyed .\nHow much gpa will I need by the last Sem for a decent job",
  "metadata": {
    "author": "AloneRice6234",
    "url": "https://www.reddit.com/r/PESU/comments/1174y5y/i_fed_up/",
    "permalink": "/r/PESU/comments/1174y5y/i_fed_up/",
    "score": 5,
    "created_utc": 1676894629,
    "flair": "Study Help :table:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "j9a4exu",
      "body": "8ish will do. Even I f'ed up two papers in this first Esa, just hoping to pass, although at one time I was hoping to do rlly well. But don't lose hope. This isn't the end.We can stand to support one another in this roller coaster :))"
    },
    {
      "id": "j9bjug1",
      "body": "Maths ESA was a overkill ngl"
    },
    {
      "id": "j9ibs6s",
      "body": "Agree with everything you've mentioned, but if you're in CSE, getting an 8-ish will not let you sit for a *few* placement tests (some of them are 8.5, rarely a 9). This btw is for companies offering the median packages (since OP said decent job, I'm assuming atleast the average), not the highest or the lowest.\n\nEven if you can sit, shortlisting for companies happens on how you perform in the assessment test + your CGPA, which will again put you at a disadvantage. Normally an 8 would work in other branches, but due to the sheer number of CSE students alone, getting shortlisted even after clearing the test is a huge deal because there will be a lot of people just like you. I'm not saying getting an 8 will not get you placed, but getting an 8 is the bare minimum CGPA that will simply let you sit for the placement tests. Based on whatever I've observed, an 8.5 is the safest bet for eligibility for sitting for the test, and for having a good chance to be in the top people selected for interviews.\n\nBut yes, it's a really long way to go. Lots of opportunities to lift up your GPA and get there, so don't lose hope already. But at the same time, don't downplay the end goal."
    }
  ]
}