{
  "id": "11900rn",
  "title": "ESA correction",
  "content": "Just wanted to know how strict esa correction would be. Did you guys get as expected or below/above in ur physics cycle?",
  "metadata": {
    "author": "Previous_Locksmith_1",
    "url": "https://www.reddit.com/r/PESU/comments/11900rn/esa_correction/",
    "permalink": "/r/PESU/comments/11900rn/esa_correction/",
    "score": 3,
    "created_utc": 1677074762,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "j9jzt9b",
      "body": "if the same question continues to the next page, should we bubble the same question again or not? because i didn’t do that :)"
    },
    {
      "id": "j9mhmau",
      "body": "No need"
    },
    {
      "id": "j9o3mnr",
      "body": "It is less strict than school, I can tell you that much. I've gotten more than I expected in every sem till now, though it varies from person to person."
    },
    {
      "id": "j9of8mi",
      "body": "U sure ? I'm having a panic attack over electrical and maths, 😂😂😂"
    },
    {
      "id": "j9ojqry",
      "body": "Like I said, it varies person to person, but for me at least out of 19 subjects I've given I got 18 of them expected or higher grade and only 1 was 1 grade lower, that too because of correction glitch."
    },
    {
      "id": "j9pq9py",
      "body": ">That too because of correction glitch\n\nSo did you do anything about it?"
    },
    {
      "id": "j9shesa",
      "body": "Reviewed but it didn't change, many people in my batch had same problem (AFLL ESA)"
    },
    {
      "id": "j9svwij",
      "body": "Do we get to review in ESA also like ISAs?"
    },
    {
      "id": "j9szfe7",
      "body": "Are you sure about it?"
    },
    {
      "id": "j9z5m80",
      "body": "yes i am sure"
    },
    {
      "id": "j9zcp37",
      "body": "Thanks for that... I have heard some invigilators telling to bubble all the pages. So was worried regarding that. Just curious... how are you aware of it?"
    },
    {
      "id": "j9zdau5",
      "body": "we were told in the meeting held in mrd auditorium regarding this"
    },
    {
      "id": "j9zee82",
      "body": "Told by VC right? Same person who got angered by us creating noise in the auditorium. Even I had it in my mind... but after hearing differing views I started to doubt myself whether I heard it right or not. Even in the document which they sent by mail regarding the esas on 13th Feb... it was mentioned to bubble the question no even if it goes on to the next page."
    },
    {
      "id": "ja1urzg",
      "body": "Yes the VC guy I will just say it's on him if I lose many marks"
    }
  ]
}