{
  "id": "11dy7m2",
  "title": "Doubts regarding internships",
  "content": "I have just finished  1st sem and i have a few questions before second sem starts:\n\n1. Since most of us will do internships in 6th sem onwards, by that time will the college teach us the required skills/courses during second and third year , to be able to do the internships or we have to do some courses by ourselves?\n2. Can one do internship starting from 3rd/4th semester?\n3. By 1st sem, should we already choose our domain?\n4. Also regarding the capstone project, is it better if one starts early like in 3rd sem or something?\n\n&#x200B;",
  "metadata": {
    "author": "abelode",
    "url": "https://www.reddit.com/r/PESU/comments/11dy7m2/doubts_regarding_internships/",
    "permalink": "/r/PESU/comments/11dy7m2/doubts_regarding_internships/",
    "score": 9,
    "created_utc": 1677563051,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jabnsm3",
      "body": "1. Lmao no. College barely scratches the surface when it comes to gaining skills to get an internship/job, forget about the industry. Once you actually join the job you will see how college barely made an effort to teach you the skills in the capacity to actually get the job done. You will need to do extensive prep on your own to get a job, and then actually learn things in depth on your own once you start work because all college does is teach at the surface level\n2. You can do an internship in any semester - you simply won't be given credits for it. Doing an internship is never bad, although I don't see how one would have the time to do it during the semester with 5 ISAs and other things. Summer is a good time though, but most companies do not hire 2nd year kids.\n3. No, people take a long time to explore, experiment and figure out which domains they like or want to work in. Some people take almost 4 years of college, some like me are fortunate enough to know it when they step into college. Everyone is different, don't stress if you do not know what you like - it simply means you have not explored enough\n4. Nah, 3rd sem is too early. You will probably not have found your domain of choice and also find teammates with the same interests. Plus college tends to change a lot of things here and there every year, so wait for the right time. Besides, you will need approvals from mentors as well as panels etc for proceeding with the project. There are a lot of loops, don't jump steps now."
    },
    {
      "id": "jabnvb4",
      "body": "1) The college won't teach you domain specific skills to an industry standard I guess? Curriculum is not bad but at the same time is not enough for early internships so you would be expected to learn on your own\n2) I will not comment on this , somebody else can answer this.\n3) I would strongly suggest to explore different domains in your entire first year and find what you truly like. Many people keep switching between trending topics or hear about different domains by word of mouth do it for 2-3 weeks then switch to another. Take your time and explore, you'll definitely find something you like\n4) don't rush into it that's way too early , there could be something much more interesting that you may come across during your 3rd year so keep an open eye instead"
    },
    {
      "id": "jabufds",
      "body": ">You will need to do extensive prep on your own to get a job, and thenactually learn things in depth on your own once you start work becauseall college does is teach at the surface level\n\nSo, we need to do our own prep, as well as getting a decent cgpa? Also considering 5 internals, projects, assignments as well as club events and such i expect it to be pretty hard to balance both. \n\nAlso since the college, teaches at a surface level, is it safe to say that the college introduces the domain to us, and it is our job to explore further and deep into it?\n\nRegarding the second point, internships in colleges rather than companies such as IIT, IISC as well as PES, they can take 2nd years right?\n\n&#x200B;\n\nThank you so much for the detailed answer!"
    },
    {
      "id": "jabuvv4",
      "body": "I see...\n\nRegarding the first point, will PES also teach in terms of workshops, PIL, and other such cse verticals to a more detailed exploration of a  domain, more than what it is there in the curriculum? I havent heard of a single workshop that took place like this, even in the \"workshop\" i went, they barely taught anything and expected like a 100 newbies , to the hard problems. \n\n&#x200B;\n\nThank you so much for the detailed information!"
    },
    {
      "id": "jabvp7m",
      "body": "> So, we need to do our own prep, as well as getting a decent cgpa? Also considering 5 internals, projects, assignments as well as club events and such i expect it to be pretty hard to balance both. \n\nYup, placement prep *ideally* should start in 5th sem (because companies come for summer internship towards the end of 5th sem and throughout 6th sem, and then for placements throughout 7th sem). You'll need to find time to balance CGPA, prep for internship/placement tests, as well as building your skill set and profile.\n\n> Also since the college, teaches at a surface level, is it safe to say that the college introduces the domain to us, and it is our job to explore further and deep into it?\n\nIt's a pretty basic introduction. If you're in CSE, you'll have to put in effort to go in depth and actually get your hands dirty to properly learn things. Besides, they don't teach anything properly here too.\n\n> Regarding the second point, internships in colleges rather than companies such as IIT, IISC as well as PES, they can take 2nd years right?\n\nI'm aware that IITs and IISc have certain internships but I'm not too sure if it's for 2nd years. Even if it's applicable, it's going to take something special to get selected among third and final year students. Either way, since I don't know too much about this I'm not going to comment, someone else might know better."
    },
    {
      "id": "jag9zfv",
      "body": "&gt;will PES also teach in terms of workshops, PIL, and other such cse verticals to a more detailed exploration of a  domain, more than what it is there in the curriculum\n\nAnything you want to learn, you will need to do on your own. Clubs will only provide opportunities with workshops and events. Even these are only basic introductions. If you are interested in a field, you will need to go into depth on your own"
    }
  ]
}