{
  "id": "11hyqnh",
  "title": "GRE PREP",
  "content": "A 2nd sem student here\nWanted to know more about how to start?,when to start? GRE Prep in order to get into the Ivy league universities and what other things should I be aware of while doing the same?\nDo u recommend any YT channels who could throw more light on this?",
  "metadata": {
    "author": "Yagnikanna_123",
    "url": "https://www.reddit.com/r/PESU/comments/11hyqnh/gre_prep/",
    "permalink": "/r/PESU/comments/11hyqnh/gre_prep/",
    "score": 8,
    "created_utc": 1677935233,
    "flair": "Study Help :table:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "javzp5h",
      "body": "You're barely in University and already thinking about your higher education's University? Relax buddy.\n\nGRE isn't the only thing that's required (and fyi, a good number of top Universities have made it non-mandatory). Your profile matters - experience, achievements you've accomplished, anything that show you're good in the field you're applying for. You also need to research on what exactly you want to pursue as well. You need letters of recommendation from professors you've worked with (which at this point I'm going to assume is 0) as well as strong statement of purposes which declare why you'd be a good fit for a program. Summary is, GRE is a small part of your application, it's everything else that actually matters.\n\nIf you're looking to directly opt for higher education right after BTech, then people start looking into it from around mid of 6th semester/early 7th semester (application process is an entire year almost). You have time for preparing for GRE later. The time now is to build everything else about your profile. \n\nDon't treat foreign applications like JEE. It isn't the case that whoever gets the best score gets the best University."
    },
    {
      "id": "jawlkrm",
      "body": "Doing my masters RN. I'd recommend first finding out what you want to do and picking out universities. If you're looking to go to grad school right after UG, then you'd typically do this around your 6th sem. After you pick the places, you can see which ones actually need the GRE and then decide if you want to give it. The exam is expensive, and a lot of universities have stopped asking for it. \n\nThe official ETS prep material was more than sufficient for me."
    },
    {
      "id": "jaxr84h",
      "body": "Doing my masters RN. First, look at the course you want to do and learn more about it. Choose electives in college leading to that. I'd recommend a strong 8 month prep for GRE before you take the rest, essentially in the beginning of your final year. Round up colleges you want to apply to and look at your profile vs their student profiles and cover gaps. Don't waste your summers. Try to do some research."
    },
    {
      "id": "jaz2ngt",
      "body": "When did you start applying to universities ?"
    },
    {
      "id": "jaz50i4",
      "body": "As someone who just finished the master's application process for fall 2023, man you're starting wayyy too early.\nAs other commenters have said, first focus on understanding what you like in your major and what you'd like to pursue in your master's and build your profile accordingly. Do research about universities and professors. \n\nGRE is not JEE. You can do it after your 6th sem"
    },
    {
      "id": "jbz0408",
      "body": "For the Fall 2022 intake, i finished all my applications between November 15th - December 15th 2021. I started it late as i already had a job in hand, but i would recommend finishing your applications by November and sitting for placements."
    },
    {
      "id": "jbz0do5",
      "body": "I took my GRE on 27th August 2021, and TOEFL on 4th September 2021. I prepped for GRE from Jan 2021"
    },
    {
      "id": "jft8fkn",
      "body": "I took my GRE the day before my 6th sem started and I think that was the perfect time because it was not last minute and it gave me flexibility to work a couple of years if I wanted before applying(since GRE scores are valid for 5 years). It requires about 2 months of dedicated preparation. The official ETS books are more than enough for Quant and I recommend \"Word Power Made Easy\" by Norman Lewis as well as various flash cards like Magoosh for Verbal. You would want to target as close to 170 in Quant as possible along with a total of 325+ if you're looking at top universities and the resources I mentioned are more than enough.\n\nThe earlier you take it the more comfortable you will be but just keep in mind that these scores are valid for 5 years only. And set a target date to write it when you start preparing."
    }
  ]
}