{
  "id": "11o3wp4",
  "title": "Recently finished my 1st sem got 7+sgpa(phy cycle) need guidance for the future sems",
  "content": "So as the title says my Sem wasn't good kinda fucked my isas and got low scores now I know the importance of isas still I need some guidance towards the future sems like what to and how to keep your gpa above 8.5 to get placed in a good company and about the internships too!",
  "metadata": {
    "author": "Old-Landscape-256",
    "url": "https://www.reddit.com/r/PESU/comments/11o3wp4/recently_finished_my_1st_sem_got_7sgpaphy_cycle/",
    "permalink": "/r/PESU/comments/11o3wp4/recently_finished_my_1st_sem_got_7sgpaphy_cycle/",
    "score": 8,
    "created_utc": 1678489724,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jbr77nt",
      "body": "\"Guidance\" is a pretty broad term. There is already a ton of advice on this sub from different people to similar questions, some of them being asked only a few days ago. Specific advice on what to do each semester is difficult to give without knowing which branch either. \n\nBut either way, the best way to take it is one semester at a time. Regardless of your branch, the one thing that remains constant as you said is never underestimating the role of the ISAs. Always make sure to maximise effort and give each ISA your best shot. If you can maximise those 40 marks, plus do well in your project/assignment/lab and get 10, it gives you a lot of room to screw up the ESA and still get a good grade. In later semesters you're going to have way more workload, but you'll still need to do well.\n\nGetting above 8.5 means atleast half your courses need to be an A grade, remaining a B. This requires consistency to do well in every test. You yourself can judge best on where you went wrong this semester. Start small. Start preparing for ISAs earlier, manage time better, prioritise each ISA for every course and don't leave anything for the last minute. A lot of it is idealistic advice, but as I said, it's very generic guidance without knowing which branch for future sems. Find out from chemistry cycle kids on how to do well this semester and learn from their mistakes. \n\nChill, it's just the first semester. You have atleast 5 more semesters to go before any changes to your CGPA won't help you anymore. Take it one step at a time."
    }
  ]
}