{
  "id": "11xni4i",
  "title": "PLACEMENTS",
  "content": "Is it true that more number of people in pes means that it will affect placements as there are nearly 2200 students(both campuses) in the ‘26 batch as compared to rv,bms?",
  "metadata": {
    "author": "Timbaggg256",
    "url": "https://www.reddit.com/r/PESU/comments/11xni4i/placements/",
    "permalink": "/r/PESU/comments/11xni4i/placements/",
    "score": 2,
    "created_utc": 1679418978,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jd4opht",
      "body": "Quite obviously. Let's look at it statistically.\n\nAny company's placement test will be attempted by *atleast* 80% of the CS students. Assuming your numbers are correct, that's around 1800 kids sitting for each test. Now each company will shortlist only a maximum of about 20-40 for the interview rounds, so you've got a 40/1800 = ~2.2% chance at being eligible to sit for interviews. \n\nTo add to that, companies usually hire about 10-15, max 20 students. So in total, you have probably about a 1% chance of getting placed at any company in the beginning (since your chances will slowly increase as people get placed).\n\nBut this is counting CS kids alone. Most companies that allow CS kids for their placement tests also allow ECE, and rarely EEE. That 1800 number could realistically be close to 2000 atleast. Companies aren't going to hire more students just cause a college has more students in a branch, they'll simply make the filter better to filter out the students they don't want. \n\nSo yes, placements will obviously be affected for you. You're looking at slimmer chances of getting through a company's placement process. \n\nBut this is from a pure statistical point of view, things might be different. My batch had only 600 CS kids, my chances statistically weren't that much greater, but most turned out okay and didn't face too much of an issue.\n\nAlso it's close to 2 am at night, if these numbers don't make sense, it's the sleep. Feel free to correct me if I'm wrong lmao\n\nEdit: Corrected the math lmao"
    },
    {
      "id": "jd65its",
      "body": "Yeah man get some sleep it's 2.22%"
    },
    {
      "id": "jd6k5ma",
      "body": "But I heard someone tell that more companies will come?"
    },
    {
      "id": "jd6naut",
      "body": "Yeah my bad just corrected it"
    },
    {
      "id": "jd6ngk9",
      "body": "More companies come with every passing year but the fraction of good companies remains the same. The increase in number is mostly because of new startups that decide to visit. All major companies already visit and recruit."
    },
    {
      "id": "jft617f",
      "body": "If you are in CSE or ECE and you have a decent CGPA (around 8.6+ for CSE and 8+ for ECE) don't worry about placements, you'll comfortably get a 15+ LPA job. Compared to RV and BMS you may or may not get a better job than your peers but you'll definitely get one earlier and more comfortably. So relax, no need to put too much thought or effort. Also getting summer internship pretty much guarantees you a PPO so focus during that as well as it'll save you from having to sit for placements at all."
    }
  ]
}