{
  "id": "1204r5x",
  "title": "Pessat",
  "content": "[deleted]",
  "metadata": {
    "author": "[deleted]",
    "url": "",
    "permalink": "/r/PESU/comments/1204r5x/pessat/",
    "score": 3,
    "created_utc": 1679621372,
    "flair": "PESSAT",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jdfp4rq",
      "body": "thank you to everyone in this sub, really helpful"
    },
    {
      "id": "jdfxow4",
      "body": "Firstly, PES does not take admissions via ComedK. Only KCET and PESSAT. PESSAT is also easier than JEE Main, so don't use that score to assess any future scores. Focus on your prep for whatever time you have left."
    },
    {
      "id": "jdfz52n",
      "body": "some I've talked to say it's jee level, some say it's about kcet level and some say it's between kcet and comedk so a bit confused\n\nsome even said above jee m level"
    },
    {
      "id": "jdfzht0",
      "body": "Lmao above JEE level huh. No scene man. I wrote PESSAT 5 years ago and unless things have changed, it should be around KCET/ComedK level. It might have *slightly* increased, but there is no way it's above JEE level."
    },
    {
      "id": "jdfzt78",
      "body": "got it thanks brother, people on quora and some people on this sub said it's jee level or above"
    },
    {
      "id": "jdgg43l",
      "body": "If it helps you, I got 84 percentile in JEE and still got CSE (RR Campus) via PESSAT, so it's definitely possible"
    },
    {
      "id": "jdgsvzp",
      "body": "that's reassuring, thanks. any tips for the exam?"
    },
    {
      "id": "jdgzpr6",
      "body": "Yeah lmao. \n\nEven I got just 90 percentile for Mains and got CSE"
    },
    {
      "id": "jdha2jb",
      "body": "Nah, for sure below jee"
    },
    {
      "id": "jdhdxjm",
      "body": "any tips for the exam?"
    },
    {
      "id": "jdhusqu",
      "body": "You wanna keep an eye on the time…I had to rush through 20 or so qns cuz I ran out of time. Basic CET prep should cover portions for PCM"
    },
    {
      "id": "jdiuarh",
      "body": "If you had to ask me, I'll say focus strongly on the physics and Maths part. Chemistry would be somewhat easy compared to these 2. Oh and if your grammar and stuff is good, you need not worry about English either"
    },
    {
      "id": "jdizdd0",
      "body": "considering 70 marks is enough for cs and my chemistry is strong seems like i just need either strong phy or maths right?"
    },
    {
      "id": "jdkvw6f",
      "body": "Yep"
    },
    {
      "id": "jdlh0uv",
      "body": "PESSAT is similar to BITSAT. I preped from BITSAT papers last minute and it sorta helped me."
    },
    {
      "id": "jdlrhe7",
      "body": "thanks I'm prepping for bitsat only now, hoping that helps me"
    },
    {
      "id": "jdm1mdq",
      "body": "Exam pattern could feel weird but is easy\nAlmost that of KCET \nConcentrate more on organic chemistry\nPhysics could be ur scoring sub,try maximizing score there...U vl have a virtual calculator so use it propeerrlllyyy for calculations...In few questions as far as I remember the questions had a big calculation at the last step but calculator ofc made it ezzeee.\nI had 3 fill in the blanks questions....Like :\nThe electric field lines thru a spherical conductor is _________ to the surface :- answers accepted were perpendicular or normal and so on\n\n\nEnglish part is pretty chill"
    },
    {
      "id": "jdm20gz",
      "body": "really helpful thanks, so general consensus is to maximize marks in phy and chem and that would be enough for cs\n\nquestions are majorly from 12th?"
    },
    {
      "id": "jdmq3tl",
      "body": "Please tell me how is the pes university ring road campus"
    },
    {
      "id": "jdn2z6r",
      "body": "ummm as far as I remember the split was approx 70:30 btw 12th and 11th"
    }
  ]
}