{
  "id": "12080df",
  "title": "Help in converting GPA to 4 scale",
  "content": " Hello Folks,\n\nI'm currently applying for graduate studies in computer science and I needed some advice on how to convert my 10-scale GPA to 4-scale. I know that while applying, we must report GPA in the original scales, but I only need the conversion as I'm shortlisting unis for Fall'24 and I'm comparing my GPA against the GPA of admits in GradCafe. Since GradCafe reports GPA in a 4-scale, I will have to convert my GPA to 4-scale to appropriately compare.\n\nI'm currently using scholaro's GPA calculator and have entered the credits and corresponding grades. But, something seems to be off as it's reporting a cumulative GPA of **3.9**/4 when my CGPA is **9.03**/10. And my CGPA is definitely very average when compared to the my rest of my cohort where average GPA is around **9.3** \n\nNow, I'm confused if **3.9** is really my converted GPA and should I use this while comparing GPAs in GradCafe ?? So, it would help me a lot if anyone can let me know my converted GPA (just a rough estimate) so that I can shortlist unis aptly.\n\n**PFA**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nhttps://preview.redd.it/gjuy2eyyylpa1.png?width=752&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=98623b798863a7889e0a0e1fd9d5f246688a4873",
  "metadata": {
    "author": "No-Feeling-2319",
    "url": "https://www.reddit.com/r/PESU/comments/12080df/help_in_converting_gpa_to_4_scale/",
    "permalink": "/r/PESU/comments/12080df/help_in_converting_gpa_to_4_scale/",
    "score": 5,
    "created_utc": 1679629397,
    "flair": "Study Help :table:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jdg7pil",
      "body": "Did you just say 9.03 is average? \n\n* Cries in the corner *\n\nBut yes as far as I know, that's more or less accurate since you're scaling it down. Ideally you should also shortlist based on other factors since your GPA is only a minor component that makes your application. Highest GPA doesn't always make it through here."
    },
    {
      "id": "jdgwopf",
      "body": "Thanks a lot for your reply !! Yes, in my batch, average GPA is around 9.3. And my GPA is below-average.\n\nBut, in this [yocket link](https://yocket.com/blog/how-to-convert-10-point-cgpa-to-4-point-gpa) and other sources, it's given that 9 corresponds to around 3.68. That's the reason I got confused.\n\nYeah, I'm considering other factors and shortlisting holistically. But, the exact converted GPA would help me make better decisions. \n\nSo, is it safe to assume that **3.9** is my converted GPA and go ahead with that?"
    },
    {
      "id": "jdl4yby",
      "body": "Your batch’s average gpa was 9.3?\n\nWhat the fuck man. There’s no value to getting 9 in pes then"
    },
    {
      "id": "jdp8zdc",
      "body": "Are you sure your scholero settings are correct? I had to do this when I applied and the scholero gpa I reported was lower than yours but I had a higher CGPA. \n\nAfter you select the drop down that corresponds to the best grade you should put in the same letter grades (so S, A, B etc. No A+ or anything like that)"
    },
    {
      "id": "jdpazs3",
      "body": "First, I tried to select the PESU Grading scale. But, this feature is available only for premium users and the button to calculate GPA is disabled. [PFA](https://imgur.com/a/UDJybcY)\n\nSo, I ended up choosing the UCG 10-point scale ([PFA](https://imgur.com/a/fiiVJZq)) in which I mapped our grades (S,A,B,C) to (O,A+,A,B). Is this the correct way to do it ? \n\nIf not, can give please give me a rough estimate of my GPA **9.03** to 4-scale (I have all S and A except for a couple of Bs and one C ).\n\n  \n\n**Thanks a lot**"
    },
    {
      "id": "jdpc1sw",
      "body": "Also, can I please DM you regarding some other query ?"
    },
    {
      "id": "jdpea5f",
      "body": "I think the VIT one was what I used. Or maybe Anna University or Mumbai University. One of those should do the job"
    },
    {
      "id": "jdpebq0",
      "body": "Feel free"
    },
    {
      "id": "jdzbq2a",
      "body": "Which batch are you from? afaik no batch has average gpa that high. The closest thing is the current 6th sem CS where 33% got 9 or higher sgpa last sem, but even there cgpa is lower."
    }
  ]
}