{
  "id": "12hgun0",
  "title": "SCHOLARSHIPS",
  "content": "Are the scholarships just randomly credited or is there any physical acknowledgement like a cheque or something? Cause my bank account will take a few days to get made and they announced list today.",
  "metadata": {
    "author": "Previous_Locksmith_1",
    "url": "https://www.reddit.com/r/PESU/comments/12hgun0/scholarships/",
    "permalink": "/r/PESU/comments/12hgun0/scholarships/",
    "score": 4,
    "created_utc": 1681128463,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jfosqve",
      "body": "They will send a google form later(few weeks to months) to submit bank acc details. How are the scholarship cutoffs for your batch btw?"
    },
    {
      "id": "jfosutc",
      "body": "For ec campus 8.5 for mrd phy cycle. 8.6 for chem cycle"
    },
    {
      "id": "jfozdpq",
      "body": "What is the value exactly. The terms are pretty vague and everyone gives different numbers. Can anyone who knows for sure please tell"
    },
    {
      "id": "jfq68zg",
      "body": "8.64 to be precise chem cycle and phy cycle 8.5"
    },
    {
      "id": "jfq6hbg",
      "body": "For pessat it must be 41k.\n\nIt's 20% of the sem fees. So sem fees is 2.05L and 20% of that is 41k."
    },
    {
      "id": "jfrr5dp",
      "body": "The website says it’s 40%. Does that mean 40% of a sem’s fees per year?"
    },
    {
      "id": "jfrs6bu",
      "body": "It's 40% of your sem fees , so it's gonna be 82k for pessat students and around 15k for cet peeps"
    },
    {
      "id": "jftp8yx",
      "body": "Cool cool. I can finally upgrade my eighth hand iPhone 6. \n\nYou’re sure right? Cause I’m gonna be damn pissed otherwise"
    },
    {
      "id": "jfz7s77",
      "body": "Mann this sh\\*t is so confusing. I remember that it was written 20% of the sem fees. They've changed the description of scholarships again on their website"
    },
    {
      "id": "jfzc9ag",
      "body": "Idk about your batch but for our batch (2020-24) it is 40% of sem fees ."
    },
    {
      "id": "jg3y4in",
      "body": "Oo then it might very well be the same for us. I just hope it doesn't go below 41k💀"
    },
    {
      "id": "jgdniec",
      "body": "What i was originally asking was will there be a FINAL list of students with their respective quotas and all? Because I'm not seeing anybody taking down any details here. The quota part is what I'm really worried about."
    }
  ]
}