{
  "id": "12izje5",
  "title": "Can someone please suggest me some tips for pessat exam?? And where should i practice the questions from??",
  "content": "",
  "metadata": {
    "author": "sam72625",
    "url": "https://www.reddit.com/r/PESU/comments/12izje5/can_someone_please_suggest_me_some_tips_for/",
    "permalink": "/r/PESU/comments/12izje5/can_someone_please_suggest_me_some_tips_for/",
    "score": 4,
    "created_utc": 1681250935,
    "flair": "Study Help :table:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jfwlsl6",
      "body": "The level of questions from the PESSAT exam is halfway between KCET and mains. So, any amount of prep you do for mains and KCET will be enough ig. Also, there will be English, so just go through antonyms and meanings of uncommon words, coz you won't know what they'll ask.\n\nAlso, I would have suggested you to practice from previous year papers, but PESSAT is a computer based test (CBT) so no question paper..."
    },
    {
      "id": "jfx8jgr",
      "body": "What is the syllabus of there English???"
    },
    {
      "id": "jfxhdmk",
      "body": "It's just basic stuff. If you got through highschool you don't need to worry about it."
    },
    {
      "id": "jfxuttk",
      "body": "Where can i find pessat previous years papers"
    },
    {
      "id": "jfxyuqw",
      "body": "As I told before, PESSAT is a CBT, so we don't get question papers. Just practice any usual entrance exam like BITSAT, SRNJEE, Amrita, KCET, mains, and you're all ready."
    },
    {
      "id": "jfxzk4r",
      "body": "Okay thanks"
    },
    {
      "id": "jhx9nrl",
      "body": "i got 90 percentile in mains, didn't prepare for it really. I'm doing only kcet stuff now, is it enough?"
    },
    {
      "id": "jhxh9i9",
      "body": "Yep. Study for KCET consistently. There's these 16 year previous question paper books available online, they're gonna be really useful. Just one important point: give it your all.\n\nAny doubts, feel free to ping me."
    },
    {
      "id": "ji0p6ag",
      "body": "please check dm bro"
    }
  ]
}