{
  "id": "12kkovv",
  "title": "Send transcripts to US university",
  "content": "Hi folks, \n\nI graduate with B. Tech CSE in 2023.\n\nI'm moving to the US for masters in August. I need to get PES to send the transcripts AND degree to the university. \n\nWhen can I expect PES to have the transcripts and degree ready? Because I heard convocation and all happens in September. I won't even be here during that time. \n\nAny advice appreciated\n\nThankss",
  "metadata": {
    "author": "Salt_Try_7365",
    "url": "https://www.reddit.com/r/PESU/comments/12kkovv/send_transcripts_to_us_university/",
    "permalink": "/r/PESU/comments/12kkovv/send_transcripts_to_us_university/",
    "score": 3,
    "created_utc": 1681382955,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jg3bzau",
      "body": "Most universities only require that you submit the transcripts within one year of joining, or before you graduate. You should have it by then. \n\nUsually the CoE can help you send a digital transcript to your university if they need it."
    },
    {
      "id": "jg3h0op",
      "body": "Thanksss"
    },
    {
      "id": "jg4lg04",
      "body": "Hi. \nGo get a copy of your transcript from the coe. They will have to electronically send it. Scan the transcript, and mail the head of the coe, asking him to send the attached transcript to the mail ID you need to send it to. Ask anybody in the coe for the mail id."
    },
    {
      "id": "jg6d1pu",
      "body": "Thanks for ur reply. I got that part. But since I'm still in my 8th sem. I was wondering when they would have the complete details for transcripts. Because I've to send transcripts of 8th sem also."
    },
    {
      "id": "jgp0e39",
      "body": "You can do it soon as you graduate and your last sem Gpa Is out."
    },
    {
      "id": "kcl1cee",
      "body": "anyone have the mail ID to ask COE to send it?"
    },
    {
      "id": "kclnkh8",
      "body": "Should be on the website or ask a junior/prof maybe?"
    },
    {
      "id": "l02tcan",
      "body": "Does somone have an answer to this?   \nI need to send official transcripts electronically.   \nThanks."
    },
    {
      "id": "l03yymm",
      "body": "You can send an email to coe.pesu@pes.edu"
    },
    {
      "id": "l19uunb",
      "body": "Process is te same as u/foodisspicy11 mentioned?  \nMail them with information on the target email and anything else?"
    }
  ]
}