{
  "id": "12rvh4y",
  "title": "Will any more companies visit campus in the next few months?.",
  "content": "[deleted]",
  "metadata": {
    "author": "[deleted]",
    "url": "",
    "permalink": "/r/PESU/comments/12rvh4y/will_any_more_companies_visit_campus_in_the_next/",
    "score": 9,
    "created_utc": 1681915254,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jgw21id",
      "body": "I think now's the time for no sugar-coating so I'm going to be completely honest.\n\nMost companies would have closed or are approaching the closing of their 2023 placement drive now. It's unlikely for companies to still visit colleges for placements now. Everything practically closes by Feb-March. Beyond that you'll probably only have a handful visiting. Companies are either getting ready to onboard their new recruits or are looking into internship to FTE conversions at this stage. \n\nI'd suggest you to start looking for off campus opportunities ASAP. The on campus road is going to close soon, if it hasn't already."
    },
    {
      "id": "jgw407f",
      "body": "Thanks for the advise. Any pointers on where I can apply offcampus .\n\nI tried a few on LinkedIn but its tough to get shortlisted there. Any other sources?"
    },
    {
      "id": "jgw48it",
      "body": "I used to use Google Jobs, found it a better aggregator compared to LinkedIn. Additionally try reaching out to friends and asking for referrals at their companies."
    },
    {
      "id": "jgw4m9n",
      "body": "Thanks.\n\n>Additionally try reaching out to friends and asking for referrals at their companies.\n\nThe problem with this is all my friends are either my age or younger. I don't have anyone who is senior than me who can refer me."
    },
    {
      "id": "jh04psn",
      "body": "Is placement bad at pesu or u did not sit?"
    },
    {
      "id": "jh07f2w",
      "body": "I wasn't well prepared in the initial months. And I only wanted to go for companies with package >8-10lpa.\n\nThose companies dropped drastically after sept end. Oct middle. Thanks to recession"
    },
    {
      "id": "jh1civv",
      "body": "what are the statistics?How many people are still unplaced from your batch at this moment?"
    },
    {
      "id": "jh3odam",
      "body": "I think there is a spreadsheet pinned somewhere in this subreddit for the current (2023) batch placement data"
    },
    {
      "id": "jh8ucf3",
      "body": "Was your GPA decent?"
    }
  ]
}