{
  "id": "12w02qd",
  "title": "Usefulness Of Recommended books in PES curriculum (CSE)",
  "content": "I wanted to know how relevant and useful the reference books listed in the PES curriculum are to LEARN and UNDERSTAND the concepts for the BTECH CSE course.\n\nJust to clarify i DO NOT want to know if they will fetch me good GPA. I just want to know how reliant they are to learn the topics at a satisfactory level which ideally should be reached for that course.\n\nFor example, the recommended book for Problem Solving with C is “The C Programming Language”, Brian Kernighan and Dennis Ritchie\n\nReddit searches for good books to learn c also returns the same.\n\nIt would be really helpful if any seniors who may have gone through 1 or more books tell if i should follow these books or follow other online resources to learn similar courses like MOOCs ,OSSU?\n\nthis is the entire course curriculum pdf if anyone would like to go through:\n\nhttps://cs.pes.edu/wp-content/uploads/2019/08/CSE-Curriculum-2019-2020.pdf",
  "metadata": {
    "author": "Excellent-Let2022",
    "url": "https://www.reddit.com/r/PESU/comments/12w02qd/usefulness_of_recommended_books_in_pes_curriculum/",
    "permalink": "/r/PESU/comments/12w02qd/usefulness_of_recommended_books_in_pes_curriculum/",
    "score": 5,
    "created_utc": 1682235446,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jhhan6y",
      "body": "2022 graduate here. A little long answer but bear with me.\n\nFrom what I can recall, PES does choose the most recommended books for a course. The books they recommend are *almost* always popular choices that are well known for containing the core concepts and are also pretty good if you give them a read. Doing these books thoroughly on your own should give you a good idea about the fundamentals about that subject. They're very good books written by some very well known authors. This is never the issue. So if you want the basics for a subject, yes they're *good enough*. But let me also talk about the GPA aspect.\n\nThe issue is that the syllabus for a lot of courses isn't well structured or defined. PES *prioritises the number of topics covered over topic details* so for a lot of courses you'll end up covering the surface level details across all topics just so that you get to include *all* possible topics, including the new ones. Yes, they do claim that their syllabus is always updated and it is, but it doesn't mean anything if you touch-and-go topics just to include the latest developments. That's why **people here don't follow the books**, and rather stick to slides prepared by profs because it's a lot of effort comparing the syllabus and finding the topics in each book and reading till what is required rather than simply referring the slides. The slides are easier, have pretty much whatever content you need for a good GPA and are much faster to go through as well. People here rarely refer to textbooks and view it as a waste of time and energy unless you really have that kind of time to spare (which you would have realised that you rarely do have).\n\nIf you want to know more about these courses, yes the books are good resources. Definitely. But don't expect everything in the books to be taught to the degree it's required at PES. Once you join your job you'll realise *nothing* was taught to the degree it's required. If you want a good GPA, stick to the slides to save effort. Ideally, online courses are better structured and teach well too, so you shouldn't stop yourself from checking those out either. If you want more knowledge than what the PES syllabus imparts, you *have* to do stuff on your own. Doesn't matter if it's the book, online sources or both. Personally, I spent a lot of time learning from online coursework and different sites for the subjects I was interested in and wanted to learn more than the syllabus. I did use the textbooks a fair bit but also used online sources equally. It all depends on what you prefer."
    },
    {
      "id": "jhhicz4",
      "body": "Thanks for the reply, i really don't care much abt the gpa requirements and realise that pes doesn't teach much. I just wanted to know if the books are good resources in general to learn the extra part that u mentioned which u did answer as yes. Thx for the reply once again."
    }
  ]
}