{
  "id": "135nhbd",
  "title": "[deleted by user]",
  "content": "[removed]",
  "metadata": {
    "author": "[deleted]",
    "url": "",
    "permalink": "/r/PESU/comments/135nhbd/deleted_by_user/",
    "score": 8,
    "created_utc": 1683039133,
    "flair": null,
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jil1kuv",
      "body": "6.75 and above is the bare minimum from placement office\n\n\nFirst month expect cut off to be 8.5 set by the companies who visit for hiring.\nPost that 8 and above is the cutoff set by visiting companies.\nMany companies are open for all(no gpa no branch limitations)"
    },
    {
      "id": "jinegnv",
      "body": "A lot of them keep 8.5, very few keep 8.8"
    },
    {
      "id": "jinpk7k",
      "body": "Acc to the pro chancellor it should be above 8.75. But many tier 1 companies keep a very low cutoff. Depends from company to company tbh."
    },
    {
      "id": "jio4bu1",
      "body": "From what I've heard from Jawahar is that most of the T1 offers are bagged by the students who had Gpa in excess of 8.75 and this is an \"observation\" found by sridhar and jawahar based on empirical data of 2022 batch hiring and has nothing to do with companies whatsoever.....\nCompanies don't have a hard and fast rule,they take 8.5 initially as the crowd that needs to be assessed is small in number and it saves them a lot of time and effort spent on hiring events..... This is the reason behind 8.5 or 8 or whatever the company keeps\nMany product based giants had 8.5 and 9 and they were open for all companies also who didnt fear interviewing 40-60 people for finding suitable candidates"
    },
    {
      "id": "jioxfkl",
      "body": "Hmm so slightly below 8 means no chance for getting placed in first 2 months?"
    },
    {
      "id": "jioyd2f",
      "body": "If given a chance to appear for the hiring process and if you can crack the coding round and get through the interviews with solid basics and fundamentals then you can get placed easily...\nBut the deal is getting through process if you are given a chance and you won't get a lot of chances in the beginning"
    }
  ]
}