{
  "id": "136hm6a",
  "title": "Internships At PES",
  "content": "I am in 4th sem. I have received multiple projects / internships offers to pursue during our summer vacations . Can you guys tell which PESU internship is the best :\n\nThe options are:\n\n1) Summer Project with IEEE CS PESU\n\n2) Summer Project with IEEE RAS PESU\n\n3) Research paper / Project with your favorite Professor\n\n4) PES Innovation Lab Summer Internship\n\n5) ISFCR Summer Internship\n\n6) IOT Summer Internship \n\n7)  CDSAML (Center for Data Science and Advanced Machine Learning)  Summer Internship\n\n8) CCBD (Center for Cloud Computing and Big Data)  Summer Internship\n\n9)   CIE SUMMER WORKSHOP\n\n10) Sit at home and learn. Do competitive coding and open source. \n\nMany 2nd students are confused which one to do , so if you guys can write the advantages and disadvantages of these internship. And can you RANK these 10 things based on those factors. And which is best for us. (BEST USE OF OUR VACATION)",
  "metadata": {
    "author": "FickleAd4141",
    "url": "https://www.reddit.com/r/PESU/comments/136hm6a/internships_at_pes/",
    "permalink": "/r/PESU/comments/136hm6a/internships_at_pes/",
    "score": 12,
    "created_utc": 1683112780,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jioufhx",
      "body": "Do you have to pay for this? Do they pay you? What is the arrangement like??"
    },
    {
      "id": "jioydzo",
      "body": "Bro see you can't really rank them. It doesn't work that way because it totally depends what you're interests are. Even if you don't have anything figured out, you can have a vague idea of what each centre will offer.\n\nAnd I'd say 'internship' is a glorified name for these summer projects. They are valuable and you choose accordingly. The technical centres will hand you a problem statement to work on for the next 2 months. Depending on the quality of the work, you may or may not be aiming for a research paper out of your project. At the end of the course, you'll recieve a certificate and yes you can get them credited (2 credits it'll be). \n\nOne more thing I'd say is that, as you're working on the projects, simultaneously try to expand your horizon at home. Learn many things and make the best use of the time. \n\nPersonally, I can vouch for IEEE RAS, C-IoT, CIE and ISFCR as I've experienced most of their work environment and it's pretty cool. Good luck to you!"
    },
    {
      "id": "jioyhsr",
      "body": "It is free to apply and as far as I know, you will not recieve any stipend. All you have to do is apply and if you get selected, work on the project that they assign you or pitch an idea that you have."
    },
    {
      "id": "jioyww2",
      "body": "How long are these internships for? Work remotely or do you need to be here in person with the group? What kind of tech support would you get?\n\nMany questions.. curious to understand how it works.."
    },
    {
      "id": "jiozl2a",
      "body": "Your work will mostly end by the third week of July. A few centres that ask you to pitch your idea will see whether your idea is feasible to finish in 2 months. There are a few cases I've seen where the work has extended till August but it is very rare. But a common point that I've seen is that the project work will be done by July but writing the research paper and publishing it can take some time. \n\nYou can work remotely but you will need to have regular meets with the guide they assign you. Some centres require you to build a physical model (IEEE RAS for example) and that requires you to travel to college. But mostly, you will have to visit college at least once a week to show your progress to your guides.\n\nFrom what I've seen, it's always going to be in a group. It's best if you and your friends apply together.\n\nThe guides will readily help guide you in the right direction if you're stuck somewhere. They will not spoonfeed you anything. They will drop hints that will help you understand what should be done.\n\nHope that answers your questions!"
    },
    {
      "id": "jip360n",
      "body": "They giving some stipend this time. So you will be paid little. And its all offline 9am to 4pm every weekday"
    },
    {
      "id": "jissox1",
      "body": "It depends on your interests(security means ISFCR might be a good choice) and some other factors (which professor? what exactly are you looking to get out of this internship?) but personally I'd recommend PIL"
    },
    {
      "id": "jiuwzy3",
      "body": "Back when I was in college, CCBD used to be really good with a lot of good research work being done. This was when KVS was still incharge, but apparently things have gone to shit now. Since I don't know about the rest, I'd recommend OP to take up PIL since they still have a great reputation"
    },
    {
      "id": "jj2at7l",
      "body": "Does the College offer any Paid internships?\n\nCurious"
    },
    {
      "id": "jj2fd8z",
      "body": "yes they do, but getting one is tough. Competition for it is very high"
    },
    {
      "id": "jj2px7e",
      "body": "I see. Is it solely based off GPA or?"
    },
    {
      "id": "jj3rdpi",
      "body": "No you have to submit your resume. So all your projects, achievements and research work matters. But CGPA is a major factor for shortlisting."
    },
    {
      "id": "jj62qrz",
      "body": "I see. Thank you"
    },
    {
      "id": "kz1rj87",
      "body": "hey can i ask how much it is exactly that they generally pay. did you get the internship?\n\nwhat was your experience and any thoughts. thanks, i'm in 4th sem now"
    },
    {
      "id": "kz2lwx1",
      "body": "I feel its pretty good, but external internship is worth it. Plus point you can publish a research paper and that will help to build your portfolio. They will pay for your publishing, depending on the lab you are paid differently. Avg - 7-10k Rs"
    },
    {
      "id": "kz2nucu",
      "body": "oh thanks. which one did you do finally. is it like you just sit there for the entire day working on your project?"
    },
    {
      "id": "kz8gr1w",
      "body": "I was part of CCBD (Center for Cloud Computing and Big Data) Summer Internship. \n\nAnd yes its exactly like that whole day you sit and work on your project. Ps - We used to work maximum 2 hrs per day and then just chill with friends, go sit in the canteen etc etc and talk. Not that stressful"
    },
    {
      "id": "kzchti9",
      "body": "oh great. hope i get one. can you get credits from it"
    },
    {
      "id": "kze1e4i",
      "body": "yes you will get credits, any mostly they give everyone who applies for it"
    },
    {
      "id": "kzeazkt",
      "body": "thanks a ton dude. how's placements and internships goint on. i heard they start coming from 6th sem right"
    },
    {
      "id": "kzew3qz",
      "body": "pretty good , i have already done 2 internships after CCBD and received a PPO, you can message me on DM , i can go in detail there."
    }
  ]
}