{
  "id": "13enfv6",
  "title": "Advice on time management",
  "content": "This 5 ISA system is wreaking me up. I have a lot of plans to learn new skills (CS as well as non-CS skills), I have bought many new courses to complete, but am finding absolutely 0 time for dedicating myself properly for self-improvement. I start up for about a week and then have to give up by the next week cause of ISA. This causes a break in my learning and I lose motivation to continue after ISA is over.\n\nAfter the coming of the 5 ISA system, how r u all managing time between academics and learning new skills? Can u suggest me some tips on how I can effectively manage time? Why isn't PES giving more free time to students unlike other colleges ?",
  "metadata": {
    "author": "Geekwalker374",
    "url": "https://www.reddit.com/r/PESU/comments/13enfv6/advice_on_time_management/",
    "permalink": "/r/PESU/comments/13enfv6/advice_on_time_management/",
    "score": 21,
    "created_utc": 1683811711,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jjql98d",
      "body": "Give less importance to isas"
    },
    {
      "id": "jjqmpge",
      "body": "I did that last sem and my sgpa was fked up. So only alternative is to focus on it, but at the cost of learning new things kind of seems unfair to me."
    },
    {
      "id": "jjqn8ny",
      "body": "yeah especially now this time, they’ve made each isa 10M instead of 7.5"
    },
    {
      "id": "jjqpzjv",
      "body": "It might help if you could do a lot of your studying in class itself. I don't mean you listen to class, i mean you should study at a much faster rate than the class. This shouldn't be much of a problem since they don't really do much\n\nThen you've got the rest to do whatever you want"
    },
    {
      "id": "jjqrqjk",
      "body": "Is there a student body that can tell the management ?"
    },
    {
      "id": "jjqs5in",
      "body": "Nope and they don't care."
    },
    {
      "id": "jjqsksx",
      "body": "I don't rlly know. Many ppl have complained about the 5 ISA system, so I think they know what's wrong. But no one seems to be listening. Especially for non-CS ppl, it kinda hurts because we need to have more options for our careers as core jobs r lower, the only way is to skill up, and our clg just doesn't seem to encourage us for that."
    },
    {
      "id": "jjr01t4",
      "body": "there has to be something we can do, \n\nit terrifies me how much free time people from other colleges have compared to us.\n\nthey even removed the mini project this semester.\n\nAs Computer Science grads, we need to increase our versatility and being limited to the syllabus just doesn't help at all.\nIf we did write a collective letter, how do you think that'd help?"
    },
    {
      "id": "jjr2qqw",
      "body": "This is something I've been wondering about for a while now. Is there no student council or something similar at all in PES?"
    },
    {
      "id": "jjr2zs1",
      "body": "These ppl want good name for their college and at the same time want to make it stressful."
    },
    {
      "id": "jjr83n5",
      "body": "There is a student council. DM me for more deets"
    },
    {
      "id": "jjrawrm",
      "body": "There is no amount of complaining which you can do to anyone that will bring about any valid change. This has been brought up a lot of times before for various reasons, especially during covid , but without any helpful change."
    },
    {
      "id": "jjrc35v",
      "body": " mini project was actually very helpful to learn better. Seriously something needs to be done."
    },
    {
      "id": "jjrkyxl",
      "body": "That would surely be a great idea ...\nWe can write the letter to mgmt"
    },
    {
      "id": "jjs1fsm",
      "body": "This system was introduced to my juniors. I graduated last year and spoke to the VC about how the 5 ISA system is killing students, and they have 0 time for anything else. His response was that it's supposed to train us for the corporate world and teach us time management because our future companies will expect that. BS response."
    },
    {
      "id": "jju0qz0",
      "body": "I've posted about this before but essentially the 5-ISA system isn't going to change soon. When it was first introduced, they did do some basic analysis on how people performed and on paper, it did lead to improved average CGPAs of the batch. Plus, placements weren't affected as well and they ofc attributed it to the change in the ISA system. So on paper atleast, it worked so the management stuck with it. Unfortunately practically it leaves you extremely drained out for anything else."
    },
    {
      "id": "jju0ylu",
      "body": "It isn't that people haven't tried lmao. You guys aren't the first to have this ISA system, it's been there since 2021 (if I remember correctly)."
    },
    {
      "id": "jjvv2ur",
      "body": "And then they blame us when the average for c isa is 9/20 after teaching so shit and giving minimal time for us to learn ourselves. Literally majority of the people in my class mugged up the linked list code for today's isa"
    },
    {
      "id": "jjxj4y4",
      "body": "Exactly... Literally everyone mugged it up ... I was like bro why whaat ... Are these people the future CS Engineers who are going to change the IT world?"
    },
    {
      "id": "jjxj8h7",
      "body": "Why can't we form one though?"
    },
    {
      "id": "jjxjbs2",
      "body": "Ig 2022 not 2021"
    },
    {
      "id": "jjxjl2g",
      "body": "But here the class average is dropping badly after every isa, like C average for ISA has dropped a lot"
    },
    {
      "id": "jjxjrjt",
      "body": "This is like \"Ideal gas conditions\" for me :("
    },
    {
      "id": "jk4oaqp",
      "body": "Wait what why?"
    },
    {
      "id": "jm6kh42",
      "body": "In case you meet him anytime soon, can you also tell him that there are students who are not job and placement oriented and would love it with the college wasn't so discriminatory towards us?"
    },
    {
      "id": "jm6u04z",
      "body": "I was not placement oriented."
    },
    {
      "id": "jm7d67o",
      "body": "They want people getting into \"dream\" and \"tier 1\" companies. That's how they get better placement statistics. I don't think they rly care and I honestly wish they did about inclusivity and a diverse (in terms of interest) student population."
    },
    {
      "id": "jm7ltwt",
      "body": "Same here. But the 5 ISA system is heavily oriented towards them. No free time for me to do anything like research."
    },
    {
      "id": "jm7m2lj",
      "body": "Yeah, well, in most people join PES because of its placements. And the management knows that placements is the only factor driving them forward. So obviously, placement oriented changes in the way college runs."
    },
    {
      "id": "jm7rucm",
      "body": "Tell me about it. Was burnt out throughout my last year and summer before 4th year cuz I was doing an internship (which I got thru the placement cell) and the department did not give me credit for that. \"Department Rules\" it seems. And also had to work on my capstone with a team that didn't do shit. \nIf they could care less about your mental well being, they would."
    },
    {
      "id": "jm7uli8",
      "body": "Damnnn, that’s rough. Things have gotten so bad that I have literally given up on trying in college. Also, what the heck is ‘Department Rules’? Now, I’m scared because I am doing an internship and I really want credits for it."
    },
    {
      "id": "jm7uzd6",
      "body": "These are rules cooked up by the HoD of a certain department. DM me I'll tell you the dept lmaoooo. \nThey're fake rules and will change at the whims and fancies of this HoD."
    },
    {
      "id": "jvpxdef",
      "body": "\r  \nI understand your frustration with managing your time effectively, especially with the demands of the 5 ISA system. It can be challenging to balance academics and personal development. Here are a few tips that might help you navigate this situation:\n\nhttps://youtu.be/zgpOhEHLb-A"
    }
  ]
}