{
  "id": "13fjkan",
  "title": "Does college give extra credit courses to increase gpa?",
  "content": "[deleted]",
  "metadata": {
    "author": "[deleted]",
    "url": "",
    "permalink": "/r/PESU/comments/13fjkan/does_college_give_extra_credit_courses_to/",
    "score": 5,
    "created_utc": 1683893984,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jjvjgas",
      "body": "Man, the best you can do is try to score well in exams. To answer your question, yes you can take up 2 credit courses in the 5th semester. Don't expect it to boost your gpa drastically tho because it's just 2 credits and it won't boost it by a large margin. Keep in mind that it's a double edged sword as if you don't score good in your 2 credit courses, it will bring down your gpa. \n\nDepending the electives you've taken, 5th sem will be comparatively easier than 4th sem except the L of a subject that is RISC-V. I'd suggest that you work a teeny bit harder for your isa and esa and perform well in them. \n\nA good thing about doing masters in US is that academics are not the only criteria. The SOPs that you will write to colleges will not be all about academics. I'd recommend doing extra curricular things (academic / non academic) to improve your CV. Hang in there man! You got this.\n\nEdit : missed a word"
    },
    {
      "id": "jjvni3d",
      "body": "Yeah not a problem"
    },
    {
      "id": "jjvwc2l",
      "body": "> A good thing about doing masters in US is that academics are not the only criteria\n\nWhile that is true, CGPA is a pretty important part of your application when you apply. With Uni's waiving off the GRE score now, more focus is shifting towards the remaining components. Especially if you are aiming for an MS right after BTech, your CGPA is one of the most important aspects. \n\nAlso, don't you anyway *have* to take up special topics in sem 5? It won't be an *additional* course right?"
    },
    {
      "id": "jjxnbtm",
      "body": "And which are scoring electives according to you , I've come to a point that I don't give a shit about the scope of industry related standards,I'm very desperate to up my GPA!!!"
    },
    {
      "id": "jkglqzs",
      "body": "Don't stress too much on CGPA and just focus on your coming exams. You might've fucked up in 3rd sem like we all did and it's fine. Your hardest ece sems are done. 5th sem is probably the easiest sem in ece if you pick the right electives. I'd suggest OFC and RTOS if it's available as it's very easy to get S and A in them as they're purely theory subjects and all my frnds and I got either S or A in both. 6th sem is also really chill and again choose Wireless communication if available for another easy A or S. 7th and 8th sem is also a good chance for boosting your cgpa of you do well in your capstone. Don't stress too much about your cgpa, it's just your first year in ece. The hardest part is done dw, just focus on your coming exams, it'll be fine"
    },
    {
      "id": "jkgm5y3",
      "body": "OFC and RTOS if that's available in Sem 5. There'll be a lot of fancy sounding electives like Artificial Neural Network and Digital Signal Processing but I wouldn't suggest them if you want an easy cgpa boost. OFC and RTOS are pure theory and almost everyone ik including me got S or A in both. In 6th sem chopse wireless communication if possible as it's just like OFC and purely theory"
    }
  ]
}