{
  "id": "13fra7j",
  "title": "7th sem details",
  "content": "Hello there! I'm currently writing my 6th sem ESA and would like to know how the 7th sem would work. I have the following questions,\n1. How many number of subjects will be there?\n2. Will the subjects be compulsory courses or electives?\n3. Will these subjects have course projects to be done and such?\n4. Will the classes be online/offline/hybrid?\n5. Since Capstone plays a big role in the 7th sem, how will the rough timeline look?",
  "metadata": {
    "author": "lazerwild165",
    "url": "https://www.reddit.com/r/PESU/comments/13fra7j/7th_sem_details/",
    "permalink": "/r/PESU/comments/13fra7j/7th_sem_details/",
    "score": 5,
    "created_utc": 1683911967,
    "flair": "Study Help :table:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jjwdq0w",
      "body": "1. 3 special topics\n2. Special topics, so 2 credits each\n3. Usually there is no assignment or project, worst case there is an assignment\n4. 2021, 2022 and 2023 batches had it online, but before that (before COVID), they used to be offline. Which mode PESU chooses is anyone's guess.\n5. You need to ensure you finish all capstone related work by December, since 8th sem is for writing and publishing the paper on your work. Similar to 6th sem, you will have regular reviews."
    },
    {
      "id": "jk02j6a",
      "body": "three subjects which are of 2 credits each and your capstone project.. except for 1 or 2 electives all others are online and all are compulsory. Choose your electives wisely.. if u want to know more dm me..(i am currently in 8th semester..)"
    },
    {
      "id": "jm6k22j",
      "body": "Wait, 7th sem is 16 credits, of which 6 are for capstone, and 10 for special topic courses. Doesn't that mean that it's a total of 5 courses?"
    },
    {
      "id": "jm6opdo",
      "body": "Ah yes, you're from the newer batches. You didn't have special topics before unlike the last few batches, so you'll need to cover up now. Good luck lol"
    },
    {
      "id": "jm6qc4z",
      "body": "I have 4 credits from CIE. That counts, right?"
    }
  ]
}