{
  "id": "13hxx9e",
  "title": "When is the graduation for the final years going to be?",
  "content": "Title^",
  "metadata": {
    "author": "Crazy-Common3317",
    "url": "https://www.reddit.com/r/PESU/comments/13hxx9e/when_is_the_graduation_for_the_final_years_going/",
    "permalink": "/r/PESU/comments/13hxx9e/when_is_the_graduation_for_the_final_years_going/",
    "score": 8,
    "created_utc": 1684126048,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jk7fi7f",
      "body": "Usually happens in July, but our batch (2022) had it in September."
    },
    {
      "id": "jk7gbar",
      "body": "I see, thanks!"
    },
    {
      "id": "jkat1a5",
      "body": "What was the graduation like? Was it a big event?"
    },
    {
      "id": "jkbreds",
      "body": "I'd say it was okay, a little all over the place and fine-ish. Since the entire batch was graduating on the same day (all branches, both campuses), it was held simultaneously at GJB and MRD. You didn't know at what time you'd go on stage and which place before the event, so you couldn't inform your parents either. A lot of them like mine didn't get to see me walk up on stage to get my degree. RR CSE went first, so mine was done pretty quick, but if you were in something like ECE then you'd have to wait till almost 2-3 pm. It's an entire day event, but once you're done collecting your degree you can leave lol.\n\nYou can watch a bit of it [here](https://youtu.be/xtJbnCfCYbY)"
    },
    {
      "id": "jkmdjk1",
      "body": "Ahhh nice, Thanks for the vid lol."
    },
    {
      "id": "kemf1sd",
      "body": "What if we can't make to the convocation?"
    },
    {
      "id": "kemlbrn",
      "body": "You can always collect your degree later"
    },
    {
      "id": "kemniwt",
      "body": "ohh okay. Also does everyone get the same medal regardless of the cgpa or different lol. Just curious."
    },
    {
      "id": "kemqtik",
      "body": "Branch and batch toppers get a special certificate and medal along with the degree. Everyone else gets just a degree."
    }
  ]
}