{
  "id": "13lqs6h",
  "title": "CS Minors",
  "content": "I'm a second year EE student, so all the internships from various centres (CCBD, CDSAML, etc) wouldn't be applicable for me (because the mails were sent out to CS students only and on opening the Google form, there was no option for choosing department) unless I go up to them and show them I'm better than CS students (which I'm not).\nSo I'm planning to do 2 CS Minor courses in the summer, and I have a couple of questions-\n\n1) This is a question that's been asked often, but how valuable are the minor courses? Are they worth doing over any internship, or is it better to do an internship, and self learn CS concepts?\n2) How valuable are the credits? Is it just for namesake or will they actually count?\n\nI have already taken up DSA in 4th sem, and I'm wondering whether to continue or not, because I keep feeling that doing minor courses while others are doing internships puts me at a disadvantage. I don't have any projects/work experience that I can put on my resume as well. \n\nWhat would be the best steps that I can take from now?\n\nTIA, any inputs will be much appreciated :)",
  "metadata": {
    "author": "blazingassassin18",
    "url": "https://www.reddit.com/r/PESU/comments/13lqs6h/cs_minors/",
    "permalink": "/r/PESU/comments/13lqs6h/cs_minors/",
    "score": 7,
    "created_utc": 1684489702,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jksc84d",
      "body": "I answered most of your questions [in my previous comment related to this](https://www.reddit.com/r/PESU/comments/ycg6s5/comment/itm59c7/?utm_source=share&utm_medium=web2x&context=3).\n\nThat said, if you are interested, do pickup skills you are interested in. You will get the credits if you get a CS Minor, but its grade and GPA are counted separately, so it will not affect your Major CGPA. Its fine if you don't get into those clubs now, they will also recruit next year. If you want, you can even work with a professor at the University and it would be almost equivalent to those research clubs (given you work hard enough and do well)."
    },
    {
      "id": "jkshod8",
      "body": "Alright, thank you so much for your advice!"
    }
  ]
}