{
  "id": "13mos50",
  "title": "Hey Confused on what to choose PESU- CS-RR Campus thru pessat or Manipal main campus CS",
  "content": "\n\n[View Poll](https://www.reddit.com/poll/13mos50)",
  "metadata": {
    "author": "mind2soul",
    "url": "https://www.reddit.com/r/PESU/comments/13mos50/hey_confused_on_what_to_choose_pesu_csrr_campus/",
    "permalink": "/r/PESU/comments/13mos50/hey_confused_on_what_to_choose_pesu_csrr_campus/",
    "score": 5,
    "created_utc": 1684580224,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jkw624w",
      "body": "Manipal way better"
    },
    {
      "id": "jkw95hx",
      "body": "CS RR is the biggest competitive cess pool I've ever seen"
    },
    {
      "id": "jkwcczg",
      "body": "Nobody in the PES subreddit is gonna recommend PES to you mate"
    },
    {
      "id": "jkwcyyk",
      "body": "Go to Manipal,GO TO MANIPAL\nDon't look back,RUN"
    },
    {
      "id": "jkwd46c",
      "body": "🙃 what about manipal blr ?"
    },
    {
      "id": "jkwduh0",
      "body": "Why?"
    },
    {
      "id": "jkwesyk",
      "body": "Nope. Don't ever go to Manipal Bangalore. Atleast not now"
    },
    {
      "id": "jkwjjdz",
      "body": "I do not know about Manipal but PES is fcking stressful if u want to come to prison daily then select PES."
    },
    {
      "id": "jkwjo7k",
      "body": "TRU as they are suffering as hell"
    },
    {
      "id": "jkwk0ck",
      "body": "But PESSAT is still not over right?"
    },
    {
      "id": "jkwlvwc",
      "body": "TLDR is it's a pretty shit place to be in right now. For a longer answer just scroll through all the recent posts"
    },
    {
      "id": "jkwoxyn",
      "body": "Experience"
    },
    {
      "id": "jkx07vi",
      "body": "I am from PES and I have friends in Manipal. I would recommend Manipal ."
    },
    {
      "id": "jkx0ew1",
      "body": "Why do u want bangalore da ? The Manipal campus in Manipal is really huge, green and awesome unlike any of the campuses in bangalore city."
    },
    {
      "id": "jkx0pb9",
      "body": "Reasons :\n\n(i) Less stressful curicullum.\n\n(ii) Way better campus.\n\n(iii) College life is better. They have some kind of activity going in the college everyday ! \n\n(iv) Student projects in Manipal are really awesome ."
    },
    {
      "id": "jkx9ovq",
      "body": "Being from the ‘24 batch, I can say our seniors had a good time but now I wouldn’t recommend anyone to take CSE unless that’s the only option.  \nIn short, Manipal > Pes for CSE"
    },
    {
      "id": "jkxsqd6",
      "body": "Go to Manipal. Run from PES please."
    },
    {
      "id": "jkyal16",
      "body": "I am getting CCE in Manipal Jaipur, should I consider that? The only options I have are Manipal Jaipur CCE and SRM KTE CSE core"
    },
    {
      "id": "jkzn199",
      "body": "Is it going to be bad from cse placement perspective too?"
    },
    {
      "id": "jkzvgvp",
      "body": "See I’ll tell you why it’ll be hard in future. Right now we have around 750 students in CSE in just RR campus. As the new building starts functioning then it will cross 1000+ students for CSE in RR. Now the number of companies that come every year to hire students aren’t increasing as the batch size is increasing. Each of these companies have a fixed pool of students to hire, just because PES increases intake, companies can’t do the same xD.\n\nThis dilutes the quality as well, to give a statistic, the number of students in 2022 batch who has internships were 132, and for my batch it came down to just 86, that too a few applied off campus in that. There are a number of reasons for this, but expect that quality has dipped, intake is high, college isn’t giving you time for what’s needed, so placement is gonna be stressful. This is my PoV"
    },
    {
      "id": "jkzvxxa",
      "body": "Thank you so much!! Is bmsce msrit cs/ IS  better?  I am giving my pessat tomorrow 💀"
    },
    {
      "id": "jl08f7h",
      "body": "And it's not just RR, even ec campus placements r pooled together right... There r still so many unplaced guys"
    },
    {
      "id": "jl08juu",
      "body": "Way better from the competition perspective... Their placements for 2023 batch also has been really good... So many companies like amazon, amagi, adobe and all which skipped pes have gone to even bmsit and taken students from there"
    },
    {
      "id": "jl0boh2",
      "body": "Oh wow i thought bmsit is lower ranked. Pes by my batch '27 will be worse I think. Thank you btw!"
    },
    {
      "id": "jl0btj1",
      "body": "Bmsit is lower ranked. I mean the overall placements in pes might be better, I'm talking about specific companies here... And Yaa, if it keeps going like this then it is gonna get way worse."
    },
    {
      "id": "jl0iyo6",
      "body": "I'm not too sure about that. Though I've only heard negative opinions on SRM. \nYou may enquire more on other subreddits"
    },
    {
      "id": "jl1i9hd",
      "body": "It's not that bad, people in this reddit scared me too when I joined PES, I was sad after reading all the comments on the subreddit, I have seen how people rant and I think it is spreading like a wildfire now, new people also start ranting cuz others are ranting about it. Nobody's gonna talk about the good things that's happening, If there's an addressing and new implementations been made, I have never seen people appreciating the good ones, people always pick something to rant about. I think it's because most people like to play the victim. \n\nIn short I agree it's not as good as advertised but it's definitely not as bad as people portray it here, and this is from my experience."
    },
    {
      "id": "jl2272v",
      "body": "What do you think about the placement and internship scenario? Heard very few people get in good companies due to the huge student ratio"
    },
    {
      "id": "jl2ig4x",
      "body": "I still have to write pessat but I’d choose manipal main campus cse anyday"
    },
    {
      "id": "jl750wg",
      "body": "It's difficult to say if it's better - there are a lot of other factors which are subjective in nature that will determine that. Objectively, yes PES CSE will fetch you better placements but there are it's downsides as mentioned in this subreddit previously"
    },
    {
      "id": "jl7599z",
      "body": "Not sure which batch you're referring to but a lot of it is down to the hiring freeze across the world. For my batch both Amazon and Adobe recruited students, and as far as I know these companies visited for the 2023 batch as well."
    },
    {
      "id": "jm5vd8t",
      "body": "Hey how was pessat?"
    },
    {
      "id": "jm5wj30",
      "body": "Same level as comedk this year"
    },
    {
      "id": "jm5wsez",
      "body": "Hmmm. I wrote the second shift and it was quite a bit easier. How was English btw?"
    },
    {
      "id": "jm8vl3b",
      "body": "The 2023 batch, Amazon technically did come and ask for registrations, but then didn't even conduct test and sent a mail saying not hiring rn. Even adobe did the same I think."
    }
  ]
}