{
  "id": "13njt49",
  "title": "CDSAML Query",
  "content": " I had a few queries regarding the CDSAML internship.\n\n1)How many credits is this internship for?And will we only get the credits after publishing the paper?\n\n2)Approximately what is the stipend range for this internship?\n\n3)Can we choose our own projects , guides and teammates or will we be assigned all of this?Cause I was interested in completing my capstone under cdsaml.\n\n4)Is it worth doing compared to other internships at PESU such as ISFCR etc.?",
  "metadata": {
    "author": "Basic_Ad_900",
    "url": "https://www.reddit.com/r/PESU/comments/13njt49/cdsaml_query/",
    "permalink": "/r/PESU/comments/13njt49/cdsaml_query/",
    "score": 3,
    "created_utc": 1684646422,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jm20gaw",
      "body": "1) You will get 2 credits, but you may or may not be able to claim it based on which sem you’re in. If it’s the internship after 3rd year you will most likely be able to claim it either in 7th or 8th sem.\n\n2) Atleast when I was there (2021 summer) nobody received any stipend.\n\n3) Teammates yes, guides they should be willing to take you on as well but to that extent yes. In terms of choosing your project you’ll have to come to an understanding with your guide. Sometimes the guide will have ideas they’ll want to implement, sometimes if your proposals are good they’ll give you the freedom to work on that. You will be able to complete capstone again depending on which year you are in and if your guide is happy with your work.\n\n4) Right now no internship in PESU is really “worth it”. All the top profs in these labs are gone and these labs aren’t even funded by top places like Microsoft anymore. If your goal is to get a good publication, it depends on you, but it’s possible, that’s it, but you can get that from capstone anyway regardless of which prof you do it under. You won’t get any industry contacts or anything fantastic to put in your resume or anything."
    }
  ]
}