{
  "id": "13nlkl8",
  "title": "Hello looking to join pes ec how social is it",
  "content": "I just wanted to know how is the crowd i know pes is mostly academic focused but just wanted to know if people are willing to meet outside the campus and have some fun go out and stuff during holidays and vacas",
  "metadata": {
    "author": "Maleficent_Glove_174",
    "url": "https://www.reddit.com/r/PESU/comments/13nlkl8/hello_looking_to_join_pes_ec_how_social_is_it/",
    "permalink": "/r/PESU/comments/13nlkl8/hello_looking_to_join_pes_ec_how_social_is_it/",
    "score": 7,
    "created_utc": 1684652166,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jl04hui",
      "body": "This is a very subjective question. What is fun for you might not be fun for others and that's completely okay. It also obviously depends on the type of friends you make, whether they're introverted or more outgoing in nature. At the end of the day it's a University and you're going to meet people from different backgrounds with varying personalities. You can't generalise and say that \"this campus is less social\", it is completely on how social you are and the type of friends you make."
    },
    {
      "id": "jl0tmz9",
      "body": "Ppl here are quite heavily academically oriented, but that doesn't mean there isn't good social life. We currently have a hectic 5 internal assessment system where u need to give 1 internal assessment every two weeks, but I think they're gonna change it from now onwards as alot of ppl are complaining about it, they recently merged two exams for us. So if that happens, ull get more time for having a good social life. It's pretty competitive, but not as much as cse. There's good prospects for doing good projects.  So choose wisely. U'll find ppl from diverse backgrounds, so u can surely have a good peer group here."
    },
    {
      "id": "jl0vzsz",
      "body": "Yea tru thq"
    },
    {
      "id": "jl0w224",
      "body": "Damn hope they do change that"
    },
    {
      "id": "jl19oni",
      "body": "they've only merged isa 4 and 5 due to pessat '23 going on in rr campus so don't get your hopes up"
    },
    {
      "id": "jl1hxg8",
      "body": "They also did it cause a lot of ppl were missing classes to study for ISAs, so very few ppl were attending classes. Also parents were complaining that the 5 isa system is very stressful and teachers were finishing syllabus on the day of exam. So it might change, but it's not confirmed"
    },
    {
      "id": "jl4l4fa",
      "body": "Don't."
    },
    {
      "id": "jl4qpfb",
      "body": "They did change it after all"
    },
    {
      "id": "jl5x2ym",
      "body": "they have changed it. Reverted back to the old 3 ISA system!"
    }
  ]
}