{
  "id": "13ol76d",
  "title": "PES at 3.5k rank?",
  "content": "[deleted]",
  "metadata": {
    "author": "[deleted]",
    "url": "",
    "permalink": "/r/PESU/comments/13ol76d/pes_at_35k_rank/",
    "score": 7,
    "created_utc": 1684745445,
    "flair": "PESSAT",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jl4wnhm",
      "body": "You will get cs at least in Ecity"
    },
    {
      "id": "jl4xhkr",
      "body": "Are you in PES too? Do you recommend PES?\nI will probably get into BMS information science at my rank and reservation.... so I'm confused"
    },
    {
      "id": "jl4xq6k",
      "body": "I was in pes for 1 day lol I couldn't travel everyday from my home so I left , so I'm not sure , there is a senior called rowlettowl username he can definitely help you,  I had joined thru pessat, but personally I think pes is really good but it's hectic af like rv \nMsrit and bms is chill \nBms over pes ecity but if you're get pes rr campus better ask someone else"
    },
    {
      "id": "jl5a66y",
      "body": "If a good placement is your only goal then only join pes , if you want a balanced college experience with less hectic schedule then join BMSCE."
    },
    {
      "id": "jl5g3mm",
      "body": "If I were you, I'd compare the syllabus of the two branches first and choose the one I'm more inclined towards. If you don't see any particular inclination towards either, then you're going to have to compare between the two colleges. On one hand if you're at PES, you'll have great placements for CSE, but you'll have to live 4 years in misery with minimal college life, constant academic stress and workload, and brain-dead management running the place. From whatever I know about BMSCE, the placements might not be on par with PES but will surpass PESU on most other factors like campus and college life. Since nobody here can answer about their college life, you should ask students from that college for accurate answers. After getting all the information, weigh the pros against the cons of each University and pick the one that suits you best. Good luck."
    },
    {
      "id": "jl68i37",
      "body": "Got into PES rr campus cs for 3.2 with reservation and I had the option for bms information science too\nI don't know much about bms but I definitely do not regret joining PES"
    },
    {
      "id": "jl68onx",
      "body": "Ok man , thanks a lot"
    },
    {
      "id": "jl68tej",
      "body": "Bruh............ you'll get below 1.5k. You'll atleast AIML in 2nd round sure."
    },
    {
      "id": "jl68w12",
      "body": "Can you please tell me what reservation you had if you're comfortable sharing?"
    },
    {
      "id": "jl6cyip",
      "body": "Obc"
    },
    {
      "id": "jl6d28a",
      "body": "Ok man ,thanks a lot 👍"
    },
    {
      "id": "jlknr2u",
      "body": "Would u prefer aiml in rr or cs at ec campus(ig both campuses have placement together) if u do not get cs at rr"
    },
    {
      "id": "jll4jod",
      "body": "ok thx for telling aiml u shd most likely get tho"
    }
  ]
}