{
  "id": "13r8sg7",
  "title": "Backlog help",
  "content": "How much do we need to score in backlog subject to pass. Is it the same as normal subject or is there a special cutoff for it? Also , will the qp be harder / same compared to that of normal ones. \nThank you for help!",
  "metadata": {
    "author": "Kepler70B",
    "url": "https://www.reddit.com/r/PESU/comments/13r8sg7/backlog_help/",
    "permalink": "/r/PESU/comments/13r8sg7/backlog_help/",
    "score": 5,
    "created_utc": 1684992069,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jljbezr",
      "body": "For backlog ur internals won't be considered, only the paper u will be writing will be considered. It will be for 100 marks, if u get 100/100 u get S grade. So u will need to score atleast 40 marks to get an E grade and pass. From what I have seen backlog and main exam papers are more or less of similar difficulty."
    },
    {
      "id": "jljblf6",
      "body": "What ? That's so difficult T_T . How are we supposed to do that ."
    },
    {
      "id": "jljdhv7",
      "body": "Prepare from previous papers, nothing else u can do. Btw that's what I saw for mechanical and physics, I don't know about other subjects. If u just want to pass, prepare well from two units, if u want more than that then prepare well from 3-4 units. Backlog papers r available on PESU OPAC, so check those out"
    },
    {
      "id": "jljexpn",
      "body": "Okay, thank you for the information!"
    },
    {
      "id": "jlk5jk5",
      "body": "Passing is 35, not 40. The difficulty of the paper depends on your luck. People say that if you write a backlog paper with that current batch (Eg: you have a backlog in a 3rd sem subject and you take it up during the ESA of an odd semester) it will be a bit challenging because you'll write the same paper that they do. Based on the timing of your post, I'm guessing you're writing the paper in the summer. The paper should not be extremely difficult, expect it to be around the same level as pyqs but a tiny bit easier. Watch out for any changes in portions. College people are too lazy to account for that when they set a paper for you. \n\nAs the other commentor pointed out, your internal marks will not be counted. If you are from ECE, feel free to to dm me and I can help you out. Goodluck to you!"
    },
    {
      "id": "jlk737n",
      "body": "Thank you ! Yea writing it tomorrow. Hopefully it won't be impossible as u told. This is a new subject, isn't there in previous year's papers too. Thank you again!"
    }
  ]
}