{
  "id": "13sjifl",
  "title": "Interesting Observation!!",
  "content": "[deleted]",
  "metadata": {
    "author": "[deleted]",
    "url": "",
    "permalink": "/r/PESU/comments/13sjifl/interesting_observation/",
    "score": 16,
    "created_utc": 1685122607,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jlqoiut",
      "body": "2022 grad here. \n\nDo I regret joining? No - I didn't have any better options when it came to CS (and I absolutely wanted CS, for me branch > college in a heartbeat) due to various reasons/factors. But this place does have a myriad of problems that you'd only discover after you join. \n\nThese problems have been discussed at great lengths before so I'm not going to repeat it - as you said you've personally seen it. PES looks beautiful from the outside as a 12th grader - amazing placements from a University in Bangalore - but you only start seeing the gaping holes from the inside. From your first week here, it's going to be a shocking revelation after the other when it comes to teaching quality, facilities, management etc. All it takes is a few weeks, at most months, to get sick of this place and wish you'd joined somewhere else. Just ask the current first years - apparently there are a good number of students dropping out because they can't take it anymore. \n\nPES has beautifully camouflaged all these issues with its brand name (which again is completely based on placement numbers for CS) which paints a very false and glorified image of the University. I know that grass always seems greener on the other side, but this place doesn't have any grass worth comparison. If you do have options, please consider them seriously. If not, good luck for your next 4 years here."
    },
    {
      "id": "jls7hmu",
      "body": "No matter how much we shit on this college, we all know that deep down we have a soft spot for it. It is not a bad college by any means, it's just dumb."
    },
    {
      "id": "jls7zq9",
      "body": "A simple answer can be\n\n\"A college that prioritises education and its brand name over students\"\n\nIt's not bad, it's not great either :)\nIt's just that PES's subreddit is very active and hence you have these negative comments, however i have interacted with multiple other college peeps, they too face similar issues xD"
    },
    {
      "id": "jlsantx",
      "body": "People won't come here rejecting IITs, NITs. I'd still choose PES in KCET counselling over the other Bengaluru colleges. There's a lot of things going well and smooth in the college and you won't find a single post or comment about it. I think you should take that as a sign, The subset of people in this subreddit do not represent the whole of PES. I vividly remember when I joined, I had to leave my home for the first time and stay in hostel and I used to check reddit posts and all other things about the college, made me very sad, I thought I shouldn't have joined here and on top of the homesickness hit me hard. But it's definitely not as bad as portrayed here, Me and all my friends have a lot of fun, we go out almost every week. When you search a college through internet you'll see youtube videos and this subreddit, And would make a decision based on this. But this subreddit is heavily biased against PES, I remember people started ranting about teachers, but my experience so far has been quite nice. Teachers here are friendly open minded and have a sense of humor. People here ranted about the 5 ISA system but when all the classes had polls about which system they'd prefer, most of the classes voted for the 5 ISA system in majority. The syllabus is good here, you won't learn some outdated stuff, the assessments are based on learning as more of application based questions will be asked. There'll be hackathons going on almost every week, Nobody talks about all these."
    },
    {
      "id": "jlse6ol",
      "body": "I agree with most of what you said, but there are a few things I don't:\n\n1. I'm sorry but if you think the present professors are nice then you're really unlucky to have missed out on the actual quality that used to be there. Professors have been leaving left right and centre and the faculty that made the CS department what it is today have all left because of the management. The profs today are a mere reflection of what used to be.\n2. Syllabus isn't outdated but for a lot of courses they could be planned better. Our batch faced a lot of issues with 2nd and 3rd year course syllabi where courses skimmed over topics just to remain \"updated\".\n3. Hackathons every few months >>> Hackathons every week. There has been a massive drop in the quality of these hacks and the projects being displayed.\n\nRest I agree - the people here are amazing and I've found lifelong friends and companions too. As someone else also commented, this place is just dumb and doesn't learn from its mistakes."
    },
    {
      "id": "jlsfltn",
      "body": "Fair enough, your points seem valid."
    }
  ]
}