{
  "id": "13sop5q",
  "title": "I got 257 in boards and around 70 in KCET. What's my expected rank?",
  "content": "I'm interested in opting for ECE. According to some rank predicting videos I saw on yt, my expected rank is around 30k. Based on that rank which college can I get into?\n\nPS: I'm not writing any other exams nor can I go for management seats. Ik that I've really messed up. But any sort of advice would be appreciated.",
  "metadata": {
    "author": "Curious_Nerd69",
    "url": "https://www.reddit.com/r/PESU/comments/13sop5q/i_got_257_in_boards_and_around_70_in_kcet_whats/",
    "permalink": "/r/PESU/comments/13sop5q/i_got_257_in_boards_and_around_70_in_kcet_whats/",
    "score": 6,
    "created_utc": 1685135676,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jlrqcb6",
      "body": "same place as u rn\n\nlets see how this goes! no websites can be trusted... ive been getting really wild estimates from so many websites and ppl\n\ni rly want comp sci, maybe even in a 3rd tier college is also fine\n\nlets see how this turns out"
    },
    {
      "id": "jlsl42t",
      "body": "DM me your marks, I will help you out!"
    },
    {
      "id": "jlsl6ct",
      "body": "dm me your marks boards& kcet(pcm) i will help you out!"
    },
    {
      "id": "jlt6joi",
      "body": "Yea man. According to one video, my expected rank is 50k and according to another it's 25k. We can't trust any of them.\n\nI hope you get what you want. Good luck with it. If your marks are similar to mine, you'll get into a good tier 3 college dw.\n\nKeep me posted about this if you can. I'm not in contact with any other KCET 2023 students. So it'll be helpful."
    },
    {
      "id": "jlt6tj6",
      "body": "yeah sure man!! All the best for ur other exams, and future!!\n\ni got 252 in cbse board, and i got 78 in kcet\n\ni will definitely keep in touch with u!"
    },
    {
      "id": "jlunfid",
      "body": "Can I do that too?"
    },
    {
      "id": "jlwe172",
      "body": "Well obviously yeah duh!"
    },
    {
      "id": "jmps874",
      "body": "I'm kinda in the same situation with 67 in kcet and 257 in my boards...predicting around 30k as my rank but not sure...hoping for a ece in a decent college at least😭"
    },
    {
      "id": "jmr9pgv",
      "body": "Ok we've way to many similarities lol. We've same marks in boards and similar marks in cet and we both want to take ECE.\n\nAnyways, all the best bro. Keep me posted about your rank, which college you join and all."
    },
    {
      "id": "jmv5qxu",
      "body": "hey"
    },
    {
      "id": "jmvhgfj",
      "body": "Hi"
    },
    {
      "id": "jmybg5g",
      "body": "I just asked a guy on Reddit for the probable range of my ranking...he told me its around f 15-20k...I just hope this is true lol"
    },
    {
      "id": "jmz6iqo",
      "body": "That's only possible if the paper was difficult to everyone that wrote the exam. Or else, I think the chances of it happening are really really low.. I hope it's true ofcourse, since my marks are similar but we need to have realistic expectations."
    },
    {
      "id": "jmzk3z4",
      "body": "i do think the paper was difficult to MOST of the candidates...Just hope for the best rn;))"
    },
    {
      "id": "jmzkfl9",
      "body": "Yea man, that's what I'm doing too. We'll get to know our ranks in about 6 days so all the best!"
    },
    {
      "id": "jo72p5t",
      "body": "I got 55k bro wtf this isn't real😦"
    },
    {
      "id": "jocjbav",
      "body": "I got 50k. Just 3 marks difference between 50k and 55k 💀\n\nWhat have you decided to do now?"
    },
    {
      "id": "jofp6j5",
      "body": "I actually ended up getting 69 man...so 1 mark and a 5k difference...anyway what's you're plan from here"
    },
    {
      "id": "jog8k8r",
      "body": "I too ended up getting 72. But still 3 marks causing the rank to drop by 5k is crazy. \n\nI've no other options other than kcet. So I'll just join whichever college I get into and focus on improving my skill set. What about you bro?"
    },
    {
      "id": "jol4asn",
      "body": "im planning on joining christ for cse and also going for counselling to see if i get a better seat...rn even christ isn't sure shot so really anxious;("
    },
    {
      "id": "jowsnao",
      "body": "I feel like you're going to get Christ. There shouldn't be any problem with that. Anyways, all the best bro. Don't worry too much, you're going to get into a college no matter what.\n\nAnd since you're opting for CS, you don't need to worry about which college you're going to get into. Because everything you need to learn is already available on the internet. You just need a laptop and you should know where to look for stuff. So just focus on improving your skills. You're going to be fine."
    },
    {
      "id": "l1rme1j",
      "body": "How did it go bro?? What rank did u get"
    }
  ]
}