{
  "id": "13t1feb",
  "title": "PESSAT Scholarship",
  "content": "1. Hey guys so I'm writing PESSAT tomorrow and wanted to know if PES gives any scholrship/discount on fees if you score a goo rank? Or is it that 4.5LPA standard for rank 1 or rank 1000?   \n\n\n2. And I read about scholarships on the official page about top 20% getting 40% off on tuition fees. How realistic is it to get it? Like I am decent in PCM aspect but above average in CS since school so how hard is it to achieve that?  \n\n\nPlease help thanks !",
  "metadata": {
    "author": "InterestingHamster56",
    "url": "https://www.reddit.com/r/PESU/comments/13t1feb/pessat_scholarship/",
    "permalink": "/r/PESU/comments/13t1feb/pessat_scholarship/",
    "score": 5,
    "created_utc": 1685174183,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jlsta5b",
      "body": "Cfbr"
    },
    {
      "id": "jlsurs4",
      "body": "Im not being pessimistic but you should post this after u get the results. Focus on doing well and I wish you all the very best for your exam tomorrow."
    },
    {
      "id": "jlsved9",
      "body": "Thanks a lot for your wishes!\n\nThe thing is I've already revised NCERT for chem and my jee notes for math and phy and got nothing to do now lol but yea ill come back to this after i've written the paper."
    },
    {
      "id": "jlswdjr",
      "body": "You don't get scholarship for your rank but you get scholarships for your performance in college,you can get between 40-50% depending on how well you do in college"
    },
    {
      "id": "jlswkff",
      "body": "1. During my PESSAT 5 years ago, there were no scholarships for top performers in PESSAT. Top performers were however given some form of *prize*, not a scholarship. They could've introduced it now, I can be mistaken about this but you should confirm with someone from the current first year.\n2. It's branch wise. If you're in CS, then the top 20% of 600 (it was 600 for my batch, it's probably close to 800 now but let's use this as an example number) so the top 120 get scholarship. Every semester this changes based on how people do, if a semester is easy then the person with the lowest CGPA to get the scholarship can go up to even ~9.4, but if it's very difficult it can fall to ~8.5. Usually getting a 9+ is a guaranteed scholarship, 8.7+ is about 60-70% chance."
    },
    {
      "id": "jlsxphj",
      "body": "oh okay got it thank you !"
    },
    {
      "id": "jlsz6bj",
      "body": "Top 10 apparently get full 4 year scholarship. But after that it's 4.5lpa for everyone afaik"
    },
    {
      "id": "jlt1esi",
      "body": "Afaik there is no fees reduction for the top ranks in pessat . During your course you do have 3 types of scholarships available for the general public :\n1. CNR Rao scholarship : Top 5% if I have not mistaken get 50% of their semester fees back \n2. MRD scholarship : Top 20% get 40% of their semester fees back.\n3. DAC scholarship : If you are able to score 7.75 gpa in a sem you get 1000 rs \n\nTop 20% refers to the top 20% gpa holders in your cycle/semester (If physics cycle has 500 students then 20% are the top 100 students in terms of sgpa). Note that this top 20% even includes KCET (I heard they have some trust payment to be made to be included) and Management students . Generally a sgpa of 9.2+ should suffice for MRD scholarship but again it depends on the overall performance of the batch."
    },
    {
      "id": "jlt1nav",
      "body": "Scholarship is based on performance in college, not PESSAT rank. There are three types of scholarships - Prof CNR Rao scholarship, which is given to top 5% and is worth 25% of ur fees (per sem), MRD scholarship which is given to top 20% and distinction scholarship, which is about 1000/- given to anyone who scores 7.75 and above sgpa. U can only get one of these scholarships based on ur performance and ranking."
    },
    {
      "id": "jlt4hat",
      "body": "Oh okay got it so its semester wise instead of year wise , thanks a lot !!"
    },
    {
      "id": "jlt4udo",
      "body": "Thanks a ton for this explanation I'll refer to this post again after PESSAT counselling is over and the college starts !"
    },
    {
      "id": "jltbjhg",
      "body": "well if u have time to post this and reply to all comments u are not getting anything dw"
    },
    {
      "id": "jnd8fnp",
      "body": "Thanks man , this is the motivation I needed. Your comment hurt my ego and made me study for some two hours. Got <500 rank !!!"
    },
    {
      "id": "ktvq5c0",
      "body": "Hey can I dm u as I'm gonna write pessat this year , I need guidence."
    },
    {
      "id": "l4ogm1q",
      "body": "Is this truee?? I got a pretty decent rank in pessat (under top 10)"
    },
    {
      "id": "lkau7wl",
      "body": "Can a guy who took re-admission in the same branch get scholarship from sem-3 in PES?"
    },
    {
      "id": "lzopem9",
      "body": "Can you tell about loyalty scholarship?"
    }
  ]
}