{
  "id": "13u07wu",
  "title": "What are some of \"crazy pesu stories\" that the freshers don't know?",
  "content": "(title)",
  "metadata": {
    "author": "4our20wentyLOL",
    "url": "https://www.reddit.com/r/PESU/comments/13u07wu/what_are_some_of_crazy_pesu_stories_that_the/",
    "permalink": "/r/PESU/comments/13u07wu/what_are_some_of_crazy_pesu_stories_that_the/",
    "score": 8,
    "created_utc": 1685279729,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jlxxcwt",
      "body": "Once there were 2 isas,"
    },
    {
      "id": "jly2ks6",
      "body": "And that is gonna be back"
    },
    {
      "id": "jly5xyn",
      "body": "Quite a few things have changed and I don't think these count as *stories*, but here's what's off the top of my head:\n\n1. The old VC was a really nice dude, everyone liked him\n2. Someone commented before - we used to have 2 ISAs every semester, they used to be much harder than the present ones and could tank your entire GPA if you screwed up one lmao\n3. There used to be some payment/wallet linked to your ID card which was accepted on campus. This was before my time but when I had joined there were banners/posters etc of this in various places like the parking lot with the hashtag #PESUCashFree or something.\n4. The campus used to be lush and green, lots of trees, grass lawns etc - just compare images a few years ago to today, and for a real surprise look 8 years ago\n5. There used to be an authorised PESU merch store on campus that sold tshirts and mugs. This was before my time as well - you can find images of this on their Facebook page\n6. The pir³ was *much* larger, almost double of what it is today\n7. Perhaps the only \"story\" on this list - sites as simple as GitHub, YouTube and StackOverflow used to randomly get blocked on their Wifi. Ironically, a lot of porn sites weren't. \n8. The Amateur Scientist, abbreviated as TAS (fest organised by 2nd years) was the unofficial tinder at PESU, bringing seniors and freshers together (and I am guilty of the same lmao)\n9. The OAT was repainted by my batch during the last TAS as a welcome treat for the new coming freshers\n10. Craziest PESU story - faculty and research clubs here used to be top notch :cri:"
    },
    {
      "id": "jlyfvvq",
      "body": "Source?"
    },
    {
      "id": "jlyu3kd",
      "body": "\"Trust me bro\""
    },
    {
      "id": "jlyucbs",
      "body": "Imagine it's jawahars reddit account 💀"
    },
    {
      "id": "jm25ryq",
      "body": "Really, they changed it to 3 isas not 2 though"
    },
    {
      "id": "jmmhcdf",
      "body": "some boy fingered a girl in classroom got caught then suspended\n\nsome guy from bba took pics of girls in bathroom got caught wrote apology and suspended came back got caught again came in newspaper"
    },
    {
      "id": "jmmw9h3",
      "body": "They didn't suspend the girl??"
    },
    {
      "id": "jmmwn1a",
      "body": "they did"
    }
  ]
}