{
  "id": "13up4hv",
  "title": "29 May Pessat Exam",
  "content": "Pessat exam in my opinioin was very tough today, time crunch is 180q in 180 min which was tough already, and in physics calculations were length(even with using a calculator!). Calculator was slow to use, half of chem quesitons were based on EQUILIBRIUM!, i don't think a single direct formula question came other than the solutions question. I don't know how people finish the paper on time, english they asked many vocabulary questions(defnitions, opposite words), of unheard words, wasn't grammar oriented as  much as other exams. Anyone else faced this problem? How was it for you?",
  "metadata": {
    "author": "Alternative-Stay2556",
    "url": "https://www.reddit.com/r/PESU/comments/13up4hv/29_may_pessat_exam/",
    "permalink": "/r/PESU/comments/13up4hv/29_may_pessat_exam/",
    "score": 19,
    "created_utc": 1685349574,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jm1shog",
      "body": "Hmm. Even comedk was weird lol."
    },
    {
      "id": "jm1snx9",
      "body": "im scared 😭😭😭😭"
    },
    {
      "id": "jm1sp5w",
      "body": "Bro you are scaring me \n\nI have it on 2nd June"
    },
    {
      "id": "jm1tc5q",
      "body": "Ayo same brother. Let's hope it goes well."
    },
    {
      "id": "jm1uicf",
      "body": "Welcome to PES lmaooooo"
    },
    {
      "id": "jm1vejc",
      "body": "bro fuck"
    },
    {
      "id": "jm1ydgk",
      "body": "if your paper was tough then congrats.. you will get a good rank"
    },
    {
      "id": "jm2067s",
      "body": "Ah hell na man wtf...yesterday my comedk went the same as your pessat and i thought i'll atleast try PESSAT and shit is worse"
    },
    {
      "id": "jm207j3",
      "body": "fr especially physics"
    },
    {
      "id": "jm21fzz",
      "body": "WTF is with all exams raising their difficulty this year? Or have we all become dumber?"
    },
    {
      "id": "jm21gbg",
      "body": "Same"
    },
    {
      "id": "jm21ph3",
      "body": "Fr makes me wonder..even KCET this year was tough"
    },
    {
      "id": "jm21umc",
      "body": "How was maths?"
    },
    {
      "id": "jm220jw",
      "body": "Yo even comedk. Shit felt like a jee paper (except maths but even that was harder)"
    },
    {
      "id": "jm28ele",
      "body": "Fr..if you're lacking in one question and take a bit extra time you're doomed and the whole paper gets affected"
    },
    {
      "id": "jm2ht46",
      "body": "bro same, i fucked up comedk bad and all of my friends that gave the exam in my shift said that they found pessat harder and i wanna cry now  \ni have zero options lmao"
    },
    {
      "id": "jm2ih4v",
      "body": "Us momint..how do i tell this to my parents who have unrealistic expectations of me"
    },
    {
      "id": "jm2jei7",
      "body": "man i wish i knew  \nthe thought of going home and facing my parents scares me more with each passing entrance exam"
    },
    {
      "id": "jm2n4hg",
      "body": "bruh guess ill have to settle for mit blr/jaipur or jaypee then fuck"
    },
    {
      "id": "jm2oyzr",
      "body": "exacctly man, I was so immersed in trying to solve that I messed up my time management terribly... couldnt even random mark like 9 questions.. was out of time"
    },
    {
      "id": "jm2v3h5",
      "body": "It was tough this year\nLast year's batch got easy admission \nThey had cutout portions that too"
    },
    {
      "id": "jm31960",
      "body": "too many ppl wanting to be engineer...."
    },
    {
      "id": "jm31dar",
      "body": "I marked 10qs in last 10 seconds, my hands were shivering brooo 💀"
    },
    {
      "id": "jm350cz",
      "body": "Bro my dad asked me how much I'm expecting in cet... I said maybe below 8k? And he got pissed... said anything above 1k is worthless for my level...\n\n\n\n\n🙂."
    },
    {
      "id": "jm37e6z",
      "body": "My dumbass didn't even register for those exams thinking \"pessat to ho hi jayega\"."
    },
    {
      "id": "jm38ags",
      "body": "ay my man theres still a chance the shift you get will be easy"
    },
    {
      "id": "jm3acy2",
      "body": "I'm sorry my guy"
    },
    {
      "id": "jm3l478",
      "body": "Why's that?"
    },
    {
      "id": "jm53l2z",
      "body": "If you paper happens to be tough, don't worry as others in your batch will be barely able to answer half the paper right. \n\nMost of my friends had no hopes of getting a good rank in this exam, only those who said that managed to get 500-1k rank"
    },
    {
      "id": "jm5qdij",
      "body": "Bro thanks a lot, no one I knew wrote pessat as the same time as me, glad to know its not just me who faced this problem."
    },
    {
      "id": "jmbcb8l",
      "body": "Same here. I might cry now😑."
    },
    {
      "id": "jmbcdoa",
      "body": "Fuck man I have it tomorrow. And my comedk and kcet were both shit.\n\nWhat chapters should i focus on for PESSAT?"
    },
    {
      "id": "jmbcfcr",
      "body": "Mine too. I am now planning to buy a strong rope"
    },
    {
      "id": "jmbghki",
      "body": "Us moment..PESSAT basically is the whole class 11 and 12 NCERT.. and the chapters distribution is random asf"
    },
    {
      "id": "jmbglia",
      "body": "Buy khud Jaa kahi se \n\nAtleast physics ki freefall try to kar paoge atleast \n\n/S"
    },
    {
      "id": "jmbgyhn",
      "body": "Bhai mere Ghar ke side sidhe yamraj se contact karwane wali building hai hi nahi. Wha se kudege to maa baap patak kar marege🙂. Sed lyf💔"
    },
    {
      "id": "jmbmi4t",
      "body": "After today's paper, I can vouch for this."
    },
    {
      "id": "jmbqyb2",
      "body": "Your honest reaction?"
    },
    {
      "id": "jmbsih4",
      "body": "L"
    },
    {
      "id": "jmbu2sa",
      "body": "hopefully we all still get rank my brother got 96 in jee mains and got cse in pes and i got better in mains so that's my only hope i can get cse in pes rr 😭 this shit too stressful tbh"
    },
    {
      "id": "jmdc3h4",
      "body": "*laughs in dogshit jee percentile*\n(I'm crying on the inside)"
    },
    {
      "id": "jmexsx0",
      "body": "it's okay bro jee percentile doesn't mean so much also many people from my college who did bad in jee did better in cet or got cse in pes"
    }
  ]
}