{
  "id": "13wj28f",
  "title": "PESSAT MARKS",
  "content": "HEY , Out Of 180 , how much to score to ensure cs at ec or rr campus, ik pessat dont release marks and i already know the cutoff rank. just asking an estimate for marks...120+ for rr and 100+for ec ?",
  "metadata": {
    "author": "Illustrious-Sink-742",
    "url": "https://www.reddit.com/r/PESU/comments/13wj28f/pessat_marks/",
    "permalink": "/r/PESU/comments/13wj28f/pessat_marks/",
    "score": 5,
    "created_utc": 1685531070,
    "flair": "PESSAT",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jmbz1xb",
      "body": "Cfbr"
    },
    {
      "id": "jmbz8ai",
      "body": "No idea about marks be a every batch gets a different paper and the scores are normalised in a way as well. \nPrepare well, you’ll get in. Rank wise, a rank under 500 will mostly guarantee you a CS seat at RR. \nAll the best to you."
    },
    {
      "id": "jmcf92a",
      "body": "Not a lot of people give pessat and it's shift based. Depending on the difficulty of your paper the marks may drop really low or really high. So just prepare well , answer as much as you can , and this year fee has been increased so ig the cutoff will drop. \nPessat cutoff for rr cse was 1.2k and ec was 3.3k (2nd round)"
    },
    {
      "id": "jmck0x5",
      "body": "are you sure its percentile and normalization process like JEE, rather than just marks vs rank like KCET??"
    },
    {
      "id": "jmckowb",
      "body": "Yes,  if you're in doubt , mail them.\nIt *has* to be a percentile system because pessat has a lot of shifts with different papers. If you're REALLY lucky you might clear the exam with minimal prep.\n\nMy friend last year who had a rank of 90k~ cleared pessat and got a branch in EC (I think AIML)."
    },
    {
      "id": "jmcm4ri",
      "body": "Thanks man, really eased off some of my pressure."
    },
    {
      "id": "jmcmae0",
      "body": "When's your shift man? I have it on 2nd"
    },
    {
      "id": "jmcmszn",
      "body": "4th"
    },
    {
      "id": "jmcpopc",
      "body": "90k in jee or kcet?\n\nEC didn't have aiml last year i think"
    },
    {
      "id": "jmcq46q",
      "body": "Kcet. They told me \"my rank in kcet was my question paper barcode number, but I cleared pessat and got a seat in EC campus\" \nAnd now they're telling me not to come to pes even if I clear the exam lmao"
    },
    {
      "id": "jmcsllv",
      "body": "praying for that kind of luck tomorrow man, thanks"
    },
    {
      "id": "jmcvhvy",
      "body": "can you ask why not to join??"
    },
    {
      "id": "jmcvq5o",
      "body": "Have you not read the posts here lmao , it's kind of a torturous place and all the good profs have left. And academically very competitive. \nPlacements tho are good I've heard."
    },
    {
      "id": "jmcvrg9",
      "body": "Best of luck!!"
    },
    {
      "id": "jmcyzre",
      "body": "thanks bro"
    },
    {
      "id": "jmfw748",
      "body": "Placements are usually good but because of the current job market scene things have been low this year"
    },
    {
      "id": "jmfw8h2",
      "body": "I'm assuming you're new to this subreddit lmao"
    },
    {
      "id": "jmg1sme",
      "body": "Tell that to my dad , forcing me to join PES even if I get msrit or bms :("
    },
    {
      "id": "jmg20qc",
      "body": "Why not BMSCE though?"
    },
    {
      "id": "jmg31gt",
      "body": "He tells me PES is a great college and pretty \"strict\". \nAnd a bunch of relatives seem to love the place a lot so dad is fixated on PES."
    },
    {
      "id": "jmgz4rb",
      "body": "Show him this subreddit lmao"
    }
  ]
}