{
  "id": "13xaw59",
  "title": "Luck?",
  "content": "I got a pretty hard shift but all my friends got easy ones\n\nWhy can't they just keep the same difficulty?\nIt's not fair\n\n\nAnd I'm pretty sure ik it's hard cause I've atleast wrote 6 entrances this year",
  "metadata": {
    "author": "War_Machine_69",
    "url": "https://www.reddit.com/r/PESU/comments/13xaw59/luck/",
    "permalink": "/r/PESU/comments/13xaw59/luck/",
    "score": 8,
    "created_utc": 1685603829,
    "flair": "PESSAT",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jmg6c8t",
      "body": "Bro,  I don't think you get it , getting a difficult shift is also better right?\nPessat is shift based , so if your shift is difficult, it will be difficult for everyone , and even for less number of correct answers you'll get a better rank.\nFor easy shifts there will be higher competition. \nIn a sense it dosent even matter cause if you're well prepared you can write a shift of any difficulty.\n\"Luck\" would be getting majority questions from the chapters you studied."
    },
    {
      "id": "jmgc39e",
      "body": "Damn\nThanks for letting me know\nI hope it works out"
    },
    {
      "id": "jmgegz5",
      "body": "hey bro, was math of this year KCET level? \n\nhow was physics? was it this year KCET level?\n\nand chem? what was the disribution, like organic, inorganic and physical?\n\nwere the options tricky or could we guess a few using the options too?"
    },
    {
      "id": "jmgpi3f",
      "body": "pes is shift based?"
    },
    {
      "id": "jmgq2el",
      "body": "Pretty sure it is , there's a normalization process for ranking too \n(If in doubt mail them)"
    },
    {
      "id": "jmhzxjs",
      "body": "dont worry you will be given higher preference during ranking.   \nunless you left the options blank😂"
    },
    {
      "id": "jmi8056",
      "body": "Nah bro\n Answered all 180\nNever gonna leave anything blank as long as there's no negative marking"
    },
    {
      "id": "jmigxe4",
      "body": "Maths was hard bro\nPhysics was kinda tricky\nChem was easy\nMaths was more of input more than mcq"
    },
    {
      "id": "jmigyf9",
      "body": "1 for every answer"
    }
  ]
}