{
  "id": "13xja1l",
  "title": "what’s the social life like?",
  "content": "[deleted]",
  "metadata": {
    "author": "[deleted]",
    "url": "",
    "permalink": "/r/PESU/comments/13xja1l/whats_the_social_life_like/",
    "score": 7,
    "created_utc": 1685630320,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jmhvqyn",
      "body": "Every time I read the word \"party\" in the same context as PESU I get reminded of that email the management sends out every year lmao\n\nFYI for those who don't know, every year just after freshers join parents are sent an email saying their kids are taking part in illegal activities on campus by taking part in parties and doing dangerous things thus making quite a few home environments chaotic. They also ask parents to keep a closer watch on their children xD.\n\nAlso, college isn't like what's depicted in movies/shows, atleast here. Get that image out of your head before your expectations get smashed to pieces in the first month. Nobody's throwing parties every other week - people are struggling to find time to breathe and relax here from the constant stress.\n\nFests have been discussed before on this subreddit, search and you shall find out more."
    },
    {
      "id": "jmhwq80",
      "body": "😭😭😭😭 i had too many expectations"
    },
    {
      "id": "jmhxrzd",
      "body": "Read through the comments here, especially the rants. Yes some of them might be a little exaggerated, but they are still an accurate representation of the college to a good degree"
    },
    {
      "id": "jmi5vf9",
      "body": "Do you have a branch preference? If you want CS, then PES is your best option. If any branch works, then Manipal main campus. If you don't have any branch preference at all, then blindly pick Manipal. \n\nAnd no, it's not school. It's worse (atleast for me)💀"
    },
    {
      "id": "jmidg8h",
      "body": "just go through this subreddit bro 😊"
    },
    {
      "id": "jmidsy4",
      "body": "you can take cps or mechx in manipal main campus if you want to go abroad for masters, want campus life, research projects, good profs and can compromise a little on branch"
    },
    {
      "id": "jmigr0b",
      "body": "Depends on what they want to do their Masters in. If it's CS or CS related then Mech will not help"
    },
    {
      "id": "jmihfov",
      "body": "Ah. So you're going to have to make the call on which you'd rather sacrifice - college or branch. Make sure you make this call keeping in mind your future plans for higher education (if at all)."
    },
    {
      "id": "jmilw02",
      "body": "mechatronics can open doors to a few cs allied fields and cps is pretty liberal I guess"
    },
    {
      "id": "jmirgs2",
      "body": "Mechatronics, yes. But OP mentioned Mechanical, thus my comment. Plus I'm not sure if Manipal has Mechatronics."
    },
    {
      "id": "jmiwoq3",
      "body": "they do, it's pretty popular, if he is interested in cs but doesn't want a restrictive atmosphere then it's not the worst choice imo but still there's a risk"
    },
    {
      "id": "jmkl9wj",
      "body": "People in BMS enjoy their college life to the fullest. PES is just managed badly"
    },
    {
      "id": "jmla2r6",
      "body": "It was nice because campus is pretty empty since most of us have summer break going on . Wait till once the full strength arrives ."
    },
    {
      "id": "jmmd32d",
      "body": "u dont enjoy in pes bro it is a lot of academics fest is decent at best if u wanna enjoy u either a chilled out boys group who is down for anything or need a gf"
    }
  ]
}