{
  "id": "13y5k84",
  "title": "Is PESU (RR campus) actually worth it?",
  "content": "Here's a list of pros and cons of the college, according to what I've read in this sub:\n\nPros:\n\n* Big CSE placements\n* Updated curriculum\n* Good infrastructure\n* Closer to home (for myself specifically)\n\nCons:\n\n* Extremely academically oriented, leading to stressful college life\n* Mediocre professors \n* Mediocre lab facilities\n* Heard that it is somewhat strict and is basically a \"school 2.0\"\n* Not worth the money if you aren't getting in thru KCET\n* Campus still under construction\n\nLet me know if all this is correct, and add a point in the comments if I missed out anything",
  "metadata": {
    "author": "machinegun2187",
    "url": "https://www.reddit.com/r/PESU/comments/13y5k84/is_pesu_rr_campus_actually_worth_it/",
    "permalink": "/r/PESU/comments/13y5k84/is_pesu_rr_campus_actually_worth_it/",
    "score": 14,
    "created_utc": 1685689400,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jml4phj",
      "body": "Add high competition coz of the sheer number of students to the cons part."
    },
    {
      "id": "jmldrwy",
      "body": "I have been in both the campuses, so here is my pov\n\n\n\nSchool 2.0 and strictness is Ecity campus ,  but I didn't feel RR is that much of a school.\nAnd it's still worth if you get in through Pessat/ Management.\nAnd Ecity campus is not worth joining if it's not kcet."
    },
    {
      "id": "jmlg4yh",
      "body": "RR campus is more chill than ec campus tbh, and the management had said that they will be done with construction by this year(not sure if true or not) \nRegarding strictness, they aren't so strict strict like how we think, once u get used to it, it's fine"
    },
    {
      "id": "jmlgz76",
      "body": "Worth it for management? Isn't it like 11 LPA? I'm sorry but how do you justify a BTech from PES being worth 44L?\n\nAs for strictness, I'd say both campuses are strict. It's just that RR seems to have a more \"happening\" campus life because it has more fests."
    },
    {
      "id": "jmlj8m8",
      "body": "Fees through pessat is 5L now. I really don't think 25L+ is also worth it for ANY college either 😭"
    },
    {
      "id": "jmlli9m",
      "body": "I've seen people justify 64 lakhs for Rv🗿"
    },
    {
      "id": "jmlzn8e",
      "body": "and 1.7 lakh for hostel, more than manipal hostels which are like hotel rooms 😊"
    },
    {
      "id": "jmm0jtn",
      "body": "Wish I wrote MET. *sigh*"
    },
    {
      "id": "jmm19vd",
      "body": "i did and Im hoping to get pes cs lmao"
    },
    {
      "id": "jmmas5m",
      "body": "Constructions are almost over.. like by the time ur batch gets into 2nd yr it will be finished."
    },
    {
      "id": "jmme1fi",
      "body": "while what u say is correct for most at the end of the day rr is better it will feel like a college although pes is not know for college life i would say rr has better college life overall\n\nec campus has better girls"
    },
    {
      "id": "jmmfhwn",
      "body": "Is it worth the price? Maybe not. But is it better than EC campus- HELL YES."
    },
    {
      "id": "jmmk02i",
      "body": "Would kinda deny with cons> point 5; but overall, you got it right xD"
    },
    {
      "id": "jmnpkyi",
      "body": "Bro they had told construction would be over like more than a year back, that is in 2021-22."
    },
    {
      "id": "m1u1yas",
      "body": "how can competition be a con"
    },
    {
      "id": "m1u23s8",
      "body": "for real"
    }
  ]
}