{
  "id": "140cira",
  "title": "Guys if you could please look at my post once!",
  "content": "https://www.reddit.com/r/JEENEETards/comments/140absu/guys_my_parents_are_forcing_me_to_take_management/?utm_source=share&utm_medium=android_app&utm_name=androidcss&utm_term=1&utm_content=share_button",
  "metadata": {
    "author": "Diligent_Till_9393",
    "url": "https://www.reddit.com/r/PESU/comments/140cira/guys_if_you_could_please_look_at_my_post_once/",
    "permalink": "/r/PESU/comments/140cira/guys_if_you_could_please_look_at_my_post_once/",
    "score": 3,
    "created_utc": 1685883979,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jmv1ypa",
      "body": "So the summary is ECE via management quota at PES vs a drop year? \n\nUsually I'd recommend against joining PES but a drop year IMO is a bad decision because of the underlying uncertainty. While I didn't personally take a drop, I know quite a few who did and from whatever I've read/heard it's always this: There is no guarantee that you'll definitely do better next year and get into BITS (or wherever), and it's a super mentally exhausting step. Plus after a while it can get demotivating, monotonous as well as stressful. Additionally, most people aren't successful in that drop year because a lot of factors, both physical and psychological don't allow those initial plans to become a reality. A drop only makes sense when you don't have any viable options at your disposal.\n\nNow regarding the option at hand, you already know enough from this subreddit. Check the latest pinned post for a list of pros and cons. If your parents are being supportive and providing you with a chance to not take a drop year, you should think about it. Talk to some ECE kids from PES and find out whether it would be a good fit for you. At the end of the day the investment you make now should be worth it at the end of 4 years. Talk to people and find out. Good luck dude.\n\nEdit: if you can afford management at PES, why not look at RV, BMSCE etc?"
    },
    {
      "id": "jmv38n0",
      "body": "uhhh bro honest opinion paying 50lpa for a seat in pes is kinda ridiculous as i dont believe it is a good return on investment if you have written comedk you can take a lower core seat and get good marks during college to change your course to CSE or ECE"
    },
    {
      "id": "jmv3ys7",
      "body": "Branch change isn't a guaranteed option here. Only a handful get to do it every year, and you definitely need something upwards of a 9.6 or 9.7 CGPA to change branches. If OP wants CS, then it's easier to join a college where they get CS."
    },
    {
      "id": "jmv5pde",
      "body": "well Im not talking about pes I dont think paying for a managment seat is worth it as  50 lakhs is too much for a btech seat but if it is not a strain on his parents wallet he could go for it"
    },
    {
      "id": "jmvbbs5",
      "body": "i don't think cse/ise management quota is still available in the top colleges, if you aren't interested in ece then maybe look into lower ranked colleges (bmsit,dsce) or ece in msr,bms etc"
    },
    {
      "id": "jmvgyes",
      "body": "Ece management is around 24 lakhs I think"
    },
    {
      "id": "jmvx1ur",
      "body": "Just mentioning but the management in Rv and bmsce is actually higher for tech related branches as compared to pes , it's like double the amount of pes and they ask for some amount of money without a bill whereas in pes all the money is actually on the bill so no fishy business....."
    },
    {
      "id": "jmvz3ph",
      "body": "Where this 50lpa came from? In pesu rr campus it's 11L for cse and 8L for ece PER YEAR so total would be 44 and 32 ish ?\n\n Also changing seat is very hard especially for ece and Cs u need over 8.5/9 GPA."
    },
    {
      "id": "jmw5vj9",
      "body": "Hostel excluded so it's around 50L no?"
    },
    {
      "id": "jmw5xz4",
      "body": "MSRIT is cheaper"
    },
    {
      "id": "jmw9rnv",
      "body": "For cse it's it is 4 times the pes value I don't know about the ece one but I doubt it will be lesser"
    },
    {
      "id": "jmw9zep",
      "body": "Overall yes but not per year is what I'm saying. And if people are staying in bangalore they often opt for the long metro journey."
    },
    {
      "id": "jmwabrg",
      "body": "Where'd you get that info from? It's a one time donation of 30L + 3L an year right? (cse)"
    },
    {
      "id": "jmwai5z",
      "body": "Even EnC at RV is almost 35L~"
    },
    {
      "id": "jmwayg1",
      "body": "Is that true? From what some people told me it was 35 + 5lpa ? Sorry if my sources are wrong.."
    },
    {
      "id": "jmwb3ab",
      "body": "Nah I'm not sure , I'm looking at the brochure of RV and ramiah myself . They keep notching up the fee as the counseling date approaches I've heard."
    },
    {
      "id": "jmwbaef",
      "body": "But still that comes to 42L overall and pes is 44L so it wouldn't be great to call it cheaper it's just 2L cheaper for an already high fees..?"
    },
    {
      "id": "jmwbd6h",
      "body": "RV brochure says 7L one time donation + 6L an year (ece). Don't listen to random guys imo just go to their office and ask. For management seats imo pes should be your last choice"
    },
    {
      "id": "jmwbdxn",
      "body": "Wait so the management quota still haven't paid their fees yet??"
    },
    {
      "id": "jmwbfsp",
      "body": "Like isn't it illegal to change price on a fixed contract.."
    },
    {
      "id": "jmwbmmm",
      "body": "Ya I never looked at ece is this thing but for cse it is a strict 60-76L u have to dish out overall so ya ..."
    },
    {
      "id": "jmwbn9r",
      "body": "CSE seats in RV management quota are full. AIML , ECE and other branches still have seats left."
    },
    {
      "id": "jmwbsje",
      "body": "I guess so , yeah , it's not cheaper , but ramiah overall is much less stressful :P"
    },
    {
      "id": "jmwc7ox",
      "body": "But pes has really great facilities tho it's so mind blowing.. I just did the pessat exam yesterday and the infrastructure as compared to 4 years ago when I visited has developed so much"
    },
    {
      "id": "jmwcaxa",
      "body": "Wow there must be a lot of people willing to pay so much for cse..."
    },
    {
      "id": "jmwcq5d",
      "body": "Well anyways it's 1am now so good night :)) let's get into good colleges hopefully (idk if u r an aspirant or senior sorry)"
    },
    {
      "id": "jmwcrm8",
      "body": "u/rowlet-owl can enlighten you on how good the college is. He's a graduate from pes.\nIn summary, it's stressful and the quality has fallen down over the years."
    },
    {
      "id": "jmwcykp",
      "body": "RV CSE management seats fill up almost 6 months *before* kcet even starts. Private colleges care mostly about money :/"
    },
    {
      "id": "jmwd4zo",
      "body": "Good night bro , best of luck.\nMy friend and cousin are in PES and im waiting for kcet result , so I'm active here. ,lol"
    },
    {
      "id": "jmwf8tk",
      "body": "[Link to pinned post](https://www.reddit.com/r/PESU/comments/13ygg68/general_discussion_pesu_pros_and_cons/jmmro6e) >!to crush your expectations!<"
    },
    {
      "id": "jmwjyhn",
      "body": "Honestly I already have low expectation since my brother graduated from pes quite a few years ago but your gradadmissions profile post kinda raised my expectations with the  opportunities you got lol"
    },
    {
      "id": "jmwmcrg",
      "body": "people started buying rv cse management seat of this session from last year bro"
    },
    {
      "id": "jmxnuu4",
      "body": "Ah no, while there are really great students from here, my profile doesn't represent the average profiles of students. Besides, all the opportunities I \"got\", were all opportunities I had to make for myself - college didn't really provide any support with anything. For everything I've achieved, I'd give them only about 10% credit for the support. Also, PES has gotten a lot worse since I've graduated, things were significantly better when I was still studying. Since the last 2-3 years it's been a shitshow."
    },
    {
      "id": "jmyszdq",
      "body": "If you're getting older like 20 something then it's good to take management ECE at PES"
    }
  ]
}