{
  "id": "1423udf",
  "title": "Minimum CGPA for eligibility",
  "content": "What is the minimum CGPA required to sit for placements set by most companies?\nhow many companies will i be eligible to sit for if my cgpa is 7.1?",
  "metadata": {
    "author": "Pure_Negotiation_480",
    "url": "https://www.reddit.com/r/PESU/comments/1423udf/minimum_cgpa_for_eligibility/",
    "permalink": "/r/PESU/comments/1423udf/minimum_cgpa_for_eligibility/",
    "score": 7,
    "created_utc": 1686026432,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jn35pcg",
      "body": "Damn bro, I'm really sorry, the minimum Gpa required is 7.2"
    },
    {
      "id": "jn3610m",
      "body": "c'mon, it can be 7,7.5,8,8.5\nwhy 7.2 specifically?"
    },
    {
      "id": "jn39hj7",
      "body": "It's generally above 7\n\nBut there's another way you gotta see this minimum CGPA\n\nIf a company wants a pool of 10000 people to sit for their placements, they'll share the requirement, now let's say, the number of people having CGPA > 7.5 IS 10000; then, the minimum CGPA will be 7.5\n\nSo it's mostly based on the company and their requirements\n\nAll you have a control on is \n1) No backlogs (No company will accept peeps with backlog)\n2) The best grade you can get"
    },
    {
      "id": "jn39r76",
      "body": "oh okkay thank youu for the information!\ndo you have any idea about the process for data analytics/ data science placements and the procedure of the companies that visit PES?"
    },
    {
      "id": "jn3aekf",
      "body": "So generally there's like a Google group created for your Department which the placement Office has\n\nThey'll just keep forwarding/sending mails from companies to that group\n\nThe process to apply will be written in the mail"
    },
    {
      "id": "jn3bczy",
      "body": "Oh okkay, thanks again!\nbtw do you have any idea about what percentage of companies that visit our campus offer the role of a data analyst/data science?"
    },
    {
      "id": "jn3bkh9",
      "body": "[https://www.reddit.com/r/PESU/comments/xyl4cs/placement\\_stats\\_for\\_2023\\_batch\\_ongoing/?utm\\_source=share&utm\\_medium=web2x&context=3](https://www.reddit.com/r/PESU/comments/xyl4cs/placement_stats_for_2023_batch_ongoing/?utm_source=share&utm_medium=web2x&context=3)  \n\n\nCheck this out"
    },
    {
      "id": "jn3doic",
      "body": "From the college side a minimum of 6.75 is needed to be even eligible. For companies it's a different story and vary  a lot from company to company. I have friends with cgpa 7.1 who got placed, but u obviously cannot expect a really good package then."
    },
    {
      "id": "jn3dwcs",
      "body": "thank youu!"
    },
    {
      "id": "jn3ixxb",
      "body": "Will companies not accept any backlogs or just active backlogs?"
    },
    {
      "id": "jn3j095",
      "body": "Active Backlogs\n\nOnce it's cleared, there's no issue"
    },
    {
      "id": "jn3lwya",
      "body": "Adding to this, if you're in CS at least,\n\nAlthough a company might keep the cutoff at 7, you will probably need a lot *more* than that to stand a chance at getting that job. Remember that companies shortlist at most 20-25 students for interviews, and from this list only a handful are chosen. When you give the placement test, there will be multiple people who might solve the same number, or more questions than you. A combination of parameters, including your CGPA is used to shortlist for interviews. So even if you have a 7, and solve all questions, you'll stand a lesser chance than someone who solves all questions with an 8+ CGPA. Realistically, an 8.5+ is the safest bet in CS."
    },
    {
      "id": "jn3m5ew",
      "body": "Most companies won't visit asking for a specific role. Companies will in 95% cases recruit with a placeholder \"SWE/SDE\" role. When you make it to the interviews, they get an idea of what your skillset is based on resume, projects etc and even if you give an indication of what you'd like to do. Based on this, your role gets chosen. If your resume does not show any indication of a field and nothing comes off directly, they'll just assign you to a random team. \n\nIt all depends on the vacancies they have, and the way you perform during interviews. Just be aware that since you're right out of undergrad, most people do not get a role that they want because companies come recruiting for a generic role and assign based on need. It's best to not have these expectations before entering placements. If you want specialised roles, startups are your best bet."
    },
    {
      "id": "jn3oehh",
      "body": "He's clearly making fun of you and you are taking the bait"
    },
    {
      "id": "jn3oq09",
      "body": "how many companies will a person with 6.75 cgpa be eligible.\n\nwhat package can the person with above cgpa get"
    },
    {
      "id": "jn3orkl",
      "body": "your mum"
    },
    {
      "id": "jn3p0b0",
      "body": "The overused mum joke, no wonder"
    },
    {
      "id": "jn9pmxp",
      "body": "Does this happen a lot for ppl even with just a shade below 8gpa?"
    },
    {
      "id": "jn9qp3v",
      "body": "I gave multiple placement tests, and for a few of the ones in which I solved most, if not all, I didn't get shortlisted. My CGPA was close to 9, so the only reason I didn't get through is probably because there were other candidates with a CGPA greater than mine who performed as well as me or better in the test."
    },
    {
      "id": "jna4m0z",
      "body": "Don't they also look at other factors such as how long u took to finish the test and also the way you have approached the problem?"
    },
    {
      "id": "jna4sd5",
      "body": "As I said, among other parameters CGPA is also a parameter"
    }
  ]
}