{
  "id": "142kbdk",
  "title": "Electronic City campus",
  "content": "Hello seniors!\n\nSo I've done really well in my PESSAT and I think I have a very high chance of getting CSE, what I wanted to know is that if there is a big difference if I take CSE in the electronic city campus rather than RR campus, if some senior could tell me how the electronic city campus is in general in relation to both academics and the college in itself (campus, college life and crowd and stuff), it would be really helpful, I'm asking about the electronic city campus because it'll be closer for me",
  "metadata": {
    "author": "Irdkwhatnametogive",
    "url": "https://www.reddit.com/r/PESU/comments/142kbdk/electronic_city_campus/",
    "permalink": "/r/PESU/comments/142kbdk/electronic_city_campus/",
    "score": 5,
    "created_utc": 1686066713,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jn7ngc5",
      "body": "The syllabus taught in both the campus are same , your placements are going to be pooled , faculty is below average in both , campus wise RR is better , both the campuses are crowded , obviously you are gonna find a more studious crowd in RR .\nIf you are getting CSE in EC campus through KCET it's better than getting in RR campus through PESSAT ."
    },
    {
      "id": "jn7nm1y",
      "body": "Syllabus is gonna be the same for both campuses. Clubs and events are better at rr campus. Opportunities are better at rr. Rr infra is also slightly better(we have a new building coming up). But rr is rlly competitive compared to ec. EC is stricter than rr in some things afaik. Placements are going to pooled for both the campuses, so both will more or less get the same placement opportunities."
    },
    {
      "id": "jn7rqnx",
      "body": "RR has a huge crowd and a scarcity of extremely good professors to cater to so many sections so count that in as well, good ones will teach for a few sections only as they don't have enough bandwidth for all sections \n\nECC is a little dull in terms of environment and life outside campus but with the growing number of students you get many fun activities and stuff to do, travel was a pain point for ECC students but with the opening of the yellow line metro I believe it will become a tad bit easier to travel to the campus.\n\nAs far as the syllabus goes we have watched recorded lectures of RR campus professors from previous years and managed to get through a few subjects in a few semesters, ECC had exceptional professors but most of them just moved to RR or left the college for better opportunities.\n\nPlacements are pooled and expect more RR to be selected in a particular hiring event because of their greater headcount and don't mistake it for selective nature of the companies, there were many Prod based T1 companies where ECC was at par or even more in number of hires despite having less headcount so it boils down to luck and skill but from company side we didn't face any discrimination whatsoever.\n\nAnyway everyone relies on last year's lecture and notes and YouTube to learn stuff so make a choice based on travel consideration as 3-5 ISA will make your life miserable and don't let travel add to that suffering and make it worse."
    },
    {
      "id": "jn81t08",
      "body": "I'm not from Karnataka, whatever I get will be through PESSAT"
    },
    {
      "id": "jn85tct",
      "body": ">campus wise RR is better\n\nReally though? Isn't the EC campus more spacious with more open and empty grounds/areas. RR is simply buildings (although new and fancy) all over. It feels more cramped in RR than EC, IMO"
    },
    {
      "id": "jn869dn",
      "body": "I'd say choose RR because i don't know what sort of sorcery it is but the people in RR have somewhat better grades and are really competitive and that helps a lot in terms of overall growth and placements, EC might have a bigger campus but we don't even have basic sports amenities and events are non-existent."
    },
    {
      "id": "jn86w9o",
      "body": "I'm asking about the EC campus because if I don't get RR, is it a good choice?"
    },
    {
      "id": "jn87msa",
      "body": "If you've other options go for it because paying 4.5L is irrational because other than a very competitive and depressing environment you don't get much here and if you're not from Bangalore you'll realise soon enough how morally screwed this college is , imagine the worst school you've ever been to , if you're looking for a normal fun sorta college life , never choose ECC , can't say if same shit goes down in RR too."
    }
  ]
}