{
  "id": "14467py",
  "title": "which one should I consider?",
  "content": "I'm really in a doubt\n\n[View Poll](https://www.reddit.com/poll/14467py)",
  "metadata": {
    "author": "musicbyr1shi",
    "url": "https://www.reddit.com/r/PESU/comments/14467py/which_one_should_i_consider/",
    "permalink": "/r/PESU/comments/14467py/which_one_should_i_consider/",
    "score": 4,
    "created_utc": 1686222359,
    "flair": "PESSAT",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jndv26l",
      "body": "Which branch do you prefer? Don't sacrifice branch over the campus - in 4 years the campus you graduated from won't make any difference. Pick the one you like more."
    },
    {
      "id": "jneqb4r",
      "body": "I don't mind taking ece and giving in a little extra effort, I've heard that there are some summer courses that you can take up and have a computers minor attached to your degree, but thank you man."
    },
    {
      "id": "jnerffk",
      "body": "Sure, up to you, but note that a computer minors will not put you in the same boat as a CS grad. Also, if you do have any higher education plans, you might want to take this decision with more thought rather than just comparing the campuses."
    },
    {
      "id": "jni3jb6",
      "body": "Minors and other summer courses don't help, orientation is meant to create an illusion of what power minor courses hold to transform one's career path but in reality it is nothing but blatant lies, I've seen close friends struggling with workloads and resulting in massive derailment in both major and minor courses and even at times there were no faculty to take classes for minors.\n\nA little discomfort is okay to deal with if you are specific about the branch you want to pursue because placement opportunities will be cut throat with the massive growing intake of people, The quality of education takes a hit with a large number of students, keep all these factors in mind before picking and always pick the branch you have preference for."
    },
    {
      "id": "jni98qn",
      "body": "If I want to do a masters in a Cs branch, then are you saying it's OK to take ece for bachelor's or are you saying to stick with cse?"
    },
    {
      "id": "jnib8nh",
      "body": "If you're looking to do an MS in CS, do your undergrad in CS. Most programmes for an MS look for candidates that have done their undergrad in a related programme. If you don't meet that requirement, then you aren't considered.\n\nThis is because they want students who can fit into their programmes and thus look for a certain list of prerequisite coursework or skills their candidates must have, which are listed clearly on their programme site. Sometimes, they do consider candidates from related branches (if you're aiming for CS, they sometimes consider IT and ECE), but make you go through all the required coursework after you join.\n\nBut the general way to go about it is, if you want an MS in X make sure you do your Bachelor's in a programme in X or related to X."
    }
  ]
}