{
  "id": "1449wyq",
  "title": "which one would you choose and why",
  "content": "\n\n[View Poll](https://www.reddit.com/poll/1449wyq)",
  "metadata": {
    "author": "TemporaryTempest1420",
    "url": "https://www.reddit.com/r/PESU/comments/1449wyq/which_one_would_you_choose_and_why/",
    "permalink": "/r/PESU/comments/1449wyq/which_one_would_you_choose_and_why/",
    "score": 2,
    "created_utc": 1686232398,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jne7wgq",
      "body": "Same question."
    },
    {
      "id": "jnedldu",
      "body": "i just realised i too have to vote to see the results  \nforgot to put an option for people that just wanna see :')"
    },
    {
      "id": "jnem9kw",
      "body": "Do you have a branch preference? If yes then pick that. If you are okay with any branch, weigh the pros and cons of each Uni, along with other factors (placements, cost, travel etc) and see which works out best for you. Additionally, remember to factor in higher education plans if any while making this decision."
    },
    {
      "id": "jnemtdx",
      "body": "I mean for this I feel u should go with ur choice of the branch... I mean do u like ece even?? Or cse for that matter?"
    },
    {
      "id": "jneoh1j",
      "body": "If you've a branch preference go with your branch but if that doesn't matter ,choose manipal main campus anyday."
    },
    {
      "id": "jneygre",
      "body": "i think i might have a slight pref towards cse but i'm not really sure, for the most part i like ece and cse equally and the biggest reason i'd prefer cse would be cuz it apparently has higher packages and all that?  \nso placements and packages was what i wanted to know more about in this aspect ig  \n\n\nthanks a lot tho"
    },
    {
      "id": "jneymu0",
      "body": "yup, i kinda like both and i have pretty much the same interest for both, so i wanted to know about the other parts ig"
    },
    {
      "id": "jneyxiv",
      "body": "i don't exactly have a set branch preference so there's that  \nalso could you elaborate  why you'd think manipal is better, is it because of the peer group or placements and packages or anything else  \n\n\nthanks"
    },
    {
      "id": "jnf0vfo",
      "body": "I've got friends in Manipal and their life is way better than mine , the campus , crowd , events and really vast alumni network and even if PESU might do slightly better in placements which i doubt, I'd say choose college life over depression."
    },
    {
      "id": "jnf1o6o",
      "body": "There's a post on this sub which contains the stats for the 2023 batch, you can refer to that"
    },
    {
      "id": "jnf8ry4",
      "body": "ohhh okay i see  \nthat was informative, thanks a ton"
    },
    {
      "id": "jnf8upi",
      "body": "alright i'll search for that  \nthank you"
    },
    {
      "id": "jnf9qm1",
      "body": "going through the same dilemma lmao"
    }
  ]
}