{
  "id": "144gcv6",
  "title": "Counselling Process",
  "content": "I am completely unaware of the counselling process that will commence in a week's time. \n\nIt'd be extremely helpful if I got key details with regards to the entire process.",
  "metadata": {
    "author": "myhonestreactionL",
    "url": "https://www.reddit.com/r/PESU/comments/144gcv6/counselling_process/",
    "permalink": "/r/PESU/comments/144gcv6/counselling_process/",
    "score": 7,
    "created_utc": 1686247399,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jnhagoc",
      "body": "Have you seen IPL auction? Exactly like that without bidding and seats are filled based on your rank. Along with live display of vacant seats."
    },
    {
      "id": "jnhhgue",
      "body": "Hmm that's a good analogy."
    },
    {
      "id": "jnhl7kp",
      "body": "Counselling is offline with fees to be paid immediately through 4 DDs in colleges favor"
    },
    {
      "id": "jnhme41",
      "body": "Could you elaborate pls."
    },
    {
      "id": "jnhs3is",
      "body": "Don't know what that means :/"
    },
    {
      "id": "jnhvepr",
      "body": "offline? how would that work, what about people from different states?"
    },
    {
      "id": "jnicblj",
      "body": "they'll also have to travel to Bangalore"
    },
    {
      "id": "jnj149x",
      "body": "Bvpcet is on 11th and counselling is on 17 and 18th. The results of bvp wouldn't be declared this early and we have to submit the fees on the day of counselling itself, what if I get better rank in bvp and want to go there but then I couldn't save my seat for backup or something like that"
    },
    {
      "id": "jnjntsv",
      "body": "You don't really have to be present in Bangalore during the counselling sessions. You can join in online and still block your seat if you are from another state and cannot attend the counselling."
    },
    {
      "id": "jnjp91u",
      "body": "nope, just checked the website. there's no online counseling, it's clearly mentioned"
    },
    {
      "id": "jnjt19f",
      "body": "Oh my bad, I assumed they would continue with the procedure they had the last year for us."
    },
    {
      "id": "jnmgzav",
      "body": "maybe cuz of covid"
    },
    {
      "id": "jnml1sp",
      "body": "Probably, but doesn't make sense as yhe counselling was in late August 2022"
    }
  ]
}