{
  "id": "1451o8h",
  "title": "cse in EC campus or cse in VIT AP??",
  "content": "So I got cse core in vit ap campus and I might get cse in EC campus, should I attend the councelling?  \nalso I will be staying in hostel are the hostels good??   \n\n\nalso if I do get seat in ec campus do the students there use normal laptops or gaming? do we have to take the laptop to college everyday as gaming laptops don't last on battery more than 2 hrs",
  "metadata": {
    "author": "inzenia",
    "url": "https://www.reddit.com/r/PESU/comments/1451o8h/cse_in_ec_campus_or_cse_in_vit_ap/",
    "permalink": "/r/PESU/comments/1451o8h/cse_in_ec_campus_or_cse_in_vit_ap/",
    "score": 2,
    "created_utc": 1686306895,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jniqaxp",
      "body": "cse in ec is decent afaik. about laptops- gaming laptops are fine, but bulky and generally have shitty battery. if you’re doing cse in general, go for a decent notebook, with good specs and battery life. a lot of the heavy lifting (training models and stuff) can be done on the cloud."
    },
    {
      "id": "jnj6qpr",
      "body": "having the same condition here, considering to drop VIT-AP because I feel like VIT-AP does not feel that well, I'm getting ece rr campus mostly and cse ec campus, I'm also getting amrita bangalore ECE."
    },
    {
      "id": "jnl4g11",
      "body": "Thank you for your reply,\nI guess I'll have to look at other laptops \n\nAlso i heard there is no free time the whole 4 years\nAnd it's very strict. Is that true?"
    },
    {
      "id": "jnl4mp2",
      "body": "Yeah ap comes even after Chennai so I'm thinking to take ec if I get but it also seems too overwhelming for me while I heard vit is pretty chill"
    },
    {
      "id": "jnmehoc",
      "body": "VIT is actually opposite of chill, it's very strict and since the state of AP is also new it has a lot of problems plus the undergrad certificate that we receive has the name VIT-AP instead of VIT in it which is a severe downside, I think ec will be a far better choice."
    },
    {
      "id": "jnmew97",
      "body": "yeah that is the case, but in all honesty the projects they force us to do (when we’re supposed to have free time) have had a generally positive impact in my resume. \n\nadditionally you probably will need to be prepared for a school like environment with 5 internal exams and stuff. (i personally didn’t mind this too much)"
    },
    {
      "id": "jnmu16w",
      "body": "We'll be having 3 ISAs from next sem. It's confirmed by our teachers"
    },
    {
      "id": "jnmvt2w",
      "body": "that’s nice"
    }
  ]
}