{
  "id": "1458wpt",
  "title": "Counselling Query",
  "content": "Pes sent a mail regarding the counselling process, but I've been wondering if I should go for the first round. \n\nI've managed to secure 30xx rank. Should I go for counselling in the first round, for ECE? \n\nNot betting on cse.",
  "metadata": {
    "author": "myhonestreactionL",
    "url": "https://www.reddit.com/r/PESU/comments/1458wpt/counselling_query/",
    "permalink": "/r/PESU/comments/1458wpt/counselling_query/",
    "score": 4,
    "created_utc": 1686326007,
    "flair": "PESSAT",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jnjtvjn",
      "body": "The cutoff for ECE at the RR campus last year was around 2920 in the first round of counselling, so plan accordingly.  \n\nI'd suggest you go and try your luck in the first round, if not, you probably will get an ECE seat in the second round as the ranks do drop to 3k-ish by then."
    },
    {
      "id": "jnjweq5",
      "body": "Got it"
    },
    {
      "id": "jnk0fgm",
      "body": "Which round should i appear if i got around 13xx nd trying for cs in rr campus"
    },
    {
      "id": "jnk7yus",
      "body": "With a 1.3k-ish rank, chances are pretty low to get CS in RR, even in the second round, as the past year's cut off was somewhere around 1.2k. You can sure get it in EC campus maybe in second round. \nMaybe, you can even try for AIML in RR in second round.\nAll the best!!"
    },
    {
      "id": "jnkcrpw",
      "body": "Ohhh i see \nI had heard that this year the seats for cs were increased or somn so thought i might make it into cse in main campus but aiml is good too thanks for the help!"
    },
    {
      "id": "jnlwcqf",
      "body": "I'm not sure about the number of seats being increased this year, and have no idea if this info is legit or not.\nBut yes, you could attend 1st round and choose AIML if you interested in it and then later try switching to CS during the second round if your rank falls in that range."
    },
    {
      "id": "jnmbukn",
      "body": "What if we directly attend second round? Will that reduce the chances of getting an aiml seat or would it still be available?"
    },
    {
      "id": "jnmmlsr",
      "body": "comedk rank 29xx any chance of cse spec in rvce aur msrit cse?"
    },
    {
      "id": "jnmvspa",
      "body": "You have a good chance of getting ece in rr campus and you'll definitely get ece in ec campus. If you're fine with either then go for it. I wouldn't count on cs tho"
    },
    {
      "id": "jnn6j5a",
      "body": "Usually, the second round involves students from the first round either shifting campuses/ upgrading their branches/ both. \n\nThe number of seats in the second round kinda depends on the number of students who converted their PESSAT seat to CET seat/ ditched the PESSAT seat and shifted to another college. Hence, it usually can't be guaranteed whether a person attending the second round for the first time will surely land in their desired seat unless they have higher ranks. \n\nSuppose a student with a rank of 700 in PESSAT doesn't attend the 1st round and waits for his/her CET results. Later, he/she may be dissatisfied with the CET rank and end up attending 2nd round of counselling for PESSAT, it can be said that he/she has a higher chance of getting a CS seat at the RR campus as the rank is higher and close enough to the cutoff of 1st round counselling. If the same student had a rank of 1.2k - 1.3k, it could be a close call for him/her."
    },
    {
      "id": "jnrgap9",
      "body": "Ohhh got it thanks for the help!"
    },
    {
      "id": "jnrihi4",
      "body": "No problem!\nFeel free to ping me if you have any further doubts."
    }
  ]
}