{
  "id": "145pte2",
  "title": "Confirmation of attendance for counselling",
  "content": "I noticed that the portal which allows us to confirm our attendance for the counselling mentions the first round initially and on clicking 'continue' takes us to another page asking us to confirm our attendance for the second round counselling. Why is that so? Without attending the first round counselling I don't think I'll be able to decide whether I need to attend the second round counselling session(Screenshots have been attached of the same for reference). Can anyone help me with this?",
  "metadata": {
    "author": "Global-Wolverine-27",
    "url": "https://www.reddit.com/gallery/145pte2",
    "permalink": "/r/PESU/comments/145pte2/confirmation_of_attendance_for_counselling/",
    "score": 10,
    "created_utc": 1686369381,
    "flair": "PESSAT",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jnmchcj",
      "body": "Fill both? What's the worst that could happen? It's a confirmation of attendance not a seat confirmation."
    },
    {
      "id": "jnmcv2w",
      "body": "Ok, thank you"
    },
    {
      "id": "jnmh1lp",
      "body": "In puc details can we write cs marks for max marks column"
    },
    {
      "id": "jnmp4hz",
      "body": "Can we apply for 2nd round counselling directly?"
    },
    {
      "id": "jnn2ms1",
      "body": "It's a typing error, i verified by calling, they said they would fix it soon, let's see, it's for session 1 counseling rn"
    },
    {
      "id": "jnn6kko",
      "body": "Thanks for clarifying this. Can you please share that number as I couldn’t find it?"
    },
    {
      "id": "jnqw85h",
      "body": "I never got any message regarding 2nd round counseling... Is it just me??"
    },
    {
      "id": "jnqwfno",
      "body": "It was a print mistake. Meant for first round counselling for everyone. This error has now been rectified on their portal"
    },
    {
      "id": "jnqwics",
      "body": "Thank you :)"
    }
  ]
}