{
  "id": "147gamv",
  "title": "Is AIML worth it?",
  "content": "Is AIML at rr campus worth it? Are the placements and curriculum on par with the core cse program?\n\n&#x200B;\n\nthanks :)",
  "metadata": {
    "author": "SID1410",
    "url": "https://www.reddit.com/r/PESU/comments/147gamv/is_aiml_worth_it/",
    "permalink": "/r/PESU/comments/147gamv/is_aiml_worth_it/",
    "score": 9,
    "created_utc": 1686549222,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jnve51g",
      "body": "It's a new branch, introduced only last year. Check out recent posts on this topic on this sub for more info about why it isn't worth it. As for placements, in all likelihood you'll end up with a SWE job itself and the branch won't help you land an ML related one."
    },
    {
      "id": "jnvf3ap",
      "body": "CSE >aiml"
    },
    {
      "id": "jnvg2ny",
      "body": "true\n\nas much as i would love to join cse my rank doesnt permit that :')"
    },
    {
      "id": "jnvg52g",
      "body": "thanks for the reply \n\nmy intentions are not to land an ML related role\n\ni was considering it because my rank doesnt get me core cse"
    },
    {
      "id": "jnvibs5",
      "body": "It is still a new branch and only one year has passed since it's been made. So, we can't be very sure about the curriculum. PES also is proud about the \"dynamic\" curriculum so you should expect changes. \n\nThe placements should be similar but not as good as CS. See a few other posts in the subreddit I believe they go more in-depth.\n\nOverall I'd say go for CS in EC campus over AIML in RR."
    },
    {
      "id": "jnvikn3",
      "body": "I guess AI/ML will be closer to CSE as compared to ECE"
    },
    {
      "id": "jnvj0go",
      "body": "EC campus too?"
    },
    {
      "id": "jnvj2vx",
      "body": "The seats have been increased this year and I'm guessing not a lot of people are gonna sit for counseling cause of the fee hike , keep your hopes up"
    },
    {
      "id": "jnvr5tc",
      "body": "Does anyone know where I can find the syllabus for aiml? Couldn't find it on the pes website"
    },
    {
      "id": "jnvv18w",
      "body": "How similar is AIML to CSE?"
    },
    {
      "id": "jnvx1ra",
      "body": "seats have been increased by how much in rr?"
    },
    {
      "id": "jnwidr3",
      "body": "I am not sure , but it's not just PES , RV and BMS have also increased their IT related seats"
    },
    {
      "id": "jnwxzek",
      "body": "from this year only?"
    },
    {
      "id": "jnwycz7",
      "body": "Yes"
    },
    {
      "id": "jnyu8nx",
      "body": "Leaving a reppy here to get notified of anyone posting an actual copy of the curriculum or the url for it.\n\nBtw, i did reach out to the admissions office and they say only place i could get is by visiting the campus. I'm running out of town and can't make it but I'd appreciate if anyone has done the deed and ready to share here."
    },
    {
      "id": "jnywbt9",
      "body": "Apparently they haven't made the proper syllabus yet because the branch started only last year"
    },
    {
      "id": "jo3z554",
      "body": "60% cse 40% aiml. basically the electives you can choose to pursue with cse core are now aiml. (This is what the dean said)"
    },
    {
      "id": "jwzscxc",
      "body": "To all the juniors out there. Here me out loud and clear. THIS POST IS PURE GOLD AND EVERYTHING THIS MAN'S WRITTEN IS BULLS EYE. Literally every alphabet in this post makes sense. Don't fall for the hype. Avoid FOMO (which i know aint easy for kids joining college intially)."
    },
    {
      "id": "jx9uspv",
      "body": "Can u please specify the courses that are being replaced by PESU. Also if I learn these courses separately will that make a difference"
    },
    {
      "id": "jxdaaq0",
      "body": "Digital design has been replaced with SoC. Computer Architecture with Big Data. This is what we know of so far. Learning it separately won't make a difference for higher education because they still will look at your grades in all courses you've taken at undergrad, that's when they see that something is missing.\n\nUnfortunately I can't comment on which branch is better, I don't really know enough about the other to suggest anything."
    },
    {
      "id": "jzrukj6",
      "body": "i got aiml in 2nd round, should i wait till 2nd extended round to get cse..... pls help urgent!"
    },
    {
      "id": "l6xtye9",
      "body": "Rvce cs specialisation (except aiml) or pes cs rr? I'm very confused please help me out here"
    },
    {
      "id": "l6y2i4w",
      "body": "Most points above apply to *any* specialisation. Core CS >>> specialisation."
    },
    {
      "id": "n5jxtg8",
      "body": "I get cs core in dsce so its better off to choose that instead of cs specialization in pes??"
    }
  ]
}