{
  "id": "148gucw",
  "title": "2802 rank what can I expect?",
  "content": "Ig I'm eligible for rr campus ece and cs for ec campus, so which one of them should I choose, also I have a 12kish rank in COMEDK, so which will be better? COMEDK or PES?",
  "metadata": {
    "author": "rohitornots",
    "url": "https://www.reddit.com/r/PESU/comments/148gucw/2802_rank_what_can_i_expect/",
    "permalink": "/r/PESU/comments/148gucw/2802_rank_what_can_i_expect/",
    "score": 3,
    "created_utc": 1686666844,
    "flair": "PESSAT",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jnzybpk",
      "body": "I don't think you can get cse in the top 5 colleges via comedk. Ece could be possible at msrit or dsu, not sure."
    },
    {
      "id": "jnzylkc",
      "body": "I'm aiming for ece primarily"
    },
    {
      "id": "jo05su6",
      "body": "Ece at bms or msrit should be a good choice then"
    },
    {
      "id": "jo08umm",
      "body": "Then you can keep your backup as ECE at PES. I'm not sure which college you'll get via ComedK though"
    },
    {
      "id": "jo2f8vd",
      "body": "Bro pes ofcourse in that range\nI myself had rank in your range and got CSE in second round ec campus"
    },
    {
      "id": "jo2hfyd",
      "body": "You'll get ece in ec campus and there's a chance u might get cs in ec campus in the second round. Since the fees increased this year, more cs seats might be available"
    },
    {
      "id": "jo2his8",
      "body": "Ig I'll get ece on RR campus ryt?"
    },
    {
      "id": "jo2omv5",
      "body": "Yes"
    },
    {
      "id": "jo2trfb",
      "body": "PES,cause 2802 is better,though 802 more than number of possible seats"
    },
    {
      "id": "jo4d2hz",
      "body": "I got 4.6k rank   \nAny chance of Pes RR ECE ??"
    },
    {
      "id": "jo4lhw5",
      "body": "Literally same im dying to know too😭"
    },
    {
      "id": "jo6vgxk",
      "body": "I have 1.7K rank in PESSAT, will I get CSE in the second round?"
    },
    {
      "id": "jo6yfgx",
      "body": "If you are interested in CSE , i doubt you can get into top 5/6 through COMEDK , you can go to PES if finance is not a issue and can handle the academic pressure."
    },
    {
      "id": "jo71q3b",
      "body": "Not in rr but you might get CSE with aiml in rr"
    },
    {
      "id": "jobr9l0",
      "body": "Bro how is ece in pes university"
    },
    {
      "id": "jpopo8u",
      "body": "Bro i got no idea that's why I didn't take risk, i took CSE straight-forward in second round"
    },
    {
      "id": "jpoq0cx",
      "body": "Bro i have 1718 rank can i get cse in rr campus in 2nd round? Also there is a high probability that i might get aiml in rr campus"
    },
    {
      "id": "jpoq9o2",
      "body": "Don't know about cut off it increased by some 400 for rr campus CSE in second round.\nAiML you'll definately get as last time it was 1900 in second round.\nBut core is always better than specialization.\nSo consider joining ec campus CSE then joining rr campus CSE with AiML"
    },
    {
      "id": "jpoqhni",
      "body": "Nah man i didnt like the ec campus i'll stay with rr campus"
    },
    {
      "id": "jpoqkdh",
      "body": "Lol fine, then you'll get AiML definately"
    }
  ]
}