{
  "id": "1493ues",
  "title": "Does PES do some kind of rank manipulation like VIT?",
  "content": "I have a friend who got a rank of 1xx in pessat, but has a rank of 58k in comedk. I could've understood if he had gotten under 10k in comedk and that it must've been due to bad luck that he got a bad rank but 58k is absolutely unimaginable. And how the actual fuck did this guy get a tripple digit rank in pessat",
  "metadata": {
    "author": "denkster69",
    "url": "https://www.reddit.com/r/PESU/comments/1493ues/does_pes_do_some_kind_of_rank_manipulation_like/",
    "permalink": "/r/PESU/comments/1493ues/does_pes_do_some_kind_of_rank_manipulation_like/",
    "score": 10,
    "created_utc": 1686736839,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jo34bov",
      "body": "Maybe he was lucky enough to have a topper sitting in front of him.. \n\n1xx in pessat and 60k in comedk is a frking joke.. happens everytime in most of the exams.. I know a person with 98.7 % in jee mains.. well guess what, same dude got 60\\~ish % in 2nd attempt.. dude used to cheat in all mocks and every carried a cell phone to pre-boards.. \n\nImagine how many across India might have cheated their way into top clgs.. happens everywhr.."
    },
    {
      "id": "jo355eo",
      "body": "Bro used up all his luck."
    },
    {
      "id": "jo3jzb9",
      "body": "Well maybe\n\nBut I think everyone deserves to top/get amazing score in one exam at least imo\n\nLike I missed the jee cutoff and ain't expecting much in kcet but still got 4xx in pessat lol ( didn't copy or anything like that)"
    },
    {
      "id": "jo3rrpb",
      "body": "similar case here.. missed cutoff by 0.x"
    },
    {
      "id": "jo3sgum",
      "body": "Very high chance he cheated or maybe he lucked out, who knows?"
    },
    {
      "id": "jo3sze8",
      "body": "yea same here"
    },
    {
      "id": "jo41vsq",
      "body": "Same"
    }
  ]
}