{
  "id": "149ukdh",
  "title": "COLLEGE",
  "content": "[deleted]",
  "metadata": {
    "author": "[deleted]",
    "url": "",
    "permalink": "/r/PESU/comments/149ukdh/college/",
    "score": 3,
    "created_utc": 1686809555,
    "flair": "PESSAT",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jo74u6u",
      "body": "Bro What 💀, you can take IIT Patna Electronics around the same cutoff"
    },
    {
      "id": "jo7583r",
      "body": "It's gonna be hard to upskill yourself while studying something like civil or mechanical. Ultimately your choice I guess. If you value college tag over branch, IIT it is."
    },
    {
      "id": "jo769l4",
      "body": "Yeah but I want cse"
    },
    {
      "id": "jo76bvn",
      "body": "Mains how did you do? Also pes thru kcet is definitely very worth it"
    },
    {
      "id": "jo76e9k",
      "body": "It's easier to transition from electronics to CSE than mech to CSE"
    },
    {
      "id": "jo780cn",
      "body": "Bro outside cse and electrical in some IITs other courses don't have value or jobs even in IITs.\n\nUnless you do them in old IITs."
    },
    {
      "id": "jo78cgh",
      "body": "IITs only have a tag value if you do from top 5-6 IITs. \nRest of em not so much( atleast for jobs)."
    },
    {
      "id": "jo7e9er",
      "body": "I've posted a similar comment before just yesterday regarding NIT vs PES. The same logic applies here. If you want to pursue CS and are planning a Master's also in CS, then you'll doom yourself by picking Civil here - your IIT tag won't offer any saving grace when you don't meet the college's basic course requirements. Also as someone pointed out, branching from Civil to CS is extremely difficult and unlikely. Maybe try looking for an IIT or NIT which you can get something like ECE or IT (idk if this exists) so it'll still keep the door half open for a Masters. If you don't plan on pursuing Masters at all, then go for IIT. In all likelihood you'll get placed at an IT company and that tag will bring you the big money. But you'll probably not be able to pursue anything close to CS after that."
    },
    {
      "id": "jo7ewhj",
      "body": "If you want CS, why/how is Civil an option?"
    },
    {
      "id": "jo7eyhs",
      "body": "bro changing from civil to cse is not close to impossible it is impossible the preference is given last to civil and no one leaves IIT CSE courses you need a tremendous amount of luck to change and first prefrence is given to computer related courses like computer and buisness or computer in maths.my friend has gone to iit tirupati mechanical he cant even change to ece let alone cse check if you get any computer related courses if not its is not possible to change"
    },
    {
      "id": "jo81p0a",
      "body": "Alright thanks!"
    },
    {
      "id": "joe09ms",
      "body": "Branch>College. \nWill understand during placement"
    }
  ]
}