{
  "id": "149y9k2",
  "title": "Mechanical engineering",
  "content": "How is mechanical engineering in PES , if not in PES which college would be best for Mechanical branch in Bangalore ?",
  "metadata": {
    "author": "Ok-Pear-3145",
    "url": "https://www.reddit.com/r/PESU/comments/149y9k2/mechanical_engineering/",
    "permalink": "/r/PESU/comments/149y9k2/mechanical_engineering/",
    "score": 3,
    "created_utc": 1686822840,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jo94qfu",
      "body": "aight so i recommend checking out either rvce or msrit for mech tbh.  \ncurrently there are a handful of good teachers, most are decent and few deserve to be called bad. this was due to recent outflux of good profs. the hod is defo on crack, so be aware of him. the one research lab that is active (bless vk sir) to an extent is related to thermal/fluids/cooling of electronics/quenching of steels, so if your into that or its related fields such as aero, apply for it if you join. you will however have to do the work of finding any internships or projects on your own tho. mech clubs are being defunded (aeolus, the aero club, has been dead for a few years now although a couple of my batchmates are trying to revive it). if your into other aspects of pes like cie/pesu io/minors in cs, those are some extra stuff you can do as well.  \nregarding placements, there are seniors who have gotten core jobs. many go abroad, and many do get the low cs job. this part depends on your interest, on you and luck."
    },
    {
      "id": "jobfo72",
      "body": "Thank you very much ! That was indeed helpful"
    },
    {
      "id": "joblx6k",
      "body": "np, choose wisely"
    },
    {
      "id": "jobnbhr",
      "body": "Is Dayanand Sagar a good option ?"
    },
    {
      "id": "jocmz7v",
      "body": "for mech no. my neighbor says that the mech crowd there is pretty bad"
    },
    {
      "id": "joe42em",
      "body": "Dayum , considering the college options I am thinking to drop mech as an option . Unfortunately I got 9K in PESSAT ."
    }
  ]
}