{
  "id": "14a2xbv",
  "title": "Which would be a better option for biotechnology?",
  "content": "\n\n[View Poll](https://www.reddit.com/poll/14a2xbv)",
  "metadata": {
    "author": "dryasfcucumbercum",
    "url": "https://www.reddit.com/r/PESU/comments/14a2xbv/which_would_be_a_better_option_for_biotechnology/",
    "permalink": "/r/PESU/comments/14a2xbv/which_would_be_a_better_option_for_biotechnology/",
    "score": 2,
    "created_utc": 1686836938,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jo8bcij",
      "body": "Anything in the world>>>>>>>>>>>>> biotech at pes"
    },
    {
      "id": "jo8chkr",
      "body": "really? could you elaborate? i wanna show this reply to my parents lmaoo"
    },
    {
      "id": "jo8n5xe",
      "body": "Biotech at PES does not have placements. Its not something I am saying - everyone in this branch says this xD"
    },
    {
      "id": "jo94s29",
      "body": "I think the vast majority of people who answered the poll aren't even from biotechnology.\n\nThere is no clear cut answer but you have to see what exactly you want:\n• Masters\n• Direct Placement\n\nIf you want the first, either should be good, I don't personally know anyone in Manipal Biotechnology, but i have heard it is decent.\n\n But with the Biotech department in PES I can honestly tell you it is quite well managed. Even though we do not have placements through the placement cell like other departments do, the professors have connections and everyone in the department that I know currently have gotten summer internships. We have good support from teachers, and there are regular seminars, extra curriculars and other activities to keep you engaged. Many of my seniors have gone on to do Masters abroad and the department is very familiar with stuff like references and also has a very good alumnus network, both in India and abroad.\n\nBut again, if placement is your concern, though you won't get it though placement cell, the profs know people and they can help you there as well, but there are no guarantees. All in all, I suggest looking more into Manipal as well and getting an informed opinion from someone studying there, also if you have more specific  questions join the discord and we can help you.\n\nI can't tell you if BT at PES is for you, you need to weigh your options, and what you want in your career, good luck!"
    },
    {
      "id": "jo9bjf4",
      "body": "https://drive.google.com/file/d/1tvdfHXMPP\\_JjSB5h55VneBZoSAvMKCdv/view?usp=share\\_link"
    },
    {
      "id": "joba3iy",
      "body": "+1000 to this answer\nVery well put"
    }
  ]
}