{
  "id": "14acrcb",
  "title": "BTech CSE (aiml) vs BE AIML",
  "content": "Is there any difference in the syllabus, future placements between these two? \nCoz pes has cse with aiml and other comedk colleges like bms, msrit have only aiml so I’m confused\n\nAsking this question coz I will probably get BMS AIML and pes cse aiml according to my ranks and I don’t really know what to choose",
  "metadata": {
    "author": "mitsuhara321",
    "url": "https://www.reddit.com/r/PESU/comments/14acrcb/btech_cse_aiml_vs_be_aiml/",
    "permalink": "/r/PESU/comments/14acrcb/btech_cse_aiml_vs_be_aiml/",
    "score": 3,
    "created_utc": 1686861621,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jo9saxq",
      "body": "As a general rule, CS >>> CS + specialisation > specialisation only branches. Reasons for the same have been posted on this sub multiple times, search/scroll and you'll find. Unless financially there is an issue, pick PES."
    },
    {
      "id": "jocl5c1",
      "body": "Hi thanks for the reply, will there be any difference in taking only specialisation branch compared to cs+ specialisation? \n\nI’ve seen people say 70-80% of the syllabus of AIML is similar to cse, so placements of aiml should be similar to cse in the future right?"
    },
    {
      "id": "jocltuz",
      "body": "It's not got to do with placements, rather the 3rd year of your degree. Instead of core CS which will get to pick among different fields to specialise, that choice has already been taken for you so you'll never get to pick. If it turns out you don't like the field, you'll end up with a specialised degree which you don't want forever. This will hurt your chances later when you try to switch to a different field."
    },
    {
      "id": "jrrs2y0",
      "body": "can I still do ms in CS if I've done AIML or should I go into the same field in the future?"
    },
    {
      "id": "jrrst6s",
      "body": "Firstly, if you have options, pick CS over AIML. Secondly, you can, but it makes no sense to specialise in undergrad"
    },
    {
      "id": "jrrswy2",
      "body": "Yes thank you I get that and CS will always be my top priority and I'm asking just in case👍"
    },
    {
      "id": "l8xmo23",
      "body": "What should I pick between btech AIML vs btech ECE?"
    },
    {
      "id": "l8y8iwc",
      "body": "You cannot compare across two completely different branches"
    },
    {
      "id": "l8yaobu",
      "body": "But I might get only these branches in the last round. I'm confused what should I pick?"
    },
    {
      "id": "l8ycg9n",
      "body": "Pick the one which interests you more. Look into the syllabus for each and decide"
    },
    {
      "id": "l98ftm5",
      "body": "What did u take? Is it worth? How much is its curriculum similar to cse? Nd how r placement opportunities?"
    },
    {
      "id": "lbkqkr5",
      "body": "i wanna know too 😭. As there are brances with name AIML and CSE(AIML) in comedk. What is the difference in these two. \n\neven MSRIT has both of them as CSE(AIML)-closed at 1830 and, AIML-closed at 2535. So, they definitely are not same. But what is the difference ???????? 😭😭😭😭😭"
    }
  ]
}