{
  "id": "14bu7ud",
  "title": "RVCE ECE vs PES ECE",
  "content": "TLDR; I got PES ECE seat through 1st round of counseling which happened on 17th June. Is it worth surrendering this seat(I have time till 12th July to take a call) for RV/MSRIT in the 3rd round of COMEDK counseling\n\nP.S: I am not concerned about placemnets. Ofc ik that RV is better than PES in terms of placements\n\n&#x200B;\n\nMy rank in PESSAT was 16XX and I got in PES RR campus ECE. Before 12th July I have the chance to surrender this seat but by then I won't be able to get any college either from CET or COMEDK. My COMEDK rank is 38XX. According to last years cut off I can get RVCE in third round of COMEDK counselling which will happen maybe in August. By then PES second round counselling would also hsve been completed. They are planning to start from Aug 7/14. My question: Is it a good idea to leave this PES seat and wait for which college i get in third round of COMEDK counselling(RV or MSRIT or some other)?",
  "metadata": {
    "author": "Old-Instruction-1139",
    "url": "https://www.reddit.com/r/PESU/comments/14bu7ud/rvce_ece_vs_pes_ece/",
    "permalink": "/r/PESU/comments/14bu7ud/rvce_ece_vs_pes_ece/",
    "score": 5,
    "created_utc": 1687016573,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "johc6dy",
      "body": "I heard comedk all rounds will happen from 7-20 July? If that is true u might have chance to get rvce b4 pes 2nd round but ull end up with a penalty to surrender."
    },
    {
      "id": "johdovq",
      "body": "I don't think so because the first round counselling schedule says that the seat allotment of first round will happen on 18th July"
    },
    {
      "id": "johdy4l",
      "body": "Oh I see.. well rv is the better choice but ya u need to be sure u will get it ig. Good Luck ! Hope you get what u choose :)"
    },
    {
      "id": "johjnnn",
      "body": "Bro last year's comedk results are an anomaly don't take it seriously"
    },
    {
      "id": "johliw0",
      "body": "Yup just checked 2021 cut offs and got reality check💀"
    },
    {
      "id": "johre9t",
      "body": "Bro u will get cs at ec campus by 2nd round and maybe ece at rvce by 3rd round ig"
    },
    {
      "id": "jojqbpd",
      "body": "bro then which cutoff would be ideal for predicting this yrs comedk cutoff, mean of 2022 and 2021?"
    },
    {
      "id": "jojz0s3",
      "body": "I don't want CS not interested in it"
    },
    {
      "id": "jokbz8y",
      "body": "Its subjective   \nwant better placement and college name? Take RV  \nwant better curriculum and facilities?Take PES   \nIIRC Ramiah isnt even close to as good as pes ece"
    },
    {
      "id": "jokf28r",
      "body": "why were last year comedk results like that?"
    },
    {
      "id": "jol54mi",
      "body": "Counselling was extremely late so by the time the results of counselling were out most people had already joined  colleges and hence gave up their seat.  \n2020's seats are more accurate ig"
    },
    {
      "id": "jol5aar",
      "body": "I think 2021 cut offs will be more accurate unless kcet fucks up its thing and becomes very late."
    },
    {
      "id": "jolcu1e",
      "body": "I guess I'm pretty screwed. I was pretty happy with my 1.7k in COMEDK"
    },
    {
      "id": "jooe8n2",
      "body": "so in that case comedk cutoff will increase right, means that we won't get good colleges at a good rank"
    },
    {
      "id": "joovvkr",
      "body": "I think you mean you won't get good colleges at a semi decent rank(\\~2k), in that case yes"
    },
    {
      "id": "joovzke",
      "body": "You prolly got a good rank in pessat no so its fine"
    },
    {
      "id": "jooyusp",
      "body": "ohhk fine thanks"
    }
  ]
}