{
  "id": "14cf4nt",
  "title": "2nd round counseling",
  "content": "When does the second round of counseling take place?\n\nWhen did second round take place last year(after how many days does it take place)?",
  "metadata": {
    "author": "Tomper_balak",
    "url": "https://www.reddit.com/r/PESU/comments/14cf4nt/2nd_round_counseling/",
    "permalink": "/r/PESU/comments/14cf4nt/2nd_round_counseling/",
    "score": 4,
    "created_utc": 1687076916,
    "flair": "PESSAT",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jokeb8f",
      "body": "This year it may take place after July 12 maybe."
    },
    {
      "id": "jokz213",
      "body": "After Kcet counselling I think"
    },
    {
      "id": "jolimy4",
      "body": "For the second round, would they call candidates on the basis of ranks again or give preference to people who want to upgrade from what they picked up today and yesterday?"
    },
    {
      "id": "jolm3v5",
      "body": "In order of ranks. Same process as round 1."
    },
    {
      "id": "jols01e",
      "body": "Thanks mate, that helps. Sorry if you explained this earlier, but just to get this clarified further - got 412x rank in PESSAT, and when we were called for counselling on the second day only EEE seats were available (around 19 or something) plus Mech and Biotech seats. As per my understanding, we can either take these seats and later upgrade to ECE (if available) in the second round in which case you would need to deposit the DDs or you can decide not to take it and come for the second round (deferred) - Given this situation, I decided with the second option (deferred/not take any seat/ reject) and decide to come for second round again. Subsequently, I noticed that all seats have got up in the first round. For my clarity, let me know if my understanding is correct on how this would play out in the second round. \n\nOption A - Candidates get called as per ranks again and can pick up free seats as and when they get available, in order of merit regardless of the ones who are waiting for an upgrade. The lower-ranked candidate gets the preference always in seat allocation, regardless of whether he attended the first round/attended but didn't take the seat. \n\nOption B - Candidates get called as per ranks again, however the higher-ranked candidate who took the EEE/Btech/Mech seat (maybe 44xx) gets preference for upgrade to ECE ahead of me who (412x rank) but didn’t take the EEE/Biotech/Mech seat today. As in, the second round itself happens after accommodating any upgrade requests from the the higher-ranked candidate(s).\n\nPlease correct me if my understanding is correct on this, thanks. Also, would there be any differentiation between candidates who do a 'No-show' in the first round vis-a-vis the ones who attended but didn't take/deferred any seat. Also, would there be a second round regardless of the fact that all seats have been taken up?"
    }
  ]
}