{
  "id": "14d7742",
  "title": "Help me decide please",
  "content": "Money is not a problem but i want to take a wise decision\n\n[View Poll](https://www.reddit.com/poll/14d7742)",
  "metadata": {
    "author": "NoOutlandishness5689",
    "url": "https://www.reddit.com/r/PESU/comments/14d7742/help_me_decide_please/",
    "permalink": "/r/PESU/comments/14d7742/help_me_decide_please/",
    "score": 6,
    "created_utc": 1687158188,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jool40b",
      "body": "Kcet 3rd round is not a safe bet unless you have a seat locked somewhere else."
    },
    {
      "id": "joop9r2",
      "body": "Kcet 3rd round is very risky..if you have any seat booked elsewhere wait for...also I would really recommend rv"
    },
    {
      "id": "jooqjlx",
      "body": "again.. dont rely too much on 2022 cutoffs.. they are messed up.. both kcet and comedk"
    },
    {
      "id": "joos0we",
      "body": "Everyone's telling this could could you explain it to me. I heard comedk some delay or sumn was there. Also comedk ise cutoff was 2110 and cs (ds) cutoff was 2080? Care to explain how much it would fall"
    },
    {
      "id": "joos6bz",
      "body": "That cutoff was 2022's ignore the question mark after 2080"
    },
    {
      "id": "jooy1xe",
      "body": "Electronics in RV closed at 6k and CS closed at 2k i believe.. like never in history the cutoffs went so high.. ece used to close by 1k max and cs by 500 max..\n\nComedk counselling was late.. kcet's 2nd round was gng on.. Bits , GFI,NIT,IIT all counselling was nearing to close.. and people who wanted medical too managed to get it through state counselling.. \n\nand COVID BATCH .. so I know its all over the place.. just take 2020 and 2021 for reference.. and hope for 2022 cut off   😏😉"
    },
    {
      "id": "joozjjv",
      "body": "Holy!!! U ruined my day 😭😭 but i needed this \nthank you so much im Glad i got to know it sooner"
    },
    {
      "id": "joqszxu",
      "body": "I chose PES CSE over RVCE ISE 2 years ago. I'd recommend to choose RVCE cause that branch is more proven: PES AIML department hasn't even started"
    },
    {
      "id": "josv6j9",
      "body": "Ai my bad ."
    },
    {
      "id": "joth4j8",
      "body": "Yeah, AI department hasn't started yet"
    },
    {
      "id": "jothgre",
      "body": "I literally saw ai in last years kcet cutoff lmao"
    },
    {
      "id": "jou4n96",
      "body": "Yeahh, those students are about to finish first year. Their core subjects haven't begun. Meaning the department hasn't officially started yet either."
    },
    {
      "id": "joxf9ao",
      "body": "oh yeah"
    },
    {
      "id": "jris838",
      "body": "But seats have increased this year also round 1 will go till 18th of july which means round 3 will most probably go till mid of august which may clash with csab and other counselings. I think pattern of 22 will repeat but ya for safer side pne must rely on 2021 cutoffs"
    }
  ]
}