{
  "id": "14eebmg",
  "title": "Dilemma",
  "content": "Drop or aiml pes rr campus. Got 86 percentile in jee mains so not qualified for advance. Had started jee prep from coaching in late april 2022, i.e, started preparation in 12th.",
  "metadata": {
    "author": "_hg_08",
    "url": "https://www.reddit.com/r/PESU/comments/14eebmg/dilemma/",
    "permalink": "/r/PESU/comments/14eebmg/dilemma/",
    "score": 6,
    "created_utc": 1687275281,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "joudxt9",
      "body": "uhhh well as a dropper, how confident are you in being focused on studies as a lot of people will pull you down sometimes even your parents. and it also depends on your mental strength as studying for jee isn't easy there is a chance you might not get IIT or NIT (especially your preferred branch) can you deal with such kind of failure if you can consider dropping. If your only goal is to get a IIT/NIT tag its not that worth it except for people glorifying you but if you want a crowd like IIT/NIT it is 100% worth it. and fyi cracking adv in 6-7 months is really difficult unless you studying atleast 12 hours a day ( i am not trying to demotivate you i am merely stating the things you will have to go through). As a dropper would i recommend drop? nah as you already have a top tier 2 college if you didnt have any good college i would have agreed with the drop, but if you are going ahead with the drop all the best my friend"
    },
    {
      "id": "joufbfz",
      "body": "Adding to this, take a decision for the drop based on what you want to achieve and what your goal is. If its to study CS, you already have a good option and I would suggest against a drop. If it's an IIT/NIT/BITS without any branch preference, you need to take the call based on how much you think you can make the year count."
    },
    {
      "id": "joujkh9",
      "body": "First i guess my parents wouldnt pull me down( ik it)\nSecondly, i might not be dropping for jee advance cause i know i would not be able to complete all the syllabus within 6 months ( of course ik that syllabus completion is not the main goal but expertise is ). I would be dropping for NITS, IIITS OR BITS PILANI.\nThirdly, see i dont know myself that what might happen just some weeks before the final d day, i may become lathargic and start thinking ab bahut hogya or last moment give ups, idk exactly what can demotivate or motivate me at that time cause actually those are the moments which actually traject or spoil your jee preparation ( and totally mean for jee mains) \nLastly this drop that i would be taking is actually my escape from my regrets and a route to my satisfaction because right now i feel like i could do those small things in my preparation which could have reaped a lot in my jee preparation. \nMy parents are ofcourse not happy with this decision because they think that before pessat i had no good college but now that i have i am not being grateful. Right now also i have only pessat to rely on for a college ,nothing else. But when i will have taken the decision to drop they will support me in every which way because they dont live in the past but believe to improve the future by focusing on present."
    },
    {
      "id": "joul0ld",
      "body": "Of course i am looking for cse or ece but also i am looking for a really good peer group and also a college where i would actually be able to focus on myself and have time aside from academics ,i.e, colleges in north india😅"
    },
    {
      "id": "joumvvw",
      "body": "my guy i want to think hard on a few questions \n\n1. can i preserve through 7 - 8 months of studies again?\n2. what is the reason i want to go to such institute, is it to satisfy myself or satisfy other people ?\n3. should my drop year fail what will i do ? (touchwood)\n4. can i deal with failure if i do not get any seat in these institutions? (touchwood)\n\nalso its not impossible to crack adv in a few months don't give up i almost cracked it with 3 month's of prep but getting a seat is gonna be hard.\n\nik you are thinking what if i had done this in my prep, what if i had started earlier but all of these thoughts dont matter right now the only thing that matters is can you go through studying again. you dont need to comment anything just a few question you need to think about ,take 2-3 weeks to consider your options as you have a long time to withdraw your seat."
    },
    {
      "id": "jous904",
      "body": "I can strongly vouch for and say that the peer group at PES is one of its strongest points. If you already have joined the discord server, you would have met quite a few people already. As for time, this problem will be everywhere regardless of the location in the Indian subcontinent - you'll need to make time for yourself. If you can make time, there is time :)\n\nAlso if CS is what you are targeting, and from your other comment I see that you're targeting IIT/NIT/BITS. What's your plan if you don't get CS? I hope you know the impact choosing college over branch does when it comes to future education plans such as a Masters."
    },
    {
      "id": "joxjbcv",
      "body": "It depends on what you want to do and your caste category, you have a lot to make up for to get a cs or ec branch in Nit if you are from general, I would suggest dropping only if you are very close to getting that rank.. even then it's up for debate. As far as ai in pesu is concerned, it's one of the best programs it's the state, although this university has its problems, teaching and syllabus ain't one of them, its more got to do with the horrible management which will take rash decisions.\nPlus if you want to do mtech here.. or abroad it doesn't matter, \nI have friends in nitk who have gone to Amazon and jio for summer internship and most people are guaranteed internships and opportunities in nit, but even here many have gotten internships at Adobe , rakuten , Bosch, etc.(6th sem internships I'm talking about)."
    }
  ]
}