{
  "id": "14eejhi",
  "title": "Course btech 1st year",
  "content": "Can anyone give first year course. For both cycles and all, I wanted to know about.",
  "metadata": {
    "author": "Timely_Comment_785",
    "url": "https://www.reddit.com/r/PESU/comments/14eejhi/course_btech_1st_year/",
    "permalink": "/r/PESU/comments/14eejhi/course_btech_1st_year/",
    "score": 3,
    "created_utc": 1687275787,
    "flair": "Study Help :table:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "joxrqld",
      "body": "Join the main PESU discord server and take a look. It's been posted there already"
    },
    {
      "id": "joxykvz",
      "body": "Its not in detail its just the overview sir, I need in detail like chaps and all xan you provide????"
    },
    {
      "id": "joy7pgp",
      "body": "You will get to know more about chapters once it starts. The management keeps changing syllabus regularly so it's difficult to provide chapters as such"
    },
    {
      "id": "joygdxm",
      "body": "For that as well, if you join the server and ask around you will be able to get the syllabus and see what all you have in first year. The reason I'm directing you towards joining is because it's all documented there"
    },
    {
      "id": "jozcsii",
      "body": "But any idea? Of all the chaps"
    },
    {
      "id": "jozd605",
      "body": "Sir I am in it, I asked many people but no one is giving, if you can provide would be very helpful either way if you don’t know I am even direct messaging and chatting with you😁😂in discord"
    },
    {
      "id": "jozdov9",
      "body": "Bruhhhh\n\nSomeone had posted the link to the \"PES Media\" discord server. Search in that channel you should get it, or ask again"
    },
    {
      "id": "jozft2w",
      "body": "Which server is that? I dint find any link?"
    },
    {
      "id": "jozfurv",
      "body": "And why u ain’t replying on discord"
    },
    {
      "id": "jozgc41",
      "body": "No need i found it"
    }
  ]
}