{
  "id": "14f3brv",
  "title": "Why Mechanical Least Preferred Branch ?",
  "content": "",
  "metadata": {
    "author": "reddit_proton",
    "url": "/r/rvce/comments/14f3adj/why_mechanical_least_preferred_branch/",
    "permalink": "/r/PESU/comments/14f3brv/why_mechanical_least_preferred_branch/",
    "score": 4,
    "created_utc": 1687341276,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "joy62ge",
      "body": "No demand, Just supply :')"
    },
    {
      "id": "joy7iz6",
      "body": "Not much jobs in India atleast based on mech. It has more demand in Europe"
    },
    {
      "id": "joym9oo",
      "body": "That's why PES is modifying the supply as well. There are plans in motion right now to replace Mechanical with Mechatronics"
    },
    {
      "id": "jozerc3",
      "body": "Demand in India seems to be majorly of cut and paste type jobs in the name of s/w, IT jobs, doesn't require application of engineering mind and skills. Btw, cse is not engineering.  A general degree or even no degree is sufficient to deal with such jobs."
    },
    {
      "id": "jp2ki2l",
      "body": ">cse is not engineering\n\nit indeed is an engineering field and disciple."
    },
    {
      "id": "jpkjg8r",
      "body": "factors involving the rise of computer science [due to its relative ease in a lot of cases], the jump from primary to tertiary sectors, lack of support for industries by the govt., the hype of cs and the smart indian abroad making lot of cash, failures of capitalising manufacturing beforehand, and plain stupidness contributed in an endless cycle of allowing weaker students to take mech further reducing quality. on more renowned colleges, branch change became the main goal. otherwise, some coding and ez cs seat.\n\nevergreen was the old term. perhaps might return again in a decade or so...\n lack of demand and oversupply of not so good engineers make placements not so shiny \nteaching is decent-good. infra a bit old, but functional mostly.  internship you need to know where ur looking for"
    }
  ]
}