{
  "id": "14h2qd9",
  "title": "Counselling help - Seat surrender",
  "content": "So kea updated about document verification which will go on until 15 july.Then the counselling would be even later, but pes has said that we got only until 12 july to surrender the seat. \n\nQuestion is, would they extend the date until after the kcet counselling, and till what round will they extend that (if they do)? Till 1st round or 2nd or maybe even 3rd?\n\nOr will there be any concession for kcet candidates?",
  "metadata": {
    "author": "Important_Royal_4537",
    "url": "https://www.reddit.com/r/PESU/comments/14h2qd9/counselling_help_seat_surrender/",
    "permalink": "/r/PESU/comments/14h2qd9/counselling_help_seat_surrender/",
    "score": 3,
    "created_utc": 1687537125,
    "flair": "PESSAT",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jp8ohuv",
      "body": "Where did they update the document verification? I dont see it in the official website"
    },
    {
      "id": "jp8p7sw",
      "body": "It's there in admissions-> ugcet"
    },
    {
      "id": "jp8s5qo",
      "body": "Thanks a lot bro"
    },
    {
      "id": "jp8sqkh",
      "body": "No prob"
    },
    {
      "id": "jp8t8cn",
      "body": "They will extend the date until 1st round of KCET in my opinion. If you get in through 2nd or 3rd round fee concession will be done don't worry about that"
    },
    {
      "id": "jp8u4k5",
      "body": "But what if I get in another college in 2nd or 3rd round? Will they refund the fees paid or not??"
    },
    {
      "id": "jp8xn66",
      "body": "Please don't share information that isn't fact checked. Unless it's been postponed, don't advise others related to it. PES is known for not adjusting with other admission channels and prioritising PESSAT over KCET because of the larger student numbers and exorbitant fees. For example, last year they even started the semester early for PESSAT students before CET students joined. \n\nI'd suggest you and OP to stay away from any rumours or baseless speculations before it leads to any issues."
    },
    {
      "id": "jp8ya79",
      "body": "If you give up a seat after the last deadline set by PES, you will not be refunded. This has always been the rule at PES."
    },
    {
      "id": "jrwrwi4",
      "body": "the last date is 20th now,pretty sure it will still be extended to after the cet first round"
    },
    {
      "id": "jrwrxx3",
      "body": "recently visited pes rr campus to enquire"
    }
  ]
}