{
  "id": "14le7ck",
  "title": "Need career advice",
  "content": "I am PESU 2023 graduate\n\nI have a CGPA of 8.14. I got placed for 7LPA in a company .\n\nIt's a service company and I heard it's not so good. Only an associate engineer role not SDE.\n\nI did not get any better offer. So not planning to join company. I am going for masters in a university abroad but it is an average university.\n\nIt is master in computer and system sciences, so not a specialization, it has ML, data analytics courses and courses in information security.\n\nI joined as I thought it will be better than joining service company here.\n\nI'm not sure in what I want to work.\n\nI am also doing an internship in ML but I am not that good in ML.I have completed 5 months internship.\n\nI improved in ML but not that much.\n\nThere there are not giving FTE.  I am interested in web apps also but difficult to write complete web apps. I learnt ReactJS and can create pages but difficult to do complex web apps .\n\nAlso I am doing flask apps for internship but difficult to do complex apps . I am also trying to do blockchain.\n\nI want to do better so after masters I can get opportunities.",
  "metadata": {
    "author": "BornCondition1756",
    "url": "https://www.reddit.com/r/PESU/comments/14le7ck/need_career_advice/",
    "permalink": "/r/PESU/comments/14le7ck/need_career_advice/",
    "score": 13,
    "created_utc": 1687970030,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jq3djzf",
      "body": "So Like What exactly is Your Question?\n\nIf You want to ask about Whether You Should Pursue Masters from that Average College (IF You have means for it and You are Comfortable with it) or Join 7LPA Job.\n\nThen I guess it's Obvious You Should Pursue Masters because $>>INR and If You Join any Normal Company Abroad then also You will be Paid Minimum Dollars which Varies from Country to Country but will be much more than 7LPA even if we factor in PPP."
    }
  ]
}