{
  "id": "14mqr5v",
  "title": "Mechanical in RV or PES ?",
  "content": "Hello, \n\nBased on my CET ranking, I may get Mechanical in either RV or PES.\n\nNot particular about the branch part, since I plan to pursue MS abroad after by BE.\n\nWould very much appreciate your guidance on which college would be a better choice with respect to \n\n&#x200B;\n\n1. Professors and Faculty\n\n2. Research facilities\n\n3. Opportunity to learn new things, instead of tied down only to course content. \n\n4. Hostel facilities\n\n5. Most important weightage of the College TAG in pursual of MS\n\n&#x200B;\n\nAppreciate your kind guidance",
  "metadata": {
    "author": "reddit_proton",
    "url": "https://www.reddit.com/r/PESU/comments/14mqr5v/mechanical_in_rv_or_pes/",
    "permalink": "/r/PESU/comments/14mqr5v/mechanical_in_rv_or_pes/",
    "score": 7,
    "created_utc": 1688100975,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jq3crtz",
      "body": "RV"
    },
    {
      "id": "jq3fjix",
      "body": "I can't comment in detail about this, and my answer is solely based on what I've heard so you should get this verified.\n\n1. The Mech department at PESU isn't really in a good state right now, and there are even rumours of the branch being axed in the near future to make way for Mechatronics. A lot of the faculty has left from PES, and overall most profs aren't equipped to teach. However, the syllabus at PES is better and more updated from what I've heard, but it's hardly a saving grace.\n2. The research clubs haven't been doing well for the last few years as well. There were some really good clubs but over the years they've been really silent/dead. However there are ongoing efforts to revive them. You'll receive better opportunities at RV I think.\n3. I can't comment about the hostel, someone else can share about that.\n4. As for college tag for MS: unfortunately neither college will be looked at in a *special* manner. Regional top colleges and NIRF ranking is irrelevant for Masters abroad - they ony see if you're from IIT/NIT/BITS/IIIT or not\n\nOverall, I would suggest RV, maybe u/ChromaticChaos can share some more details"
    },
    {
      "id": "jq3gda2",
      "body": "Pretty much accurate"
    },
    {
      "id": "jq3gqno",
      "body": "5th one doesnt matter for nom-iit/nit\n\n1-2 prolly rv\n3 depends on u\n4 no clue"
    },
    {
      "id": "jq3okqo",
      "body": "Go for rv no doubt"
    },
    {
      "id": "jq3p6y5",
      "body": "Just graduated from mechE, PES this year and going abroad for my MSc in a few months.\n\nBetween PES and RV, there’s not much weight in the name/tier of college, but I believe RV offers up much better opportunities for you to do well and stand out.\n\nThe faculty and student intake at PES is now dwindling, with many good profs leaving.\n\nDefinitely speak to someone in RV before taking a call but yeah I would lean towards that rather than PES in today’s day and age."
    },
    {
      "id": "jq3rumy",
      "body": "Thanks a lot seniors, for sharing your knowledge and experience in the domain. \n\nWill definitely give a serious consideration to RV insights before taking a call."
    },
    {
      "id": "jq3tsdt",
      "body": "Stay away from pes. Run away and don't look back"
    },
    {
      "id": "jq4eiqm",
      "body": "RV"
    },
    {
      "id": "jq4r29l",
      "body": "Same branch in two different colleges, choose the better college.  \nIn this case, it's RVCE ;)"
    },
    {
      "id": "jq5mzad",
      "body": "RV"
    },
    {
      "id": "jqa2188",
      "body": "RVCE has direct ties with bosch and mercedes in mechanics and has workshops and all the required facilities youll need .  \nVisit RVCE mechanical branch and youll know XD"
    },
    {
      "id": "jr8zfkv",
      "body": "iirc, pes too has those exact same ties"
    },
    {
      "id": "jr99mv5",
      "body": "i dont know about that but i didnt see pes mention those   \nbut rv has an entire building for the workshop"
    },
    {
      "id": "jr9bqv6",
      "body": "possibly cuz no one cares about mech.\n\nand pes also has an entire building for the workshop. its next to the backgate, behind to thr futsal ground. 2 floors high, has 2 wind tunnels built in collab with ardb (drdo), while are 3rd wind tunnel is on 7th floor be-block."
    }
  ]
}