{
  "id": "14nqea4",
  "title": "Reasons to consider Pes cse over Bms/ Ramaiah cse",
  "content": "Title",
  "metadata": {
    "author": "Free_Secret5472",
    "url": "https://www.reddit.com/r/PESU/comments/14nqea4/reasons_to_consider_pes_cse_over_bms_ramaiah_cse/",
    "permalink": "/r/PESU/comments/14nqea4/reasons_to_consider_pes_cse_over_bms_ramaiah_cse/",
    "score": 6,
    "created_utc": 1688202516,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jq8phep",
      "body": "Because"
    },
    {
      "id": "jq8pv8e",
      "body": "Most people go purely by the placement perspective :)\nBms follows the VTU syllabus which is pretty (very) crap. Idk about ramiah honestly, most adults don't seem to like the vibe surrounding ramiah. Pes is known to be strict and stuff.\nIn all honesty get in touch with seniors from each college and ask them , random people will just feed you their own bias , just like I did xD"
    },
    {
      "id": "jqa4g4j",
      "body": "going to uni💅🏻 is cooler than going to a college"
    },
    {
      "id": "jqcoekj",
      "body": "VTU is following NEP now, the syllabus has changed a lot and it's not as bad. Also both BMS and Ramaiah have the same syllabus as RVCE (All 3 are VTU colleges). The only reason anyone would consider PES instead of these two is placements."
    },
    {
      "id": "jqcopnm",
      "body": "I wasn't aware about that , although I've read about the government trying to make VTU the new \"IIT\".\nSounds skeptical but if it's true , good for us"
    },
    {
      "id": "jqd45rc",
      "body": "Because it is better than Carnegie Mellon"
    },
    {
      "id": "jqd5gwo",
      "body": "PES has better peer group and more over a better crowd than BMS."
    },
    {
      "id": "jqlk0wt",
      "body": "Yes, PES is stricter and more workload, but you'll learn to live with it.\n\nIt provides you with more internship opportunities, more project opportunities, on graduating much better placements and if you're looking to do further studies a degree from PES puts you in very good standing.\n\nBMS and Ramaiah just like any other college in Bangalore don't even conduct exams on time. PES will ensure you get a summer break from mid May to mid August which opens up so many opportunities to do internships."
    },
    {
      "id": "lf6nl5m",
      "body": "Lol"
    }
  ]
}