{
  "id": "14nwc1m",
  "title": "Laptop ECE",
  "content": "I’ve a Ryzen 7 4800H ,RTX 3050 16gigs DDR4 ram Asus Tuf will it survive all 4 years of ece ?? ",
  "metadata": {
    "author": "faltu_aadmi",
    "url": "https://www.reddit.com/r/PESU/comments/14nwc1m/laptop_ece/",
    "permalink": "/r/PESU/comments/14nwc1m/laptop_ece/",
    "score": 9,
    "created_utc": 1688221297,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jqa1bpi",
      "body": "yes"
    },
    {
      "id": "jqac9xg",
      "body": "I have a option to give it to my sister and buy a new one under 70k or buy a new one for her (gaming obviously)\nAny recommendation what I shall do or what should I buy?"
    },
    {
      "id": "jqc8lou",
      "body": "The question you should be asking is will TUF be able to survive for the 4 years 😂\n\nLast i have seen, the durability is pretty bad"
    },
    {
      "id": "jqcb72q",
      "body": "I've an option to give it to my sister and buy a new  laptop (under70k) for me shall I do it ?(I'm OP another Id)"
    },
    {
      "id": "jqcc2r0",
      "body": "If your sister doesn't need a laptop, then don't\nJust fingers crossed laptop is durable"
    },
    {
      "id": "jqccdc2",
      "body": "Either she gets a new one or she gets asus tuf . She needs one either way"
    },
    {
      "id": "jqcdf5b",
      "body": "Umm\n\nCan't make these decisions for you man 😂\n\nAs an engineer, keep the tuf, it has a good Graphics Card\n\nIf you need to buy another, get a Dell or something (G series)"
    },
    {
      "id": "jqcdvg6",
      "body": "Thanks I was thinking to get an IdeaPad gaming 3 i5 12th gen rtx3050 one now will think about Dell G15 too .\nThanks a lot"
    },
    {
      "id": "jqcgfci",
      "body": "Get the IdeaPad. I have the older version and it's quite nice. The older version wasn't great at cooling but the newest version is significantly better. Check jarrods tech video on that. Also get the 165hz screen as well."
    },
    {
      "id": "jqckme7",
      "body": "Bhai barde faltu admi wala sawal krte ho bhai! 🤣🤣\nAnd yes"
    },
    {
      "id": "jqcs1je",
      "body": "Nah was concerned that might need to run Ansys or  similar software which will need better gpu"
    }
  ]
}