{
  "id": "14ok6zi",
  "title": "why are ppl on this sub dissing pes?",
  "content": "I recently saw a post asking whether pes is bad and everyone said it's bad. why is it bad? I heard extremely good reviews. haven't heard a single bad review. even the seniors I talked to said its extremely good. I keep hearing it's comparable to many Nits and better than other private colleges like Manipal (ofc in terms of academics. campus wise it stands no chance)",
  "metadata": {
    "author": "goodjeetard",
    "url": "https://www.reddit.com/r/PESU/comments/14ok6zi/why_are_ppl_on_this_sub_dissing_pes/",
    "permalink": "/r/PESU/comments/14ok6zi/why_are_ppl_on_this_sub_dissing_pes/",
    "score": 2,
    "created_utc": 1688290752,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jqd3yg6",
      "body": "We have seen things never thought imaginable. turn back and run away before it's too late"
    },
    {
      "id": "jqd4g3k",
      "body": "Yeah, Stanford and Carnegie Mellon CSE peeps are feeling the heat in bagging the placements due to PES superiority. They must be spreading these rumours."
    },
    {
      "id": "jqd4qry",
      "body": "what have you seen 😭 😭"
    },
    {
      "id": "jqd7h4o",
      "body": "Check the pros and cons post on this sub dude. Also go through other posts here, you'll figure out why. This place is a shitshow. Except Placements, everything is a tragedy."
    },
    {
      "id": "jqd9cqn",
      "body": "Oh you wanna know what's wrong? The college recently gave 0 in assignments to half the students, as a technical glitch, and refuses to change anything lol."
    },
    {
      "id": "jqd9xzu",
      "body": "Well I have suggested people to not opt for PES if they have a similar option or a slightly inferior one.\nI just cannot justify the nearly 5L fees for merit students in PESSAT. \nNothing in PES is worth that fees. Other colleges also have placements. And with the very high seat count and both campuses being pooped for placements most people will not get those dream jobs."
    },
    {
      "id": "jqdhhnh",
      "body": "Because we've paid so much money and might not even get a decent job because of the unimaginably high competition here. Also the management is shit.\n\nKcet people regret not taking RVCE/BMS/MSRIT, pessat and management people either just suffer in silence or don't give a shit about anything at all, nothing in between."
    },
    {
      "id": "jqdmd7c",
      "body": "I did my MTech from PES even though I would have gotten BMSCE through PGCET. There's not a day I don't regret taking this decision. My career is fucked up. I lost two years, and the college gave zero shit for MTech placements. Why have MTech if you don't care? Fucking Doreswamy.   \n\n\nI went to meet Jwahar because I was worried about placement scenario. He said take your CV and roam around Peenya and look for a job. He gave me lecture about initiative and what he would do if he was in my place. Fucking idiot. Not everyone's dads are Doreswamy and has a university as your inheritance."
    },
    {
      "id": "jqe8iij",
      "body": "Very ordinary faculty."
    },
    {
      "id": "jqe9h6k",
      "body": "i feel sad for the students who join with 11L fee after looking at the 17.99LPA average placement on their website"
    },
    {
      "id": "jqe9pd1",
      "body": "No but I think they do mislead with the avg placement stat. \nThe relatively right stat is the median placement.\nEven if one person gets 60L CTC (ofc padded with stocks) the average will go up"
    },
    {
      "id": "jqecemo",
      "body": "what do you think about the median? im joining pes ec campus for the next year btw"
    },
    {
      "id": "jqed2wm",
      "body": "See man I’ll be honest with you. \nMy batch had like 500 CSE students from both campuses and 500 odd ECE and ISE.\n\nDay one 1000+ students were sitting for placements. \nMost did get placed but many only got 6-7LPA Jobs.\n\nRight now I’m guessing there are 1000+ students in just CSE. So you will have way more competition.\n\nThe jobs have not increased at the same rate though.\nIf you’re lucky you will get a very good package. But if you you might have to start with 6-7Lpa and build.\n\nThese stats are all convoluted by the few super high packages."
    },
    {
      "id": "jqh1twv",
      "body": "To be honest, the quality of pes has decreased over the years. The management is not good. The fees has also increased by a lot. Many of the really good professors have left, some of the professors are ok and others have no idea what they are teaching. If you are joining pes, be ready for self study as you can't expect good professors. \nAs of now, they have increased the no. of internals from 2 to 5 and there are ton of assignments. So, you won't have time to do anything else except study for exams. \n\nSyllabus wise, you can say that its at par with nits and iits. People generally join pes as no. of companies that come for placements are very high. That's the only plus point here. Of course, if you are getting colleges that are lower in ranking than pes, then joining here would be the best choice."
    },
    {
      "id": "jqhjt9p",
      "body": "https://www.reddit.com/r/PESU/comments/13ygg68/general_discussion_pesu_pros_and_cons/?utm_source=share&utm_medium=android_app&utm_name=androidcss&utm_term=1&utm_content=2\n\nAlready discussed here!"
    },
    {
      "id": "jqi2tr1",
      "body": "thank you v much for typing all this 😭😭😭  \nThanks once again"
    }
  ]
}