{
  "id": "14olx32",
  "title": "Suggestions for College",
  "content": "I am really interested in computer science and have heard that both PES and RV are good colleges to choose from. I am also getting BITS Hyd/Goa dual degree in Msc Math according to last year cutoffs, but I feel that taking a dual degree doesn't guarantee a Computer Science degree and is very risky. I also got a seat in VIT Vellore CSE but felt that the other options that I have are much better. Please help me a choose a college highlighting the pros and cons of the college that you suggest. \n\n[View Poll](https://www.reddit.com/poll/14olx32)",
  "metadata": {
    "author": "L_27_",
    "url": "https://www.reddit.com/r/PESU/comments/14olx32/suggestions_for_college/",
    "permalink": "/r/PESU/comments/14olx32/suggestions_for_college/",
    "score": 3,
    "created_utc": 1688296877,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jqdd8kx",
      "body": "If you want to do cse , RV is the obvious choice.\n\nIf you're interested in math go for bits. If you aren't,  I'd say avoid it , mostly you'll end up in a circuital branch and you'll have to do both math and electrical together , which is very hard.\nMath Is a very useful degree to have tho."
    },
    {
      "id": "jqddvvo",
      "body": "I am interested in math but I've heard that the math after 12th is very different compared to the math before it so I'm pretty sceptical about it. I was a little against choosing bits dual because I really like computers and don't really have a fascination towards electronics and the other circuital branches.\n\nThe general consensus that I've heard about RV and PES was that RV in general is better than PES but the computers branch in PES is better than RV, which is why I'm really confused and struggling to make a definite choice."
    },
    {
      "id": "jqdhcl3",
      "body": "Math after 12th is very abstract ,I'd suggest taking a look at the syllabus and a video on YouTube of how bsc math course is taught.\nBits as a college is an amazing place , permitted leave for startups , great peer group , good faculty ,  but all of that is worthless if you're not interested in what's being taught tbh , and math+electrical branch is the hardest fucking combination you can take up,  you'll have almost no free time.\nI've heard pes is only good for placements but rv has a better club culture , better peer group and better masters prospects."
    },
    {
      "id": "jqdlj72",
      "body": "Overall, RV is a much better option. Check some of the recent posts comparing PES and RV"
    },
    {
      "id": "jqljfeq",
      "body": "PES RR CSE over RVCE CSE anyday.\n\nYes, you will suffer in PES, cry, curse everyone and everything and on graduating have an incredible burning hate for everyone involved.\n\nBut on graduating PES CSE puts you in a far better position than RV CSE. Also RV CSE isn't exactly paradise either.\n\nAlso, I feel the peers in PES are better in general than RV."
    }
  ]
}