{
  "id": "14pkcrk",
  "title": "Looking to buy a laptop for CSE",
  "content": "Seniors who have studied CSE at PESU\nWould a 16gig m2 MacBook Air or even the base variant suffice for the course or are there any specific softwares that require windows or maybe more ram , I’ve had poor experiences with windows laptops in the past and I’m looking to switch soon so just want to know if it would be fine with the CSE course",
  "metadata": {
    "author": "Small-Hold-7223",
    "url": "https://www.reddit.com/r/PESU/comments/14pkcrk/looking_to_buy_a_laptop_for_cse/",
    "permalink": "/r/PESU/comments/14pkcrk/looking_to_buy_a_laptop_for_cse/",
    "score": 2,
    "created_utc": 1688393949,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jqic56v",
      "body": "Don't get base m2, there is a issue with the ssd of m2, get m2 512 gb storage or get macbook m1 air base model, if you got money get m2 pro base model (best)\n\nM1 macbook air base model is still 3 to 4 times powerful then most windows pc out there.\n\n\nBasically for programming m1 is best, as everything works in m1, m2 something you need to go deep into the internet to find a way or wait, but Basically everything works for programming. Base ram is enough for a student. Even its enough for professionals \n\nDon't buy a windows until your planning to game lol  😅 🙃 , still you can run windows Virtually on mac and run that game."
    },
    {
      "id": "jqipi5a",
      "body": "Noted ,thanks for the suggestions"
    },
    {
      "id": "jqj0ruw",
      "body": "I bought an M1 MacBook Pro when M2 series had just come out, and I remember going through a shit ton of reviews just so I could be sure of my purchase. M2 had quite a few problems with the ssd and there wasn't much of an upgrade from the M1 series, so I went ahead with the M1. Don't know if it's the same today. \n\nIt's been a year now and my laptop feels just like it did when I first took it out of the box. Get the M1 MacBook Air instead of the pro because spending an extra 20-30k just for the touchbar is just stupid, trust me. You'll barely even use the touchbar."
    },
    {
      "id": "jqkpwkl",
      "body": "Ye I’m not considering getting the 13inch pro cause like you said I do not need the Touch Bar"
    },
    {
      "id": "jqlj48t",
      "body": "Agree. But as someone who recently graduated PES CSE using a macbook I would recommend going for 16GB RAM. 8GB will not suffice if you actually intend on using it for things other then web surfing."
    }
  ]
}