{
  "id": "14q4dt9",
  "title": "ECE Placements",
  "content": "How are the ECE placements (non-cs roles) and do a lot of ECE students opt for higher studies?\n\nand What is a realistic number for a student in ECE with a CGPA of 8-8.5 at the end of engineering?",
  "metadata": {
    "author": "Pitiful-Car-9475",
    "url": "https://www.reddit.com/r/PESU/comments/14q4dt9/ece_placements/",
    "permalink": "/r/PESU/comments/14q4dt9/ece_placements/",
    "score": 10,
    "created_utc": 1688443728,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jqliu6w",
      "body": "It isn't great lol. A close friend of mine was keen on core ECE roles and he got placed in a company where the JD was exactly that. On joining the company it turns out he had only frontend related work.\n\nA decent number of ECE students do opt for higher studies, yes.\n\nGraduating from ECE, 8-8.5 is a pretty good CGPA, you should have nothing to worry about."
    },
    {
      "id": "jqlrpib",
      "body": "A good number of ECE students go for higher studies and a majority of students fall in between 7-8 cgpa in ECE"
    },
    {
      "id": "jqmrqzz",
      "body": "oh alright   \ncould you give  rough range if possible?\n\nand do people generally go for MBA or MS"
    },
    {
      "id": "jqmrt82",
      "body": "do they opt for MS or MBA\n\nand if MBA do you know anyone who I could connect with"
    },
    {
      "id": "jqmzl0z",
      "body": "Number of students opting for higher studies? Atleast 30%. These 30% go either directly after college or max a year or 2 after and they go for MS. Another 20-30% work for 3-4 years and then go either MS or MBA"
    },
    {
      "id": "jqpuwfb",
      "body": "All my friends are going for MS, so I’m not sure"
    },
    {
      "id": "jqqqb74",
      "body": "if one opts for placements then how are the numbers like"
    },
    {
      "id": "jqqqk6n",
      "body": "If your CGPA is above 8.0 you will have no trouble getting a package of around 13-14LPA. A small handful may get between 18-23LPA."
    },
    {
      "id": "jqqyfwv",
      "body": "for ECE?"
    },
    {
      "id": "jqqyk1j",
      "body": "I thought those numbers were for CSE  \nCould you please help me   \nas I was planning to prepare for product management and will try to keep my CGPA between 8-8.5 in ECE.  \nI would not be going for coding jobs as I don't like it."
    },
    {
      "id": "jqrbmf2",
      "body": "yes"
    },
    {
      "id": "jqsalwo",
      "body": "XD\nYes for?😅"
    },
    {
      "id": "jqwmfb6",
      "body": "CGPA is important but that would not be the first criteria I would consider to think.   \nFirst and foremost question should be to answer why MBA?  \nMoreover, I am not that keen towards doing and higher study immediately after a degree (ex: BE/Btech).   \nI strongly suggest to gain industry/work experience after BE. It could be own venture,/entrepreneurship/work in a firm\n\n&#x200B;\n\nThe actual work experience would open up perspectives which an individual had not thought of .. Without quality work experience,  quality perspective MBA will not render good learning/benefits\n\n&#x200B;\n\n  \nA good cgpa above distinction is good to have.   \nBut more importantly an individual need to build a comprehensive experience. study/hobby project/other initiatives/social concern/building ideas and showcasing creativity. It's a combination and weighted average of all these is would get an individual into ivy league. \n\n&#x200B;\n\n*MBA within india:*  \n*You have option of taking CAT and GMAT*  \n*Of course, ISB and IIMs(A/B/C/I/L/K) are extremely good and on par with top world universities*  \n*Outside India:*  \n*Mostly GMAT + university specific entrance tests*"
    },
    {
      "id": "jqwmn9j",
      "body": "I suggest you take CIE L1 & L2"
    },
    {
      "id": "jqwn0ot",
      "body": "ECE Placements for non CS means -> Core ECE which are not so good and number of companies that come to PESU are also low in number. Afaik a good amount of Students opt for Higher studies too. \n\nDefine \"realistic number\" xD ??"
    }
  ]
}