{
  "id": "14qa6ho",
  "title": "Is PES university good for BCA? its too late to join christ and other acclaimed degree colleges for bca, so is 2 lakhs (per year) worth it for BCA?",
  "content": "also in christ the fees is nearly 1.5 lakh (i didnt have idea about christ entrance exam then) same goes to other colleges too",
  "metadata": {
    "author": "Wooden-Surround1475",
    "url": "https://www.reddit.com/r/PESU/comments/14qa6ho/is_pes_university_good_for_bca_its_too_late_to/",
    "permalink": "/r/PESU/comments/14qa6ho/is_pes_university_good_for_bca_its_too_late_to/",
    "score": 4,
    "created_utc": 1688462337,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jqm53u0",
      "body": "My two cents,  \nIf you want to do MCA try for a cheaper college and save your money\nEven 1.5 lpa for christ sounds too much , I can't believe their placements would be 5 lpa average , that's just too much imo"
    },
    {
      "id": "jqm55ef",
      "body": "[I am not a BCA student here but I know a person who's doing bca at jain uni and they have a similar fee]"
    },
    {
      "id": "jqm5xq3",
      "body": "Thanks\nBy any chance do you know how are the placements for BCA in PES?"
    },
    {
      "id": "jqmmf1e",
      "body": "Hey there , I joined BCA this year at PES , honestly I wrote Christ ET and got in too but Christ was really biased towards a certain religion and they take every chance to take money out of you ( no offense just my experience) but for PES its firstly a engineering college and has good exposure , I did speak to administrative block about placements and stuff it sounded good to me  , if you want to know more about it just DM me ."
    },
    {
      "id": "jqmpjcc",
      "body": "2023 is literally the first batch dude"
    },
    {
      "id": "jqn7696",
      "body": "Oh aight"
    },
    {
      "id": "l3ticnf",
      "body": "Bhaiya, It would be very helpful if you can provide some of insights 🙏🏻"
    },
    {
      "id": "l3uv87h",
      "body": "I'm not a student of PESU. I'm sorry"
    }
  ]
}