{
  "id": "14qjghb",
  "title": "How is PES for design?",
  "content": "What thw question says. I've gotten into the RR branch and the campus seems alright. I'm considering it mainly for the nominal fee and it's close to my residence + the brand name for engineering. Have heard the crowd is not good. Any input is appreciated",
  "metadata": {
    "author": "Acceptable_Pie_7237",
    "url": "https://www.reddit.com/r/PESU/comments/14qjghb/how_is_pes_for_design/",
    "permalink": "/r/PESU/comments/14qjghb/how_is_pes_for_design/",
    "score": 6,
    "created_utc": 1688487200,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jqqhg6o",
      "body": "Nominal? How is pes bdes fee nominal? 4 lakh an year right?"
    },
    {
      "id": "jqqhi7j",
      "body": "And to answer your question, I've talked to a senior and they had fairly positive things to say , join the discord (pinned) and ask for help from a bdes person"
    },
    {
      "id": "jqqhm0v",
      "body": "For a design degree that's nominal. Sristhi manipal comes to 7 lpa"
    },
    {
      "id": "jqqhpdy",
      "body": "Thank you so much! If you don't mind me asking, are you a bdes student?"
    },
    {
      "id": "jqqi66n",
      "body": "Wow , damn"
    },
    {
      "id": "jqqi9zy",
      "body": "No not in bdes , but I'm in the pes discord server and I enquired about bdes for a friend , and a bdes enior told me bdes had really passionate people and good projects. I'd suggest join and verify yourself and take the decision"
    },
    {
      "id": "jqqimz4",
      "body": "I've talked to a senior and she had very positive feedback plus my parents are dead set on pes so I've not much choice but thanks for the input haha"
    },
    {
      "id": "jqqk9p6",
      "body": "Welcome to pes :)"
    },
    {
      "id": "jqql1hf",
      "body": "🙏"
    },
    {
      "id": "jqrfzp6",
      "body": "Hii I'm in PES design, if you have any questions, you can DM me anytime :)"
    },
    {
      "id": "jqrh4bk",
      "body": "That's very helpful! Thank you so much and I hope you realise I'm going to bombard you with questions (apologies in advance)."
    },
    {
      "id": "ky0wg2x",
      "body": "Hi guys, just found this chat, i'm in 12th wanted to explore bdes in pes could you pls guide me. I heard about the toxic culture and bad faculty for design. If you dont mind can i ask a few questions or dm?"
    },
    {
      "id": "kyh7fu7",
      "body": "Hi guys, just found this chat, i'm in 12th wanted to explore bdes in pes could you pls guide me. I heard about the toxic culture and bad faculty for design. If you dont mind can i ask a few questions or dm?"
    },
    {
      "id": "kyh8s97",
      "body": "What are your other options?"
    },
    {
      "id": "kyh96gf",
      "body": "The faculty is really good for some subjects and really mid for the others. The campus is pretty good for design and the main management also very good but the crowd is not great. If you work and want to improve you’ll be good and get support but if you don’t there’s not much they teach you or push you to be better. It’s much better than RV and a lot of other private colleges"
    },
    {
      "id": "kyhc686",
      "body": "What do you think about the placements and stuff, also which campus? Do we have proper equipments, facilities? My other options are NIFT,RV, Pearl, constricted to bangalore."
    },
    {
      "id": "kyhe93a",
      "body": "NIFT is definitely your best option of these. Design is only in the RR campus and the placements are kinda there but it’s very unpredictable. Even if you get placed you can’t tell how good it is"
    },
    {
      "id": "l1hnj5h",
      "body": "Hi. Could you tell which is better, RVU or PES? Since RV university doesn't have AICTE affiliation so I am confused."
    },
    {
      "id": "l1ho3i1",
      "body": "In my opinion pes is better but there aren’t that much of a difference. It’s on your preferences, pes has a better campus and it’s a better established university. Lot better in terms of crowd also"
    },
    {
      "id": "l1hosoo",
      "body": "I am from AP, so just on reputation we applied to RV. Since its engineering degree is quite popular. later we realised RVU is different. Thanks for your reply. We will apply to PES too. Can I DM?"
    },
    {
      "id": "mmvjtux",
      "body": "Hi, how are the placements and internship opportunities at PES for b.des in ui/ux ?"
    }
  ]
}