{
  "id": "14scoz9",
  "title": "Wifi",
  "content": "Hello seniors, will be joining pes this year as an btech undergrad. I wanted to know about the wifi speed and is it available from 1st year? Also if you wanna add some suggestions please do.",
  "metadata": {
    "author": "wtfabcd1234",
    "url": "https://www.reddit.com/r/PESU/comments/14scoz9/wifi/",
    "permalink": "/r/PESU/comments/14scoz9/wifi/",
    "score": 4,
    "created_utc": 1688657612,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jqwlhlr",
      "body": "Yes,  Wi-Fi will be accessible to everyone across campus. The password and username by default would be the **PRN**. So, you can keep using your PRN, but afaik they will also give you the password as per recent changes."
    },
    {
      "id": "jqwm87t",
      "body": "And how's the speed?"
    },
    {
      "id": "jqwp0wf",
      "body": "Lan Port???"
    },
    {
      "id": "jqwq03x",
      "body": "30-50Mbps"
    },
    {
      "id": "jqwq5jz",
      "body": "Do we have to bring a lan port with us or wireless internet will be provided?"
    },
    {
      "id": "jqwq7wo",
      "body": "Same question mate"
    },
    {
      "id": "jqx6rgs",
      "body": "Wireless network is provided"
    },
    {
      "id": "jqx6w54",
      "body": "Speed is pretty fast. But it does block several sites \\[including unexpected ones xD \\]"
    },
    {
      "id": "jqysbam",
      "body": "Wifi ranging between 30 to 50 Mbps can easily be accessed , however the number of sites that you access are limited . Like you cannot access any website which is even slightly inclined towards gaming , like even those sites which show sports news . Streaming of matches , YouTube can be done with ease without a problem . So overall yeah college wifi is good ."
    },
    {
      "id": "jqz760y",
      "body": "Would Anyone Please tell me the cutoff of ECE in PESU EC campus in round 1 of pessat counselling 2023? It would be better if I could also get the number of seats remaining at the end of the round 1 counselling."
    },
    {
      "id": "jqzd1tn",
      "body": "Don't add irrelevant comments to a topic. Please make a new post."
    },
    {
      "id": "jqzncrg",
      "body": "Okay, thanks"
    },
    {
      "id": "jr3ljll",
      "body": "Ohh yeah and uh they threaten you saying don't use VPN and stuff and if they catch you they're gonna restrict access to your ip address permanently.\nTrust me I've used them on campus , it's not an issue as such .\nSo if you wanna bypass college security then you gotta use VPN 🤓"
    },
    {
      "id": "jr4s8vr",
      "body": "Can I DM you please?"
    },
    {
      "id": "jrmhr5n",
      "body": "Yeah sure"
    }
  ]
}