{
  "id": "14sudnr",
  "title": "Possible PESSAT Cutoff for ECE round 2 PESSAT Counselling in PESU EC campus",
  "content": "Would Anyone Please tell me the cutoff of ECE in PESU EC campus in round 1 of pessat counselling 2023? It would be better if I could also get the number of seats remaining at the end of the counselling. I was thinking of joining the second round counselling but I have a pessat rank of 8.2k. Please also tell me if I can get ECE in EC campus in round 2 counselling.",
  "metadata": {
    "author": "Mainak_Sil",
    "url": "https://www.reddit.com/r/PESU/comments/14sudnr/possible_pessat_cutoff_for_ece_round_2_pessat/",
    "permalink": "/r/PESU/comments/14sudnr/possible_pessat_cutoff_for_ece_round_2_pessat/",
    "score": 3,
    "created_utc": 1688698285,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jqzcg6w",
      "body": "Usually PES uploads the closing ranks from round 1 on their site. You could also join the PESU discord server and ask around for help.\n\nhttp://bit.ly/pesu-faq - this FAQ post contains the link to PESU discord."
    },
    {
      "id": "jqzkm31",
      "body": "can i participate in round 2 if i did not do it in round 1?"
    },
    {
      "id": "jqzlxhf",
      "body": "Yes"
    },
    {
      "id": "jqzm2w8",
      "body": "date pata hai?, offline hoga ye bhi?"
    },
    {
      "id": "jqzmgkm",
      "body": "Sounds difficult at 8k , last year cutoff was 4.2k for EC , this year max 6k it will go imo but can't tell. 2nd round less people show up\nIf you have other choices don't wait for 2nd round."
    },
    {
      "id": "jqzmn0m",
      "body": "Ok"
    },
    {
      "id": "jqzpmen",
      "body": "Counseling is always offline. Check website, they always post the date there."
    },
    {
      "id": "jr0p214",
      "body": "Any idea if I can get ECE in EC with 45xx in second round"
    },
    {
      "id": "jr0sxiz",
      "body": "Very likely. Cutoff was around that rank if i remember ."
    },
    {
      "id": "jr151lx",
      "body": "Sorry, which cutoff you are referring.\nLast year or first round?"
    },
    {
      "id": "jr1d7nl",
      "body": "Last year 2nd round closed at 4.1k , this year first year only was a little near to that.  So expecting 2nd round to go up too"
    },
    {
      "id": "jr1in7c",
      "body": "Muje kya mere tho main campus me cse milgye 🥱"
    },
    {
      "id": "jr8rv5z",
      "body": "Possible"
    },
    {
      "id": "l4ghlwn",
      "body": "Can I get ece in ec campus at 6067 rank? Atleast in the second round considering there was negative marking this year"
    },
    {
      "id": "lekxggm",
      "body": "in pessat 2024, i got a rank of 60XX, will i be able to get a EEE seat?"
    }
  ]
}