{
  "id": "14sw2cw",
  "title": "Alright so I gave my pessat and got 3.5k rank and after counselling I am getting ECE at RR campus and AIML at EC campus. Now I'm not very clear about which stream I really want to do but slightly inclined towards CS cuz I've studied it for about 8 yrs now but I need suggestions about the EC campus.",
  "content": "",
  "metadata": {
    "author": "shaymlesss",
    "url": "https://www.reddit.com/r/PESU/comments/14sw2cw/alright_so_i_gave_my_pessat_and_got_35k_rank_and/",
    "permalink": "/r/PESU/comments/14sw2cw/alright_so_i_gave_my_pessat_and_got_35k_rank_and/",
    "score": 5,
    "created_utc": 1688702921,
    "flair": "PESSAT",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jqzepog",
      "body": "Although the EC campus is very far from my location and untill the metro comes I need to be in an hostel which will cost me about 1.4L for a year when my fees is already 16L+ So if anyone can vouch for CS AIML in EC campus over ECE at RR campus which many people recommended due to the peer group,  main campus  better faculty etc. Also open to advice about ECE or CS as a stream cuz I've never been able to choose anyone out of the two."
    },
    {
      "id": "jqzmmis",
      "body": "Take ai ml. If you don't have interest in ece don't take it."
    },
    {
      "id": "jqzpl1k",
      "body": "Don't take ECE if you aren't interested in it. Both campuses are the same. You can check https://bit.ly/pesu-faq for info on the differences between campuses. Plus, campus is relevant for 3 years at most. Branch sticks forever."
    },
    {
      "id": "jqzxpjf",
      "body": "Hmm would like to consider it and also what are the likes of doing well in first year with ECE in re campus and with a good cgpa change branch to CS for 2nd year onwards?"
    },
    {
      "id": "jqzxw1p",
      "body": "Chances are low. Don't take that risk."
    },
    {
      "id": "jqzzm25",
      "body": "Hmm thanks bro got a clearer picture !!"
    },
    {
      "id": "jr00myb",
      "body": "Glad to help :)"
    }
  ]
}