{
  "id": "14tdv73",
  "title": "Internship in 7th semester?",
  "content": "I just got done with my 6th semester and am doing my summer internship  where I met a senior who advised me **not to do an internship** in 7th semester as it's going to become very hectic with the capstone and placement preparation. \n\nSo I wanted to know if this is correct or what? Should I do an internship in my 7th semester (if I get one). What was your experience on doing one or on not doing one. I'd really appreciate an answer on this one.",
  "metadata": {
    "author": "CurvyDoritos",
    "url": "https://www.reddit.com/r/PESU/comments/14tdv73/internship_in_7th_semester/",
    "permalink": "/r/PESU/comments/14tdv73/internship_in_7th_semester/",
    "score": 5,
    "created_utc": 1688751411,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jr6a3iv",
      "body": "Well, I'm done with my 6th sem as well but not doing any summer internship. I really think if you do an internship during your 7th sem, you should be able to get a PPO by the end of it  otherwise it would fosho affect your placement prep. But if you really love to work on the particular project or if you think it adds a great value to your resume, go ahead!"
    },
    {
      "id": "jr97m4s",
      "body": "Thanks for the advice!"
    },
    {
      "id": "jr9deta",
      "body": "We didn't have any credits for internship completion in 7th sem so I was not interested either.              \nI personally feel not doing an internship in 7th sem helped me focus on my placement prep. It might get hectic with capstone project and placement prep too.\n You can focus on campus placements and do an internship in 8th sem as that would be included in credits completion."
    },
    {
      "id": "jr9hmfd",
      "body": "considering all the topics I need to cover for DSA, it makes sense to prepare for placements instead of internship. Thanks for the answer!"
    },
    {
      "id": "jrb1n5b",
      "body": "Np. You can dm if you need any other advice. I'd be happy to help :)"
    },
    {
      "id": "mnlomn5",
      "body": "can i dm you , i have some doubt"
    },
    {
      "id": "mnp3gbc",
      "body": "Sure"
    },
    {
      "id": "mrcq2vr",
      "body": "Hello I wanted to ask that in the end what decision did you take and how it affected you, as right now I am also thinking if I should do internship in 7th semester or not. I would be really thankful if you can answer this."
    }
  ]
}