{
  "id": "14uphdk",
  "title": "PES CSE VS RV ISE (both thru cet) pls comment on why u wud choose one over the other",
  "content": "\n\n[View Poll](https://www.reddit.com/poll/14uphdk)",
  "metadata": {
    "author": "Vishruth_M_D",
    "url": "https://www.reddit.com/r/PESU/comments/14uphdk/pes_cse_vs_rv_ise_both_thru_cet_pls_comment_on/",
    "permalink": "/r/PESU/comments/14uphdk/pes_cse_vs_rv_ise_both_thru_cet_pls_comment_on/",
    "score": 1,
    "created_utc": 1688878825,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jr8z71l",
      "body": "Can someone tell me what's the major difference between ISE and CSE and how much % of the curriculum is similar?"
    },
    {
      "id": "jr94zhl",
      "body": "Idk about similarity in syllabus but normally the average placement package of ISE is higher than CSE. And also a lot of times ISE students gets the highest package"
    },
    {
      "id": "jr984yr",
      "body": "Woah 😳"
    },
    {
      "id": "jr9q8c7",
      "body": "What's ur cet rank"
    },
    {
      "id": "jrabv10",
      "body": "Rv is rv it has brand name 10x better than pes, peer group is also far far better"
    },
    {
      "id": "jrd7odq",
      "body": "It's 578"
    },
    {
      "id": "jrdeult",
      "body": "RV ISE any day but check out the campus. ISE block is located near the hostels and when I visited on Saturday there was a foul stench of urine. Not sure if this is an exception but the location of ISE classroom can discourage those who are looking for clean class rooms"
    },
    {
      "id": "jrdhy1a",
      "body": "I'm pretty sure there are a lot of incoming students voting here. There's very little difference between these two colleges. Personally I chose PES CSE over RV ISE because I had gotten more reviews of PES: I had a better picture of it going in. But you'll be well off in both choices.\n\nAlso, I spoke to a prof at Columbia University, he told me that it in India, ISE and CSE may mean the same, but that's not the case over there."
    },
    {
      "id": "jrilkul",
      "body": "That's strange coz one of my seniors completed he's bachelors degree in RV (ise) and he's doing his masters in a very good university in USA"
    },
    {
      "id": "jrjkn4s",
      "body": "Literally same but for PESU😂 like I said, you'll be well off with both choices. But I had both choices and chose CSE at PES RR."
    },
    {
      "id": "jrkc8xw",
      "body": "Ok , so i seem to be in a similar position as u are .. so could pls give me an honest review abt PES CSE ? It might be a vague question but ig as a person who went thru the same situation,you might know what I'm asking abt. Pls do tell me which year u r in right now if u don't mind"
    },
    {
      "id": "jrkhkvg",
      "body": "DM me"
    }
  ]
}