{
  "id": "14w0mac",
  "title": "Please suggest is this choice filling order good or not!? My rank is 52xx. (please read body too)",
  "content": "I kept jss and nie mysore below because my prefrence towards bangalore is more. \n\nAlso I know I will not rvce cs but have just kept it. \n\nBy looking previous year cutoffs i can get these colleges(also chances are 2022 cutoffs will repeat this year since seats have increased) \n\nI just want your suggestions that whether this order is good or not or should I make any changes. Kindly state reason too for your suggestions for changing some order.",
  "metadata": {
    "author": "False_Bother8783",
    "url": "https://i.redd.it/6tmnh1snb6bb1.jpg",
    "permalink": "/r/PESU/comments/14w0mac/please_suggest_is_this_choice_filling_order_good/",
    "score": 2,
    "created_utc": 1689010601,
    "flair": "PESSAT",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jrfgajb",
      "body": "Cfbr!"
    },
    {
      "id": "jrfikdn",
      "body": "You could keep rv ece and eee above colleges like cmrit, niite menakshi,jss etc if you’re not inclined towards cs only\nCause rv ece and eee are wayy better than the colleges above mentioned"
    },
    {
      "id": "jrfo9i4",
      "body": "Ya but I don't have much idea about ece(i do have some idea) like do companies accept ece students for placements and will i have to do coding completely on my own If i take it. I'm bit inclined towards cse too."
    },
    {
      "id": "jrfofbl",
      "body": "Thanks btw will think on it!"
    },
    {
      "id": "jrfrhjo",
      "body": "yeah most cs companies do let ece students to sit too and yeah you gotta learn coding on the sides (either ways you have to cause the faculty is kinda trash in most colleges even for cs)\nBut yeah cs is easier and you get more time to code but I would suggest pick ece only if you have interest in it"
    },
    {
      "id": "jrfvfb3",
      "body": "Comedk?"
    },
    {
      "id": "jrfvurt",
      "body": "Is cmr, RNSIT and gitam better than BNMIT?? Though BNMIT is strict, I've heard otherwise."
    },
    {
      "id": "jrg3mhs",
      "body": "Don't pick ECE if you aren't interested in it. It'll be difficult to handle it along with your interest in CS"
    },
    {
      "id": "jrhk82s",
      "body": "\\> also chances are 2022 cutoffs will repeat this year since seats have increased\n\nI just need this much copium"
    },
    {
      "id": "jrhlhx7",
      "body": "Hey, I'd also suggest you to add MSRIT CSE Cy and such courses of other good colleges. It seems like you missed those"
    },
    {
      "id": "jrhoxdh",
      "body": "No bro i have looked at it but as much as i have researched cyber security doesn't have that much scope in India as of now also you don't get that much pakage(though getting oakage in cse is also not easy). So i don't know much about the branch that's why i left it...what would you suggest? Will do check out more on it."
    },
    {
      "id": "jrhp1zo",
      "body": "Lol just hopium!"
    },
    {
      "id": "jrhpemn",
      "body": "Ya that's why I kept it bit low! Also it's average is bit less compared to cmr(my sources can be wrong: shiksha.com) But ya noted! will look at it...btw thanks bro!"
    },
    {
      "id": "jrhph56",
      "body": "Yes! Forgot to mention sorry.."
    },
    {
      "id": "jrhpnj7",
      "body": "Thanks a lot bro will think on it!!"
    },
    {
      "id": "jrhpwp9",
      "body": "Ya because i think i will have to manage ece(since profs obviously don't teach anything) and cse so will think on it...also that's why have just added ece of rvce only!"
    },
    {
      "id": "jrhrmil",
      "body": "Bro who said you won't get good packages for cyber sec? 💀\n\nA cyber sec professor told me Cyber security is one of most lucrative fields, if you do stuff right. Seniors will be able to better answer this.\n\nMoreover, CSE and CSE Cy have pretty similar courses up until the 2nd year, so... You won't lose anything and you also come under the umbrella of CSE if placements are what you are concerned about"
    },
    {
      "id": "jrhz0n1",
      "body": "Thanks alot bro i didn't knew about it that much i think quora answers shouldn't be trusted blindly!! Will try to reach out some senior and will surely add this branch!"
    },
    {
      "id": "jriptz3",
      "body": "I think it(rvce ece) can be kept below nitte meenakshi cse specialization (since my prefrence towrds cse is more)"
    },
    {
      "id": "jrksevu",
      "body": "Itne options kyu bhai at 52xx? Most likely bmsce/msrit me cs spec mil jayegi."
    },
    {
      "id": "jrkua8f",
      "body": "Bhai vo thora safe rehne k lie... aur thoda acha feel krne k liye...jee mae ni kr paya(60k disappointment wala emoji) socha yhi krlu!"
    },
    {
      "id": "jrkvu4f",
      "body": "Ece pasand nhi?"
    },
    {
      "id": "jrky2xq",
      "body": "Bhai ache clgs mae toh lelu(gfti ya iiits vgira)  but inme i think cse lena hi hada better rahega placement perspective se."
    },
    {
      "id": "jrkzsuy",
      "body": "Agar top 3 cse nhi milti to ( spec. to mil jani chaiye) to rvce ece better hai baki colleges se."
    },
    {
      "id": "jrmevbn",
      "body": "Achaa..toh m visvasaraiya k cse se upr krna better rhega usae!?"
    },
    {
      "id": "jrmf8mh",
      "body": "Also beo mae ye specializations ko niche krne ka soch rha hu cause ug itne specific cheez mae krna utna worth it ni lgra like cse with specialization toh theek hae but sirf specialization krna i think worth it ni....suggestions!?"
    },
    {
      "id": "jrpsrb4",
      "body": "If you are going CS for the sake of IT placements, might get some disappointment, i think rvce ece would be better choices here\nAgain electronics is tough but doable with enough free time"
    }
  ]
}