{
  "id": "14wozkj",
  "title": "What's the difference between cse(ai and ml) and ai and ml",
  "content": "",
  "metadata": {
    "author": "False_Bother8783",
    "url": "https://i.redd.it/smutnzrfpbbb1.png",
    "permalink": "/r/PESU/comments/14wozkj/whats_the_difference_between_cseai_and_ml_and_ai/",
    "score": 0,
    "created_utc": 1689075764,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jrizaz0",
      "body": "I request you to kindly post this question in  r/ComedkColleges  r/comedk"
    },
    {
      "id": "jrj8a65",
      "body": "Ask someone from MSRIT"
    },
    {
      "id": "jrj8fef",
      "body": "But on the face of it I'd say AI/ML is a deep dive into algorithms and an in-depth understanding of the same. But CSE(AI/ML) is a CS degree with a specialization in AI/ML"
    },
    {
      "id": "jrj8nwe",
      "body": "Adding to the comments here, always prefer CS >>> CS + specialisation >> specialisation. Specialisations don't make sense in undergrad."
    },
    {
      "id": "jrja8ib",
      "body": "2nd semester B.Tech CSE(CY) undergraduate at MSRIT here.\r  \nCSE and CSE(CY) or any other CSE(spz.) for that matter share common syllabus till the end of 2nd year. After that, you'll be restricted from choosing spz. electives if you choose any of the CSE(spz.) degrees. Other than that, placement-wise, no info yet. This is due to the fact that none of the batches with that degree finished their placement-phase. College doesn't have red flags as such as of now. Management is pretty great, very organized. But it definitely isn't stress free. 7-8 subjects in the first 2 semesters with 2 internal tests and frequent quiz for internal-internal component. PESU used to have 5 ISAs but I heard that it's now reduced to 3. So stress / pressure wise, it isn't that chill here. I was in PESU for about 1.5 months before I got allotted CSE(CY) in MSRIT in the 3rd round of KCET.\r  \nAll the best for your counselling!"
    },
    {
      "id": "jrji8na",
      "body": "Ya that's what i was thinking thanks btw!"
    },
    {
      "id": "jrjibwm",
      "body": "Thanks bro for explaining so well!"
    },
    {
      "id": "jrjigat",
      "body": "Thanks bro...will keep the order in this way only..."
    },
    {
      "id": "jrjn9w2",
      "body": "Can you rate stress level from 1-10 of both pes and msrit"
    },
    {
      "id": "jrjo5zv",
      "body": "Bro it would be a great help if you could review my choice list  https://www.reddit.com/r/PESU/comments/14w0mac/please_suggest_is_this_choice_filling_order_good/?utm_source=share&utm_medium=android_app&utm_name=androidcss&utm_term=1&utm_content=share_button"
    },
    {
      "id": "jrnj0d3",
      "body": "I don't really think I can, because I don't want to propagate false information ukwim. The system has changed in PESU, so it would be wrong from my end if I do so."
    },
    {
      "id": "jv1wk0w",
      "body": "Umm so I'm starting college this year thinking of majoring in CSE or aiml rn I'm pretty confused whether to take pes or msrit or bms.Of what I've read from these posts apparently the professors are not quite qualified enough at pes ,is it the  same at msrit??"
    },
    {
      "id": "jv20upy",
      "body": "I'm still in my second semester, I think it would be wrong on my part to answer that question without knowing much. But from what I've heard, most of the professors are not qualified for AI / ML etc. across India. It's not just PESU and stuff, even over here you find a combination of good and bad teachers. So yes, I think you mostly won't find qualified teachers here either. Subject to change though, because like I already mentioned, I'm still in my mid-second semester."
    }
  ]
}