{
  "id": "14zc022",
  "title": "How would you rank PES RV MSRIT and BMSCE?",
  "content": "Rank according to everything including placements,college life, exposure, infrastructure.\n\n[View Poll](https://www.reddit.com/poll/14zc022)",
  "metadata": {
    "author": "LowInitiative4988",
    "url": "https://www.reddit.com/r/PESU/comments/14zc022/how_would_you_rank_pes_rv_msrit_and_bmsce/",
    "permalink": "/r/PESU/comments/14zc022/how_would_you_rank_pes_rv_msrit_and_bmsce/",
    "score": 9,
    "created_utc": 1689328032,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jrwz4sh",
      "body": "I've heard that most comedk colleges have a dull college life. Bms has decent college life. Pes falls in the former too ig. \n\nPlacements-wise I'd put them in this order - RV, PES, Bms, Msrit.\n\nI've seen all of the campuses and I think PES RR Campus stays on top here, infrastructure-wise. \n\nIn short, college life in all the above mentioned colleges will be sub-par."
    },
    {
      "id": "jrxh066",
      "body": "How would you individually compare the college life of BMS, Ramaiah and PES?"
    },
    {
      "id": "jrxscvi",
      "body": "I'll be honest, everything I've heard of these colleges is through word-of-mouth, but here goes.\n\nBms has a decent college life. They have a decent number of events and fests. A friend of mine studies there.\n\nRamaiah I don't really know much, but I've very often heard some not-so-good things regarding their college. Mostly regarding the students. \n\nPES on the other is very very academic-oriented. It feels like school all over again with a few differences.\n \nOut of the above options, BMS has the better college life. But in general, all of the above are average when it comes to the same."
    },
    {
      "id": "jryc56q",
      "body": "What's the deal with Ramaiah students?"
    },
    {
      "id": "jrymmgr",
      "body": "Not sure, but almost everytime I brought up MSRIT in front of friends and seniors, they'd instantly shit on the students. Never bothered asking why, but yeah."
    },
    {
      "id": "js15hg2",
      "body": "It might just be rumors but ramiah students are known to be a little rowdy and chapri , and they usually bunk classes for parties. But it's mostly a rumor cause you'll find students like this everywhere"
    },
    {
      "id": "js1o86c",
      "body": "Ouch :(\n\nWe are totally normal, I promise 🥲"
    },
    {
      "id": "js1ofib",
      "body": "Hmm I'm from MSRIT and I partially agree with you. But that small fraction of students don't represent the overall college vibes. We have a very good and chill campus with frequent events. The sad thing tho this year was that the main fest was cancelled due clash of exams"
    },
    {
      "id": "js2iqyq",
      "body": "Could be that, but to be honest, that's prevalent across pretty much every Bengaluru college."
    },
    {
      "id": "js7t2k7",
      "body": "1st year CSE(CY) undergraduate from MSRIT here.  \nThis college is academics oriented and also has a great management. Things are planned beforehand and they make sure that it runs smoothly (except the times when VTU interrupts)   \nAbout the peers, based on my experience, they're pretty nice. Very helpful, and disciplined. No bullying and they mind their own business. There's also a pleasant coding-culture with frequent hackathons taking place (held by seniors) and you'll find a lot of your peers participating / willing you participate with you."
    },
    {
      "id": "jsbx35c",
      "body": "Can you tell me should I prefer MSRIT or BMSCE for CS?"
    },
    {
      "id": "jsc07zx",
      "body": "My personal opinion: BMSCE for CSE"
    },
    {
      "id": "jsc55wn",
      "body": "Ohk thanks brother"
    },
    {
      "id": "jscrsjb",
      "body": "You're welcome!"
    },
    {
      "id": "kv48xu2",
      "body": "can you give your reasoning behind picking BMSCE for CSE over MSRIT?"
    },
    {
      "id": "kv4zvb7",
      "body": "I didn't pick it, I'm in MSRIT CSE(CY) \nI'm assuming that you meant why I'm choosing BMSCE CSE over MSRIT CSE for the poll?"
    },
    {
      "id": "kv9o0sy",
      "body": "yeah that's what I meant, why're you choosing BMSCE CSE over MSRIT CSE"
    },
    {
      "id": "kw2grth",
      "body": "I've heard that its less rigorous than MSRIT. It's somewhat debatable and between the two, there's always some sort of a confusion as to which one's better."
    },
    {
      "id": "kwysx8j",
      "body": "How is placement in msrit ?"
    },
    {
      "id": "kwzxw7o",
      "body": "Somewhat mediocre, let me know if you want the placement sheet (which is incomplete and compiled by the seniors) \nThe college is not very transparent about their placement stats and that is kind of a red flag honestly."
    },
    {
      "id": "kwzyw05",
      "body": "Ya If u could provide placement stats would be helpful"
    },
    {
      "id": "kx2mo4i",
      "body": "[https://drive.google.com/drive/folders/1cWBRZXSk4n4NJ7inJDiSrKQNvBa-UA0h](https://drive.google.com/drive/folders/1cWBRZXSk4n4NJ7inJDiSrKQNvBa-UA0h)  \n(All credits to our seniors who compiled it)  \n\n\nCouple things to note:   \n1. This compilation is mostly incomplete as the students weren't able to get the complete coverage with respect to the numbers (obviously because our college for some reason gatekeeps the stats).\n\n2. Seniors' batch had like only 350 students (CSE core+ISE) sitting for the placement, so dont get bamboozaled looking at the low number of placed students lmao.\n\n3. Sheet includes only 10+ LPA companies, as mentioned in the upper margin of the excel file."
    },
    {
      "id": "kx2mzah",
      "body": "Thanks a lot man really appreciate it"
    },
    {
      "id": "kx34lk8",
      "body": "No worries :)"
    },
    {
      "id": "kyaofcu",
      "body": "Hey! I'm in the exact same boat as OP wanting to decide between these PES, RVCE and BMSCE.. I want a decent and balanced college life.. I understand that I'll obviously have to study but I also don't want to sit in a college dorm for the next 4 years and just do that...\n\ni've heard RCVE has great placements but you have to choose 2 between fun, study, and sleep.. that is the only reason i found to not go there\n\nPES looks to be like a school... very academically focused tho and not a great college life\n\nBMSCE is the only one which says has a decent college life.. not very strict and decent academics as well... but I haven't found any cons yet which is weird and reviews for BMSCE seem to be very minimal which is not helpful and concerning\n\nWould be helpful if you could add on any more info to this.. and also which college should i go for?"
    },
    {
      "id": "kyapykh",
      "body": "Please do DM and I shall give you my opinion on all of these queries.\nIf you don't want to DM, the bottom-line reply from my end would be: Play smart and choose RVCE"
    },
    {
      "id": "l1mvva2",
      "body": "Hey so what are your thoughts now?"
    },
    {
      "id": "l1n4e15",
      "body": "hey! it depends on various factors which would be specific to you like what you're looking for, future aspirations n what route you're going through! U can dm with any specific ques u may hv"
    },
    {
      "id": "l21q401",
      "body": "."
    },
    {
      "id": "lfactdu",
      "body": "Hey can I PM your?"
    },
    {
      "id": "lfajoax",
      "body": "sure"
    }
  ]
}