{
  "id": "154i07o",
  "title": "which one",
  "content": "\n\n[View Poll](https://www.reddit.com/poll/154i07o)",
  "metadata": {
    "author": "machinegun2187",
    "url": "https://www.reddit.com/r/PESU/comments/154i07o/which_one/",
    "permalink": "/r/PESU/comments/154i07o/which_one/",
    "score": 8,
    "created_utc": 1689831181,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jsp0qsg",
      "body": "Atleast according to seniors, if you are planning to do higher studies and masters and stuff, better to choose CSE as it keeps a variety of options open"
    },
    {
      "id": "jsp2gm7",
      "body": "If it's cse+aiml you might consider it. If it's only aiml, it's a big no"
    },
    {
      "id": "jsp479q",
      "body": "What's the difference because even PES calls it Aiml but proclaims it to be CSE+aiml"
    },
    {
      "id": "jsp7xdr",
      "body": "It's just a shady way of increasing cse seats in a college and riding the AI hype train. If it's CSE+AIML to my understanding you'll graduate with a cse degree but you'll be restricted to electives of aiml only. If the course is ONLY aiml on the other hand you'll graduate with a degree for \"Btech in AIML\""
    },
    {
      "id": "jsp82xt",
      "body": "Bro pesu management is honestly stupid, every year they change the evaluation form and it's honestly a pain, please take rvce."
    },
    {
      "id": "jsp86t9",
      "body": "First year, we had 2 internals per sem, then they made it 5 internals and now for third year it's rumoured to be 3 internals.. even the teachers don't know what is going to be done and we have few weeks for classes to start.. just bullshit.. pls don't come to pesu if you have a choice..like rvce"
    },
    {
      "id": "jsp8sd1",
      "body": "PES CSE coz you don't know about AIML (new branch) whereas PES CSE is tried and tested and average placement there is about the same as RVCE CSE."
    },
    {
      "id": "jspi1vo",
      "body": "Fellow fresher here.\n\nIt really depends on the exam through you're getting them... If it's KCET, I think the seniors on this sub have been pretty clear that CS>>>> CS (spec), so you should choose PES.\n\nIf you're getting PES through PESSAT, based on what I've read, I'd suggest RV AIML"
    },
    {
      "id": "jsprav6",
      "body": "So it's just your degree? I wanna know if the curriculum also entirely changes, because I checked the syllabus for AIML and CSE and most of it is the same except a few subjects in 3rd year which might become common if you chose CS electives (basically it becomes in such a way that what CSE students learn in 5th sem , you will in 7th and what you read in 5th, they'll read that in 7th)"
    },
    {
      "id": "jsrakat",
      "body": "Very true!"
    },
    {
      "id": "jsrn07z",
      "body": "Haven't you heard about the recent suicide, you still want to come to PES."
    },
    {
      "id": "jss2yzt",
      "body": "Still thinking about pes ? Never come here"
    },
    {
      "id": "jstsqyk",
      "body": "y tho"
    },
    {
      "id": "jsvlgu3",
      "body": "Yes...RVCE is so good . A good institution covers all aspects of college life - Academia, Sports , Fests.."
    },
    {
      "id": "jv1r1fk",
      "body": "Is it difficult to get placed here??"
    }
  ]
}