{
  "id": "155fydh",
  "title": "Classes Start Date for upcoming Btech Batch (2023-2027) in PES University",
  "content": "Can someone please give an estimate date around when classes would start for the upcoming batch (2023-2027) at PES University? It was informed to us earlier that classes will start from August 7 or August 14 during the 1st round of PESSAT counselling but KCET counselling hasn't started yet and it should go on till atleast mid to late September, so for KCET students classes can only be started around end of September or starting of October, will that mean classes for PESSAT students will start early or will our classes also start along with KCET students? Also, for Comedk colleges, counselling should go on tiil atleast mid to late August which means their classes will probably start only from 1st week of September. Someone please help. ",
  "metadata": {
    "author": "Rishikesh-Kumar2004",
    "url": "https://www.reddit.com/r/PESU/comments/155fydh/classes_start_date_for_upcoming_btech_batch/",
    "permalink": "/r/PESU/comments/155fydh/classes_start_date_for_upcoming_btech_batch/",
    "score": 8,
    "created_utc": 1689922048,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jsu4koo",
      "body": "Last year, PES started classes for PESSAT candidates even before KCET counselling started and KCET students were all accomodated in a different section I guess with a different schedule"
    },
    {
      "id": "jsu6k7q",
      "body": "After Aditya's suicide, how can anyone dare to join this shitty college?"
    },
    {
      "id": "jsuhpmc",
      "body": "No choice mate, no choice, people are forced then only they go."
    },
    {
      "id": "jsujvdd",
      "body": "I answered this in a previous post: not all apples in a basket are bad. Yes PES has its share of flaws and the management is not ideal but it also does a few things right, and I've personally known and worked with a lot of profs who are genuinely great people. Besides, as someone else said: for a lot of people this is their best option. It's unfair to blame the entire faculty team for the crimes committed by a handful."
    },
    {
      "id": "jsunuhb",
      "body": "Don't have a choice tbh didn't get any better college\n\nIt was either tier 3 stuff like vit and srm or pes"
    },
    {
      "id": "jsux6s7",
      "body": "Yes, KCET ppl get alloted different sections once PESSAT kids are alloted"
    },
    {
      "id": "jsvnqwd",
      "body": "Classes for pessat guys will commence on the dated schedule..Once the kcet students are admitted, they will be allotted different sections . If the syllabus for pessat guys is covered more , then you guys will be given half a day and kcet students might go through classes till 4:30 pm to cover the lag . From second sem , pessat and kcet will be mixed ."
    },
    {
      "id": "jsyoabo",
      "body": "So will PESSAT and KCET students continue to remain in diff classes/sections or will they get mixed from 2nd sem onwards? How was it last year?"
    },
    {
      "id": "jsyobwe",
      "body": "So will PESSAT and KCET students continue to remain in diff classes/sections or will they get mixed from 2nd sem onwards? How was it last year?"
    },
    {
      "id": "jszuwp7",
      "body": "cry about it"
    },
    {
      "id": "jszuzq5",
      "body": "i love u/rowlet-owl"
    },
    {
      "id": "jszw6hu",
      "body": "They got mixed from 2nd sem"
    },
    {
      "id": "jt03lnv",
      "body": "May be the best option for you!"
    },
    {
      "id": "jt0f5y4",
      "body": "hey man my kcet rank was 12x and comedk was 19x , i could have gotten into any other college if i wanted to, unlike you whos a complete loser on internet and irl also, feel bad for you buddy :("
    },
    {
      "id": "jt0fh9g",
      "body": "LFMAO 4k comedk rank , do yourself a favor and don't attend counselling"
    },
    {
      "id": "jt0ikez",
      "body": "Looks like you topped in ADV!?\nReservation quota?"
    },
    {
      "id": "jt0ite5",
      "body": "4.5k AVD Rank (General Cat) if that matters lol"
    },
    {
      "id": "jt0izdi",
      "body": "Yeah. Saw your pic all over the media!"
    },
    {
      "id": "jt0j4v9",
      "body": "Enjoy"
    },
    {
      "id": "jt0ja74",
      "body": "get better :D"
    }
  ]
}