{
  "id": "155j1jo",
  "title": "Help finding a Job(2023 CS graduate)",
  "content": "Hello folks. I am 2023  CS Graduate from RR campus.\n\nI am not placed yet. And companies visiting college also has dropped . With each passing day I am becoming more and more anxious to the extent that its impacting my mental health \n\n I have done my internship from a decent company(got it through college). But they refused to convert it to a full time offer citing no vacancies. So I am left without a job.\nThe situation offline is even worse with hardly any postings for freshers and few which are posted has thousands of applicants of almost zero chance of receiving a callback.\n\nSo it would be great help for me of any of the seniors here could give a refferal for a opening in there company.\n\nIf not atleast guide me how best I can apply offline to maximise my chances of landing a JOB.\n\nThank you\n\nPS:I am proficient in MERN stack and Angular,Spring Boot(Worked on these two in my internship). \n\nAlso have basic knowledge of Big data(Hadoop,Spark and Streaming Spark). Along with  ML.",
  "metadata": {
    "author": "desperatefrjob",
    "url": "https://www.reddit.com/r/PESU/comments/155j1jo/help_finding_a_job2023_cs_graduate/",
    "permalink": "/r/PESU/comments/155j1jo/help_finding_a_job2023_cs_graduate/",
    "score": 23,
    "created_utc": 1689932029,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jsuhcaq",
      "body": "2021 graduate here. DM me and I'll refer you to my company."
    },
    {
      "id": "jsuhon5",
      "body": "Thank you DM'ed you"
    },
    {
      "id": "jsuibh8",
      "body": "I'm a 2022 grad. DM me and I'll try my best at referring."
    },
    {
      "id": "jsukiwa",
      "body": "Hasjob,naukri,monster,indeed,Google search..workindia,shine etc.."
    },
    {
      "id": "jsun6ce",
      "body": "Sure."
    },
    {
      "id": "jsunlvh",
      "body": "Have tried Naukri Indeed and monster.\n\nHardly few postings for freshers. And Like I said  those few will have 1000s of applicants its really difficult to stand out and get a callback"
    },
    {
      "id": "jsusj04",
      "body": "Hello , hope you are doing well.\nI am a 2022 graduate in Mechanical Engineering and want to shift my stream. Please can we connect on linkedin and then we can discuss there"
    },
    {
      "id": "jsuyvfu",
      "body": "Search on Linkedln, and Glassdoor or any other job platforms"
    },
    {
      "id": "jsw312g",
      "body": "Bro any idea why you weren't placed till now?I am kinda scared....."
    },
    {
      "id": "jsw7jn0",
      "body": "Lot of things. \nBut ultimately my own fault. I didn't prepare well. Also low cgpa was a factor. Plus recession effect hardly any good companies post dec-Jan.\nI went to HR round of 2 companies and got rejected ( Don't know what mistake I made in them).\n\nBut Yeah end of the day I have only myself to blame.\n\n\n>am kinda scared.....\n\nJust prepare very well especially now. Try to get placed before Sept End and You will be fine."
    },
    {
      "id": "jsw8fuu",
      "body": "I have done for a few. But its incredibly hard to get a callback especially with a avg profile like mine"
    },
    {
      "id": "jswao3k",
      "body": "Above 7.5 and a bit lesser than 8 cgpa should be fine right?Or is it also low :("
    },
    {
      "id": "jswdiqf",
      "body": "Its kinda a low. But don't worry you will have enough opportunities.\n\nBut you will miss some  good companies like AMD, Pure storage etc they will have cutoff above 8.\n\nAlso some will say  above 6.75 or above 7 initially. But due to sheer high number of students registering (1000+ sometimes close to 2000). They will filter again using cgpa as parameter for online test. Which will push the cutoff to high level(like 8.5-8.75 etc).\n\nBut What's done is done. Now just focus on DSA and be thorough  with DSA, core subjects and  know your projects inside out.\n\nAlso  on a side not did companies start coming or just not yet?"
    },
    {
      "id": "jswko4d",
      "body": "What percentage of cs students you think got placed?"
    },
    {
      "id": "jswnzda",
      "body": "Keep trying, that's all I can say bro. Good luck :))"
    },
    {
      "id": "jsyldcx",
      "body": " I'm from 2020 batch DM me your resume."
    },
    {
      "id": "jsyva9o",
      "body": "close to 98%-99%..almost all...i asked placement officer..tho"
    },
    {
      "id": "jsyvpkc",
      "body": "Sure."
    },
    {
      "id": "jsywywc",
      "body": "I don't know but most are placed I guess. Many(atleast some 200 or so) got PPO from their summer internship. So considering all that it will be high."
    },
    {
      "id": "jszz0aa",
      "body": "Hi, it’s recession time so it might be really hard :( Please don’t be disheartened, I’m sure you’ll get one eventually, although I understand how difficult it must be to deal with right now. Wishing you all the best. \n\nOne of my IITian cousins’ joining date also got indefinitely deferred, so he decided to prepare for MBA and go for that instead"
    },
    {
      "id": "jt0078y",
      "body": "Thanks a lot for the wishes.\n\n>so he decided to prepare for MBA and go for that instead\n\nBut won't that take close to a year atleast.\n Which as a gap year wouldn't it be problem for future??."
    },
    {
      "id": "jt3jiq8",
      "body": "A lot of people choose to take gap years to prepare for exams after college as they’re very clear about what they want…some leave their jobs to prepare for CAT / GATE too. So if the interviewers find the justification for the gap year (and also how we chose to spend it) satisfactory it isn’t usually a hindrance. \n\nPlus, most interviewers would consider the fact that there were lay-offs and hiring freeze going on at the time which may be the reason for internship not getting converted to a job."
    },
    {
      "id": "jv1q91o",
      "body": "Do companies like Walmart visit bms or msrit??"
    }
  ]
}