{
  "id": "156c3he",
  "title": "Should i do mtech in cse or ece?(btech ece)",
  "content": "**Hello folks and seniors! i am an ECE grad (2023 graduate)...unplaced(as i lost an offer unfortunately) and my gpa is around (6.75) ..i am planning to mtech or CAT ..but  i am not sure whether i should do in cse or ece if am doing mtech though i love coding . Is it feasible for me to do mtech in cse with my  btech in ece or should i do mtech in ece only or should i do CAT? . If anyone has done mtech in ece or cse.or mba..please guide me.**\n\n**I am trying for jobs at off campus....but not getting any reponse so i am planning for mtech or cat.If anybody has got placed thru off campus..plz guide me thru or help me out.**",
  "metadata": {
    "author": "Next_Programmer_7860",
    "url": "https://www.reddit.com/r/PESU/comments/156c3he/should_i_do_mtech_in_cse_or_ecebtech_ece/",
    "permalink": "/r/PESU/comments/156c3he/should_i_do_mtech_in_cse_or_ecebtech_ece/",
    "score": 7,
    "created_utc": 1690006734,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jsz0pc3",
      "body": "What areas of ECE Are you interested in? Core ECE?   \n\n\nSince u like Coding, you should have learnt some CSE stuff necessary for MTech, u can try an MTech, but GPA does matter along with it the money too."
    },
    {
      "id": "jsz60qg",
      "body": "according to my gpa..i don't think i am good at ece (i have interest in embedded c or something related to embedded system not interested in core ece).Also I don't which coaching centre is good for gate .. do u know any coaching centre that is good for gate..(from ur personal experience..if u have prepared for gate)."
    },
    {
      "id": "jszerjj",
      "body": "I am entering third year rn, I will start preparing for GATE From 5th sem on my own. I personally do not like these coaching centers. PES syllabus already covers necessary GATE Fundamentals afaik.   \n\n\nSince u like Embedded systems stuff, I know someone who is working in that field. He is currently working a prestigious company in the US."
    },
    {
      "id": "jszm29c",
      "body": "If you like coding it's best to go for mtech cse. You can cope up. Needn't worry about that. I have seen many people do mtech in cse with a different background in btech. \n\nIn case you are neither interested in ece or cse, proceed with mba.\n\nMtech in ece is also a good option provided you are interested to work in core companies."
    },
    {
      "id": "jt0obnl",
      "body": "CS guy (2023 grad )in the same boat as you.\n\nHave you already prepared for giving those Mtech entrance exams or have you given those? Or are you gonna sit and prepare now?.\n\nIf its the latter won't it be a waste of a year(gap year)?. And won't that cause problems in the future"
    },
    {
      "id": "jt0p0hy",
      "body": "I am going to sit and prepare..no other option for me"
    },
    {
      "id": "jt0pczh",
      "body": "But won't the gap year be a problem in future in terms of finding jobs?."
    },
    {
      "id": "jt0q46b",
      "body": "Not sure abt that..but I really don't know what to do right now .. that's why mtech is only option for me"
    },
    {
      "id": "k3b99du",
      "body": "hey bro, have you got the solution of the ubereat & grubhub dataset?"
    },
    {
      "id": "k3b9pqo",
      "body": "no bro"
    },
    {
      "id": "k3bi8wz",
      "body": "i am trying from past 10 hrs but i am not came with a solution \none query i somehow manage but it didn't show me any data..."
    }
  ]
}