{
  "id": "159ubcd",
  "title": "Have a laugh:scientific reality is only the reality of a monkey (homo-sapien )",
  "content": "",
  "metadata": {
    "author": "qiling",
    "url": "https://www.scribd.com/document/660607834/Scientific-Reality-is-Only-the-Reality-of-a-Monkey",
    "permalink": "/r/PESU/comments/159ubcd/have_a_laughscientific_reality_is_only_the/",
    "score": 2,
    "created_utc": 1690342355,
    "flair": "ANNOUNCEMENT :snoo:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jth6uq5",
      "body": "Have a laugh:scientific reality is only the reality of a monkey (homo-sapien )\n\nto start take the term homo-sapien A monkey made label Homo is the Latin word for 'human' or 'man' and sapiens is derived from a Latin word that means 'wise' So we have the arrogant monkey telling itself that it is WISE\n\nThe monkey homo-sapien is limited by and cannot go beyond by its senses-of which its instruments are just extensions of- and the hard wirering of its monkey brain-which limits its processing power-Thus it can only ever understand “Reality” thru the limitations of its biologically/neurologically brain thus can never go beyond those limits in understanding “Reality” Thus for monkey homo-sapien scientific reality is/can only be the reality of a monkey (homo-sapien)\n\nhttp://gamahucherpress.yellowgum.com/wp-content/uploads/scientific-reality-is-only-the-reality-of-a-monkey.pdf\n\nor\n\nhttps://www.scribd.com/document/660607834/Scientific-Reality-is-Only-the-Reality-of-a-Monkey\n\nMagister colin leslie dean the only modern Renaissance man with 9 degrees including 4 masters: B,Sc, BA, B.Litt(Hons), MA, B.Litt(Hons), MA, MA (Psychoanalytic studies), Master of Psychoanalytic studies, Grad Cert (Literary studies)\n\nHe is Australia's leading erotic poet: poetry is for free in pdf\n\nhttp://gamahucherpress.yellowgum.com/book-genre/poetry/ or\n\nhttps://www.scribd.com/document/35520015/List-of-FREE-Erotic-Poetry-Books-by-Gamahucher-Press\n\n\"[Deans] philosophy is the sickest, most paralyzing and most destructive thing that has ever originated from the brain of man.\" \"[Dean] lay waste to everything in its path...\n\n[It is ] a systematic work of destruction and demoralization... In the end it became nothing but an act of sacrilege"
    },
    {
      "id": "jtvnugw",
      "body": "I did a bit of digging online into Collin Leslie Dean (OP who keeps posting this stuff). He's been writing and posting his own nonsense like this online for at least the past 16 years and has been banned from several other forums. But it goes even earlier than that in works written 25 years ago.He's considered a fraud for claiming to have 9 degrees without any proof (and after reading his works, I have serious doubts that this individual could have successfully completed this amount of academic work.I also fed Collin's writings into ChatGPT and requested a psychoanalysis and possible diagnosis. Here are the results:\n\n* **Narcissistic Personality Disorder (NPD):** Some elements of the text, like the claimed but possibly false academic accomplishments, the emphasis on perceived superior understanding, and the denigration of others (\"stupid monkey\"), resembles traits associated with NPD. This disorder is characterized by grandiosity, a constant need for admiration, and a lack of empathy.\n* **Delusional Disorder, Grandiose Type:** If Collin truly believes his potentially false academic accomplishments, he may meet some of the criteria for this disorder, characterized by persistent grandiose delusions.\n\nGiven how frequently and habitually Collin posts his own work (often several dozen times a day), ChatGPT also offered the following information:\n\n* **Obsessive-Compulsive Disorder (OCD):** People with OCD are often compelled to perform certain rituals or routines (compulsions) to alleviate distress caused by intrusive thoughts (obsessions). If Collin feels a persistent, uncontrollable urge to write and post his thoughts repetitively, and if not doing so causes him distress, it could theoretically align with aspects of OCD.\n* **Obsessive-Compulsive Personality Disorder (OCPD):** Unlike OCD, people with OCPD often don't realize their obsessions or compulsions are excessive. They may believe their way of doing things is the \"right\" way, becoming preoccupied with orderliness, perfectionism, and control. If Collin's repetitive posting and distinctive writing style are driven by a deep-seated need for control or a belief in his way as the \"correct\" way, it might suggest elements of OCPD.\n\nLastly, ChatGPT criticized Collin's writing style, citing its repetitiveness, improper punctuation and capitalization, unclear structure, and lack of proper citation referencing. ChatGPT suggested that Collin's works would be unacceptable in academic settings and throws doubt on his claimed credentials.\n\nCollin is likely a deeply disturbed individual, and I would advise anyone coming across his posts to take this into account when considering his work."
    }
  ]
}