{
  "id": "15b2mma",
  "title": "Tentative dates for next round of PESSAT counselling and commencement of classes for B.Tech students",
  "content": "Can someone please let me know a tentative date around when classes would be starting for PESSAT students (BTech)? When we went for the first round of counselling, it was informed to us that classes will be starting from August 7 or August 14 but back then the last date to withdraw PESSAT seat was till July 17 whereas now it has been extended till August 4. If the withdrawal date stands as it is, counselling should be somewhere around 2nd week of August so when will classes be starting? In previous years, around how much gap was there after the last round of PESSAT counselling before commencement of classes? Please help. ",
  "metadata": {
    "author": "Rishikesh-Kumar2004",
    "url": "https://www.reddit.com/r/PESU/comments/15b2mma/tentative_dates_for_next_round_of_pessat/",
    "permalink": "/r/PESU/comments/15b2mma/tentative_dates_for_next_round_of_pessat/",
    "score": 5,
    "created_utc": 1690466356,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jto8ys7",
      "body": "It'd be best to contact the college itself, I don't think anyone is clear regarding this"
    },
    {
      "id": "jtobbp8",
      "body": "Is it extended to to 4th Aug ?\n\nWtf"
    },
    {
      "id": "jtrdnz1",
      "body": "Yea man they just don't inform us anything through mail. L management"
    },
    {
      "id": "jtwyhk7",
      "body": "Last time pessat 2nd round took place after commencement of classes. Classes started in September and pessat 2nd round happened after Diwali in November as far I can remember"
    },
    {
      "id": "ju2l1b2",
      "body": "bro how many days before were intimidated regarding the commencement of classes?"
    },
    {
      "id": "ju2n1zt",
      "body": "About 10 days before. First week u should have bootstrap activities followed by classes from 2nd week onwards"
    }
  ]
}