{
  "id": "15b90ee",
  "title": "Advise and tips for applying jobs offcampus",
  "content": "Can anybody who was bagged an offcampus offer this year or in the previous years guide me how you guys managed to do it?.\n\nI'm 2023 grad with avg cgpa and avg profile with no job offer in hand.\nThis combined with the recession is making it extremely difficult to get a interview callback.\n\nAny suggestions from guys who have done it would be highly appreciated ðŸ™.\n\nAlso any tips on how to get referrals?",
  "metadata": {
    "author": "unemployeddumbass",
    "url": "https://www.reddit.com/r/PESU/comments/15b90ee/advise_and_tips_for_applying_jobs_offcampus/",
    "permalink": "/r/PESU/comments/15b90ee/advise_and_tips_for_applying_jobs_offcampus/",
    "score": 17,
    "created_utc": 1690481475,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jtp8q8p",
      "body": "Would you mind telling me your cgpa... I'm in the same boat currently... Is ur cgpa the reason you didn't get an offer oncampus"
    },
    {
      "id": "jtpauxy",
      "body": "7.84.\n\n>Is ur cgpa the reason you didn't get an offer oncampus\n\nNo I did miss a whole lot of companies but I still could have landed a decent job. But I fked up."
    },
    {
      "id": "jtpeom1",
      "body": "So I'm your junior(sem 5) with a 7.5 cgpa... But my resume is pretty strong... You think the cgpa could be a losing factor for my placements?? Im extremely worried about this"
    },
    {
      "id": "jtperms",
      "body": "So I'm your junior(sem 5) with a 7.5 cgpa... But my resume is pretty strong... You think the cgpa could be a losing factor for my placements?? Im extremely worried about this"
    },
    {
      "id": "jtpog6r",
      "body": "Atleast for me that's the case, I was not eligible for so many good companies as my cgpa was less than 7.5 during placement"
    },
    {
      "id": "jtpopki",
      "body": "Atleast in pes... Yes... When there r so many people... Even if u have a good resume... The first factor the college or the company will use to filter out students is obviously cgpa... And then they'll check resumes. So ya, please dont ignore ur cgpa here"
    },
    {
      "id": "jtpotvk",
      "body": "Is having above 7.5 a safe bet how many companies will I lose out on compared to an 8 pointer"
    },
    {
      "id": "jtpp61o",
      "body": "7.5+ is pretty safe... But if there r a lot of ppl with 8+ then u will obviously miss out... So no matter what don't let it fall below 7.5..keep trying to do better.... 6th is basically the last sem with 20+ credits... So score well in 6th sem."
    },
    {
      "id": "jtppoqx",
      "body": "Thanks a lot"
    },
    {
      "id": "jtrgze9",
      "body": "Hi! Which branch??"
    },
    {
      "id": "jtrk4rq",
      "body": "CSE"
    },
    {
      "id": "jtroo8r",
      "body": ">... You think the cgpa could be a losing factor for my placements\n\nIt depends you can still get a excellent package.\n\nBut you will miss few good companies like AMD, Walmart,Arista networks etc ."
    },
    {
      "id": "ju36g5v",
      "body": ">Is having above 7.5 a safe bet how many companies will I lose out on compared to an 8 pointer... I have done 3 internships, founded a startup\n\nIf u have startup why need to attend placement?"
    }
  ]
}