{
  "id": "15cukwk",
  "title": "About tomorrow",
  "content": "Hello everyone, I have joined PES this year and tomorrow is the orientation and I'm a little confused on something , like they asked us to wear formal , but is it mandatory to wear formals ? And it is important to attend tomorrow ? And why is it on Sunday ?",
  "metadata": {
    "author": "sillyfishfucker",
    "url": "https://www.reddit.com/r/PESU/comments/15cukwk/about_tomorrow/",
    "permalink": "/r/PESU/comments/15cukwk/about_tomorrow/",
    "score": 7,
    "created_utc": 1690643306,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jtydnug",
      "body": "Are you sure you aren't being trolled? xD\n\nAre you in BTech? Second round counseling not done yet + Orientation on a Sunday + formals are all red flags lol."
    },
    {
      "id": "jtyfq2w",
      "body": "Law and design students have orientation tomorrow.\n\nMy friends have it tomorrow"
    },
    {
      "id": "jtyfqus",
      "body": "They have been sending me emails since two weeks now like every day and more over they called me and informed me about it too and its from the official PES email ID"
    },
    {
      "id": "jtygauo",
      "body": "I'm a BCA student , And also my question stays the same is it important to attend and is the formal thing important too ?"
    },
    {
      "id": "jtyi1yb",
      "body": "Attend if possible, you can make new connections over there.\n\nWhy do you want to miss the first day anyway?"
    },
    {
      "id": "jtyitwv",
      "body": "Don't wanna miss it but the formal thing is crazy , I'm not even sure that if I'm allowed to wear skirt or should I go with formal pant , I'm a little confused honestly"
    },
    {
      "id": "jtyiwil",
      "body": "PES has design now? 💀"
    },
    {
      "id": "jtyj9bl",
      "body": "Old news dude."
    },
    {
      "id": "jtyja64",
      "body": " uceed bro \n\nThere is pessat for design students also"
    },
    {
      "id": "jtyjkiu",
      "body": "Doesn't your programme have a rule about formals? Either way, I don't think I've seen anyone with formals wear skirts as part of their uniform, so I guess pants should be a safer option."
    },
    {
      "id": "jtyklrl",
      "body": "Thanks for your advice , I appreciate and yes I guess I will just go with pants , I don't wanna travel 21km just to not get entry"
    },
    {
      "id": "jtz6bmb",
      "body": "Honestly? Go with something resembling your username."
    },
    {
      "id": "jtz9oei",
      "body": "Yeetus feetus self deletus 😂😂"
    },
    {
      "id": "jtza9st",
      "body": "Its so confusing man I got a call from them like just 2 days ago saying 30th is orientation, pls come, no dress code, like what??? And the mail says we've to come in formals and i just don't have time for last moment shopping, lets hope kurtis count as formals:'D"
    },
    {
      "id": "jtzbyta",
      "body": "😂😂😂 well so I see a kurta guy and be like \"oh thats wannabe paddu\""
    },
    {
      "id": "jtzvyrb",
      "body": "Bruh holy crap I got a heart attack 😭 tell which course you were enrolled in"
    }
  ]
}