{
  "id": "15diw0m",
  "title": "Does my cgpa get rounded off?",
  "content": "Well, I just calculated my 1st year cgpa and I have got 3 decimals, so I'm wondering if it gets rounded to 2 decimals or do they consider the first 2 decimals?\n\nPS: Ik I sound pretty silly, tbh.",
  "metadata": {
    "author": "The_spiritual_gal",
    "url": "https://www.reddit.com/r/PESU/comments/15diw0m/does_my_cgpa_get_rounded_off/",
    "permalink": "/r/PESU/comments/15diw0m/does_my_cgpa_get_rounded_off/",
    "score": 3,
    "created_utc": 1690715006,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ju2gyta",
      "body": "everything gets rounded up generally, cgpa, final marks etc etc"
    },
    {
      "id": "ju2ir3v",
      "body": "Ok, thanks!"
    },
    {
      "id": "ju2nka5",
      "body": "By how much, like if someone gets 7.97, is it rounded off to 8 ?"
    },
    {
      "id": "ju6vyv8",
      "body": "False info"
    },
    {
      "id": "ju6w6yv",
      "body": "back up your claim?"
    },
    {
      "id": "ju6w807",
      "body": "CGPA does not get rounded off! Don’t believe the false comments. \n\nI myself got 7.98 GPA in a sem which set me back and because of that I won’t be able to apply for certain companies during placements (currently experiencing it)"
    },
    {
      "id": "ju6wg5q",
      "body": "Going through placements now, nothing is rounded off, especially GPA. A company rejected students with less than 85% in 10th grade. I saw a student with 84.8% highlighted and rejected."
    },
    {
      "id": "ju6wq47",
      "body": "The question and my answer were both about university marking, not about external companies. On your marks cards the gpa mentioned is definitely rounded up by 2 decimal places. Same thing happens with final ISA marks as well."
    },
    {
      "id": "ju6x030",
      "body": "OP has specifically asked if the two decimal places are considered. Answer is yes. No where is it rounded off. \n\nExample: 8.88 is NOT rounded off to 9. Be it on the PESU portal, marks card or placement sheet."
    },
    {
      "id": "juaw6gu",
      "body": "But 3 decimals gets rounded up right?Say if one has 7.9995 it gets rounded upto 8 right?Sure 7.99 wont get rounded up to 8"
    },
    {
      "id": "juawlgl",
      "body": "As far as I know, it doesn’t work that way. Because I’ve seen a case where the 7.995 remained as 7.99. \n\nI’m not sure what may happen with a 7.999 case. Hopefully you get the upgrade. Atb!"
    }
  ]
}