{
  "id": "15ejyuf",
  "title": "How to get to pesu from mysore road metro station (as its nearest) by bus?",
  "content": "Last time i came to pes i wasn't able to figure out the right bus stop. I walked towards the left from metro station and found some bus stop but i wasnt sure if the buses were going to pesu(everyone i asked said they didnt know) .Also how crowded is pes gonna be once btech starts??",
  "metadata": {
    "author": "NoOutlandishness5689",
    "url": "https://www.reddit.com/r/PESU/comments/15ejyuf/how_to_get_to_pesu_from_mysore_road_metro_station/",
    "permalink": "/r/PESU/comments/15ejyuf/how_to_get_to_pesu_from_mysore_road_metro_station/",
    "score": 3,
    "created_utc": 1690818898,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ju80vfs",
      "body": "Pes will be incredibly crowded and if you walk a little towards the signal there's plenty of buses that gp towards pes"
    },
    {
      "id": "ju87vw4",
      "body": "Walk towards the signal on the left on the opposite side(near the public washroom) , bmtc buses stop there and any bus you get in will drop you at PES ."
    },
    {
      "id": "ju8ffpd",
      "body": "How long is the walking+ travelling to pes from the bus stop"
    },
    {
      "id": "ju94mjy",
      "body": "2nd student here one advice when you come from metro and get down in Mysuru road and when you come to bus stop (towards kengeri) never i repeat never take those auto standing there they will charge you 50 rupees per person. \nAlso the bus which goes towards pes is MF-12 that will cost you 10rupees . If you don't get that don't worry walk a bit in front there's a signal and any bus coming to that(towards  Banashankari) signal goes to pes which will cost you 5 rupees.\n\n\nAlso there's a metro shuttle which comes randomly between 7.45-8.05am (two buses) ig which will directly take you to pes. Although considering the crowd that waits for the shuttle you should really need to  be lucky to get in or else take bmtc."
    },
    {
      "id": "juau7gk",
      "body": "Walking from the metro station to the bus stop takes you at most 5 mins, it's technically right outside the metro station. Travelling to PES usually is about 5-10 mins via bus. So I'd say overall once you reach Mysore Road metro it's a 10-15 min journey."
    },
    {
      "id": "juaugkm",
      "body": "Lmao these autos used to cost ₹30 back in my first year. 3 of us would split it and it would come out to be the same as the bus fare. If they're charging ₹50 now it just makes more sense to take the bus, it's not like the autos are remarkably faster on that straight road"
    },
    {
      "id": "jub0ei7",
      "body": "Thanks"
    },
    {
      "id": "jub0f9q",
      "body": "Thanks"
    },
    {
      "id": "jub6kwm",
      "body": "It's 50 per person so technically they earn 150 in 5 minutes 😭😭"
    }
  ]
}