{
  "id": "15erc74",
  "title": "Big data or graph theory",
  "content": "I am really confused between big data and graph theory, because some(teachers) are saying take something that will boost your cgpa and others are saying take the subject of your interest, I think big data is intresting but it is significantly harder than graph theory according to some seniors and teachers. What is your advise on this?",
  "metadata": {
    "author": "Nozi_nigha",
    "url": "https://www.reddit.com/r/PESU/comments/15erc74/big_data_or_graph_theory/",
    "permalink": "/r/PESU/comments/15erc74/big_data_or_graph_theory/",
    "score": 2,
    "created_utc": 1690835848,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "juatvim",
      "body": "Unless your CGPA is very poor, I'd suggest to take what interests you. Go through the curriculum of both courses and see what each comprises. Find out about potential projects and/or assignments. Talk to seniors who took up the courses and ask them what they liked about the coursework and see if it matches your personal interests. Don't go by negative feedback alone. \n\nI was personally more inclined towards Big Data, and back then (2020) it was one of the most planned and effective courses here. Plus, we had KVS and tbf because of him and a whole load of other factors it's still the best course I ever took up across my 4 years here. I even returned the next year to be a Teaching Assistant for the course. The course is very hands on, and yes as you said it requires a lot of effort but it's one of those courses where the knowledge you gain is absolutely worth it. You get to actually implement small scale versions of large pipelines that industries use, something I realised when I started my job in Big Data Analytics. So yes, I'd recommend Big Data but I understand that this opinion is heavily biased with my experience so you should make your own decision based on whatever facts you receive on Graph Theory."
    },
    {
      "id": "juavtoe",
      "body": "They have merged NAM in GTA for you guys now lol so even GTA will be hard for you guys"
    },
    {
      "id": "jubrhuy",
      "body": "Had taken BD last year , will agree with Rowlet Sir that it was the best I had taken course in our curriculum.\nIt was probably the only course with actual hands on activities related to the subject . The assignments and projects did take a lot of time which we didn't have due to the 5 isa system . A lot of the topics you learn in BD will be repeated in various upcoming subjects.\nAs far as I have heard GTA was a easy scoring subjects with manageable assignments."
    },
    {
      "id": "judhp51",
      "body": "Thank you for replying, I am a lateral entry student and we join 5th sem 15 days later than regular students and because  we are joining a bit late I am worried that the groups for assignments and projects would have already been made, Should I be concerned about this??"
    },
    {
      "id": "judi514",
      "body": "There are some rumors that this time we will only have 2 ISAs, so I think we will get a bit more time to do assignments and projects."
    }
  ]
}