{
  "id": "15ffb0r",
  "title": "To all the first year guys, by how much did your second sem result change from your first sem",
  "content": "Everyone i know had their grade increase by a minimum of .5 😭",
  "metadata": {
    "author": "Dead_Bull_",
    "url": "https://www.reddit.com/r/PESU/comments/15ffb0r/to_all_the_first_year_guys_by_how_much_did_your/",
    "permalink": "/r/PESU/comments/15ffb0r/to_all_the_first_year_guys_by_how_much_did_your/",
    "score": 12,
    "created_utc": 1690902648,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "juctn7k",
      "body": "Shit happens. Try to do better the next semester. \n\nIMO what you learn in 3rd and 4th sem is very important. Most of the stuff that you’ll actually use in the industry. \n\nI slacked off during my 3rd and 4th sem, and I regret it now. \n\nLearn from other’s mistakes (mine) and put all the effort you can. 5th and 6th sem are very very easy, so I’m sure you’ll be able to get good scores then. \n\nAll the best!"
    },
    {
      "id": "jucy2qr",
      "body": "+1 and 3rd 4th sem is also usually the toughest"
    },
    {
      "id": "jud3ewd",
      "body": "What is the syllabus for cs 3rd sem"
    },
    {
      "id": "jud8kac",
      "body": "Data Structures, Statistics for DS, digital design and computer organisation, web tech, automata and formal languages"
    },
    {
      "id": "judbcvz",
      "body": "tysm I appreciate it"
    },
    {
      "id": "judbkyv",
      "body": "3rd sem was my lowest ever GPA :((("
    },
    {
      "id": "judcfyv",
      "body": "You’ll be fine my man, you’ve realised what you have to do in order to improve!"
    },
    {
      "id": "judottf",
      "body": "Yeahhh"
    },
    {
      "id": "jug076k",
      "body": "My cgpa is about 7.7 at the end of first year. Will it be practically possible for me to reach 8-8.5 from here or does it all go downhill"
    },
    {
      "id": "jug0gtq",
      "body": "Yes going from 7.7 to 8 is very simple, just get over 8 in the next 4 semesters. 3rd and 4th sem are a little tough and take effort. 4th sem will also have AT, so a lot more distractions….5th and 6th semesters are very easy to score in, so that’ll be easy, a little extra effort and you’ll be able to get 9s both semesters."
    }
  ]
}