{
  "id": "15gdm9p",
  "title": "do college toppers in pes university usually get the highest package?",
  "content": "do college toppers in pes university get the highest package? ",
  "metadata": {
    "author": "iopjhugyvju",
    "url": "https://www.reddit.com/r/PESU/comments/15gdm9p/do_college_toppers_in_pes_university_usually_get/",
    "permalink": "/r/PESU/comments/15gdm9p/do_college_toppers_in_pes_university_usually_get/",
    "score": 6,
    "created_utc": 1690993952,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jui3hna",
      "body": "General trend is yes.. There r exceptions obviously"
    },
    {
      "id": "jukxqbl",
      "body": "More of the exception than the norm actually. For example for my batch and the batch before, the highest packages were from people who had 8.5-9 CGPA. Having a higher CGPA only gives you a small edge in placements. After that it's all about how great your profile is."
    },
    {
      "id": "jv107s6",
      "body": "Wdym by a great profile???"
    },
    {
      "id": "jv10djv",
      "body": "Your skillset, projects, the overlap between your strengths and the company's requirements and past experiences."
    },
    {
      "id": "jv10lon",
      "body": "I'm a social recluse so do you think I might have a hard time at PES and do cs(aiml) get placed with high packages??"
    },
    {
      "id": "jv11nbq",
      "body": "Firstly, non placement advice: if you have diagnosed your problem and indeed see it as one, then you need to step out of that mindset. Being a recluse does not help anyone. Get out of your comfort zone, see what is out there, meet people and network.\n\nSecondly, as I mentioned it depends on your skills and what you can build for yourself. You are either going to enter PES or are in 2nd year - this means you have a ton of time to work on yourself. Remember that the only person who can hold you back is yourself."
    },
    {
      "id": "jv129z1",
      "body": "What do you mean by \"it depends on my skills\" like many people say that i don't get it,tbh I don't have any skills I'm just 17 years old and for the past 2 years only focused on getting into a good college.\nI don't have any prerequisite in coding so yeah."
    },
    {
      "id": "jv13fm9",
      "body": "Well then its a good thing placements are 3 years away right xD\n\nYou have ample time to work on yourself - figure out your interests, learn what interests you, pickup skills and make them your strengths. Just studying the syllabus here will not make you eligible for placements: you **have** to put in extra effort, else you run the risk of not being placed."
    },
    {
      "id": "jv13vai",
      "body": "How much do you think a cs(aiml) major will get paid after getting placed ??"
    }
  ]
}