{
  "id": "15inphz",
  "title": "Capstone Project in a Different Branch",
  "content": "I'm currently in ECE , but i'm not that keen to work on a project in one of the ECE domains . My skills are better in CS and wanted to know if i can do a capstone project in a CS topic or under a prof from the CS dept . I heard that if you want to do a project across departments there must compulsorily be a specific component to the project which relates to your own branch is that true ? ",
  "metadata": {
    "author": "DoubleFun5436",
    "url": "https://www.reddit.com/r/PESU/comments/15inphz/capstone_project_in_a_different_branch/",
    "permalink": "/r/PESU/comments/15inphz/capstone_project_in_a_different_branch/",
    "score": 4,
    "created_utc": 1691215798,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "juwb2up",
      "body": "I'm not sure about the main campus but in ec campus the department assigns your teammates and guide based on your cgpa and usually your guide tells you what project you should work on. As far as I know you can't even change your teammates, let alone the branch because the ece teachers are the ones giving you your grade for the 10 credits. But it might be different in the main campus. Talk to your HOD once and see if they'll allow it"
    },
    {
      "id": "juwmcbo",
      "body": "Wow that's weird. At RR you can pick teammates, guide, and even the project you want to work on without any known restrictions."
    },
    {
      "id": "juwpant",
      "body": "Yea ece in ec campus is a bit fucked. CS ppl can choose their teammates and topics in our campus but not ece ppl for some reason"
    },
    {
      "id": "juwrl22",
      "body": "Have you tried speaking to the HOD? What's the motive behind this decision?"
    },
    {
      "id": "jux5yyg",
      "body": "Lot of people have talked to the HOD. None of them were successful. Maybe they want to prepare us for later or smtg idk. It is what it is and most of us have just accepted it"
    }
  ]
}