{
  "id": "15iwox2",
  "title": "A brief introduction to subjects of 3rd sem(CSE)",
  "content": "I have completed my holidays and now returning back to Bangalore.. during holidays i had a look on the subjects only a little bit. i felt \nDDCO is manageable and DSA is a bit tough..but I don't have much idea about the rest..it would be great if any senior could help me",
  "metadata": {
    "author": "Fearless5548",
    "url": "https://www.reddit.com/r/PESU/comments/15iwox2/a_brief_introduction_to_subjects_of_3rd_semcse/",
    "permalink": "/r/PESU/comments/15iwox2/a_brief_introduction_to_subjects_of_3rd_semcse/",
    "score": 7,
    "created_utc": 1691244606,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "juwhgby",
      "body": "DDCO- watch Reetinder Sidhu AV summary and study slides/textbook and solve problems\nSDS- learn on own, solve questions from textbook\nDSA- watch AV summaries, study pesu academy notes/slides and solve more and more problems on leetcode/hackerrank.you ll get big af assignments, make sure u do it on your own\nAFLL- don't neglate after seeing this subject,although it is easy , it's quite tricky, you need more practice\nWT- watch YT videos, study pesu academy notes, do projects, do all assignments on own\nDoing all slides and notes is as usual mandatory."
    },
    {
      "id": "juzs4oh",
      "body": "Which are the books/textbooks that can be helpful?\n\nAlso is there any special topic subject? I had seen resources for some programming languages like ruby,cpp and unix under special topic in the discord server..Do we still have it?"
    },
    {
      "id": "juzxldn",
      "body": "The '25 batch did not have special topics(22 credits only not 24), i have seen the credit distribution table even the '26 batch does not have special topics.you ll be having summer courses of these topics next year."
    },
    {
      "id": "jv051ut",
      "body": "Ok..thanks"
    }
  ]
}