{
  "id": "15kdxh0",
  "title": "About Hostel in PES RR Campus",
  "content": "Is PESU Hostel strict? Do the wardens frequently come and check the room? Are we allowed to go out of the hostel/campus atleast during weekends? What is the curfew timing? Are there restrictions on the WiFi? How are the facilities in the hostel? Are the rooms/bathrooms well maintained? Is the mess food any good? How are the laundry facilities? Someone please help.",
  "metadata": {
    "author": "Rishikesh-Kumar2004",
    "url": "https://www.reddit.com/r/PESU/comments/15kdxh0/about_hostel_in_pes_rr_campus/",
    "permalink": "/r/PESU/comments/15kdxh0/about_hostel_in_pes_rr_campus/",
    "score": 5,
    "created_utc": 1691394648,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jv4w9xr",
      "body": "Same question"
    },
    {
      "id": "jv4xuok",
      "body": "The Warden does come once or twice a month to check rooms. Yes, we are allowed to go out of the campus, but one has to return before 9 pm. WiFi restrictions are there (the worst) & sometimes there's just no point in using PESU wifi because of these restrictions. The rooms/bathrooms are well maintained in NB, NBX, and MM blocks. The mess food is good for vegetarians in Namdhari mess but for rest, it's just ok. Laundry facilities are good but do avoid giving your expensive ones as they do get misplaced sometimes."
    },
    {
      "id": "jv53nnk",
      "body": "I heard someone say that the authorities kind of force/pressurize seniors to vacate out of hostel to make room for juniors? Is there any truth to this?"
    },
    {
      "id": "jv558sz",
      "body": "Not true..."
    },
    {
      "id": "jv568a1",
      "body": "apart from curfew timings i have heard they are pretty chill, and obv wifi is worth jackshit, apart from that mess and all, its fine"
    },
    {
      "id": "jv6v5kd",
      "body": "Nah not true. On the contrary, seniors get more priority in hostel admittance.  \nAlso, curfew timing is 10 pm now, so you can stay out of hostel till 10."
    },
    {
      "id": "jv7mal8",
      "body": "If you find some good VPN then wifi restrictions will not be an issue, For me proton vpn on laptop and 1.1.1.1 on mobile works just fine."
    },
    {
      "id": "jvobnng",
      "body": "How much do you pay for laundry??"
    },
    {
      "id": "jvobzd7",
      "body": "Why did they extend it to 10 pm? Is it because of the recent incident??are you talking about rr campus?"
    },
    {
      "id": "jvqb091",
      "body": "Are NB,NBX blocks available for freshers??"
    },
    {
      "id": "jwaf16q",
      "body": "Yes rr campus only\nAnd no they extended it way before the recent incidents"
    },
    {
      "id": "jwpylgf",
      "body": "Does proton vpn still work now? Asking since I can't connect to proton vpn servers."
    },
    {
      "id": "jxzjp38",
      "body": "works on my laptop but not on my mobile"
    }
  ]
}