{
  "id": "15kghkk",
  "title": "Local Guardian for PESU Hostel",
  "content": "Is it compulsory for everyone who plans to stay at Hostel to have a local guardian residing in Bangalore? How do students who live far or from other states manage to find local guardians if they don't know anyone in Bangalore? Does the local guardian get any SMS or mail if we miss class or about our performance in exams and all or are they only contacted for hostel related stuff, if in case we cause any issue there? Also, are seniors forced/pressurized to move out of hostel to accomodate freshers? Someone please clarify. ",
  "metadata": {
    "author": "Rishikesh-Kumar2004",
    "url": "https://www.reddit.com/r/PESU/comments/15kghkk/local_guardian_for_pesu_hostel/",
    "permalink": "/r/PESU/comments/15kghkk/local_guardian_for_pesu_hostel/",
    "score": 4,
    "created_utc": 1691403259,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jv5n5rb",
      "body": "yes it is compulsory  for everyone who plans to stay at Hostel to have a local guardian residing in Bangalore.\n\nMy local guardian is my father's friend who resides in Bangalore as i am from north"
    },
    {
      "id": "jv5qvzy",
      "body": "Yeah, also apart from that you also need to verify that your location guardian is above the age of 35. Coz when I went to hostel with my cousin aged 30 yrs, the wardon said that he isn't eligible coz he won't be responsible enough to take descisions of your parents behalf. And mind you he said this after knowing that he's married and with my father's consent. Although I did managed to meet vice chancellor and he signed a letter in which he allowed 30yo \"non responsible\" person to become my local guardian. Pathetic management and shit people."
    },
    {
      "id": "jv5wcvm",
      "body": "They ignore the over 35 rule for  \"own\" siblings"
    },
    {
      "id": "jv6umay",
      "body": "Contrary, seniors get more priority while taking admission in hostel.  \nAlso, they don't send any message or anything to our LGs nor disturb them for small matters so it's chill. LGs just need to be present during the admission process, after that there's no involvement of them in any other processes. Even for permission for going out or staying the night outside hostel, they'll just ask your parents about it."
    }
  ]
}