{
  "id": "15m8vos",
  "title": "Who do I get LORs from?!",
  "content": "TLDR: Proving to be very difficult to get LORs from profs in PES as they claim they only give to their capstone students or those who have a paper published under them (I've worked under only one prof). What can I do?\n\nI'm planning to apply for my masters (in CS) for Fall 2024. I'm fairly confident about all the components in my application. Except for LORs.\n\nMost US universities require 3 LORs.\n\nI have 2 Profs who've already agreed to give me any number of LORs. One I did capstone under and the other I've done an internship under (not in PES).\n\nThe 3rd LOR is proving to be really difficult. I have not worked under any other Prof. I was not particularly active in any class (used to always prefer studying on my own so just showed up to class for the sake of attendance). I approached 3 profs over the last one week whose classes I've gotten an S grade in and my face seems somewhat familiar to them. All 3 gave the same response: \"I only give students who've done capstone under me or those who have published papers under me. It will become very hectic for us as application deadlines approach as we will have too many LORs to upload\". I mean firstly we write the LOR, no prof actually writes it for us (barring like 1-2 exceptions) so that's a load reduced, but I also kind of get their point because of the population in PES. Secondly what can I do now? Am I expected to have done 3 separate capstones? Or published multiple papers? (Half of the publications I see are pretty scam btw but that's for another day. I do have one publication but that's from capstone).\n\nSo any advice would be great on what I can do. I'm planning to apply to around 10 universities, and I'm not too concerned about the strength of the LOR since my other two will be pretty strong. Also speaking of strength of LOR: I've read admissions committees discard letters if they tag it as DWIC (Did Well In Class) which is pretty much gonna be the case anyway so do they expect us to have worked on 3 separate research projects or something in undergrad?\n\nAnyway, yes, advice would be appreciated, thanks.",
  "metadata": {
    "author": "Living-Milk-3894",
    "url": "https://www.reddit.com/r/PESU/comments/15m8vos/who_do_i_get_lors_from/",
    "permalink": "/r/PESU/comments/15m8vos/who_do_i_get_lors_from/",
    "score": 11,
    "created_utc": 1691568552,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jvf0cy5",
      "body": "Do all three letters have to be from professors? Is it possible to get a letter from your internship manager or someone like that"
    },
    {
      "id": "jvf0jy4",
      "body": "It is definitely possible, although I did my internship for only a little under two months. I had a great rapport with my manager there but yeah not too sure. Mainly the reason being I'm applying to research based programs where they specifically say they prefer LORs from academia."
    },
    {
      "id": "jvf16hd",
      "body": "So I'm applying for Fall 2024 too, and yes from whatever I've researched, LoRs actually count if you have working history with the prof either as a project or a research assistant. Letters that say \"X was a great student, did well in class\" don't carry weight and are often termed weak LoRs. I'd suggest asking profs of courses in which you did a project, and request them for an LoR. Getting an A in a course which contains a project (in which you've obviously done well in) and asking that prof for an LoR is far better than asking a prof under whom you have 0 working history but did well in their class."
    },
    {
      "id": "jvf3hu5",
      "body": "Another thing to note is research based programs prefer LoRs to be from research oriented supervisors, such as a research guide or mentor. How many of your LoRs except Capstone come from faculty for a research position you held?"
    },
    {
      "id": "jvfltn2",
      "body": "I'm an alumnus, doing my MS right now. Feel free to DM if you have follow up questions. My thoughts -\n\nThe DWIC LoRs will make a difference in programs that are rated more highly. I'm not sure what programs you're targeting, but if they're on the more ambitious side you do not want to go the DWIC route. I would recommend that you find one who is willing to give you a general DWIC if possible only as a backup. Your internship manager's LoR would be equivalent. \n\nYour best bet is to try and maximise your chances over the next few months. Your application deadlines will be in December, with maybe one or two in November, so you should try and find some prof that you want an LoR from and basically take up a project with them. Ideally you strategise a bit here and pick profs that work on topics that you're planning on concentrating on during the MS. \nThis doesn't need to be a PES prof - it could be anyone in an academic position. \n\nOn the scam publications - don't worry about it and don't go down that route. Publish in actual venues. I can tell you that profs and adcoms at good universities care about where you publish."
    }
  ]
}