{
  "id": "15mffof",
  "title": "laptop",
  "content": "Can someone please recommend good HP or dell laptops? And what are the specifications I need to keep in mind while buying one (cpu type and core count, graphics processor series and which type, ram size, ssd size and anything else)?",
  "metadata": {
    "author": "ChaoticChaos89",
    "url": "https://www.reddit.com/r/PESU/comments/15mffof/laptop/",
    "permalink": "/r/PESU/comments/15mffof/laptop/",
    "score": 4,
    "created_utc": 1691587895,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jvg0kop",
      "body": "Add budget to your post"
    },
    {
      "id": "jvgtum5",
      "body": "yea I just added it thnx"
    },
    {
      "id": "jvgw16l",
      "body": "Do you have anything you could use for a few months?"
    },
    {
      "id": "jvh557x",
      "body": "Not hp or dell but i recommend lenovo thinkpad e16 or any thinkpad series in that 80k price range. Excellent machines"
    },
    {
      "id": "jvjpdt9",
      "body": "Bro my friends are not recommending Lenovo it’s not nice itseems ? Is that true"
    },
    {
      "id": "jvjz3li",
      "body": "Some Lenovo think books and ideapads are pretty ass , your friends maybe have those. Thinkpad and legion series have the biggest cult following for having good build quality and worth of money. Especially thinkpads will easily last 6+ years if you take care of it."
    },
    {
      "id": "jvk165c",
      "body": "I would suggest you get a lenovo or a asus laptop instead of HP or Dell\n\nSpecifications wise I would suggest you get an intel i5/i7 **12th gen** processor(don't get 11th gen), 8GB RAM and 512GB SSD should be more than enough. Look for IPS displays  and see that the laptop has enough number of ports(atleast 2 USB A ports, 1 USB C port and 1 headphone jack"
    },
    {
      "id": "jvk6ay0",
      "body": "try to get a 16 gig or an 8 gig upgradeable at least. 8 core CPU works, i7 without a GPU and i5 with a GPU in this budget I think. depends what you plan to do with it"
    },
    {
      "id": "jvkgu61",
      "body": "Victus if your are on budget and want gaming, Omen otherwise for HP"
    },
    {
      "id": "jvkgwtz",
      "body": "Lenovo gaming laptops are goated., legion adn ideapad gaming both"
    },
    {
      "id": "jvkh3p0",
      "body": "yep i'm using a hp laptop but it doesn't have gpu"
    },
    {
      "id": "jvkh7nf",
      "body": "ok i'll consider that too thnx"
    },
    {
      "id": "jvkhany",
      "body": "Mind sending me a dm?"
    },
    {
      "id": "jvkhdwl",
      "body": "any reasons why hp or dell aren't recommended?\n\nokay thank you! anything particular abt gpu?"
    },
    {
      "id": "jvkhqbu",
      "body": "not gaming, i need it only for ml"
    },
    {
      "id": "jvppyxw",
      "body": "For GPU you can check intel iris graphics. You cannot expect a laptop with a Nvidia graphics card\n\nDell and HP aren't recommended because they don't have that competitive specifications comapred to lenovo or asus and even if they do the price is very expensive"
    },
    {
      "id": "jvq2yx8",
      "body": "check your dms"
    },
    {
      "id": "jx0pnfm",
      "body": "Bro I wanted to know whether a Mac would suffice for the coding we do in clg ?"
    },
    {
      "id": "jx3ex8e",
      "body": "I don't know. I am a fresher too"
    },
    {
      "id": "jx3nmnd",
      "body": "Bro, is a Mac enough for coding in clg  ?"
    },
    {
      "id": "jx3npy0",
      "body": "Yeah but you will have trouble with using the commonly used softwares"
    },
    {
      "id": "jx3q8ui",
      "body": "Like ms office?"
    },
    {
      "id": "jx3qeze",
      "body": "No s number of things....you will have to find their alternatives and the professors/others most likely won't be much help in setting things up as they most likey use windows....unless you already have one....I would suggest to not get one for college"
    },
    {
      "id": "jx3qnle",
      "body": "Thanks bro ! Any alt for that ? I wanted to buy a Mac as it would be compatible for editing softwares. I want to learn editing."
    },
    {
      "id": "jx3qq9k",
      "body": "Get something with a 4050"
    },
    {
      "id": "jx3qsrh",
      "body": "Could u pls explain what 4050 is ?"
    },
    {
      "id": "jx3qxfo",
      "body": "Rtx 4050...gpu.....it's got enough juice to handle anything that you might want to do ....also make sure it is atleast 100w"
    },
    {
      "id": "jx3qyst",
      "body": "Thank u so much bro !"
    }
  ]
}