{
  "id": "15mjkb9",
  "title": "As a student of PES what's your daily schedule like?",
  "content": "Might join PES rr this year, so I need to know really how stressful it is (as per what I've seen in this sub), so pls give actual answers and not just few words of sarcasm.",
  "metadata": {
    "author": "machinegun2187",
    "url": "https://www.reddit.com/r/PESU/comments/15mjkb9/as_a_student_of_pes_whats_your_daily_schedule_like/",
    "permalink": "/r/PESU/comments/15mjkb9/as_a_student_of_pes_whats_your_daily_schedule_like/",
    "score": 14,
    "created_utc": 1691597295,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jvknhgp",
      "body": "I hope you love academics and nothing but. \n\nIf you are in Bangalore and not living in the hostel, then have fun waiting around till 5 PM for the buses to leave.\n\nClasses for B-TEch folks starts at 8 AM, and goes on till 3:15-3:$5 (As per the time table)."
    },
    {
      "id": "jvkxicz",
      "body": "no i mean like rest of your day: for how long you study/do assignments and hours of sleep.\n\nanyways my house is like 4 kms away so my dad can drop me there or something"
    },
    {
      "id": "jvkyngx",
      "body": "Hey I'm in my second year (BBA) and here you go:\n\nI wake up at 6:30am and reach college by 8:30. Classes start at 8:45 and usually end by 4pm. The maximum would be 4:45pm. I hang out with some of my friends in college till 6pm (it's honestly too much lol). I reach home and rest till 7:30pm. Then I start with my assignments and term papers. I strictly sleep before 11pm no matter what. During ESAs, my sleep schedule is fucked but apart from that, it is consistent. Hope this answered your question"
    },
    {
      "id": "jvl7d8o",
      "body": "i expected an answer from engineering students, but thanks anyway. i get the idea"
    },
    {
      "id": "jvlc16u",
      "body": "You can't really generalise how most of us spend our time but PES is not as strict and hectic as you might think. If you did some competitive exam prep before you'll barely have to put any effort compared to that. I'm a 7th sem ECE student and most non exam weeks I barely study more than an hour per day. But this does mean I need to grind and study all night on exam weeks. We used to have 25 tests per semester and a final exam before so it was really peaceful. But now I think it's 3 tests so you might have to study a bit more regularly. An hour a day should be more than enough for pes tests. Doing something extra and how much time you spend on it is completely upto you. I'm a very active ganer and I have more than enough time to spend 2-3 hrs per day gaming too. Plus, first year is a complete breeze and you can chill a lot and have fun and enjoy clg life. Hope this helps :)"
    },
    {
      "id": "jvp0pwo",
      "body": "It varies wildly. Some days I have time for myself to work on my own projects, and on  others I am swamped with work from PES, and sacrifice some sleep for it.\n\nAssignments will take _some_ time. ISAs were the biggest time sink the previous semester.\n\nStudying does not take much time, as long as you pay attention in class.\nYou will need to prioritise _a bit_ on what you want to study.\nEnsure your C and python are **very** strong. They are used all over the place!"
    },
    {
      "id": "jvpo3ga",
      "body": "Kira yoshikage"
    },
    {
      "id": "jvqbjau",
      "body": "XD"
    },
    {
      "id": "jvqdahb",
      "body": "2-3 hours on gaming? goddamn"
    },
    {
      "id": "jvug8p4",
      "body": "are the no. of isas changed this year, i heard around 5 isas per semester ??"
    },
    {
      "id": "l5283w9",
      "body": "Hey I have some doubts regarding Pes can I dm u ?"
    }
  ]
}