{
  "id": "15nxuy8",
  "title": "PESU Placement statistics",
  "content": "Are the statistics for branchwise and overall average, median and highest packages offered available for the ring road campus? Yes, I did check the Google sheets document but it just stated all/most of the packages that were offered to the students and I couldn't find anything related to branchwise averages or placements in general.\n\n&#x200B;\n\nDoes the university provide the students with any kind of statistics of some kind or another?",
  "metadata": {
    "author": "AccomplishedPay4876",
    "url": "https://www.reddit.com/r/PESU/comments/15nxuy8/pesu_placement_statistics/",
    "permalink": "/r/PESU/comments/15nxuy8/pesu_placement_statistics/",
    "score": 9,
    "created_utc": 1691725716,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jvp4poa",
      "body": "They did, during the round 1 counselling"
    },
    {
      "id": "jvp5ldr",
      "body": "Can you share it?"
    },
    {
      "id": "jvp5q14",
      "body": "I did not take the photo, \nIt was like around 1500 students were eligible for placement and its average came out to be around 17LPA, that’s all I remember."
    },
    {
      "id": "jvp6c41",
      "body": "17LPA for real? Yea thats kinda hard for me to digest considering IIT Bombay reported 18 in their RTI appeal."
    },
    {
      "id": "jvp8bq3",
      "body": "It is about 17.9LPA but remember that's average and only for cse,I'd advice taking the median instead for consideration which was about 11LPA"
    },
    {
      "id": "jvp8ux4",
      "body": "Median was about 12-13 afaik"
    },
    {
      "id": "jvpg78h",
      "body": "That's the average...median was about 7 or 8"
    },
    {
      "id": "jvpk15n",
      "body": "They report data in a way that best suited them.\n\nIIT Bombay probably reported across branches. \n\nPesit mentioned average only for CSE students. \n\nAlso this is average CTC. In CTC they will include every small thing for example - book reimbursement, relocation, stock options etc. \nStocks are usually vested over 4 years.\n\nAlso please do some research on how average will always be a skewed metric. \n\nFor example if there are 10 students and one of them gets 60LPA CTC and the rest got 10 LPA. The average turns out to be 15LPA and that is what will be advertised. \n\nAlways focus on the median which in my opinion would be around 10LPA at best."
    },
    {
      "id": "jvpxcmi",
      "body": "Yes IITB's data was for all branches. Well tbh I don't think any college out there reports the base only CTC. The person who commented the average just mentioned the average didn't mention CSE at first lol"
    },
    {
      "id": "jvpxu4k",
      "body": "The non CSE placements in PESU are abysmal. \nI had a friend in ECE who got 4.5L CTC.\nMany people in CSE also got similar. They have doubled the seats now for CSE alone.\n\nWhile I agree all colleges mention CTC, my point was to point out that even CTCs can have components that you will probably never see. \n\nIn short I think 10LPA CTC is a decent estimate of what their median is"
    },
    {
      "id": "jwqih1i",
      "body": "Apart from the CGPA cut offs Companies set, does the college / department set any CGPA cut offs for diff tiers of companies ? If yes , pls mention the cut offs for this season."
    },
    {
      "id": "jwqmsx3",
      "body": "Bhai mujhe kya malum main idhar ka student nahi hu.\n\n\nAlso most requirements are set by the recruiters instead of college like no backs or etc and sometimes the college might set a CGPA barrier like afaik some IITs do that where you have to score about 5/6+ to be eligible for placements"
    },
    {
      "id": "jwqq3y9",
      "body": "My bad, saw the thread just shot my question. \nThanks for the clarity !"
    }
  ]
}