{
  "id": "15o7ue2",
  "title": "Is the ec campus stricter than rr?",
  "content": "I've heard people telling that the ec campus is really strict and has exams every week, is this true?\nAlso how is the social situation at ec campus?",
  "metadata": {
    "author": "Western_Forever7992",
    "url": "https://www.reddit.com/r/PESU/comments/15o7ue2/is_the_ec_campus_stricter_than_rr/",
    "permalink": "/r/PESU/comments/15o7ue2/is_the_ec_campus_stricter_than_rr/",
    "score": 5,
    "created_utc": 1691757592,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jvqfg8z",
      "body": "One thing \nTeachers are shit here in ec , as far as exams are concerned , both the campuses have exams at the same time and follow the same syllabus ."
    },
    {
      "id": "jvqfxb7",
      "body": "So the one exam a week thing is true?"
    },
    {
      "id": "jvqndsp",
      "body": "Not anymore. Things have changed for good now. Back to 2 ISAs and ESA System per subject. Applies to both campuses."
    },
    {
      "id": "jvqnnvc",
      "body": "Yea, exams wise it's quite the same. You get access to slides and materials on PESU Academy, the same thing for all. You'll end up using Vibha's notes anyway XD"
    },
    {
      "id": "jvrt1t8",
      "body": "It's not very strict tbh. It is less strict compared to 2021ish tho that time was more cuz of covid."
    },
    {
      "id": "jvry9jq",
      "body": "Yo!! Can I DM you?"
    },
    {
      "id": "jvu8vw9",
      "body": "Could I DM you on some of my queries about the campus?"
    },
    {
      "id": "jvu9uxr",
      "body": "Yea sure"
    },
    {
      "id": "jvugrcs",
      "body": "If you're talking abt ece in ec campus it's a lot stricter than rr. The teachers monitir you a lot and call your parents and stuff for small things like you're in a school lol. It'll also be really bad if you get caught bunking classes unlike in rr"
    },
    {
      "id": "jxxxa3m",
      "body": "Add 'em off here in the community. Help others make it through 🚣‍♀️🚣‍♀️😂"
    }
  ]
}