{
  "id": "15pbno3",
  "title": "Regarding buying items for college/hostel",
  "content": "Are there places in Bengaluru where we could get good quality products (clothes, footwear, bags etc.), basically hostel/college items at cheap rates? If so, can you guys please suggest a few places for the same, preferably ones closer to the RR Campus. I am not from Karnataka and am confused whether I should buy these items from my place and then take it there or to buy everything from Bengaluru. Which would be a better option? ",
  "metadata": {
    "author": "Rishikesh-Kumar2004",
    "url": "https://www.reddit.com/r/PESU/comments/15pbno3/regarding_buying_items_for_collegehostel/",
    "permalink": "/r/PESU/comments/15pbno3/regarding_buying_items_for_collegehostel/",
    "score": 7,
    "created_utc": 1691864586,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jvz95yf",
      "body": "There's a Dmart nearby where you'll get almost everything you need at cheap prices .\nFor clothes you can visit places like zudio , max , fashion factory , trends , style union to name a few which provide affordable choices ."
    },
    {
      "id": "jvzg6g4",
      "body": "Even reliance mart is nearer then dmart the price differs from 4-15 rupees"
    },
    {
      "id": "jvzgmq6",
      "body": "For clothing and all you can go to rr nagar, kathriguppe circle\n\nFor groceries dmart near Deve Gowda Petrol Pump, reliance mart near kathriguppe circle, for all snacks you can go to suttha gali, vv puram, rajaji nagar food street, \n\nFor more cheap products go to Chickpet its far\n\nEven u can go to lulu hyper market by taking metro from mysore road to Krantiveera Sangolli Rayanna Metro Station"
    },
    {
      "id": "jw002bu",
      "body": "Dmart is og . The popcorn and softie is another plus point ."
    },
    {
      "id": "jw009vt",
      "body": "I never tried them tomorrow i will try"
    },
    {
      "id": "jw00op9",
      "body": "Cheese popcorn is the best."
    },
    {
      "id": "jw00rsy",
      "body": "Yaar dont give me cravings"
    }
  ]
}