{
  "id": "15pqj6c",
  "title": "ECE placement stress (?)",
  "content": "I'm a 7th sem ECE student at the EC campus, with a current cgpa as 8.87.\nFrom what I've heard, it is on the higher side although I'm not proud of it bc I honestly feel that I don't deserve it. As placements near, I'm losing hope on getting into a core company as I don't have any special knowledge that could set me apart from any other students in ece. I would say that I'm a jack of all trades but master of none. And as for the cs companies, I do not have even basic knowledge of DSA (I am studying it now though) as it was not a subject in our syllabus. \nAs for my interests, I would love a core company mainly in signal processing or if I have to move towards IT companies, it would be as a data analyst (for which I'll have to start from scratch). \nFor now, I have started relearning C in order for me to properly get into DSA basics, along with my capstone and the swayam subjects which are compulsory.\nOne thing I do have is that I'm hard working. I may not be smart neither do I understand things quickly, but I can definitely put in work.\n\nAny advice on how I should proceed or what I should do?\n\nThank you for reading this far.",
  "metadata": {
    "author": "RinRJJ17",
    "url": "https://www.reddit.com/r/PESU/comments/15pqj6c/ece_placement_stress/",
    "permalink": "/r/PESU/comments/15pqj6c/ece_placement_stress/",
    "score": 11,
    "created_utc": 1691905000,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jvz0zmi",
      "body": "I'm yet to start college. But ik very well that 8.87 is a good CGPA and it's enough to get placed.\nWhy do you think you don't deserve it? I think you do"
    },
    {
      "id": "jvz1w4y",
      "body": "8.87 is a good CGPA but unfortunately clearing the coding rounds is more important. CGPA is used as a soft filter later on to select the top students who solved the most questions. Additionally, after you enter the interview rounds, CGPA kinda becomes irrelevant."
    },
    {
      "id": "jvz41ru",
      "body": "Why r u worrying..? Ece in pes (within 8.7 cgpa)can get good placements na !!?"
    },
    {
      "id": "jvzagq8",
      "body": "This is my exact issue. Would you mind suggesting some things I can do from now to improve my chances of getting into a core company?"
    },
    {
      "id": "jvzhw5m",
      "body": "Ofcourse. This is the reason why I said good CGPA can get you placed not not will get you placed. Good CGPA will help to get interviews. Skill is what matters after that."
    },
    {
      "id": "jwzrijt",
      "body": "Use python for coding, it's easier to get data structures in that,\nFor example you can do queue and heap directly using inbuilts. In C you'll have to code them from the scratch"
    },
    {
      "id": "jxffgz2",
      "body": "There's big4 companies that don't have a particular coding round to them . So you could try for them as well. Since you can hold two offers perhaps try for big4  first especially PWC or ey and then keep learning DSA and strengthen your coding skills and keep applying for t-1 companies."
    }
  ]
}