{
  "id": "15pq2a0",
  "title": "Minor course",
  "content": "Is minor course compulsory? 3rd sem cse student here...which course is good to choose? When will we have classes for this course?",
  "metadata": {
    "author": "DaikonEmbarrassed147",
    "url": "https://www.reddit.com/r/PESU/comments/15pq2a0/minor_course/",
    "permalink": "/r/PESU/comments/15pq2a0/minor_course/",
    "score": 2,
    "created_utc": 1691903426,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jvyxamy",
      "body": "Are you referring to special topics? Cause a Minor is a completely different thing.\n\nSpecial topics are 2 credit courses that are available every semester from 3rd sem onwards. The list of available courses changes every semester. You may opt to not take one in one semester, but remember that **at the end of your degree, you need 160 credits, so if you don't take one in a prior semester you will need to cover up in a later semester** to fulfil the degree requirements. Special topics are available to take up right until your last semester, but if you take the required number set each semester, you should be done before the 8th sem. You can usually substitute special topics in higher semesters (7th and 8th) via internships. All special topics contribute to your CGPA. \n\nMinors are a completely different thing. **A Minor allows you to take up 4 (if I am not wrong) core fundamental courses from another branch. If you take up all 4 courses before you graduate, you will be awarded the Minor degree in that branch**. For example, if you are in ECE and take up CS courses like DSA, DAA, OS and CN (stating examples here, these are set by the department), then if you take one every semester starting from the 3rd semester, by the time you reach final year you will be given the Minor degree in CS. Note that these courses are all core 4-credit courses, and contribute to a different Minor CGPA. For obvious reasons, you can only get a Minor degree in branch you are not already in. A lot of people prefer to get these Minor courses done over the summer."
    },
    {
      "id": "jvyxq8l",
      "body": "If you are referring to special topics, I would highly recommend picking up a Mini Project so that you get to work with a prof. It will give you valuable experience, and if you do great work might even open up the doors for a LoR. But pick this route only if (1) you get to pick the prof and (2) the project is good.\n\nIf you want to go the course route, then if you want the easiest course I would suggest R because it's>70% the same as the SDS course. But it won't be too useful for you if you aren't into Analytics or similar fields. If you are looking from a pure placements point of view, pick C++. If you do not have any idea what to pick, choose C++."
    },
    {
      "id": "jvz56z3",
      "body": "Thanks for beautiful explanation. How is the academic schedule for minor course? Like exams stuff"
    },
    {
      "id": "jvzo32n",
      "body": "What do you mean by over the summer? The holidays between semesters?"
    },
    {
      "id": "jw0op2a",
      "body": "So for a CS student , does a minor have to be engg-related or can it be any course that PES offers?"
    },
    {
      "id": "jw4dgvl",
      "body": "Yup - that's when a lot of academic coursework also takes place. Backlog exams, summer extra courses, minors etc all take place during the summer (apart from other times of the year) and most choose to do them at this time since there aren't other commitments"
    },
    {
      "id": "jw4dl02",
      "body": "Stop referring to special topics as minor courses. They're different as I explained. \n\nSpecial topic classes happen once a week"
    },
    {
      "id": "jw4dp3z",
      "body": "I'm not sure, I've only seen people choose any of the other engineering branches. Maybe ask the department or wait for someone else to respond"
    },
    {
      "id": "jw51upd",
      "body": "okay, thanks a lot"
    }
  ]
}