{
  "id": "15ps42c",
  "title": "MASTER'S: Immediately after graduation v/s After working for a couple years",
  "content": "Hey Seniors!\nI wanted to discuss the pros and cons of going for masters directly after graduation (the fall intake soon after graduation) v/s going for masters after working for a couple of years and gaining some experience in the industry.\n\nPlease share some of your thoughts as it would be very helpful for many of us. \n\nHoping to get some replies from people who are pursuing / have pursued either of the tracks🤞",
  "metadata": {
    "author": "LocalMafiaAnna",
    "url": "https://www.reddit.com/r/PESU/comments/15ps42c/masters_immediately_after_graduation_vs_after/",
    "permalink": "/r/PESU/comments/15ps42c/masters_immediately_after_graduation_vs_after/",
    "score": 13,
    "created_utc": 1691910445,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jvz7dwo",
      "body": "This is a very variable, depends on case to case basis, but I’ll just put my PoV, I feel work experience in a good company for a year is really helpful. \n\n1. If your GPA is less than 9 then it does hurt your chances to get into good colleges and specifically some colleges are GPA centric like USC and UT Austin. Having relevant work experience might help reduce weightage on your grades. \n\n2. It becomes slightly easier to get internships there if you have relevant work experience, you will definitely be considered over a fresher since your resume is loaded and you’ll find it easier to even transition. It is a bit stressful as internships are off campus, unlike here.\n\n3. Most of my seniors have told having two academic LoRs and one industrial is good for professional masters, if your looking for thesis based then three academic is better, but professional is the most targeted option, and having an industrial LoR with relevant work experience from a good company will boost your chances in your dream University, one more issue that I have seen is that companies don’t have a limit on number of LoR’s but college professors put a limit upto 7 letters only, I’m not sure of the exact reason, even after writing LoR. \n\n4. If you haven’t done good work in undergrad then your sole option depends on the kind of work you do in company and based on that your SoP can be tailored, having work experience also helps you know if this is the right fit for you in future or not, in which case you can craft your SoP accordingly. \n\n5. Self financing your entry criteria exams and application admission forms along with stay there would help you lift burden financially a bit. The entire process is costly, with 6 month of spring internship and a year experience you can help yourself better. \n\n6. Usually grades improve in final year so if you better grades is necessary for your profile then better to work here. \n\nApplying direct is also a good option if you have a good profile and consider finishing all your studies at once, look at what is best suited for your profile, good luck!"
    },
    {
      "id": "jvz9661",
      "body": "Thanks! This is really helpful"
    },
    {
      "id": "jw52nue",
      "body": "Halfway through my MS. I originally applied to start right after my UG finished, but then I decided to wait for a year and reapply while getting some work experience. Honestly the only reason I did this was because of COVID and the fact that I wasn't too happy with the places I got into. As such I can kind of talk about both tracks. \n\nFrom my experience, good work experience does help boost your application. What really sealed the deal for me was that I could connect my coursework with what I used at work, which is how I was able to get a TA position and have my degree funded. Having money in the bank for applications, travel and all that jazz also really helps. Without my work experience, I'd be in a lot of debt. \n\nAll that said, if you're interested in research or pursuing a PhD, unless your work experience is somewhat related to those interests, it doesn't contribute anything. In my case the one year of work experience is just a point on my CV that isn't going to be discussed much down the road, so if you're looking to do research I'd really recommend taking a serious look around and trying to find a company or R&D group that will let you work on topics you're interested in. \n\nLastly, it can be hard to get back into the \"student\" mindset if you've been working for a while. \n\nTLDR - if you want to do research, make sure it's in line with your research interests. Generally speaking, 1 or 2 years is helpful."
    },
    {
      "id": "jwl5mhm",
      "body": "Thanks, this helps"
    }
  ]
}