{
  "id": "15qkd65",
  "title": "Lost my pessat hall ticket",
  "content": "I wanted to attend the second round of counselling but I seem to have lost my hall ticket(with the invigilator's signature). Does anyone know if this will be a problem🥲🥲",
  "metadata": {
    "author": "the_sauce_huehuehue",
    "url": "https://www.reddit.com/r/PESU/comments/15qkd65/lost_my_pessat_hall_ticket/",
    "permalink": "/r/PESU/comments/15qkd65/lost_my_pessat_hall_ticket/",
    "score": 1,
    "created_utc": 1691987658,
    "flair": "PESSAT",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jw3l3ut",
      "body": "I attended the first round of counseling and no you won't have any problem as they didn't asked me for the hall ticke, but keep a copy of your hall ticket with you."
    },
    {
      "id": "jw3ls6l",
      "body": "Thanks man I was stressing about this a Lil too much💀"
    },
    {
      "id": "jw3m23s",
      "body": "Btw what's your rank and what are you expecting?"
    },
    {
      "id": "jw3m9xx",
      "body": "If you remember your number or have it online, get another copy of it from PESu office (MRD block 1st floor).\n\nIf not, There are 2 ways as I see it. \n\n1. Attend without a hall ticket and maybe nobody will ask you. \n\nBut What if someone asks for you and won't allow you later?\n2. If you could find Mr. Tamal Dey, tell him your problem. Most helpful teacher in PES. He'll surely help you. \n\nAll the best!!"
    },
    {
      "id": "jw3mo3k",
      "body": "20XX coping for Ai but will be happy with ece(ig)"
    },
    {
      "id": "jw3mpme",
      "body": "I have it online could get it printed anyway ty for your advice"
    },
    {
      "id": "jw3obla",
      "body": "\"Could you get the invigilator's name on the new copy?\" Is what I meant."
    },
    {
      "id": "jw3ozql",
      "body": "No I don't think I'll be able to do that since I don't remember who was my invigilator"
    },
    {
      "id": "l3lhpro",
      "body": "Did you attend the counselling? Was the hall ticket compulsory?"
    },
    {
      "id": "l3o0agv",
      "body": "Junior here in the same situation. What did you do finally? "
    },
    {
      "id": "l3opb2f",
      "body": "I took a printout of the hall ticket without the invigilator's sign. There wasn't a problem(you can call the authorities and enquire there tho)"
    }
  ]
}