{
  "id": "15rskvu",
  "title": "Pls help I’m lost",
  "content": "Okay so I’m gonna start cs+aiml this year at rr campus. I feel like I should be asking so many question but in reality I don’t even know what questions to ask. So if somebody could PLEASE help me and give me a little bit guidance I’d be super grateful. So yes if we could dm also that would be super cool. So yeah. Thank you.",
  "metadata": {
    "author": "Falalala2811",
    "url": "https://www.reddit.com/r/PESU/comments/15rskvu/pls_help_im_lost/",
    "permalink": "/r/PESU/comments/15rskvu/pls_help_im_lost/",
    "score": 6,
    "created_utc": 1692105684,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jwacfpa",
      "body": "Check dm"
    },
    {
      "id": "jwarop5",
      "body": "I'm joining cse+aiml this year too!"
    },
    {
      "id": "jwawtgr",
      "body": "Hi! Nice to hear that!"
    },
    {
      "id": "jweteo9",
      "body": "What do you need help with? I graduated in 2022, if that matters"
    },
    {
      "id": "jwfci4g",
      "body": "Honestly idek everybody keeps telling me I should be asking questions and finding out stuff but I’ve legit got no idea. I just wanna know what I should like prepare for college and stuff. And thank you so much for replying!"
    },
    {
      "id": "jwfcy0l",
      "body": "Honestly, college is an experience and having a blueprint to it will just ruin it for you. Everyone has a different experience and everyone figures it out on their own. You don't \"prepare\" for it because then you don't open yourself up to all the opportunities you might have.\n\nIf you have any questions or would like to know how something works at PES, feel free to DM me. Good luck!"
    },
    {
      "id": "jwfh9v8",
      "body": "Ha that feels weird to hear coz I’ve always felt the need to have a plan for everything. But thank you so much. I will most definitely have questions in the future and hope I won’t be too much of a bother! :)"
    },
    {
      "id": "jwg0vro",
      "body": "Haha no worries, I'm used to getting a lot of questions xD"
    }
  ]
}