{
  "id": "15ufim8",
  "title": "Pessat 2nd round",
  "content": "Rank 29xx\nAcquired pes ec cse\nAny possibility of getting rr campus aiml, i rejected ece cos i personally dont want it.",
  "metadata": {
    "author": "Positive-Effect-1228",
    "url": "https://www.reddit.com/r/PESU/comments/15ufim8/pessat_2nd_round/",
    "permalink": "/r/PESU/comments/15ufim8/pessat_2nd_round/",
    "score": 1,
    "created_utc": 1692350575,
    "flair": "PESSAT",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jwp5ga5",
      "body": "You can see posts on this subreddit about the differences between the campuses, and they're negligible according to seniors. So CS in ECC should be better then AIML in RR imo (unless you have a problem with the location)"
    },
    {
      "id": "jwp9t4z",
      "body": "Bro My rank is 4k can I get ec campus aiml \nFirst round cutoff is 3.5k for aiml"
    },
    {
      "id": "jwpb1he",
      "body": "Why would you want to shift to AIML? CS at ECC is a much better option"
    },
    {
      "id": "jwpev9e",
      "body": "Might get, just attend counselling and hope for the best"
    },
    {
      "id": "jwpfggg",
      "body": "tbf I do have friends who want RR only because the EC location is really inconvenient, not because they think it's lesser than RR in any way."
    },
    {
      "id": "jwpht23",
      "body": "Yea location is a bit messy ngl. Too far and dad ain't gon give me vehicle so bus... thanks anyways"
    },
    {
      "id": "jwphuf0",
      "body": "Yea exactly"
    },
    {
      "id": "jwphvcm",
      "body": "Location is a huge factor bro"
    },
    {
      "id": "jwtdzdj",
      "body": "I don't get it Aiml is just a specialization right? In computer science engineering then why is everyone so against it?"
    },
    {
      "id": "jwte3bh",
      "body": "There's a long explanation posted on this subreddit by me. You can check the FAQ post, it links to it."
    },
    {
      "id": "jwteiu5",
      "body": "[For reference](https://reddit.com/r/PESU/s/HPRAFQdOP6)"
    },
    {
      "id": "jwtf3p2",
      "body": "Thanks for the info . So RR aiml is worse than EC cse core ? My rank is 1700 so what should i be going for in the 2nd round?"
    },
    {
      "id": "jwtfhrx",
      "body": "Yes. I'd suggest if you want CS, try getting core CS at RR or EC. Pick AIML only if you don't get either of the two"
    },
    {
      "id": "jwvfbvl",
      "body": "there are no aiml seats in rr anymore 💀"
    }
  ]
}