{
  "id": "15urwdi",
  "title": "How much free time will I have?",
  "content": "I will be joining pes rr cs and I'm going to stay in the boys hostel. \nFor a little context, I got 98.9 in jee mains (disappointing for me), 20k in adv (I blanked on paper 1 and couldn't recover enough marks after), 264 bitsat(but didn't get any cs 4yr course) and 449 kcet.\n\nI've decided to take up the iitm course and that will start almost simultaneously with pes sometime in September. I've done some research and since it's an iit degree, it is supposed to be tough, even if it is manageable, it will probably require time.\n\nHow much free time does pes give you per day(except during exam time)?\n\nAnd does pes give a generous number of holidays?",
  "metadata": {
    "author": "_the_bean_man",
    "url": "https://www.reddit.com/r/PESU/comments/15urwdi/how_much_free_time_will_i_have/",
    "permalink": "/r/PESU/comments/15urwdi/how_much_free_time_will_i_have/",
    "score": 3,
    "created_utc": 1692382328,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jwrjat8",
      "body": "First year is the only time you actually get proper free time tbh, after that workload tends to exponentially go up. Although yes, you definitely can take out time to pursue other things but you should be warned that PES does tend to have a lot on its plate when it comes to assignments and projects. \n\nAs for holidays - no, PES isn't generous with holidays during the academic session. Instead, the entire chunk of holidays is saved for the summer, where you get 2.5 months of vacation. Apart from that you get a few random days off here and there during the course of the academic year."
    },
    {
      "id": "jwtawvn",
      "body": "Wouldn't u get rv at that rank? Why not go for that?"
    },
    {
      "id": "jwtukbr",
      "body": "should seriously consider that, if you are a localite then, wait for further rounds, even RV ISE might be a good choice"
    },
    {
      "id": "jwtwptu",
      "body": "Go for RV college anytime"
    },
    {
      "id": "jwtwx7v",
      "body": "Not advisable to do this ..rather join RV college or any other NIT/IIIT and aim for MS in good college than pursuing with PES .."
    },
    {
      "id": "jwu6hqa",
      "body": "I think at 98.9 percentile you have much better options than PES , maybe join LMNIIT ,TIET  or any other institution with similar placements but far better college life."
    },
    {
      "id": "jwu7ad5",
      "body": "I think I might but I'm not too sure about the actual education at rv plus the whole campus is surrounded by a sewer and I live in jakkur, no way I'm traveling 3 hours there and back and I don't want to smell that for 4 years"
    },
    {
      "id": "jwu7cmy",
      "body": "Didn't get cs in any tier 1 nit, I think the last one I got was nit patna"
    },
    {
      "id": "jwu7jiu",
      "body": "I've decided to join pes because overall I end up saving a lot of money, I don't know the fee structure for lmniit or tiet or the others but they're probably not as cheap as kcet"
    },
    {
      "id": "jwu7xfy",
      "body": " ig it depends on your future goals then r u aiming for masters abroad or placements?\nIf it's placements then u can choose pes imo but if you have plans for masters abroad then it's better to choose rv"
    },
    {
      "id": "jwu85kq",
      "body": "I think the iitm course has options to extend the time period of the course which I will probably use.\n\nSo pes takes up almost all the your time except for let's say 3 hours in which I can use 1 or 2 for the online degree.\nIs that correct?"
    },
    {
      "id": "jwvchrs",
      "body": "Nah tiet is bad lnmiit is getting bad.U could have got nits csab is done tho.Anyway all the best when is your joing date?"
    },
    {
      "id": "jwve4o9",
      "body": "Not sure kcet keeps postponing stuff. Also I did try csab but nothing I wanted was available"
    },
    {
      "id": "jwvekkg",
      "body": "Kind of planning to do both but placements are the first priority, I think working for one of the big tech companies (hopefully) should be good enough of an achievement for abroad but I have no idea how that system works"
    },
    {
      "id": "jwvyvnb",
      "body": "98.9 and pes 🧢"
    },
    {
      "id": "jwyldic",
      "body": "Just letting you know that there's a huge sewer within PES' campus (near the boys' hostel)"
    },
    {
      "id": "jx0rzgk",
      "body": "holy shit bro, how big of an idiot are you jesus"
    },
    {
      "id": "jx41oob",
      "body": "Dude... Even pesu is sharing a border with a sewer.. plus.. metro is much better for rv."
    },
    {
      "id": "jxfthd4",
      "body": "Pes is worst choice ..neither good college tag nor you get free time to pursue IITM degree ..either you should have joined BITs some duel degree and got into CS with hardwork ...but pes is very bad option ..with student strength of 1000 plus in CS only ..nd lot of kids will rh management quota , very average peer group .."
    }
  ]
}