{
  "id": "15vdjs6",
  "title": "Will i get CSE? (rank:1.4k)",
  "content": "I live in Delhi. Should I visit the campus tomorrow? Bangaluru is a long way from here and then there’s additional expenses. Will this be worth it? \n\nThe admission cell has shit-load of crap in their skull, they are not there to help. They just cut the call in middle. Help pls.",
  "metadata": {
    "author": "Small-Post7595",
    "url": "https://www.reddit.com/r/PESU/comments/15vdjs6/will_i_get_cse_rank14k/",
    "permalink": "/r/PESU/comments/15vdjs6/will_i_get_cse_rank14k/",
    "score": 4,
    "created_utc": 1692443802,
    "flair": "PESSAT",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jwugnat",
      "body": "Read my latest post and decide \n\nThere are only 21 seats for computer science"
    },
    {
      "id": "jwuk4wo",
      "body": "ok.. thanks"
    },
    {
      "id": "jwukxan",
      "body": "Chances are slim"
    },
    {
      "id": "jwul216",
      "body": "Yep.. but still.."
    },
    {
      "id": "jwurvlt",
      "body": "Nope i dont think so . Even i will not be participating now"
    },
    {
      "id": "jwuyef0",
      "body": "But round 1 me mil sakta tha… thanks though"
    },
    {
      "id": "jwuyneq",
      "body": "Mujhe bhi bhai . Rone ka man karr rha bhut zyada"
    },
    {
      "id": "jwuyuj4",
      "body": "Chalo koi na.. ab toh tickets bhi karali.. aake dekh hi lete hai nahi toh Bangaluru hi ghoom lenge."
    },
    {
      "id": "jwuz9ld",
      "body": "milte hai phir… kal aaoge kya tum R2 me? kya pata mil jaye.."
    },
    {
      "id": "jwv1u81",
      "body": "Aaya tha mai BLR but ab soch rha backup VIT nikal lu pehle hi late ho gya . Papa bol rhe kar lo attend . Dekho kya hota"
    },
    {
      "id": "jwv28ks",
      "body": "achcha.. VIT ka abhi bhi vhal raha hai counselling? 14th se start nahi hua kya session?"
    },
    {
      "id": "jwv5br1",
      "body": "Maine drop nhi kiya admission. Late join karunga"
    },
    {
      "id": "jwv5mk5",
      "body": "If no other option shd definitely give a chance, but again chances are very slim."
    },
    {
      "id": "jwvf1g6",
      "body": "cse cutoffs are usually below 900. and this time due to overbooking the 2nd round seats are much lower its gonna be a huge gamble to fly all the way for a maybe."
    },
    {
      "id": "jwvnrld",
      "body": "You are not quite active it seems… So much for me or just a coincidence?.. anyways thanks but i’ve done the tickets and i’m going…"
    },
    {
      "id": "jwvo3cw",
      "body": "Thanks"
    },
    {
      "id": "jwvpqsc",
      "body": "if youve got the tickets you might as well go ig"
    },
    {
      "id": "jwylajs",
      "body": "delhi man did you get a seat?"
    },
    {
      "id": "jwywp24",
      "body": "didn’t come buddy.. aur ab toh asli id aaja saale.."
    },
    {
      "id": "jx35yi1",
      "body": "nin amman loude ke baal fuck you and your hindi"
    },
    {
      "id": "jx3ec5b",
      "body": "😎"
    }
  ]
}