{
  "id": "15vmjsn",
  "title": "The Seats Unavailibilty mystery!!",
  "content": "They overbooked in first round:-\n\nLet’s take the CS example, if anyone remembers->they offered some 432 seats in CS in first round for RR and EC campus while in website they clearly mentioned that 288 seats are available through PESSAT. \n\nSo in first round they overbooked and many students withdrew seats, but because of overbooking, at the end for the second round, seats which were left were negligible as they almost doubled the intake in first round. \n\nI don’t know why they did this though. It doesn’t do much help.",
  "metadata": {
    "author": "Timely_Comment_785",
    "url": "https://i.redd.it/0lhgjzzmt3jb1.jpg",
    "permalink": "/r/PESU/comments/15vmjsn/the_seats_unavailibilty_mystery/",
    "score": 11,
    "created_utc": 1692467105,
    "flair": "Pride Of PESU",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jww2yca",
      "body": "Kcet seats is 250 fyi - wrong info on website"
    },
    {
      "id": "jwxr1pi",
      "body": "Nope, 250 is for rest of karnataka, and 38 is for Hyderabad-Karnataka. Total CET seats has to be 288 only, cause it's 40% of 720(minimum 40% of total seats has to offered through CET by law)"
    },
    {
      "id": "jwxvy5u",
      "body": "okay so now that they have overbooked in pessat counseling and many people haven't surrendered and they have to give 288 seats through kcet, are there going to be more than 720 students. how is it going to work??"
    },
    {
      "id": "jwxy20t",
      "body": "No clue how it will work legally, cause they'll definitely have more than the sanctioned number of students"
    },
    {
      "id": "jwyckd9",
      "body": "ig they have mentioned 288 seats for each of the branches   \neither ways in that case it should be 576 seats in total for CS but they offered only 432  \nidk what they r doing"
    },
    {
      "id": "jwyd3u7",
      "body": "They overbooked because they get a minimum of 10k even if you surrender the seat"
    },
    {
      "id": "jwytbp4",
      "body": "Chindichor"
    },
    {
      "id": "jwz3z76",
      "body": "This \"Higher Fee\" category is kinda sus to me. I've heard that they sold seats behind the scenes for like 1L extra . This entire thing feels like a scam"
    }
  ]
}