{
  "id": "15w34l7",
  "title": "F*ck PES",
  "content": "Why the f*ck did you guys overbook??",
  "metadata": {
    "author": "Broken_Broccoli5",
    "url": "https://www.reddit.com/r/PESU/comments/15w34l7/fck_pes/",
    "permalink": "/r/PESU/comments/15w34l7/fck_pes/",
    "score": 26,
    "created_utc": 1692511269,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jwys0rs",
      "body": "Fuck PES, all my homies hate PES"
    },
    {
      "id": "jwyvj8q",
      "body": "+1"
    },
    {
      "id": "jwyvjtm",
      "body": "I applied for MCA at PES last year, and I cleared the interview round and all that, but then I got to know there was a waitlist, it was WL 11 at that time, but the wired thing is, when I withdrew from the admission process I get to know not a single person surrendered a confirmed seat, I had no choice but to apply again next year. \n\nSo yeah, they overbook, and it sucks."
    },
    {
      "id": "jwyvnc1",
      "body": "Shittiest college in Bangalore no cap."
    },
    {
      "id": "jwyvto6",
      "body": "Biggest welcome to PES moment in recent history"
    },
    {
      "id": "jwywy5w",
      "body": "I joined the college in management quota aiml... My parents forced me... Idk what to do... Is pes a torture house"
    },
    {
      "id": "jwyxmpp",
      "body": "Wait what exactly happened ?\nWhat does overbook even mean yo ?"
    },
    {
      "id": "jwyxtax",
      "body": "Seats in aiml at rr : -36\n\nSuppose seats are 300, these guys admitted 400 people in the first round \n\nSo there are no seats left \n\nBasically, more admission than the number of seats"
    },
    {
      "id": "jwyy4y2",
      "body": "Adding to this, the admission could have been also provided to management quota requests, thus making the count *more negative*"
    },
    {
      "id": "jwyy781",
      "body": "Wrong choice of branch + questionable college + superfluous fees. \n\nAll the best, you're going to need it."
    },
    {
      "id": "jwyzvim",
      "body": "What am I supposed to do now... Is there an escape?"
    },
    {
      "id": "jwz0x4b",
      "body": "Yes,drop year"
    },
    {
      "id": "jwz12pd",
      "body": "What about the money I paid?"
    },
    {
      "id": "jwz1bsl",
      "body": "Yo brother\n\nI have dmed you \n\nReply"
    },
    {
      "id": "jwz332g",
      "body": "Why wrong branch?"
    },
    {
      "id": "jwz3jx5",
      "body": "He should have chosen cs , aiml is a kinda sketchy branch \n\nTbh,  PES isnt worth the management fee or the PESSAT fee \n\nOny take PES if you are getting thru kcet."
    },
    {
      "id": "jwz3quy",
      "body": "Ask them for a refund ..... 44L aint worth it man , you can do your education with the same amount of money in other foreign universities"
    },
    {
      "id": "jwz4f4p",
      "body": "As someone else said, shouldn't have picked AIML. There is a long explanation of this - check the FAQ post on this subreddit. The explanation is posted there"
    },
    {
      "id": "jwz4l2m",
      "body": "Ask for refund. Nothing here can justify the fees."
    },
    {
      "id": "jwz5x9q",
      "body": "Boss\n\nTake refund\n\nIf you invest 44 lacks, atleast you'll make some money than giving to pes\n\nF*ck pes"
    },
    {
      "id": "jwz6t7z",
      "body": "i am getting Robotics and AI at BIT and CS-Data Science at RNSIT. Should I pick RNSIT?"
    },
    {
      "id": "jwz6whm",
      "body": "i am getting Robotics and AI at BIT and CS-Data Science at RNSIT. Should I pick RNSIT?"
    },
    {
      "id": "jwz8ss3",
      "body": "Try to stick with CS is my recommendation , Although BIT is much better than RNSIT.\n\nDo not freeze your choices now , wait until 2nd Round extended"
    },
    {
      "id": "jwzbw8r",
      "body": "yep thanks. Hopefully will get some CS branch in BIT"
    },
    {
      "id": "jwzixdr",
      "body": "Any idea what's gonna happen to the 36 people ( do they have to give up their seats)?"
    },
    {
      "id": "jwzqjso",
      "body": "Nah that would be shooting themselves in the foot. Their reputation will go further down.\n\nThey will most likely adjust their CET or diploma student quota."
    },
    {
      "id": "jwzzl1c",
      "body": "they cant just change the cet quota right , which means they are just asking for someone to come and sue them ."
    },
    {
      "id": "jx02pqu",
      "body": "Yeah, true. Honestly I really can't answer what PES is going to do from here but its a big mess"
    },
    {
      "id": "jx05ip6",
      "body": "i think since a lot of people converted from pessat to kcet quota last year , lot of empty seats were left in ec campus , that is after people got called to join rr campus cse since seats were left there too.\n\nig to avoid all this again , they overbooked so it would balance out later . lmao they screwed up ig"
    },
    {
      "id": "jxyz73s",
      "body": "hi hamish"
    },
    {
      "id": "lcsdpyf",
      "body": "Hey are u pursuing mca in Bangalore? I had some queries can I dm?"
    },
    {
      "id": "le32afd",
      "body": "sure!!"
    },
    {
      "id": "lecl9u9",
      "body": "hey, i have queries, can I dm you?"
    }
  ]
}