{
  "id": "15w6yev",
  "title": "TIME GRE Classes in PES",
  "content": " PES has recently announced that TIME will be conducting GRE classes, which will span a 4-month course costing almost 19k. Any senior students who have attended GRE classes at PES in previous semesters, as well as to seniors and graduates who are applying for MS abroad, I have a few questions about the GRE itself and, if possible, about the integrated classes as well. I'm currently in my second year. Could you please provide your opinions on whether I should join these classes at this time or in upcoming semesters?  Pls dm if you have something to share",
  "metadata": {
    "author": "Living-Baseball8994",
    "url": "https://www.reddit.com/r/PESU/comments/15w6yev/time_gre_classes_in_pes/",
    "permalink": "/r/PESU/comments/15w6yev/time_gre_classes_in_pes/",
    "score": 8,
    "created_utc": 1692524018,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jwzti6j",
      "body": "Firstly, second year is way too early my dude xD. Instead work on your profile - the GRE is being waived off at most Uni's and there is a good chance by the time you enter your final year only a handful of Uni's will need it.\n\nI'm applying for my MS this Fall. I would not recommend signing up for any classes. My friends and I all prepared independently - we used a lot of already available resources (a lot of them being free or nominal in cost) and did pretty well (320+). There are a lot of resources out there and I feel if you start early, you can easily prepare well and give it enough time to touch even a 330 without any tuitions/coaching. You can easily ask others how they went about preparing and how much time they gave the GRE, most give it 2-3 months and practice from a fixed set of books."
    },
    {
      "id": "jx0e9bp",
      "body": "Any tips you wanna give for GRE & TOEFL?"
    },
    {
      "id": "jx59w77",
      "body": "r/GRE and a 5 usd subscription to gregmat is way more than you need. Don't bother with the classes."
    },
    {
      "id": "jx8mmsz",
      "body": "Don't waste your time with these classes. 2-3 months of independent preparation using any of Manhattan Prep, GregMat, or official ETS prep material is more than enough."
    }
  ]
}