{
  "id": "15x64lu",
  "title": "Any mail?",
  "content": "Did anybody receive any mail regarding orientation and starting of classes (EC canpus) for btech freshmen ? It is mentioned in the website that orientation for ec campus is on 27.",
  "metadata": {
    "author": "CoolGuyGovind",
    "url": "https://www.reddit.com/r/PESU/comments/15x64lu/any_mail/",
    "permalink": "/r/PESU/comments/15x64lu/any_mail/",
    "score": 5,
    "created_utc": 1692620515,
    "flair": "Pride Of PESU",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jx4gf45",
      "body": "No"
    },
    {
      "id": "jx4jttx",
      "body": "Yes , the orientation is on 27th and classes will start on 28th"
    },
    {
      "id": "jx4k3hg",
      "body": "I am getting in through kcet and they said they are yet to decide on the clg fee. On the other hand, there is another round of counseling left. Do u think it's gonna work out ?"
    },
    {
      "id": "jx4m5ty",
      "body": "When I called them, they told that the fee is 1.6L and that we could join if we had the admission letter on us."
    },
    {
      "id": "jx4mutr",
      "body": "1.6 lakhs? Really..\nWhy so high fee?"
    },
    {
      "id": "jx4ni1t",
      "body": "> there is another round of counseling left\n\nPES does not wait for all KCET rounds. \n>  And what about the induction period ?\n\nFor what exactly? Usually there is a week of bootstrap after orientation, you can find details online"
    },
    {
      "id": "jx4pbuf",
      "body": "They might start your classes a little later , last year the same thing happened and they had a separate batch for kcet students"
    },
    {
      "id": "jx4wjpo",
      "body": "So none of you guys have received any email regarding the orientation right?"
    },
    {
      "id": "jx500q1",
      "body": "Will there be any activities on the initial days of the campus or will there be direct commencement of classes   can anyone confirm??"
    },
    {
      "id": "jx50rmm",
      "body": "I have already taken admission there through kcet. My parents forced me 😂\nMy rank is 2029. So there is no hope for better cs seats though..\n\nBut what's with the separate batch for kcet students ?"
    },
    {
      "id": "jx514ud",
      "body": "Oh ! My friend recently joined Amrita and they have an induction period. That's why I asked.."
    },
    {
      "id": "jx519v9",
      "body": "Ok but I am getting through kcet and they said they still have to decide on extra clg fee"
    },
    {
      "id": "jx594gm",
      "body": "1 week of bootstrap will be there."
    },
    {
      "id": "jx5hxcc",
      "body": "Good luck , \nWhat are the transport facilities, if we wish to be a day scholar?"
    },
    {
      "id": "jx6h5mb",
      "body": "Can you share the link?"
    },
    {
      "id": "jx7wpe9",
      "body": "There is a college bus service. Other than that, BMTC or KSRTC buses. Metro will take a few more months to be complete.."
    },
    {
      "id": "jx810rz",
      "body": "Thank you; Must figure out now whether to be a day scholar or hostel iteration.\nBcos I live in other part of city"
    },
    {
      "id": "jx8282j",
      "body": "If it is more than 10km, I would say you should prefer to stay in a hostel. Travel time shouldn't be more than 2hrs. So, all the best !"
    },
    {
      "id": "jx8x6jv",
      "body": "just got the mail"
    },
    {
      "id": "jxcmp5a",
      "body": "What is induction period?"
    },
    {
      "id": "jxcmq9w",
      "body": "**An induction period in chemical kinetics is an initial slow stage of a chemical reaction; after the induction period, the reaction accelerates. Ignoring induction periods can lead to runaway reactions.**\n\nMore details here: <https://en.wikipedia.org/wiki/Induction_period> \n\n\n\n*This comment was left automatically (by a bot). If I don't get this right, don't get mad at me, I'm still learning!*\n\n[^(opt out)](https://www.reddit.com/r/wikipedia_answer_bot/comments/ozztfy/post_for_opting_out/) ^(|) [^(delete)](https://www.reddit.com/r/wikipedia_answer_bot/comments/q79g2t/delete_feature_added/) ^(|) [^(report/suggest)](https://www.reddit.com/r/wikipedia_answer_bot) ^(|) [^(GitHub)](https://github.com/TheBugYouCantFix/wiki-reddit-bot)"
    },
    {
      "id": "jxjy896",
      "body": "wab delete"
    },
    {
      "id": "jxx4o9a",
      "body": "wab delete"
    }
  ]
}