{
  "id": "15yd7q9",
  "title": "Management quota peeps for ECE(RR Campus)",
  "content": "so, i've been in waiting list, number being 5 < x > 10, for over a month, i guess. And i have no updates regarding the same. Would be grateful, if someone lets me know, if you're in a similar situation or any updates regarding the same. DMs are welcome:)",
  "metadata": {
    "author": "Elegant_Sun333",
    "url": "https://www.reddit.com/r/PESU/comments/15yd7q9/management_quota_peeps_for_ecerr_campus/",
    "permalink": "/r/PESU/comments/15yd7q9/management_quota_peeps_for_ecerr_campus/",
    "score": 9,
    "created_utc": 1692726794,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jxb0drx",
      "body": "have you tried contacting admissions? Because I dont think so   you be should on waitlist when college is starting within a week"
    },
    {
      "id": "jxb4h5u",
      "body": "There's a waitlist for management quota???"
    },
    {
      "id": "jxb667o",
      "body": "Apparently, their number just doesn't work"
    },
    {
      "id": "jxb6bt3",
      "body": "Yup. I was quite surprised too"
    },
    {
      "id": "jxb7yzx",
      "body": "Well I mean physically go to their office"
    },
    {
      "id": "jxb833n",
      "body": "I think there were 100+ students on the waitlist 💀 that's what a friend told"
    },
    {
      "id": "jxcmtzd",
      "body": "Wait, are you joining ECE {RR\\] 💀through Management Quora?"
    },
    {
      "id": "jxd32ci",
      "body": "yaa"
    },
    {
      "id": "jxd3b6a",
      "body": "i heard there were 300+ on waitlist for CSE in RR campus lol. IDK about its current status though"
    },
    {
      "id": "jxd3eg9",
      "body": "yaa, why do u seem surprised?"
    },
    {
      "id": "jxd7rby",
      "body": "Beyond the obviously exorbitant amount you'll be paying, PESU won't really provide any return on the investment - nothing here justifies that amount. That's why people are judging you."
    },
    {
      "id": "jxdh3v7",
      "body": "Thanks for letting me know your perspective. I believe, when it comes to placement scenario, its the knowledge and skills of an individual that matters the most. A good college is just a gateway to a lot of opportunities. So, here, in my case, not only in core, I'm also interested in IT. So considering all the above factors, i'm planning for management. I unfortunately couldn't make it through PESSAT, seat surrender being the lowest this year. So, if there are any seat surrenders in latter days, I should be good to go."
    },
    {
      "id": "jxdhwbj",
      "body": "I'm not judging you or questioning your skills - I myself have friends from management who are currently working at great companies. I agree that skills are all that matter. But you also need to understand the demographic of the students who opt for management usually does not include the likes of you."
    },
    {
      "id": "jxdjxng",
      "body": "That's true, I totally agree with you. People you mingle with have a greater role to play on your overall personality, whether they come through merit or MQ."
    },
    {
      "id": "jxdmrf0",
      "body": "Wow even after all the recent news about PESU ppl still want to join through Management Quota?\n\nAnd there's a fuckin wait list for that OML HOW?\nWAITLIST EVEN FOR ECE 💀?"
    },
    {
      "id": "jxen48a",
      "body": "Hey could you tell how the demographic is that opts for  management ? Doesn't pes ask for high board marks for management students to ensure it's not easy to get in even through management?"
    },
    {
      "id": "jxeyzd8",
      "body": "Hey could you tell how the demographic is that opts for  management ? Doesn't pes ask for high board marks for management students to ensure it's not easy to get in even through management?"
    },
    {
      "id": "jxfa52r",
      "body": "Do you really think Board marks are representative of academic quality? How many people in your own school have crossed the 80% threshold?"
    },
    {
      "id": "jxfih1n",
      "body": "Honestly not many crossed the 80% threshold 💀 but I get your point.\n\nWo usually management quota students dont do well in pesu?"
    },
    {
      "id": "jxnb9op",
      "body": "Most of them are here because of financial privilege and just scrape through classes year after year"
    }
  ]
}