{
  "id": "15zxros",
  "title": "PES Lateral Entry Anyone",
  "content": "I got a seat through PESSAT at rr campus cse normal one\nI'm trying to get a same seat in pes rr campus cs through DCET it will reduce my fees from 4 lakhs to 1 lakh\n\nMy main reason to join any college is for it's placements \n\nAre lateral entry students given same placements as others If so \ndo companies have any criteria that only 12th students can take part in placement \n\nor should I try other colleges cse such as RVCE , BMSCE, MSRIT .",
  "metadata": {
    "author": "BroSubZGamingYT",
    "url": "https://www.reddit.com/r/PESU/comments/15zxros/pes_lateral_entry_anyone/",
    "permalink": "/r/PESU/comments/15zxros/pes_lateral_entry_anyone/",
    "score": 7,
    "created_utc": 1692871974,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jxjsloj",
      "body": "I would not recommend this. \n\nWhile although lateral entry students are also treated the same, they also will need to cover up portions for prerequisite courses in first year that others had, once they join in 2nd year.\n\nDo you not have a seat at any college?"
    },
    {
      "id": "jxkdm4s",
      "body": "Wait what are we supposed to do? I have no college currently pessat rank 1201"
    },
    {
      "id": "jxnp2a9",
      "body": "It's just that I have covered my 3rd and 4th sem portions in my diploma the only problem I'll have is with maths\nI'm just scared that I'll not have same opportunities as others"
    },
    {
      "id": "jxo46ml",
      "body": "Diploma students join the classes from 3rd sem onwards , they have extra workload (they need to take up certain courses from 1st sem and 2nd sem ). Regarding placements there is no discrimination between diploma and normal students ."
    },
    {
      "id": "jxo4p31",
      "body": "What would you recommend for me\nI still have my cet to write\nwhich college is better for my situation"
    }
  ]
}