{
  "id": "160ktnf",
  "title": "I feel like I made a mistake",
  "content": "So I took admission in PES EC campus in CSE through management quota. Now I know fees is crazy, but fees isn't really a major problem for my family fortunately. I've heard both good and bad about pes, regarding academics and placements it seems like one of the best in the country I guess, and regarding campus life it seems like one of the worst. I'm a fairly smart guy, and I think I can take advantage of the academic exposure, and I feel like I can bag a decent package (I'm thinking somewhere around 12LPA) and I'm also quite motivated to study for the next 4 years (I know all freshers believe this lol) , and all this is the reason I chose to join this college. (I almost got in through pessat, I was getting seat in aiml through pessat but my dad said cse would be better and he was okay with paying the management quota fees, so we went ahead with it)\n\nNow I don't know if I made the right decision, especially since a lot of seniors say joining pes was the worst decision they made, and all I hear about pes on Instagram and on this sub is negative. Is this the regular \"my college is the worst\" dialogue that every single student in the country uses, or it pes genuinely that bad? \n\nSorry for the long post, and thanks if you read it through",
  "metadata": {
    "author": "Arsh2905",
    "url": "https://www.reddit.com/r/PESU/comments/160ktnf/i_feel_like_i_made_a_mistake/",
    "permalink": "/r/PESU/comments/160ktnf/i_feel_like_i_made_a_mistake/",
    "score": 26,
    "created_utc": 1692926539,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jxn9euh",
      "body": "Pes is genuinely that bad."
    },
    {
      "id": "jxnaar2",
      "body": "During the second counselling round they had told that companies that used to pay 12 + l to the freshers are now hiring in single digits. Also with the introduction or more cs seats in ec campus and with combined placements, it would be like jee again tryna get a decent placement."
    },
    {
      "id": "jxnbd5s",
      "body": "Be prepared for this shit bro. I'm also stuck in this shit with you.."
    },
    {
      "id": "jxncpl9",
      "body": "Hey, I graduated in 2022. I think I can answer most if not all of your issues.\n\nYes, the fees are insanely high via management and college life isn't a very great thing here. It has also been deteriorating a lot the last 4-5 years and tbh it's only a glimpse of the reputation that exists outside.\n\nIMO, PES is barely worth the PESSAT fee, let alone the management fees. Now every college has its fair share of problems however the issue with PES is that these problems only seem to be getting exponentially worse every year. Poor management, mediocre faculty, stressful workloads - you've read this story multiple times (and if not, then check the FAQ post in which I've highlighted the pros and cons of PES). Some of these problems have simple solutions and it makes you wonder why it's an issue in the first place.\n\nHowever having said that - is it the worst place to be? Maybe not. There are a few things PES gets right. If your goal is placements then you will manage to get something out of it. But is PES the best place or does it deserve the reputation it has? Absolutely not lmao. \n\nI'd still hold on to my opinion that whatever you're paying for PES isn't worth it - there aren't enough returns to justify it. You'd receive similar benefits at other top Bangalore colleges like MSRIT and BMS by paying much lesser for management seats. The management quota seat at PES is not worth that kind of money."
    },
    {
      "id": "jxne4ku",
      "body": "![gif](giphy|vjjCsx3izfSyQ)\n\nNah"
    },
    {
      "id": "jxnhwat",
      "body": "Thanks for your input, yeah PES or any other college for that matter isn't worth such a fee, but MSRIT and BMS have management fees at around 9-10 lakhs, so not a huge difference. I f-ed up in 12th and can't get into any of the top colleges, so this is the last resort I have. I'm also aiming for scholarship to get atleast some of the money back.\n\nAre the placements good enough (for students with caliber) to get a return on the investment, atleast within 3-4 years? I'm in CSE\n\nAnd should I withdraw from the college and take a drop, or would you recommend me to go ahead? (The fees isn't that big of a deal, my father earns fairly well, and he's more concerned about quality of education over fees, I was getting srm vit and colleges of the like, but he chose to pay more to get me into a college like pes)"
    },
    {
      "id": "jxni5v1",
      "body": "May the lord save us from the wraths of pes :( \nWhich branch and campus btw?"
    },
    {
      "id": "jxnie1h",
      "body": "Wait so suddenly the companies are paying less? Is it only in pes or in all colleges?"
    },
    {
      "id": "jxnjr4r",
      "body": "All colleges but acc to me the future of pes ain't looking as good as before."
    },
    {
      "id": "jxnmjgw",
      "body": "They aren't paying less - they are hiring significantly lesser. Companies that recruited close to 30 from my batch have recruited <10 in the subsequent batches"
    },
    {
      "id": "jxnn8yu",
      "body": ">Are the placements good enough (for students with caliber) to get a return on the investment, atleast within 3-4 years? I'm in CSE\n\nIt honestly depends on you. If you have the capability, yes you can.\n\n>And should I withdraw from the college and take a drop, or would you recommend me to go ahead?\n\nPersonally, I am not a fan of management quota. However its not my position to suggest what to do. You should discuss this with your parents and see whats the best course of action keeping in mind factors like what you might achieve and what you achieved in entrances this year."
    },
    {
      "id": "jxnoaci",
      "body": "My parents still believe going for pes was the right choice. I messed up cet comedk and jee but did decently well in private college exams like srm vit pessat met and a few more. My main question is, should I drop my seat in pes and go for either msrit or bms, or should I go ahead with pes? As compared to these 2 colleges, will pes prove to be the right choice, according to you?"
    },
    {
      "id": "jxnu2bu",
      "body": "Amen brother we're together in this let's hope we survive"
    },
    {
      "id": "jxnufv2",
      "body": "Brother,  if you could afford management , why not take RV?"
    },
    {
      "id": "jxnxf8q",
      "body": "If possible, try moving to CSE(AIML) \\[PESSAT\\] - EC Campus."
    },
    {
      "id": "jxnz58x",
      "body": "CS branch and EC campus"
    },
    {
      "id": "jxnzors",
      "body": "The fee there is way more than that of PES. It sums up around 65 lakhs. Tbh, even if it's expensive, it's worth it. It's better than cs here (my personal opinion)."
    },
    {
      "id": "jxnzpgn",
      "body": "The fee there is way more than that of PES. It sums up around 65 lakhs. Tbh, even if it's expensive, it's worth it. It's better than cs here (my personal opinion)."
    },
    {
      "id": "jxnzqii",
      "body": "Which campus bro ? Cs branch ?"
    },
    {
      "id": "jxo1455",
      "body": "Aha my classmate"
    },
    {
      "id": "jxo1t71",
      "body": "Yes. And are u attending the orientation this Sunday ?"
    },
    {
      "id": "jxo3kzc",
      "body": "Depends on your goals tbh. Since you're coming from management quota your current goal must be to get back the return on the investment, in which cause you will be prioritising placements. In that case, PES is the best option for you right now. \n\nIf your objective is to go for higher education, then the other top Bangalore colleges might have been better since ranking among these is irrelevant, but you'll find better opportunities there."
    },
    {
      "id": "jxo7equ",
      "body": "sorry to break it to you, if you cant perform in public exams you arent 'fairly smart enough' as you quoted earlier\n\nin pvt exams people manipulate ranks according to parents income and so many other factors, especially PES and VIT, i know people with 70%ile getting 400 rank in pessat and under 2 rank in viteee"
    },
    {
      "id": "jxo9nyd",
      "body": "I get where you're coming from, but I had a medical condition a while before my boards, and that messed my boards up as well as my jee since jee was right after boards. Since my boards got messed up, my cet rank got messed up (50% of cet marks comes from boards). I got a decent rank in comedk but not enough to get admission in the top 4 of Bangalore in cse. \n\nI got into many private colleges, not just pes and vit, but they just weren't as good as pes. Pes couldn't have manipulated ranks according to salary because I think they didn't ask for salary during application of pessat (I'm not sure though)"
    },
    {
      "id": "jxoa7sx",
      "body": "Nope I'm actually not interested in higher studies, I might do mba later but it's not on my priority list for now, I'm mostly looking for career stability (so placements I guess) and a decent college life. So in that case, going for pes will be a good choice right?"
    },
    {
      "id": "jxoesao",
      "body": "Tbh , in my opinion even if you get placed for 12LPA , the return of investment isn't going to be a lot .... you really need to consider your options. If you are getting even getting ise in bms or msrit my opinion would be to take it . CSE in BIT/DSCE are not bad options either , many of my friends have been placed well in top companies like amazon/goldman sachs through these colleges .\n\n&#x200B;\n\nAlso there is barely any college life in pes lmao , its the same race as you had during jee/neet but just on a smaller scale."
    },
    {
      "id": "jxofuks",
      "body": "EC Campus CSE lol"
    },
    {
      "id": "jxomhss",
      "body": "Hello classmate !\nLet's meet at the orientation this Sunday.."
    },
    {
      "id": "jxonlt0",
      "body": "its alright man, its not like college is the end of the road\n\ni just wanted to point out private exams dont show your true calibre with respect to everyone, thats all, don't assume a person is good just with their private exam marks\n\nall the best and do well in college"
    },
    {
      "id": "jxp8fpk",
      "body": "Bro barely got a seat and wants 12LPA 💀💀"
    },
    {
      "id": "jxpe4fd",
      "body": "well im the same position as OP , as OP said he got into VIT / SRM  but so its not a strech for him to get 12 LPA"
    },
    {
      "id": "jxpe6yx",
      "body": ">Hello classmate ! Let's meet at the orientation this Sunday..\n\nsame lol lets meet this sunday"
    },
    {
      "id": "jxpgunb",
      "body": "yeah sure"
    },
    {
      "id": "jxpj26m",
      "body": "My dad strictly wants me to take cse only. I could have taken aiml in pes itself through pessat, but he didn't want that either. He's a software engineer himself and is in the industry for over 20 years, he checked the syllabus of pes and said it's top notch when compared to other colleges. I spoke to him about the fees but he doesn't seem to mind too much, apparently he only cares about education quality. For some reason I just feel guilty inside for using up a lot of money for the college, so the least I can do is make sure I atleast go to a college that's worth it, hence the post. The return on investment part is not an urgency, I can wait upto 4-5 years to get it covered, but just wanted to make sure I can get back more money than I pay, to atleast make it seem worth it"
    },
    {
      "id": "jxpwpx3",
      "body": "I’ve heard placements happen in Banashankari campus and not EC campus. Is that true?"
    },
    {
      "id": "jxscncc",
      "body": "Yeah it happens in Banashankari campus, and EC students are required to go there, so it's a common placement area for all PES students"
    },
    {
      "id": "jxt9uja",
      "body": "bruh getting vit/srm is easy af. He could not even get cs at ec campus which easy and expecting 12lpa its not that easy.Downvote if u want but even 12 lpa ctc is unlikely in hand toh dur ke baat."
    },
    {
      "id": "jxv1m5w",
      "body": "If you think getting into vit/srm is an achievement, you're definitely not getting that much."
    }
  ]
}