{
  "id": "161u5wq",
  "title": "Bootstrap",
  "content": "I got an email from the uni about the bootstrap program for the first week. \nSeniors, what is it and is it really useful ?",
  "metadata": {
    "author": "No-War-3966",
    "url": "https://www.reddit.com/r/PESU/comments/161u5wq/bootstrap/",
    "permalink": "/r/PESU/comments/161u5wq/bootstrap/",
    "score": 6,
    "created_utc": 1693053561,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jxtq8en",
      "body": "It's like 5 days you'll be doing different tasks .\nFirst day could be painting a government school.\nSecond day could be doing something related to electric like bulb or something.\nThird day could be something related to electronics.\nFourth day could be related to mechanical.\nFifth day could be related to cs.\nYou'll get an overview of all the branches and like how do they work.\nYour second question whether it is useful yes you tend to make new friends in bootstrap which is very important I'd say."
    },
    {
      "id": "jxtqyud",
      "body": "Thank you so much for replying"
    },
    {
      "id": "jxu0cat",
      "body": "Booty strap"
    },
    {
      "id": "jxx3dar",
      "body": "Adding to this - if you want to see what it's about there are videos uploaded to the PES YouTube channel for every batch's bootstrap"
    },
    {
      "id": "jxxkn6r",
      "body": "Bootstrap program stands as an introductory program to all the incoming juniors of PES University. They basically introduce to all the branches ranging from EEE, ECE, Mech, Civil, CS design thinking & finally a place where you would be given multiple tasks \\[called \"Community Development\"\\]. Different Color codes, would be given to you on the last day afaik.  \n\n\nInfo: **Students are advised to wear comfortable and inexpensive clothing as the activities are outdoor in nature. Bring your own water bottles and have breakfast and come. Snacks and lunch will be provided. Please do not bring expensive gadgets. If you can avoid cell phones its appreciated. and you are responsible for your belongings.**\n\n  \n[This is](https://docs.google.com/document/d/1gid3Z5wsVO9qzWXFN2sXaa5lRWg-l_NG/edit?usp=sharing&ouid=110703182613867120882&rtpof=true&sd=true) Document they sent for my Bootstrap. \\[2021-2025\\]\n\nP.S: You must wear PES T-shirts on the Community Development Day."
    },
    {
      "id": "jxyinnq",
      "body": "about the usefullnss part im not really sure , but definitely the friends you make over these 5 days are the ones that will mostly stay with you till you finish engineering (at least in my case) . it gives you a great opportunity to socialise quickly so do not miss it under any circumstances .\n\nin other colleges it is also referred to as an induction program and it basically gives you an idea about the various branches of engineering ."
    }
  ]
}