{
  "id": "162t1fc",
  "title": "Student life",
  "content": "Rvce or PES which is better?",
  "metadata": {
    "author": "FoReSiGhToP",
    "url": "https://www.reddit.com/r/PESU/comments/162t1fc/student_life/",
    "permalink": "/r/PESU/comments/162t1fc/student_life/",
    "score": 2,
    "created_utc": 1693149311,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jxyub88",
      "body": "RVCE"
    },
    {
      "id": "jxz8jrg",
      "body": "Whatever you have read previously forget it as now PES has changed the number of internals going to be conducted from this year, there are going to be only 2 ISA s, so college won't be hectic at all(considering tht we had to study for Isa every 2 weeks previously), recently pes also announced that the badminton court and basketball court can be used for free by students and these 2 indoor courts are top class, no other colleges have these kind of sports infrastructure, pes life will be more comfortable than other colleges as most of them have 3 internals, now that we will be having only 2 Isa s, you have a lot of free time, to work on ur cocurriculars and develop skills tht u find interesting."
    },
    {
      "id": "jxzfrti",
      "body": "Pes peer quality>> rvce"
    },
    {
      "id": "jxzhvc7",
      "body": "what 💀💀💀💀"
    },
    {
      "id": "jy1r0e2",
      "body": "Adding a little clarity to the ISA point:\n\nISAs will now be significantly harder - before, each ISA was based on 1 unit. There were totally 5 units, so 5 ISAs. They have restructured 5 units into 4 units (note the word *restructured*, **not** reduced). Hence, now the content per unit is actually 1.25x what it used to be. Now that there are 2 ISAs, which each ISA testing 2 units, you are basically now attempting *being tested for 50% of the syllabus per ISA*. Secondly, before ISAs had a \"best of 4\" policy where they would pick the best 4/5 ISAs for your scores. That's gone now, so if you don't do well in a single ISA, 25% of your final grade is tanked (each ISA contributes 25% to the overall grade). \n\nAs for the extra curricular activities - I'd say depends a lot on the person. I graduated with the 2-ISA system and I can vouch for and say that the only time we had free time was first year. Once you enter second year, there's just way too many things to get done for each course and beyond the course to actually spend time in sports and other activities."
    },
    {
      "id": "jy245uf",
      "body": "Agreed"
    },
    {
      "id": "jy2m6jv",
      "body": "You are doing engineering."
    }
  ]
}