{
  "id": "162wrud",
  "title": "Can someone clear this confusion",
  "content": "So I just got bmsce ise in 3rd round of comedk. My rank in kcet is 12xx and bmsce ise closed at 17xx this yr. Now the mistake I made was that I put pes aiml above bms ise so that is what I was allotted in the 1st round. Now I really wanna go to bms. According to the cutoffs my rank is way above the closing rank. But I'm scared that just like all other counselings this yr there will be almpst no change in cutoff in which case I won't get bms thru cet. Can someone just pls tell if I should reject my comedk seat and wait for cet or just take comedk seat.",
  "metadata": {
    "author": "Lem_on_00",
    "url": "https://www.reddit.com/r/PESU/comments/162wrud/can_someone_clear_this_confusion/",
    "permalink": "/r/PESU/comments/162wrud/can_someone_clear_this_confusion/",
    "score": 5,
    "created_utc": 1693158035,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jxzir5t",
      "body": "Won't rejecting get you to pay a penalty?"
    },
    {
      "id": "jxzsss7",
      "body": "No as I didn't get anything in r2 or r1"
    },
    {
      "id": "jxzv4fw",
      "body": "You can reorder your options in kcet right"
    },
    {
      "id": "jxzvi40",
      "body": "What choice have you made in kcet (1,2 or 3)?"
    },
    {
      "id": "jxzwaaf",
      "body": "Makes sense. You could've chose option 3 in kcet that will remove PES AIML in the second round, and you would've gotten BMS ISE ez. The cutoffs won't go crazy, especially no way there would be a 500+ difference. 99% certain you'll get in second round"
    },
    {
      "id": "jxzzma0",
      "body": "You can change order in KCET before round 2"
    },
    {
      "id": "jy05d4x",
      "body": "Ok yes I've selected choice 3...will withdraw from comedk"
    },
    {
      "id": "jy0dwfg",
      "body": "Reject seat by excercising choice 3 .\nReorder options b4 round 2 ( note that in this u can't include pes ai ml as u rejected that but all other options below and above can be reordered ).\n\nIF someone rejects/upgrades their bms ise seat you'll probably be given first preference because ur rank is good enough"
    },
    {
      "id": "jy23ywv",
      "body": "DONT reject the seat if you are able to pay the fees \nYou can reserve it and apply for kcet 2nd round \nIf you get seat in kcet round 2 you can mail comedk your admission order letter with fee receipt of kcet and you will get refund.\nYour comedk seat will be converted to merit (kcet) seat\nYou can call and confirm this with comedk bro \nDon't worry it's an easy process"
    },
    {
      "id": "jy242im",
      "body": "Ok thanks"
    },
    {
      "id": "jy3b6pk",
      "body": "Im not sure but AFAIK from this year if you get kcet seat in any round , comedk will refund the fee IRRESPECTIVE of the round.\nConfirm this once."
    }
  ]
}