{
  "id": "164dmt0",
  "title": "Branch and college confusion",
  "content": "Please help me out , my kcet rank is 5XX . I would really appreciate the help offered by any senior . I will surely get core cse in PES rr campus (that is what I got in first round of kcet councelling) . \nThis is my option entry :\nRvce cse\nRvce ise \nRvce cs with ds\nPes cse \nSHOULD I MAKE ANY CHANGES BEFORE ENTERING INTO THE NEXT ROUND ? \nI'm especially confused about rvce csds vs pes cse . \n\nThanks in advance",
  "metadata": {
    "author": "Vishruth_M_D",
    "url": "https://www.reddit.com/r/PESU/comments/164dmt0/branch_and_college_confusion/",
    "permalink": "/r/PESU/comments/164dmt0/branch_and_college_confusion/",
    "score": 5,
    "created_utc": 1693301376,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jy7i0vb",
      "body": "This is my option entry list\n1. Rvce cse \n2. Rvce ise \n3. Rvce csds\n5. Pesu cse"
    },
    {
      "id": "jy7j0e5",
      "body": "I'd pick bms over pes"
    },
    {
      "id": "jy7m7hs",
      "body": "fr"
    },
    {
      "id": "jy7okxq",
      "body": "I think you need to add BMS cse too if you’d like - else this looks very good - rvce cs+() anyday - one of my friend with a similar rank is taking up aiml or cs+ds over bms cse and pes cse"
    },
    {
      "id": "jy7p3uq",
      "body": "You may get rv cse in r3 ~ last year it went upto 600"
    },
    {
      "id": "jy7pa6m",
      "body": "I would suggest sticking to core CS instead of the specialisation branches"
    },
    {
      "id": "jy7pf68",
      "body": "BMS cse>>PESU cse"
    },
    {
      "id": "jy7q6jm",
      "body": "I think you can not add any new options  now but can only delete or change order of existing options above pes cse"
    },
    {
      "id": "jy89yj1",
      "body": "Seeing the current condition of PES , I would suggest RV>BMS>PES"
    },
    {
      "id": "jy8nd0e",
      "body": "Idk why this is being downvoted while comment saying that they prefer bms over pes is upvoted lol"
    },
    {
      "id": "jy8wncw",
      "body": "So u wud suggest pes cse over rv csds ?\nAnd what abt rv ise vs pes cse?"
    },
    {
      "id": "jy991yv",
      "body": "PES CSE"
    },
    {
      "id": "jy9ie2k",
      "body": "PES CSE over other specilization"
    },
    {
      "id": "jy9s61h",
      "body": "Why though?"
    },
    {
      "id": "jyafsp4",
      "body": "Is RVCE better than VIT/ MANIPAL?\nTo which NITs can RV be compared?"
    },
    {
      "id": "jybritx",
      "body": "BMS is shite afaik   \nthe teachers don't teach well cuz there's some 60% reservation for teachers. I got this info from my family friend who works at the counselling department of kcet and comedk"
    },
    {
      "id": "jyc5jsy",
      "body": "I would suggest RV CS, PES CS, followed by the RV specialisations in your order of preference. Idk how BMS or MSRIT CS departments are, but I think you should not look at these as viable options since you should be able to get RV or PES."
    },
    {
      "id": "jydhnbq",
      "body": "The faculty in PES ain't better , in end everyone is gonna do self study BMS has a more relaxed schedule which will help you on focusing on your LC and extra projects .Regarding placements most of the companies visiting PES are also visiting BMS. Plus the strength in BMS is very lesser than PES, PES is becoming the VIT of blr."
    }
  ]
}