{
  "id": "165dy2i",
  "title": "Capstone project Help",
  "content": "Currently in third year. Wanted to know who is better for a Capstone in Wireless Networking domain? Options in my hand: Dr. Vamshi Krishna and Prof Rajshekhar. Also, *what are the consequences if I go under a professor and I am allotted a team rather than me having my own.*   \n\n\nP.S: I have prior experience working with Rajshekhar sir earlier during summer. It's been very hard to find anyone interested in this domain. ",
  "metadata": {
    "author": "Comprehensive-Fig722",
    "url": "https://www.reddit.com/r/PESU/comments/165dy2i/capstone_project_help/",
    "permalink": "/r/PESU/comments/165dy2i/capstone_project_help/",
    "score": 4,
    "created_utc": 1693400074,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jyi8e7v",
      "body": "well i had  worked under vamshi sir as a group project(me including three of my friends)...so as per my experience..he had suggested some projects in networking domain or u can share ur ideas for a project that u want to do under him without him giving a topic under.Yeah he has a really good knowledge in networking domain and some people have published really good  papers under him.But he is a little bit strict when it comes to subject and timings if u work under him u need to be well prepared with the topic or whatever literature paper that he has sent or u have found regarding the topic that was given in meetings with him as he is going ask you a lot of questions...on what you have read and what is the status of ur project like he wants to understand what you have understood and even ask you to explain it to him. So more like being well prepared with ur research and what to explain in each meetings..more like in depth understanding.Yeah let's say he is ur panel in capstone exam like isa s.etc then be well prepared in ur part in the project as there as he is going to ask a lot of questions (more like being screwed if u have not prepare well..which happened in my friend's case) but don't worry about that..i am sure u can do well in project..and sir is always there to help.. if u have doubts .But ultimately it's ur decision with whom to work with ..but regarding rajshekar..i don't know much about him but in my experience he is a very chilled person..(i took a spl topic inn 8th sem  under him and believe me not most of them (including me)got A grade...paper is really easy..at times he shares questions that might come in esa and it does).Feel free to dm me ."
    },
    {
      "id": "jyph1q6",
      "body": "Thank you for sharing your experience with Vamshi sir. I will most likely go with Rajshekhar sir."
    }
  ]
}