{
  "id": "167boes",
  "title": "Pesu io",
  "content": "Is it worth it? What are the pros and cons of joining?",
  "metadata": {
    "author": "Mind-Control-411",
    "url": "https://www.reddit.com/r/PESU/comments/167boes/pesu_io/",
    "permalink": "/r/PESU/comments/167boes/pesu_io/",
    "score": 7,
    "created_utc": 1693585340,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jyoqf0i",
      "body": "Why is everyone like pesu io site is down in the wa group of 27 😂\nLike you guys haven't even started classes lol chillax a bit \n\nComing to your question , pesu io course is totally worth it man . The sme's are really well versed in their fields . I would recommend taking it totally ."
    },
    {
      "id": "jyoyvvv",
      "body": "We just have the newbie excitement....and for sone reason if you open it in an incognito tab you can get in"
    },
    {
      "id": "jyp3i3r",
      "body": "I'll be honest. You won't really learn much in the pesu io course. It is more to explore different fields and see if you are interested in a topic and plan to study it further.\n\nSo coming to your question you can learn all of the content on YouTube for free instead of paying money to attend a course. However if there is a final group project it would be worth it cause you will get a project you can showcase and it will also help your presentation/speaking skills. Also some of the SME are good at their field and you can gain some insights regarding the scope of the topic."
    },
    {
      "id": "jypgtid",
      "body": "How much is the cost now?"
    },
    {
      "id": "jyrardx",
      "body": "It was 700 the last time I checked\nNot sure now"
    },
    {
      "id": "jyrs06m",
      "body": "Gosh! No way. See, the main thing is how the SME is. If you are interested in taking up a particular Course in PESU I/O, do a check on how the SME is, and his/her experiences before taking it."
    },
    {
      "id": "jyrswel",
      "body": "www.ex28c.tech"
    },
    {
      "id": "jyrvm4c",
      "body": "Not worth it man, had a really bad experience last sem. Course was bad , SME was bad and final project was bad. Regret spending 700 for this rather buy some Udemy course."
    },
    {
      "id": "jyrx092",
      "body": "Its offline or online"
    },
    {
      "id": "jys6egd",
      "body": "guys look im speaking from my experience with pesu io , it was good alr , the sme was great as well fo us , not sure about others tho"
    },
    {
      "id": "jys911v",
      "body": "Heyy as a student and 2 time SME of PESU I/O here's my review  \n1. Go for a non-technical courses, you'll be able to learn from a senior and also find peers with similar interest  \n2. For Technical courses, it really depends on the senior who is your SME and his proficiency in the subject and his teaching skills   \n3. If the course is paid (idk if things have changed) then i would suggest to look somewhere outside for technical courses, the certification issuing organization does matter  \n4. PESU I/O acts like a brilliant space to network and meet like minded peeps, that's a experience worth joining PESU I/O  \n5. If possible, in your 4 years of college, try becoming and SME too, it will teach you good things and you'll probably enjoy it  \n\n\nIs it worth it?  \nFor technical courses, i mostly think No; but for non-technical courses, definitely"
    },
    {
      "id": "jyz9nsi",
      "body": "I'd like to add to that...if you're looking to get into dev, it really gives you that starting point, because everybody around you is developing something so you will have the urge to do smtn better too. \n\nI took up a flutter course in my 2nd sem and after that course took things forward to build some projects out of that."
    },
    {
      "id": "jz4oe7o",
      "body": " u ll see ppl telling Here take udemy , take courses and all free audit , damn peace and stuff.\nBut honest opinion,  u know how we study online, not all the way interested and all , and to stay committed online is a real issue.\nSo if u take offline courses in pesuio as a foundations to lay ur track , with seniors who ll tell u material , network to collab with , find some teammates to work on a project with .\nPpl will be like not so great project , bro it's addressed towards first years,  what do u expect them to build a numeral network in 11 days ??😂😂😂\nSo if u r lookin for a start and someone to push u as work on a course or domain  , pesuio courses are great"
    },
    {
      "id": "jz4pyrl",
      "body": "Very simple as stated...\n\n1. PESU IO is something which gives you an opening for the things which is not in college curriculum. \n2. It is more comfortable to learn with a peer and a senior than to learn than learning using tutorial.\n3. Since it is for a short duration, it kinda gives a quick exposure to certain topics.. If you are not interested, then topic change.. course change\n4. I got a few seniors who helped me through-out my PESU life.. That was through PESU IO.\n5. PESU IO core team handles tier 1 events (except Aatmatrisha - That is mostly who stick with VK for years).. Events like TAS, Epsilon Selection etc. If you showcase your skills.. then it's a gateway for great things\n6. Courses will be comparately good and kinda worth for the money. They give some college branded goodies as well\n\nCons:\n\n1. All the classes are post college hours. Need to make some time for assignments and projects.\n2. Sometimes heavy concepts will be taught by the SMEs. For newbies, it might be difficult to pick-up. Only solution is to talk it out and work a lil more.\n3. You will be exposed for the topic for a short time.. Most of us, tend to leave it there.. A continous learning timeline is our responsibility. Few SMEs will be kind enough to hold our hands till the end....\n\nIf you ask me.. Go for it.. Have something which other college students won't be having. The certificates are valid outside only.. It is handy during internship application, but what matters more is.. what you have picked up in the PESU IO Course. Most of the clubs like Hackerspace, IEEE etc tried to implement/copy this.. A lot of discussions also happened. But PESU IO is kinda doing it from 2017 (My first year in PESU) and they have developed this at some next level."
    },
    {
      "id": "jz6mj7a",
      "body": "I've taken two courses and both seemed totally worth it to me. I noticed people saying they'd rather take a udemy course but let's be honest, you won't get the one to one interaction, offline sessions or the group project experience in online courses. It's an excellent place to start exploring since most first years won't be sure where their interest lies. So I'd surely recommend taking a course."
    },
    {
      "id": "nevpkv0",
      "body": "Which course did u take ?"
    }
  ]
}