{
  "id": "167utxy",
  "title": "Doubt regarding class arrangement for 1st year students at PESU",
  "content": "Our classes ( B Tech 1st year) are going to start next week and for now, they've mixed up all the branches and arranged them into different sections based on alphabetical order, will we continue to be in the same section next sem/next year also or will they reshuffle after KCET students arrive? Also, will the new sections for next sem be alloted combining all branches or will it be same branch students in the same class? ",
  "metadata": {
    "author": "Rishikesh-Kumar2004",
    "url": "https://www.reddit.com/r/PESU/comments/167utxy/doubt_regarding_class_arrangement_for_1st_year/",
    "permalink": "/r/PESU/comments/167utxy/doubt_regarding_class_arrangement_for_1st_year/",
    "score": 8,
    "created_utc": 1693635402,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jyrzm1q",
      "body": "Next sem u will alloted srns in alphabetical order and  mostly all sections will have people from only 1 branch barring 2 or three sections. In third sem all peeps in ur section will be from ur branch and sections would again be alloted srn wise (like 1-60 in A section) . The people who come in later rounds of counseling will be alloted different sections in 1st sem but from 2nd sem onwards it would be purely according to srn which doesn't depend on when u joined in 1st sem."
    },
    {
      "id": "jys0lej",
      "body": "so are we going to be stuck with peeps whose names start with our name's first letter for the entire 4 years 🤡"
    },
    {
      "id": "jys0zed",
      "body": "Yes."
    },
    {
      "id": "jys36h4",
      "body": "that sounds painful as fuck for some reason lol"
    },
    {
      "id": "jys3mph",
      "body": "Lol u will get used to it. U will have electives in 3rd year. Atleast for ur elective classes u could have different people in ur class"
    },
    {
      "id": "jytt3gp",
      "body": "The classes are starting next week? KCET counselling is still going on right?"
    },
    {
      "id": "jywirwf",
      "body": "It wasn't like this until 2020 actually lmao. My section shuffling in 3rd sem was completely randomised so there are people whose names start with all letters"
    },
    {
      "id": "jywj7le",
      "body": "They are starting from tommorrow, KCET R1 students like me have been accomodated. They were pretty clear from the start that they wouldn't wait for KCET R2 and R3. \n\nNgl, looking at the pace KEA is going at, it's good that they're not waiting lmao"
    },
    {
      "id": "jyxw2a9",
      "body": "Yeah. Looks like the counselling will end in the last week of Sept."
    },
    {
      "id": "jzoxpz4",
      "body": "Can anyone pls ask in the department will the r2 and r3 students start together or the r3 students will be put in between with  the ongoing r2 classes later😥"
    },
    {
      "id": "jzoxqy8",
      "body": "Can anyone pls ask in the department will the r2 and r3 students start together or the r3 students will be put in between with  the ongoing r2 classes later😥"
    }
  ]
}