{
  "id": "167yrz5",
  "title": "Question for the big boss Rowley anna",
  "content": "Rowley Anna I got a seat through pessat in pes rr cs \nAnna and i saw ur pros vs cons of pes \ni shat myself seeing so many cons\nnow I'm pretty sure I will get bms also through dcet and I will get pes also as bms has higher cutoff\nwhat would u choose and why\nPls answer Rowley",
  "metadata": {
    "author": "BroSubZGamingYT",
    "url": "https://www.reddit.com/r/PESU/comments/167yrz5/question_for_the_big_boss_rowley_anna/",
    "permalink": "/r/PESU/comments/167yrz5/question_for_the_big_boss_rowley_anna/",
    "score": 11,
    "created_utc": 1693649698,
    "flair": "Pride Of PESU",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jysg3uj",
      "body": "What made you do diploma just interested to know"
    },
    {
      "id": "jysi4qh",
      "body": "I had a elder brother who was extremely cautious about his marks. During his end terms,he used to freak out thinking he did a mistake in his previous papers.\nSeeing that my parents thought it would be better for ME to join diploma not him ME\nBut yeah I did score nice in my diploma sems \nAnd it's the same as 12 they do 2 years 12th and 4 years engg\nwe do 3 years diploma and 3 years engg\nyou guys have your maths strong\nwe have our cs core strong"
    },
    {
      "id": "jysich5",
      "body": "Good luck whatever u choose dont regret that"
    },
    {
      "id": "jysiq4p",
      "body": "which year are you brother"
    },
    {
      "id": "jysiv4w",
      "body": "Fresher mostly not gonna be joining"
    },
    {
      "id": "jysj7x4",
      "body": "ðŸ—¿"
    },
    {
      "id": "jysnb7c",
      "body": "heyy, if you don't mind, where are you joining instead?"
    },
    {
      "id": "jyso4sf",
      "body": "His name is rowlet Anna man. u/rowlet-owl"
    },
    {
      "id": "jyson5o",
      "body": "Rowley ðŸ—¿"
    },
    {
      "id": "jysoyve",
      "body": "Hi Rowley Anna\nu/rowlett-owl"
    },
    {
      "id": "jyspnni",
      "body": "Bms ise or uvce cse prolly everyone i contacted has recommended me against cs aiml . I have no chances of cse at pes. The electronic city branch is too far for me and i cant take hostel due to some personal issues .  i personally feel bms ise is better than cse at pes ec tho ."
    },
    {
      "id": "jysqthy",
      "body": "ah ok cool"
    },
    {
      "id": "jysv8f2",
      "body": "i see Rowlett anna has a fan base already"
    },
    {
      "id": "jysvhjm",
      "body": "Although i am not Rowley anna, i would say, continue with PES.\n\nReasons  \n1.  The crowd and peer group of PES is better\n\n2. PES has really good CSE placements\n\n3. Cons exist for literally every college, atleast for PES you have support groups :P"
    },
    {
      "id": "jysz0ld",
      "body": ">peer group of PES is better\n\nDoesnt BMSCE has a much better peer group than the electronic City campus??\n\n>PES has really good CSE placements\n\nDoesn't BMSCE have the same thing?"
    },
    {
      "id": "jyt0kjg",
      "body": "Brother thank you \nWhich year are you brother"
    },
    {
      "id": "jyt0t9t",
      "body": "And how to Enter and go down in texts\n\n\nlike i press enter 100 times but it still shows it in single line"
    },
    {
      "id": "jyt0tog",
      "body": "End of the day, you are still gonna study from youtube/coursera/udemy/chatgpt. The only thing you must care about in engineering colleges is how good the placements and the people you meet in the college are.\nBMS/PES should be your go to. Doesn't matter which one. Both of them are pretty good colleges .\n(Source: Passed out from one of these colleges)"
    },
    {
      "id": "jyt0v18",
      "body": "wait nvm"
    },
    {
      "id": "jyt120v",
      "body": "Bro just a doubt \n\nWhile doing your engg do you get time to play games\n\n\nOr is it just suffering ðŸ‘ï¸ðŸ‘„ðŸ‘ï¸"
    },
    {
      "id": "jyt15xy",
      "body": "Valorant Immortal 2 here xD\nTake a guess :)"
    },
    {
      "id": "jyt1e61",
      "body": "Okay I will have time to grind woah\n\nAnyways how much fps you get \n\nI'm currently ass 2\n\nyeah ðŸ˜”"
    },
    {
      "id": "jyt1v0z",
      "body": "As far as I am aware in placements rv>=pes>bms>msr"
    },
    {
      "id": "jyt3lm0",
      "body": "Its clear you passed out from bms"
    },
    {
      "id": "jyt3m8t",
      "body": "Thanks for the advice"
    },
    {
      "id": "jyt456g",
      "body": "Pes placements are better but bmsce>>>pes e city. Ig its easier to get placed at bms than at ecity coz of second branch+ crowd although placements take place together."
    },
    {
      "id": "jytaxh4",
      "body": "As the designated Rowley Anna, I confirm with this xD"
    },
    {
      "id": "jytmn8o",
      "body": "What makes you say that placements at bms is better than pes ec campus? As far as I know placements in both campuses are similar."
    },
    {
      "id": "jytopvs",
      "body": "Some senior from pes gave me a range of expected/average(sumn i dont rem) package in pes ec and pes rr . The ec campus was like 2 lpa lower(he seems legit)."
    },
    {
      "id": "jytoxfj",
      "body": "What does CSE average package look like in ec campus?"
    },
    {
      "id": "jytpsnx",
      "body": "I dont remember that guy apparently has some yt channel where he shoots videos for colleges"
    },
    {
      "id": "jywienw",
      "body": "This isn't accurate though, cause placements are pooled. Recruiters from companies aren't made aware of which campus the students are from. There is no difference made from the company's end. I've explained this on the subreddit before mathematically."
    },
    {
      "id": "jywihp2",
      "body": "Placements are pooled, it doesn't matter what the average at EC campus is because there is no way to find out that information. Companies don't know which campus you're from during placements"
    },
    {
      "id": "jywl4zs",
      "body": "Fairs but revrecords on yt said me that"
    },
    {
      "id": "jywlng5",
      "body": "Correlation doesn't imply causation. There is a statistical reason behind why the trend exists, and it's not because companies identify you as an ECC kid. To explain at a surface level: more kids in RR than ECC -> less kids from ECC get the higher packages -> average decreases for ECC."
    },
    {
      "id": "jywwcsr",
      "body": "I have graduated my brother"
    },
    {
      "id": "jywwfhn",
      "body": "Mate xD\n\nBelieve us, we have been there ðŸ˜‚"
    },
    {
      "id": "jyx4h1u",
      "body": "Ofcourse you know better . Im only saying what I've heard.\nI have no backing."
    },
    {
      "id": "jyzihvc",
      "body": "Me: chilling in plastic 1"
    },
    {
      "id": "jz0xab8",
      "body": "fun"
    }
  ]
}