{
  "id": "1688jcg",
  "title": "Kcet choice 1 kids help needed",
  "content": "(this post is for a friend)\n\nI got alloted a seat at PES CSE RR through kcet round 1 and I selected choice 1. Admission and all is done.\nBut when I opened the link for kcet round 2 and logged in , i  can see my alloted college in the option entry list.\n\nDoes this mean I'm moving to round 2???\n\nCan any choice 1 kid please confirm that this is normal , help will be really appreciated I am very stressed.",
  "metadata": {
    "author": "onionbiscuits",
    "url": "https://www.reddit.com/r/PESU/comments/1688jcg/kcet_choice_1_kids_help_needed/",
    "permalink": "/r/PESU/comments/1688jcg/kcet_choice_1_kids_help_needed/",
    "score": 3,
    "created_utc": 1693676074,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jyu6zp8",
      "body": "You are supposed to confirm in the website again after you've you gone to the college else admission will be not be considered. If the portal is not present ask him to visit kea immediately."
    },
    {
      "id": "jyug87r",
      "body": "That has been confirmed and even in seat Matrix it shows that his seat is claimed (he's reserved category)"
    },
    {
      "id": "jywihoo",
      "body": "Ask him whether he gave confirmation in kea website after the admission. If not reach kea physically if u r in or around bglr"
    },
    {
      "id": "jywinao",
      "body": "I selected choice 1 as well, and when I login it just shows E009 BW as \"Engg Last Allotted Option\" in green. This is under the Modify Selected Options and View Selected Options tabs. Under the Option Entry Tab (pink), it's completely blank\n\nI really don't think your friends has to worry since they've paid the fees and reported. They should be fine as long as they've confirmed the same with KEA"
    },
    {
      "id": "jywjiyf",
      "body": "Thanks a lot man , bloody guy has been stressing a lot xD. This will hopefully calm him down , much appreciated."
    },
    {
      "id": "jywjpf9",
      "body": "Why did he even bother logging in after completing the process xD? I just logged in now to answer the question"
    },
    {
      "id": "jywk2zz",
      "body": "So this fellow slided from pessat to kcet and their admission process is Lil different, you don't have to go the admission counter anol , so he felt something went wrong and his admission was cancelled xD. he expected the 2nd round entry link not to work and shit when he logged in but started stressing after it showed him option of last alloted college."
    },
    {
      "id": "jywk68d",
      "body": "He did but that's irrelevant regardless if I'm aware. If you fail to report and you have selected choice 1 , you won't be allowed to move to R2"
    },
    {
      "id": "jywzqgp",
      "body": "Brother one last help. Can you click on print option entry and tell me what you see. This nerd is still not convinced bruh :''''''')"
    },
    {
      "id": "jyx2959",
      "body": "I get an error message, most likely cause I have no options entered rn.\n\nFucking hell, your friend is really paranoid huh"
    },
    {
      "id": "jyx3u32",
      "body": "Ok thanks that's enough , appreciate a lot.\n\nYeah he is, probably has OCD or something man smh , gonna put sleeping pills in his drink at this rate xD"
    },
    {
      "id": "jyx45tn",
      "body": "lmfaoooo"
    },
    {
      "id": "jzm30wo",
      "body": "Bro... I'm sorry but one more help. Second round result link came. Can you enter your roll number and see if it shows you college alloted? Cause it does for my friend 😭"
    },
    {
      "id": "jzojtn9",
      "body": "Yep, it shows the same college as allotted. But the \"fees to be paid\" section shows 0, so we have nothing remaining to do"
    }
  ]
}