{
  "id": "16d7b09",
  "title": "During CSE placements what percentage do big shot companies that give dream packages expect in 10th?",
  "content": "I got 74.8%in 10th,71%in 1st PUC and 92%in 2nd PUC.",
  "metadata": {
    "author": "ReachWooden531",
    "url": "https://www.reddit.com/r/PESU/comments/16d7b09/during_cse_placements_what_percentage_do_big_shot/",
    "permalink": "/r/PESU/comments/16d7b09/during_cse_placements_what_percentage_do_big_shot/",
    "score": 5,
    "created_utc": 1694170280,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jzo1yvd",
      "body": "Sorry man but this year quite a lot of companies shortlisted based on 10th and 12th marks too, and these weren't even dream companies."
    },
    {
      "id": "jzo2iqs",
      "body": "I have 74.8% in 10th cbse boards , will i miss out too?"
    },
    {
      "id": "jzo2p8h",
      "body": "Do any of your friends who were in 70-75% range in 10th boards miss out on these companies offer?"
    },
    {
      "id": "jzo4emq",
      "body": "Yep, a guy had 78% or something in 10th, 90+ in 12th and above 9gpa, he got rejected in one of these."
    },
    {
      "id": "jzoh441",
      "body": "If you don't mind could you tell me his package i wanna know..."
    },
    {
      "id": "jzom1cr",
      "body": "Did he get placed later on campus with 12+lpa or not??"
    },
    {
      "id": "jzouw2i",
      "body": "I remember it was tier 1 and I haven't been in touch with him. I just saw his name on a mail with the reason for not getting selected."
    },
    {
      "id": "jzp1fz3",
      "body": "Yes they do filter based on 10th and 12th marks \nMajority keep the cap to ≥60% but they might increase it to 80% if the crowd shortlisted is more than they estimated it to be.\nCGPA cutoff varies based on the time when the company comes and the compensation they provide."
    },
    {
      "id": "jzp7vbo",
      "body": "But in 10th cbse boards final was cancelled and our school graded us based on our midterms so how is that fair??"
    },
    {
      "id": "jzp883i",
      "body": "How many students were in your batch??"
    },
    {
      "id": "jzp9288",
      "body": "Fair or unfair is none of their business, the entire campus placement scene is unfair for masses.\nThey are here to hire and increase headcount so that the investors and government are happy and that is how business works for them, the sooner you realise the better it is.\n\n\nNo company is remotely bothered about what's going on in your life and how fair or unfair their hiring process is, even if they are bothered they won't do anything to change it unless it disrupts their business."
    },
    {
      "id": "jzp98to",
      "body": "Roughly about 1300 both campuses combined afaik."
    },
    {
      "id": "jzp9zc7",
      "body": "So for me getting 12+ lpa in hand package is out of the question during placements for cse due to my board marks??"
    },
    {
      "id": "jzpb0gu",
      "body": "Says who?\nYour board marks open the doors of companies and after that it's your skills and luck and knowledge.\nPeople with exceptional marks struggled to get exceptional packages of 20L and above and people with 65% in boards and 7.6-7.9 got upto 17-23L CTC\n\nGet this in-hand concept out of your mind, when you see taxation systems your 25L CTC will fetch in hand 8-12L annually, but with that dismissal attitude you won't bag anything, naive freshers are blinded by pay and not the impact of the company they want to work at.\n\nGet a grip on yourself and sit for placements, marks will open doors but won't make you cross the opened doors."
    },
    {
      "id": "jzpby9h",
      "body": "Thanks that was helpful."
    },
    {
      "id": "jzrwvgr",
      "body": "Bro what's with the 12+ lpa obsession. Even if you get 90%+ you ain't getting anything if you don't work smart.(and luck as well)"
    },
    {
      "id": "k142wxg",
      "body": "Should I consider ise at msrit then? incase you have forgotten i have 74.8% in 10th boards so I'm worried if I can sit grab a tier-1 job."
    },
    {
      "id": "k148z01",
      "body": "The companies will be the same though, the college is not shortlisting you, the companies are."
    },
    {
      "id": "k1497lg",
      "body": "Yeah but the intake in msrit is quite less just 138 in info science.And 450 in computer related branch excluding aiml folks(around 200)."
    },
    {
      "id": "k14geu4",
      "body": "Idk about msrit but I'm from PES and I can say PES is good for placement opportunities, I'd suggest you to take your chances here. Some companies do shortlist based on 10th marks, and some don't."
    },
    {
      "id": "k14irdg",
      "body": "Did you already get placed in tier 1 company?"
    }
  ]
}