{
  "id": "16f4vnx",
  "title": "How to study to get 9.5+ cg",
  "content": "How do you guys think one should study in the first year to get 9.5+ cg.\nWhat resources and methods should one use. \nHow much time should be spent studying and what books to practice problems and theories from?\nCurrently in 1st sem chem cycle.\nWhat books to use for each subjects for theory and problems?\nAlso how tough is a 10 cg and how can we do it?",
  "metadata": {
    "author": "MiHaWK2k5",
    "url": "https://www.reddit.com/r/PESU/comments/16f4vnx/how_to_study_to_get_95_cg/",
    "permalink": "/r/PESU/comments/16f4vnx/how_to_study_to_get_95_cg/",
    "score": 15,
    "created_utc": 1694364017,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "jzzhnav",
      "body": "I want to know too lol"
    },
    {
      "id": "jzzo8bw",
      "body": "Second year student year. I currently have 9.5+ cgpa so I think I can give some advice. First of all you don't need extra reference books (except mechanics) to get 9.5+ gpa. \nMake sure you read the pesu slides and notes thoroughly and practice problems. You don't have to study religiously everyday. Few hours of study per day is more than sufficient.\n\nIt's not really hard to score well if you have understood the concepts. If you haven't then watch YouTube videos or ask your teacher to clarify it. Practice python regularly if this is your first introduction to programming. For EPD, chem and maths pesu slides and notes are enough. Also for maths make sure you note down all the class work problems and practice that as well.\n\nFor mechanics take the Statics book from the library and only refer to that. All the isa/esa questions come word to word from that text book they don't even change the values. So practice all the reqd sums multiple times. This should be enough."
    },
    {
      "id": "jzzr29b",
      "body": "2nd yr student here. I got 9.55cgpa in 1st year. So the main thing is asslicking of teacher. I mean sit in the front, ask questions and answer when the the teacher asks any question to class. Maintain 90+attendance and study only from notes of teachers. Study before 15-20 days b4 exam. This worked in my cllg."
    },
    {
      "id": "k003ko1",
      "body": "Suggest best YouTube channel"
    },
    {
      "id": "k00hhhx",
      "body": "For epd there's this channel neso academy. Every other subject i never really needed it"
    },
    {
      "id": "k01n6f5",
      "body": "thanks so much and sorry for butting in, but could you please share the same for the physics cycle too? thanks a ton:)"
    },
    {
      "id": "k01vbq6",
      "body": "If you're good with not having a life then you can definitely get 9.5+"
    },
    {
      "id": "k02rs2p",
      "body": "LOL came to say this. Just be the darling of the staff, do/copy all assignments & submit before time, mug up the notes & pre test questions and vomit verbatim during the texts and you get a perfect GPA. It is a deemed college after all!"
    },
    {
      "id": "k02teiq",
      "body": "Wahi to. Some people are downvoting me even though this is the easiest path💀💀💀"
    },
    {
      "id": "k02v7ep",
      "body": "They don't want their secrets to be let out 😉"
    },
    {
      "id": "k03dyiy",
      "body": "PESU dropout with 9.48 cgpa till 3rd sem (I dropped out midway through 4th sem)\n\nI wholeheartedly agree. This is the easiest path to get a high gpa in PES. Asslicking will get you places that smarts can't. \n\nIn my first and second sem I pretty much did this, it was easy to score 9.5(ish). \n\n3rd sem halfway through I started bunking a little here and there and while I could easily keep up with the lectures, I found the same lecturers who would praise me in class now would glare at me and oversee my doubts/concerns. Still easy to score marks in CBT and SE as long as you study, but it gets more difficult to score 9.5+ because your assignments will be marked down by your profs because \"you're not in class enough\". So yeah, that's my 2 cents."
    },
    {
      "id": "k03h0hr",
      "body": "Why dropout bro?"
    },
    {
      "id": "k03hovm",
      "body": "Hated electronics, loved computers, didn't see the point in wasting 2 more years doing something I didn't enjoy (even though the end result would be an it job lol). \n\n\nPlus I was a lot more naive back then, had a small startup that I thought I could scale instead of getting a degree. \n\nAfter dropping out, I spent 6 months on the startup before realising that I was the only co-founder who wanted this to become big, the others were fine with it being small (2-3 clients) and supplementing their income, because they didn't want to put in the effort to scale and risk their main income (job), and I couldn't really do it all myself. So I restarted my degree (BE in CSE in a shit tier college in Dharwad). \n\n2 years \"wasted\" (according to my parents anyway), but priceless lessons learned."
    },
    {
      "id": "k03huw1",
      "body": "That is sad bro. Hope you are better now."
    },
    {
      "id": "k03ihej",
      "body": "Definitely doing better now xD I got placed into the best company that came to our college with good benefits and package after graduating last year and I'm now on track for a company switch. I would like to think I'm earning more than I would if I had graduated from PES, but that's a question no one can answer. \n\n\nMost importantly, my mind is at peace with my decision, I'm glad I was privileged enough to be able to make a life altering decision without worrying too much about the finances. I can confidently say that mental health would've deteriorated past the point of repair had I not dropped out. And I know I did my degree in something I'm truly passionate towards, instead of half assing towards a degree I didn't really care for."
    },
    {
      "id": "k03jhd5",
      "body": "Congratulations bro. I am a 2nd yr cse student. Any tips for me."
    },
    {
      "id": "k03vdac",
      "body": "Thanks cool senior !"
    },
    {
      "id": "k08jv7n",
      "body": "Work your ass off man that's the only way 💀\nChem cycle is literally free 9+ gpa trust me \nIt's physics cycle that's kinda hard"
    },
    {
      "id": "k09t2su",
      "body": "Dick them hoes down boy do it just do it"
    },
    {
      "id": "k09z518",
      "body": "How tho ? I find it fking boring.."
    },
    {
      "id": "k0deeev",
      "body": "nah nothing is boring if you have the interest to study , remember , you gotta build your gpa in 1st year itself , 2nd year is pretty hard compared to 1st year"
    },
    {
      "id": "k0fcqwk",
      "body": "Remember , your life can get miserable if you don't pay attention in maths 1 and maths 2 in the class itself . \nThey are considered hard by a lot of people but is really scoring if you focus in class itself"
    },
    {
      "id": "k71700c",
      "body": "Is is enough If we read pesu slides and question Bank to get cgpa more than 8.5??"
    },
    {
      "id": "k71awbx",
      "body": "Is it enough if we read slides and understandingly byhert the questions in question Bank?🙂"
    },
    {
      "id": "lacmx24",
      "body": "what about 3rd sem, any tips on how to get a good cgpa like 8.5+ or something. Any methods and references which we should follow to study?"
    }
  ]
}