{
  "id": "16f86bf",
  "title": "Difference between logical error and semantic error",
  "content": "",
  "metadata": {
    "author": "Hour-Still2441",
    "url": "https://www.reddit.com/r/PESU/comments/16f86bf/difference_between_logical_error_and_semantic/",
    "permalink": "/r/PESU/comments/16f86bf/difference_between_logical_error_and_semantic/",
    "score": 2,
    "created_utc": 1694371868,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "k006isy",
      "body": "A logical error and a semantic error are both types of programming errors, but they occur at different stages of the program execution and have distinct characteristics:\n\n1. Logical Error:\n   - Logical errors are also known as \"runtime errors\" or \"bugs.\"\n   - They occur when the program's logic is flawed, leading to incorrect or unexpected results.\n   - Logical errors do not necessarily cause the program to crash; instead, they produce incorrect outputs based on incorrect reasoning.\n   - Debugging logical errors often involves tracing the program's execution and finding where the logic deviates from the intended behavior.\n   - Examples of logical errors include incorrect calculations, wrong conditional statements, or using variables with improper values.\n\n2. Semantic Error:\n   - Semantic errors are also known as \"compile-time errors\" or \"syntactical errors.\"\n   - They occur during the compilation or interpretation of the code before the program is executed.\n   - Semantic errors violate the rules of the programming language and are typically detected by the compiler or interpreter.\n   - These errors prevent the program from running altogether, as the code is considered syntactically invalid.\n   - Examples of semantic errors include syntax errors (e.g., missing semicolons, mismatched parentheses), using undeclared variables, or using incorrect data types.\n\nIn summary, logical errors affect the program's behavior and produce incorrect results during runtime, while semantic errors are syntax-related issues that prevent the program from running due to violations of the language's rules. Debugging logical errors requires examining the code's logic, while semantic errors are typically fixed by correcting syntax and adhering to language rules."
    },
    {
      "id": "k08i36w",
      "body": "Chad Gpt :)"
    }
  ]
}