{
  "id": "16k1t83",
  "title": "So far what topics have been covered in each subject in CSE stream? Particularly in chem cycle (my name starts with A so I assume I'm in that cycle).",
  "content": " I am waiting for kcet 2nd extended round results and I need to know what has been done so far, assuming I join pes this year.",
  "metadata": {
    "author": "machinegun2187",
    "url": "https://www.reddit.com/r/PESU/comments/16k1t83/so_far_what_topics_have_been_covered_in_each/",
    "permalink": "/r/PESU/comments/16k1t83/so_far_what_topics_have_been_covered_in_each/",
    "score": 5,
    "created_utc": 1694851576,
    "flair": "Study Help :table:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "k0t9ze5",
      "body": "In chem cycle we have : \n1. Engineering chemistry - molecular spectroscopy (more than half done)\n2. Engineering mathematics - partial differentiation\n3. Engineering Mechanics - Till Vectors\n4. Electronic principles and devices - till v/i characteristics of a diode\n5. Computational problem solving using python - Till smtg idk\n6. Constitution of India and cyber laws - Unit 1 is done (3 more left)"
    },
    {
      "id": "k0tacl8",
      "body": "ok thanks, but could you tell me all the topics done in mechanics and electronics"
    },
    {
      "id": "k0tat0r",
      "body": "I can't tell the topics taught in mech even if I want to. I really don't know what's being taught. He just makes us solve some random problems in resolving force.\n\nEpd semiconductors unit is being taught. In that we just finished v/i characteristics of a diode and now we are solving circuit problems consisting of diodes."
    },
    {
      "id": "k0tb3gm",
      "body": "ok thanks man"
    },
    {
      "id": "k0tb8gy",
      "body": "KCET R2 batch started on Sep 14 and very little has been covered so far"
    },
    {
      "id": "k0toaca",
      "body": "Evn im waiting for the extended round.....can anyone share the clg syllabus"
    },
    {
      "id": "k0tpbhk",
      "body": "It doesn't matter whether or not your name starts with an A , you will be alloted in an entirely different section with the rest of the kcet students"
    },
    {
      "id": "k0ylan7",
      "body": "Check pes media server, search in pes official website. you will get"
    },
    {
      "id": "k1ir7k0",
      "body": "dude you got admission thru 2nd round right? what documents do you need to submit to the college?"
    },
    {
      "id": "k1iw8a2",
      "body": "I got seat in R1 but accepted and joined in R2.Pes website has list of docs- marks cards, Transfer certificate Admission order, fee paid reciept, Aadhar, 4 photos(passport and stamp size)"
    },
    {
      "id": "k1j68cq",
      "body": "ok thanks i got it"
    }
  ]
}