{
  "id": "16k1sxn",
  "title": "Help",
  "content": " would like to know how much does crowd effect placements\n\n[View Poll](https://www.reddit.com/poll/16k1sxn)",
  "metadata": {
    "author": "Warm-Vegetable9027",
    "url": "https://www.reddit.com/r/PESU/comments/16k1sxn/help/",
    "permalink": "/r/PESU/comments/16k1sxn/help/",
    "score": 9,
    "created_utc": 1694851548,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "k0tnb5j",
      "body": "Yo there take up ise at msrit it's better than any college cse with spec I took up cse with spec in msrit but take ise anyday over cse with spec"
    },
    {
      "id": "k0to8da",
      "body": "Hey, thanks. was just confused, like how about the coding culture in msrit like pes has hackathons every week does msrit also have it ?"
    },
    {
      "id": "k0toyj5",
      "body": "Msrit ise anyday my guy"
    },
    {
      "id": "k0tpgbe",
      "body": "Msrit coding culture is not much here tbh but we have some too much emphasis on academics. Hackathons will be there but I can assure you not as much as pes(u) but yea people will be there so u have to work on your own here"
    },
    {
      "id": "k0uaid5",
      "body": "if there’s a recession when you graduate, it will have an impact on the placements. Plus the cse( cse + aiml) strength has gone up and the campuses are pooled, rr and ec, so the number just becomes a lot."
    },
    {
      "id": "k0ueli3",
      "body": "Close your eyes and take msrit ise anyday anytime over anything."
    },
    {
      "id": "k0ueo7w",
      "body": "Hi fellow redditor, which batch?"
    },
    {
      "id": "k0uz5ez",
      "body": "MSRIT my bro, the batch size is just too huge here\n\nHackathons happen outside college too, The internet is out there, lots of ways to connect to programmers outside your college campus. If you have free time on your hand, you can always explore. \n\nHere you'll be bound to academics very tightly, GPA will also matter a lot (since the crowd is bigger, companies are more likely to keep higher Cpga cutoffs during placements)"
    },
    {
      "id": "k0vl4f6",
      "body": "Commerce karle"
    }
  ]
}