{
  "id": "16mqixi",
  "title": "Is this true??",
  "content": "",
  "metadata": {
    "author": "ReachWooden531",
    "url": "https://i.redd.it/tct4ywg5o7pb1.jpg",
    "permalink": "/r/PESU/comments/16mqixi/is_this_true/",
    "score": 145,
    "created_utc": 1695128781,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "k19om0t",
      "body": "Nope, this is false. Placements are pooled for both campuses because the aggregated student list is sent to companies."
    },
    {
      "id": "k19qoca",
      "body": ":sigh_of_relief:"
    },
    {
      "id": "k19visn",
      "body": "Not true at all, we have a common Placement Office :)"
    },
    {
      "id": "k1a8uqy",
      "body": "The placement office is common, but the placement stats are a little skewed towards the main campus. Yes, both the campuses sit for placement tests together, BUT, main campus students get selected for top companies initially. At least the initial 1-2 months are skewed. However, everyone in CSE gets placed, so it's chill. I'd still suggest the main campus over the south campus."
    },
    {
      "id": "k1a97gk",
      "body": "Considering the options you provided, PES would beat MSRIT any day, if we're talking placements. CSE specifically."
    },
    {
      "id": "k1ab5a8",
      "body": "This was true till 2019 , south campus was affiliated to VTU . I didn’t get in a lot of interviews, but things have changed now ."
    },
    {
      "id": "k1af4lm",
      "body": "Okay , that's good to hear."
    },
    {
      "id": "k1afua9",
      "body": "The reason for slightly better placements in RR would be the slightly better student quality (no offense to EC peeps)."
    },
    {
      "id": "k1b5jrv",
      "body": "Nopes not true… being a PES EC alum, i can vouch for that. Though, PES main campus has better infra and internships opportunities."
    },
    {
      "id": "k1b5wmr",
      "body": "None taken, if you have any evidence to support this :)"
    },
    {
      "id": "k1bazpz",
      "body": "Came here to comment this. Definitely true until 2019"
    },
    {
      "id": "k1cqbwp",
      "body": "Absolutely not"
    },
    {
      "id": "k1d5r04",
      "body": "Idk about PES that much but MSRIT has been killing it with placements this year. I’m a final year student in core branch and the opportunities have been very good especially CS students many companies came for 40+ LPA"
    },
    {
      "id": "k1d6oh9",
      "body": "I mean why would someone not select you if you're from PESU ?"
    },
    {
      "id": "k1d85rs",
      "body": "Dude, we had companies offering 80LPA and had FAANG coming in during the horrible tech lay-offs. Amazon (women only tho) and Apple (took few men and majority women). No offence, but only RV can match or better PES in terms of CSE placements"
    },
    {
      "id": "k1d8vc2",
      "body": "But yeah, CSE is over-crowded in PES. So it's a little hard to get internships initially. If we're talking pure opportunities, I don't think anyone would ever have to worry. They'll always be more than enough in PES, but, competition would be equally hard coz of the numbers. Maybe other places it would be easier to get an job/internship coz of lower batch strength, that's a negative I can think of"
    },
    {
      "id": "k1dc0cc",
      "body": "How has your career progression been like man"
    },
    {
      "id": "k1dcjlb",
      "body": "I heard from someone that the placements this year have been really terrible,hardly 200 people got placed."
    },
    {
      "id": "k1dgtnv",
      "body": "See I did not tell 40 is the highest package I told many come for 40. There have been companies offering 70 too. It’s been 1-2 months now we still expecting wayyy more. There were 5 selects from for apple last year for 70 let’s see what happens this year"
    },
    {
      "id": "k1dhdao",
      "body": "Idk about this year, I'm talking about 2022-2023 placement season. The issue with PES is it's student intake. They've considerably increased the CSE batch every year and ig that's why numbers always look small. In terms of getting opportunities, they'll get you ample. But it's down to you and competition at the end of the day"
    },
    {
      "id": "k1di9yf",
      "body": "People with better rank join main campus?"
    },
    {
      "id": "k1dri9u",
      "body": "Nah this isn't true anymore. The person who said this isn't very updated. It used to be seperate placements when pes ec campus was under vtu but now placements take place together and the campus  doesn't really matter"
    },
    {
      "id": "k1dst22",
      "body": "Bro placements just began"
    },
    {
      "id": "k1dtwhl",
      "body": "There were more than 200 reputed companies which visited pes south campus in 2022. Even if main campus gets more companies, it doesn't matter. If you don't get placed in 200 companies, you won't if there are more"
    },
    {
      "id": "k1dxso5",
      "body": "Y"
    },
    {
      "id": "k1eksjl",
      "body": "Iykyk."
    },
    {
      "id": "k1fb7pp",
      "body": "Got placed in Nokia , decent pay for 2019 times , got a great hike in 2020, other years were shit . Switched to VMware last year with a 150% hike . Now VMware is being acquired by Broadcom so future looks bleak but I already have another offer , just waiting to see if Broadcom offers a contract or not . \nPS: My career progression has been great but in no way it means I love software engineering . I am pretty clueless about what I am doing with my life ."
    },
    {
      "id": "k1ffzt9",
      "body": "Use to be the case till 2021 not till students in placement were from VTU studying in PESIT now its all PESU"
    },
    {
      "id": "k1fhcbj",
      "body": "Ah happy for you broski. Dw things will workout 🫂"
    },
    {
      "id": "k1flw17",
      "body": "Nope.....\nNever seen that happen"
    },
    {
      "id": "k1m6atr",
      "body": "> PS: My career progression has been great but in no way it means I love software engineering . I am pretty clueless about what I am doing with my life .\n\neveryone in cse does not get placed my guy"
    },
    {
      "id": "k1m6db6",
      "body": "everyone in cse does not get placed my guy ..."
    }
  ]
}