{
  "id": "16qu7h2",
  "title": "How's life like at PESU?",
  "content": "Like the title says, I wanted to know more about life in PESU, what it is like being a PESU student, like the college life, cultural activities, lectures, management, clubs (selection process), etc and also if the cultural events held are managed by the students clubs or the college staff\n\nI know you need to forget what life is when you're a PESU Student, how do I know that? Well I read the past 15 days post and comments, also the fact that I'm a student of the integrated program at PES PU\n\nI think I'm just overwhelmed by the fact that I'll be joining a college next year I guess, and I'll be shooting alot of questions here in the coming days xd",
  "metadata": {
    "author": "ksvk_26",
    "url": "https://www.reddit.com/r/PESU/comments/16qu7h2/hows_life_like_at_pesu/",
    "permalink": "/r/PESU/comments/16qu7h2/hows_life_like_at_pesu/",
    "score": 12,
    "created_utc": 1695550759,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "k1z3pjm",
      "body": "Why u aiming for pes next year😭"
    },
    {
      "id": "k1z3q8i",
      "body": "Supposed to be a backup college"
    },
    {
      "id": "k1z3zvh",
      "body": "I mean it's not my only choice, I have other colleges in mind as well, BMS, RVCE, MSRIT and others"
    },
    {
      "id": "k1z46az",
      "body": "Bro pesu is weird college anyone can get into pes cs through pessat"
    },
    {
      "id": "k1z4fg2",
      "body": "Tru I gave the exam for fun and got 12xx rank"
    },
    {
      "id": "k1zbhlu",
      "body": "You not givin jee??"
    },
    {
      "id": "k1zc71u",
      "body": "I am, but any of us even clearing mains is doubtful, we haven't had proper completion of competitive syllabus in 11th other than maths among other things this year"
    },
    {
      "id": "k1zcbko",
      "body": "Oh makes sense in that case, but I'd still say give what all you got into jee man it'd be worth"
    },
    {
      "id": "k1zksm3",
      "body": "The pressure is real. It can really get to you.\n\nThe amount of fun you'll have depends on what kind of friends you're able to make.\n\nI am from EC campus and I joined in 2020, so the entire first year was online (online classes, offline tests/exams), so I wasn't able to find a big group of friends like I was hoping to. \n\nRR campus has more clubs and club activities and the campus is bigger and has newer blocks and all.\n\nEC campus can go to RR campus for hackathons and events and campus placements.\n\nOther than the club activities there is no difference between RR and EC campus. The placements and the quality of teachers and all is same. Students from both campuses can watch videos of professors from the other campus also.\n\nThere are 2 major fests every year - Atmatrisha in RR campus and Maaya in EC campus. People from both campuses can attend both fests. \nThese are also quite fun, again depending on your friend group and the artists performing in the events.\n\nBasically, it's quite stressful, but the placements in the end makes up for it."
    },
    {
      "id": "k1zmy4o",
      "body": "Not insulting anyone, but that's true. I've seen people who barely passed pu exam get into pes."
    },
    {
      "id": "k1zn7bn",
      "body": "I had option of pesu rvce and manipal kept pesu last and choose Manipal \n\nToday someone ik is confused between bms thru comedk or drop I don't know how to guide him any idea how is bms , I lost touch of Bangalore Colleges so"
    },
    {
      "id": "k1znr7q",
      "body": "BMSCE is actually good. I visited the campus, nice vibes and good reviews I got there.."
    },
    {
      "id": "k1zr6zj",
      "body": "Thank you for your input, most of my thoughts are cleared, also I noticed on the previous posts on the subreddit that most were asking more for CSE in EC campus & other colleges than that of RR champus? Is EC campus better for CSE?"
    },
    {
      "id": "k1zriqm",
      "body": "that should probably be Management Quota? but isn't that the case in every college though? College Entrance Test, KCET, Management Quota seats?"
    },
    {
      "id": "k1zrsay",
      "body": "From what I've heard is BMS is good, my sister did her B.Arch there"
    },
    {
      "id": "k1zrvf5",
      "body": "Nah. It was through pessat"
    },
    {
      "id": "k1zt398",
      "body": "It's easier to get in EC campus.\nThe cutoff is lower. (Atleast it was till 2020, I'm not exactly sure about it now)\n \nLike the KCET GM cutoff in 2nd round for RR campus CSE was around 600, while for EC campus it was around 2800\n\nBasically in 2020, the 2nd round cutoff for CSE in EC campus was approximately same as the cutoff for ECE in RR campus in second extended round."
    },
    {
      "id": "k1zvsgo",
      "body": "ah okay, that makes sense"
    },
    {
      "id": "k1zvyp9",
      "body": "ohh"
    },
    {
      "id": "k20l50i",
      "body": "The number of PESU aspirants just keeps increasing every year 💀"
    },
    {
      "id": "k20qkqe",
      "body": "Story of a mom\n\n. I am his mother. Aditya just forgot his phone in his pockets. He remembered it halfway thru the exam and himself took it and kept it away from him either on the bench or the floor(I can't remember his words). And the phone was in airplane mode throughout . This Aditya told me in his last phone call. The invigilator saw it when only 10mins were remaining for the end of exam. This was told by others in the exam hall. His honesty led to all this. Perhaps if he hadn't kept it out , this wouldn't have happened.\nAditya also told that they r harrassing him, they told him it's better to die than do such things. By the time I reached there, he had jumped. They left him alone after detaining for MPC. No one was with him. The counselor just walked away. Such negligence of the college. They had found his body half an earlier itself before I starting demanding to find him. The police, ambulance were already there. They were telling the police that he isn't their student and to take the body away. Some random person entered the building and jumped is what they told. They just wanted the body out of their campus. They were trying to hush it up. And when I reached they told me I need to sign something ( mostly something that keeps them out of this) , only after that they will take him to hospital and try for revival.\n\nThe college doesn't care for the life of a student. They only care about is reputation. We have filed FIR against the college. Any help or information regarding the incident will help us."
    },
    {
      "id": "k20qv1j",
      "body": "oof that was me with deeksha man, these integrated colleges are a joke."
    },
    {
      "id": "k232wbd",
      "body": "When you have some 750+ seats? For Cs in real campus alone through PES sat I don't think you can expect much better"
    },
    {
      "id": "k233tq0",
      "body": "Exactly"
    },
    {
      "id": "k23uzf7",
      "body": "Not only PESU, I've witnessed that firsthand in our campus 😂"
    },
    {
      "id": "k6n0w0z",
      "body": "why are u a mod for a subreddit for CuteGayVideos"
    },
    {
      "id": "lhgsxex",
      "body": "Heyy is it tht bad? Ive been thinking of joining pes for bsc nursing and i can only find reviews bout cse..i cant wholly rely on their online site as well..is it true tht they only specialise at cse and any other branches are not gud? Pls i rlly need help here and im not from karnataka too"
    },
    {
      "id": "lhhp5vy",
      "body": "Pes is only kinda known for its cse branch so if ur taking another field maybe talk to the seniors of that particular field and make a decision"
    },
    {
      "id": "lhjgxmz",
      "body": "How can i connect w someone..i cant find any ig acc or anything..i found one discord acc but they aint replying..is there some other way i can find one senior?"
    }
  ]
}