{
  "id": "16xi3wg",
  "title": "ISA Structure + tips",
  "content": "What exactly is the structure for ISAs starting from this batch? Ik we have 2ISAs per sem, but each is for how many marks? \nAnd also seniors, pleasee share any tips you have to score good grades in these tests🥹(btw im from 1st sem C cycle)",
  "metadata": {
    "author": "maze_skull78",
    "url": "https://www.reddit.com/r/PESU/comments/16xi3wg/isa_structure_tips/",
    "permalink": "/r/PESU/comments/16xi3wg/isa_structure_tips/",
    "score": 12,
    "created_utc": 1696206797,
    "flair": "Study Help :table:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "k334epg",
      "body": "Yes, you guys also have the 2 ISA system (just confirm the same from one of your teachers)\n\n&#x200B;\n\nEPD is really easy if u understand the concept\n\nMechanics is basic kinematics (easy to get S grade in this)\n\nMaths do-able (BMS notes will save you)\n\nChemistry is pretty much 11th-12th syllabus.. just mug up well questions will be straight forward\n\nPython : if u had taken pcmc in ur 11th and 12th then you won't find it difficult to deal with it.. if u are a bio student, you would definitely need external help , refer to youtube videos, practice python on hackerrank or other platforms\n\n&#x200B;\n\nTIP: CHEM , MECH , PYTHON : AIM FOR S GRADE HERE.. ITS ACHIEVABLE \n\nPractice typing, will help during ISA"
    },
    {
      "id": "k33bcds",
      "body": "thank you so much, the ISAs are for 40 marks right?"
    },
    {
      "id": "k33jnkh",
      "body": "But teachers said that ISA will be in hybrid mode. Is typing really that important ?"
    },
    {
      "id": "k33o3x6",
      "body": "Could you pls link or tell me where to find bms notes for maths"
    },
    {
      "id": "k33oqrg",
      "body": "What are bms notes and where can we do d them?"
    },
    {
      "id": "k33wgwk",
      "body": "Its there on discord.. just check once.. and let me know.. i will get it uploaded if its not there"
    },
    {
      "id": "k33wj0i",
      "body": "yep"
    },
    {
      "id": "k33wlfq",
      "body": "BM Shankar.. he is the BEST mathematics prof in S&H Dept."
    },
    {
      "id": "k33wnil",
      "body": "Upto you.. coz typing python codes is more easier than writing it down"
    },
    {
      "id": "k345k37",
      "body": "Upvoted coz BM Shankar. Man's an OG math prof."
    },
    {
      "id": "k355ksk",
      "body": "LORD BMS"
    },
    {
      "id": "k3dmpbl",
      "body": "There's a discord server for PES?"
    }
  ]
}