{
  "id": "16zeiny",
  "title": "Summer internship",
  "content": "I'm currently in second year. When do we start applying for summer internships ? And what gpa will be considered? Will we have gotten our fourth sem results by the time we apply ? My first year gpa is pretty bad but by fourth sem I can have around 8-8.3 . So will that be considered or will put gpa till third sem be considered? How much will it matter for core internships, as I am non cs ?",
  "metadata": {
    "author": "Geekwalker374",
    "url": "https://www.reddit.com/r/PESU/comments/16zeiny/summer_internship/",
    "permalink": "/r/PESU/comments/16zeiny/summer_internship/",
    "score": 8,
    "created_utc": 1696396527,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "k3e5gvh",
      "body": "Companies visit only from the end of your 5th semester for summer internships. I'd say you have a lot of time to still work on your CGPA. Depending on when the company visits, you'll have either only your 4th sem's CGPA (if they visit in 5th sem) or your 5th sem's CGPA (if they visit in 6th sem). CGPA matters quite a bit when it comes to placements, see past posts on this topic for more details. If you're aiming at IT companies, the safest CGPA is atleast an 8.6 to stand a good chance (although ofc, higher the better)."
    },
    {
      "id": "k3e7osg",
      "body": "Hey, I wanna apply for a core internship in the summer after 4th sem, and for my branch companies don't come, so we gotta find it ourselves. It is possible to apply for one in the holidays after 4th sem ? And if so, when do I start sending out mails ?"
    },
    {
      "id": "k3fl5vp",
      "body": "You can apply off-campus but you prolly need a good referral."
    },
    {
      "id": "k3flkd7",
      "body": "Is referral from profs sufficient?"
    },
    {
      "id": "k3g23mg",
      "body": "I meant job referral from someone already working there."
    }
  ]
}