{
  "id": "177pwch",
  "title": "Has anyone withdrew their course before?",
  "content": "My ISA one is gonna be a huge fuck up because I'm admitted in the hospital due to a pancreatic issue. After the surgery and stuff I'll be discharged 3 days before the isa for sem 1.\n\neven if I do well in the second isa this fuck up will bring down the average a lot. The best bet I have is withdrawal of the course.\n\nSo can anyone guide me through the withdrawal process and if I do withdraw when will my esa be conducted?will it be conducted right before the beginning of sem to OR will I have to wait till the end of semester 2?",
  "metadata": {
    "author": "Elegant_Chain3355",
    "url": "https://www.reddit.com/r/PESU/comments/177pwch/has_anyone_withdrew_their_course_before/",
    "permalink": "/r/PESU/comments/177pwch/has_anyone_withdrew_their_course_before/",
    "score": 10,
    "created_utc": 1697291105,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "k4unucq",
      "body": "Hey you cannot withdraw any courses , u will get an F grade as a result and u will have to give a backlog exam. So best you can do is make up in the second isa , esa and the assignments , it is better to clear a subject rather than end up with a backlog as that will be a burden on you. Try to atleast aim for a C or a B if u have messed up the first Isa, that will be fine. Study properly from the next time and score well in other subjects, particularly those having more credits."
    },
    {
      "id": "k4uy1yr",
      "body": "Hey backlogs are given based on final score right? Could you explain how this works?"
    },
    {
      "id": "k4uyck0",
      "body": "Yes, but it also applies if you withdraw, it will be marked as an F grade. If u get less than 40 in your final (i.e esa+isa+assignment) u get a backlog as well"
    },
    {
      "id": "k58mrno",
      "body": "Getting some marks in isa is much easier than getting marks in esa.. so even if it's less.. isa marks help you pass.. if you just write the esa.. the weightage gets shifted to esa.. and things will become ugly.. one subject.. or one sem ain't gonna make a very big difference.. focus on isa 2."
    }
  ]
}