{
  "id": "17dmtc0",
  "title": "Internship",
  "content": "I'm currently in 3rd sem cse.Practically  When is the right time to start doing internships? I'm kinda confused worrying if it affects my academic life. Some tips required for applying internships?",
  "metadata": {
    "author": "DaikonEmbarrassed147",
    "url": "https://www.reddit.com/r/PESU/comments/17dmtc0/internship/",
    "permalink": "/r/PESU/comments/17dmtc0/internship/",
    "score": 11,
    "created_utc": 1697955516,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "k5xxc3d",
      "body": "There is no such thing as \"right time\"... I started interning since my Sem 2 and am currently done with 5 internships(in sem 5 right now)\n\nIt gives a huge boost to your resume and confidence in interviews... And most importantly practical skills in the industry, soft skills, workplace politics, etc.... Don't just stick to summer internships and explore stuff while you can"
    },
    {
      "id": "k5xyeqq",
      "body": "Second sem!?!? Here I am in the middle of first sem still learning C language😭"
    },
    {
      "id": "k5y8xqg",
      "body": "Hey, I'd like to ask you about how you went about prepping and getting these internships, can I dm?"
    },
    {
      "id": "k5ya2ur",
      "body": "Sure reach out"
    },
    {
      "id": "k5z8p1i",
      "body": "5th sem, no internship yet. Will be applying for the ones that are coming to the college for summer internships. It should be fine imo. GPA and DSA are good enough."
    },
    {
      "id": "k632nep",
      "body": "First thing getting an internship before finishing your 3rd year is rare. If you want to do an internship the best time would be to do it in june-july. That would be the summer internship. \n\n\nYou can start searching around dec-jan. Before that getting anything would be very hard."
    },
    {
      "id": "k632pv8",
      "body": "Watchu mean 5 internships? When did you get the time to do all that?"
    },
    {
      "id": "k63329v",
      "body": "Part time Internships and all of em are remote"
    },
    {
      "id": "k635p8s",
      "body": "If you don't mind, how long were these internships? Did u do them during your semesters?"
    },
    {
      "id": "k648smg",
      "body": "The internships were paid or not? And should I opt for paid internships!!!?"
    },
    {
      "id": "k649gh1",
      "body": "2 during summer, the rest during Sem... 2 internships were just a month long each... The others were longer around 6 ish months"
    },
    {
      "id": "k64avck",
      "body": "If you have no other option and have a learning curve only then go for unpaid ones... Again unpaid or not depends on you to choose\n\nAll my internships were paid"
    },
    {
      "id": "k64b3nu",
      "body": "I am paying 4100 INR for internship in web development in Accenture ? Is it worth or not????"
    },
    {
      "id": "k64k8qf",
      "body": "Damn nice."
    },
    {
      "id": "kxt7ag1",
      "body": "What is the sgpa/cgpa criteria for 5th sem internship?"
    },
    {
      "id": "kxt8184",
      "body": "8.5-9 is a great area to be in"
    },
    {
      "id": "kxt8hwj",
      "body": "I see. I'm currently a second sem student .I got 7.9 in first sem. So I was a little worried."
    },
    {
      "id": "kxtjxvj",
      "body": "I had a difference of 1 gp between my 2nd and 1st sem but that was because I didn’t study at all in 1st sem. If you just listen to class and study during tests and exams getting 9+ GPA is very easy."
    },
    {
      "id": "kxu06w6",
      "body": "Got it . Thanks bro"
    }
  ]
}