{
  "id": "17g2eyn",
  "title": "Cgpa",
  "content": "How many marks out of 40 to get a cgpa of 8 or 9? Also are ISAs really hard will cw problems and qb be enough or do I have to do a lot more? Please reply soon",
  "metadata": {
    "author": "Turbulent-Spinach360",
    "url": "https://www.reddit.com/r/PESU/comments/17g2eyn/cgpa/",
    "permalink": "/r/PESU/comments/17g2eyn/cgpa/",
    "score": 11,
    "created_utc": 1698232764,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "k6dx2h7",
      "body": "Check the reddit FAQs, it's already been answered"
    },
    {
      "id": "k6e4jia",
      "body": "If you get 30 or so on you'll get a gpa of 8.5 roughly. Atleast based on what my friends's scores were last year\n\nMostly cw problems are enough. Especially for math. Don't waste your time on qb and stuff, just take the class notes of someone in your class and most questions will be identical"
    },
    {
      "id": "k6e59yd",
      "body": "I did write down notes diligently! I'm glad they would be enough everyone in my class is just in panic mode thank you so much! I'm gonna spread the news!"
    },
    {
      "id": "k6e5bco",
      "body": "Thank you!"
    },
    {
      "id": "k6e6ey4",
      "body": "Yeah just remember that it isn't gospel. Yes i wrote a perfect esa because all the questions came from my friends notes without so much as a value change, but yours may be different\n\nWrite notes if you like, but it's honesty not necessary. I always just used to take photos of someone else's before every isa. Why do the work when there's 60 people in your class doing the same"
    },
    {
      "id": "k6e825g",
      "body": "True our class just ended up with all kinds of strict teachers 😞 also if i don't take down notes I'll probably fall asleep. Last benches are always full too"
    },
    {
      "id": "k6e878n",
      "body": "Mind if I ask what year are you in?"
    },
    {
      "id": "k6e8xic",
      "body": "Honesty it's alright if you fall asleep🤣, i don't really think learning in class is very useful for most people. If you are unable to understand by yourself, listen to classes. But otherwise just chill out it's college, it's nowhere nearly as difficult as 12th. I felt it was closer to 10th\n\nI'm in second year now. And last minute studying was enough for me to get a good enough cgpa"
    },
    {
      "id": "k6e9ild",
      "body": "We get told to wash our face and come 💀 and they don't give up until we actually do it i don't want to be humiliated"
    },
    {
      "id": "k6e9p2l",
      "body": "Lol hopefully you get chiller teachers next semester"
    },
    {
      "id": "k6ioyfx",
      "body": ">Honesty it's alright if you fall asleep🤣, i don't really think learning in class is very useful for most people. If you are unable to understand by yourself, listen to classes. But otherwise just chill out it's college, it's nowhere nearly as difficult as 12th. I felt it was closer to 10th\n\ntried and tested technique: cover your eyes with one hand (and lean on the hand) and turn your head away from the teacher , hold a pen in the other hand (put it in a position as if you are writting)  \n\n\nworked on 3/5 teachers"
    }
  ]
}