{
  "id": "17ix6r8",
  "title": "Cs isa help!!!",
  "content": "Idk much in cs and tmrw I got my isa is there any thing I could do to somehow get decent marks? \nWill doing all theory questions suffice? Cuz I'm really weak in coding part",
  "metadata": {
    "author": "bankai_suii",
    "url": "https://www.reddit.com/r/PESU/comments/17ix6r8/cs_isa_help/",
    "permalink": "/r/PESU/comments/17ix6r8/cs_isa_help/",
    "score": 5,
    "created_utc": 1698562126,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "k6xaqaf",
      "body": "You will get nothing if you do the theory to be Frank like solve questions mcqs write programs that's the only way in, if you never did it tomorrow you will get to know the kind of questions they are gonna ask, you will be thinking, \"questions could be made up in a lot of different ways\""
    },
    {
      "id": "k6xbxv7",
      "body": "Theory goes hand in hand with practical stuff. Get a good hold on the theory and apply those concepts in your practical questions. College papers generally that itself. Try to understand the process behind the code rather than by-hearting it entirely. \nHaving said that, you can expect 20% of your paper to have just theory questions/conceptual questions."
    },
    {
      "id": "k6xchwh",
      "body": "Sit down and write and learn some code. In comp science everything is practical. \n\nPS avoid byhearting code. That shouldnt even be the last option. Remember all code was written by humans FOR humans."
    },
    {
      "id": "k6xeqgj",
      "body": "Thanks for the advice I'll start learning as much as I can rn in terms of learning and understanding code which in turn help with theory"
    },
    {
      "id": "k6xqj4w",
      "body": "Hey man, if you're talking about Python, I have notes for all the chapters that I wrote when I was in 1st sem. I can send you all of them in pdf. People in my batch found it really helpful. The topics might be a little across units since we had 5 units and you have 4 now but the content is probably almost the same"
    },
    {
      "id": "k6xr4bt",
      "body": "That would be very helpful pls do send \nThanks"
    },
    {
      "id": "k6xry0g",
      "body": "Please send it to me too 🙏"
    },
    {
      "id": "k6y524e",
      "body": "To meee"
    },
    {
      "id": "k6ysf2x",
      "body": "Please send it to me too"
    },
    {
      "id": "k6yvdd9",
      "body": "Me to"
    },
    {
      "id": "k6ywi0l",
      "body": "send me too"
    },
    {
      "id": "k7178f1",
      "body": "Please share the link here so it will be helpful for everyone"
    },
    {
      "id": "k7dn1i4",
      "body": "Can u send me ur python notes pls"
    },
    {
      "id": "kd5fc4f",
      "body": "[here's the link](https://github.com/anuragrao04/CS_Notes/tree/master/PDFs)"
    }
  ]
}