{
  "id": "17jho2n",
  "title": "Isa's",
  "content": "I wanted to know how our isa results would look. will they put class avg, highest marks and lowest marks of class along with our score?? Also how long does it usaually take for them to give out results after isa finishes??Pls answer..",
  "metadata": {
    "author": "Certain-doom1017",
    "url": "https://www.reddit.com/r/PESU/comments/17jho2n/isas/",
    "permalink": "/r/PESU/comments/17jho2n/isas/",
    "score": 4,
    "created_utc": 1698627927,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "k71akh7",
      "body": "Usually it takes max in week for results (don't quote me on that). You'll see your marks in all subjects as a list. Clicking on each mark gives a page with batch average and a bar graph of all scores in the batch (for that subject)"
    },
    {
      "id": "k71br3v",
      "body": "You will get a histogram along with your results. So you will know how many people got marks between 30-35 and so on.\nYou can also find out how many got 36 ,37 and so on. However you won't get the names of the people. (This is wrt to phy/chem cycle and not your class. You will get a class avg score though)"
    },
    {
      "id": "k71jbre",
      "body": "Hey can u tell me how the ptm procedures go like will they jeep our results in fron of us and ask abt it or what??"
    },
    {
      "id": "k71jo3k",
      "body": "Ahhh I'm not sure tbh. I've never attended a ptm. \n\nI haven't heard anything very bad about ptms tbh so don't worry too much."
    },
    {
      "id": "k71llc0",
      "body": "Nobody attends PTMs here."
    },
    {
      "id": "k71n83h",
      "body": "Thank you"
    },
    {
      "id": "k71n8xh",
      "body": "Thank you"
    },
    {
      "id": "k71s6xg",
      "body": "PTM is just meeting your mentors with your parents and they wont discuss your marks. The mentor may call you in an individual mentoring session if they have to discuss your marks."
    }
  ]
}