{
  "id": "17jv1rk",
  "title": "PLACEMENT REALITY",
  "content": "What is the actual CSE AVERAGE  ? no bias, as nothing is given in their website\n\n[View Poll](https://www.reddit.com/poll/17jv1rk)",
  "metadata": {
    "author": "analyser_7742",
    "url": "https://www.reddit.com/r/PESU/comments/17jv1rk/placement_reality/",
    "permalink": "/r/PESU/comments/17jv1rk/placement_reality/",
    "score": 6,
    "created_utc": 1698677169,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "k73igkx",
      "body": "The easiest way is to check the student maintained spreadsheet. Since it's maintained by current final year students, it's pretty accurate. Search for 2024 placements somewhere in this subreddit, or ask on discord"
    },
    {
      "id": "k73q3zw",
      "body": "to save you the [trouble](https://docs.google.com/spreadsheets/d/1YZ7HtUcvA9jqWZ04DuwTT66aTV7gU7DUlXyO2BewpII/edit#gid=457632655) of finding it"
    },
    {
      "id": "k73qcq2",
      "body": "Thanks for help, iloveass696969696969"
    },
    {
      "id": "k73rhyj",
      "body": "The average is showing a whopping 18.5 but most of the students say its 10 11...\n\nwhat to believe"
    },
    {
      "id": "k73s9vv",
      "body": "Thing is the average is 20 lpa yes, but the median i.e what most people get is anywhere between 8-12 lpa. Average do be a bitch sometimes."
    },
    {
      "id": "k73t069",
      "body": "As someone said - averages are always prone to outliers. Median the most accurate metric. And I can vouch for the authenticity of the people maintaining the sheet - you can even talk to them on discord if you want to."
    },
    {
      "id": "k73u37t",
      "body": "but thing is even the median in the spreadsheet is shown 17 which is again wayhigher then what people usually tell"
    },
    {
      "id": "k73u9ny",
      "body": "That's cause you're looking at tier 1 median. I don't think the file has statistical metrics that combine all tiers. I'll ask them to add it in."
    },
    {
      "id": "k73uwrn",
      "body": "take the CTC with a pinch of salt, it is not a representation of annual income, as some(a lot) of companies have stocks vested over some years but the entire SOP is counted in the ctc that they send out to college. use base pay instead."
    },
    {
      "id": "k73w98r",
      "body": "but every college shows ctc only right?"
    },
    {
      "id": "k73wjpp",
      "body": "looking at the polls i doubt if even average is 12+, how do people compare pes to rv, rv has 20lpa avg given clearly in their website"
    },
    {
      "id": "k73zs3p",
      "body": "yeah, but i’d consider base pay over ctc- lots of ctcs are bloated."
    },
    {
      "id": "k745qen",
      "body": "Avg below 8 wowww, even bms has better avg how the hell they showed 17.99.  😮‍💨"
    },
    {
      "id": "k74677l",
      "body": "I think people have mistaken it for median. Taken average as in what most people get which is in fact median"
    },
    {
      "id": "k7495xq",
      "body": "Even below 8 median is very bad \nOther tier 2 colleges like rv manipal have 13-15 median"
    },
    {
      "id": "k77ahp8",
      "body": "Just few points to add on\n\n1) Median of package is an accurate representation of what to expect, not average\n\n2) The CTC as quoted by companies during placements is not an indication of how good/bad the college is. Companies just see the market conditions, their budget and the tier ranking of the college\n\n3) To get an above median salary (irrespective of college) focus on yourself, upskill for the role you want, network with seniors/other peeps in similar industry and keep getting relevant experience before the placement season starts.\n\nGood Luck <3"
    },
    {
      "id": "k78u4nx",
      "body": "Why is there remarks for spring section if there aren't any fte?"
    },
    {
      "id": "k79279p",
      "body": "company only guarantees internship, remarks state whether the company offers fte based on performance on not."
    },
    {
      "id": "k7a5fxe",
      "body": "The average is 18.5 only for tier one, which is obviously not to be called \"the average\". That's only like 300 people, look at the people who got placed in tier 2 and 3 as well and the av comes to around 10"
    },
    {
      "id": "k7bp6ex",
      "body": "so the average of 18lpa ctc they showed for 2023 is fake right? rvce has double the avg then(if pes is 10lpa)"
    }
  ]
}