{
  "id": "17ngx5h",
  "title": "What do I do if I don't get a summer internship??",
  "content": "I've been applying for summer internships left snd right, but I don't feel confident enough that I'll get something. I have an 8+ gpa(which I'm trying real hard to bump to an 8.5+) , and decent projects , but I lack coding practice and feel very underconfident when it comes to dsa practice. Some of my friends have been selected for internships, and the pressure is getting to me real bad and I feel really stressed and burnt out. \nIf I can't get an internship at a company, would it be okay to intern at any of the research centers(provided , I get in)?",
  "metadata": {
    "author": "POS272",
    "url": "https://www.reddit.com/r/PESU/comments/17ngx5h/what_do_i_do_if_i_dont_get_a_summer_internship/",
    "permalink": "/r/PESU/comments/17ngx5h/what_do_i_do_if_i_dont_get_a_summer_internship/",
    "score": 13,
    "created_utc": 1699085252,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "k7rouu8",
      "body": "Very few get proper summer internships. Don't stress out of u don't. \n\n\nEither way the summer is june-july so there is lot of time to get one. Apply anywhere YOU WANT. \n\n\nIf you don't get one it's not the end of the world. Spend the time getting certificates and improving yourself. Do some projects that you want to put on your resume, volunteer at some non profits etc. \n\n\nAs long as you are happy while not wasting your time it's alright."
    },
    {
      "id": "k7rqe7l",
      "body": "tf hwo are people maintaing 8.75+ CGPA, here is me, not even  getting 6+ despite studying(1st sem)"
    },
    {
      "id": "k7wustn",
      "body": "Bruh I didn't get a good job and here you are cribbing  about summer internship.\n\nIt doesn't matter just keep prepping and use the summer(if you don't get internship) very well for the placements.\n\nUltimately thats what matters having no summer internship is no biggie."
    }
  ]
}