{
  "id": "17r2to9",
  "title": "PES RR or PES EC",
  "content": "I have secured a seat in PES RR Campus through PESSAT and I am likely to get a seat in PES EC Campus through CET. I am conflicted about which one to choose because I have to pay 4.5L in RR Campus, whereas it's only 1-2L in EC Campus. I've heard people say both campuses are similar in terms of placements and other aspects. However, RR Campus is considered one of the top colleges, whereas EC Campus is not (that's what I've heard, i might be wrong).\n\nSo it would really be helpful if y'all help me with this..",
  "metadata": {
    "author": "Firm_Yogurt1618",
    "url": "https://www.reddit.com/r/PESU/comments/17r2to9/pes_rr_or_pes_ec/",
    "permalink": "/r/PESU/comments/17r2to9/pes_rr_or_pes_ec/",
    "score": 7,
    "created_utc": 1699497195,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "k8g7tdl",
      "body": "Alright there buddy RR seat via pessat is really overpriced tbh but it's kinda worth if u can afford it and have no financial issues. EC campus is also under the PESU wing no doubt about that. But the faculty at RR is better(subjective). But the events conducted in RR is top tier and there is a good alumni network in RR compared to EC. So if u can afford and want these top tier things u can fs pick RR CSE via pessat. Where as if ur ready to put the effort and u wanna save loads of cash cab go ahead and pick EC CSE via KCET. Hope I cleared ur doubt have a good day !!"
    },
    {
      "id": "k8g9d67",
      "body": "Okay so this might sound stupid but Does both colleges provide the same certificate after completing a 4-year CSE BTech program, or do they specify the campus you graduated from?"
    },
    {
      "id": "k8gaewb",
      "body": "Good question AFAIK they both come under the same body of PESU  so ig the certification will be more or less the same since poolew placements also happen but tbh u can ask some senior here for further confirmation."
    },
    {
      "id": "k8gbc64",
      "body": "Thanks...maybe I will ask seniors."
    },
    {
      "id": "k8gbfra",
      "body": "Yup. Both provide the same degree. Your campus is not mentioned anywhere, even during placements."
    },
    {
      "id": "k8gboex",
      "body": "Thank you very much."
    },
    {
      "id": "k8gbxva",
      "body": "Objectively, there are no differences. However, the best campus for you will depend on what you value/prioritise from a University. \n\nI've made a detailed [answer](https://www.reddit.com/r/PESU/comments/14anjmd/comment/jobruzy/) about this before."
    },
    {
      "id": "k8gcv5l",
      "body": "Sir 🙏"
    },
    {
      "id": "k8gd5dt",
      "body": "What counseling is going on now? ☠️"
    },
    {
      "id": "k8gdfk0",
      "body": "DCET (Diploma Common Entrance Test) Counseling for Diploma Student."
    },
    {
      "id": "k8gi1fp",
      "body": "Hello brother kitna rank"
    },
    {
      "id": "k8gqtnw",
      "body": "Bro no such major difference just join EC campus and save money anyways the placements are same for both campus."
    },
    {
      "id": "k8h0qg4",
      "body": "With the growing crowd in RR campus it's hard to get the best professors teaching in your class and a lot of Btech is self study afterall..\n\nTake EC campus, save some money as pessat fees now are insanely high."
    }
  ]
}