{
  "id": "17rzwh9",
  "title": "Pesu life",
  "content": "i wrote ISA recently (sem-1) and i felt a bitt off compared to other colleges,their ,there r having kinda easy syllabus compared to us and they have so much time for side hustles/learning new skills. As i saw the placement stats on the pesu discord ,most of them were shown that the cutoff was 8 , later they filtered 8.5+ , with this criteria how to manage eveything? and how did u seniors manage everything? im feeling like im back to my JEE classes. Thought of learning a prog. Language but no time(8 to 4 college) . The engg. life i heard from my known seniors is exactly opp. for me in PESU.\n\nif i score 25 in both internals in every sub. -->it will be 25 marks for final sem + 10 assgn marks, Then one has to score 40 ( 80) in ESA to get 8.5 !!\n\nPlease break down every point!",
  "metadata": {
    "author": "PYUchiha7",
    "url": "https://www.reddit.com/r/PESU/comments/17rzwh9/pesu_life/",
    "permalink": "/r/PESU/comments/17rzwh9/pesu_life/",
    "score": 17,
    "created_utc": 1699606113,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "k8mlm06",
      "body": "So the thing that always helps is the fact that relative grading is always brought in for your semester exams and the grades automatically improve, like my CGPA was generally in the 8.5 to 9 range and it isn't something great, given how many people actually ended up getting 9+ on a regular basis. So you do not have to worry about results or anything. Everyone generally gets a decent CGPA and college sort of wants many people to get selected for all companies so they will ensure that the relative grading gets more generous over time."
    },
    {
      "id": "k8mmb15",
      "body": "Placement point of view at the end it's relative only wrt to the people in your batch of your college.\nSo if by chance everyone's gpa falls, the cutoffs for companies too would fall (so 8.5 gpa in pes would be equivalent to 9gpa elsewhere).\nSo as long as we are in top 20 percentile of people it shouldn't be an issue I guess."
    },
    {
      "id": "k8oeq9q",
      "body": "Learn the fundamentals of the stream you are majoring in and Everything will follow, placements focuses  on fundamentals built over these years and web development,cyber sec and other stuff can be your self learning component of college life.\n\nYou don't have to be at the top of the food chain to get placements, you have to be relatively better than the crowd you are appearing in the placements with.\n\nLearn the skill to gauge which subject is very important and what is not,which topic will fetch you better marks and which won't, which subject will pump you gpa and which will dump it, prioritise things, these are soft skills learnt over time and will stay with you even after college life, also learn the topics you wanted to always get your hands dirty with.\n\nForget about the college life of others, if you entered this college you would be aware of the hardships people gave here, but it pays off in the placements department.\n\n\nAnd remember Pareto's principle,it applies to this part of your life as well, be \"Resourceful\" in identifying that 20%.."
    }
  ]
}