{
  "id": "17s36gl",
  "title": "Doubt regarding scholarships",
  "content": "One of my professors told me about the CNR and MRD scholarships. She only told us we need a union Bank account to claim them (if eligible ofc). Can someone give me more details about these scholarships, how likely one is to get them and how to apply",
  "metadata": {
    "author": "No-Independent-9209",
    "url": "https://www.reddit.com/r/PESU/comments/17s36gl/doubt_regarding_scholarships/",
    "permalink": "/r/PESU/comments/17s36gl/doubt_regarding_scholarships/",
    "score": 1,
    "created_utc": 1699620089,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "k8n33zh",
      "body": "The CGPA Cutoffs for - \n\nCnr is some 9.5   \nMrd is some 8.6  \n\n\nSee, you are not *applying* to any scholarship here. It's all merit-based.   \nCollege only gives it to you, based on your merit. \n\nYes, you need a union bank Account. Make sure to create one from your PESU academy portal  (or you can do your own). Because that will be the account used for all your *college -> student* transactions in PES."
    },
    {
      "id": "k8n649b",
      "body": "These people have renamed cnr scholarship to mrd and vice versa. Pro chancellor told in his address"
    },
    {
      "id": "k8n8w2c",
      "body": "There are 3 types of scholarships given at PES , that being CNR , MRD , DAC .\nEach of these can be claimed only through an account in union Bank only .\nThe branch of union Bank however need not be that of ec campus and can be any branch . But it just needs to be a union Bank account and the account has to be in your name ( wont work if it's in someone else's name ).\nComing to the amount reimbursed things have changed slightly from this semester and some rechristenings have taken place , so i can't really comment on how it's going to be from this semester onwards .\nBut for the last semester , CNR had a total of 50 percent fees reimbursement for both the semesters combined i think . MRD had 20 percent fee reimbursement per semester which results in a total of 40 percent fee reimbursement for the entire year .\nDAC is given to anyone and everyone having sgpa in excess of 7.75 and this is equivalent to 1000 rupees credited to your bank account ( no it is not given in the form of book coupons ) . As per my information this scholarship has now been raised to 2000 rupees from this semester ( that's one of the changes taking place in the scholarship system from this semester) .\nComing to the eligibility, anything above 8.75 is a good bet for getting MRD scholarship and i believe anything above 9.5 is a good bet for getting CNR scholarship .\nPlease note that there are some changes into this semesters scholarship system and the above stat is purely from a 2026 batch perspective .\nAlso , the cgpa eligibility criteria is not something that's hard-coded and it's not that you have to be above whatever gpa's i have mentioned . it purely depends  on how the entire batch has performed.\nWhatever gpa's  I have mentioned is only an example , but it helps if you have a gpa above it"
    },
    {
      "id": "k8natrz",
      "body": "Wait so ALL student-college transactions will be done through union Bank? Also thanks for the answer it helped a lot :)"
    },
    {
      "id": "k8navas",
      "body": "Is that so?"
    },
    {
      "id": "k8nb23n",
      "body": "Thank you so much"
    },
    {
      "id": "k8nf0w9",
      "body": "It's not for both ways. It's only for when the college gives you money"
    },
    {
      "id": "k8oaop9",
      "body": "Not both ways, so i put \"->\". Only when college pays you, its Union bank only"
    },
    {
      "id": "k8oapo1",
      "body": "yes"
    },
    {
      "id": "k8s16h0",
      "body": "Yeah but like even hackathons and other club events prize money?"
    },
    {
      "id": "k8s1cfl",
      "body": "Yeah I get that but what about prize money and stuff"
    },
    {
      "id": "k8t25rd",
      "body": "I won only one so far and yeah they sent it through union Bank"
    },
    {
      "id": "k8wi9ui",
      "body": "If prize money and stuff, It again depends on the club. Each club gives money to winners in their own ways. So you must contact the club heads / event OC for that."
    },
    {
      "id": "koa3xt7",
      "body": "Hey, I know its 3 months old, But yes,   \nPrize money will be distributed through a cheque to the winners.   \nOther stuff, I dont know too"
    },
    {
      "id": "koaoc6u",
      "body": "No worries! Thanks for the reply :)"
    },
    {
      "id": "m8cd9je",
      "body": "if someone wants to get the mrd schlorship in the 2nd year will the sgpa of the first and the 2nd sem be considered ?"
    }
  ]
}