{
  "id": "17sz26o",
  "title": "Any advice for future pes students",
  "content": "So I am 2nd puc I want to join this college so any advice related to KCET or any other advice u would like to give",
  "metadata": {
    "author": "-N_O_N_E-",
    "url": "https://www.reddit.com/r/PESU/comments/17sz26o/any_advice_for_future_pes_students/",
    "permalink": "/r/PESU/comments/17sz26o/any_advice_for_future_pes_students/",
    "score": 5,
    "created_utc": 1699723251,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "k8tblfd",
      "body": "Not sure whether this qualifies for advice but alakh Pandey's videos (original lakshya batch - the first one ) are available for free on telegram .\n\nThey helped me a lot for kcet 12th physics portions ."
    },
    {
      "id": "k8tj53r",
      "body": "Thank you very much bro"
    },
    {
      "id": "k8vpca6",
      "body": "First piece of advice , try for an Nit :)\nThen RV :)\nThen PES :)) 👍"
    },
    {
      "id": "k8vph5k",
      "body": "Thank you bro"
    },
    {
      "id": "k8w2s4t",
      "body": "IIT first bradar"
    },
    {
      "id": "k8wii3y",
      "body": "Firstly, PES should be your last option bro. First try IIT, NIT, etc and then via CET to other colleges. If you dont get selected to any other colleges, then consider PES"
    },
    {
      "id": "k8wx3y2",
      "body": "bro it depends on them, not everyone wants what is popular (ik pes is popular too but compared to iit, it isnt)"
    },
    {
      "id": "k91adne",
      "body": "Hmmm yeah, end of day its the OPs personal preference :)"
    },
    {
      "id": "k91gcx6",
      "body": "As a final year student with friends in many other colleges, the best advice I can give is don't join PES unless it's your last option. And if you're thinking of joining ECE, don't join PES. Unless you're really passionate about ECE, you'll suffer a lot here. If your goal is to get placed, the placements are pretty trash this year, with only 5 people getting placed from my campus in ECE till now"
    },
    {
      "id": "k92iww5",
      "body": "If you are joining for cse  or want to work in software company these are my advice\n\nMaintain high cgpa (more the better). Because competition is intense in pesu.\nStart solving DSA problems as early as possible preferably by 2nd year but earlier the better.\n\nPlay around with multiple tech stack and domains for the first or maybe 2nd year. From  the end of 2nd year onwards pickup one domain or two domain , two or three framework and gain expertise in that. \n\nHave good knowledge of Core subjects like OS,CN,DBMS not just whats required for exam but go beyond that.\n\nDon't run behind what is popular and what everyone is running behind like ML. Things like ML and AI might sound cool but there are hardly any jobs in that domain especially for Bachelors/fresher level. \nWhereas there are plenty in things like Web dev, Devops etc.\n\nChoose one domain and master it as best as you can\n\nAlso if you have plans abroad start working under teachers either on their projects or as TAs. This will help you immensely when it comes to LORs.\n\nAnd lastly have good fun participate in whatever activities you like whether you know it or not. And have fun"
    },
    {
      "id": "k92janc",
      "body": "Lol my brother goes to RV(CSE) he says same shit about RV. Only thing better in RV is more quality Companies(slightly better) visit campus then pesu and competition is very less than PESU.\n\nIf you miss out on IITs and NITs I guess just join Local college whichever has best placements among the ones you are getting. End of the day its all."
    },
    {
      "id": "k93i38o",
      "body": "hasnt the placement situation been trash everywhere in general this year?"
    },
    {
      "id": "k93re14",
      "body": "Yeah, but CSE people don't have it this bad tho"
    },
    {
      "id": "k94dolt",
      "body": "Don't do it."
    },
    {
      "id": "k94m715",
      "body": "Can u please tell wdym by 'TAs and LORs'"
    },
    {
      "id": "k95oekc",
      "body": "TAs mean teaching assistant.\n\nLORS mean Letter of recommendation. You need those if you plan on studying Masters abroad"
    },
    {
      "id": "k970a2o",
      "body": "oh. i've heard the opposite"
    },
    {
      "id": "k9h92h7",
      "body": "Join Dayanand Sagar college of engineering"
    },
    {
      "id": "l7k7bdl",
      "body": "Rv ete vs pes cs?"
    },
    {
      "id": "l7kabuk",
      "body": "Pes Cs obviously.  Unless you like ete and want to do MS in that"
    },
    {
      "id": "l7kb79f",
      "body": "Purely from a placement pov? Also how good is ete scope for ms/career after that ?"
    },
    {
      "id": "l7kee6c",
      "body": "100% CS in pes then ete has almost no placement. MS is only recommended if you really really like the subject and is harder than just getting placed"
    }
  ]
}