{
  "id": "17wimo2",
  "title": "Looking for UX Interns and Campus Ambassadors from PESU for Sling - A college social app!",
  "content": "Hello PESU folks, we're scouting for some great people to join our team as UX Interns and Campus Ambassadors for Sling - your next favourite college social app.\n\nBoth of these will be paid, with the latter being performance based.\n\nFor campus ambassadors, we'd prefer folks in their sophomore/junior/senior years, and for UX, we'd mainly be looking at your portfolio.\n\nIf you're interested, reach out to us at [info@joinsling.com](mailto:info@joinsling.com), or message us here.\n\n\\--\n\nMore about Sling:\n\nSling is a social + anonymous social media focused on colleges.\n\nAs the description suggests, there are two modes, '**Anon**' and '**Public**'.\n\n* You can choose your vibe, by sharing your thoughts anonymously in 'Anon' mode, with people from your university, or others.\n* ...or you could engage openly with just the people from your university in 'Public' mode.\n* Folks are verified through their **university email**, making sure there are no imposters and keeping things genuine.\n\nYou can talk about anything under the sun.\n\nHere's a play store link: [https://play.google.com/store/apps/details?id=com.slinglabs.sling](https://play.google.com/store/apps/details?id=com.slinglabs.sling) if you want to check it out.",
  "metadata": {
    "author": "sling-social",
    "url": "https://www.reddit.com/r/PESU/comments/17wimo2/looking_for_ux_interns_and_campus_ambassadors/",
    "permalink": "/r/PESU/comments/17wimo2/looking_for_ux_interns_and_campus_ambassadors/",
    "score": 6,
    "created_utc": 1700126105,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "k9hd4t2",
      "body": "Great opportunity"
    },
    {
      "id": "k9hhtik",
      "body": "man stfu, anon mode is not truly annonmous, the dev can see who it is, stop scamming people"
    },
    {
      "id": "k9hlg5a",
      "body": "The emails get decoupled right after verification and we don't track the linkage. So we have no way to know what you'd do."
    },
    {
      "id": "k9hn9em",
      "body": "College Email is not provided to juniors..which this app Is asking for. Any seniors ,Who can help juniors with that?"
    },
    {
      "id": "k9hnx6x",
      "body": "There is no way to verify this, you could be lying. A truly anonmous app should never even require login in the first place."
    },
    {
      "id": "k9v5byl",
      "body": "Sound great 😸"
    }
  ]
}