{
  "id": "180z1ok",
  "title": "Summer Internship",
  "content": "I'm in CSE 5th sem. How crucial is doing a summer internship after 3rd year? Will I be able to claim 2 credits if I do an unpaid one in a tech company? If I'm unable to get the 6 internship credits, what can I do to get them later? Will I have to do extra courses in 8th sem? If yes, how can I do courses if I'll also have to do an internship in 8th sem?\n\nThanks in advance!",
  "metadata": {
    "author": "ChaoticChaos89",
    "url": "https://www.reddit.com/r/PESU/comments/180z1ok/summer_internship/",
    "permalink": "/r/PESU/comments/180z1ok/summer_internship/",
    "score": 5,
    "created_utc": 1700621690,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ka997wl",
      "body": "If u don't get summer internship u can do a summer courses and can claim those credits. But unpaid internships are not considered for claiming the credits."
    },
    {
      "id": "ka9iqhj",
      "body": "You do not \"need\" to get a summer internship for graduating from PES. Whatever credits you get from summer internship is subtracted from the 8th semester internship credits. So you will be fine without doing a summer internship. \n\n\nThat being said, you should try your hardest to get a summer internship. It is a big plus on your resume and it can give you first hand experience, which you can use to then choose your career path. Paid or unpaid it is possible to get credits. Paid ones will be almost guaranteed credits while unpaid ones will be based on your work and the reputation of the organisation. \n\n\nYour summer courses will count towards 7th semester not to 8th semester."
    },
    {
      "id": "ka9iw2w",
      "body": "Summer internship and summer courses count towards different semesters. Internship toward 8th sem and courses toward 7th. \n\nUnpaid internships can get credits if it's is at a respected establishment."
    },
    {
      "id": "kaaanh4",
      "body": "It's not mandatory to get a summer internship, the credits you receive for it will be adjusted later in your 8th sem internship but having one surely has a lot of benefits.\nIt adds immense value to your resume, if you paid it's an added bonus and mostly there is a chance of getting a PPO(Pre-Placement offer) depending on your performance."
    },
    {
      "id": "kaafeep",
      "body": "okay thanks a lot!"
    },
    {
      "id": "kaafh9p",
      "body": "i heard special topics can be done in case of internship credits shortage. is that true?"
    },
    {
      "id": "kaafiui",
      "body": "thanks for insight!"
    },
    {
      "id": "kaafv1n",
      "body": "Yes, but those special topics are available in 8th semester. If you don't get an internship for your 8th semester, then you will have to do special topics."
    },
    {
      "id": "kaerhfv",
      "body": "Unpaid summer internships don't get you any creds.. I tried fighting with management for it but they didn't budge"
    },
    {
      "id": "kd1os2j",
      "body": "Hi sorry for the delayed reply but if you are still here can you tell me what the minimum stipend amount is for the internship credits to count."
    },
    {
      "id": "kd2068k",
      "body": "I think it should be paid . Like not 500 or somethin.. and should be a s/w job.. not sales or marketing or stuff"
    }
  ]
}