{
  "id": "181aqtu",
  "title": "ESA Registration",
  "content": "What is the difference between withdraw and drop?",
  "metadata": {
    "author": "Ok-Fudge6043",
    "url": "https://www.reddit.com/r/PESU/comments/181aqtu/esa_registration/",
    "permalink": "/r/PESU/comments/181aqtu/esa_registration/",
    "score": 5,
    "created_utc": 1700664402,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "kabe1y8",
      "body": "Are you planning on taking one of them?"
    },
    {
      "id": "kabeb0j",
      "body": "Yeah"
    },
    {
      "id": "kabeg7c",
      "body": "I don't know the difference but I'm curious why you want to withdraw"
    },
    {
      "id": "kabexag",
      "body": "Just thinking and want to know the difference"
    },
    {
      "id": "kabfvxq",
      "body": "withdraw means you're opting to write the course and gain those credits later, maybe in another semester.\n\nDrop refers to dropping the course entirely, you'll lose those credits there's no way you can write that paper at any time."
    },
    {
      "id": "kabg1qu",
      "body": "Thank you"
    },
    {
      "id": "kabhpcd",
      "body": "What about a special topic"
    },
    {
      "id": "kabhthq",
      "body": "Will it be f grade?"
    },
    {
      "id": "kabhxdo",
      "body": "If you withdraw, it shows a W grade, not F."
    },
    {
      "id": "kabi0sa",
      "body": "no clue about how it works for special topics"
    },
    {
      "id": "kabia9u",
      "body": "What about drop"
    },
    {
      "id": "kabifnq",
      "body": "won't show up as a course at all, i think. I've only withdrawn a subject, I've never dropped so I'm not really sure"
    },
    {
      "id": "kablpzr",
      "body": "Bruh will there be any problem later if we withdraw?I mean will that be considered as backlog??"
    },
    {
      "id": "kably5n",
      "body": "No problem, but yes you'll have to write it later as a backlog and also pay Rs250/- per credit."
    },
    {
      "id": "kabmq32",
      "body": "And how will that affect the gpa?(ps:dont mind me i am absolutely new to all these..and none of my friends have a clue abt this)"
    },
    {
      "id": "kabnp21",
      "body": "Cgpa will be lesser of course, because you haven't written a certain number of credits. Once you write the paper at a later time, gpa increases according to the grade you've scored."
    },
    {
      "id": "kae4qib",
      "body": "Works the same way. They're normal courses too."
    },
    {
      "id": "kae4xdq",
      "body": "Not a backlog, but you'll need to clear it before you can get your degree. Ideally before 6th sem or so because that's when companies start visiting for summer internship too"
    },
    {
      "id": "kaeuqqz",
      "body": "So if we drop a special topic we won't get a backlog right ,for example this semester we have 22+2 , (2)being the special topic if we drop this special topic will it be 22/22 or 22/24"
    },
    {
      "id": "kagybic",
      "body": "Unless you have a solid reason, for eg, cancer or parents death or something very serious it would not be advisable to withdraw or drop, as passing the course by just writing the (backlog) not considered backlog esa is not easy. If I'm not wrong, your grade will be entirely dependent on that exam and previous assignment marks or isa marks won't count. (Someone pls crct me if I'm wrong) , so please talk to your mentor/faculty advisor and make an informed decision."
    },
    {
      "id": "kak9gg9",
      "body": "I thought of doing but now I decided to not"
    },
    {
      "id": "kjnr9r6",
      "body": "so, when you can write the withdrawn course?"
    },
    {
      "id": "kjnrai0",
      "body": "so, when you can write the withdrawn course?"
    },
    {
      "id": "kjnrkff",
      "body": "so, when you can write the withdrawn course?"
    },
    {
      "id": "kjnrl60",
      "body": "so, when you can write the withdrawn course?"
    }
  ]
}