{
  "id": "1853i5x",
  "title": "Summer internships",
  "content": "So I am currently in 5th sem CSE ( almost over), I haven't been able to grab any summer internships as of now for 2024 summer. What are the prospects of me doing so in 6th sem? Would any major companies visit for summer internships ( also any expected stipend )?",
  "metadata": {
    "author": "Strange2118333",
    "url": "https://www.reddit.com/r/PESU/comments/1853i5x/summer_internships/",
    "permalink": "/r/PESU/comments/1853i5x/summer_internships/",
    "score": 12,
    "created_utc": 1701093361,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "kb2xpk9",
      "body": "Don't rely on PES for summer internships. Very few get it through PES. Look by yourself.\n\nIt not too late to start looking for a summer internship. If you don't get one by late April/late May then don't expect to get one."
    },
    {
      "id": "kb2y1jg",
      "body": "In 3rd sem rn. Can you tell if I can grt any summer internship in summer 2024 through PES and if yes, how?"
    },
    {
      "id": "kb2yxw0",
      "body": "I don't remember if PES offers any opportunities for 3rd/4th semester students. However there might be a few things you can do **AT** PES in that summer. \n\nI'd recommend either speaking to your mentor, HOD or your favourite teacher about this. They will know best."
    },
    {
      "id": "kb2zfdl",
      "body": "I don’t live in bangalore, so I was thinking of doing something at PES for half of summer and other half was planning to go home. Can you tell some activities that students normally do for summer"
    },
    {
      "id": "kb2zwb9",
      "body": "Go speak to your mentor, HOD or your favourite teacher about this. They are the ones who will know. \n\n\nOtherwise wait until one of your peers reply. I do not know what a second year student can do."
    },
    {
      "id": "kd75j7t",
      "body": "try your hand at pesu venture labs, if you’re good at web dev or ml or cybersec i can connect you to some friends."
    }
  ]
}