{
  "id": "1856zla",
  "title": "Attendance under 85%",
  "content": "Our class mentor today went on a spree of explaining that if we have our attendance below 85% we will have to get an affidavit and have to get a ton of signatures....is this true or just some random scares?\n\nAlso will a genuine medical certificate be enough?",
  "metadata": {
    "author": "SadMountain1186",
    "url": "https://www.reddit.com/r/PESU/comments/1856zla/attendance_under_85/",
    "permalink": "/r/PESU/comments/1856zla/attendance_under_85/",
    "score": 9,
    "created_utc": 1701102670,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "kazp1sk",
      "body": "A medical certificate should be enough I'm not sure though"
    },
    {
      "id": "kazpc2n",
      "body": "Which sem are you in?"
    },
    {
      "id": "kazpedm",
      "body": "The affidavit thing is bs right?"
    },
    {
      "id": "kazpfpz",
      "body": "1st"
    },
    {
      "id": "kazpr7i",
      "body": "Should be like why would they do that there are plenty of people in my section who probably have attendance lesser than 85. There was a post on attendance previously you should check it out"
    },
    {
      "id": "kazq9xd",
      "body": "Is it 80 or 85? If it is 85 im fucked"
    },
    {
      "id": "kazqe66",
      "body": "They always say that, but in reality they only make a deal out of it if it's like below 75.\n\nThen you neet to meet with someone and give an apology letter or something"
    },
    {
      "id": "kazqfvw",
      "body": "They say 85 but from what I have heard they let it slide if you're a bit short"
    },
    {
      "id": "kazqi9t",
      "body": "The minimum attendance required was 80% when I was in the first sem, anything lower than that and you'd either have to submit a medical certificate to make up for it or sign a document and get chewed out by the chairperson. Unless your attendance is below 75 I wouldn't be worried. The affidavit thing is complete bs."
    },
    {
      "id": "kazqymp",
      "body": "I have a valid medical certificate...and my minimum is 75% in maths and we have 15 more sessions...so hopefully I will be fine"
    },
    {
      "id": "kazrnpy",
      "body": "Join college clubs, you can easily scam attendance"
    },
    {
      "id": "kazsabb",
      "body": "S&H department is pretty chill I'm assuming your in that maximum they ask you to sign a form saying you wouldn't be repeating the same. Or a call with your parents if you don't have medical certificate \nMy friend wrote his second semester ESA with 58% in physics in July only"
    },
    {
      "id": "kazsczv",
      "body": "Ahh shit, I'm above 80 in all, but idts I will be able to be above 85, I'm scared"
    },
    {
      "id": "kazxdpp",
      "body": "I am in one club rn.....but ny mentor said that they won't be giving attendance to 1st years for club activities"
    },
    {
      "id": "kb059ju",
      "body": "You'll do just fine."
    },
    {
      "id": "kb076nw",
      "body": "They do always say that but I never had a problem 😅"
    },
    {
      "id": "kb1m5ge",
      "body": "I'm in second year rn and the minimum attendance is 70% lol\nThey've sent a message saying those who've gotten below this must sign an affidavit XD."
    },
    {
      "id": "kb2hqiy",
      "body": "PESU senior here. I used to have 60-70% attendance. But whenever I went to class I used to listen to class with complete attention and respond to the questions asked and also used to score pretty well in ISAs. Then at the end of sem I just approached the faculty and informed her regarding attendance shortage and she was like you don't worry I will take care. Guess I was lucky 🤌🏻"
    },
    {
      "id": "kb3nqmy",
      "body": "They will say 85% is minimum but at last they will consider for 80% if teachers are good if u have 75% they will give the 5% attendance and let u to write the exam"
    },
    {
      "id": "kb4lvrk",
      "body": "Which section are you in?"
    },
    {
      "id": "kb5hhky",
      "body": "Guys look, yes it is true that the real criteria is around 75% ish but don't fuck with your attendance. And yes, medical certificates guarantee you the attendance you missed out on. I have never had to submit an affidavit, not sure if there are any changes."
    },
    {
      "id": "kbf3odz",
      "body": "My friend got attendance for an entire week of leave (cultural club)"
    },
    {
      "id": "kbf6cy3",
      "body": "What do they get out of these \"threats\"?"
    },
    {
      "id": "kbfe8k1",
      "body": "That's literally the smallest amount of power they can wield on you and somehow they let it get to their heads also 😂"
    },
    {
      "id": "kbfkb8n",
      "body": "M"
    },
    {
      "id": "m99lo7s",
      "body": "If you’re at PES University, make sure to check out the PESU Attendance Chrome extension I built! It helps you track how many classes you need to attend to stay on track and, even better, lets you see how many classes you can afford to bunk.\n\n[PESU Attendance](https://chromewebstore.google.com/detail/pesu-attendance/aoblnnmlkcadhkdkocbanbcjndjlgiib?hl=en)"
    }
  ]
}