{
  "id": "186qh4s",
  "title": "Kinda need help for this sem",
  "content": "I'm struggling to get back into the flow of 2-ISA system after 5-ISA system and realized I only have ESAs to make up for my subpar performance, especially in 2 subjects. I'm currently in 5th sem and am really struggling w my elective and MI and am scared that if I don't do well in those, my gpa will drop horribly. Im assuming their totals will be in the mid 30s range out of 50.\nPlease help!",
  "metadata": {
    "author": "POS272",
    "url": "https://www.reddit.com/r/PESU/comments/186qh4s/kinda_need_help_for_this_sem/",
    "permalink": "/r/PESU/comments/186qh4s/kinda_need_help_for_this_sem/",
    "score": 11,
    "created_utc": 1701267613,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "kba7h7u",
      "body": "~35+ score isn't too bad. Make sure to cover your slides completely. For MI, I highly recommend you study from YouTube, you'll find tons of resources. For other subjects as well, try covering your textbook as well but do that only after your slides. YouTube is King. Learn concepts from there and apply that to understand your slides. Good luck!"
    },
    {
      "id": "kcr1fiw",
      "body": "Never felt more relatable🫂💀, i hope the faculty will be considerate towards us (that last thing that would happen in PES) and award marks more than what we are supposed to get🥲🫠🫠"
    },
    {
      "id": "kcr7er3",
      "body": "Yeah man I hope so 😭 this sem has been pathetic"
    },
    {
      "id": "kcr7iaa",
      "body": "More than sem 3?😭😭"
    },
    {
      "id": "kcrg20j",
      "body": "Actually yeah 😭😭 I feel like I did much better in 3rd sem because of the 5 isa system \nAll I can say is, whatever exams are left, put in all your effort 😭"
    },
    {
      "id": "kcrgekv",
      "body": "I have DSA exam tomorrow and i didn't study shit and isa 2 results are out now idk what to do😭😭😭\nPlease help me senior ma'am 😭😭"
    },
    {
      "id": "kcrgm7l",
      "body": "Stop doom scrolling on reddit and do whatever you can😭😭😭 Idk how to help because I use to do dsa consistently 😭😭"
    },
    {
      "id": "kcrgt9d",
      "body": "Ah so gonna have a backlog now😋😋💀"
    }
  ]
}