{
  "id": "18aq2d4",
  "title": "question regarding difficulty level",
  "content": "is cbse preparation enough for pessat. some are saying that it's an easy exam and some say its tough. im going to give my pessat this year so can you please share me the tips from where to prepare. ive not prepared really well for jee so i want to score good in this exam",
  "metadata": {
    "author": "blackdarkness04",
    "url": "https://www.reddit.com/r/PESU/comments/18aq2d4/question_regarding_difficulty_level/",
    "permalink": "/r/PESU/comments/18aq2d4/question_regarding_difficulty_level/",
    "score": 3,
    "created_utc": 1701713088,
    "flair": "Study Help :table:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "kc223vq",
      "body": "Your kcet prep is more than enough for Pessat(which is ncert mostly), just brush up on your English a bit ."
    },
    {
      "id": "kc2i24f",
      "body": "okay thanx!!"
    },
    {
      "id": "kc2r5q1",
      "body": "i would say that it went easier for me than kcet. its prolly due to the marks allotment diff. standard state entrances have 180marks with 60Phy+60Math+60Chem. PESSAT has 60Phy+60Math+40Chem+20Engish. The english is fairly CBSE level with synonyms and antonyms mcq's."
    },
    {
      "id": "kc6jzbt",
      "body": "Okay thnx and I also wanted to ask if pessat generates true rank like the students whose paper goes really well get a good rank and the rank doesn't depend on luck"
    },
    {
      "id": "kc7zmev",
      "body": "Thats an interesting point you pointed out. I didn't really study that well for pessat but still managed to bag a seat in the first round. I know some people who studied like crazy for jee mains but tanked mains as well as pessat. So, i would surely say that luck is a factor."
    },
    {
      "id": "kc8z8ir",
      "body": "i also had a doubt regarding the syllabus. on the website it says 11th and 12th cbse questions so will the deleted part of this syllabus of this year come or not?"
    },
    {
      "id": "kcjm7m2",
      "body": "Im pretty sure it will be based on whole syllabus. The CBSE cuts dont apply to competitive exams."
    }
  ]
}