{
  "id": "18bmoro",
  "title": "How does the “Relative Grading” thing work in ESA?",
  "content": "",
  "metadata": {
    "author": "Slight-Discount-2623",
    "url": "https://www.reddit.com/r/PESU/comments/18bmoro/how_does_the_relative_grading_thing_work_in_esa/",
    "permalink": "/r/PESU/comments/18bmoro/how_does_the_relative_grading_thing_work_in_esa/",
    "score": 13,
    "created_utc": 1701811192,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "kc56336",
      "body": "3am thoughts for real"
    },
    {
      "id": "kc6f0rj",
      "body": "Correct me if I am wrong, PESU does not have relative grading, it has an absolute grading system with moderation. Normally 90-100 is considered S grade, 80-90 is A grade and so on. When many people perform poorly in a subject everyone is added some marks which basically pushes their grade by one level. In the previous two semesters there has been moderation in almost every subject leading to gpa inflation ."
    },
    {
      "id": "kc7bu9e",
      "body": "It is what it is💀\n( I really hope there is relative grading)"
    },
    {
      "id": "kc88bvi",
      "body": "Adding on to this.. basically if everyone fucks up no one fucks up.. and if no one fucks up then everyone gets good marks.. then there are those assholes who get amazing marks, and there are many of them then the lower marks people get fucked over.. simple.. it's a private uni they will try and pass y'all, make sure u get over 33 overall"
    },
    {
      "id": "kc89opf",
      "body": "Yeah, PES doesn't do relative grading. In a sem or two(like in 5th sem for us) you might feel like you got way more marks than you wrote for. That's probably because you did. Idk why or how but sometimes you get a better grade.  But most of the time the grading is not relative and you just get a grade based on your total marks out of 100(ISA+ESA+assignment). 40+ is E or pass and 90+ is S"
    }
  ]
}