{
  "id": "18dlv2q",
  "title": "I want to get admission in PES University for MBA. What is the fees for MBA through PGCET? And what are placement scenarios in your college?",
  "content": "",
  "metadata": {
    "author": "Safe-Complaint9552",
    "url": "https://www.reddit.com/r/PESU/comments/18dlv2q/i_want_to_get_admission_in_pes_university_for_mba/",
    "permalink": "/r/PESU/comments/18dlv2q/i_want_to_get_admission_in_pes_university_for_mba/",
    "score": 5,
    "created_utc": 1702038813,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "kdvb0ts",
      "body": "Hey have you received any info about the same???\nEven I have shortlisted pes for mba through pgcet"
    },
    {
      "id": "kdve8jq",
      "body": "What's your ranking?"
    },
    {
      "id": "kdvio22",
      "body": "Mines 238\nWhat's yours"
    },
    {
      "id": "kdviw30",
      "body": "Mine is 274. \nAs much as I have enquired till now. The fees may range from 1,00,000 - 1,50,000 per year depending on your category. The campus is good and placements depends upon your skills."
    },
    {
      "id": "kdvjnnh",
      "body": "How would you rank rvim compared to pes??\nYeah the fees is yeah around that range \nYou know pes has trimester system right?"
    },
    {
      "id": "kdvkgba",
      "body": "I don't know i haven't researched more about RVIM. Let me know if you have any information about that college. What is the fee structure? What else do you know?"
    },
    {
      "id": "kdvn5ms",
      "body": "Rvim fees comes around 1.4L per year\nThe hostel is not preferable but you'll get pgs in the area easily\nThe courses and curriculum is nice\nAnd placements obviously depends on each individual"
    },
    {
      "id": "kdvw34f",
      "body": "Oh right! Do you think trimesters will be too hectic to handle?"
    },
    {
      "id": "kdxhto2",
      "body": "Yeah i guess i imagine it to be very hectic honestly\nThere's also case studies and research papers and all that"
    },
    {
      "id": "ke0499m",
      "body": "Yeah right. Do you think it all will be worth it? \nI am confused too. Is it bad thing that it'll be hectic?"
    },
    {
      "id": "ke2bqnq",
      "body": "It isn't necessarily bad cause it depends how each individual handles the academics\nI think it will be worth it honestly\nBut personally I'm unsure if i could handle the schedule so I'm hoping to get into rvim"
    },
    {
      "id": "ke2hfja",
      "body": "Yeah, you are right."
    },
    {
      "id": "kfdwodk",
      "body": "Hey  pes is accepting pgcet scores right???\nAlso upon detailed enquiry rvim doesn't seem like a great choice\nSeniors are recommending dayanand Sagar or msr."
    },
    {
      "id": "kfdy1ih",
      "body": "Yes. PES accepts PGCET. Today KEA released seat matrix, which also includes PES. So yeah"
    },
    {
      "id": "kfdydj2",
      "body": "I didn't find it in the list so i enquired about it with the college and they said they do and are accepting rank under 500"
    },
    {
      "id": "kfe02hm",
      "body": "It is a private college, the list of private colleges is in page number 64 of the seat matrix PDF. Your rank is under 500 right? So what's the problem?"
    },
    {
      "id": "kfe0e9s",
      "body": "Up until now I wasn't sure about pes so that was the problem \nThe holidays for pgcet students are non existent\nAnd the timing is 8 to 6 45\nSo no social life at all"
    },
    {
      "id": "kfe19i4",
      "body": "Oh no. 8am-7pm is crazy. I also heard that they treat grownup students like school children. I read a reddit post saying that. So i think it might be very strict.\nBut why do need to attend classes for 11 hrs. Are they teaching something special? I don't think we'll get enough personal time."
    },
    {
      "id": "kfe1r8g",
      "body": "Yeah we won't possibly get time for ourselves in the first 2 trimester \nAlso 80% attendance mandatory\nLooking at the timing it does look like we're going back to school\nLet's see because the other best options are msr or dayanand Sagar and i actually have no idea how they are"
    },
    {
      "id": "kfedn9n",
      "body": "Right. I asked my friend who is doing MBA through PGCET. She said that as management students are ahead of the PGCET students, to matchup with them they will take extra classes.. i think that's why college timings are 8am-7pm. She said that after 2nd sem it'll be more relaxed and they'll take lesser classes. I also asked her if dayanand Sagar and MSRIM are that good? She said that everyone says they are good but quality of education at PES is better as it is autonomous college. I am very confused about everything right now"
    },
    {
      "id": "kfee7ht",
      "body": "I was pretty sure about pes but looking at the dynamics has gotten me all flustered about what college to choose\nAll things considered pes is the best \nIt's like back to square one and I don't know what to do next\nI don't have any idea about msr or dsu so it's very difficult to make a decision right now"
    },
    {
      "id": "kffooh8",
      "body": "You are soo right"
    },
    {
      "id": "kfforfr",
      "body": "Have you heard about tapmi"
    },
    {
      "id": "kffvym3",
      "body": "I am sorry, i don't know. Can you explain?"
    },
    {
      "id": "kffwhex",
      "body": "T a pai institute of management\nIts tier 2 b school and is accepting pgcet I will enquire with the college tomorrow I don't have enough details about it right now as I came across it a while back"
    },
    {
      "id": "kffzt2p",
      "body": "I read their accepting exams on their site, I did not find PGCET. Yes please enquire and let me know. \nDid you write CAT exam this year?"
    },
    {
      "id": "kfg1eux",
      "body": "Yes but in the seat Matrix I came across this college\nYes I did but I would rather not say my score as I just gave it because i had registered for it"
    },
    {
      "id": "kfg2sxw",
      "body": "Alright. If you enquire more about that college, let me know. Oh, it's okay. However your PGCET score is very great. I have also written CAT and I got decent result of 80 percentile. Due to my category, i might get into IIM Ahmedabad or banglore. My only reason for not to go for those colleges is because the fees for those colleges are off the roof. Do you think is it worth the investment of that much fees in those colleges? What's your opinion."
    },
    {
      "id": "kfg3ic6",
      "body": "Honestly I have zero knowledge about iims but doing an mba through iims is a great feat so if not the without the financial constraints I would prefer an iim"
    },
    {
      "id": "kfimayc",
      "body": "Right! But can you give me your priority list for PGCET? option entry may start soon."
    },
    {
      "id": "kfkfenm",
      "body": "Pes rvim dsu msrit rnsit \nAmong these I have only done a deep search about pes and rvim \nOthers I have no idea about\nWhat are your preferences???"
    },
    {
      "id": "kfox8aw",
      "body": "I think rvim is my first priority now what have you decided???"
    },
    {
      "id": "khne525",
      "body": "Hey what is your decision???\nIm confused"
    },
    {
      "id": "khnhyvl",
      "body": "Hey, my preference order goes like this. 1) PES 2)RV 3)DSCE 4)MSRIT 5)BMS Please let me know yours! "
    },
    {
      "id": "khni3xs",
      "body": "It's \n1 pes or rv\n2 msr\n3 dsce\n\nCan you access the link for option entry??\nAlso I haven't decided between rv and pes \nI want to choose rv because the timings are better \nBut I'm not sure"
    },
    {
      "id": "khnmj8v",
      "body": "Yes, you should choose according to your convenience. I choose PES because the fees are affordable to me. \n\n\nAnd no, the option entry link is not accessible yet. Everyone is waiting since morning. "
    },
    {
      "id": "kho5c99",
      "body": "Yeah I have been checking it every hour\nHow much is the difference in fees between pes and rv\nHow will you manage the timings????\nI am still sceptical about the timings and trimester system so I'm not sure yet"
    },
    {
      "id": "khobaj0",
      "body": "Don't worry i think they'll open it tomorrow. \nI think around 30k is the difference. What are the timings of RV? \nI don't know anything, all I know is I will have to manage everything somehow. I am not even sure if i can get PES or not 😂\nMy luck is always bad. "
    },
    {
      "id": "khobl3d",
      "body": "Hey \nI just came across someone who said that pes is good for marketing or analytics\nSo I'm again in a state of stress \nThe placements are also for students from technical background\nRv timing is 9 to 5 probably\nI hope you get into whatever college is right for you"
    },
    {
      "id": "kholbxh",
      "body": "Yeah I am looking for colleges who provide business analytics as specialisation. Does RV provide that? Yeah as i said already for PGCET students it'll be hectic. I hope you too get into the college which you are looking for, you have soo much potential! "
    },
    {
      "id": "khp26yc",
      "body": "Yes rv has business analytics\nThank you for saying that \nRv also has dual specialisation"
    },
    {
      "id": "kk2pgqs",
      "body": "So what did you guys decide? Which did you get in first round?"
    },
    {
      "id": "kk2piwn",
      "body": "Which did you get in the first round and what did you decide?"
    },
    {
      "id": "kk2qz26",
      "body": "Got PES in first round. What about you?"
    },
    {
      "id": "kk2r9ep",
      "body": "Same"
    },
    {
      "id": "kk2s7bh",
      "body": "Going in for 2nd round?"
    },
    {
      "id": "kk2sfzd",
      "body": "Nope. This is the most optimal I can get. What about you? Also which specialization is better?"
    },
    {
      "id": "kk2thte",
      "body": "Got pes as well"
    },
    {
      "id": "kk2ts13",
      "body": "Are you going for round 2? Also which specialization is better?"
    },
    {
      "id": "kk2u1kn",
      "body": "Nope pes was my first option \nI am gonna specialise in finance\nBut in the first year we will realise what we are interested in and we can choose later"
    },
    {
      "id": "kk2v1qi",
      "body": "Great. What's your ranking? Specialisation is yet to decide. What about you "
    },
    {
      "id": "kk2ven1",
      "body": "220. Same not yet decided on specialization"
    },
    {
      "id": "lrwgql0",
      "body": "The college timings itself is hectic. 8 to 6"
    },
    {
      "id": "lskjq32",
      "body": "Hey did you get into PES? If so let me know is it really that hectic"
    },
    {
      "id": "ltbjmln",
      "body": "Hey did you get into PES?"
    },
    {
      "id": "n8svu7g",
      "body": "Hey, is PES good option? How are the placement? And is clg life hectic there? \nPls reply"
    }
  ]
}