{
  "id": "18ewydh",
  "title": "Python Lab exam",
  "content": "Tmrw I have python lab exam (sem-1) and there are literally a loooot of progs(120+), even if I understand the logic i can't efficiently code every prog.Will lab exams be strict? and can we expect any help from teachers?",
  "metadata": {
    "author": "PYUchiha7",
    "url": "https://www.reddit.com/r/PESU/comments/18ewydh/python_lab_exam/",
    "permalink": "/r/PESU/comments/18ewydh/python_lab_exam/",
    "score": 11,
    "created_utc": 1702188113,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "kcqlojp",
      "body": "nope, no help from teachers or the lab instructor. Don't worry about the number of programs, worry about the common ideas behind them. Think programmatically and you'd be able to code anything :)"
    },
    {
      "id": "kcqsi48",
      "body": "dont even think about opening another tab online and trying to copy from the net \n\n&#x200B;\n\nthats prolly the worst mistake you can possibly do , a friend of mine did that for C and they sent him out straightup"
    },
    {
      "id": "kcqsm5d",
      "body": "They caught him red handed or wt?"
    },
    {
      "id": "kcqxje2",
      "body": "The lab instructor keeps walking about , you'll get caught before you know it"
    },
    {
      "id": "kcrewqc",
      "body": "Brother I legit copied thru mine.. jus be mindful and know basics of programming ull be fine"
    },
    {
      "id": "kcvvppz",
      "body": "Bro if you atleast knew some basics you will get through it, but like even teachers will be linient in correction, so no worries, for us they simply gave us marks"
    },
    {
      "id": "kcvvstk",
      "body": "I edited the post, c"
    },
    {
      "id": "kcw1010",
      "body": "I have the test tomorrow and have like 100 pages left it it going to be basics? Or?? Like the easy programs from the lab manual?"
    },
    {
      "id": "kcw3d6x",
      "body": "Easy-medeasy progs from the lab manual is wt we got(almost all with whom I communicated from our and other secs).\nCover all easy-med progs of them and keep some logic in mind ull be superfine, anyways ATB"
    },
    {
      "id": "kcw3hhb",
      "body": "Thankyou!"
    }
  ]
}