{
  "id": "18hfqee",
  "title": "F",
  "content": "As u can see this,please explain the consequences of submitting this to the dean.\nHe told us that\n- It will be in student records.\n- Our parents will get a phone call from our mentor \n- No participation in any activities for a year\n- No rank certificate and scholarship for a year\n- It will be in our placements record\n- This will be used for character certificate\n (Sem-1, 24 ppl)",
  "metadata": {
    "author": "PYUchiha7",
    "url": "https://i.redd.it/55ppe0l1326c1.jpg",
    "permalink": "/r/PESU/comments/18hfqee/f/",
    "score": 44,
    "created_utc": 1702470559,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "kd67ajt",
      "body": "\"Placements Records\"  \nInterviewer: So you celebrated a birthday, we cannot go ahead with you; you aren't a fit for our culture.  \nOP: F"
    },
    {
      "id": "kd67glj",
      "body": "Yeah I'm sure abt that,that it won't play any role,explain the possible situations next"
    },
    {
      "id": "kd6bi52",
      "body": "Why do they need your cgpa for apology letter💀"
    },
    {
      "id": "kd6c3ao",
      "body": "Fuck pes"
    },
    {
      "id": "kd6dfly",
      "body": "Just pet things"
    },
    {
      "id": "kd6gfs6",
      "body": "Gosh Pesu has become stricter year by year. Damn"
    },
    {
      "id": "kd6h6kc",
      "body": "To determine the correct punishment"
    },
    {
      "id": "kd6kwq6",
      "body": "I was nearly taken to chancellor once for this but half way the bouncers realised how stupid the situation was to go to chancellor for . We ended up eating the cake together with the bouncers"
    },
    {
      "id": "kd6lotq",
      "body": "Which exams were even going on at 430 pm ?"
    },
    {
      "id": "kd6lrrf",
      "body": "Ayo tf😶"
    },
    {
      "id": "kd6lyu5",
      "body": "Donno, he said exams were on since 10 days in gjbc"
    },
    {
      "id": "kd6m87f",
      "body": "Wait who even said this , the dean ?"
    },
    {
      "id": "kd6me0z",
      "body": "Bouncers said 10 days, dean said exams are gng on"
    },
    {
      "id": "kd6mg5m",
      "body": "Can I DM u?"
    },
    {
      "id": "kd6mkrw",
      "body": "Sure"
    },
    {
      "id": "kd6wl4u",
      "body": "1984"
    },
    {
      "id": "kd75f2w",
      "body": "Shit like this is so PES lol. Don't worry too much, other than the no scholarship thing I don't think it'll be too bad. I have no idea what the character certificate is but I know people who got caught cheating in exams peacefully sitting for placements and getting LORs. I don't think this is that serious or anything. About the phone call to your parents, explain it to them asap so that there's no misunderstanding and they know to expect it. Also get used to your parents getting calls from your mentor in your first year. It depends on the mentor but many of them try to keep your parents updated"
    },
    {
      "id": "kd75thd",
      "body": "Finally a noteworthy comment for the query I quoted🙇‍♂️"
    }
  ]
}