{
  "id": "18m9q5f",
  "title": "Placements related",
  "content": "fellow 4th years or seniors. I jus wanted to confirm whether Internship+FTE guarantees the FTE or not? I see a few companies that specifically put Performance based FTE, so if the company only has Intern+FTE does that mean all that all the interns are converted to FTE for sure? or do we have to sit for placements even during our internship just to confirm a full time position.",
  "metadata": {
    "author": "Quaranteen69",
    "url": "https://www.reddit.com/r/PESU/comments/18m9q5f/placements_related/",
    "permalink": "/r/PESU/comments/18m9q5f/placements_related/",
    "score": 5,
    "created_utc": 1703012924,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ke2tuc6",
      "body": "Usually, if an offer is a guaranteed intern+FTE then you will be given your offer letter for a FTE after your internship ends *unless* your performance is poor and your manager decides against it. A performance-based FTE is when you *don't* have an FTE offer at the end of your internship but can be extended one if your manager appreciates your performance. \n\nSo these two are inverse situations of each other. However, the common point stays the same: you need to perform well during your internship to ensure you either hold on to your FTE offer (if it's guaranteed) or to earn an offer (if it's performance-based). To find out the exact nature of the offer, you will need to look into your offer letter and the placement emails. Both of these situations are common. The only way you can **confirm a full time position** is by explicitly receiving the FTE-only offers from companies and signing the offer letter once you receive it. Until then, there is no guarantee."
    },
    {
      "id": "ke5j5it",
      "body": "Intern + FTE is always confirmed FTE. But summer internships don’t have confirmed FTE(PPO), that is usually performance based. \nBut it’s best to directly ask the company HR if you have any doubts."
    },
    {
      "id": "ke5nots",
      "body": "the offer letter we got for now is only for the internship period and it's specified that it doesn't cover FTE. I'm not sure if I can directly ask the HR if I'm most likely to get the FTE if I perform well. but usually in situations like this you get the FTE unless you majorly screw up right?"
    },
    {
      "id": "ke5nyx2",
      "body": "Your manager holds the decision to extend an offer for FTE, not the HR. So you'll have to discuss it with them whether they're interested and there are chances. Because of the current job market, it's not possible to take that as a guarantee, you should try to secure a FTE position either by getting a confirmation here or applying elsewhere."
    },
    {
      "id": "ke61ytu",
      "body": "In short no it's not a guarantee."
    },
    {
      "id": "ke7s7hh",
      "body": "is it accepted to ask the manager this before even starting the role though? and as you mentioned verbal promises don't mean anything. I know it doesn't apply to all cases but do they usually convert all the interns to FTE if they mention intern+FTE.. jus according to previous years placements"
    },
    {
      "id": "ke7sno1",
      "body": "according to previous years placement do they usually convert all ( if not all then assuming the ones who dont have a terrible performance) if they've mentioned intern+FTE .. cuz my company took 30+ at a pretty good CTC and have only given the offer letter for internship for now"
    },
    {
      "id": "ke86ly8",
      "body": "Usually yes. But you should know that the market is going through unusual times."
    },
    {
      "id": "kea3uqq",
      "body": "Yes they usually give the FTE offer letter after the internship. But the FTE is still confirmed. Best to just ask the HR"
    }
  ]
}