{
  "id": "18odqy6",
  "title": "My active backlog is of 9 credits. If the backlog of 16 credits comes in 3rd sem, will the year back be imposed?",
  "content": "",
  "metadata": {
    "author": "Signal_Cockroach3548",
    "url": "https://www.reddit.com/r/PESU/comments/18odqy6/my_active_backlog_is_of_9_credits_if_the_backlog/",
    "permalink": "/r/PESU/comments/18odqy6/my_active_backlog_is_of_9_credits_if_the_backlog/",
    "score": 8,
    "created_utc": 1703247860,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "kegk0ef",
      "body": "Absolutely not. You will still be pushed forward to the next sem, no worries there."
    },
    {
      "id": "kegkg0n",
      "body": "Bro if your cumulative backlog credits is more than 22, vertical mobility comes into picture and you need to skip an year to pass"
    },
    {
      "id": "kegkx9a",
      "body": "I think this is an old rule that's not valid anymore. I'm not sure though."
    },
    {
      "id": "kegl2w1",
      "body": "If your backlog are 24 credits then there will be year back for u. From August 2023 onwards the rule was implemented before that there was no rule like this"
    },
    {
      "id": "keglufq",
      "body": "Bro did u not even fucking glance at the slides for like a year or somethin?? I did the bare min and I'm only having a decent gpa.. like damn man what the hell"
    },
    {
      "id": "kehbc71",
      "body": "nah mate, get your life back on track, at this pace you might get a yearback. Don't listen if people say gpa doesn't matter, it matters a lot if you wanna sit or placements or wanna do your further studies."
    },
    {
      "id": "keisp8k",
      "body": "Shara you gpa"
    },
    {
      "id": "kej10v5",
      "body": "Oh? That's news to me. Did this come from a reliable source?"
    },
    {
      "id": "kej1rgm",
      "body": "It's not that simple dude. Not every department has the same difficulty when it comes to exams. More than 45% ppl failed at least one subject in my department in third sem. Just going through slides isn't gonna cut it in many subjects like acd in ece for example"
    },
    {
      "id": "kek637n",
      "body": "What's your department?? I'm in cs fam"
    },
    {
      "id": "kek642b",
      "body": "8ish"
    },
    {
      "id": "kekeljs",
      "body": "It isn't simple. But failing or passing a subject doesn't depend on difficulty. The student is too lazy or not interested in the subject at all."
    }
  ]
}