{
  "id": "18ojseb",
  "title": "4th sem aiml",
  "content": "Is 4th sem of cse easier than 3rd sem?\nWill get a really bad sgpa in 3rd sem so want to know if I can cover up in 4th sem.\nAlso what languages does one need to learn for Big data pesu syllabus?",
  "metadata": {
    "author": "Sea_Mail_2026",
    "url": "https://www.reddit.com/r/PESU/comments/18ojseb/4th_sem_aiml/",
    "permalink": "/r/PESU/comments/18ojseb/4th_sem_aiml/",
    "score": 8,
    "created_utc": 1703265041,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "kehz6ds",
      "body": "No one can really say, as this is the current 1st batch of AIML \n\nIts gonna be hard though, as someone who has took big data elective, having AIML kids study it right in 4th semester, before they have completed OS and CN sounds like a recipe for disaster. \n\nThe fact that its for 5 credits, instead of 4 like for CS kids, doesnt help either. \n\nBrace yourself for pain and pesu tomfoolery."
    },
    {
      "id": "kei3qhl",
      "body": "Generally web tech ESA goes bad for mostly everyone. It did for me and dragged down my sgpa quite a lot. My 3rd sem sgpa was the lowest. In 4th sem I was able to improve mostly because of linear algebra. But 4th sem will be considerably harder because of big data. I found big data to be one of the hardest courses, but that also depends on who your prof is. My friend had a really good prof and they did not struggle with  big data like I did. Big data conceptually was quite easy though(like, easy to study, ESA was still bad), but the assignments and project were a nightmare."
    },
    {
      "id": "ken2g7h",
      "body": "What resources would you recommend for Big Data?"
    },
    {
      "id": "keq56fe",
      "body": "I'm sorry, Im not sure about that.\nI just studied from the slides. The theory was easy to understand from the slides itself and I didn't have time to explore other resources.\nFor the assignments and project, also I couldn't find any resources because the problem statements were not taken from any website or textbooks. They were original questions(probably given by the TAs).\nSo we couldn't take help from internet, we had to do everything on our own.\nWhen you get the assignments, the TAs explain everything in detail in the lab class and give clues, so using that you need to solve the question. \nLike I said, it all depends on your professor and how much you are able to understand in class.\nThe assignments and project are group tasks. You form a team for BD in the beginning and that team remains for the entire semester, so that helps."
    }
  ]
}