{
  "id": "18yyhma",
  "title": "Extension of semester break till February",
  "content": "I'm a 2nd year computer science student who has finished 3rd sem. I've told this before on discord and I'm telling it here with the copy pasta. I know my venting isn't on point, but here it goes.\n\nI want this semester break to be extended till feb ffs. Otherwise Imma create a secret gmail account and keep mailing vk sir or different chancellors begging them all to extend the sem break till feb. If I don't have their mails, then with my secret gmail account Imma keep sending mail to the chairperson begging for sem break extenstion till first week of feb. I've been praying to god to postpone ESA for the particular course (like webtech) which didn't happen. I wanted web tech esa to be postponed to atleast one more day so that the chance of getting backlog reduces. Even for SDS also. Similarly, I don't want the next sem to be started on 8th jan, instead I seriously want this sem break to be extended till Feb. Otherwise with my secret gmail account Imma keep troubling the chairperson begging for the extenstion of sem break. Also, I'm getting F in this special topic C++. And many other courses prolly or I'll get E in all of them. Pls let us all beg them to extend the sem break till Feb first week, cuz the amount of time for this sem break is not sufficient for getting rest, and for getting ready for the next sem. PLEASE, I WANT THIS SEMESTER BREAK TO BE EXTENDED TILL FEB!! Right now the CGPA of first two sem is ||5.75||. Just because of not giving us the sufficient time to prepare for the exam only my GPA is very low. Even 3rd sem went insanely so fucking bad. I SERIOUSLY WANT THIS SEM BREAK TO BE EXTENDED TILL FEB FFS!!!!!😡 😡 😡 Listening in lectures doesn't even help for ISA and ESA, and I really dunno how to study on my own, do things on my own like assignments and mini projects. I dunno how to improve my presentation skills when it comes to mini project.😭😭😭 ............ I AM PRAYING TO GOD THAT THIS SEMESTER BREAK GETS EXTENDED TILL 1ST WEEK OF FEB ATLEAST.🙏🙏🙏 \n\nFrom here I'm gonna type on my own, if this semester break is extended till February, I'd be so fucking glad cuz I want 1 month of rest for my mental stability. Otherwise I'm not ready for this next semester and I'm so fucked up. As I told earlier, 1st 3 sems went really bad and my cgpa is very low. If this next sem starts on 4th Jan then I won't be able to pull up my CGPA. I am deeply saddened to say that PESU doesn't give a fuck about students mental well being, and the biggest irony is having a psychology department in pesu rr. What the hell is seriously wrong with pesu authorities.",
  "metadata": {
    "author": "Educational-Bee608",
    "url": "https://www.reddit.com/r/PESU/comments/18yyhma/extension_of_semester_break_till_february/",
    "permalink": "/r/PESU/comments/18yyhma/extension_of_semester_break_till_february/",
    "score": 1,
    "created_utc": 1704430629,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "kge4noa",
      "body": "Just because you fucked up doesn't mean they would pay heed to your mails and extend till February this was the same number of holidays given in end of 2022 too.\n You want holidays right? At the end of 4th sem they'll give you 2 months of holidays. You are tired i understand but these excuses serve no use unfortunately and please look  into your CGPA only God can save you 🙏🏼🙏🏼. Work hard!! All the best👍🏼👍🏼"
    },
    {
      "id": "kge4yv0",
      "body": "Sorry for the typo, I meant 8th Jan. Even if it is pointless posting this, I just wanted to vent. All I can say is that I just want this semester break to be extended till February. Then I wouldn't think about another sem break extension after this."
    },
    {
      "id": "kge579t",
      "body": "Nah bro they won't because they'll be giving you guys 2 months holidays after 4th sem so it might be worth it hopefully 🤞"
    },
    {
      "id": "kge7mex",
      "body": "Bruh"
    },
    {
      "id": "kgeban5",
      "body": "New copypasta just dropped"
    },
    {
      "id": "kgebj6t",
      "body": "Stfu, I already said that I copy pasted from my message which is already there on discord."
    },
    {
      "id": "kgebn0b",
      "body": "Fuck you if y'all are trolling me for venting here."
    },
    {
      "id": "kgeghd3",
      "body": "Hey, you have 3 more sems to improve your cgpa, take it easy, the college wont change anything, also u aren't in this alone, there will be many people feeling the same.Take it up as a challenge and go strong. In short, the victim mentality won't help anyone and will give self justification for your shortcomings. So.. have whatever fun you want till 8th and properly belt the sem. After 4th sem , you have 2.5 months of break, don't do anything then, just chill."
    },
    {
      "id": "kgegwtf",
      "body": "Thank you"
    },
    {
      "id": "kgejirr",
      "body": "No one gives a fuck about your mental well being, register this in your brain. \n\nDon't run away from challenges atleast this year cmon, face it , talk to people , ask your mentor, your peers, take feedbacks, suggestions and work on yourself. I agree sem can be stressful but there is no alternative"
    },
    {
      "id": "kgetiod",
      "body": "Bro decided to speak facts of all the languages"
    },
    {
      "id": "kgev2q9",
      "body": "Ok"
    },
    {
      "id": "kgfioho",
      "body": "stop complaining man up and learn to fight the situation as it is a simulation for your upcoming career"
    },
    {
      "id": "kgfzkqr",
      "body": "2020 batch people had 4 back to back semesters without any break, you guys are lucky."
    },
    {
      "id": "kghkr77",
      "body": "Honest Opinion: I think it is really easy to score at least a D grade studying in PES. Half of the marks is from the internal assessments. Of the total 50, 25 should be easily achievable considering syllabus is one unit only for each IA and also some assessments which will fetch you easy marks. Scoring 50 out of 100 in esa too sounds achievable, which will get your total score above 50 i.e D grade (This changes because of relative grading). To be honest, even my grades were low initially, so I understand what you are going through, but putting some effort through out the year rather than toiling away only on the last night of the exam will give you better results. Don't think much about mental breaks to relax, you won't get a long break until your even semester ends, so maybe take a week off away from all devices and do something fun and relaxing. Go on a small vacation, roam around Bangalore, go on a drive or a ride and try to come back with a better mindset. Try to push through this semester, it's easier if you do some smart work rather than hard work. Best of luck."
    },
    {
      "id": "kgj8y1f",
      "body": "PESU🤡"
    },
    {
      "id": "kgj9ntd",
      "body": "It was covid's doing."
    },
    {
      "id": "kgq1z24",
      "body": "Thank you"
    },
    {
      "id": "kgq1zo8",
      "body": "Thank you"
    }
  ]
}