{
  "id": "18zdfyr",
  "title": "Can I still get a 9 CGPA?",
  "content": "A small academic flex :). I'm currently in my fifth semester, going to the sixth. Started with a 6.95 in my first semester, but I've comfortably pushed my grades above 8 (slightly under 8.5, goes higher with an S from a 2 credit summer course). Feeling proud of my progress! However, that one bad score continues to nag me.\n\nNow, looking ahead, I'm wondering if there's hope to reach 9 during the 6th and 7th semesters? Please advise me on the same.",
  "metadata": {
    "author": "Conficonfused",
    "url": "https://www.reddit.com/r/PESU/comments/18zdfyr/can_i_still_get_a_9_cgpa/",
    "permalink": "/r/PESU/comments/18zdfyr/can_i_still_get_a_9_cgpa/",
    "score": 1,
    "created_utc": 1704478443,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "kggtbzo",
      "body": "Damm dude definitely possible. Fuck me you're good"
    },
    {
      "id": "kgh98qe",
      "body": "You'll need to work your ass off for 6th sem, it's arguably your last sem and the last chance to massively improve your GPA. 7th and 8th sems although easy, barely contribute in credits so even if you get a perfect 10 you won't see anything more than a 0.2-0.3 increase."
    },
    {
      "id": "kghapjm",
      "body": "Inspiring NGL good job man fr"
    },
    {
      "id": "kghc85s",
      "body": "Damn bro,there should be some 12th fail genre of movie made on you,6.9 in prolly the easiest sem and almost 8.5 cgpa at the 5th. crazy stuff"
    },
    {
      "id": "kghdp7y",
      "body": "Hold on..,i might have exaggerated way too much but it’s actually inspiring for me ngl,cuz i had started with 6.09 and at 7.3 cgpa for now(just passed out the 3rd sem)..,was quite worried if i will be able to cross 8 at the end.,but you just gave the motivation i was looking for,thank you."
    },
    {
      "id": "kgkt5am",
      "body": "can I fuck you?"
    },
    {
      "id": "kgkyzky",
      "body": "Only people with 9+ get that privilege"
    },
    {
      "id": "kh2tr9a",
      "body": "Thank you! That feels reassuring!"
    },
    {
      "id": "kh2uyr2",
      "body": "Thank you so much! And honestly you're doing fine! Working with a goal in mind helps out greatly! Aim for a 10, you'll end up getting less than it mostly but it helps you finetune your mindset. Make sure you take 2 credit courses like CIE and aim for an S in them, they really help! \n\nFor me, the jump in my GPA was due to performing very well in my second semester(9+) which evened my GPA out. Since then, I put more effort into strengthening my basics through projects and working on DSA while maintaining a decent SGPA. Since you're in sem 4 now, make this the semester that raises your grades to a large extent."
    },
    {
      "id": "kh2v0eq",
      "body": "Thank you!"
    },
    {
      "id": "kh2v3hd",
      "body": "What if they had 9+ though?"
    },
    {
      "id": "kh32qvy",
      "body": "Then I'd pull down my pants and bend over"
    },
    {
      "id": "loh4ygf",
      "body": "Bro my sgpa in 1sem is exactly same as you can you give me any advice how to raise and make a come back like you"
    }
  ]
}