{
  "id": "190wvsn",
  "title": "Extremely depressed due to placements - Pls help",
  "content": "Hey everyone. So I'm studying in 8th semester in ECE (classes haven't started yet). I'm not getting shortlisted in any of the companies that come here. Recession has fucked up placements this time. Not even half of our class has been placed. Only two companies had shortlisted me and I lost it in first rounds. Literally no single company has hired anyone more than some 20ish people. They just pick some 5 guys and move on. My cgpa isn't that bad either. Some guys with cgpa in 6s range have got offers and some of them don't even know how to write simple codes, whereas I'm here studying MERN, DSA and yet don't know why tf I'm not getting shortlisted. Don't know what's wrong with me. How many companies visit in 8th sem? Do I still have a chance? Day by day I'm losing hope and getting more depressed and no motivation to study. I have some 6 months left. Please give me your best advice to get a job. I will do anything for that. Can learn anything u guys suggest. Seniors pls help ðŸ™ !!",
  "metadata": {
    "author": "cap_spack_jarrow",
    "url": "https://www.reddit.com/r/PESU/comments/190wvsn/extremely_depressed_due_to_placements_pls_help/",
    "permalink": "/r/PESU/comments/190wvsn/extremely_depressed_due_to_placements_pls_help/",
    "score": 28,
    "created_utc": 1704647487,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "kgr62ij",
      "body": "lets say a student doesn't get placed on-campus, what's the starting salary they could get if they get recruited off-campus approximately?"
    },
    {
      "id": "kgrbe1p",
      "body": "Bro don't worry, there's still so many companies yet to come. Almost all CSE and ECE students got placed in my batch. The only one's who didn't get placed are the ones who had backlogs or went to pursue higher education.\n\nBelieve it or not , it's been almost 2 years since I graduated and I still get mails from pesu placement cell if I am interested in applying for a company that's wanting to hire lol"
    },
    {
      "id": "kgrq0od",
      "body": "Possible communication issue? Try being a better interview candidate by conveying your points better."
    },
    {
      "id": "kgrwrlu",
      "body": "Only advice I can give is don't depend on PES to get you opportunities. Start job hunting on your own. LinkedIn, naukri all that jazz. \n\nOne thing you can use PES for would be interview preparation. Go to placement office (Ec or Rr) and act them for a mock interview. The EC office will entertain you. If they can't, approach any \"veteran\" teacher. It might be an arrow or boost to your confidence. Both are good. \n\nOne more thing, take one day off and use it to calm down/ touch base. Improve your mental health. Nothing will work without a healthy mind. Take time for yourself. You deserve time off and to calm down."
    },
    {
      "id": "kgtyo4k",
      "body": "Generally 3-10 lpa beyond that is extremely difficult in this economy.\n\nIf you have contacts that can give refferal thats a different story"
    },
    {
      "id": "kgtz2go",
      "body": ">Believe it or not , it's been almost 2 years since I graduated and I still get mails from pesu placement cell if I am interested in applying for a company that's wanting to hire lol\n\nI have graduated in 2023 I barely get any mails.\nAlso post dec companies coming to Campus is generally low that's what I observed last year"
    },
    {
      "id": "kgu02i3",
      "body": "OP don't depend on campus placements now start applying offcampus.\n\nMake a ATS friendly resume and start applying and ask for referrals without that it's gonna be incredibly tough.\n\nI am hoping you have an internship .If not start applying for internships . Generally internships are a good shot at conversion to FTE.\n\nAlso don't expect High salaries like 15 20lpa offcampus.\n\nIf you get anything more than 6lpa its good take it and you can negotiate with other companies offcampus unlike on campus.\n\nBut yeah start applying offcampus now if you get oncampus it's well and good but don't completely rely on it.\n\nAlso as I said lower your salary expectations for offcampus I know it sucks but we need to be realistic. In a year or two you can always jump to higher salary. \nIf you get a >6lpa job and you like the domain just take it."
    },
    {
      "id": "kgw0nab",
      "body": "I just checked my mail to check the date for the last email that pesu placements sent. It was 4th december 2023. (And I graduated in 2022). \n\nThe company is \"Aficionado Technologies\".\n\nYou can confirm this with any 2022 graduate ."
    },
    {
      "id": "kh0srfc",
      "body": "Good reply"
    }
  ]
}