{
  "id": "191j7tk",
  "title": "Backlog",
  "content": "If one subject in first semester is failed or backlog in which sem we can take exam and pass it",
  "metadata": {
    "author": "Opening-Mushroom1744",
    "url": "https://www.reddit.com/r/PESU/comments/191j7tk/backlog/",
    "permalink": "/r/PESU/comments/191j7tk/backlog/",
    "score": 3,
    "created_utc": 1704713552,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "kgvs5kl",
      "body": "You shall be able to take it in the next semester and clear it ."
    },
    {
      "id": "kgvsc4m",
      "body": "Bro is it next sem or next year"
    },
    {
      "id": "kgvsfor",
      "body": "Next sem bud"
    },
    {
      "id": "kgvsguu",
      "body": "Thank you 😊"
    },
    {
      "id": "kgvsrw7",
      "body": "Bro if I get Math-1 backlog in first semester can I take exam in second semester"
    },
    {
      "id": "kgvtrju",
      "body": "Yo don't worry so much before the results. When I was in my first year, just after writing the exam even I felt that I would fail. Ended up getting a C. Focus on your next exam."
    },
    {
      "id": "kgvvcx4",
      "body": "You can take any backlog exam every sem until 8th sem(pls don't). You have to register for it in pesuacademy probably a month or two before your esa begins by paying to take the exam. Try clearing it as early as possible while you still remember parts of the subject. Exam dates for backlog exams can be tricky as it can overlap with the esa dates of your current sem( same day 2 exams or one exam the very next day basically). So study way ahead just in case. Atb"
    },
    {
      "id": "kgw49rb",
      "body": "What's the fee for each sub?"
    },
    {
      "id": "kgw5g0w",
      "body": "I think it's 250 per credit, so I think in OP's scenario it should be ₹1000 as maths -1 is a 4 credit course."
    },
    {
      "id": "kh1bzhb",
      "body": "aren't the backlog exams usually conducted either during the 1.5 month break between even sem and odd sem or during the time when our juniors have their exams?"
    }
  ]
}