{
  "id": "192d91g",
  "title": "caught for malpractice",
  "content": "guys i was caught for carrying mobile phone along with me to my math exam and was caught,my paper was taken away and was taken to coe office where they told that only for that subject they put it as TAL and i have to attend a meeting with the officials.Feeling very depressed and extremely tensed.Can any one of u please brief about the whole procedure if one is caught for MPC",
  "metadata": {
    "author": "Puzzled-Stay-6920",
    "url": "https://www.reddit.com/r/PESU/comments/192d91g/caught_for_malpractice/",
    "permalink": "/r/PESU/comments/192d91g/caught_for_malpractice/",
    "score": 62,
    "created_utc": 1704802014,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "kh1izet",
      "body": "I am guessing it won't be brutal considering the recent cases but honestly don't do stupid stuff man"
    },
    {
      "id": "kh1jlj9",
      "body": "were you caught cheating ? or you were caught with phone in your pocket?"
    },
    {
      "id": "kh1jvwd",
      "body": "i was caught cheating"
    },
    {
      "id": "kh1kkub",
      "body": "Let me make it clear to u, u are not special, many others have tried these kind of circus and got caught, who TF takes a phone to copy,I remember once a dude wrote a chit which was as big as those bills.u get from supermarket, atleast be logical when u try something funny"
    },
    {
      "id": "kh1ktf7",
      "body": "Just don't come in the news that's it and it's peace 💀"
    },
    {
      "id": "kh1lf77",
      "body": "I hope you have not cheated, as they will now get the CCTV footage and tried their level best to prove it to your parents that you used your phone, I highly suggest you to stick to the fact that you were not aware of the phone being in your pocket.\n\nIf you did cheat, just tell it, you can't run away from reality now, they will fail you in that subject or make you write it again."
    },
    {
      "id": "kh1oomo",
      "body": "Hey.. Hey .. I have seen this one, this is classic!"
    },
    {
      "id": "kh1paib",
      "body": "?"
    },
    {
      "id": "kh1re1y",
      "body": "A student commited suicide after getting caught with a phone in the exam hall. PES is still being investigated for allegedly pushing the student to suicide. \n\nThe student was Aditya Prabhu."
    },
    {
      "id": "kh1rkgp",
      "body": "Don't worry too much. Above everything remember to tell the truth. Don't be pressured by PES. They DO NOT HAVE CONTROL OVER YOU. They can't mess up your life or anything like that. Don't get manipulated by them and STICK TO THE TRUTH."
    },
    {
      "id": "kh20dhe",
      "body": "I typed something like this and admin removed the comment"
    },
    {
      "id": "kh22lo7",
      "body": "Don't go jumping off anywhere. It's not worth it.\nSetbacks like this barely do damage. Plead your case out, especially if it was an honest mistake. Even otherwise, take the L, wait it out, and move on. \nWorst case you aren't allowed to sit during the placements.\n\nBest case, you move on, you are questioned during the placements, tell them what happened...and hope for the best."
    },
    {
      "id": "kh2fs7t",
      "body": "Yeah I doubt they will use the \"I will mess up your life \"stuff anymore because one more such case and this time it won't be just a random enquiry being closed it will end up even in the very politicians that support them being involved"
    },
    {
      "id": "kh2tj9j",
      "body": "Ye PES is amazingly terrible sometimes but I hope they are least have the sense to change a bit now. Let's hope you're right."
    },
    {
      "id": "kh3c9hx",
      "body": "Dont be the next Aditya Prabhu xD"
    },
    {
      "id": "kh3epxt",
      "body": "Hi! I mean no offence but weren't you the one who posted about the unfortunate soul on r/bangalore?"
    },
    {
      "id": "kh3ere6",
      "body": "Here's a sneak peek of /r/bangalore using the [top posts](https://np.reddit.com/r/bangalore/top/?sort=top&t=year) of the year!\n\n\\#1: [Very serious matter. Posting here for maximum reach](https://www.reddit.com/gallery/154qmcy) | [374 comments](https://np.reddit.com/r/bangalore/comments/154qmcy/very_serious_matter_posting_here_for_maximum_reach/)  \n\\#2: [Ayo when did the Avengers have a battle at commercial Street](https://i.redd.it/mps52flnt15b1.jpg) | [206 comments](https://np.reddit.com/r/bangalore/comments/145f8wj/ayo_when_did_the_avengers_have_a_battle_at/)  \n\\#3: [For God sake.. don't encourage tipping culture in India!](https://np.reddit.com/r/bangalore/comments/13dklq3/for_god_sake_dont_encourage_tipping_culture_in/)\n\n----\n^^I'm ^^a ^^bot, ^^beep ^^boop ^^| ^^Downvote ^^to ^^remove ^^| ^^[Contact](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| ^^[Info](https://np.reddit.com/r/sneakpeekbot/) ^^| ^^[Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/o8wk1r/blacklist_ix/) ^^| ^^[GitHub](https://github.com/ghnr/sneakpeekbot)"
    },
    {
      "id": "kh3j37g",
      "body": "Sorry but saying \"Don't be the next Aditya Prabhu XD\"\n\nIs just low at this point commenting it under this post"
    },
    {
      "id": "kh5x5ip",
      "body": "Phone is not allowed in exam hall. You had it on you. It's a mistake. Admit the mistake and apologize. Accept whatever they say and don't ever repeat it again.\n\nIt's a life lesson brother.. review within yourself why it happened and make sure it doesn't happen again. That's it. \n\nMistakes happen..life gives many many opportunities to correct oneself. To admit the mistake and correct it is the right way to go brother."
    },
    {
      "id": "kh5y45i",
      "body": "most likely they fail u in this subject and it is considered as a backlog..plz don't repeat it"
    },
    {
      "id": "kh5yfwc",
      "body": "Don't worry nothing is going to happen make sure to not keep phone in the pocket..i know that u might not have intentionally done..but the management is strict..about this..so try to avoid this in future."
    },
    {
      "id": "kh67758",
      "body": "It’s over for you time to ropemax (mew when you kys)"
    },
    {
      "id": "kh6mcqv",
      "body": "Update toh dete reh"
    },
    {
      "id": "kh788wf",
      "body": "Holidays incoming?🤡"
    }
  ]
}