{
  "id": "19366fa",
  "title": "Im a first sem CSE student and i have no interest in cs from a long time back, took the branch because i was forced to, how do i go into core ece sector from here and what are my options?",
  "content": "TLDR - Have no interest in cse and hate it alot, even though i can manage the subject, took it because influenced by parents and everyone. I want to somehow continue in the elec domain, how and where do i start and what are my future options  \n\n\nLong rant  \n\n\nBasically had no specific interests till 11th, took sci and cse but hated it, and still managed to byheart my way through the covid era, now i chose cse here because i had no real inclination towards anything and was swayed by everyone's opinion. Personally i hate coding and the subject, even though i can manage it. I am just not interested and i think no amount of influence or debates is gonna change that for me rn.  \nI love electronics and wanted to explore that domain more and go into the core field, even though i may struggle or feel its tough, i have made up my mind and i am 100% fine with it.  \nBut idk where to go from here and where to ask for help, feeling pretty lost.  \nFirst Sem CSE Student here and the esas are going pretty well\n\nDo i like prepare for gate and hope for the best, or try to build up my resume so that i can get placed at a decent company and work my way up from there?  \nOr are these 2 things unrealistic and i go for masters?\n\nIk that if i have to do this maneuver i have to start early and fast cause it is going to be really tough, but im ready for it\n\nIf any seniors or graduates are lurking around here and know about this topic, please guide a lost soul  \nAny criticism or opinions are welcome\n\nPS - Please do not tell me to continue learning CS, i really am not a fan of it and would prefer to rather struggle",
  "metadata": {
    "author": "RevenueConsistent616",
    "url": "https://www.reddit.com/r/PESU/comments/19366fa/im_a_first_sem_cse_student_and_i_have_no_interest/",
    "permalink": "/r/PESU/comments/19366fa/im_a_first_sem_cse_student_and_i_have_no_interest/",
    "score": 10,
    "created_utc": 1704886159,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "kh70te3",
      "body": "Subjects taught in first year is common irrespective of your branch. I assume you can request for a branch change after 2nd semester."
    },
    {
      "id": "kh71u9m",
      "body": "Is branch change not an option?"
    },
    {
      "id": "kh72bup",
      "body": "My cgpa is going to be in 7-ish to 8 max, i dont think that is a possibility for me"
    },
    {
      "id": "kh72cjv",
      "body": "My cgpa is going to be in 7-ish to 8 max, i dont think that is a possibility for me"
    },
    {
      "id": "kh7axob",
      "body": "RR campus ece cutoff was 7ish only last year"
    },
    {
      "id": "kh7d77k",
      "body": "Since you are first year student...so think about getting to your goal in bachelors only. If you start to plan your mtech abhi se, you would waste these 4 years.\n\nIf i would have been in this situation, i would have tried the following\n1. Look for department change\n2. If not possible, look up how much my cse branch overlaps with ece, do those courses with 100% performance. You would have to bear the other cse courses\n3. Think about optionals, is it possible to take ece ones so that you learn more\n4. Start looking for ece internships, maybe paid maybe unpaid, everything works.\n5. Check with your training n placement if they would allow you to sit in ece companies\n6. Start making list of major and minor companies that work in ece\n7. Figure out core interests which the market is expecting you to have to enter this domain\n\nAs far as i know, one of the best companies are nvidia and qualcomm and they do take in cse people. In my experience, cse is always eligible for electronic companies. \n\nEvery bad decision is accompanied by some sort of punishment, you not following your passion has the punishment of bearing your cse courses. Dont blame, dont cry, do everything you can instead of giving up. I really dont want you to waste your coming 3-4 years, and then again 2 years in mtech, in my opinion, if you do the things right way, you can get into your desired interest. Getting into cse isn't that bad."
    },
    {
      "id": "kh7l5va",
      "body": "If you can manage an 8+ CGPA at the end of first year, you have a chance to switch branches"
    },
    {
      "id": "kh7nd18",
      "body": "Have you considered studying/focusing on computer engineering and architecture? Hardware is a very important area that doesn't get a lot of attention. If you're interested in electronics, very good chance that you'll like it. I recommend taking a look at it and seeing what it offers. Your best bet would be to intern at hardware companies and do an MS. ECE degrees in the US are usually electrical and computer engineering (not communication), so you'll get a lot more hardware exposure.\n\nFYI - ECE and EE are the hardest branches, and you'll have to do more than just electronics. The electrical side of things is very challenging. Don't want to discourage you, but as someone who was originally interested in electronics and decided to do CS instead for my undergrad, I'm very happy with my choices."
    },
    {
      "id": "kh8133q",
      "body": "Maybe you can take a minor in electronics?"
    },
    {
      "id": "kh8ro35",
      "body": "7ish is enough to move from CSE to Ec in either of the branches."
    }
  ]
}