{
  "id": "194ej7a",
  "title": "CGPA and marks (CSE, semester-1)",
  "content": "My first semester has gone horrible and I’m pretty sure I’ll get a gpa of 5 or lower. Is it possible to get it to 8.5 or 9 by the end of the course before placements and if so how and what should be my aim gpa for each semester so that it averages out to 8.5 or more. Will having a backlog or two which have been cleared affect my placement eligibility if I happen to get a gpa of more than 8.5 or 9? I know I sound ridiculous to even have the audacity to ask questions like this but help is much appreciated. Thank you.",
  "metadata": {
    "author": "12thFlagbearer",
    "url": "https://www.reddit.com/r/PESU/comments/194ej7a/cgpa_and_marks_cse_semester1/",
    "permalink": "/r/PESU/comments/194ej7a/cgpa_and_marks_cse_semester1/",
    "score": 12,
    "created_utc": 1705012212,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "khgbixm",
      "body": "Very much possible. Get 9.2+ every sem, do well in your summer courses."
    },
    {
      "id": "khgryam",
      "body": "1. Yes it's possible to touch a 9 before placements, you need to score a consistent 9+ every sem until 6th sem (because GPA only until 6th is counted for placements)\n2. Companies (and PES) don't allow active backlogs to sit for the tests. However as far as I remember you are required to upload transcripts when you get your offer letter, so that's when they might get to know."
    },
    {
      "id": "khgxbb0",
      "body": "So does having a backlog and later clearing it affect ur chances?"
    },
    {
      "id": "khgxipn",
      "body": "It mostly doesn't affect your chances. I'm just saying that you can't hide it from your employer."
    },
    {
      "id": "khha1w7",
      "body": "Are there companies with no arrears at all condition?"
    },
    {
      "id": "khhmpbz",
      "body": "While they might not have a condition for it, the job market is really shit right now so you can't predict what can be used to filter candidates."
    }
  ]
}