{
  "id": "195c2a7",
  "title": "Pls answer..",
  "content": "Does doing well in backlog exams improve our cgpa??",
  "metadata": {
    "author": "SprinklesLopsided937",
    "url": "https://www.reddit.com/r/PESU/comments/195c2a7/pls_answer/",
    "permalink": "/r/PESU/comments/195c2a7/pls_answer/",
    "score": 8,
    "created_utc": 1705109836,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "khm03q5",
      "body": "Yes pls someone pls answer i too want to know seniors pls"
    },
    {
      "id": "khm0qi9",
      "body": "Bruh my math went so bad i dont even want to talk about it and getting the same feeling for phy too... I feel so hopeless about my cgpa. its really demotivating to study other subjects too whn your prev subjects dont go well i just feel so hopeless want someone to actually pull me out of this plsss"
    },
    {
      "id": "khm2kju",
      "body": "Dw it will go well"
    },
    {
      "id": "khmbgpr",
      "body": "Someone had mentioned that getting as S in backlog exam is equivalent to getting an E in a regular exam"
    },
    {
      "id": "khmg114",
      "body": "Na it's equivalent to getting C afaik"
    },
    {
      "id": "khmlblp",
      "body": "It will. A backlog means you have an F grade, which corresponds to a 4 point. When you clear a backlog, that grade improves and thus the credit point associated with it also. \n\nNote - as far as I know, you cannot score higher than a C grade in a backlog exam. So the 4 point can only increase to a 7 point at most."
    },
    {
      "id": "khmriol",
      "body": "you wont know how bad it went until you get your results, most subjects might have relative grading and u would get better than how much you expecting so dont think ab it and study well for your next exam else you will regret not giving your everything."
    },
    {
      "id": "khmt5mc",
      "body": "Is this true??😭"
    },
    {
      "id": "khmtcal",
      "body": "Dude do uk how backlog exams gonna be gradded ?? if yes pls ans🤧"
    },
    {
      "id": "khmtpil",
      "body": "Bro i swear i have written jackshit in the paper like filled it with bullshit it would be great if i get 15 😭"
    },
    {
      "id": "khmwmv2",
      "body": "That's good atleast u didn't leave it blank. Trust me I know people who have written the same answer for 4-5 questions and still ending up getting b grade in web technologies (3rd sem)"
    },
    {
      "id": "khmx0jk",
      "body": "Us"
    },
    {
      "id": "khmx472",
      "body": "Phy paper was literally the oppostie of what questions should be thr in it considering pyqs of last 4 yrs.\nIt was a huge F.\nAgree?!"
    },
    {
      "id": "khn5i8m",
      "body": "Ayy how do uk ur a fresher right???"
    },
    {
      "id": "khndlb4",
      "body": "Some seniors have told. They cap the max grade you can score however the max is not E that's for sure"
    },
    {
      "id": "khs86gv",
      "body": "My only request to yall will be plz focus on ur current esa right now, yall didnt even finish ur esa and thinking about backlog exam 💀"
    }
  ]
}