{
  "id": "197cugo",
  "title": "Bubbling q for ESA",
  "content": "I have typed a few answers but I have not bubbled the q no on the answer script. Is that ok? Some ppl are saying that I had to bubble the q no on the answer script even if I had typed the ans. I didn't do that for ISAS but my typed answer still got evaluated.",
  "metadata": {
    "author": "Cheap-Cheek-3546",
    "url": "https://www.reddit.com/r/PESU/comments/197cugo/bubbling_q_for_esa/",
    "permalink": "/r/PESU/comments/197cugo/bubbling_q_for_esa/",
    "score": 2,
    "created_utc": 1705336165,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "khzhooc",
      "body": "No that's bs. You don't have to bubble the ques number if you have already typed it out.\n\nYou're all good"
    },
    {
      "id": "khzidyl",
      "body": "You either type the answer, or bubble it and write it on paper. If you have typed the entire answer, then there is no need for you to bubble it on paper. (and vice versa)"
    },
    {
      "id": "khzige5",
      "body": "If you type you don't need to bubble\n\nChill. If that was the case i would've failed c in first year. I didn't even touch the booklet"
    },
    {
      "id": "khzinbr",
      "body": "Alright thanks"
    },
    {
      "id": "khzinx2",
      "body": "Thanks!"
    },
    {
      "id": "khziu94",
      "body": "Idt I’m gonna touch the booklet in my python exam Tom as well that’s why I asked"
    },
    {
      "id": "khzjral",
      "body": "Most are intuitive but there were few codes that are hard to understand. Mug them up. Remember all patterns and syntaxes. And learn the sort of questions they asked in isas. They will ask questions divided into small one mark questions like you got in isas. Learn how to do those well"
    },
    {
      "id": "khzk3md",
      "body": "thanks sm!"
    },
    {
      "id": "khzkgaf",
      "body": "I was so pissed that day. Many questions were exactly the same as the ones in isa. Learn from me get S grade 😂"
    },
    {
      "id": "m9zy8wd",
      "body": "Hey, i have a similar doubt. During chem Esa, i ran out of sheets so i typed the last two question but didn't bubble the ques no in answer booklet as I didnt have any more pages left. During python esa, we had typed most of the answers but the invigilator had specifically told us to bubble the question as well in booklet which we are typing. Now I am confused whether they would check my typed answer or not?"
    },
    {
      "id": "ma04vkt",
      "body": "If you have typed out the answer then you do not need to bubble the booklet. You can technically write all the answers by typing without even touching the answer booklet"
    },
    {
      "id": "ma0cpc2",
      "body": "okay ty"
    }
  ]
}