{
  "id": "197vci2",
  "title": "How does the grading system work for backlogs? Ik that 100% of the marks are taken from the End Sem exam, but is there a cap for the grade you can score or anything that I'll need to know?",
  "content": "",
  "metadata": {
    "author": "RevenueConsistent616",
    "url": "https://www.reddit.com/r/PESU/comments/197vci2/how_does_the_grading_system_work_for_backlogs_ik/",
    "permalink": "/r/PESU/comments/197vci2/how_does_the_grading_system_work_for_backlogs_ik/",
    "score": 5,
    "created_utc": 1705383743,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ki36jlp",
      "body": "You can score any grads afaik. But not sure if they will do any relative grading or anything"
    },
    {
      "id": "ki36taj",
      "body": "So let's say I flunked maths this esa, but if I get 70+ above in the backlog i write I will get a b grade with a * symbol along it?"
    },
    {
      "id": "ki38jx5",
      "body": "I'm not sure"
    },
    {
      "id": "ki3d2hy",
      "body": "You won't be having internals to be considered for the backlogs so it's just you and the esa paper, whatever you score will reflect at the end of the screen,"
    },
    {
      "id": "ki3ig91",
      "body": "Just think of it as a normal ESA. The paper will have no difference but the marks you score are directly reflected in your grade. Whatever grade u score in the backlog will replace the F in your report card and it'll be like it never even happened. Good luck :)"
    },
    {
      "id": "ki40a65",
      "body": "You clear the paper,it’s as if it never existed and will also increase the gpa,but will be a big problem if you don’t clear it"
    },
    {
      "id": "ki40eb9",
      "body": "You clear the paper it’s as if it never existed and will also increase the gpa,but will be a big problem if you don’t clear it..,idk this is what my senior who’s now in 8th sem told me"
    },
    {
      "id": "l6kpj1q",
      "body": "Will my Marks card for that particular semester appear different from others who cleared it normally? May be will the  data / month of examination be different and indicate that a backlog exam has been taken?. When sitting for placements, will anyone know that a backlog exam was taken for that semester?  \nAlso can I register and write a backlog exam for subjects that I have cleared but want a grade improvement in?"
    },
    {
      "id": "l6lugrv",
      "body": "Yes your marks card for that semester will be different from others. If you write the backlog with your ESA, your marks card will have an extra subject and the grade you get in that subject will also be considered while calculating your sgpa for that semester. It'll not be listed as a backlog, it'll just show up like a normal subject. If you write a backlog is summer and clear it, it'll say summer term exams.When you're sitting for placements, if you've cleared all backlogs, there'll be no difference between u and another person who never had backlogs. It'll get properly added to your cgpa and the only way a company will know about the backlog is if you give them your grade cards for every semester and they see the F. It won't show up as a backlog on your final grade card.At that point, as long as you've cleared it, they won't care. You can take backlog exams only for the subjects in which u got an F. Pes doesn't give improvement exams"
    },
    {
      "id": "l6r6ieg",
      "body": "Thanks"
    },
    {
      "id": "n2n0ncb",
      "body": "Hi! I have a backlog in C so the lab marks are nullified right? And is it still possible to get an S grade based only on the ESA score?"
    }
  ]
}