{
  "id": "1abcv2c",
  "title": "Laptops",
  "content": "What laptop should i buy my budget is 60K but i dont know which one is good  Help me🤧",
  "metadata": {
    "author": "SprinklesLopsided937",
    "url": "https://www.reddit.com/r/PESU/comments/1abcv2c/laptops/",
    "permalink": "/r/PESU/comments/1abcv2c/laptops/",
    "score": 8,
    "created_utc": 1706254299,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "kjmorlz",
      "body": "Literally any laptop at that price range would be good. If you're into gaming get an IdeaPad or something\n\nIf not just any decent looking Dell or hp should be good"
    },
    {
      "id": "kjmspxs",
      "body": "So I usually don't recommend buying one if you're still in first year, since you can usually do with whatever you already have since the requirements aren't extensive. Plus, waiting a little will also give you time to figure out your interests and help you make a more informed decision on the kind of laptop you need to pursue your interests.\n\nHaving said that, if you're looking for a generic purpose laptop with an all-rounded use-case, I usually suggest the following specs - \n\n* Windows laptop so you can dual boot Linux - people have issues running some packages with MacOS. These issues so have workarounds but they're tedious and a hassle. A dual booted Windows runs everything out of the box. \n* Don't compromise on these - SSD, 16 GB RAM, latest gen processor, lightweight laptop, solid battery backup. Theoretically even RAM can be upgraded but ideally you'd want atleast 16 GB. If not, make sure the model supports an upgrade. \n* Things that will depend on your preferences - display size, brand, storage capacity. Choose whichever you like. \n* Optional - an entry level Nvidia GPU. You don't need a powerhouse, an entry level one will do. Although, you can get by without one as well. Don't prioritise this, although if you can get one within your budget, make sure it's an Nvidia only. \n\nWhatever it is, don't buy a gaming laptop (unless gaming is a priority). They are extremely heavy and a pain to carry around, have terrible battery life, and you won't really make use of the GPU power."
    },
    {
      "id": "kjmvqg7",
      "body": "Will the above suit ece students ?"
    },
    {
      "id": "kjmvwi6",
      "body": "I've covered a generic use-case that should theoretically apply to all branches. However, it's best to ask a current final year whether this advice fits. I know it definitely does for CS."
    },
    {
      "id": "kjmwlet",
      "body": "If you can increase your budget to 65k, I will recommend you Asus Vivobook Pro 15 or the latest one, whichever is cheaper. I have this one and it's awesome. \n\nMy laptop specs are- \nAMD Ryzen 7 5800H (8 core) processor with 16 gbs of RAM (clock speed of 3200 MHz), NVIDIA GTX 1650 GPU (basic but a good graphics card), 512 gbs SSD (expandable upto 1 TB). The thing I like about this laptop is that it has and excellent sound quality (has the sound by Harman/Kardon). 1920 X 1080 screen resolution. You will get lifetime MS Office subscription and yeah, pre installed Win11. \nAnd there are some other features as well. This has an OLED version too, but it's costlier. \n\nJust that, the battery life is not the best but it's better than many laptops. \n\nThis has an excellent CPU and a good GPU which can handle much of the workload. I have this Asus laptop, so I don't know much about other company's laptops.\n\nYou can go for a Mac, Ideapad or some Notebooks or whichever laptop you prefer but I would say that you should do some research. Getting a good CPU+dedicated graphics card+ 16 gigs of RAM+ 512gbs of storage (preferably SSD) will be good."
    },
    {
      "id": "kjn50jx",
      "body": "Don't buy hp, it's TouchPad is glitchy and sluggish, and battery dies down fast so you will have to always keep it charging \nVictor/Asus is good"
    },
    {
      "id": "kjn6bqk",
      "body": "Air m1 2020"
    },
    {
      "id": "m7mgy9n",
      "body": "Hey, I'm a 1st year CSE guy. I have enough budget to get a laptop with a decent H series processor with RTX 3050. But since gaming laptops have a lot of cons, I just want to buy a laptop with a U series processor at the same price range.\nCan I get through all the 4 years here with an i7 13th gen U series processor? If not, what will be the major issues I'll be facing?\nI hope u reply tho it sounds a bit silly...."
    },
    {
      "id": "m7r6ga8",
      "body": "Yeah should be fine dude. The performance difference won't really matter too much if you're looking to run things the syllabus needs you to. For more compute heavy loads, you can always use Colab for GPU."
    },
    {
      "id": "m7r6wzq",
      "body": "Alright cool!\nR u comfortable with sharing which laptop u used to carry during ur days?"
    },
    {
      "id": "m7r7g79",
      "body": "The answer would be very irrelevant given that my \"days\" were 6 years ago lol. I had a Lenovo IdeaPad."
    },
    {
      "id": "m7r7pip",
      "body": "Ohh right, Didn't know u graduated 6 years ago lol"
    },
    {
      "id": "m7r7wsv",
      "body": "I graduated 3 years ago man, how old do you think I am 😭\nThe laptop I bought for college was in 2018, which was 6.5 years ago"
    },
    {
      "id": "m7r9zo3",
      "body": ">how old do you think I am\nHonestly,\nConsidering that u have not been infected by Gen Z slang and ur to the point formal replies, I thought u were a pretty old guy 😂. BUT ur knowledge of how things work in PESU wasn't outdated so I finally thought u were one of those guys that graduated around 2 years ago..."
    },
    {
      "id": "mzw9ct1",
      "body": "I have Lenovo IdeaPad 3, intel core i5, 12th gen, 8 gb ram\nIts 3 years old, I'm starting college in a month, will it be okay for a btech cse course?"
    }
  ]
}