{
  "id": "1aenmjz",
  "title": "Suicide isn't an option guys",
  "content": "Just in that a BBA student at ec campus comitted suicide .\n\nAs to why he decided to take the drastic step or whether there is someone else's hand in this is unknown as yet .\n\nPlease feel free to open up guys , your parents are your best friends",
  "metadata": {
    "author": "Annual-Cheek7381",
    "url": "https://www.reddit.com/r/PESU/comments/1aenmjz/suicide_isnt_an_option_guys/",
    "permalink": "/r/PESU/comments/1aenmjz/suicide_isnt_an_option_guys/",
    "score": 94,
    "created_utc": 1706618876,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": true,
    "type": "submission"
  },
  "comments": [
    {
      "id": "kk92dug",
      "body": "ngl this college is prolly responsible for it. How is it that it's ALWAYS PES?"
    },
    {
      "id": "kk92rrb",
      "body": "How messed up does a university need to be for bba students to take this step"
    },
    {
      "id": "kk94fgr",
      "body": "When did this even happen???"
    },
    {
      "id": "kk94t61",
      "body": "Today at about 4:45 Is what I’ve heard"
    },
    {
      "id": "kk950y8",
      "body": "I mean guys sure the upper management is really messed up and only address students to advertise their college but please there’s better ways to get solutions than this…. Please take care of your health"
    },
    {
      "id": "kk95vve",
      "body": "Bruh I was legit in the campus at that time didn't notice any commotion.."
    },
    {
      "id": "kk98ng0",
      "body": "May his soul rest in peace 🙏"
    },
    {
      "id": "kk99eyl",
      "body": "Reason?"
    },
    {
      "id": "kk99g0r",
      "body": "Given that there is no other information available, I want to request everyone to not comment about the management, faculty etc before things are clear. Lets not point fingers before we have a clearer picture. All it does is brew a constant resentment against the University."
    },
    {
      "id": "kk99u3r",
      "body": ">for bba students to take this step\n\nTheir degree is irrelevant in this situation."
    },
    {
      "id": "kk9b8of",
      "body": "With this naive comment I am certain you are a first year, let me open your eyes, no course in the world is easy, you were thaught that commerce kids were dumb when u were in 10th guess what CA is one of the hardest exams in india probably right after upsc\nNo course is a cake walk so mentioning that to sound relevant is really a low move\nFyi I am a engineering student so I am not really defending my course or something"
    },
    {
      "id": "kk9d13v",
      "body": "Fair enough i take that back"
    },
    {
      "id": "kk9fs1w",
      "body": "It's most likely due to the height of the buildings"
    },
    {
      "id": "kk9iic3",
      "body": "This has to stop. What even. Omg. :/"
    },
    {
      "id": "kk9j0ec",
      "body": "Not for everyone, parents are best friends."
    },
    {
      "id": "kk9o8pi",
      "body": "ggwp"
    },
    {
      "id": "kk9r5hs",
      "body": "It’s not about suicide not being an option it’s universities getting away with killing students. I’m so infuriated :/ \n\nUgh. I could only imagine what the students parents are going through. \n\nNo university is fit to function if its environment is pushing its students to commit suicide. \n\nMy heart aches for this :/"
    },
    {
      "id": "kk9suj8",
      "body": "what exactly has led you to the conclusion that the univeristy and its \"environment\" has led to his demise , lets just wait for some solid facts bruh"
    },
    {
      "id": "kk9w2q6",
      "body": "Hey, any update? As to which year, and reason if known ?"
    },
    {
      "id": "kk9zmel",
      "body": "making rounds that its a first year guy , but not confirmed tho"
    },
    {
      "id": "ko87nm9",
      "body": "\"PRIDE OF PESU\" yeah sure"
    },
    {
      "id": "ko8sc7v",
      "body": "Not really, even BMSCE has multiple 7 floor building, but we don't see those there .."
    },
    {
      "id": "ko9boug",
      "body": "He got that flair because he's helped thousands of students understand and go through PES. Shut up clown. "
    },
    {
      "id": "krhteis",
      "body": "It's kinda wild how someone can throw around mean comments left and right, but then gets all shaken up over hearing about a suicide. This isn't just a bit of irony; it's a huge red flag for how fragile and vulnerable they actually are deep down, hiding behind all that tough talk. It really shows a serious lack of empathy, not getting how damaging their words can be until something drastic happens. This should be a massive reality check, a moment to hit pause and think hard about changing. Learning to weigh our words and actually giving a damn about others isn't being soft; it's leveling up as a human."
    },
    {
      "id": "krjphx5",
      "body": "We'll it's reddit , so no body gives a rats ass what you speak here that's the whole point of your identity being hidden ."
    },
    {
      "id": "krkebuj",
      "body": "Just making it transparent who you are\nBehind whatever identity you choose. \nAt the end of the day you are a person and if you feel\nOkay being who you are, then it’s all good, but we both know you go to bed unhappy. Get some help."
    },
    {
      "id": "krkfgzd",
      "body": "What even is your problem 😂, like what relation do you even have with this post ffs , get a life man , no wonder so many people cry about joblessness in India"
    },
    {
      "id": "krkfjnr",
      "body": "Will do :)"
    },
    {
      "id": "krkg96c",
      "body": "🐸"
    },
    {
      "id": "kusuou4",
      "body": "Pes"
    }
  ]
}