{
  "id": "1af6p0b",
  "title": "Backlog exam",
  "content": "I have a backlog in a subject since im in 1st sem phy cycle Will i have a option to give the backlog in nxt sem with the students of phy cycle?? (asap plss..)",
  "metadata": {
    "author": "SprinklesLopsided937",
    "url": "https://www.reddit.com/r/PESU/comments/1af6p0b/backlog_exam/",
    "permalink": "/r/PESU/comments/1af6p0b/backlog_exam/",
    "score": 6,
    "created_utc": 1706667867,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ko8487k",
      "body": "Yes, but clear it in the summer if possible. \n\nAlso these questions are repeated every year, try searching for old posts or even check the [FAQs](https://bit.ly/pesu-faq)"
    },
    {
      "id": "ko8ggsi",
      "body": "Wait so summer backlogs are held before june?? Coz next sem Phy cycle exams are held in june so like will we have an exam before that??"
    },
    {
      "id": "ko8hs1y",
      "body": "You have a delayed semester. It'll happen during your summer break."
    },
    {
      "id": "ko92700",
      "body": "You can give it in next sem, or if the next sem subjects are overwhelming then better to give it during summer break. Because it'll make it difficult for preparation if you give it during your next sem exams."
    },
    {
      "id": "ko92j97",
      "body": "Thank you! And also do you know the maximum grade that can be attained in backlog exam i asked this before but no one seems to have a clear idea🤷‍♂"
    },
    {
      "id": "ko92upp",
      "body": "Yes, there are maximum of grade you can take at once for exams. I'm not sure of the number. Let me get back to you on this."
    },
    {
      "id": "ko939gm",
      "body": "Thank you i appreciate it really!😭 please get back to me abt this..🤧"
    },
    {
      "id": "ko9ec8w",
      "body": "For my batch it was a C grade (2022 outgoing)"
    },
    {
      "id": "kpgrw99",
      "body": "Do prepare carefully. Do not take it lightly, Your correction of papers wont be given any leniency. I have personally given, Math 1 twice to finally pass at the third attempt. Its surprising to see so many people struggling to give a year-1 subject. Very less pass. So be very very careful. Do not shy away from faculty. They will guide you most definitely."
    },
    {
      "id": "kpmqebo",
      "body": "Heyy thank you the thing is its my first time failing and im like depressed frm thn😭"
    },
    {
      "id": "mz03avk",
      "body": "Does it show anywhere if I get back ? Like during placements or anything"
    }
  ]
}