{
  "id": "1afdgxl",
  "title": "How does script review and revaluation work?",
  "content": "Just got my sem 1 provisional results. Wanted to know how the script reviewing and reval process works. How many days to I have to do it? Is it in person or can i see my paper at home? Also, i haven't gotten my final results yet. Should i wait till the final results come out before i do any of this?",
  "metadata": {
    "author": "Cheap-Cheek-3546",
    "url": "https://www.reddit.com/r/PESU/comments/1afdgxl/how_does_script_review_and_revaluation_work/",
    "permalink": "/r/PESU/comments/1afdgxl/how_does_script_review_and_revaluation_work/",
    "score": 7,
    "created_utc": 1706690936,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ko9bg5d",
      "body": "Your final results== provisional results unless you apply for re-evaluation"
    },
    {
      "id": "ko9d2h9",
      "body": "Is there smthng like getting ur fee back if u score x marks more after applying for reval?"
    },
    {
      "id": "ko9dl4f",
      "body": "Your marks don't matter , what matters is whether there is a change in the grade \n\nIf you're grade improves , then yes you get 75% back which makes it 750 rupees"
    },
    {
      "id": "ko9nw2e",
      "body": "Thanks sm"
    },
    {
      "id": "ko9nyly",
      "body": "Also do they tell us how much we got on 100 or do we have to pay 100 bucks to see that"
    },
    {
      "id": "ko9ph3k",
      "body": "Yeah even i'd like to know my marks"
    },
    {
      "id": "koa7qg3",
      "body": "You pay 100 for script review , which means they'll show your paper which also includes your marks"
    },
    {
      "id": "koa83gn",
      "body": "So they don’t tell us our marks unless we pay 100 for script review?"
    },
    {
      "id": "koa8r5j",
      "body": "Yeah you gotta pay in order to view your marks"
    },
    {
      "id": "koaetvw",
      "body": "Bro, did you get a refund ?? Coz I applied for reval and the grade changed a year back (Jan '23). They've been telling they'll give the refund. But nothing has happened yet. \n\nDo u know who to approach for this ??"
    },
    {
      "id": "koaqby2",
      "body": "I didn't apply for re-evaluation last year and therefore didn't get any refund .\n\nHowever , i think you should approach the accounts section and enquire about the same ."
    }
  ]
}