{
  "id": "1ah47vl",
  "title": "Credits",
  "content": "What does cc mean does that mean that the one credit is a part of the five credits?",
  "metadata": {
    "author": "Turbulent-Spinach360",
    "url": "https://i.redd.it/doxcs7awg6gc1.png",
    "permalink": "/r/PESU/comments/1ah47vl/credits/",
    "score": 10,
    "created_utc": 1706882126,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "kolchat",
      "body": "Yes"
    },
    {
      "id": "kolg5bx",
      "body": "How do you have lab and theory credits separate ? \n\nFor us it was always integrated into 5 credits wtf"
    },
    {
      "id": "kollri8",
      "body": "**Category of courses at PES University -**\n\nPreliminary Courses (PC): Preliminary courses enable students by endowing them with skills essential to pursue a given programme of study. Generally, they comprise courses in linguistics, communication, humanities & social sciences, economics, environment, psychology, philosophy, history, law, political science, professional ethics, and so on. Preliminary courses shall be in the range of 3-6% of the total minimum credits for a programme.\n\nFoundation Courses (FC): Foundation courses constitute the fundamental learning of a given programme of study. Generally, they comprise courses such as basic & life sciences, logic & mathematics, statistics & analytics, basic engineering, technical arts and computer programming skills. Foundation courses shall be in the range of 30-40% of the total minimum credits for a programme.\n\nCore Courses (CC): Core courses constitute the core of the programme of study. Core courses shall be in the range of 30-40% of the total minimum credits for a programme.\n\nElective Courses (EC): Elective courses offer a choice of advanced or specialized courses related to the programme of study. They enable students to specialize in a domain of interest or tune their learning to suit career needs and current trends. Elective courses shall be in the range of 10-20% of the total minimum credits for a programme.\n\nInternship, Research or Project Work (PW): These are intended to enhance the student’s practical knowledge and exposure to research and industry. The credits for this category shall not exceed 6-12% of the total minimum credits for a programme.\n\nNon-credit courses: A few courses may not be assigned credits. Such courses shall be referred to as non-credit (NC) courses, and may be mandatory in a programme of study.\n\nCertain programmes of study may have additional requirements such as apprenticeship and residency.\n\nAudit courses :\n\nA student may be permitted to take any number of audit courses over and above the graduation requirements for learning a subject."
    },
    {
      "id": "koouk34",
      "body": "Fun fact - it used to always be like this until 2020 or so when they fused the labs with the theory courses. My transcript has separate lab and theory courses. Looks like they switched back."
    },
    {
      "id": "kop8mgt",
      "body": "damnn , but then in 3rd and 4th sem the lab courses are integrated with the theory ones"
    },
    {
      "id": "koq7znv",
      "body": "It is 5 credit for them also. Just that it shows up seperately maybe for attendance' sake. See the exact same course code. It's still the same 5 credit course. Or atleast that's how it was for us (2022) "
    },
    {
      "id": "koqfax1",
      "body": "Ahh okay okay makes sense"
    }
  ]
}