{
  "id": "1anbmry",
  "title": "Physics cycle(eee sub)",
  "content": "Finding it difficult to understand the eee subject in physics cycle.Is there any good youtube channel for it?",
  "metadata": {
    "author": "Right-Nail-8197",
    "url": "https://www.reddit.com/r/PESU/comments/1anbmry/physics_cycleeee_sub/",
    "permalink": "/r/PESU/comments/1anbmry/physics_cycleeee_sub/",
    "score": 3,
    "created_utc": 1707553335,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "kprgite",
      "body": "Eee is possibly  the easiest 4 credit subject u will get . Just try to focus in class and refer to class notes thoroughly. Only the first unit is a bit tough, after that it gets much easier"
    },
    {
      "id": "kpriuys",
      "body": "Yeah felt that the first unit is a bit tough,was worried if it was gonna be the same throughout.Thanks for the info!"
    },
    {
      "id": "kprk2vu",
      "body": "Watch the pesu academy lectures, Vadiraj sir explains it well, make notes on what he says, it will work out."
    },
    {
      "id": "kprm9og",
      "body": "Thanks for the advice!"
    },
    {
      "id": "kprp8bg",
      "body": "In discord Kruthika Mam's slides r thr, they are super helpful\nGo through them."
    },
    {
      "id": "kprtbom",
      "body": "Watch Neso Academy lectures for unit 1 on YT"
    },
    {
      "id": "kpsjtpg",
      "body": "oh,thanks!"
    },
    {
      "id": "kpsjv1l",
      "body": "Thank you!"
    },
    {
      "id": "kpslhd8",
      "body": "yepp!! also Kruthika maam's numerical slides are good."
    },
    {
      "id": "kpsmi19",
      "body": "EEE is one of those subjects which is kinda tough in the beginning and gets easier over the course of time. I personally found the first couple of units to be tough while the other three were very easy.   \nTo the best of my knowledge, the slides and notes were sufficient for this subject. If you're not able to understand something you can always just go and ask your teacher or look up some yt channels like neso academy."
    },
    {
      "id": "kpt18of",
      "body": "Glad to hear that it gets easier.Thank you!"
    }
  ]
}