{
  "id": "1aob1yt",
  "title": "Whats up with this merit result thingy?",
  "content": "I got a cgpa of 8.35 for my first semester, am I supposed to get anything from pesu? its weird that even my seniors are confused about this.",
  "metadata": {
    "author": "drywater20",
    "url": "https://www.reddit.com/r/PESU/comments/1aob1yt/whats_up_with_this_merit_result_thingy/",
    "permalink": "/r/PESU/comments/1aob1yt/whats_up_with_this_merit_result_thingy/",
    "score": 6,
    "created_utc": 1707666785,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "kpy1le0",
      "body": "You must be getting a distinction scholarship."
    },
    {
      "id": "kpy1tcd",
      "body": "Why question it when you're getting free money lol?\n\nJust search \"pesu scholarship\" on Google. It's a scholarship that you're getting and the criteria can be found on the website"
    },
    {
      "id": "kpy1yoo",
      "body": "whats that"
    },
    {
      "id": "kpy21v0",
      "body": "PESU has 3 main academic performance scholarships/certificates. Now the reason seniors are confused are because (1) they keep changing the names and (2) they keep changing the criteria. So keep things simple, I'll just explain what they were named with what the criteria was for my batch, back when I graduated in 2022:\n\n1. Distinction Award Certificate - a certificate (no money) given to those who cross 7.5 SGPA in a semester\n2. MRD Scholarship - top 20% of a branch by SGPA gets back x% of their semester tuition fee. They also get a certificate for the same. The minimum SGPA for this depends on the last person who is in the top 20% of the branch.\n3. CNR Rao Scholarship - the branch toppers with the highest CGPA in a semester get back x% of their semester fees. They also get a certificate for the same. The minimum CGPA for this again depends on the last branch topper for the branch. If I remember correctly, they only pick the first 10 or so. \n\nIn a semester, you can only be eligible for one scholarship, but you will get certificates for every award you are eligible for. So if you are a branch topper, you would get only CNR scholarship but certificates for all 3. \n\nNow as I said, this was what it used to be in 2022. If someone knows the most updated criteria and names, they can reply to this comment."
    },
    {
      "id": "kpy21vp",
      "body": "lmao i didnt know people under 9 get money. thx tho!"
    },
    {
      "id": "kpy2k1f",
      "body": "damn thats crazy.  Thanks for all that info. pride of pesu indeed"
    },
    {
      "id": "kpy2qyx",
      "body": "If your sgpa is above 7.5 you will get a distinction scholarship which is like a reward of 1000 rs."
    },
    {
      "id": "kpy30y1",
      "body": "They have exchanged the mrd and cnr titles so now mrd is the top scholarship for the top 2% kids with which u get 50 percent of the sem fees back followed by cnr with which u get 40 percent  of the sem fees back for the top 20% kids of the batch. 7.75 + cgpa peeps get distinction certificate with ₹2000"
    },
    {
      "id": "kpy32io",
      "body": "No worries. And to answer your question - with an 8.35 you'll probably get DAC only. If the batch has underperformed greatly, maybe MRD."
    },
    {
      "id": "kpy3f53",
      "body": "Alright. Thanks for the update."
    },
    {
      "id": "kpy3he4",
      "body": "cool cool cool cool"
    },
    {
      "id": "kpy3imy",
      "body": "ah, alright"
    },
    {
      "id": "kpygk7q",
      "body": "Isn't it 7.75?"
    },
    {
      "id": "kpyhcqa",
      "body": "If a student tops in first sem and is eligible for cnr or mrd, and if he tops again in second sem, will he be eligible for above mentioned scholarships again or new students are chosen??"
    },
    {
      "id": "kpyk4s1",
      "body": "Will they contact us or we gotta apply ourselves??"
    },
    {
      "id": "kpyrbpu",
      "body": "Yes, he will be eligible if he has cleared the cutoff cgpa or sgpa for the required scholarship"
    },
    {
      "id": "kpyyqol",
      "body": "Back in my time scholarships didn't have any special registration/application"
    },
    {
      "id": "kq0uhqq",
      "body": "Which means again 40% or 50% fees is returned back??"
    },
    {
      "id": "kq0yfs4",
      "body": "So they emailed you or posted about it in the app? Because I haven't registered an HDFC Bank account with them yet and idk how they would transfer the money if I got it"
    },
    {
      "id": "kq15hja",
      "body": "We would receive a cheque instead. We didn't have the hassle of needing to create bank accounts."
    },
    {
      "id": "kq16d5k",
      "body": "Yes. You're eligible for any scholarship as long as you clear the criteria. There are people who have obtained scholarships across 6/8 semesters in my batch (because you can't get scholarships in the final year)"
    },
    {
      "id": "kq22ltj",
      "body": "What am asking is, if a student gets 40% scholarship in 1st sem n 50% in second sem, then in total 90% of his fees is returned back??"
    },
    {
      "id": "kq2f4ua",
      "body": "Yes, it's from the sem fees which is the half of yearly one"
    },
    {
      "id": "kq2ff9y",
      "body": "40% from the 1st sem and 50% from the 2nd sem and not 90% of the yearly fees"
    },
    {
      "id": "kq2ft4c",
      "body": "We had to create union Bank accounts last year and had to submit a Google form after creating our accounts.After this u will be asked to upload the front page of ur passbook in a drive link every sem whosoever has got a scholarship"
    }
  ]
}