{
  "id": "1aoybwr",
  "title": "Considering Transferring to PES University for BCA - Need Advice",
  "content": "Hey everyone,\n\nI'm currently in a bit of a predicament and could really use some advice. I'm contemplating transferring to PES University for the second year of my BCA (Bachelor of Computer Applications) program. My current college experience has been disappointing, to say the least, and I'm seriously considering a change.\n\nI've heard that PES University is reputed as a good institution, but I don't know much beyond that. Before making such a big decision, I wanted to reach out to this community to gather some insights and opinions.\n\nCan anyone provide me with some firsthand experiences or insights into life at PES University, particularly for BCA students? I'll be living in the hostel, so any information about the campus facilities, academic quality, student life, and overall atmosphere would be incredibly helpful.\n\nAdditionally, if anyone has transferred to PES University or knows someone who has, I would love to hear about your experiences with the transfer process and how smoothly it went.\n\nUltimately, I want to make sure that transferring to PES University is the right move for me before making any final decisions. Any advice or input you can provide would be greatly appreciated!\n\nThanks in advance for your help.",
  "metadata": {
    "author": "Tarun_boy_2004",
    "url": "https://www.reddit.com/r/PESU/comments/1aoybwr/considering_transferring_to_pes_university_for/",
    "permalink": "/r/PESU/comments/1aoybwr/considering_transferring_to_pes_university_for/",
    "score": 7,
    "created_utc": 1707738957,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "kq4txhn",
      "body": "Overall atmosphere is BS. Read about the recent suicides."
    },
    {
      "id": "kq73blh",
      "body": "I appreciate your reply!\n\nAbout Atmosphere I Know About it,But I was just Asking About Opportunities, placements, etc."
    },
    {
      "id": "kq7fzm0",
      "body": "Placements is very good for BTech CS. I've literally not seen any BCA people in placements. If they have placements it is prohibited seperate from the BTech ones. \n\nYou could just call up PES and ask tbh."
    },
    {
      "id": "kq7mxme",
      "body": "Oh I'll Look In it,\nAs Most My State College Lie about These Things (telling  Internship as Placements,or straight up lie)So I Never Thought About giving It a Shot,but I'll try,\nAppreciate Your Response >3"
    },
    {
      "id": "kq7od0t",
      "body": "PES might exaggerate a lil bit. Good luck! Also lots of internships *are* placements. Lots of them are internship+FTE."
    }
  ]
}