{
  "id": "1aqzcjm",
  "title": "3 suicides in the college, what has PESIT done about it?",
  "content": "",
  "metadata": {
    "author": "Other_Scarcity_4270",
    "url": "https://www.reddit.com/r/PESU/comments/1aqzcjm/3_suicides_in_the_college_what_has_pesit_done/",
    "permalink": "/r/PESU/comments/1aqzcjm/3_suicides_in_the_college_what_has_pesit_done/",
    "score": 21,
    "created_utc": 1707948701,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "kqgwm5j",
      "body": "Nothing tbh"
    },
    {
      "id": "kqh02sn",
      "body": "When did the third happen?"
    },
    {
      "id": "kqhqyah",
      "body": "I think it's the one 6 years ago?"
    },
    {
      "id": "kqi49eh",
      "body": "What kind of college is this?"
    },
    {
      "id": "kqi4ao4",
      "body": "3 suicides in the span of 6 months."
    },
    {
      "id": "kqidncg",
      "body": "Around 2 weeks ago."
    },
    {
      "id": "kqif525",
      "body": "What are other colleges doing ? \nThere was a recent suicide in iitr and nothing happened"
    },
    {
      "id": "kqiis8b",
      "body": "Is that supposed to be a defence for pes?"
    },
    {
      "id": "kqil0nc",
      "body": "I am just saying other colleges aren't doing anything either .\nNot defending just stating the fact"
    },
    {
      "id": "kqithf9",
      "body": "Defended themselves and blamed everything on parents"
    },
    {
      "id": "kqiwe9i",
      "body": "Built a gym"
    },
    {
      "id": "kqizrpz",
      "body": "Really? How insensitive?"
    },
    {
      "id": "kqizuva",
      "body": "Exactly 💯"
    },
    {
      "id": "kqj3tvl",
      "body": "My guy, do you have any other work then to sit and defame pes, which college are you from?"
    },
    {
      "id": "kqj490n",
      "body": "That doesn't mean PES shouldn't do anything."
    },
    {
      "id": "kqj4jp3",
      "body": "When iit r ain't doin shit u think pes is gonna"
    },
    {
      "id": "kqj4w0e",
      "body": "I am an alumni of PES, when I was studying in PES, I had also developed suicidal feelings."
    },
    {
      "id": "kqjdu2f",
      "body": "What are some steps which can be taken? This is really concerning"
    },
    {
      "id": "kqje03y",
      "body": "Provide people with mental health or financial or any other problem zero attendence policy."
    },
    {
      "id": "kqje4zl",
      "body": "Provide people with mental health or financial or any other problem zero attendence policy."
    },
    {
      "id": "kqje9ko",
      "body": "The students should come together and lobby for this!"
    },
    {
      "id": "kqke1d3",
      "body": "There are facilities for counselling already set up in the college... After the 1st one the HOD for CSE atleast came to each class to address the issue and reassured that there is someone that we can talk to if anything... What else can they do? Butt into your personal life? You wouldn't like it then would you? It's funny how the same people complain when there are rules to avoid these situations..."
    },
    {
      "id": "kqkej1n",
      "body": "This happened in which campus?"
    },
    {
      "id": "kqkew1d",
      "body": "RR, and also i heard one of the incidents, the second one was cuz of personal matters which the college can't handle? No one would love it if college starts getting into people's life."
    },
    {
      "id": "kqkf7lf",
      "body": "I am DM ing you"
    },
    {
      "id": "kqoozfy",
      "body": "PES is a pretty fucked up place. It's horrible that in one semester, three students have killed themselves on campus. Nobody should be in a situation where they feel like there's no other way out. The college hasn't even officially acknowledged these deaths or changed any of their policies or methods. There's so much unnecessary stuff that goes on in our college like the bouncers cracking down on us like we're criminals. In one of his addresses the VC literally said that he doesn't care about the students, he just cares about how the college is ranked. If you're expecting PES management to care about us, you're gonna be very disappointed. All we can do is look out for our friends and help them out when they're in a bad spot mentally"
    },
    {
      "id": "kqop68c",
      "body": "Who is VC?"
    },
    {
      "id": "kqoqsbv",
      "body": "Don't expect them to do something about it. In the end most colleges only care about their reputation."
    },
    {
      "id": "kqovitu",
      "body": "IKR!"
    },
    {
      "id": "kqsnjrk",
      "body": "The Vice Chancellor"
    },
    {
      "id": "lc7wk4p",
      "body": "This mental harassment was there in 90's as well, not being allowed to write exams due to trivial issues were a common thing, its a Lousy ASS micromanaging place, campus interviews are a scam."
    },
    {
      "id": "lc7wygm",
      "body": "The only reason people join this trash college is because of placements, rest nothing is good, broken equipments in labs, no support in labs, trash student community, just putting ppts during class and not teaching anything."
    },
    {
      "id": "lc7xjxf",
      "body": "I have seen best of the best placed into campus placements into the **worst** jobs in the Industry, eventually draining of their careers, believe me you are better off finding jobs on your own.\n\nPeople who never got any placements are on far better jobs and in better financial states than those who got into campus placements."
    },
    {
      "id": "lc7xvuk",
      "body": "I spent some worst years of my life in this college, couldn't do anything but endure it."
    }
  ]
}