{
  "id": "1arogj5",
  "title": "How often do we have to come to college for 7th sem",
  "content": "",
  "metadata": {
    "author": "pokipokiloki",
    "url": "https://www.reddit.com/r/PESU/comments/1arogj5/how_often_do_we_have_to_come_to_college_for_7th/",
    "permalink": "/r/PESU/comments/1arogj5/how_often_do_we_have_to_come_to_college_for_7th/",
    "score": 8,
    "created_utc": 1708026893,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "kqmvqxn",
      "body": "It all depends on a lot of factors:\n1. Special topic classes won’t be offline or you will need to come to college to give the ISA, ESA and hands on sessions if available. You can take summer courses and later drop equivalent special topics .\n2. Capstone Reviews, you will have around 4-5 reviews for which you have to be present physically .\n3. Placement tests, many companies will have their coding tests or interviews in campus which you will have to visit depending on the number of companies you apply to and when you get placed."
    },
    {
      "id": "kqmzfah",
      "body": "You'll have no classes in 7th sem. You'll have to take up some nptel courses and study on your own at home. As for your capstone project, it depends on your domain and guide. Some guides will ask you to come to clg everyday, some will say 2-3 days a week and most will say u can do it at home. You'll still have to come for the ISAs and ESA for the courses and like 3-4 times a month to meet your guide. So you'll mostly be free the entire semester. 8th sem has nothing of the sort. They'll give you the whole semester free so that you can do an internship. The internship will count for 6 credits. Hope this helps :)"
    },
    {
      "id": "kqnxhxt",
      "body": "Thank you"
    },
    {
      "id": "kqobt8w",
      "body": "Is it the Same for Mechanical Engineering Students??"
    },
    {
      "id": "kqoelrt",
      "body": "What's that Guide thing ??"
    },
    {
      "id": "kqomplh",
      "body": "Your guide will be the teacher that will be in charge of your capstone project(final year project) team. You need to get your idea approved by them, you need to update your progress to them and they will be part of the panel that will conduct your review and give you your grades. Depending on your branch, you will either be assigned a capstone guide or you can choose the guide you want"
    },
    {
      "id": "kqomwkv",
      "body": "Yes, but if your project has a lot of hardware components or if it needs some lab equipment your guide might tell you to come to clg more often"
    },
    {
      "id": "kqsggqj",
      "body": "So, one can choose either capstone or internship ? Or one has to do both ?"
    },
    {
      "id": "kqsjbnt",
      "body": "You have to do both. Capstone will be in 6th and 7th sem and it carries 10 credits total. 8th sem will be for internship. You can claim upto 6 credits for the internship. If you don't get an internship in 8th sem, you can do some online nptel courses and write exams in clg and claim the remaining credits that way"
    },
    {
      "id": "kqslgov",
      "body": "Thank you"
    }
  ]
}