{
  "id": "1aurd97",
  "title": "question for 1st years",
  "content": "do you guys know of anyone who switched branches AFTER bootstrap? Im talking about pessat btw. cause I'd met a guy who was in aiml then but met him a week back and he's now apparently in cse.\nis that possible? did the pessat ranks move up later after bootstrap?",
  "metadata": {
    "author": "sunrise_4567",
    "url": "https://www.reddit.com/r/PESU/comments/1aurd97/question_for_1st_years/",
    "permalink": "/r/PESU/comments/1aurd97/question_for_1st_years/",
    "score": 10,
    "created_utc": 1708359923,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "kr5pk4a",
      "body": "Sometimes there is an extended round after the 2nd round of counseling  in which those who have missed out on a branch by few ranks are called up to tell them that they are selected as some other people might have left the seat."
    },
    {
      "id": "kr5u7da",
      "body": "What if like Just Asking what if he had Got AIML in PESSAT and since CET Counseling still Continues for many Days after PESSAT that guy got vse in KCET and Changed it to CET seat like what if that Happened"
    },
    {
      "id": "kr5uev2",
      "body": "Yeah that's also pretty much possible."
    },
    {
      "id": "kr5v81u",
      "body": "Man request the office once. Many times students join other colleges, leaving behind a few seats. I don't think there's any harm in asking. Or else, you can go the hard route and switch branches after your first year by being in the top 1% of your dept. Again, this method isn't guaranteed to work as it depends on availability."
    },
    {
      "id": "kr5wlt5",
      "body": "ahh ok thanks, is this done discreetly? as in, are only those ranks called and its done in private? cause I haven't heard of a 2nd extended round for pessat"
    },
    {
      "id": "kr5xucg",
      "body": "Yeah those people were just called up and told they were selected last year. Idk about your batch."
    },
    {
      "id": "krbvb2i",
      "body": "This exact thing happened to me. One day my dad got a call from my class teacher and asked if I wanted to change my course to CSE cause they had extra seats. Apparently some committee checks potential candidates and then approves then for course change."
    },
    {
      "id": "kre3y10",
      "body": "Did it happen this year or last year"
    },
    {
      "id": "kret1ja",
      "body": "Last year. During first sem I got shifted."
    },
    {
      "id": "krmbipb",
      "body": "ah ok, what would you mean by \"potential candidates\" though? is it those with close pessat ranks to the cutoff?"
    },
    {
      "id": "krmhubj",
      "body": "I'm not sure what they meant by potential candidate  but my pessat rank defined helped. It was just before cse cutoff."
    }
  ]
}