{
  "id": "1av8r4x",
  "title": "What is the attendance cut-off this year?",
  "content": "",
  "metadata": {
    "author": "tom_petty10",
    "url": "https://www.reddit.com/r/PESU/comments/1av8r4x/what_is_the_attendance_cutoff_this_year/",
    "permalink": "/r/PESU/comments/1av8r4x/what_is_the_attendance_cutoff_this_year/",
    "score": 5,
    "created_utc": 1708403173,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "kr8ybpm",
      "body": "In RRC there was an address given my Jawahar in which he stated that the attendance criteria is reduced to 75%,however he never came to EC campus,so there is a little bit of ambiguity regarding the situation as I myself am from ECC, probably if any RR peeps can help us out?"
    },
    {
      "id": "kr90w3n",
      "body": "Our class teacher said it’s 75%(im in my 4th sem)"
    },
    {
      "id": "kr977qc",
      "body": "Which campus are you from?"
    },
    {
      "id": "kr97pf1",
      "body": "I wish they'd reduce it even further. The late college timings is adding to the stress because of heavy traffic both in the mornings and evenings."
    },
    {
      "id": "kr98c3v",
      "body": "Literally this time change was so fckn stupid"
    },
    {
      "id": "kr9fhgt",
      "body": "I agree"
    },
    {
      "id": "kr9fhsr",
      "body": "I agree"
    },
    {
      "id": "kr9fj8t",
      "body": "I agree I agree"
    },
    {
      "id": "kr9lu4v",
      "body": "Hn"
    },
    {
      "id": "kr9ovi7",
      "body": "75"
    },
    {
      "id": "kr9qybt",
      "body": "The gag is, you're supposed to have a minimum of 75% not only for the ESA but both ISAs. Found out this morning."
    },
    {
      "id": "kr9sjz5",
      "body": "I think this is absolutely ridiculous I've been studying in this college for 3 years now and have never come across such a meaningless rule,either you have heard it from the wrong sources or this college is already on its downtrend"
    },
    {
      "id": "kr9slz8",
      "body": "gian hai aap"
    },
    {
      "id": "kr9snfa",
      "body": "Idk if the rule applies to all departments, but the new B.Com HOD is a waste of life"
    },
    {
      "id": "kraf14x",
      "body": "I've had like 51% and 60% and stuff in my subjects in like sem 4 and 3 and none of my subjects have ever been above 75%. None of my teachers asked me why or cared about attendance. But for CS ppl in my campus, if they have less than 85% they are asked to show some medical certificates and submit an affidavit. So it depends a lot on your HoD. For safety, keep it above 75 and if they ask you, get some fake medical certificates, they're very easy to get"
    },
    {
      "id": "krf9fbn",
      "body": "Apparently this sem it's 75% attendance and they won't be taking medical certificates anymore"
    },
    {
      "id": "lndioth",
      "body": "75% attendance is for full year or 75% in each sem?"
    },
    {
      "id": "lndiq77",
      "body": "Each sem"
    },
    {
      "id": "lndisos",
      "body": "okay, and some comment stated that 85% is minimum for cs ppl?"
    }
  ]
}