{
  "id": "1ayb1un",
  "title": "Plz help..",
  "content": "Which would be better\n\n[View Poll](https://www.reddit.com/poll/1ayb1un)",
  "metadata": {
    "author": "saikishan_a",
    "url": "https://www.reddit.com/r/PESU/comments/1ayb1un/plz_help/",
    "permalink": "/r/PESU/comments/1ayb1un/plz_help/",
    "score": 5,
    "created_utc": 1708720746,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "krtjvp7",
      "body": "Civil toh bikul nahi chm idk maybe if interest is there.Also take Pesu cse only thru kcet.Main campus is challenging to get but EC cse is not hard."
    },
    {
      "id": "krtk2ga",
      "body": "There is no diff in placements right? \nI heard it's pooled?"
    },
    {
      "id": "krtkew4",
      "body": "Yes bro pooled placement.Only difference is clubs in EC is less\nRR has many more clubs."
    },
    {
      "id": "krtknv6",
      "body": "I don't want to take part in clubs. \nI'm an introvert so ec would be great for me."
    },
    {
      "id": "krtlaor",
      "body": "Yes u shd be able crack kcet with under 4k easily with ur percentile try for rvce and pes rr campus fees bhi Kam Hai."
    },
    {
      "id": "krtlhmw",
      "body": "Ok. Bro thanks for your help.."
    },
    {
      "id": "krtlokn",
      "body": "Sure bro tell me what u get.All the best for all other exam."
    },
    {
      "id": "krtlw27",
      "body": "Also ec campus is way stricter than rr, I have a roommate who was in ecc in his first year and now he got rr in 2nd year he was telling me if you bunk classes and sit in cafeteria or something in ecc bouncers ask why are you sitting there and make you to go to class, and there is nothing around the campus in ecc but rr is nearer to other places in the city. I am from rr (CSE) , i would recommend it any day over ecc."
    },
    {
      "id": "krtlwyw",
      "body": "Thanks bro.."
    },
    {
      "id": "krtm9xk",
      "body": "I Will surely consider this.. And try to get into rr campus.. \nThanks for ur help.."
    },
    {
      "id": "krtora9",
      "body": "Happy to help 👍"
    },
    {
      "id": "krvfr1z",
      "body": "Civil/ Chem as a subject will be completely useless unless you care about it. So in that regard PES would be better. \n\n\nHowever, the exposure and opportunities that NIT Surathkal can offer you is leagues and leagues ahead of anything PES can offer. PES is a school. This isn't a \"University\". It's a school that has some clubs on the side. That can be a good thing or a bad thing. That's up to you. \n\n\nPES is a lot more upto date with respect to syllabus. That is one thing I can honestly praise PES about. They are always trying to update the syllabus and change stuff up for the better. That's something NIT Surathkal can't even compete with. \n\n\nTL;DR: NITK gives better opportunities and exposure. PES has better syllabus, upto date subjects and is constantly changing( slightly for the better)"
    },
    {
      "id": "krvhd9v",
      "body": "Thank you bro..."
    },
    {
      "id": "krvw06h",
      "body": "Your asking the question in pesu subreddit, if you ask it in general group like btechards answer would be surathkal civil/chemical anyday\n\nUntil your really into cse that is.....pick nitk anyday over pes"
    },
    {
      "id": "krwllyh",
      "body": "Only through kcet why ? Isn't it worth spending 25-30 lac through pessat ?"
    },
    {
      "id": "krwozu7",
      "body": "Every senior whom I asked said noo.."
    },
    {
      "id": "krx0ivq",
      "body": "I think i can answer this. I got Chemical in NIT Surathkal and i paid the fees and booked that seat. But when i got CSE in PESU i switched here , just because of branch. And i can 100% say that this was the best decision of my life.  The branch matters a lot , everyday i see on the linkedin , Job openings for BTech in CSE , but you will never find a opening like that for other branches.\n\n  \nI am in 3rd year, And i have already completed a internship in US company. Also through campus placements i got a PPO offer + summer internship 2024 in a big US company ( stipend 1lakh+). So i would say if you really work hard in PES, you can get lots of good things from them. The clubs are great (I have gone to IIT Bombay for a competition through my club). Sports facility is great, boys hostel is really fun ( Really costly tho). But the best thing about PES is its located in bangalore, the IT hub of india. You will get lots and lost of opportunity here, i have friend in iit kharagpur, who are still searching for internships. So it really depends on you. I also know people in NIT surathkal CSE who are really struggling to find a opportunity. I would say till now easily 20+ really good companies have come to PES for summer internships ( Which is not happening in Top NITs). \n\n  \nThe seniors are great in PES, i know many seniors doing Masters in US (in top colleges like CMU), they are supportive and helpful. That said this is only my experience in PES, I know people in my class which really hates pes. But it depends on you 100%.\n\n  \nBecause i left the seat after the last round , i lost around 80k Rs but i feel it was worth it. Civil/Chem has no value in the market right now. Go for CSE , or worst case electrical branch. Location of the college also matters a lot."
    },
    {
      "id": "krx4tj6",
      "body": "Thank you for saying all this bro.. This was really needed.. Thanks for your help..."
    },
    {
      "id": "krxb6cs",
      "body": "So which college should I prefer Manipal ?"
    },
    {
      "id": "ks2i1fy",
      "body": "You'd be getting something like BITS or IIITs maybe, check them out, would  be a better option than both of these"
    },
    {
      "id": "ks2j0xj",
      "body": "Sadly I can't afford bits.. And I also talked with seniors of iiits they said to consider iiits as a 2nd option.."
    },
    {
      "id": "ks40ypc",
      "body": "If your income is below 15Lpa and you get 7+ cgpa your fees will be lesser than bits. If it's above 8.5 cgpa then you get 80% scholarship on fees essentially making it very affordable. \n\nSource: me, I study with 80% scholarship here"
    },
    {
      "id": "ks7kngb",
      "body": "What's the hostel fees??"
    },
    {
      "id": "kscrnba",
      "body": "its like 1lakh+ every year, but the food and rooms are really good. 3rd year you can get solo rooms with attached washroom , its really good."
    },
    {
      "id": "ksf4dkm",
      "body": "Mtlb kucch bhi \nBro don't compare any IIT/NIT with a prvt college"
    },
    {
      "id": "ksf4lx4",
      "body": "Bruh...Never lose an seat in a NIT"
    },
    {
      "id": "kshttee",
      "body": "Not comparing, IIT/NIT much better. But yeah branch also matters, but the most important thing is how much you put effort. If you work hard , college/branch all secondary things. "
    },
    {
      "id": "kshuz0b",
      "body": "Still i would say if u get an IIT or NIT \nOne must not leave it"
    },
    {
      "id": "kst8sh0",
      "body": "Join NIT K \nTry to do well in your first year and switch streams if civil/chem doesn't interest you. I've heard we can switch streams in IITs based on GPA not sure about NITs"
    },
    {
      "id": "kst8tsx",
      "body": "PES is nowhere close to the standards of nitK"
    },
    {
      "id": "kstaxz2",
      "body": "There was this option till last year... From last year they removed the provision of department change.."
    },
    {
      "id": "kstb171",
      "body": "Can you elaborate plz..."
    },
    {
      "id": "kt7n5sb",
      "body": "how much for solo rooms  per year ?"
    },
    {
      "id": "kt96cnk",
      "body": "Most of the NITs removed branch change policy from last year itself. It was until year before last."
    }
  ]
}