{
  "id": "1az2eh4",
  "title": "GUYS GET READY FOR GRAVITON 2.0",
  "content": "🌌🚀 Calling all quantum enthusiasts! 🚀🌌 \n\nJoin us for the first hackathon of QForest : Graviton 2.0 - Quantum Hackathon!!\n\nGet ready to quantum leap into the future!\nDate: March 7 and March 8, 2024\nVenue : MRD Auditorium, PES University, RR campus, Bangalore\n\n\nThis isn't just any hackathon – it's a gravitational pull towards boundless innovation. Are you ready to:\n➡ Quantum leap into a superposition of possibilities: Tackle real-world challenges with solutions that defy classical logic and harness the power of entanglement.\n➡ Form fermionic friendships: Collaborate with fellow quantum pioneers and lay the groundwork for groundbreaking research.\n➡ Elevate your career to new heights: Seize stellar prizes and propel yourself into the quantum spotlight, reaching scientific singularity.\n➡ Connect with quantum luminaries: Network with industry leaders and navigate the quantum landscape towards the forefront of knowledge.\n➡ Win exciting cash prizes and rewards\n\nSave the date, fire up your quantum processors, and brace yourselves for a journey beyond imagination! We'll be unveiling quantum updates as intricately entangled as the particles themselves.\n\n🔗 Registration link :\nhttps://forms.gle/5BGLD7yGnjwwo3aW6\n\n📞 Contact, for any queries: \nTaha Burhanpurwala - +91 81978 95253\nSarah Tabassum - +91 77957 86813\nAchyuth - +91 9448826746\nTanya N - +91 7483976380\n\n\nWe're here to guide you through the super positional adventure of Graviton 2.0! ⚛ Let's embark on this quantum odyssey together! ",
  "metadata": {
    "author": "PuzzleheadedSpite274",
    "url": "https://i.redd.it/64hftgxrzkkc1.jpeg",
    "permalink": "/r/PESU/comments/1az2eh4/guys_get_ready_for_graviton_20/",
    "score": 9,
    "created_utc": 1708801362,
    "flair": "Club Announcement :snoo_smile:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ks3vu98",
      "body": "Hey, admin, Thanks for posting this here!!!"
    },
    {
      "id": "ksd6ncx",
      "body": "can peeps from other uni participate aswell"
    }
  ]
}