{
  "id": "1b2cyoj",
  "title": "What is the KCET cutoff for AI/ML in RR campus and what all scholarships are there",
  "content": "",
  "metadata": {
    "author": "maddy_126",
    "url": "https://www.reddit.com/r/PESU/comments/1b2cyoj/what_is_the_kcet_cutoff_for_aiml_in_rr_campus_and/",
    "permalink": "/r/PESU/comments/1b2cyoj/what_is_the_kcet_cutoff_for_aiml_in_rr_campus_and/",
    "score": 5,
    "created_utc": 1709143967,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "kskkl3t",
      "body": "Bro trust me don't take aiml. Unless you benefit from the location of the campus or something, like I do, stay away from aiml. Just take cs in ec campus \n\nThey are literally making up the courses as the semester starts. And the topics are harder than cs."
    },
    {
      "id": "ksobo0p",
      "body": "Computer Science (with specialisation in AIML)this is the degree right ? So most of the courses will be overa lapping na ? And the placements will be common right ?"
    },
    {
      "id": "ksoc1g4",
      "body": "If u take AIML that locks you into roles that are focused only in AIML. You will be missing out on all the other branches of computer science. \n\nThey course is 1/2 years old. Nobody can tell you how much overlaps with Computer science because the course subjects are not yet decided. \n\nPlacements will probably be common. This won't mean that companies will treat AIML the same as CS. Companies can directly block any branch besides CS from trying for their exams."
    },
    {
      "id": "ksoc66x",
      "body": "Can I DM you got some doubts"
    },
    {
      "id": "ksocb40",
      "body": "Sure"
    },
    {
      "id": "ksod7ri",
      "body": "Correct. The degree says cse(aiml)\n\nFirst year is same for all\n\n\nFirst year is common \nIn second year there are a total of 3 subjects which are different, out of the 10 subjects in both semesters\n\nThe aiml subjects have everything that the cs ones have plus more, so you won't really be missing out on any knowledge. \n\nWe were told placements are common yeah"
    },
    {
      "id": "ksogopn",
      "body": "By common placements I meant all the companies visiting PES (like apple atlassian Adobe )which offer huge CTC will they allow CSE with AIML guys ?"
    },
    {
      "id": "ksohj27",
      "body": "You can't read their mind lol. My friends in other colleges said that they do allow all cs branches and even ece, but not lower. So almost surely yeah, but again they can technically do whatever they want"
    },
    {
      "id": "ksomven",
      "body": "Thanks please check your DM"
    },
    {
      "id": "ksoo0fe",
      "body": "I joined this year and it was 28xx for GM in second extended round"
    },
    {
      "id": "ksood8d",
      "body": "What about first round"
    },
    {
      "id": "ksopnsx",
      "body": "I don't remember but you can check all previous year cutoffs at kea website"
    }
  ]
}