{
  "id": "1bah7rl",
  "title": "Dude am I fucked up???",
  "content": "Okay so pessat in coming up. I gave boards last year and scored 93 and I have all my 12th notes plus ik a little of class 11 Chem. Are 40ndays enough to Crack pessat guys?????\nI really want this college and want cse💀💀😭😭",
  "metadata": {
    "author": "blackdarkness04",
    "url": "https://www.reddit.com/r/PESU/comments/1bah7rl/dude_am_i_fucked_up/",
    "permalink": "/r/PESU/comments/1bah7rl/dude_am_i_fucked_up/",
    "score": 10,
    "created_utc": 1709989241,
    "flair": "PESSAT",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ku2dhx4",
      "body": "Get off reddit and study idiot"
    },
    {
      "id": "ku2eim5",
      "body": "I got into pes by complete fluke. I had basically failed all entrance exams and had given up and decided to study Cs business systems in VIT. I wrote pessat as a joke and got CS. So let me tell you something somehow works out in the end. For now just enjoy studying for 40 more days and take what you get."
    },
    {
      "id": "ku2f7eq",
      "body": "Stop Posting here and you'll have enough time:))"
    },
    {
      "id": "ku2v240",
      "body": "Try to revise all your topics in like 10 days and try to give to as many as kcet/comedk/bitsat mocks"
    },
    {
      "id": "ku2zj3q",
      "body": "What major are you applying to?\nCuz some my friends got in just with a single round of interview, no entrace was conducted."
    },
    {
      "id": "ku30sow",
      "body": "I'm applying for btech so I have to give pessat"
    },
    {
      "id": "ku3r5yw",
      "body": "I guess it’s time to lock your phone away and study. Practice a lot you still have 40 days"
    },
    {
      "id": "ku6uv4a",
      "body": "Bro PES isn't even that great to fuck your mind over. Go study fool."
    },
    {
      "id": "ku7eeah",
      "body": "I needed to hear this shit too  ."
    },
    {
      "id": "kuck3vm",
      "body": "Why don't you try kcet ?"
    },
    {
      "id": "kuckejw",
      "body": "Because I'm not a karnataka resident"
    },
    {
      "id": "kuckfhr",
      "body": "Comedk ?"
    },
    {
      "id": "kucki5z",
      "body": "I'll give that too but I want to go to pes so thts why"
    },
    {
      "id": "kuckjv4",
      "body": "Okay, good luck."
    },
    {
      "id": "kucl54q",
      "body": "However I suggest studying abroad instead. If you can afford fees through pessat, it's not very high compared to the university fee in countries like Canada, Singapore or USA. Indian universities except for iits, nits and iiits aren't really worth it."
    }
  ]
}