{
  "id": "1bb7o64",
  "title": "Regarding placements: DSA or Dev?",
  "content": "Heyo!\n\nAs the new placement season is approaching, what'd you guys recommend to focus on? DSA or Development?\n\nWhat do companies generally prefer in interviews & rounds? And how's the scenario of Aptitude?\n\nThanks!\n",
  "metadata": {
    "author": "noob_youtuber",
    "url": "https://www.reddit.com/r/PESU/comments/1bb7o64/regarding_placements_dsa_or_dev/",
    "permalink": "/r/PESU/comments/1bb7o64/regarding_placements_dsa_or_dev/",
    "score": 15,
    "created_utc": 1710068048,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ku7j075",
      "body": "dsa - leetcode easy to medium..very important to crack intervies if u are aiming for T1 companies..(most of them ask for dsa)..regarding development...u can crack companies offering 10 lpa + (but it depends on luck sometimes) and which domain r u interested in"
    },
    {
      "id": "ku7khhg",
      "body": "So, max companies (T1+T2) ask for DSA in most of the rounds, right?"
    },
    {
      "id": "ku7n069",
      "body": "It should be a combination of both, you need to have decent knowledge of dsa to clear coding and interview rounds. You need to have 4-5 good projects which you can put on your resume. You can never know what they’ll ask in interviews."
    },
    {
      "id": "ku8248g",
      "body": "Thanks🥲"
    },
    {
      "id": "ku84tan",
      "body": "Not really. Interviews tend to be about your projects, expertise and the company. They will ask DSA but that's usually for one round max."
    },
    {
      "id": "ku8aavc",
      "body": "So, focusing on both and diving deep in development, too, is a must, I guess... how's the scenario of MERN in placements these days btw?"
    },
    {
      "id": "ku8b8xd",
      "body": "Diving deep in the subject of your liking/expertise is very good. \n\nDon't have too much info on MERN but I have seen plenty react dev roles."
    },
    {
      "id": "ku984q2",
      "body": "Thanks, buddy!!"
    },
    {
      "id": "kud28l6",
      "body": "Keep development in resume and DSA on fingertips"
    },
    {
      "id": "kuhvox5",
      "body": "Thanks :)"
    },
    {
      "id": "lp6qvxk",
      "body": "But if I have no tech projects in my resume... will they ask only DSA then?"
    },
    {
      "id": "lpa61nf",
      "body": "wdym you have no projects? Dude you need to have 3-4 projects in your resume, what did you do in your engineering then?"
    },
    {
      "id": "lpa8u4g",
      "body": "I'm a fresher🫠... I just wanted to know whether DSA is enough cause I'm in ECE. So along with the other projects in ECE i have to do a few Tech projects as well ryt?"
    },
    {
      "id": "lpa9n9s",
      "body": "It’s good if you have a few projects in hand, have one web dev, one ML based and a database based one to start with. DSA is not the only requirement, interviewer can ask anything from DSA, your core subjects(CN,OS,DBMS etc), resume related etc.."
    },
    {
      "id": "lpaa1eh",
      "body": "Got it. Thank you"
    }
  ]
}