{
  "id": "1bg6vgd",
  "title": "I got 93%ile in jee mains which courses can I expect through the jee mains score counselling of pes",
  "content": "and should I give pessat or go with my jee mains score only??",
  "metadata": {
    "author": "prince_maxtern",
    "url": "https://www.reddit.com/r/PESU/comments/1bg6vgd/i_got_93ile_in_jee_mains_which_courses_can_i/",
    "permalink": "/r/PESU/comments/1bg6vgd/i_got_93ile_in_jee_mains_which_courses_can_i/",
    "score": 4,
    "created_utc": 1710598041,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "kv52ikx",
      "body": "ece"
    },
    {
      "id": "kv5h0ax",
      "body": "Give pessat too it's gonna be easier anyways"
    },
    {
      "id": "kv5ub52",
      "body": "is ece worth the fees??"
    },
    {
      "id": "kv62mtk",
      "body": "It's 4.2lpa, Totally unworthy."
    },
    {
      "id": "kv6e15s",
      "body": "cant u do both?"
    },
    {
      "id": "kv6e2r4",
      "body": "isnt it the best option if u dont have anyhting else?"
    },
    {
      "id": "kv6gcmf",
      "body": "If u elaborate wdym by 'anything else'(wch colleges) I can try to explain in accordance to that.\nAnd the placements for ec in pesu is shit.\nNot only ec, it's like for any other branch than cs it's not upto the mark.\nU search in this sub with 'pessat' post flair, u may get ans to most of ur qs."
    },
    {
      "id": "kv6yjna",
      "body": "No, dont come to ECE. Choose CSE."
    },
    {
      "id": "kv8ovqk",
      "body": "yea but will I get cse that's the point"
    },
    {
      "id": "kv8udw5",
      "body": "i have around 94%ile rn and i dont have any clgs rn so kcet/bitsat/pessat/comedk are prolly my only options since i didnt prep for 2nd attempt due to boards + im also looking at some german clgss with english programs but its unlikely ill get in but its prolly cheaper than pes thru pessat"
    },
    {
      "id": "kv9eetl",
      "body": "I don't think you will get ECE with 93%ile I think you will get mechanical"
    },
    {
      "id": "kva30ar",
      "body": "Preference of exams(imo): Bitsat,Kcet,comedk/pessat.\nIdk about German thing sry.If u fck up bits and kcet and u really want to get into pes, write pessat,but do it if u wanna join for CSE (fees is 4.8 and it's not worth,I'm talking abt the worst case possible),don't join for other branches.If u r not stick onto pes, write comedk and try for RV, BMS,Msrit.\nAnd I have heard that msrit has its own exam, so look into that"
    },
    {
      "id": "kwr7fjm",
      "body": "if i say my preparation for jee mains is around 85-90%ile, do you think i will be able to crack pessat with a good score to get cse if i focus a lot (i didnt study much earlier)"
    },
    {
      "id": "kwrqw9p",
      "body": "Pessat is cbse level, or a very bit higher. If you put in efforts doing a lot of mcq questions it is highly possible"
    },
    {
      "id": "kwrt6ln",
      "body": "alright, thankyou so much!"
    }
  ]
}