{
  "id": "1bgt7as",
  "title": "KCET CUTOFF",
  "content": "The KCET cutoffs I've seen/asked have been pretty varied, some websites seem to be showing below 1200 for a CS seat (RR campus) meanwhile I know some seniors who got in with high 2000's ranks.\nThe official cutoff, atleast what I assume it is (Picture attached) seems to show a cutoff of somewhere around 3000.\nIve gotten 293+ in my PCM and get consistently 110+ in KCET mock tests, what are the chances I can get a AIML seat in RR Campus",
  "metadata": {
    "author": "Choice-Remarkable",
    "url": "https://i.redd.it/acpf7f3n0voc1.jpeg",
    "permalink": "/r/PESU/comments/1bgt7as/kcet_cutoff/",
    "score": 21,
    "created_utc": 1710666115,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "kv9g5qq",
      "body": "Category?"
    },
    {
      "id": "kv9gh3j",
      "body": "General, Doubled?! Didn't know about that\n\nDo you think the cutoff for AIML will be higher than CSE this year?"
    },
    {
      "id": "kv9gkm5",
      "body": "For general, you need around 1800 according to last year cutoff, to get aiml at rr.."
    },
    {
      "id": "kv9h2me",
      "body": "Where'd you get that rank from, because according to the picture  attached to the post it shows like 4000 or somthing"
    },
    {
      "id": "kv9h5t9",
      "body": "Their was a time during 2005 or so, PES University (Ernst while PESIT) had cuttoff ranks like \n\n170 (EC), \n\n350 (CS), \n\n700 (IS), \n\n1200 (TE), \n\n3500 (ME/EE), \n\n6500 (BT)\n\nThis made PESIT an elite institution during those days ! \nIt’s sad to see some random Tom, harry with 10K rank and above getting admitted to the college under general quota."
    },
    {
      "id": "kv9h6j1",
      "body": "Please review the general category for the cutoffs in the attached image, as the ones shown are for other categories."
    },
    {
      "id": "kv9hgju",
      "body": "Why do you think the college has degraded during these years?"
    },
    {
      "id": "kv9hijp",
      "body": "Ah alright my dumbass thinking 1G was the general category, my bad"
    },
    {
      "id": "kv9hjxp",
      "body": "It s still under 1000 for cse in pesu please check ur facts."
    },
    {
      "id": "kv9hmf9",
      "body": "Lol, K\n\nWith the increased number of seats (literally doubled), I believe the cutoff is going to decrease."
    },
    {
      "id": "kv9iafy",
      "body": "it hasn't , it has expanded hence more students intake.. and students from reserved catergory have also increased hence you will see 10k etc ranks in merit list"
    },
    {
      "id": "kv9ifkz",
      "body": "Alright yeah makes sense, how do you think the college life is in pes. You think it's comparable with other colleges or more on the stricter side."
    },
    {
      "id": "kv9ikwm",
      "body": "Yeah I know the placements are pooled but I think RR is just slightly better when it comes to college life and Hackathons/clubs (according to my seniors)"
    },
    {
      "id": "kv9imat",
      "body": "Like school."
    },
    {
      "id": "kv9iom2",
      "body": "Nothing new?"
    },
    {
      "id": "kv9ix1e",
      "body": "Hey, what do u think about the doubling of seats? Do you think it will lower the quality of placements, or do you think the college will strive to bring in more companies for placements?"
    },
    {
      "id": "kv9iyy0",
      "body": "Engineering colleges share the same culture... its no better here.. but the assessments are peace, professors are good, labs are good. And most important, you will find like minded peers and having such high intake , you can network with lot of people, seniors as well"
    },
    {
      "id": "kv9j8ra",
      "body": "Alright good to know, thank you"
    },
    {
      "id": "kv9kdmq",
      "body": "Lower but if have decent knowledge and gpa you will get a good placement."
    },
    {
      "id": "kv9khi0",
      "body": "A good gym maybe and some good clubs like chess dance and all."
    },
    {
      "id": "kv9wxx0",
      "body": "Hey has the seats for pessat also doubled from this year ??"
    },
    {
      "id": "kv9za8r",
      "body": "Yes!!"
    },
    {
      "id": "kvagovu",
      "body": "Im 2026 batch, ours was 720 for cs and ~200 for aiml. What is it now?"
    },
    {
      "id": "kvagybw",
      "body": "I wouldn't trust any source other than the actual government PDFs you get"
    },
    {
      "id": "kvah47y",
      "body": "There is an RR vs EC campus comparison post in the FAQ: https://bit.ly/pesu-faq"
    },
    {
      "id": "kvah4xl",
      "body": "Btw I'm still an aspirant...\nIn the website it's mentioned\n720+720\n480+241\nRr   + ec"
    },
    {
      "id": "kvahh8r",
      "body": "Yeah it's identical to ours. Except 240 aiml students from both campuses each"
    },
    {
      "id": "kvb3f3g",
      "body": "EC at 4K \nAnd mech at some 15K ??\n\nLike seriously, this generation has ruined everything"
    },
    {
      "id": "kvbbknf",
      "body": "There's 480 AIML seats in RR campus?"
    },
    {
      "id": "kvbbnb8",
      "body": "Yes.."
    },
    {
      "id": "kvbdhmd",
      "body": "What is the KCET-PESSAT split of the 480 seats"
    },
    {
      "id": "kvdnomu",
      "body": "Where are you getting this info of doubled? From what ik there is an increase in AIML seats, no change in CS, in total it's nowhere near double"
    },
    {
      "id": "kvegbcs",
      "body": "It's not GM."
    },
    {
      "id": "kvegegx",
      "body": "60% PESSAT 40% KCET"
    },
    {
      "id": "ky6l9ep",
      "body": "Bro i couldn't register in kcet 😭 i want to go Bangalore to study bse nursing is there anyway I can join a college without kcet"
    },
    {
      "id": "layeoub",
      "body": "Do you think the cutoff would increase this year for CSE? I have got 3020 rank-2A. Last year's cutoff was 3080.Can I get a seat in CS?"
    }
  ]
}