{
  "id": "1bhk8os",
  "title": "Summer holiday(4th sem)",
  "content": "I am confused whether i should try to do internships or do Dsa & Web development during the holidays.  I personally feel like i should just improve my coding skills in these holidays",
  "metadata": {
    "author": "Several_Appearance78",
    "url": "https://www.reddit.com/r/PESU/comments/1bhk8os/summer_holiday4th_sem/",
    "permalink": "/r/PESU/comments/1bhk8os/summer_holiday4th_sem/",
    "score": 9,
    "created_utc": 1710743653,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "kvehyvl",
      "body": "It's very hard for a 4th sem student to get a summer internship. I'd recommend working on understanding computers and understanding how code works and spend some time making a project. \n\nIf u get an internship opportunity go for it, don't expect one tho. \n\nMost important. Take time to rest. Your mind and body deserve time off."
    },
    {
      "id": "kvemomz",
      "body": "Did you get any internships during those holidays?"
    },
    {
      "id": "kvemym9",
      "body": "I don't think we had those holidays 💀(covid nonsense). If we did, I don't recall getting any internships. \n\nI got one in the 6th sem holidays."
    },
    {
      "id": "kvfizda",
      "body": "If you are looking for internships in the summer as a 4th sem student, then the best bet is to get in touch with the various labs on campus for summer internships since companies will not recruit anyone before they complete 6th semester (startups might differ). CDSAML, CCBD, and other labs often hold summer internships, but these are all research based fellowships.  Apart from on campus labs, other major T1 colleges like IITs, IIITs and even IISc hold summer research fellowships. They can provide a nice experience if you are interested in academia, or even if you want to try it out for a bit. I would suggest trying it out for the experience, but note that your experience will greatly depend on (1) the prof who is your advisor and (2) the project you get assigned to. Worst case, you can always contact any prof on campus and ask if they are willing you take you in on any of their ongoing research efforts.\n\nThese are some of the ones I know about:\n\n* [https://www.iiitd.ac.in/placement/summer-internships](https://www.iiitd.ac.in/placement/summer-internships)\n* [https://academics.iitd.ac.in/srf/](https://academics.iitd.ac.in/srf/)\n* [https://surge.iitk.ac.in/dates.php](https://surge.iitk.ac.in/dates.php)\n* [https://sun.iitpkd.ac.in/](https://sun.iitpkd.ac.in/)\n* [https://srip.iitgn.ac.in/info/wp-content/uploads/2024/01/SRIP-23012024.pdf](https://srip.iitgn.ac.in/info/wp-content/uploads/2024/01/SRIP-23012024.pdf)\n* [https://sfp.iitm.ac.in/](https://sfp.iitm.ac.in/)\n* [https://cds.iisc.ac.in/call-for-cds-summer-research-internship-2024/](https://cds.iisc.ac.in/call-for-cds-summer-research-internship-2024/)"
    },
    {
      "id": "kvfkvae",
      "body": "OP u/Several_Appearance78 , this is great advice. Use these links!"
    }
  ]
}