{
  "id": "1bn3oji",
  "title": "Does PESU reimburse CAPSTONE research conference fees?",
  "content": "I recently spoke to 2 seniors, and they claimed to be paying up to 9k to get accepted into some online conference. Does the university reimburse the fees? Or does it depend on some metrics like the quality of your work or something?",
  "metadata": {
    "author": "randomsurfering",
    "url": "https://www.reddit.com/r/PESU/comments/1bn3oji/does_pesu_reimburse_capstone_research_conference/",
    "permalink": "/r/PESU/comments/1bn3oji/does_pesu_reimburse_capstone_research_conference/",
    "score": 11,
    "created_utc": 1711336396,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "kwft8dh",
      "body": "Not if you're in electrical."
    },
    {
      "id": "kwfusk0",
      "body": "Yes, had mine reimbursed 2 years ago."
    },
    {
      "id": "kwfwhjz",
      "body": "If you're in CS, then it will depend on the conference, the quality of your work and also your capstone guide. Apparently getting reimbursed is easier now than it used to be a few years ago."
    },
    {
      "id": "kwg1e1h",
      "body": "Check with your capstone guide if they can pay for it. Then it's their headache to get it reimbursed from college. I've had my guide pay for it and get it reimbursed very quickly as compared to the other students getting it reimbursed."
    },
    {
      "id": "kwgtxrb",
      "body": "Our conference cost was about 34k and we all of it reimbursed in 2 weeks after filing for reimbursement"
    },
    {
      "id": "kwguqds",
      "body": "We had to pay 500 dollars for the conference and we’ve now applied for reimbursement. There are friends of mine who even paid around 70k for this and they got it back. It’ll take time but you’ll get it back mostly.\nPaper carries 2 credits in the final sem. So make sure you publish it."
    },
    {
      "id": "kwlui10",
      "body": "In our case, 4 of us attended and presented at the conference but only one person's registration fee got reimbursed. Which is fair imo."
    }
  ]
}