{
  "id": "1bouto3",
  "title": "Hostel/College rules for girls",
  "content": "I wanted to ask the situation of hostels in PES uni for girls, what is the curfew? Is there a dress code that needs to be followed on campus, and is it applicable inside hostel as well? \n\nAre the rooms good/worth it? Are two sharing rooms available and do they have attached bathroom or shared for the whole floor?\n\nIf anyone knows any info about the quality and life in the pes girls hostels please please help me out :') \n\nThank you so much!!\n",
  "metadata": {
    "author": "coldcoffee_allday",
    "url": "https://www.reddit.com/r/PESU/comments/1bouto3/hostelcollege_rules_for_girls/",
    "permalink": "/r/PESU/comments/1bouto3/hostelcollege_rules_for_girls/",
    "score": 7,
    "created_utc": 1711519489,
    "flair": "PESSAT/Admission",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "kwrkooe",
      "body": "There are a lot of previous posts about this such as [this](https://www.reddit.com/r/PESU/s/ohzVPDoRJQ). You can search this sub and find the posts. \n\nIt's also easier to find information if you ask seniors on PESU Discord."
    },
    {
      "id": "kwrn96c",
      "body": "I'm not a girls hostel student and hence I cannot answer all the questions. However, my girlfriend is in Girl's hostel and the hostel curfew sucks. It's at 7PM from Monday to Saturday and 8PM on Sunday. It's hard to get permission to come late and there's quite a bit of beaurocracy to obtain the permission. You have to put attendance everyday and obtain permission from local guardian if you have to go back home ( Local guardian is a relative who lives in the city and is above the age of 35).\n\n  \n\n\nThe food is not great either. I have heard many girls complaining about the food. There are 4 hostel Units, with the closest one being 1.4km from the college. Buses are provided to and from the college.\n\n  \n\n\nI would suggest living in a PG close to college, there are quite many PGs near the college."
    },
    {
      "id": "kwrs69e",
      "body": "Thank you so much that helps a lot 😭"
    },
    {
      "id": "kwruqor",
      "body": "Hi, can you provide an invite link to Pesu discord? The ones that I click on say its expired"
    },
    {
      "id": "kxdtdt0",
      "body": "most of the people who i talked to in christ. people suggest to instead opt for a pg near the college."
    }
  ]
}