{
  "id": "1bpzlgl",
  "title": "Pessat fee seat without exam.",
  "content": "Can anyone help me getting seat in pes with pessat fee quota I will give them commission if needed my budget is around 5 lakhs per annum n I am not confident of getting pessat or any other exams please help me out",
  "metadata": {
    "author": "Resident_Mark_2338",
    "url": "https://www.reddit.com/r/PESU/comments/1bpzlgl/pessat_fee_seat_without_exam/",
    "permalink": "/r/PESU/comments/1bpzlgl/pessat_fee_seat_without_exam/",
    "score": 1,
    "created_utc": 1711642805,
    "flair": "PESSAT/Admission",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "kwz4g99",
      "body": "Dude, there's still time for entrances. Your time and efforts are better spent focusing on your prep rather than having unrealistic ideas like this. \n\nThe only way you can get into PES is either through KCET, PESSAT, JEE Mains or management quota, each of them having their own respective fees. Nobody can just offer you a PESSAT fee seat out of nowhere."
    },
    {
      "id": "kwz5jh7",
      "body": "Hardly 20 days for kcet bro daily anxiety n stress is killing me, with infulence you can get with pessat fee soo just trying for that\n\n\nI am a dropper n I had a health issue soo\nI am not even able to sleep for an hour a day "
    },
    {
      "id": "kwz6re0",
      "body": "I'm sorry to hear about your health issues and I hope you get better soon but it doesn't change the fact that the only way to get a PESSAT seat is to give the PESSAT exam. Every person who gives the test is given a rank and only they can participate in counseling. Unless you find a way to magically assign yourself a rank without appearing for PESSAT, the only way you can pay your way into PES is by opting for management quota. \n\nThat's the harsh reality, whether you like it or not."
    },
    {
      "id": "kwz926e",
      "body": "Bro last year one of my classmate had a contact with bjp mla his one call to the officials got him a seat in pes. They changed his rank to top 100 bro, after entering to the college there were many such things it seems he had informed me many students just don't tell it out but that's the reality, my friend is not able to help me out bcoz off the elections, he told me that If we have any contacts with the senior  officials in pes things work out soo I am just asking out everyone soo that it would he helpful.  Please don't take we wrong the managemt fee in banglore is very high literally not affordable since I have taken drop I wanted a better college soo. If possible someone please help"
    },
    {
      "id": "kwzi1op",
      "body": "if you’re budget is 5 lakhs pes management electrical, mechanical and bio tech is 5 lakhs"
    },
    {
      "id": "kwzjdif",
      "body": "Such things doesnt exist bro...please start studying"
    },
    {
      "id": "kwzp8b2",
      "body": "nah my friends mom had her colleague pull some strings with PESU management, he got a payment seat which costed as much as a PESSAT seat with 1 lakh prepayment to book the seat, and they said they'll rig his pessat rank accordingly to make it look legit\n\nhe was decent anyways and made it via KCET thru some quota so he wouldnt lie about this either\n\nif you still think pessat is fair idek what to say man"
    },
    {
      "id": "kx0msjg",
      "body": "Pes’s at is super easy, just study an hour or two a day. I don’t think anyone would just give you a seat unless you have personal connections"
    },
    {
      "id": "kx23cgy",
      "body": "Yha I heard many cases like this but not able to get that contact though "
    },
    {
      "id": "kx4mu62",
      "body": "Such things don't exist only Hardwork is the way out don't believe these Bullshit."
    }
  ]
}