{
  "id": "1bqccrq",
  "title": "Pessat mca",
  "content": "Hi guys I'm appearing for pessat this year for mca . As there is only interview idk how they ask the questions and what are the syllabus. I saw one video on YouTube but I think I need more data to process . Any mca students can you kindly  guide me to it",
  "metadata": {
    "author": "pradeep__d_7",
    "url": "https://www.reddit.com/r/PESU/comments/1bqccrq/pessat_mca/",
    "permalink": "/r/PESU/comments/1bqccrq/pessat_mca/",
    "score": 3,
    "created_utc": 1711674428,
    "flair": "PESSAT/Admission",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "kx20290",
      "body": "they ask pretty simple questions, like what are arrays, linked lists and such. it's pretty easy to get in even if you don't prepare\n\nhowever, join PES only if it's your last choice\ncolleges ke rvce, Christ, BMS and dsu are better choices"
    },
    {
      "id": "kx21c42",
      "body": "How is the placements and the classes bro?"
    },
    {
      "id": "kx24sw9",
      "body": "placements, are terrible\n\ni heard that only 10 were placed in their entire batch\n\nclasses are fine"
    },
    {
      "id": "kx2t91v",
      "body": "That's really bad . I heard many good placement reports online and I applied there 🥲"
    },
    {
      "id": "kx3bvgi",
      "body": "not even 10% placement in the current batch XD"
    },
    {
      "id": "kxaq56c",
      "body": "Bro are you saying regarding the MCA placements from PES ??"
    },
    {
      "id": "kxcxdnr",
      "body": "yup"
    },
    {
      "id": "kxyo9pv",
      "body": "what about bca? is christ better than pes for BCA?"
    },
    {
      "id": "kxyoirx",
      "body": "yup"
    },
    {
      "id": "kxyopcw",
      "body": "are u currently studying in pes? what makes you say that"
    },
    {
      "id": "kxyoyid",
      "body": "I've studied in both the colleges, talking from first hand experience 😂"
    },
    {
      "id": "kxyp5a6",
      "body": "oh god💀\ni’m kinda confused tho can u assist me if that’s possible.\ndm?"
    },
    {
      "id": "kxyp71u",
      "body": "yeah sure"
    },
    {
      "id": "l8ebbso",
      "body": "Bro I have dm you needed some information if you get the time then please reply."
    },
    {
      "id": "mlo17yk",
      "body": "my self suhail want to take admission in pesu i want to know about placement i am from delhi and i explore bennet university noida i am confused what i do what i choice bennet or pesu"
    }
  ]
}