{
  "id": "1bs6azk",
  "title": "Is Aatmatrisha always better than Maaya?",
  "content": "Title says all...been to both, one had better singer and better artists. Why so?",
  "metadata": {
    "author": "abcdev081",
    "url": "https://www.reddit.com/r/PESU/comments/1bs6azk/is_aatmatrisha_always_better_than_maaya/",
    "permalink": "/r/PESU/comments/1bs6azk/is_aatmatrisha_always_better_than_maaya/",
    "score": 17,
    "created_utc": 1711877006,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "kxdkx8t",
      "body": "RR Campus just gets more budget hands down. This is cuz there's just so many more people at RR campus and generally the \"higher ups\" at PESU favor the RR campus over EC. \n\nTo be honest both fests are really bad compared to what other universities do."
    },
    {
      "id": "kxdm6qq",
      "body": "like what other univ? name them."
    },
    {
      "id": "kxdpor9",
      "body": "As my flair says, I am a fresher and I really don't know if it's true but I've heard that we lost two big sponsors. One of the sponsors backed out because of the incident which happened during the maaya week and the other sponsor was red bull and they wanted to postpone the event for some reason and our clg management denied and they too backed out.\n\nSeniors can confirm.."
    },
    {
      "id": "kxdptpv",
      "body": "What incident occurred during the Maaya week?"
    },
    {
      "id": "kxdq55o",
      "body": "Not just fests , for management ECC is just a cash cow with dumb kids without any infrastructural development at all , been here for almost 2.5 yrs and all we got was a freaking MRD and they trashed out the whole campus , can't believe these bloodsuckers charge the same fees for both the campuses considering the sheer discrimination and maldistribution of funds."
    },
    {
      "id": "kxdq5xz",
      "body": "Redbull? DAMN. Also what happened during Maaya ?"
    },
    {
      "id": "kxdxr6h",
      "body": "Ye it's a shame. Let's hope the next batches at least have the campuses cleaned up more (w.r.t construction crap)."
    },
    {
      "id": "kxdyjj3",
      "body": "I've gone to 4 or 5 fests from other universities. \n\nI remember the BIT and BMS (or BMSIT don't remember) fests were much more fun and far less \"policed\". I don't remember which other universities exactly but it was probably msrit and maybe jss or one of the christian universities. Don't remember exactly tbh. From what I remember one of them was on par with aathmatrisha/ maaya and the rest were far better."
    },
    {
      "id": "kxe8j92",
      "body": "A student committed suicide at the start of maaya week"
    },
    {
      "id": "kxeywjs",
      "body": "Atleast you guys have fests 🤡"
    },
    {
      "id": "kxfvpp5",
      "body": "As far as I know redbull backed out because they wanted a specific performer who wasn't available that week (not sure how true this is)\n\n[Also a fresher ]"
    }
  ]
}