{
  "id": "1bs82hf",
  "title": "how is bsc psychology in pes",
  "content": "my main aim is christ but i also applied fror pes.idk why but i want to know how are the proffesors,students and the course bcus pes is majorly a  engineering institiute.  i also got a call from pes saying that i dont need to give pessat. is it bcus less student enrolled??",
  "metadata": {
    "author": "pulthekit",
    "url": "https://www.reddit.com/r/PESU/comments/1bs82hf/how_is_bsc_psychology_in_pes/",
    "permalink": "/r/PESU/comments/1bs82hf/how_is_bsc_psychology_in_pes/",
    "score": 3,
    "created_utc": 1711884036,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "kxdwxm0",
      "body": "Hey even I was looking for a college for B.Sc Psychology for a relative...Can you tell why you chose Christ ? I've heard both good and bad about it, also any alternatives ?"
    },
    {
      "id": "kxe7ts0",
      "body": "I haven't yet gotten admission but i chose Christ bcus christ is one of the best college for Psychology.Its one of the demanding courses in Christ so there is alot of competition to get a seat.From the people i have talked to they have said its hectic and its depends person to person if they can cope up.They expect you to take part in both academics and extra curriculars.You can check out the r/Christ University subreddit for more info.In Bangalore,Mount Carmel is a good alternative.If you are looking outside Bangalore too then delhi University,St Xavier's mumbai, Fergusson College are good alternatives too."
    },
    {
      "id": "kxe89hq",
      "body": "I have also applied in other Psychology courses in Christ"
    },
    {
      "id": "kxihmtw",
      "body": "from what ive heard, its fairly new and it does have scope, even in PES because they've increased the number of seats provided from 200 to 300 this year. you can check out the instagram page, they have psychathons, guest talks and other events, so i dont really think its as bad, plus the curriculum is updated unlike christ which has a more traditional approach."
    },
    {
      "id": "kxorp2l",
      "body": "Can you connect me with someone who is already studying psychology there??"
    },
    {
      "id": "kxtk2e8",
      "body": "NEVER JOIN PES FOR PSYCHOLOGY IT'S HELL HERE. You can try for Christ, Ramaiah or Manipal"
    },
    {
      "id": "kxtk6o7",
      "body": "An advice from someone who's studying here NEVER JOIN THIS COLLEGE FOR PSYCHOLOGY"
    },
    {
      "id": "kxtkafz",
      "body": "Oh wow why??"
    },
    {
      "id": "kxtkgdh",
      "body": "I am anyways treating the pes university interview as a mock interview"
    },
    {
      "id": "kxtkgqa",
      "body": "Yeah...can you tell why?"
    },
    {
      "id": "kxtkms0",
      "body": "My main is christ and manipal"
    },
    {
      "id": "kxtko6l",
      "body": "Can you tell why tho?? If you aren’t comfortable you can tell in dms"
    },
    {
      "id": "kxtkyz8",
      "body": "DM?"
    },
    {
      "id": "kxtl07h",
      "body": "Yea"
    },
    {
      "id": "kxx1wy9",
      "body": "could you please tell me why as well, if you don't mind?"
    },
    {
      "id": "ky59s20",
      "body": "Could u elaborate on that mate? Im thinking of applying to pes for that same course"
    },
    {
      "id": "ky59vog",
      "body": "Dm me as well??"
    },
    {
      "id": "l0pf9zl",
      "body": "hey dm me As well plz...!"
    }
  ]
}