{
  "id": "1bvptrg",
  "title": "How is PES engineering",
  "content": "Is it worth? Is it too strict ? Can I join there? Say me how is the college life",
  "metadata": {
    "author": "rajkumar_ennum_naan",
    "url": "https://www.reddit.com/r/PESU/comments/1bvptrg/how_is_pes_engineering/",
    "permalink": "/r/PESU/comments/1bvptrg/how_is_pes_engineering/",
    "score": 4,
    "created_utc": 1712243914,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ky0zhxs",
      "body": "Not worth it"
    },
    {
      "id": "ky10xxs",
      "body": "Don't come please you'll find something better\nIt's toooooo overcrowded"
    },
    {
      "id": "ky160bn",
      "body": "Dont"
    },
    {
      "id": "ky18s4n",
      "body": "Be specific"
    },
    {
      "id": "ky195j6",
      "body": "[Here is a comprehensive list of pros and cons](https://www.reddit.com/r/PESU/comments/13ygg68/comment/jmmro6e/)."
    },
    {
      "id": "ky1a9kp",
      "body": "That's not appropriate to the question"
    },
    {
      "id": "ky1pdov",
      "body": "Best in class"
    },
    {
      "id": "ky1vaqg",
      "body": "Do you want to commit suicide due to horrible management? Do you hate your life? Then join here"
    },
    {
      "id": "ky20mk7",
      "body": "It's a good last option if aren't  getting into iits, nits,bits nothing more nothing lesser than that and that too only for cs"
    },
    {
      "id": "ky2exec",
      "body": "Be respectful to your seniors /s...but actually be a bit humble when asking people for things...you will have a better success rate"
    },
    {
      "id": "ky421av",
      "body": "Thiss"
    },
    {
      "id": "ky476y3",
      "body": "Guys please go through the sub, search your questions once before posting them, most of them will be answered before."
    },
    {
      "id": "ky47fn9",
      "body": "State your options in hand"
    },
    {
      "id": "ky4c9rv",
      "body": "Ill say as an alumni, the college and campus life is 0, -ve infact. If you get Manipal go there"
    },
    {
      "id": "ky4lyao",
      "body": "Shit"
    },
    {
      "id": "kyagnj6",
      "body": "I wasn’t rude btw….I just made an impression of specificity of the text that has been answered for the question I had made to add more details"
    },
    {
      "id": "kyf4ng0",
      "body": "Not worth, but fine if you have no better options\n(iits, nits, bits, iiits, manipal, thapar, rvce, daiict, coep, and few other state clgs"
    },
    {
      "id": "mj4zel5",
      "body": "I did my MBA in this college and I must accept that it was worst 2 academic years in my life and don’t even talk of faculty here especially Suman Rajesh. She carries hell lot of attitude and of course she doesn’t have anything in head expect shit. We also had someone called Uma Chinchane who was just out of college and utter waste. She used to just read out stuff from books and nothing else. Obviously department is not professional nor do they groom you to work in corporate. They carry ego including college dean there. In fact, they are like local Mandya dons there. It so happened that something was out of syllabus in exam and I raised the issue so I was called to the office was told I would be detained if I raise such issue. I was like what the…. If you guys are looking for a better college especially for MBA then this is not the one you’ll should be joining. "
    }
  ]
}