{
  "id": "1bwfpoi",
  "title": "Which club should I join to socialize with people, find people with similar interests, and work on projects and seminars? I’m terrible when it comes to being social.",
  "content": "",
  "metadata": {
    "author": "No-Put7320",
    "url": "https://www.reddit.com/r/PESU/comments/1bwfpoi/which_club_should_i_join_to_socialize_with_people/",
    "permalink": "/r/PESU/comments/1bwfpoi/which_club_should_i_join_to_socialize_with_people/",
    "score": 6,
    "created_utc": 1712316722,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ky5um02",
      "body": "Apply for ACM when the recruitments open up. If you want to get into tech, work on some personal projects starting now. You'll gain experience and will also make a great point during recruitments. ACM is the most fun, non-toxic, and smart people filled club there is in the campus. Although we don't do many events externally, we do many internal events and they are all amazing. You'll also get access to join AIEP (ACM Industrial Experience Program) where you'll get to work with industry experts on a project of your choosing. \n\nApart from ACM, Avions (The flight club), Hackerspace, are also good options. \n\nJoining a club wouldn't be your only answer to solving your social issue. Networking is a very important thing. There are also events outside of PES (meetups) that you can join. A great one is Foss United's monthly meetups. You'll find great people and amazing talks hosted here. You can find information about them [here](https://fossunited.org)\n\nI hope to see ya in these clubs and the meetups!"
    },
    {
      "id": "ky7145w",
      "body": "I wasn't in this club, but PES Innovation Lab is a pretty good place to network and work on projects, and host events, etc etc. Had an opportunity to interview but I backed out because of other clubs I was a part of. I dont think its easy to get in, my friends were lab heads and I know the process has always been rigorous, but its one of those few tech clubs in campus where the takeaways are immense."
    },
    {
      "id": "kybb2gl",
      "body": "I would say join clubs that you relate to, PES has a lot of clubs for multiple interests and stuff\n\nOnce you join a club you like and relate with its interests, I am definitely sure it will be easy to socialize."
    },
    {
      "id": "kylj9v7",
      "body": "If you don't wanna work in something technical, try joining equinox. It's a very chill and fun club and you can organise an ideathon every year called space race also. It's pretty fun. The quiz club is also very cool"
    },
    {
      "id": "kyma258",
      "body": "adding on : Its not a club, its more like a lab actually. It's definitely worth joining PIL ,especially if you are in 2nd sem or 4th sem now"
    },
    {
      "id": "kyqjo9m",
      "body": "Join pixels, you’ll get to do the most networking there as you basically get to interact with every other club on campus"
    },
    {
      "id": "kyqlow1",
      "body": "Thanks, mate!\nI forgot to mention I’m looking for info for the RR campus, \nI’m sure Someone might find this info useful who relates to EC campus."
    }
  ]
}