{
  "id": "1bxznws",
  "title": "Choosing Between RV, VIT and PES University for BTech: Which One Offers Better Placements and Student Experience?",
  "content": "I’m torn between RV, MSRIT, VIT and PES University for my BTech. How do their placements compare, especially with PES’s placement? What are the restrictions like at each university? Could anyone share insights on the pros and cons, including internship opportunities? Is the student community at PES as friendly as they say? Also, I’ve heard rumors about PES being a ‘strict college’—is that true? Lastly, which campus of PES is better: Ring Road or Electronic City?",
  "metadata": {
    "author": "i_nithinsudhagar",
    "url": "https://www.reddit.com/r/PESU/comments/1bxznws/choosing_between_rv_vit_and_pes_university_for/",
    "permalink": "/r/PESU/comments/1bxznws/choosing_between_rv_vit_and_pes_university_for/",
    "score": 15,
    "created_utc": 1712479417,
    "flair": "PESSAT/Admission",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "kyg1n8r",
      "body": "Most of your questions about PES can be found in the compiled FAQs: https://bit.ly/pesu-faq\n\nThe 2024 placement stats were posted here sometime ago and someone commented about it as recently as last week. If you search, you'll find the post. Pros and cons, opportunities, comparison between campuses etc are in the FAQs. There are numerous posts on how rigid and strict PES is. Just scroll and you'll find good content lol.\n\nAs for the student community: it's one of the best there is. This large subreddit and the 4500+ member active discord server are proof. For the number of assignments and other shit we have throughout the semester, we PESts somehow find the time to remain active on social media and create strong student communities lmao."
    },
    {
      "id": "kyg3ioj",
      "body": "Same q but refrain from msrit rest I want to know too"
    },
    {
      "id": "kyg4y9r",
      "body": "Why ? Is MSRIT not good?"
    },
    {
      "id": "kyg5d9x",
      "body": "dont join msrit and vit, pes join main campus… rvce also is good in terms of college placements. But for college life vit and pes are great. Pes is strict, yes but not like dumb strict. ID card and stuff are common, and theres like lot of hackathons events talks and stuff. Vit also has big and huge events but its just too overcrowded"
    },
    {
      "id": "kyg5esg",
      "body": "From what I have heard they don't have good placement and all"
    },
    {
      "id": "kyg5x2z",
      "body": "what I heard was pes doesn’t have a good college life"
    },
    {
      "id": "kyg5y21",
      "body": "Choose rv or pes (I would prefer rvce). Good edu and your biggest advantage is a smaller cohorts (rv I think is smaller than pes). The advantage of a smaller cohort is that it is a bit easier to get industry projects and research collaboration with your profs (due to lesser competition). This is very helpful if you want to do masters as you will have great projects/research and lors."
    },
    {
      "id": "kyg63b1",
      "body": "Also what's the total cost incuding hostel for cse or ece..."
    },
    {
      "id": "kyg647d",
      "body": "im from pes, I enjoy my time a lot. The key is to make great friends. The rest gets along"
    },
    {
      "id": "kyg91if",
      "body": "Very very subjective statement"
    },
    {
      "id": "kygule4",
      "body": "VITian here, I've heard a lot about the active community you guys have. Boy am I jealous"
    },
    {
      "id": "kyh0ad6",
      "body": "Choose Rvce over other options \nMain reason is the much smaller crowd\n\n\nPes has 2.5k cse kids and seats are exponentially increasing every year\n\n\nVit has 7k cse kids and hella crowded.... \n\n\nMsrit is mehh, overhyped clg( not crowded though) "
    },
    {
      "id": "kyhijy1",
      "body": "How are placements at MSRIT ?"
    },
    {
      "id": "kyhmc1d",
      "body": "Well, msr and bms never disclose any stats, so no one knows\nShud be less then other clgs here( not sure) "
    },
    {
      "id": "kyhne6o",
      "body": "Have seen the spreadsheet tho \n70-80 offers in recession year were above 17 LPA \nHow many students are in MSRIT tho ?"
    },
    {
      "id": "kyi1unx",
      "body": "RV is starting to lose their smaller cohort advantage nowadays with 700+ across cs and allied branches, PESU is actually able to pull a lot more number of companies in absolute numbers to make up for the huge cohort size(although percentage placed is definitely a little worse than RV right now) but with RV also expanding numbers that might not be true- depends on if RV can also scale placements. I’d say do more research into this OP. Honestly other than the cohort size problem PESU CS> RV CS. But that does also happen to be the bigger issue with many more downstream issues, so worth considering."
    },
    {
      "id": "kyjuvgz",
      "body": "No Fests, and very minimal cultural activities"
    },
    {
      "id": "kyl3zh3",
      "body": "In my experience, the cse students have had it better compared to other branch students for most things. College life in general was bad though because PES followed the 5 ISA scheme, but now they've brought it back to the 2 ISA scheme, so it might be better.\nBut again, I'd not recommended PES because of the number of students and the immense competition for every single thing, and also the politics here is much worse imo."
    }
  ]
}