{
  "id": "1by3e2v",
  "title": "I need guidance and support as to how do I just pass this semester without any backlogs.",
  "content": "I am in Physics Cycle rn, and due to my negligence (I hold myself accountable), I don't remember anything and do not seem to understand anything in class. I have no friends to talk to about this, since they are already way ahead in syllabus.\n\nI just need a roadmap as to how do I study each subject so that I do not get backlogs. I deserve to be worried and depressed, but I can't seem to find a way out of it. \n\n(My ISAs went horrible, and I do not know what to do)\n\n\nPlease help. I am willing to slog day in and day out for this.\n\n\nMy professors are horrible but I do not want to blame them for my performance.",
  "metadata": {
    "author": "f_-society_",
    "url": "https://www.reddit.com/r/PESU/comments/1by3e2v/i_need_guidance_and_support_as_to_how_do_i_just/",
    "permalink": "/r/PESU/comments/1by3e2v/i_need_guidance_and_support_as_to_how_do_i_just/",
    "score": 7,
    "created_utc": 1712493127,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "kygm9lv",
      "body": "Due to extreme nervousness, I can't seem to register and remember anything i try to study"
    },
    {
      "id": "kyh6hst",
      "body": "Hey, the first step is acknowledging that you need to do better and be accountable for your performance. So you're already on step 1. \n\nEveryone has a different way of studying, everyone performs differently and everyone grasps concepts at a different rate. Comparing isn't ideal here since what works for your friend might not work for you. Similarly, following a roadmap blindly might not help either because you need to figure out which approach works best for you. \n\nIf you aren't able to understand concepts in class, then you're going to have to put in extra effort at home to learn whatever you're unable to. But first, spend a little time trying to figure out *why* you aren't able to learn something: lack of interest, tough subject etc. Once you do that, figure out how you can break down this problem. If the subject is boring or difficult, push yourself by studying it a little everyday so you don't have to study large portions before a test. Consistency with little effort everyday is sometimes easier than sporadic attempts at finishing the syllabus overnight. \n\nBack in my 6th(?) semester when I had OOADSE, which was basically a theory packed course in which the only thing being tested is your ability to memorise, I would spend 15-20 mins everyday studying a little bit of the syllabus, or revising what I had studied the day before. The time spent wasn't much, but since I was practically doing 3-4 slides it didn't seem like a lot and over time it helped cover up the syllabus. Similarly, you're going to have to find out solutions that can work. If you're struggling with physics or mechanical, you'll probably want to try to apply the same approach. If it's EEE, then spend time practicing a few problems and concepts everyday. \n\nAlso, it's fine if you aren't able to do too well. It's just the 2nd semester, you have 4 more to go before placements and 6 more until you graduate. It's important to identify your limits (but not before trying your best). At the end of the day, focus on obtaining the grades which make you happy and satisfied. Sometimes, focusing on your strengths and maximising grades in some courses is better than trying to score evenly across all. Don't break your head over this. A couple of grades in a semester aren't worth losing your mind over."
    },
    {
      "id": "kyhoo2u",
      "body": "write blogs, you got that thing in you bro..."
    },
    {
      "id": "kyipj7w",
      "body": "Not an expert here, but dont think about completing  the whole syllabus before studying or while studying(its good to have a high aim but just dont be conscious about it).make progress everyday, dont worry if its not much , just make  sure  u have better  progress than the previous day. \n\nDuring my 4th sem , i was sick and i took 2 weeks leave , i was scared as hell but  i did pass the semester with just 6.1 gpa without any backlogs.\n\nSo keep your hopes high , atb!"
    },
    {
      "id": "kylfu4q",
      "body": "Rowlett blogger era"
    },
    {
      "id": "kylsah9",
      "body": "Mini Paul graham in my books, come blog in my blogging platform. "
    },
    {
      "id": "kym8k1k",
      "body": "Rowlet owl - Blog 🦉🦉"
    }
  ]
}