{
  "id": "1byinvf",
  "title": "Bro wtf is wrong with y\"all😭",
  "content": "Whenever someone asks about how is pes there is no positive comment bur at the same time pes is considered among the top colleges in bangalore and is said to have a very good placement in terms of cse \nI'm confused now wht should I do because I do want to come there this year :)",
  "metadata": {
    "author": "blackdarkness04",
    "url": "https://www.reddit.com/r/PESU/comments/1byinvf/bro_wtf_is_wrong_with_yall/",
    "permalink": "/r/PESU/comments/1byinvf/bro_wtf_is_wrong_with_yall/",
    "score": 25,
    "created_utc": 1712532117,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "kyjui8e",
      "body": "\n>Bro wtf is wrong with y\"all😭\n\nYou'll know when you turn into one of us\n\n\nIt used to be a top college but I'm not sure if it will retain its position and fame in the upcoming years. The management changed 2-3 years ago and that's when all the good teachers started leaving the college. Plus the huge intake of students will affect your placements as you'll have more competition. PES could very well turn into VIT in some time. If I were you, I'd try for colleges like RVCE and BMSCE instead. \n\nThis is just my opinion but I'd highly suggest you do your own research. There are many similar posts answering your question on this subreddit.\nGood luck."
    },
    {
      "id": "kyk7z1p",
      "body": "See man bottom line is that yes it is one of the top colleges in Bangalore. But the students of PES will tell juniors what we wish someone told us. It's not all good, like any other college it has its pros and cons. Everyone can sugarcoat it but knowing the reality is why I assume you're on this sub. So all that's said here is true and you can weigh your options and decide."
    },
    {
      "id": "kykfjld",
      "body": "Even in BMS Many Good teachers left I have friends there and Intake Is Increased in BMS and RV also But Not as Much as PES. For Your Kind Information. Every One have a Time to retire everyone can't work forever they have to retire and that's the reason why some of the teachers left it's not because of management change For your Kind Information."
    },
    {
      "id": "kykg82o",
      "body": "It’s called metamorphosis. Trump is hated by all still he won the election"
    },
    {
      "id": "kykh3d1",
      "body": "Bro people with money can stay anywhere. Not necessary wrt the quality of teaching or others"
    },
    {
      "id": "kykheyh",
      "body": "Good one!"
    },
    {
      "id": "kykji75",
      "body": "PES is a comp science Messiah!!"
    },
    {
      "id": "kykner1",
      "body": "Whether you like it or not, as your senior, I've certainly seen more of this college than you (for your kind information). And I've also seen teachers well below their retirement age leaving this college (not for your kind information this time cuz why should I be kind to you?)"
    },
    {
      "id": "kyky6wc",
      "body": "The sad part is, though Bangalore is prolly one of the highest job producers in the market, the same isn't true for colleges. RV was a decent player back in the day, not anymore. PES is gone to ruins. Only good college in the city rn is IIIT Bangalore. \n\nGo out of Bangalore to study, Bangalore's college game is honestly super disappointing. JEE/BITSAT do well and yeet."
    },
    {
      "id": "kyl192w",
      "body": "I won't do good in those thts the problem 💀..."
    },
    {
      "id": "kyl1dvh",
      "body": "No I will be going to college this year so I just asked to clear out my confusion 😭"
    },
    {
      "id": "kyl28nw",
      "body": "Wasn't pes infamous for covering student suicides?"
    },
    {
      "id": "kyl4987",
      "body": "It's just okay. Not everything is bad here. Teachers anyway hardly matter as at the end majority of the people study on their own no matter how good the teacher is, u will adapt to this once u reach college it's not like jee or cet where u have someone to spoonfeed u. College life sucks here but atleast u are in Bangalore and not in any college in a far off place where u are in a shell."
    },
    {
      "id": "kyl6ixs",
      "body": "Adding to this: most of the profs who have left have gone back to join the industry, not retire and live out their golden years. \n\nu/ContactBeginning6119, If you don't even know who has left, then why bother to comment about why they left?"
    },
    {
      "id": "kyl6o6h",
      "body": "None of the suicides were \"covered\". They were acknowledged the day the incidents happened and were out on the news the very same day. They handled it poorly, but they never covered it."
    },
    {
      "id": "kylba7f",
      "body": "Its not good bro if you have knowledge its good or else every teachers are shit they won't give full marks in internal also although you have given your 100%"
    },
    {
      "id": "kyli4aw",
      "body": "Poor PR response doesn't mean it was covered. The news was out. You wouldn't know if it was covered. "
    },
    {
      "id": "kyliha0",
      "body": "100% guaranteed placements\nYeah sure man"
    },
    {
      "id": "kylip7a",
      "body": "Everyone will have a different opinion about the colleges, people say pes is bad but i have also seen ppl say pes is good, it is completely upto u which one to listen and yea, its not like pes is the only college which has problems, u will find problems in any college, not all colleges r perfect, its upto u on to decide, make ur decision wisely, thats all i would say"
    },
    {
      "id": "kylipz2",
      "body": "Nice one"
    },
    {
      "id": "kyllec7",
      "body": "LOL same .... whats your plan ?"
    },
    {
      "id": "kylmgbv",
      "body": "Tbh idk. I'll just give pessat and other entrances like comedk viteee. Hopefully I get cse in one of thm.  I don't want to go to vit tho XD"
    },
    {
      "id": "kyloxj4",
      "body": "Preparation kaisi chal rahi ?"
    },
    {
      "id": "kylt1da",
      "body": "Bas chlri h. Like 12th tabh bhi aati h idk 11th kese hogi :)\nWby?"
    },
    {
      "id": "kym78w1",
      "body": "They tried to cover the suicide up. Know your facts. When the incident took place, they tried to move the body from college and told that the student wasn’t from their college."
    },
    {
      "id": "kym7dm7",
      "body": "They tried to cover the suicide up. Know your facts. When the incident took place, they tried to move the body from college and told that the student wasn’t from their college."
    },
    {
      "id": "kynmm70",
      "body": "Almost revise karna hai sab sirf Organic baaki haii ... Mann to nai karta aur padhne ka 😭 (2 mahine hogye padhai kiye hue)"
    },
    {
      "id": "kyo9xmq",
      "body": "Organic hi aati h merko. Bro like srsly bilkul man nhi krta. Tum konse papers Dene ka sochre ho?"
    },
    {
      "id": "kyykj47",
      "body": "why do u always keep defending this shit-hole, lol?"
    },
    {
      "id": "kz12d52",
      "body": "I'm not defending anything. Unlike a lot of people on this sub, I ensure to keep my comments neutral and objective. Just because PES gets a lot of shit wrong doesn't mean it deserves comments which are untrue. Give credit to PES when it gets things right and rightfully criticise when it gets things wrong. You can read my previous comments to see that I don't show bias."
    },
    {
      "id": "kz3irp4",
      "body": "ok"
    }
  ]
}