{
  "id": "1bzls2z",
  "title": "Us PESU worth joining for CSE",
  "content": "Hey guys I m entering PESU through PESSAT and is it a good college to take admission in….I need your opinions and reviews.\nPlease Help me make a better choice !\n\nAll suggestions and reviews are appreciated \n",
  "metadata": {
    "author": "OkFaithlessness6408",
    "url": "https://www.reddit.com/r/PESU/comments/1bzls2z/us_pesu_worth_joining_for_cse/",
    "permalink": "/r/PESU/comments/1bzls2z/us_pesu_worth_joining_for_cse/",
    "score": 17,
    "created_utc": 1712645941,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "kyqj693",
      "body": "PESU is 100% worth it through KCET. Thru PESSAT it's ok only if the fees are not a financial issue."
    },
    {
      "id": "kyqjej9",
      "body": "Can you dm me brother?"
    },
    {
      "id": "kyqjrzn",
      "body": "It depends on your options in hand."
    },
    {
      "id": "kyqkav0",
      "body": "Yup"
    },
    {
      "id": "kyqo6bz",
      "body": "I did mechanical engineering at PESU. My friends who did CS all entered through PESSAT. They all actually liked the course work and the only time they complained was when we had 5 internals instead of the two we have now.  It is pretty competitive as there were around 800 students in CS (in my batch) so it might get hard to cope at times."
    },
    {
      "id": "kyqojsi",
      "body": "do u have any idea about the kcet cutoffs for cse in pesu?"
    },
    {
      "id": "kyqomqh",
      "body": "hey, hows the mech eng at PESU. Im not really inclined to CS course and have an interest in mech. Is it worth joining?"
    },
    {
      "id": "kyqrao3",
      "body": "How much is fees per Anjum through PESSAT"
    },
    {
      "id": "kyqsbnm",
      "body": "Almost 5 lakh excluding hostel"
    },
    {
      "id": "kyqspw0",
      "body": "First finish writing PESSAT And first Get ur PESSAT rank then we will see"
    },
    {
      "id": "kyqsrlz",
      "body": "I am graduating this year. I absolutely loved the course and most of teachers were amazing! Unfortunately tho, most of them left college or retired. My classmates were nice as well, not the rowdy gang. Our research culture has deteriorated a lot and the current HOD isn't very approachable or supportive. When it comes to placements, if your basics are decent, u can get placed easily. Bosch, LAM, Schneider, Mercedes Research are a few big names that come for mechanical. If u r girl, then it gets a lot easier with placements. I would personally not recommend PES for mech right now."
    },
    {
      "id": "kyqthae",
      "body": "Both campus have similar fees ?"
    },
    {
      "id": "kyqwtrb",
      "body": "4.8lpa for CSE/AIML(college fee only)\nHostel fee is diff"
    },
    {
      "id": "kyqzhik",
      "body": "Both campuses have the same fees."
    },
    {
      "id": "kyqzonz",
      "body": "No idea. A quick google gave some numbers but I'm not sure if they are correct."
    },
    {
      "id": "kyr2owe",
      "body": "What a dick"
    },
    {
      "id": "kyrflz3",
      "body": "afaik core cse for general ended at 1.6k"
    },
    {
      "id": "kyrjcvw",
      "body": "yea, when i googled different sources gave different numbers"
    },
    {
      "id": "kyrje1a",
      "body": "ic ty"
    },
    {
      "id": "kyrqe46",
      "body": "Core CS at rr campus closes between 700- 1000 every year for general category"
    },
    {
      "id": "kyrttap",
      "body": "ooh ok thanks!"
    },
    {
      "id": "kys0lrt",
      "body": "i'm in my final semester in Mech,TBH it's not really great at PES, When i say it's not grea8 i'm speaking for my whole batch, if you're looking forward for taking up Mech i'd suggest you look at RVCE OR BMSCE ( not BMSIT ).  I've joined through KCET. honestly the placements are really dogshit for Mech. Core Mech companies do come but end up recruiting CSE for IT roles or they taken in women in the name of diversity. I personally hope your give your decision of joining Mech in PES a second thought."
    },
    {
      "id": "kys6dl0",
      "body": "Thanks. If i get into PES ill prolly take ECE but inquired abt mech cause i have some interest in it and heard PES has a racing team( couldnt clear mains for nit-k mech)."
    },
    {
      "id": "kyslb56",
      "body": "i'm part of the racing team and post covid theres hasn't been  much work going on within the team. primary reason being not getting proper funding for the event from mech dep or college for that matter of fact."
    },
    {
      "id": "kyvjdx1",
      "body": "bruv does mechanical have scope in blr like I'm interested in it but tbf I'm scared I'll be jobless since you have lived there for a while what do ya think"
    }
  ]
}