{
  "id": "1c2u0si",
  "title": "Change of KCET Cutoff",
  "content": "Since there are more AIML and CS Seats now, how much of a effect will it be towards the cutoff?  \n\n\nAlso is joining PES through second round worth it? Heard they get treated pretty badly ",
  "metadata": {
    "author": "Choice-Remarkable",
    "url": "https://www.reddit.com/r/PESU/comments/1c2u0si/change_of_kcet_cutoff/",
    "permalink": "/r/PESU/comments/1c2u0si/change_of_kcet_cutoff/",
    "score": 6,
    "created_utc": 1712984696,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "kzcfa2c",
      "body": ">Heard they get treated pretty badly\n\n???   \nThey aren't treated badly lmao, don't make it sound like they are being discriminated against. Since they join later, they get lesser time to cover up the syllabus because all exams are held at the same time regardless of which round you join. Also, this only affects you for the first semester if I am not wrong, after that it is the same for everyone."
    },
    {
      "id": "kzcp3z9",
      "body": "Adding to this,For 2k23 batch,1st internals for 1st and 2nd round students was conducted 1st and a month later internals for 3rd round students was conducted cause they joined a month later than them cause of elections.If anything unusual happens like this which may lead to a longer gap, they might delay exams for u."
    },
    {
      "id": "kzcsc2c",
      "body": "Some of my seniors told they are more stressed upon and the syllabus is sped up? again not from PES so i wouldn't know lol"
    },
    {
      "id": "kzd035e",
      "body": "Yes the syllabus was sped up but wouldn't call it discrimination. It seems like they had to speed up to complete the syllabus and wouldn't really blame pes for speeding up"
    },
    {
      "id": "kzdhwt7",
      "body": "Can't Predict those Stuff"
    },
    {
      "id": "kzdhzyf",
      "body": "This Year it won't Happen"
    },
    {
      "id": "kzdi24i",
      "body": "Because CET is happening on time like how it used to happen Pre-covid."
    },
    {
      "id": "li3tmrt",
      "body": "Aged well"
    }
  ]
}