{
  "id": "1c36op5",
  "title": "Guidance ",
  "content": "I am a 2nd year computer science student and as a part of my curriculum I have DSA,OS, Computer networks and as a side learning component I've learnt supervised, unsupervised,ANNs and now exploring computer vision and image processing for robotics and healthcare.\n1. Nowadays I find it difficult to balance and choose between developing and honing my existing course knowledge (DSA,OS,CN) or get my hands on work by working on projects of AI/ML.\n\n2. What would one choose to do in the upcoming summer if they were in my position? Take up and internship in ML domains or improve upon DSA ,OS,WEB dev?\n\nNote:nsorry if there are any grammatical mistakes, just need guidance.Hoping someone who has cleared this stage and is working now guides me thru.\nThanks in advance!!\n",
  "metadata": {
    "author": "Yagnikanna_123",
    "url": "https://www.reddit.com/r/PESU/comments/1c36op5/guidance/",
    "permalink": "/r/PESU/comments/1c36op5/guidance/",
    "score": 8,
    "created_utc": 1713027896,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "kzf7e8h",
      "body": "Bruh start doing leetcode"
    },
    {
      "id": "kzhiafg",
      "body": "Yeah started but yet to become a pro,\nWill keep this in mind\nThank you!"
    },
    {
      "id": "kzhmz5r",
      "body": "Do you have any domain in CS you are fascinated by or interested in? Learn whatever you want to in that domain. Build a project from whatever you learnt. Make it so good that you are proud of it and you *want* to put it on your resume. \n\nMost importantly take a break. Vacations are for calming down first and improving yourself second."
    },
    {
      "id": "kzir7gi",
      "body": "Yeah I am interested in ML (not bcz of the ongoing hype, actually interested) and I am working on a project right now.\nJust needed guidance about a choice to make for the upcoming summer, bcz I do lack a lot in competitive programming.\n\nYeah thanks a lot!!,I'll keep that in mind and try to balance btw having a vacation and learning"
    },
    {
      "id": "kzis56l",
      "body": "Good luck with your project. \n\nW.r.t competitive programming hone your problem solving skills before any language specific skills (like list comprehension in python or memory management in C/C++)"
    },
    {
      "id": "kzj0v6u",
      "body": "Thank you!!\nOhh cool yeah,I'll keep that in mind.\nDo you recommend any YT playlist to get started with competitive programming and concepts or just go ahead with solving,(the websites scare me a lot tbh and i end up losing interest)?"
    },
    {
      "id": "kzj29wi",
      "body": "Ahh I didn't really watch any videos so can't give any help there sorry. Make a post someone will probably reply."
    },
    {
      "id": "kzj9909",
      "body": "Cool cool,no worries \nAnyways thanks a lot for the help!"
    },
    {
      "id": "kzjaina",
      "body": "Np"
    }
  ]
}