{
  "id": "1c5f7jk",
  "title": "Doubt regarding KCET",
  "content": "There's no subreddit for KCET, so next best option was PESU & RVCE subreddits\n\nIn our hall ticket they've mentioned we need to be at the center 2 hours early, is it necessary for us to be 2 hours early though?\n\nThey've also mentioned regarding bell timings (which is there as a file not found on their website) so does any have any idea about it?\n\nThank you in advance!",
  "metadata": {
    "author": "ksvk_26",
    "url": "https://www.reddit.com/r/PESU/comments/1c5f7jk/doubt_regarding_kcet/",
    "permalink": "/r/PESU/comments/1c5f7jk/doubt_regarding_kcet/",
    "score": 8,
    "created_utc": 1713271547,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "kztq7n0",
      "body": "can u tell what are the bell timings?"
    },
    {
      "id": "kztt0ev",
      "body": "[here](https://cetonline.karnataka.gov.in/keawebentry456/ugcet2024/UGCET_2024_English_%20finalenglish.pdf) is the link to download it, lemme know if it doesn't work, I'll send a gdrive link"
    },
    {
      "id": "kztt37h",
      "body": "If one of the arguably most important tests of your life asks you to report 2 hours early, why would you want to take a risk by going later?"
    },
    {
      "id": "kztw22c",
      "body": "ty, it downloaded"
    },
    {
      "id": "kzv2ycz",
      "body": "Not really. Most centres are normal schools with bells and let you in even if you come right at exam time (can't speak for all centre). You should be there 1hr early tho atleast"
    },
    {
      "id": "l058w77",
      "body": "Yeah, it was a mess, they only called us 2 hours early to make us wait in the sun, outside the campus and allowed entry only half an hour before the exam :|"
    },
    {
      "id": "l05969p",
      "body": "It's really frustrating all the shit they're doing this year, first 3 exams for no reason, now they give us questions on topics that aren't there for boards (just venting here 😭)"
    }
  ]
}