{
  "id": "1c660xp",
  "title": "Why is their so many different opinions regarding the difficulty of pessat?",
  "content": "Some ppl on this subreddit says it very easy, some say its easier then kcet and comedk and some even compare it to jee.\nIn reality how hard is it according to you and your experience?\nIs it truly jee lvl or is it a fairly easy exam?",
  "metadata": {
    "author": "lilloser1234",
    "url": "https://www.reddit.com/r/PESU/comments/1c660xp/why_is_their_so_many_different_opinions_regarding/",
    "permalink": "/r/PESU/comments/1c660xp/why_is_their_so_many_different_opinions_regarding/",
    "score": 10,
    "created_utc": 1713348262,
    "flair": "PESSAT/Admission",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "kzyx8q1",
      "body": "Ok, so when we had the info session with the COO at PESU, he said pessat would be a little harder than KCET but easier than JEE"
    },
    {
      "id": "kzz011u",
      "body": "You can easily crack PESSAT with the preparation you would have done for JEE mains"
    },
    {
      "id": "kzz04rk",
      "body": "pessat is easier than jee. harder than cet"
    },
    {
      "id": "kzz0mif",
      "body": "I've only been preparing for comedk, do I stand a chance at cs in pes?"
    },
    {
      "id": "kzz0nwk",
      "body": "I've only been preparing for comedk, do I stand a chance at cs in pes?"
    },
    {
      "id": "kzz0ons",
      "body": "I've only been preparing for comedk, do I stand a chance at cs in pes?"
    },
    {
      "id": "kzz2fct",
      "body": "pesu doesn't take students via Comedk anymore from next academic year - COO told this as well ;)"
    },
    {
      "id": "kzz2se9",
      "body": "Yep PES University isn't in https://www.comedk.org/member-institutions either"
    },
    {
      "id": "kzz3jb2",
      "body": "I think so, it might be a little harder this year with negative marking and all, so don't randomly guess like you would in comedk. Also prepare bitsat pyqs, i think that should be enough"
    },
    {
      "id": "kzz3xh5",
      "body": "thats not what i meant, is my comedk lvl preparation enough to get a good rank in pessat"
    },
    {
      "id": "kzz43ry",
      "body": "thanks alot man, tbh i was stressing bcs of how hard it might be but if comedk-kcet-bitsat lvl of questions appear ill be fine"
    },
    {
      "id": "kzz4uzj",
      "body": "I'm not sure of the difficulty of comedk so I can't answer that"
    },
    {
      "id": "kzz79ri",
      "body": "Yeah that would be enough, pessat ain't that difficult."
    },
    {
      "id": "kzz7ac4",
      "body": "Yeah that would be enough, pessat ain't that difficult."
    },
    {
      "id": "kzz7iri",
      "body": "It's a fairly easy exam. Not at all JEE level. It's almost the same level as Comedk."
    },
    {
      "id": "kzz7vil",
      "body": "Thanks alot bro"
    },
    {
      "id": "kzz7zwd",
      "body": "Thanks man, since the competition is so low I assume it would be easier to get a good rank right?"
    },
    {
      "id": "kzz8i3o",
      "body": "Thanks man, since the competition is so low I assume it would be easier to get a good rank right?"
    },
    {
      "id": "kzzb5ba",
      "body": "When I joined, PESSAT was conducted over a series of days and multiple batches. If you're lucky then the exam is fairly easy on that day. Difficulty level is different on every day and is mostly unpredictable.\n\nDon't know if the same principle still applies"
    },
    {
      "id": "kzzf762",
      "body": "Yep my friend found Phy and Maths difficult while I found only Phy difficult so I got a seat and he didn't its all based on luck"
    },
    {
      "id": "kzzjdyz",
      "body": "Naah not easier to get a good rank though, as per I remember when I gave the exam, there was no negative marking, so you need to have a good score to get into the RR campus."
    },
    {
      "id": "kzzpus4",
      "body": "Oh 👍"
    },
    {
      "id": "l001quu",
      "body": "depends on how ur doing in comedk. how much scores are you getting in mock tests? \npersonally my cet was alright got a 4k rank, didn't take comedk seriously got 10k and pessat, out of sheer luck secured 900ish rank. so you never know."
    },
    {
      "id": "l00e7t0",
      "body": "Hmm did u prepare for jee tho?"
    },
    {
      "id": "l3099ck",
      "body": "How much PESSAT rank one can expect with 127 score? Have considered the negative marking."
    },
    {
      "id": "l31u5jd",
      "body": "No clue bro"
    }
  ]
}