{
  "id": "1c6bb31",
  "title": "Is this JEE mains cutoff legit for pes? i know it might include both rr and ec and yeah i prolly wont get some good branch in nit's or iiit's so just askin cause i got some hope with these cutoffs if pessat doesnt go well",
  "content": "",
  "metadata": {
    "author": "shreyassssssss",
    "url": "https://i.redd.it/60snd2onu1vc1.png",
    "permalink": "/r/PESU/comments/1c6bb31/is_this_jee_mains_cutoff_legit_for_pes_i_know_it/",
    "score": 10,
    "created_utc": 1713364082,
    "flair": "PESSAT/Admission",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "kzzqo8v",
      "body": "source???"
    },
    {
      "id": "kzzqps2",
      "body": "First of all, data sci isn't even there as a btech degree in pes, and no you need 98+ percentile on jee mains for a comp sci seat in pes"
    },
    {
      "id": "kzzrccu",
      "body": "who tf will want to go to pes if he scored 98 %ile in jee mains??  \nis this actually true?"
    },
    {
      "id": "kzzrpw1",
      "body": "Seriously 98 percentile?"
    },
    {
      "id": "kzztpzf",
      "body": "vedantu jee [https://www.youtube.com/watch?v=UT2agGZpF68&ab\\_channel=VedantuJEEMadeEjee](https://www.youtube.com/watch?v=UT2agGZpF68&ab_channel=VedantuJEEMadeEjee)"
    },
    {
      "id": "kzztz3v",
      "body": "ikr, idk man theres something wrong with this shi, pes doesnt even release the jee councelling cutoffs"
    },
    {
      "id": "kzzw1li",
      "body": "this is 100% wrong. \n\ni was in ec campus in my first year and a guy with \\~98 percentile joined cse there. \n\nthere is no cse data science course at pes\n\nthere is no longer a civil engineering course at pes\n\n  \ni don't know why these sort of websites put random data up like this but it's almost always wrong"
    },
    {
      "id": "kzzwume",
      "body": "oh ok thank you bhaiya"
    },
    {
      "id": "kzzxv6g",
      "body": "Totally wrong.Also there is no civil and data science.It was around 94 for ece I believe I may be wrong also."
    },
    {
      "id": "l001ntc",
      "body": "This is 100000% wrong!"
    },
    {
      "id": "l002p9s",
      "body": "I don't think so, I wrote jee in 2022, and iirc they were offering seats to ppl with around 90-95%ile...\n\n\nMoreover if u want to join pes write pessat. It's easy, cutoffs are chill, they'll keep calling u and offer u a seat."
    },
    {
      "id": "l03otd8",
      "body": "There is a data science degree in PES and I know people who have joined this..\n💯"
    },
    {
      "id": "l06japv",
      "body": "can i get ece with 95 percentile in rr campus?"
    },
    {
      "id": "l08szhm",
      "body": "the college is not at all transparent about their student intake through management quota and jee mains. so i can't really tell you anything other to apply and hope for the best\n\nmains also has the same fee as pessat so you might as well just write that as well right. it's quite easier"
    },
    {
      "id": "l1iqh6t",
      "body": "Is pessat needed if i want to compete woth my mains score? Did they ask your mains score yet? They didnt ask me during registration"
    },
    {
      "id": "m5wwzjy",
      "body": "they've discontinued pessat for btech intakes starting this year"
    },
    {
      "id": "m5wx4n3",
      "body": "what now? they've discontinued pessat"
    }
  ]
}