{
  "id": "1c748n9",
  "title": "Teaching assistant",
  "content": "What are the perks of being a teaching assistant?(especially ECE department) \nHow to become a teaching assistant? ",
  "metadata": {
    "author": "inside_seed",
    "url": "https://www.reddit.com/r/PESU/comments/1c748n9/teaching_assistant/",
    "permalink": "/r/PESU/comments/1c748n9/teaching_assistant/",
    "score": 5,
    "created_utc": 1713449228,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l05aeht",
      "body": "How to be a teaching assistant is documented in the FAQs: https://bit.ly/pesu-faq\n\nBeing a TA gives you the opportunity to work closely with a professor. This later translates into TA experience and a good LOR, which will help you a lot during MS admissions. These are the explicit advantages, beyond that it won't help you too much."
    },
    {
      "id": "l05clnr",
      "body": "The perks are that you can write it on your resume\n\nThe downside is how much of your time you'll waste\n\nHow to do it is to have a super duper high cgpa. \n\nIm second year, I'm just telling you what a senior told me. Take it with a grain of salt"
    },
    {
      "id": "l05t59t",
      "body": "You don't need a super high CGPA. You don't even need an S grade in the course you want to TA for (but it does make things easier). The minimum requirement set by the Uni is that you have already taken up and cleared the course. Beyond that, profs might have other subjective requirements like a minimum grade, how much you participated in class, etc.\n\nProfs primarily look for people who have a good grasp of the course, are genuinely interested and are passionate about that topic and are helpful, diligent and can get things done on time. If you have these qualities, you become a strong candidate for a TA. In some cases, they might even reach out to you to be their TA (happened to me for another course, but had to turn it down because I was already swamped with internship work that semester). \n\nAnd it isn't a waste of time if the TAship is good. I was the TA for Big Data and working with KVS has taught me a lot on not just advanced concepts from the topics but also matters beyond academics :). Working with him as his TA was a wonderful experience, and it goes to show that your experience will also greatly depend on the prof you TA for."
    },
    {
      "id": "l05yfaq",
      "body": "Thanks for letting me know. \n\nI'm glad i included the \"take if with a grain of salt\" part 🤣"
    },
    {
      "id": "l0ml633",
      "body": "Hey, The following points are from an ex-teaching assistant \\[passing out this year - 2024\\]. I credit all the points to that person \\[not taking the name here\\] : - \n\n1. Firstly, being a TA in ECE is really super helpful in case you want to get *recommendation letters.* Another perk is that you get paid 1000Rs **in case you are TA in your final year only**   \n2. The amount of work, depends on subject and teacher, but ensure to be a TA, where there are other TAs for same subject, so that work is distributed among TAs.\n\nAll the best"
    },
    {
      "id": "l0ypk67",
      "body": "It looks impressive on graduate school applications."
    }
  ]
}