{
  "id": "1c74sqp",
  "title": "Where are all these second year guys finding summer internship applications",
  "content": "Where are y'all getting them from. Why am I not getting these mails. Send me the application forms please ",
  "metadata": {
    "author": "Annie_Rection__",
    "url": "https://www.reddit.com/r/PESU/comments/1c74sqp/where_are_all_these_second_year_guys_finding/",
    "permalink": "/r/PESU/comments/1c74sqp/where_are_all_these_second_year_guys_finding/",
    "score": 8,
    "created_utc": 1713450647,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l05ghrm",
      "body": "Second years usually dont get internship mails, it usually starts from third year. You gotta find internships urself after 4th sem in most cases, cause companies arent ready to take you in yet."
    },
    {
      "id": "l05hvpo",
      "body": "No i don't mean at actual companies. I meant those ones which clubs like isfcr have. It's the only one for which i got a mail. But i hear talk about there being more"
    },
    {
      "id": "l05iu90",
      "body": "Pil is also there"
    },
    {
      "id": "l05j5d5",
      "body": "PES Innovation labs recently concluded their test, di you get mail for that ? Also keep your eyes on pesuacademy and Instagram handles as well. You will get some updates from there. So far , PIL, PVL , ISFCR and Bioinnovation lab (i think that is only for biotech students) have published internship applications."
    },
    {
      "id": "l05qq3a",
      "body": "You can try using contacts from your relatives, that’s probably the easiest way."
    },
    {
      "id": "l05rnpl",
      "body": "Its 90% through referrals, it could either be ur friends , family or anyone u know .It would mostly be for 2 months however you wont get any credits if its unpaid.\nYou can also endlessly apply on LinkedIn...u wont get get in.So of ur dad owns a company then your sorted"
    },
    {
      "id": "l05tu55",
      "body": "All research clubs take in interns during the summer. If you've missed out, you can always reach out to any prof and ask to work with them."
    },
    {
      "id": "l05ym2m",
      "body": "Pro tip: Just go to these centers and talk to the profs. 99% of the times they'll just assign you a project. ISFCR is pretty great but don't expect the profs to help you in anyway. You can try off campus too."
    },
    {
      "id": "l06whw1",
      "body": "The announcement came on the app"
    },
    {
      "id": "l083rjn",
      "body": "Only the one thing from isfcr is there. Is there nothing else currently?"
    },
    {
      "id": "l083zrj",
      "body": "That's the only one I see peeps talkin abt and the pes innovation lab but idk bout that"
    },
    {
      "id": "l086pii",
      "body": "Okay thanks"
    }
  ]
}