{
  "id": "1caauxu",
  "title": "Regarding Placements",
  "content": "Hello Seniors,\n\nMy CGPA is 7.40 currently and I still haven't been placed yet.\n\nI wanted to know, till when the companies are gonna come.\n\n  \nI am primarily looking for an FTE\n\n  \nThank You.\n\n",
  "metadata": {
    "author": "Disastrous-Table6369",
    "url": "https://www.reddit.com/r/PESU/comments/1caauxu/regarding_placements/",
    "permalink": "/r/PESU/comments/1caauxu/regarding_placements/",
    "score": 6,
    "created_utc": 1713792676,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l0qmdkv",
      "body": "I have seen a lot of drop in the registrations and a lot of people, who don't fit in the criteria have been registering for the companies as well. So,can I do it and is there gonna be a problem if I do so ?"
    },
    {
      "id": "l0qxw8w",
      "body": "CGPA could be a little better, but that's fine, you cannot change it now\n\nSo I would say, whatever the role you are looking for \n1. Get your resume apt and perfect for the role. Don't lie on the resume, but make it relevant \n2. Whatever the ideal role is, start taking courses and join cohorts to upskill yourself so that you are ready for your eventual role\n3. Start writing cold emails and messages to hiring managers on LinkedIn and stuff. Build your network, it will help you now and later too"
    },
    {
      "id": "l0r1dxq",
      "body": "I wanted to know, till when the companies are gonna come."
    },
    {
      "id": "l0r3fiw",
      "body": "Probably at most May end. After that the new placement season starts."
    },
    {
      "id": "l0r64z8",
      "body": "Shit"
    },
    {
      "id": "l0r6avb",
      "body": "Were you or your friends able to apply to any of the companies after it started for the next batch ?"
    },
    {
      "id": "l0r7r6e",
      "body": "What is the ideal cgpa?"
    },
    {
      "id": "l0ro8pl",
      "body": "This year has been tough! Did you guys get companies like Texas Instruments show up?"
    },
    {
      "id": "l0rulzi",
      "body": "8.75+ if you're in CS"
    },
    {
      "id": "l0rus9k",
      "body": "No clue. People don't really keep up with PES or its emails after they get placed."
    },
    {
      "id": "l0uiwzw",
      "body": "Stay down and keep working youll get there \n1. Always prepare according to the job description \n2. Know what you’re speaking in the interviews and be confident\n\nDo these two things right and you’re sorted. I have the exact same cgpa as you , as far as my experience the above two things mattered the most in securing a placement"
    },
    {
      "id": "l0v8c24",
      "body": "Hi, 2nd yr student here with a similar gpa. may I DM?"
    },
    {
      "id": "l0v9cpj",
      "body": "Yes sure"
    }
  ]
}