{
  "id": "1cb52t1",
  "title": "Higher studies",
  "content": "Hey seniors, \nIm currently in 2nd sem and wanted to know how hard is it to get into top universities of the world, like MIT, caltech and all. \n\nLike extracurricular activities for resume or cgpa needed for such universities...\n\nAnd also does joining clubs mandatory in our resume for higher education like uk,im not able to get into clubs cuz my social skills suck.. And lets say im not much talented except for studying ...\n\nIk its too early and like how @rowlet owl mentioned in a last post that ppl start thinking abt it prbbly in thier 2nd yrs...\n\nBut still doesnt hurt to know a bit so pls ans id be greatfull💗",
  "metadata": {
    "author": "Own-Priority777",
    "url": "https://www.reddit.com/r/PESU/comments/1cb52t1/higher_studies/",
    "permalink": "/r/PESU/comments/1cb52t1/higher_studies/",
    "score": 10,
    "created_utc": 1713880027,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l0wn6go",
      "body": "CGPA is a primary factor for consideration for most Uni's. Beyond your CGPA, you need a good profile that aligns with what you want to pursue. Research focused programs will weigh your research experience more (publications, RAships, etc) while industry focused programs will weigh your work experience more (internships and the like). Applying to the program that best suits your goals also includes building your profile according to your goals. The reason I mentioned in another comment that its too \"early\" is because people often figure out what they want to pursue only after 2nd year. Once they have a clearer picture of what they would like to pursue, it makes things easier because they know what to do. Even before joining BTech, I doubt anyone is 100% clear on why they want to pursue a Masters (and this is a very important question you need to have an answer to, and \"because everyone else is also doing it\" is not a valid answer). Extra curricular activities aren't as important as you think, most people don't really have anything worthwhile to show but still end up in top grad schools since they don't focus on these. \n\nFor now, if you are still between seems 1-3, focus on your CGPA. Regardless of what you pursue your CGPA is a primary factor. Since higher the better, focus on scoring as much as you can while also taking out time to figure out your interests and working towards them. Once you figure out what your interests are, what you want to pursue, what kind of career you would like to have and where you see yourself in a few years, you should automatically be able to figure out the answer to that question. Then, you will also know how to build a profile that aligns with your goals and you will have a clearer idea on everything else.\n\nTLDR; Good CGPA and a great profile with relevant experiences that align with the program you want to pursue."
    },
    {
      "id": "l0yohn7",
      "body": "Hi, I started my graduate program right after I finished my B. Tech and I can help with this.\n\nUnlike Indian schools, schools abroad expect an all-round profile. You want to project yourself as an asset to the institution and not just a student who will go through a cookie-cutter program.\n\nIf you are in your second semester, you have much time to build a really attractive profile for schools abroad. First, focus on your GPA. You want a strong GPA. If you messed a semester up for a valid reason, you can discuss why you did that in your application.\n\nI did about 8 internships throughout my summers and semesters at PESU. While I did this to earn $$, I also did this to gain exposure to various domains in the industry. \n\nIf professors have a project, talk to them about contributing. This will lead to a strong LoR and give you insight into what you want to make out of your career. \n\nIf you want a business degree, look at contributing to startups, or even starting your own. Start preparing for your GRE/TOEFL around your third year and attempt right after the summer of your third year. \n\nIf you were on the admissions panel of your dream school, would you accept yourself? If so, keep up the pace. If not, what are you missing in getting that admit?"
    },
    {
      "id": "l3o295s",
      "body": ">If you were on the admissions panel of your dream school, would you accept yourself? If so, keep up the pace. If not, what are you missing in getting that admit?\n\nThis is great advice! Thanks."
    }
  ]
}