{
  "id": "1cbdntt",
  "title": "Can someone share their pessat experience",
  "content": "How was it compared to jee? What was the difficulty level of each subject? Were questions from deleted ncert topics asked? Were you able to solve most of the questions in maths in the given time constraint? What are the major topics from which most questions were asked? What are some of the tips that I should follow to maximise my score?",
  "metadata": {
    "author": "crazy_confused96",
    "url": "https://www.reddit.com/r/PESU/comments/1cbdntt/can_someone_share_their_pessat_experience/",
    "permalink": "/r/PESU/comments/1cbdntt/can_someone_share_their_pessat_experience/",
    "score": 5,
    "created_utc": 1713900917,
    "flair": "PESSAT/Admission",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l10u91a",
      "body": "I wrote my PESSAT exam in 2021, exams spanned for like around 15 days or something, and I had chosen the last third day, in terms of difficulty, I felt Maths was the hardest (I barely could solve a few questions and questions were too lengthy to be solved under 1 min), physics was moderate as I was good in physics, and chemistry was really easy. Then as far as I remember we had questions based on English as well, and this part was surprisingly tricky and hard, as I saw so many complex words which I had never seen before, also back in my time, there was no -ve marking, so whichever question I didn't get, I selected B option as statistically the chances of B being the correct answer in a MCQ is supposed to be the highest among other options (I don't know whether this is true for PESSAT), I got my PESSAT rank 3 days before I wrote my CET, and it was 490. In a way, it helped me perform better in CET as I didn't have fear of not getting a good college as I had already effectively secured my admission in PES. My CET rank was 698 and I ultimately got admission through CET in 2nd extended round. Hope this helps..."
    },
    {
      "id": "l163ywr",
      "body": "I wrote PESSAT last week, I feel this exam is all about time management, out of 20 qns in english almost 15 were straight forward, I felt the rest were hard because antonyms and synonyms were asked of few high level vocabulary.  \nComing to math, there were 60 questions, before attempting the paper you need to say to yourself that solving all 60 or atleast trying to solve all 60 is not possible considering the time constraint, so just choose any 30-40 and solve those first. You might see a lot of questions which are very easy but they take a lot of time so try to do those questions towards the end.   \nComing to physics, out of 60, I feel atleast 15-20 were direct theoretical and dint require any solving, around 10 questions in physics were a little hard, apart from that physics was doable, I'd say if you have around a week time just learn all the formulas and you'll easily be able to solve 60% of physics. I dint do we cause I was underprepared, wish I prepared properly.  \nIn Chemistry, everything was doable, you just need to be good with Ncert.   \nAlso I feel one good thing about the exam was that it had to partiality towards any topics, all topics carried almost equal weightage unlike other exams.   \nIf you have time, try to cover as many as concepts possible and if you have less than a week try to watch formula marathons and their applications.  \nAll the best, Hope you perform well!!"
    },
    {
      "id": "l1646b2",
      "body": "Also forgot to mention from this year (2024) PESSAT introduced negative marking, +1-0.25, bad luck :("
    },
    {
      "id": "l16889h",
      "body": "Did questions from deleted portions also came in exam?"
    },
    {
      "id": "l16rsar",
      "body": "No bro, atleast in my shift they dint, also even if they come just 1 or 2 max so just stop worrying about the deleted portion and emphasize on what you've aldready completed."
    },
    {
      "id": "l176rzk",
      "body": "I am really scared for pessat due to negative marking. I just gave my viteee exam today it was really hard most of the qs were from deleted syllabus. I guessed answers to most q cuz of no negative marking but pessat I will be doomed if it is like viteee. How many qs were from deleted syllabus for u? I booked pessat on 29th as I have other exams lined up next week. What can I do now I don't have much time."
    },
    {
      "id": "l17736o",
      "body": "I am really scared for pessat due to negative marking. I just gave my viteee exam today it was really hard most of the qs were from deleted syllabus. I guessed answers to most q cuz of no negative marking but pessat I will be doomed if it is like viteee. How many qs were from deleted syllabus for u? I booked pessat on 29th as I have other exams lined up next week. What can I do now I don't have much time."
    },
    {
      "id": "l17bwlf",
      "body": "Hardly any questions were from deleted in pessat, because they ask high number of questions no particular topic is concentrated like other exams. So worst to worst case scenario you might find 10 out of protion questions and I feel thats not a big deal.\n\nAlso how was VIT, I have it on 29th any tips would help :)"
    },
    {
      "id": "l17fps4",
      "body": "bro  how many question did u attempt in pessat ??"
    },
    {
      "id": "l17g2y8",
      "body": "around 110-120, I know it go that well"
    },
    {
      "id": "l17iau6",
      "body": "I had questions from deleted portion in my paper"
    },
    {
      "id": "l17jain",
      "body": "any guess work??"
    },
    {
      "id": "l17x49a",
      "body": "damn bro u have viteee on 29th and I have pessat. Honestly I felt that it harder than jee. Like I got jan 31st shift 2 which was pretty hard. Viteee was even worse. There were many qs from deleted syllabus. English and mental ability was a piece of cake. Chemistry like 5-10 qs were tricky and from deleted syllabus. I didn't even know which chap some of the qs were from. There was a q asking which wax is known as the queen's wax. I had no clue wth that was. I came home and googled it, the ans is carnauba like how tf was I supposed to know that?. The formula for teflon was asked which I got wrong. Which acid is alpha-imino (ans is proline) which I got wrong There were some tough qs from organic as well it was not like any of the qs that I practised. \n\nPhysics had a few easy and moderate qs but there were around 10 tricky qs like I solved similar qs before but the options were similar so I got confused. There was a q on finding potential difference between a and b in LCR circuit but the value of charge was not given so I wasn't able to solve it. There was a q asking to find the volume of water that can pumped through a borewell of 19m by a 2.5hp/s pumper. I tried using p\\*t=mgh but I couldn't get the answer .Physics is my strongest as compared to chem and maths so it was pretty disappointing. There were some calculative qs in which I had to use the scientific calculator, it was so frustrating cuz it is difficult to use. \n\nMaths was honestly a nightmare. I didn't have time to revise 11th syllabus for jee and there were many deleted syllabus qs so try doing some high weightage chaps as u have 3 days time. They were not as lengthy as jee and it was easier in comparison. 4 qs were asked from complex numbers,10 qs were asked from planes which was deleted from 3d LIKE WTF?. In probability binomial distribution was asked which was deleted. 4 qs were asked from straight lines, 3 qs each from trig and inverse trig . 5 qs from matrices and determinants. They asked q to find the rank of given matrix which I didn't know. 5 qs from differential eq , 5 from integration. Other chaps 1-2 qs each. \n\nOverall the distribution of qs from each chap was uniform except for maths. The paper was moderate to tough. My advice would be to attempt the mock test from the official website to get urself familiarized with the calculator and also a few similar qs came from the mock test. Learn phy formulas and go through organic and biomolecules especially, learn the structures of peptides. If possible try to learn planes in 3d. All the best :)"
    },
    {
      "id": "l184t5g",
      "body": "around 30 :("
    },
    {
      "id": "l186bo9",
      "body": "Bro tf 10 qns from planes!? damnn, thanks a lott for the detailed answer.  \nDone bro I'll try to do all those things!  \n\n\nAlso unlike other exams Viteee is only conducted once right?"
    },
    {
      "id": "l18to8p",
      "body": "ya viteee is condcted only once. There was a huge line (around 300 ppl) just for my shift and I saw 7 classmates I had no clue they were writing too. The competition is too much. Also I forgot to mention 3 qs were asked from scalar triple product and 1 question in physics for finding sum in binary (111.1+111.1) The options were like 1011.01 smth I had no clue which chapter it was from."
    },
    {
      "id": "l1aswaa",
      "body": "Yeah scalar triple product is expected only ig, also what about mathematical induction? did they ask any qns? heard its imp but idk shit"
    },
    {
      "id": "l1bhnss",
      "body": "they asked one q on mathematical reasoning and finding sum to infinity using definite integral which were deleted"
    },
    {
      "id": "l1c34u1",
      "body": "oh okay thanks"
    },
    {
      "id": "l1jxhr2",
      "body": "Dude should we do the deleted portions in chemistry like S block, Hydrogen, Solid state etc. for Pessat?"
    },
    {
      "id": "l1q75o9",
      "body": "Don't cause paper was quite lengthy.. you'll hardly have time to do questions you already know"
    },
    {
      "id": "l1xkm07",
      "body": "Was more questions from 11th or 12th syllabus? Is 12th syllabus enough?"
    },
    {
      "id": "l1yywhq",
      "body": "its almost equally divided. if you're completely perfect with each and every concept of 12th then ulll be able to solve 60% of the paper"
    },
    {
      "id": "l3094or",
      "body": "How much PESSAT rank one can expect with 127 score? Have considered the negative marking."
    }
  ]
}