{
  "id": "1cbhi8o",
  "title": "Internships after 4th sem",
  "content": "Do you have to inform the college if you get an internship through outside sources? Do you have to make a report in the end? What would be the proof of me doing an internship to get 2 credits? And is it okay to do my first internship unpaid in a startup?",
  "metadata": {
    "author": "strange_panther21",
    "url": "https://www.reddit.com/r/PESU/comments/1cbhi8o/internships_after_4th_sem/",
    "permalink": "/r/PESU/comments/1cbhi8o/internships_after_4th_sem/",
    "score": 7,
    "created_utc": 1713910058,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l0yjql5",
      "body": "1. Yes. Once you get an internship (on or off campus) and if you want to claim credits, then firstly it has to be paid and secondly it can only happen either in the summer before 7th sem or in 8th sem. \n2. If your internship satisfies these conditions, you'll need to fill out a form, create a report, fill in your manager details and submit it at the end of the internship. PES will contact your manager and ask them to rate you on several parameters, which is then converted into your internship grade. \n3. So your current internship won't actually give you credits because you don't satisfy any of the conditions in (1)."
    },
    {
      "id": "l0zdo7y",
      "body": "This seems like outdated information, people who did internship after 4th sem were able to claim credits. (Batch of 25)"
    },
    {
      "id": "l0zxgne",
      "body": "Ah okay. Does this apply for unpaid as well?"
    },
    {
      "id": "l1132yc",
      "body": "No no only paid afaik"
    },
    {
      "id": "l12peca",
      "body": "Unpaid only if it's from some reputed institution like IISc afaik"
    },
    {
      "id": "l12t78v",
      "body": "Credits can be claimed from Unpaid internship, only if its from a reputed research organization like DRDO, ISRO etc"
    },
    {
      "id": "l12tfv1",
      "body": "I heard that people got credits for unpaid internships if its in a reputed company like Cisco, or any big tech. is it true?"
    },
    {
      "id": "l1bgihc",
      "body": "Do internships in college carry credits in 4th sem ?"
    },
    {
      "id": "l1blbpv",
      "body": "Depends on where you are doing"
    }
  ]
}