{
  "id": "1ccz7iv",
  "title": "PES SAT 2024: Nervous About Random Guesses Impacting My CSE Chances!",
  "content": "I recently took the PES SAT 2024 exam and attempted around 118 questions. Out of these, I’m confident about 85 questions, but for the rest, I had to resort to random guessing, considering the negative marking. Despite my efforts, I’m uncertain about securing a CSE seat. I’ve heard stories about people getting CSE at EC  or ECE departments even without preparation. Can anyone who has been in a similar situation or a senior share their experience? How does normalization factor into this? I’d appreciate any insights or advice. Thank you.",
  "metadata": {
    "author": "i_nithinsudhagar",
    "url": "https://www.reddit.com/r/PESU/comments/1ccz7iv/pes_sat_2024_nervous_about_random_guesses/",
    "permalink": "/r/PESU/comments/1ccz7iv/pes_sat_2024_nervous_about_random_guesses/",
    "score": 1,
    "created_utc": 1714071052,
    "flair": "PESSAT/Admission",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l18o3p5",
      "body": "I wouldn't go by previous stories since there wasn't any negative marking before. Since the test is held across different dates, a normalisation of scores takes place and only after that your rank is determined. There's no way to say for sure how much you'll or what your rank will be, so it's best to just know that you've given it your all and wait for the results."
    },
    {
      "id": "l18vmr7",
      "body": "Could u pls share some info about the lvl of the test? Was it boards lvl?"
    },
    {
      "id": "l1anjoq",
      "body": "balls. WAYYYY harder than CET and Boards. I'd say it's between Mains and Advanced."
    },
    {
      "id": "l1b1o3f",
      "body": "tf fr?"
    },
    {
      "id": "l1b5afv",
      "body": "No way harder than mains dawg"
    },
    {
      "id": "l1ba6f5",
      "body": "it was below mains level. math was kcet level"
    },
    {
      "id": "l1bf211",
      "body": "+1"
    },
    {
      "id": "l1bf5fd",
      "body": "Apart from the few easy ones there were a bunch of mains level questions on the paper I gave on 25th"
    },
    {
      "id": "l1bvhik",
      "body": "2-5 shift?"
    },
    {
      "id": "l1czb8j",
      "body": "hey but i see its written that theres no negetive markin ?? could u clarify ...."
    },
    {
      "id": "l1gx9bj",
      "body": "I'm convince 25th April 2-5 shift was legit hard now. I thought it was just Me lmao"
    },
    {
      "id": "l1gxce9",
      "body": "Don't look at any other source dude. On there website it's clearly mentioned tht there's a negative marking of 0.25"
    },
    {
      "id": "l1t2n46",
      "body": "Morning"
    },
    {
      "id": "l1xg180",
      "body": "I had mine today and found physics harder than mains too chem lagbag same tha, math was easy but I ran out of time:/"
    },
    {
      "id": "l1xg32n",
      "body": "Manipal physics was easy as fuck compared to this and mains"
    },
    {
      "id": "l1xg561",
      "body": "Bhai negative hai na, kyun guess kiya"
    },
    {
      "id": "lbez8k8",
      "body": "Got 700 rank in PESSAT.CAN I GET CSE IN SECOND COUNSELING.SKIPPED IST COUNSELING DUE TO  JEE ADVANCE "
    }
  ]
}