{
  "id": "1cdeuyd",
  "title": "pessat 2024 marks vs rank",
  "content": "&#x200B;\n\nhttps://preview.redd.it/gauvfem2urwc1.png?width=850&format=png&auto=webp&s=d80f9f35cba84d0938f53ff353db78311f495eed\n\nhttps://preview.redd.it/48bd5cm2urwc1.png?width=854&format=png&auto=webp&s=204f819fa8c9282bc9b7b6c28a1fac81bbf44396\n\nhttps://preview.redd.it/cgkguam2urwc1.png?width=1042&format=png&auto=webp&s=c35328caa3e9e2a4e15a7ec55a8185f90ecd7911\n\nare these really gonna happen or anyone who gave pessat please confirm if this is true i am fucked source :- [https://youtu.be/vZtWEnR\\_nq0](https://youtu.be/vZtWEnR_nq0) is this isn't true then please report and dislike this video its very misleading",
  "metadata": {
    "author": "xAnnihilatoRx_",
    "url": "https://www.reddit.com/r/PESU/comments/1cdeuyd/pessat_2024_marks_vs_rank/",
    "permalink": "/r/PESU/comments/1cdeuyd/pessat_2024_marks_vs_rank/",
    "score": 0,
    "created_utc": 1714114644,
    "flair": "PESSAT/Admission",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l1bp9ip",
      "body": "Don't depend on these bogus and clickbait sites and videos. There is no way to predict marks vs ranks because they never disclose the marks and never give out the questions. How will you know which score resulted in which rank? \n\nPESSAT is completely computer based, there are no previous year question papers, and only your rank is provided to you. Since it takes place over multiple dates, your score is normalised and then a rank is assigned, but there is no way to determine how much you scored or what is needed for a particular rank. And with negative marking this year onwards, don't listen to people who say \"I went in without prep and got CS\" or \"I marked everything randomly and got CS\". Things will be significantly different this year."
    },
    {
      "id": "l1bvejc",
      "body": "According to this you need 150/180 for cs in an exam with negative marking lmao"
    },
    {
      "id": "l1cvhll",
      "body": "Cap"
    },
    {
      "id": "l1oijyf",
      "body": "Can you explain why things will be significantly this year?"
    },
    {
      "id": "l1ojxxk",
      "body": "Primarily because of no negative marking. Before, everyone would attempt all 180 questions, even if they knew the answer or not. That's not possible this year. Guesswork comes with potential risk now."
    },
    {
      "id": "l1okku4",
      "body": "Mkay"
    },
    {
      "id": "l1yekl5",
      "body": "It's the same as JEE lol  \n+4 and -1 is the same as +1 and -0.25"
    },
    {
      "id": "l1yj3mc",
      "body": "Exam feels unfair with negative marking, 4 times twice the questions in jee with a disadvantge"
    },
    {
      "id": "l1yj6c0",
      "body": "Then how much do u think will be needed"
    },
    {
      "id": "l1yjfcp",
      "body": "impossible to predict but it shouldnt be more than 120"
    },
    {
      "id": "l1yq27q",
      "body": "U need minimum 3000 rank for cs in rr campus right? 3000 rank is 120 marks?\nI give up"
    },
    {
      "id": "l1yuecp",
      "body": "No you need below 1k rank for cs rr. 3k is for ec campus"
    },
    {
      "id": "l1yupx2",
      "body": "Oh sorry I switched it up\nBut still does it take 120 for 3k?"
    },
    {
      "id": "l1yv15q",
      "body": "No one knows man it’s all guessing. They don’t release marks anyway"
    },
    {
      "id": "l1yx4u0",
      "body": "Oh well we will see ig"
    },
    {
      "id": "l2cc8tn",
      "body": "Exactly this is kinda unfair.. But its for everyone, so dw about it"
    },
    {
      "id": "l2izetj",
      "body": "Bro i didn't like 40 questions correct can I get mechanical engineering? 😭"
    },
    {
      "id": "l2j997i",
      "body": "Wdym? So u got 140 correct and 40 wrong?"
    },
    {
      "id": "l2j9xax",
      "body": "40-60 correct other un answered!?"
    },
    {
      "id": "l2jb1q3",
      "body": "Idk man pes is only good for cs acc to the internet\n\nMaybe ull get idrk thi"
    },
    {
      "id": "l2jb8mw",
      "body": "Yes just confirm as it's a backup option"
    },
    {
      "id": "l2jbap3",
      "body": "are you from manipal?"
    },
    {
      "id": "l2jwy9j",
      "body": "No but I'm getting seat there for cce"
    },
    {
      "id": "l2k2inq",
      "body": "Bro how many marks are you getting in MET phase 1 then?"
    },
    {
      "id": "l2k8los",
      "body": "Bro I'm getting rank near cce starting cutoff"
    },
    {
      "id": "l3kc9h5",
      "body": "Yo , do you know if ranking is done shiftwise like in JEE?"
    },
    {
      "id": "l3zpuoo",
      "body": "Bruh if I scored 160 out of 180 in pessat what would be my expected rank?"
    }
  ]
}