{
  "id": "1cdgpmw",
  "title": "How is BTech campus life?",
  "content": "planning to take btech ece in pesu. how are the timings and how many days do you get leave? I'm kinda sportsperson so i need 1.5 hours in the evening for football and i am planning to learn a core engineering specific software side-by-side. is it as hectic as the people say over the internet?  \nthanks in advance",
  "metadata": {
    "author": "Mgk012",
    "url": "https://www.reddit.com/r/PESU/comments/1cdgpmw/how_is_btech_campus_life/",
    "permalink": "/r/PESU/comments/1cdgpmw/how_is_btech_campus_life/",
    "score": 6,
    "created_utc": 1714122365,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l1bskif",
      "body": "2 days a week it's till 4, once 3:15 and remaining 2 days 1:45. Saturdays we have one online class for 90 mins\n This is for 1st year"
    },
    {
      "id": "l1bsnlm",
      "body": "thanks for clarifying brother. how is ece there?"
    },
    {
      "id": "l1bsta8",
      "body": "1st year all branches are mixed and you will study the same thing. 2nd year onwards the sections will be divided based on branches. Idk about how it's then onwards, maybe a senior can clarify. But do know that pes is known for cse mainly"
    },
    {
      "id": "l1bt1ni",
      "body": "ok bro. ty btw"
    },
    {
      "id": "l1bw489",
      "body": "It is hectic as u heard correct"
    },
    {
      "id": "l1c5sei",
      "body": "Dont join PESU for ECE. If u are coming to PESU, take CSE. \n\nI am 6th sem ECE, I can guarantee tat ECE is hard as fuck, dont join it and its not worth it"
    },
    {
      "id": "l1c9a85",
      "body": "how about  eee and mech? I just don't like  cse"
    },
    {
      "id": "l1cc1h7",
      "body": "Na man, don't listen to anyone. Not only ECE, every engeneering is hard in one aspect or other.  If it's so easy people will do normal degree."
    },
    {
      "id": "l1ccox3",
      "body": "this"
    },
    {
      "id": "l1cnm48",
      "body": "Donno bro, all are hard in their own ways. Nothing is easy from now on"
    },
    {
      "id": "l1csbgp",
      "body": "Was in ECE second year for a month and shifted to CSE during branch change due to the following reasons-\n1)I had a couple of things I was working on other than college,and wasn’t able to make time for them.(I needed about 3 hours on average daily)\n2)I was able to manage ECE and kinda liked it too,but still decided to go for CSE just because it was a bit more relaxed in college.\n3)In my perspective all streams are hard but it’s just that scoring is easier in CSE because of higher relative grading ig?\n4)and ofc ‘bheed chaal!’💀"
    },
    {
      "id": "l1cvo30",
      "body": "I'm from eee 4th sem prolly the toughest sem for eee\nBut eee in general is tough ngl"
    },
    {
      "id": "l1d7d7y",
      "body": "How much cgpa did u have to get to change to cse???"
    },
    {
      "id": "l1dz9xg",
      "body": "2023 mechanical grad here, unless you are “extremely” passionate about mechanical engineering (automotive / aerospace) and physics in general, I would suggest you not to take up Mech at PES. Our batch probably had the last remaining good professors. There are handful remaining good ones and the others are straight up BAD. Some subjects are meant to be difficult and with sub par teaching, it becomes even more difficult."
    },
    {
      "id": "l1h50ev",
      "body": "Is prof chandrashekara still there? I believe he i one of the few good ones left in the clg right? 2020 batch.\n\n we published a paper along with him and presented it in NIT Amritsar and Germany, some of the best memories in this clg are in 3rd and 4th year."
    },
    {
      "id": "l1hapmb",
      "body": "Yeah Dr. CVC was there when I left college. I believe he’s still there but is going to retire in a year or two. Probably one of the passionate teachers in the Mech department. Simply loved to attend his DOME and MV lectures !"
    },
    {
      "id": "l1hicfr",
      "body": "He is been telling this since I was there, His daughter was also part of our group when we did that research paper.  However, I got really busy and lost contact with him."
    },
    {
      "id": "l1ph6dx",
      "body": "same timings for cse ?"
    },
    {
      "id": "l1pxxaq",
      "body": "All branches in 1st year"
    },
    {
      "id": "lfxjevh",
      "body": "What's the timings for the second year??"
    }
  ]
}