{
  "id": "1cdqk6l",
  "title": "Admission in PES through JEE MAINS",
  "content": "Scored 97.2%ile in JEE applied through PES website today but no where it asked my jee roll number or percentile and the dashboard camt be used the links dont work\nI have mailed the institute pls guide\nI have applied for\nCSE\nAI/ML\nECE",
  "metadata": {
    "author": "loenk0d3r",
    "url": "https://www.reddit.com/r/PESU/comments/1cdqk6l/admission_in_pes_through_jee_mains/",
    "permalink": "/r/PESU/comments/1cdqk6l/admission_in_pes_through_jee_mains/",
    "score": 6,
    "created_utc": 1714150773,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l1dyp7d",
      "body": "I applied too, they said they'll mail a link and you need to upload your mains marks card on it when they send it. they haven't sent it yet but watch your mail."
    },
    {
      "id": "l1dyszk",
      "body": "Can i get cs with 96 percentile?"
    },
    {
      "id": "l1dzp3y",
      "body": "Ah ok ok any other colleges you looking for?"
    },
    {
      "id": "l1e0asl",
      "body": "They took 1200 right? \nAnd the dashboard is not responding"
    },
    {
      "id": "l1e1tee",
      "body": "I asked my pes friend \nHe said i might get in"
    },
    {
      "id": "l1e2079",
      "body": "I am giving pessat too"
    },
    {
      "id": "l1fbic1",
      "body": "OP plz tell me did u pay the application fee first and then filled the form or the opposite? And i got 95.81 pr do u think i can get cse in pesu?"
    },
    {
      "id": "l1gjt96",
      "body": "I paid 1200 and it went to a page asking for further details. After filling it we downloaded the application and that was it"
    },
    {
      "id": "l1gku0x",
      "body": "Yeah the page which had fathers name and all"
    },
    {
      "id": "l1gl4gs",
      "body": "Paid first then filled.\nMake sure you do it under btech through jee mains. \nBro even idk competition has increased severely. High percentile people are also seeking admission in PES 🥲"
    },
    {
      "id": "l1gl82h",
      "body": "Cutoff is very high there all the best"
    },
    {
      "id": "l1gn6a8",
      "body": "Apply for all 3 branches\nCSE\nCS (AI/ML)\nECE"
    },
    {
      "id": "l1gpkgl",
      "body": "Can we apply through both pessat exam and jee scores? Can anyone confirm me"
    },
    {
      "id": "l1ifiao",
      "body": "You need to get below 10k for that in jee m"
    },
    {
      "id": "l1iiwtu",
      "body": "Wtf man why would someone join pes with that rank. Is there any college left in this fucking country who doesnt want fucking AIR 1"
    },
    {
      "id": "l1ijagw",
      "body": "They don't want anyone from jee to join them as the fees would diffeent for them"
    },
    {
      "id": "l1ijkol",
      "body": "Bhai 10k rank ka matlab jaante ho? 99.5%ile + . Chod  bc management le raha mai at max\nI am done with this bs"
    },
    {
      "id": "l1ik47w",
      "body": "Bhai management mei 50 l+ for cse ig 😭😭 i am not sure tho"
    },
    {
      "id": "l1ikng3",
      "body": "What i heard from my friend in pes is admission is based on percentile not rank. And thanks to this overpopulated country i cant get iiit. Just hoping for pes now."
    },
    {
      "id": "l1iqnap",
      "body": "You need 98 as far as I remember. Someone commented about this on a post a few days ago."
    },
    {
      "id": "l1ir8f9",
      "body": "Oh\nAnd what about pessat? Is it required if i go through mains? They haven't asked my mains marks also yet"
    },
    {
      "id": "l1irvsi",
      "body": "You don't need to give Mains to give PESSAT, same for the other way round."
    },
    {
      "id": "l1is4ca",
      "body": "I meant if i am seeking admission through mains i dont have to give pessat right?"
    },
    {
      "id": "l1is8uo",
      "body": "Nope, as far as I know. Might want to confirm with someone who joined via Mains, but that's rare to find. Best way is to ask PES directly."
    },
    {
      "id": "l1ismzh",
      "body": "I cant find anyone plus office will be closed till monday and then pessat is till next week 😭"
    },
    {
      "id": "l1j2q3t",
      "body": "Why not email them"
    },
    {
      "id": "l1j41qy",
      "body": "They copy pasted their website stuff 🤡"
    },
    {
      "id": "l1j7uzw",
      "body": "Then reply back and ask for clarification"
    },
    {
      "id": "l1j7zmo",
      "body": "I mean i will just call on Monday that will be way better"
    },
    {
      "id": "l1jzd9d",
      "body": "you applied ok but do you think its worth it? paying 4.8 lakhs per year if you join cs   \nif you are a citizen of karnataka you wrote kcet? what happened to that"
    },
    {
      "id": "l1k3t8h",
      "body": "The ranks this year are trash they have doubled at the same percentile cause the number of candidates increased drastically. So left with no options but private colleges. I reside in Bangalore and ig it's better to get a private college here than dinner tier 2 City. I couldn't give kcet because i don't have domicile. Will give comedk"
    },
    {
      "id": "l1k4tk0",
      "body": "Even I am your batch only lol\nIf you revise well enough i believe you have a good chance of getting  rv cse  being a 97.2%iler even after the bs that happened this year \nAnd pesu doesnt take admissions through comedk"
    },
    {
      "id": "l1k6u08",
      "body": "I did. But to be very honest I am tired of all this bs i just want peace i will settle for less 😭"
    },
    {
      "id": "l1kw7sh",
      "body": "how many did u attempted and how many guess work??"
    },
    {
      "id": "l8l7gyb",
      "body": "Is the admission process closed?"
    },
    {
      "id": "l8l7qti",
      "body": "Yeah"
    },
    {
      "id": "lg3y55j",
      "body": "Can i get something in pes at 82 percentile"
    },
    {
      "id": "lg3ybl1",
      "body": "You can check but ig no"
    },
    {
      "id": "lj39npz",
      "body": "Can i get in pes with 91 percentile if at all i get what branch"
    },
    {
      "id": "lj39sl7",
      "body": "Can i get in pes with 91 percentile if at all i get what branch"
    }
  ]
}