{
  "id": "1cefl12",
  "title": "Is the pessat mock test available on the website?",
  "content": "I can't find it on the website if it is there pls do tell me where I can find it. I am asking cuz Vit had one on their website. Also is there an on-screen calculator available in pessat like viteee? ",
  "metadata": {
    "author": "crazy_confused96",
    "url": "https://www.reddit.com/r/PESU/comments/1cefl12/is_the_pessat_mock_test_available_on_the_website/",
    "permalink": "/r/PESU/comments/1cefl12/is_the_pessat_mock_test_available_on_the_website/",
    "score": 1,
    "created_utc": 1714227503,
    "flair": "PESSAT/Admission",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l1i7p4r",
      "body": "bro belive me i gave pessat on 25....no test is relevant for pessat on onternet...every shift i quiet different...  \nin my shift there was not a single question fro vector 3d in 60 que of maths and it had like 5 que from itf and 5 from continuity atleast..just go and give exam nothing is predictable there"
    },
    {
      "id": "l1i8zdu",
      "body": "whaaaaaaaaaattttttt???????????? no way they cant make it this diverse it should be similar"
    },
    {
      "id": "l1ikg1m",
      "body": "This happens every year. Many report that some shifts are pretty difficult or very unnatural in selection of questions. Your scores will be normalised anyway before assigning a rank, so no point thinking too much about it."
    },
    {
      "id": "l1ilddd",
      "body": "thanks mate for the info"
    },
    {
      "id": "l1jxaqz",
      "body": "Dude should we do the deleted portions in chemistry like S block, Hydrogen, Solid state etc. for Pessat?"
    },
    {
      "id": "l1n0d3k",
      "body": "so is there an on screen calculator or no?"
    },
    {
      "id": "l1rkxy7",
      "body": "It's there"
    },
    {
      "id": "l1rl1bq",
      "body": "Yeah I gave my exam today, the calculator was so damn shit"
    },
    {
      "id": "l1rz8dm",
      "body": "Seriously what was the issue ?"
    },
    {
      "id": "l1si22u",
      "body": "It's not a scientific calculator, you can't take root or use trigonometry. \nYou can't even do powers of any number.\nEven if you double click it doesn't even take the number twice which was kinda annoying tbh"
    },
    {
      "id": "l1syvxi",
      "body": "I see , that sucks . I don't recall how the calci was during pessat but it helped out a lot tho . I literally was able to finish chem numericals in 20-30 sec due to the calci."
    },
    {
      "id": "l1tjfva",
      "body": "Was chemistry and physics easy atleast?"
    },
    {
      "id": "l1tu41x",
      "body": "yeah physics was flooded with electrodynamics and it was easy with some moderate questio and chem was the easiest ig"
    },
    {
      "id": "l1tw0mb",
      "body": "Good to know\nAiming for 45 for phy and 50 for chem+eng\nDunno about maths will be lucky of I get 30"
    }
  ]
}