{
  "id": "1cf58n5",
  "title": "Any Idea about the actual average placement package for MBA?",
  "content": "Hey everyone, I'm thinking of getting myself into PES for MBA, I have no worries about the education standards or campus etc. my only concern is the placement package, in the brochure they've mentioned the avg of 8lpa for mba students, and last year's data shows the median salary package of mba was 5.60 lpa in pesu.\n\nMy question is how skewed is the placement packages? Is it balanced with like 6-7ish lpa or its actually imbalanced and only like top 5-8% gets the 8lpa package.\n\nSorry for the long a** question. 🙂",
  "metadata": {
    "author": "Src_oscar",
    "url": "https://www.reddit.com/r/PESU/comments/1cf58n5/any_idea_about_the_actual_average_placement/",
    "permalink": "/r/PESU/comments/1cf58n5/any_idea_about_the_actual_average_placement/",
    "score": 5,
    "created_utc": 1714307245,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l1mrsy6",
      "body": "I know students won't have proper data to answer this, but maybe they've discussed it with their professors or seniors, and have some idea."
    },
    {
      "id": "l1p1axo",
      "body": "Yo this is one question I have asked 2 times on this group, no response. Please tell"
    },
    {
      "id": "l1p1cg5",
      "body": "I have already paid the booking fees tho"
    },
    {
      "id": "l1p1i9z",
      "body": "Could you please share the brochure?"
    },
    {
      "id": "l1q7yx6",
      "body": "No one knows exactly figures because clg don't disclose those figures. \n\nAnd also don't blindly believe whatever placement cells says."
    },
    {
      "id": "l1q9rnn",
      "body": "I have to pay for this coming week"
    },
    {
      "id": "l1qbqda",
      "body": "That's why I'm asking someone who went through a placement drive or talked to someone like that."
    },
    {
      "id": "l1qcpxm",
      "body": "Ideally PES is not known for its MBA, so you can figure out why reasons. Because it's not as good as engeneering in that clg."
    },
    {
      "id": "l1r4dqe",
      "body": "Majority of the people in this sub are engineering students so they wouldn’t have much knowledge about other courses."
    },
    {
      "id": "l1rg9fp",
      "body": "Hmmmn"
    }
  ]
}