{
  "id": "1cfvxzq",
  "title": "Thoughts on cutoff theough JEE",
  "content": "I asked them the cutoff on call and they said its 98.5 for cse and 97 for ece. Do you guys think its real or just a marketing gimmick? ",
  "metadata": {
    "author": "loenk0d3r",
    "url": "https://www.reddit.com/r/PESU/comments/1cfvxzq/thoughts_on_cutoff_theough_jee/",
    "permalink": "/r/PESU/comments/1cfvxzq/thoughts_on_cutoff_theough_jee/",
    "score": 8,
    "created_utc": 1714387330,
    "flair": "PESSAT/Admission",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l1rns3t",
      "body": "Got 97.2 myself"
    },
    {
      "id": "l1rob13",
      "body": "I know a guy in ec campus who got above 98. So i suppose it's a possibility\n\nBut really stupid though"
    },
    {
      "id": "l1row2f",
      "body": "98 for ec campus really??? 🥸"
    },
    {
      "id": "l1rrklc",
      "body": "He said he applied late so maybe that was a factor. \n\nBut i don't know I'm just telling you the percentile of a guy in ec"
    },
    {
      "id": "l1rujai",
      "body": "when i visited the campus they told me the same thing so not a marketing gimmick. it might be because they don't want many admissions through jee cuz they'd have a different fees."
    },
    {
      "id": "l1rw61l",
      "body": "Maybe they are trying to establish themselves as a great institution. Lets see only counselling will tell us"
    },
    {
      "id": "l1s59o4",
      "body": "hopefully. but from what I've heard even last year cutoffs were quite high"
    },
    {
      "id": "l1s6htk",
      "body": "Different fee for jee...can you explain more"
    },
    {
      "id": "l1s8qgr",
      "body": "the fees is higher if u get in through pessat rather than kcet (so I'm assuming it applies for jee as well but I'm not sure)"
    },
    {
      "id": "l1s8qpx",
      "body": "No, the fees through JEE Mains and PESSAT are the same. You can refer the PES website for details."
    },
    {
      "id": "l1s93hh",
      "body": "ohh okk i didn't know that my bad"
    },
    {
      "id": "l1s94sb",
      "body": "Not a marketing gimmick - every year people ask the same question and its always the same answer: 98 percentile for CS. Also, its not worth joining via JEE since there is basically no advantage - the fees is the same as PESSAT. Why work your ass off to get 98 percentile in JEE Mains and pay the same as someone who got in through CET-level PESSAT lmao.\n\nHere is the link to the fees: [https://pes.edu/fee-details/](https://pes.edu/fee-details/)"
    },
    {
      "id": "l1s9qb5",
      "body": "No worries, but please double check your facts before posting next time to avoid misleading others. \n\nJEE/PESSAT seat fees have always been the same. I have added a separate comment about it and linked the fee details page too."
    },
    {
      "id": "l1t9gv5",
      "body": "are u giving pessat. if yes then on which date. and plzz consider lnmiit jaipur its better and one of my dream college but couldnt get in cause of my percentile."
    },
    {
      "id": "l1ta24v",
      "body": "I am giving on 3rd. Registered for lnmiit idk how to convince dad tho"
    },
    {
      "id": "l1tagbx",
      "body": "lnmiit and pes have same fees infact lnmiit has better campus,alumuni, coding culture and placements. What other reasons do u need"
    },
    {
      "id": "l1tbvck",
      "body": "How would you compare it with lower tier iiits"
    },
    {
      "id": "l1tmqam",
      "body": "its better than lower tier iiits im from ranchi and here is iiit ranchi which has shit campus 33k cutoff and shit placements"
    },
    {
      "id": "l28hdk9",
      "body": "it's that high since they barely have any seats for admissions thru jee. there are like 30 seats for cse iirc. so the cutoff skyrockets. you'll notice this in jee cutoffs for mhtcet colleges too. even the shittiest colleges have like 94-95 as cutoff."
    },
    {
      "id": "l2y8twy",
      "body": "i didn't fill pessat before and it shows now that if you register now you need to visit the campus to attempt the exam is it like true ?"
    },
    {
      "id": "l2y919v",
      "body": "How would I know man"
    }
  ]
}