{
  "id": "1cgqwqs",
  "title": "30s1",
  "content": "Thoda hard laga? Physics higher than mains imo but still manageable, maths bohot easy tha but I ran out of time:/\nTum log ka kya scene",
  "metadata": {
    "author": "Gloomy-Visit-8641",
    "url": "https://www.reddit.com/r/PESU/comments/1cgqwqs/30s1/",
    "permalink": "/r/PESU/comments/1cgqwqs/30s1/",
    "score": 0,
    "created_utc": 1714477901,
    "flair": "PESSAT/Admission",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l1yb1yg",
      "body": "Hi\n negative marking h kya is saal?"
    },
    {
      "id": "l1yb5kf",
      "body": "Yes"
    },
    {
      "id": "l1ybev7",
      "body": "0.25 marks right?"
    },
    {
      "id": "l1ybh5g",
      "body": "Anyways why did they start negative marking this year only"
    },
    {
      "id": "l1ybizw",
      "body": "They want to fuck us from every damn angle"
    },
    {
      "id": "l1yihl1",
      "body": "Physics higher than mains?"
    },
    {
      "id": "l1yj1gq",
      "body": "That's what I felt, quite a bit from radioactivity and all"
    },
    {
      "id": "l1yyczq",
      "body": "total attempts and how many guess work bro??"
    },
    {
      "id": "l1z03k4",
      "body": "I attempted around 85,no guesswork, everyone at the centre found it hard so hopefully normalization hoga"
    },
    {
      "id": "l1z1pz0",
      "body": "bro very nice decision of u for not doing guess work i also attempted 93 and i my paper also there were questions from radioactivity and carnot. everbody at the centre was talking about guess work but i choose not to do it because there was huge probability in getting negative score or just gaing zero or just inc of 1-1.5 marks"
    },
    {
      "id": "l1z1wxl",
      "body": "Bro when I was attempting my 75th question girl in front of me was on 100th😭 btw tera paper kaise tha"
    },
    {
      "id": "l1z55wp",
      "body": "abe rehne de na kya pta tukka maar rhi ho waise bhi hrr shift se kch bcche chuun ke aayenge mere shift me toh bhot logo ko pta hi nhi tha ki negative marking hai mere bgl wale ne full attempt kiya tha. physics mains se upar tha aur time constraint tha still i managed 47 question in phy aur chem deleted potion se   mila ke atleast 12 sawaal the aur maths to mereko aati hi nhi only 5 attempted aur maths me planes se bhi  tha . thora aur serious hoke deta to atleast 100 attempt kr leta. but anyway.."
    },
    {
      "id": "l1z7lsy",
      "body": "Haan bhai hopefully hamara rank upar jayega because people didn't know about negative. EC rr campus mein mil gaya toh set"
    },
    {
      "id": "l1z7rli",
      "body": "Maths bohot easy yha lekin time nahi tha, kya baay hai, jee se tough sawal puche or time bhi nahi diya, bakchodi at its finest."
    },
    {
      "id": "l21itq8",
      "body": "I couldn't understand what the entire centre was saying 😭😭😭😭😭😭\n\n(I don't understand kannada)"
    }
  ]
}