{
  "id": "1chf2lq",
  "title": "Backlogs ",
  "content": "I have so many doubts on how it works here, I have my first two semesters as backlogs and I read somewhere that I can have only 24 credits worth of backlog to go to next year. I was in my first year and i messed up big time and I still am at the same point where I was in the beginning and there's a backlog exam coming in the end of this month and I'm very under-prepared and I'm freaking out but also totally gave up. Also I heard someone say there is backlog exams coming in July too. If I can't write now, can I write it in July and how much am i supposed to pay for 5 subjects per semester? Can I still go to second year if i clear out one semester's backlog exams? Thankfully the college hasn't contacted my parents about this and lack of attendance. So they don't know about my current situation. I'm clueless and college isn't helping much atm and I can't drop. Help me out on this backlog confusion.",
  "metadata": {
    "author": "Anxious-Living813",
    "url": "https://www.reddit.com/r/PESU/comments/1chf2lq/backlogs/",
    "permalink": "/r/PESU/comments/1chf2lq/backlogs/",
    "score": 2,
    "created_utc": 1714544310,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l229bix",
      "body": "Bruh say clearly how many subjects u have backlogs in?"
    },
    {
      "id": "l22cbqc",
      "body": "2 whole semester's\n5 subjects each semester"
    },
    {
      "id": "l22cik3",
      "body": "So, 10 subjects backlogs. Woaah, thats a lot. which semester are u in now?"
    },
    {
      "id": "l22cvkj",
      "body": "I'm in my second semester but I'm not going to sit for second semester exams too. Low attendance. Before you people assume some shit, I had some issues and I can't talk about it with anyone, especially with my parents so I had to take skip classes."
    },
    {
      "id": "l22dz17",
      "body": "Might as well rejoin PES at this point /s"
    },
    {
      "id": "l22e1tp",
      "body": "Start from first year? Can't I just write backlogs for the first semester now and the second semester in december?"
    },
    {
      "id": "l22feni",
      "body": "I'm kidding. Ideally that's what happens when you have a few backlogs, not the full year. Best to ask the HOD."
    },
    {
      "id": "l22fiem",
      "body": "Bro I'm already freaked asf 💀\nI did ask the HOD but they said they don't have proper info atm and they don't really know either"
    },
    {
      "id": "l22fmc4",
      "body": "Wow looks like you're creating history 💀\nThen ask them to find out soon. Talk to the COE as well. I don't think someone on reddit will know since this is a very exceptional case."
    },
    {
      "id": "l22vopq",
      "body": "Go to the HOD and the COE (Exam section head). Nobody on reddit or discord can help."
    },
    {
      "id": "l23he40",
      "body": "Dumb fuck ur sem didn't  get over yet don't say u have 10  subjects in  back before that, 1st finish this sem as much as possible"
    },
    {
      "id": "l23hkrk",
      "body": "Dude I literally have no attendance and yes I've got 10 subjects of backlog. I'm not even lying. Stfu"
    },
    {
      "id": "l245d99",
      "body": "first thing is clg wont contact ur parents about anything  cause our clg cares about ur problems only during ptm , the only problem u may face is ur mentor (if u have one assigned), make sure ur parents dont receive any mails regarding ptm(block em all for time being) , from today create a fake email id in the name of ur parents and use them in clg if they ask u to fill any information sheet , this will help u a lot.\n\nSecondly , dont Panick so much if you are yet to write the second sem exams , take not more than three subjects from first year , it is very much difficult to clear first year backlog subjects as the passing marks are much higher than the usual ESA.   \nnot just try but u should definitely  start studying from today itself , if u sit without any distraction u can complete two full units and important questions from rest of the units in a single day, but if u are aiming for S grade u can complete all the units in two days , you still have 5 days to for the exams to start , can easily ace this if u concentrate ,  u have the internet  u can find every solution on youtube , i have seen ppl clearing both sem and backlog exams at a time , dont lisetn to anyone start studying from today.  \nALL THE BEST!!!!!"
    },
    {
      "id": "l24ptvk",
      "body": "Chill bro we all are homies out here u can share ur problems.I am a pesu graduate who had low gpa."
    },
    {
      "id": "l45pwzu",
      "body": "If I’m unable to write my backlogs during esa and during summer, can I take it up in the upcoming semester?"
    },
    {
      "id": "ldv09ft",
      "body": "I am studying BTech 1st year in pes  Engineering college I have got 7 backlogs will I be eligible for second year"
    }
  ]
}