{
  "id": "1chisxf",
  "title": "can anyone explain exactly what it means to drop or withdraw a subject",
  "content": "im in fourth sem and i'm thinking of dropping my special topic. i'm not doing that great in the core subjects itself right now and i don't want to risk losing the scholarship by messing up the special topic.\n\ni heard you cant get scholarships if you fail a subject. is it the same if you drop or withdraw?\n\nwhat do they even mean exactly. do you think it's something worth doing",
  "metadata": {
    "author": "meddlin_cartel",
    "url": "https://www.reddit.com/r/PESU/comments/1chisxf/can_anyone_explain_exactly_what_it_means_to_drop/",
    "permalink": "/r/PESU/comments/1chisxf/can_anyone_explain_exactly_what_it_means_to_drop/",
    "score": 4,
    "created_utc": 1714559394,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l22o57e",
      "body": "If you withdraw a subject you don't need to write ESA for that subject and you can clear it as a backlog"
    },
    {
      "id": "l22ow8g",
      "body": "will it be counted in my sgpa calculation? will it be like (existing + 0\\*2 credits/existing +2 credits)"
    },
    {
      "id": "l22pgdq",
      "body": "It will be shown as withheld and will be updated once you clear the exam"
    },
    {
      "id": "l22z3hp",
      "body": "you can drop a spl topic no problem"
    },
    {
      "id": "l7jhbcz",
      "body": "but what if you drop a subject?"
    },
    {
      "id": "l7jhf7j",
      "body": "like a core 4 credit subject?"
    },
    {
      "id": "l7jptyt",
      "body": "You can but they wouldn't recommend you to do so because at a later point of time you may find it difficult to cover it in backlogs due to other commitments in your semester."
    },
    {
      "id": "l7k253x",
      "body": "wait so if i drop in my first year at some point during the entire 4 years i will have to write the exam?\nthere’s no never writing eh exam concept?"
    },
    {
      "id": "l7k27vw",
      "body": "Nope"
    },
    {
      "id": "l7k2a3j",
      "body": "They won't give you your degree if you have any pending backlogs"
    },
    {
      "id": "l7k2iad",
      "body": "so there’s is no difference between drop and withdrawal no matter what at some point imma have to write ?"
    },
    {
      "id": "l7k2ka4",
      "body": "Yes"
    },
    {
      "id": "l7k2kia",
      "body": "also can i dm?"
    },
    {
      "id": "m5uu1e1",
      "body": "if i drop constitution will i have to write it again"
    },
    {
      "id": "m5z1rcl",
      "body": "Bro you can't drop a fundamental course (fc) , it will be considered as backlog"
    }
  ]
}