{
  "id": "1chjewf",
  "title": "PESSAT Difficulty",
  "content": "Hey guys, I know that this a repeated questions, but please just help me out.\n\nI have seen many other posts on reddit and all of them are saying different thing. So people, especially those who have given PESSAT 2024 please tell me what all I should except and prepare. Thank you very much!\n\nPS-My exam is tommorow shift 1",
  "metadata": {
    "author": "Capital_Situation235",
    "url": "https://www.reddit.com/r/PESU/comments/1chjewf/pessat_difficulty/",
    "permalink": "/r/PESU/comments/1chjewf/pessat_difficulty/",
    "score": 6,
    "created_utc": 1714561533,
    "flair": "PESSAT/Admission",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l22tt0v",
      "body": "Man atp, what can you even do, formulas revise kar le, what comes in the exam can be unpredictable. Give it your best shot."
    },
    {
      "id": "l22yl2x",
      "body": "ohh, because the thing is, this and then last BITSAT is my hope, COMEDK is also there, but just these 2 colleges I have, so I am really tensed"
    },
    {
      "id": "l22yykn",
      "body": "I feel you man, I've been pretty stressed since my pessat yesterday, but there's nothing more you can do tomorrow. Abh bits key liye padhai kar le, I'm doing that too. Manipal ka second attempt bhi important hai, uske liye bhi prepare kar. You got this bro, stress mat lo aur padhai pey dhyan rak"
    },
    {
      "id": "l2303xn",
      "body": "ohh you gave PESSAT? how was it?, also can I dm you please?"
    },
    {
      "id": "l2305e2",
      "body": "Yep"
    },
    {
      "id": "l236b0s",
      "body": "Many ppl say its as hard as jee and many ppl say it's as easy as boards \n\nI'm preparing for comedk and so far I only finished chem\n\nDon't know what I'll do for maths but for physics I'll just revise all formulas\nMaths idek"
    },
    {
      "id": "l2382j3",
      "body": "bro i think only COMEDK won't be enough, when's your PESSAT?"
    },
    {
      "id": "l23bfxn",
      "body": "It's different for different shifts so yeah there's a difference"
    },
    {
      "id": "l23dxvl",
      "body": "It's on the 10th of this month, I already know I'm pretty screwed bcs I don't plan to touch 11th std maths\n\nComedk might not be enough but I'll just try to somehow bring up 100 marks using English chem and phy (and a bit of 12th maths) but ye not expecting much"
    },
    {
      "id": "l23qet7",
      "body": "man dont worry about the difficulty each shift is different for mine today second shift the area under curve could be seen a lot just get yourself familiar with all the formula and concepts you see in jee you will be good to go"
    },
    {
      "id": "l23rjf4",
      "body": "Yeah man same problem 11th ka all three subject nahi kiya aur 12th ka abhi bhi mujhe preparation karna hai like I did portion but confidence nahi hai bhaut karab situation hai bhai"
    },
    {
      "id": "l23sg63",
      "body": "What r u going to do? \nI doubt without getting atleast 100 makes for pessat we can get cse\n\nI'm juts going to do full chemistry and phy( not in depth just cbse lvl) and 12th maths from ncert\nI'll also get a shit ton of questions\n\nMay God bless"
    },
    {
      "id": "l23tr0i",
      "body": "but atleast it won't cross the level of JEE or BITSAT right? hopefully most of the questions are direct formula based"
    },
    {
      "id": "l23vb6n",
      "body": "Same. Really so bad situation it is yaar\n."
    },
    {
      "id": "l241p0w",
      "body": "jee ke liye padha h toh physics aur chem mostly ho jayega physics was surely touching mains level in my shift (as jee phys level is dropped)  aur maths ka mera bhi halat kharab tha. in english first 10 question are comprehension every easy. now u just chill..."
    },
    {
      "id": "l242b16",
      "body": "bhai jee ke liye padah to hai, atleast for 12th, 11th JEE is not much hope, I have been preparing BITSAT level qs for this past 2 months"
    },
    {
      "id": "l2433es",
      "body": "ho jayega bhai dont worry 12th is predominant in physics (electro and magnetism)and chem me oc aur physical se jayada ayega"
    },
    {
      "id": "l243etu",
      "body": "and ray aur waves se bhi bhot question the"
    },
    {
      "id": "l26fa3m",
      "body": "ok ok thank you bhai"
    },
    {
      "id": "l299nfj",
      "body": "kaisa gya bhai??"
    },
    {
      "id": "l29hb68",
      "body": "bhai honestly I wsa over thinking, maths was very easy, physcis was little tough but definitely doable. I would say that if you've prepared for JEE properly then this exam will be a cakewalk(provided you also have learned deleted syllabus)"
    },
    {
      "id": "l2au0no",
      "body": "bhai how many attempted??"
    },
    {
      "id": "l2c5voi",
      "body": "130 bhai, i know it's not much, but there was no time left"
    },
    {
      "id": "l2cmhzu",
      "body": "guess work how many??"
    },
    {
      "id": "l2dieoa",
      "body": "Max 10 to 15"
    },
    {
      "id": "l2is594",
      "body": "Bhai is there 0.25 negative marking for every wrong question or no negative marking? Website pe negative marks bol rakha h"
    },
    {
      "id": "l2j9nug",
      "body": "yea bro there is negative marking"
    },
    {
      "id": "l3g8tu2",
      "body": "How'd it go?"
    },
    {
      "id": "l3g9i5j",
      "body": "Mad ass, shit was hella difficult for fucks sake. It's jee level\nWhen's ur?"
    },
    {
      "id": "l3g9m9z",
      "body": "same shift. I feel devastated"
    },
    {
      "id": "l3g9ye6",
      "body": "So it was difficult for u too right? Man I honestly think this was harder than this years mains"
    },
    {
      "id": "l3gagmc",
      "body": "I can't answer for physics because I haven't studied thoroughly. But chemistry I would say that my jee main questions were easier than today's. Math was alright, but again, I'm not thorough with 11th syllabus."
    },
    {
      "id": "l3gcfc0",
      "body": "Maths was hella tough right???"
    }
  ]
}