{
  "id": "1cj8dv1",
  "title": "4th year",
  "content": "How does the 4 year go?\n\nDo we have any compulsory courses to do even if have all extra credits from special topics that are needed.\n\nCan we stay at home and not come to clg. Is the attendance or in person classes compulsory to attend?\n\nAlso if we get internship in this summer after 6th sem for 6 months can we do it and will college allow that?",
  "metadata": {
    "author": "pesuclassof2025",
    "url": "https://www.reddit.com/r/PESU/comments/1cj8dv1/4th_year/",
    "permalink": "/r/PESU/comments/1cj8dv1/4th_year/",
    "score": 2,
    "created_utc": 1714742045,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l2ea1vt",
      "body": "1. If you can clear all course requirements (154 credits of coursework + Capstone) then you won't need to take up more courses. If you do not, then the remaining 6 credits are met through internship, or more courses.\n2. Classes in final year are usually online without attendance. \n3. You can do an internship, but remember that you are allowed a maximum of 2 credits (as far as I remember) from a summer internship. Nobody will stop you from completing the internship but you will not be able to claim full credit from it. Also, do not tell University that it is more than 2 months."
    },
    {
      "id": "l2eqh56",
      "body": "Isn't summer internship after 6th sem compulsory?"
    },
    {
      "id": "l2et52e",
      "body": "Nope. You think everyone in the batch secured an internship?"
    },
    {
      "id": "l2f1a1c",
      "body": "Why not tell Uni if it is more than 2 months?"
    },
    {
      "id": "l2f2k29",
      "body": "You don't want PES to cause issues right? xD\n\nJust know that there might be potential problems which you might want to avoid"
    },
    {
      "id": "l2fd4xj",
      "body": "Oh , I thought it was compulsory 🤡. Not many people have gotten it. But it is compulsory in 8th sem right ? "
    },
    {
      "id": "l2fe4ig",
      "body": "It isn't. If you don't get an internship, just cover up using coursework."
    }
  ]
}