{
  "id": "1ck3xu2",
  "title": "Scared of engineering.",
  "content": "I am really scared of choosing engineering but iI r ally want to be an engineer. I have really not done much of physics in grade 11 hardly upto state board 12th a bit better than board. I heard in 1st year we will have again phy n chemistry I am really scared. Math I am good n I am also instrested. So iI am getting scared weather iI will fail in 1st sem. I ready to work. Please give valuable suggestions or guidance. Like in phy n Chem  which chaperts should I perfect with or atleast basics of which chapter \n\n&#x200B;",
  "metadata": {
    "author": "Resident_Mark_2338",
    "url": "https://www.reddit.com/r/PESU/comments/1ck3xu2/scared_of_engineering/",
    "permalink": "/r/PESU/comments/1ck3xu2/scared_of_engineering/",
    "score": 1,
    "created_utc": 1714839258,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l2kmve6",
      "body": "If you want to be an engineer, and you're ready to do the work, then that's 90% of the job done! The first year is definitely manageable, you don't have to worry too much."
    },
    {
      "id": "l2kn4dm",
      "body": "Gives me some hope. "
    },
    {
      "id": "l2kvbjf",
      "body": "u wont feel a lot of stress in the first year as the subjects will kinda feel more like what you have already been studying and consistent effort can put you ahead of the competition ahead of time... :)"
    },
    {
      "id": "l2l9asl",
      "body": "What the fuck is going on in this sub?"
    },
    {
      "id": "l2n6ykk",
      "body": "Your engineering physics and chemistry are VERY different and way more interesting than your 11th and 12th physics and chemistry. The only thing I can think of that you should remember from 11th and 12th is matrices and calculus. Your math in the first year will be filled with calculus.\n\nTo give you hope, I didn't know anything in 11th and 12th when I came to PES. I hated chemistry. my academics were completely screwed then because of online classes. Despite that, I found 1st sem courses very interesting and I aced them acquiring a scholarship. If I can do it, why can't you?"
    },
    {
      "id": "l2n78ot",
      "body": "Thanks a lot bro, I will be perfect with matrices n calculas "
    },
    {
      "id": "l2nii9w",
      "body": "1st year ain't PCM ain't the same PCM that u studied.. its much more easier.."
    }
  ]
}