{
  "id": "1cljwg4",
  "title": "Is CDSAML worth it???",
  "content": "I'm in 4th sem, and this summer, I have an opportunity to intern at a startup with a stipend. People I know tell me that CDSAML is very good and it's better than the startup opportunity cause I'll be able to publish a research paper. Which one should I choose? will CDSAML look better on my resume??",
  "metadata": {
    "author": "Consistent-Form-8212",
    "url": "https://www.reddit.com/r/PESU/comments/1cljwg4/is_cdsaml_worth_it/",
    "permalink": "/r/PESU/comments/1cljwg4/is_cdsaml_worth_it/",
    "score": 6,
    "created_utc": 1715004342,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l2u1xmj",
      "body": "did they select people already?"
    },
    {
      "id": "l2u6ng8",
      "body": "The startup would be better"
    },
    {
      "id": "l2u6plb",
      "body": "The startup would be better"
    },
    {
      "id": "l2uicr3",
      "body": "Both are going to provide a very different kind of experience. I don't think it's possible to say for sure which one will be better without knowing your interests, but to summarise:\n\nCDSAML will be research focused. You'll work on a research statement and try to solve the problem. Your work may or may not end up in a paper - depends a lot on your guide, the problem as well as how much work you put in. It will also allow you to walk away with a good academic/research LOR, which is helpful for Masters. If you're looking to get into research, CDSAML will be a very good starting point and will also help you get better opportunities in the future. However, this won't help you too much with job interviews. You'll also get to do a lot of primary, involved, and effective work here which you can talk about. \n\nStartups recruiting non final year students usually don't assign concrete work. You'll probably at most get some side work to help get the main work done. Regardless, it's always a good work experience to pick up and will help you during job interviews. If you do great work, you might even get an industry LOR which helps with Masters too (although not as much as an academic one). If you're looking to get into research roles then this experience won't help you too much later. However, note that you may not get anything substantial to talk about on your resume out of this and will mostly be a very filler item."
    },
    {
      "id": "l2uj2r8",
      "body": "the startup I'll be working with is based on computer vision, and I'll be training models, fine-tuning them and pre processing data. Is this considered filler work? or is this better than what I'll probably work on at CDSAML?"
    },
    {
      "id": "l2ulv71",
      "body": "Doesn't sound like filler work, but then again it's not guaranteed you'll get to work on all that. The work at CDSAML will depend on the project that your guide is working on. Ideally, research internships tend to be more intensive. \n\nI don't think it's possible to make the wrong choice here. Pick the one which you think you're more inclined towards. Don't look at the pay, look at the overall experience + nature of work + scope for other opportunities/returns."
    },
    {
      "id": "l2v61t8",
      "body": "i mean startup anyday fuck it and ball with the startup"
    },
    {
      "id": "l2xs9a5",
      "body": "Did they send emails to the people who were selected already?"
    }
  ]
}