{
  "id": "1cn0oyf",
  "title": "How to study for C programming (2nd sem)",
  "content": "C was my worst performance in ISA 1 and I'm trying to do better in the upcoming ISA 2 and ESA, but I feel that the way I'm studying is inneficient. I keep coding but I often struggle with logic and that puts me off. I dont know how to go about it at this point. Any advice?",
  "metadata": {
    "author": "friedchutney",
    "url": "https://www.reddit.com/r/PESU/comments/1cn0oyf/how_to_study_for_c_programming_2nd_sem/",
    "permalink": "/r/PESU/comments/1cn0oyf/how_to_study_for_c_programming_2nd_sem/",
    "score": 3,
    "created_utc": 1715161930,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l33zmmn",
      "body": "Instead of letting it put you off, make a habit of self humiliation when you fail. \n\nFailing has been punished and thought of as the worst thing in the world mainly due to the Indian education system. It is not. It's what makes you stronger. Instead of going 'ah shit I can't get this thing too while the others are', go 'ah shit I'm an idiot, anyways, what's next?' \n\nI'm not telling you to criticize yourself but to have a light heart about it. Failing isn't bad. \n\nKeep coding mate, you're on the right path! \n\nIf it helps, I've made C notes while I was in my first sem and many people have reported it to be very helpful. Let me know if you want them, I'll be happy to send you a link"
    },
    {
      "id": "l342nt3",
      "body": "Send link"
    },
    {
      "id": "l34814h",
      "body": "+1"
    },
    {
      "id": "l348kjl",
      "body": "Please do send the link, it would be of great help.\n\nThank you!"
    },
    {
      "id": "l349ct8",
      "body": "[https://drive.google.com/file/d/1gyqIk-6y7PhCgorGSf6a2XpIk2WtwuCh/view?usp=drive\\_link](https://drive.google.com/file/d/1gyqIk-6y7PhCgorGSf6a2XpIk2WtwuCh/view?usp=drive_link)\n\nthis drive has everything for physics cycle in second sem. including c and math. \n\nc was a really enjoyable subject, just understand the logic and you will be able to do everything. there are a couple of txt files in the c folder. read those, it's basically all the theory and codes which are in the syllabus but in short files"
    },
    {
      "id": "l34b4om",
      "body": "hey there, can I have the link too?"
    },
    {
      "id": "l354rye",
      "body": "Hey, could you please send me the link too?"
    },
    {
      "id": "l35mrmn",
      "body": "[heres the link](https://drive.google.com/drive/folders/19wiPYMa-qZraK3TAl_ds5mhZO_16GQlj)"
    },
    {
      "id": "l360sw7",
      "body": "i mean bro you are dumb, just leave it"
    },
    {
      "id": "l36aag5",
      "body": "Thank you for the useful advice"
    },
    {
      "id": "l38666j",
      "body": "the right way to study C is to learn, code, execute.. and for ISA 4 markers, learn the code for certain programs.. the lab ones are important"
    },
    {
      "id": "l39wx3z",
      "body": "atleast upvote raa, why u downvoting?"
    }
  ]
}