{
  "id": "1cn3uab",
  "title": "AIML Vs CSE",
  "content": "Should I join AIML by chance i dont make it into CSE? Or choose CSE in a different college like BMS or VIT. I do have a decent background in Computer Science for a high school student and i dont mind on missing out on my college life and willing to work hard at it. So whats the main difference between the two branches?",
  "metadata": {
    "author": "Pale_Order4389",
    "url": "https://www.reddit.com/r/PESU/comments/1cn3uab/aiml_vs_cse/",
    "permalink": "/r/PESU/comments/1cn3uab/aiml_vs_cse/",
    "score": 10,
    "created_utc": 1715172806,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l34hrkn",
      "body": "i would take cse in bms over anything at PES. but i would take AIML in pes over CS at VIT.\n\nthere are only a handful of courses that are different between AIML and CSE till second year ( there is no third year yet). but till second year you will be learning everything the cs people do and some more. they will skip some small parts in order to fit some more ML related stuff but what they skip is pretty minor and unimportant.\n\nkeep in mind this is only till second year. third year could be very different nobody knows yet. we'll find out as we go lol"
    },
    {
      "id": "l34hszy",
      "body": "From whatever we know, CSE+AIML is the rebranded MIDS (Machine Intelligence and Data Science) specialisation that used to exist. For the first two years, you'll have the same syllabus as CS, but in third year the electives you choose will be strictly from ML related coursework (unlike normal CS which will get to pick from all courseworks from cybersecurity, to systems etc). \n\nMy advice? Pick CS. There are multiple reasons why\n\n1. It's an untested branch - it was introduced last year only and nobody knows how it'll turn out\n2. The profs here are too capable to teach this, they're barely qualified to teach core CS concepts\n3. You'll be restricted. What if you don't like ML? Have you thought about that situation? Taking CS will allow you to choose whatever you like, include ML related coursework if you are interested\n4. You won't get ML related jobs right out of undergrad (mostly only startups), so the advantage doesn't exist. They all require atleast an MS/PhD, which brings me to my next point -\n5. ML is a purely mathematical field with focus on calculus, probability and algebra (you need a good grasp of these). It's more of an academically oriented field than an engineering one with most people taking this only in their Postgrad than BTech so they can go into research. There is not much engineering marvel here. Unless you know what a branch is about, don't pick it.\n\nI'd be happy to answer more about AIML.on DM since I work in this field.\n\n..."
    },
    {
      "id": "l34i1ow",
      "body": "How is bms better than pes can u plz explain, I'm a fellow aspirant who's gonna join clg this year.."
    },
    {
      "id": "l34kkzr",
      "body": "Less crowd is a huge factor. Pes has 720+480 in rr and 720+240 in ec. Also there will be tons of people in ec and eee who will also sit for cs placements. \n\nBMS is also more chill in general and not as academically focused as pes\n\nBut it's also not as bad as people here say and the subjects themselves are also quite easy. And pes also has better placements. \n\nSo for CSE i suppose either one is fine"
    },
    {
      "id": "l34xm0b",
      "body": "I have option to take cse in dayand Sagar college of engineering . Do you recommend it ? My main aim is to get high gpa and do masters directly ."
    },
    {
      "id": "l351ltn",
      "body": "definitely cs or even aiml at pes is better imo. the syllabus and peer group is better. but if the pessat fee vs comedk is an issue for you (probably not because of masters asperations) then i suppose it's a reasonable decision to make"
    },
    {
      "id": "l352bfa",
      "body": "But pes is hard to maintain high cgpa right ? That will affect me in the future . Peer group I don't care about since I pretty much know what I'm doing when it comes to cs related things ."
    },
    {
      "id": "l353vc7",
      "body": "Wait y'all got your pes results??"
    },
    {
      "id": "l353zfp",
      "body": "Bro did you get your pessat results or you going through jee?"
    },
    {
      "id": "l3547t8",
      "body": "Pessat results on 16may , I'm considering management  bcuz I know a guy who knows a guy who knows another guy in dsce"
    },
    {
      "id": "l3565yx",
      "body": "I was looking for it too? Could please share me the deets? about how to approach and the total cost?"
    },
    {
      "id": "l359ntq",
      "body": "If you are willing to get yourself into school-like regime again.... go for PES. BMS offers a less academically intensive course and from what I've seen... all of my friends in BMS are living life. But if you want more exposure academically and want to build a stronger foundation... I'd say PES. CSE and AIML in PES have almost the same buzz created..... I'd suggest CSE since you can learn ML concepts side by side"
    },
    {
      "id": "l35d8vh",
      "body": "Considering placements as the sole thing, which would be better?"
    },
    {
      "id": "l35fxe3",
      "body": "Check out my previous comment: [https://www.reddit.com/r/PESU/comments/147gamv/comment/jnve51g/](https://www.reddit.com/r/PESU/comments/147gamv/comment/jnve51g/)"
    },
    {
      "id": "l35g64f",
      "body": "Still I'd say very equivalent. I like PES's portions better and also the computer based exams are very nice. The strictness is overstated. \n\nBut attendance requirements are annoying af. 75 is too much. \n\nSomething else that gives pes an advantage is that you can make back 40 percent of your fee by being in the top 25 percent of the people. An easy way to get back like 2l out of the 4.5l fee. \n\nFor that also I'd pick pes\n\nOverall, like i said. Either way it's almost the same"
    },
    {
      "id": "l35ok57",
      "body": "facts, CSE in BMS over anything at PES"
    },
    {
      "id": "l35t3ld",
      "body": "Before you choose, I guess you should have a decent knowledge of what they exactly are.\nI am an AIML student so I would like to clear this buzzy word AIML.\nThis is mostly (90%) math and nothing else. You can enjoy the course only if you enjoy seeing all these years of math that you learnt from grade 6 being useful now.\nSo if you are sure about spending the rest of your life soaking in mathematical equations and concepts you can choose this."
    },
    {
      "id": "l35w420",
      "body": "Tier 1 offers are way more in pes than bms afaik, bms students are saying to choose pes over bms anytime if only placements are the concern..."
    },
    {
      "id": "l35xl91",
      "body": "Oh haha i thought you said \"placements aside\". \n\nYeah if placements are your priority then hands down pes"
    },
    {
      "id": "l35xphl",
      "body": "Thank you so much mate.. 🙌"
    },
    {
      "id": "l39e8dk",
      "body": "cs at vit still would be a better choice imo. yes vit has high intake but most are just there for their degrees and aren't serious so you get a boost in cgpa ( I've heard vit has relative grading so) and the opportunities are pretty decent. the fee of vit till even cat3 is way lower than pes iirc plus they have decent reputation abroad since how high their rankings etc are."
    },
    {
      "id": "l39eb4q",
      "body": "no not yet just a hypothetical question"
    }
  ]
}