{
  "id": "1cn4j04",
  "title": "Pessat counselling dates announced",
  "content": "Pessat team has sent an email, declaring the counselling dates to be May 25 and 26. And it's not even online, it has to be at the Bangalore campus. \n\nDoes anyone know if there is a seat blocking system? By paying 10k and blocking seat like other colleges do, or do we have to pay full first year fees to secure the seat immediately?\n\nSome colleges will not have declared result by then, so it's a mess if we have to pay full year fees and give up all other possible colleges. If anyone could help it'd be great. ",
  "metadata": {
    "author": "coldcoffee_allday",
    "url": "https://www.reddit.com/r/PESU/comments/1cn4j04/pessat_counselling_dates_announced/",
    "permalink": "/r/PESU/comments/1cn4j04/pessat_counselling_dates_announced/",
    "score": 7,
    "created_utc": 1715174787,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l34osc9",
      "body": "You have to hand them a dd on the seat allotment day. No other option. \n\n\n\nI'm surprised there's no online, many of my friends did it online from a different state. There should be. Are you sure you read it and understood it properly?"
    },
    {
      "id": "l34v1is",
      "body": "Yeah, it clearly said no online. It's a lot of travelling for most of us."
    },
    {
      "id": "l34w194",
      "body": "Wow that's so sad\n\nBut an upside might be higher cutoff ranks"
    },
    {
      "id": "l35ft81",
      "body": "Can i dm ?"
    },
    {
      "id": "l3618jf",
      "body": "I mean if it's some exam related thing yeah"
    },
    {
      "id": "l3626fo",
      "body": "bro that shit is like some auction, trying to forget those days 💀😭"
    },
    {
      "id": "l38jedb",
      "body": "Hey is this necessary for MCA guys also because I blocked the seat provisionally through NEFT."
    },
    {
      "id": "l3a4ypf",
      "body": "Go to admission office and enquire them directly regarding this"
    },
    {
      "id": "l3a58yk",
      "body": ">Blocking of seat\n\nBro, this is not possible in PESU. \n\nPay via cheque / DD on the day of counselling \\[offline\\]."
    },
    {
      "id": "l3aiu8m",
      "body": "Didn't receive any email"
    },
    {
      "id": "l3dx8p8",
      "body": "Cheque of 10k for blocking the seat or a cheque of full first year fees?"
    },
    {
      "id": "l3gay24",
      "body": "bruh same is this a sign we dint get selected or smtg"
    },
    {
      "id": "l3jkg8v",
      "body": "Results are out ?"
    },
    {
      "id": "l3k06sh",
      "body": "No"
    }
  ]
}