{
  "id": "1coipdm",
  "title": "is ece worth it at pes?",
  "content": "I am interested in electronics itself so I was wondering if ece is good at pes, I mostly just hear about cs related info regarding pes hence I am posting this as a question",
  "metadata": {
    "author": "TheeCoverUp",
    "url": "https://www.reddit.com/r/PESU/comments/1coipdm/is_ece_worth_it_at_pes/",
    "permalink": "/r/PESU/comments/1coipdm/is_ece_worth_it_at_pes/",
    "score": 4,
    "created_utc": 1715321690,
    "flair": "PESSAT/Admission",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l3eccks",
      "body": "If you're not getting ece anywhere better it's good."
    },
    {
      "id": "l3egay6",
      "body": "If you are interested in Electronics, then PES Is not the right place for it. ECE is the worst branch to join in PES. Try other colleges if you badly want ECE. \n\nPES Is known for CSE and CSE-AIML. Please try to join CSE"
    },
    {
      "id": "l3eivxn",
      "body": "How are placements in ece"
    },
    {
      "id": "l3eiybl",
      "body": "And can you change your branch from ece to cse in pes"
    },
    {
      "id": "l3ejuac",
      "body": "yes"
    },
    {
      "id": "l3ejxe0",
      "body": "What are the requirements tho"
    },
    {
      "id": "l3ek2eg",
      "body": "It is bad.\n\n[https://imgur.com/a/q6oG1v1](https://imgur.com/a/q6oG1v1)\n\n[https://imgur.com/a/uwBG6en](https://imgur.com/a/uwBG6en)"
    },
    {
      "id": "l3ekf2c",
      "body": "Check the FAQs: https://bit.ly/pesu-faq\nBasically, you need really good CGPA"
    },
    {
      "id": "l3elpfj",
      "body": "Thanks for this"
    },
    {
      "id": "l3emegs",
      "body": "bro can u give this year cse placements stats"
    },
    {
      "id": "l3eoljc",
      "body": "is PES good for biotechnology"
    },
    {
      "id": "l3eu6cl",
      "body": "The comment explicitly mentions: CS branches only."
    },
    {
      "id": "l3evmdn",
      "body": "You need a 10gpa by the end of first year, the chances are less likely. It depends on the number of empty seats left in cs so if there are 3 seats in cs and you're the 4th person with a 10gpa you ain't getting it."
    },
    {
      "id": "l3f2g51",
      "body": "Yeah sure, Will search."
    },
    {
      "id": "l3f5vlg",
      "body": "This is the last year cgpa based branch change cutoffs\n\nRr cs, 9.6\nRr aiml, 8.2\nEc cs, 7.4\n\nIt is exclusively based on cgpa your current branch doesn't matter"
    },
    {
      "id": "l3fg3vm",
      "body": "So if i score above 7.4 in ec campus I can change my branch to cs?"
    },
    {
      "id": "l3fhnao",
      "body": "If you score above 7.4 in any branch in any campus, you can change your branch to cs in ec campus. \n\nBut that was only for last year, it can vary by any amount. It depends on the number of vacant seats and how many people are willing to change branch"
    },
    {
      "id": "l3g1qgc",
      "body": "If you are truly interested in ECE, it's decent in PES.\n It's gonna be academically intensive but if you're up for a good challenge, yes it's good. \nThe ECE syllabus in PES is infact better than colleges under VTU."
    },
    {
      "id": "l3gkgn7",
      "body": "Wait, so you can go from ec to rr via branch change?"
    },
    {
      "id": "l3gm59d",
      "body": "Anywhere from anywhere. As long as it's an engineering branch and as long as there's a seat vacancy"
    },
    {
      "id": "l3gmvjt",
      "body": "Oh! Thanks."
    },
    {
      "id": "l3j9ffs",
      "body": "I remember choosing ece as my top preference when registering, would it be possible to choose cse instead while counselling?"
    },
    {
      "id": "l3j9n84",
      "body": "while I am interested in ece, I keep hearing how there are little to no internships and that ece students have to sit for IT companies for placements too, I am worried that even after learning electronics, if I end up in somewhere like tcs what would be the point"
    },
    {
      "id": "l3janq9",
      "body": "Yes that kinda is the sad reality but if you're really interested in the subject, i don't think you'd want to worry much about placements, getting an ece core job is very difficult indeed but you'll get there eventually. \nOne key tip: Don't ever compare yourself to your CSE peers. \nCareer graph for an ECE major who sticks to core electronics is a gradual one, so don't be in a rush"
    },
    {
      "id": "l3jca5s",
      "body": "Not sure, check with admission office"
    }
  ]
}