{
  "id": "1conn9u",
  "title": "Seniors, Need your opinion on a job offer offcampus",
  "content": "Im in 6th sem CSE right now, I am interning in a UK based company ofcampus for an year part time. They have offered me 12LPA as a GenAI dev and they want me to start FTE from July ish and I've told them that I have two more sems left which are online, they don't mind that and was okay to accommodate during ISA and project reviews... It's 8 hrs per day and 5 days a week completely remote. I have a couple questions. \n\nHow is the placement scene oncampus, I have a CGPA of 7.5 with great projects and 2-3 internships... I've heard there is a cutoff of 7.75 for tier 1 and I don't think I can clear this based on how this sem went. Is this true or will I be eligible for t1 placements? Really worried about this...\n\nWill PESU be okay with me starting FTE if the company is cool with it? How is the workload in the 4th year, is it something that's manageable?\n\nWould you personally recommend me to take this up based on your experiences?\n\nAny suggestions would be really appreciated and I'm kinda stressed about all of this. Thank you!\n",
  "metadata": {
    "author": "pusejews",
    "url": "https://www.reddit.com/r/PESU/comments/1conn9u/seniors_need_your_opinion_on_a_job_offer_offcampus/",
    "permalink": "/r/PESU/comments/1conn9u/seniors_need_your_opinion_on_a_job_offer_offcampus/",
    "score": 9,
    "created_utc": 1715341804,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l3fuhjc",
      "body": "Once you join as FTE there will be more responsibilities and pressure of deliverables in any company. “8 hours 5 days” may not be the case every week. Sometimes you may have to put extra hours ( Even if you’re very good in time/work management ). So I think managing it with your Academics and Placements will be difficult. \nI would suggest you focus on your placements and definitely you’ll land somewhere better (Given you already have an offer - which shows your capability;)) \n\nAlso with this company you try to convince them that you’ll be available to join after your 7th sem, because 8th sem is usually only for internships, starting as FTE won’t be any issue then. \n\nThis is just my opinion where you’ll not miss out on campus placement opportunities, also if the current company is ok, you’ll have more options at the end of Sem 7.\n\nI am not sure how the placements are in last 2 years but you can be confident on your skills and preparations any day, Good luck!"
    },
    {
      "id": "l3gpx2h",
      "body": "Remote UK fte and 12lpa, they are outsourcing their jobs bro. \nGet a job in india in some mnc, that looks better on your resume.\nKeep connected with the UK folks tho."
    },
    {
      "id": "l3k0ap6",
      "body": "Ik people who managed to do internships in their 7th sem but don’t expect any approval or anything from the college, if the company asks you to give a NOC or such documents it will be hard for you to obtain. 7th sem you’ll usually have 3 ST’s which can be reduced if you opt for summer courses along with your capstone reviews which will take much of your time, many try to complete the bulk of their project in the summer if they don’t have any internship. You’ll also be having regular OA tests from the on campus companies so it will be hard to manage."
    },
    {
      "id": "l3k41r5",
      "body": "How often do the OA tests happen? Also regarding the 7.75 cutoff, will I be allowed to sit for T1 companies? This is the only thing I'm worried about right now... I have credits to cover for STs I just need one summer course to cover for it. My weekly capstone reviews are online, I just have to come to uni for the main 3 reviews.... The company has agreed to accommodate when I have things to do in college, they're very flexible"
    },
    {
      "id": "l3kao6h",
      "body": "Regarding the cutoff, many companies will allow you but will later short list people because they cannot conduct tests for many people. The frequency depends on the number of companies usually can be 2-4 a week depending on the market situation."
    },
    {
      "id": "l3kqwyz",
      "body": "Is there a strict 7.75 cutoff for tier 1 companies from our college? I understand getting shortlisted is a different matter."
    },
    {
      "id": "l3l79cf",
      "body": "IIRC there was a cutoff of 6.75 to be eligible for placements, there was no explicit cutoff for tier 1. Companies set the cutoffs usually."
    },
    {
      "id": "l3lac7j",
      "body": "Thanks for the reply, I'll ask them to push the join date post 7th sem."
    }
  ]
}