{
  "id": "1cq89yo",
  "title": "Summer Internship Advice / Resume Building ? ",
  "content": "I'll be writing my ESA's for sem 2 starting this week and something I've been looking forward to do this summer break is an internship.\n\nWe have two months off and I'd like to gain experience instead of /waste my time/ yk?\n\nMy professors aren't too helpful and I don't think going to them for advice really works but we had a dept event a few weeks ago ( right before ISA 2 ) where we met a couple seniors and one of them said I could pass on my resume to them ( for ui ux / design ) and they'd pass it on to their heads at their workplace to see if the company would hire me as an intern.\n\nI'm not too sure how to go about building a ui/ux or even just a design based portfolio / resume because I have no one to guide me and I'm still learning + scrunched for time because ESA's end on 23rd May.\n\nObviously I can't depend entirely on the senior and I want to look elsewhere for internships too so does anyone have any advice on that ?\n\n( for context, i'm from the dept of bca, and the faculty from the dept of computer applications borderline SUCK )",
  "metadata": {
    "author": "h_onsool",
    "url": "https://www.reddit.com/r/PESU/comments/1cq89yo/summer_internship_advice_resume_building/",
    "permalink": "/r/PESU/comments/1cq89yo/summer_internship_advice_resume_building/",
    "score": 6,
    "created_utc": 1715521728,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l3pnhz6",
      "body": "Which role are you looking for?\n\nUI/UX?"
    },
    {
      "id": "l3pnu2b",
      "body": "yea!"
    },
    {
      "id": "l3pnzw2",
      "body": "but i'm open to internships in other cs fields too"
    },
    {
      "id": "l3pvxhx",
      "body": "I can kinda help for UI/UX\n\nI have taken multiple interviews of aspiring UI/UX peeps, here are a few pointers \n1. Build a really good portfolio showing some good 3-4 projects \n2. The end design isn't important in your portfolio, it's the design approach to your problem statement \n3. Have some interview experience, can be done in college, by connecting with the corresponding department or reaching out to some designers on LinkedIn (you can reach out to me too)\n4. Always keep learning, learn from UX papers, read articles, check out latest UI/UX designs etc.. \n5. A lot of people I have interviewed learnt UI/UX from a co-hort + practiced on their own\n\nI hope its helpful"
    },
    {
      "id": "l3pvyhs",
      "body": "I can kinda help for UI/UX\n\nI have taken multiple interviews of aspiring UI/UX peeps, here are a few pointers \n1. Build a really good portfolio showing some good 3-4 projects \n2. The end design isn't important in your portfolio, it's the design approach to your problem statement \n3. Have some interview experience, can be done in college, by connecting with the corresponding department or reaching out to some designers on LinkedIn (you can reach out to me too)\n4. Always keep learning, learn from UX papers, read articles, check out latest UI/UX designs etc.. \n5. A lot of people I have interviewed learnt UI/UX from a co-hort + practiced on their own\n\nI hope its helpful"
    },
    {
      "id": "l3pymxd",
      "body": "thank you sm! i'll keep these in mind\n\nfor the problem statements, would you suggest i look somewhere for them or do i need to come up with them on my own ? also what would you suggest the format for the portfolio to be ? a behance doc ? or a website type of thing because ive seen a lot of designers have their own websites that features their projects / case studies\n\nthanks once again"
    },
    {
      "id": "l3q9s42",
      "body": "1. You can just google, Problem Statements for UI/UX portfolio, you'll get multiple \n2. Behance should work as a repository for your projects. This can be an overall structure for your projects in your portfolio. 1. Background/Context 2. Problem Statement 3. Explanation of Problem Statement 4. Research/Research Methodology 5. Wireframes 6. Final Designs 7. Conclusion/Summary"
    },
    {
      "id": "l3qke6j",
      "body": "okay!! thank you"
    }
  ]
}