{
  "id": "1cqtjmu",
  "title": "DOUBT",
  "content": "**RV(EE)** vs **MSRIT(AI ML)** vs **DSCE(CS)** vs **PES(EC)** vs **SJCE(EC)** vs **NIE(EC)** vs **BMS(AI)** vs **JSS(CS)**",
  "metadata": {
    "author": "Alive_Garlic_760",
    "url": "https://www.reddit.com/r/PESU/comments/1cqtjmu/doubt/",
    "permalink": "/r/PESU/comments/1cqtjmu/doubt/",
    "score": 0,
    "created_utc": 1715585627,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l3tlipc",
      "body": "Depends on which branch you want to pursue"
    },
    {
      "id": "l3tm4nn",
      "body": "How can you even compare across branches? If you like ECE, choose the best place you get ECE. If you like CS, choose the best place for CS. Ideally, avoid specialised branches. Undergrad is not the place to specialise and it narrows down your study options."
    },
    {
      "id": "l3turw0",
      "body": "But in PESU, CSE-AIML has Big data in 2nd year, as a core subject, which is very crucial for all hackathons. and its very useful as well. \n\nI dont see why taking CSE-AIML is bad. Its perhaps a slightly better choice than CSE"
    },
    {
      "id": "l3tvqra",
      "body": "1. The goal isn't to \"learn for hackathons\". Undergrad is for building fundamental knowledge, Masters and higher is for specialisation. If you restrict yourself to a field now, you'll never get to explore other fields. \n2. Not everyone wants to do AIML. Most people drop interest once they realise it's mainly math. If you don't like it, you're basically stuck with a degree you have no interest in. \n3. They teach you Big Data without teaching you CN and OS, which are concepts which strongly go along with it. This itself is a brain dead move."
    },
    {
      "id": "l3tvv4m",
      "body": "bro isn't comparing apples to oranges, you're comparing apples to airplanes\n\nbut assuming you want a computers branch as your first priority id pick BMS. also figure out if the degree will say something like \"CSE specialized in AIML\" or if it literally says \"AI&ML\" on the degree"
    },
    {
      "id": "l3tvz9s",
      "body": "we're still in second year. can't say anything about third year yet. \n\nas of now AIML people are learning the same and more, but that could change after third year. i'd wait till then before recommending aiml at pes to anybody"
    },
    {
      "id": "l3twd4f",
      "body": "Inky Pinky Ponki"
    },
    {
      "id": "l3u4vji",
      "body": "Dear OP, please tell your branch preference. and U can cut off PES(ECE) safely. It is not worth it. If you are joining PESU, join only for CSE"
    },
    {
      "id": "l3zz625",
      "body": "Looks to me like you’re just going around comparing totally different branches. It’s like comparing not apples and oranges but apples and aliens."
    }
  ]
}