{
  "id": "1cr4tsj",
  "title": "Got cnr but hadn't paid scholarship fee",
  "content": "so i'm from kcet and I was supposed to pay 10k extra for scholarship, i thought i wouldn't study so i didn't pay, but i was eligible for cnr, turns out its not that hard :(\n\ni didn't get money for the first sem, but is there any way i can pay money now and get for 2nd year onwards atleast?\n\n",
  "metadata": {
    "author": "Meghanaa__v",
    "url": "https://www.reddit.com/r/PESU/comments/1cr4tsj/got_cnr_but_hadnt_paid_scholarship_fee/",
    "permalink": "/r/PESU/comments/1cr4tsj/got_cnr_but_hadnt_paid_scholarship_fee/",
    "score": 4,
    "created_utc": 1715620795,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l3vnttc",
      "body": "Yupp, u can do that "
    },
    {
      "id": "l3yu3ym",
      "body": "You can still get it , You need to get a letter from The Vice Chancellor and submit to the Accounts."
    },
    {
      "id": "l3zctjx",
      "body": "really? has anyone yk tried it? if yes then it'd be awesome"
    },
    {
      "id": "l3zkbnf",
      "body": "Yup one of my friend from my class did that"
    },
    {
      "id": "l40iv88",
      "body": "Can you please tell the process"
    },
    {
      "id": "l40o3kb",
      "body": "okay! thank you so much!"
    },
    {
      "id": "l4135l2",
      "body": "Firstly write a letter telling that i was unable to pay in my 1st year due to some reasons. Then tell them that now you are willing to pay and tell them your grades that how good are those and how financial u get benefitted etc..\n\nNow get this letter signed by the VC and head to the account section present in MRD BLOCK submit the letter thing with your fee receipt, Bank details like Ac number and IFSC(Union Bank is compulsory)give it to lady with glasses who sits there all the time \n\nThat's it she will make sure that you will get money by upcoming semesters"
    },
    {
      "id": "l413lef",
      "body": "Happy to Help 😃"
    }
  ]
}