{
  "id": "1crqziu",
  "title": "Confirmed: 3rd student did suicide and passed away because he wasn’t let to write exam",
  "content": "He came to exam hall after 9. He wasn’t let inside. Apparently in his PESU academy the exam was supposed to start at 9. The examiner told he will have backlog and won’t sit for placements. He jumped from fourth floor. He was alive for 20 minutes when they found and died in hospital. Please do not try to take such drastic steps for an exam. It’s not the end of the world.",
  "metadata": {
    "author": "Imsmortboi",
    "url": "https://www.reddit.com/r/PESU/comments/1crqziu/confirmed_3rd_student_did_suicide_and_passed_away/",
    "permalink": "/r/PESU/comments/1crqziu/confirmed_3rd_student_did_suicide_and_passed_away/",
    "score": 152,
    "created_utc": 1715689908,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": true,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l3zr3me",
      "body": "This is true as far as I know. I was told this by one of my teachers."
    },
    {
      "id": "l3zrr9o",
      "body": "Rip"
    },
    {
      "id": "l3zu2lp",
      "body": "Rip"
    },
    {
      "id": "l3zxfge",
      "body": "Last esa anol they were allowing people who came half an hour later inside, idk why they aren't doing it this time. People commute from far off places so they must be allowed atleast even 30 mins after exam starts. "
    },
    {
      "id": "l3zy72v",
      "body": "wow. nothing else to say"
    },
    {
      "id": "l3zyeky",
      "body": "We don't know how late he was yet right ??"
    },
    {
      "id": "l3zyunq",
      "body": "How late Was he to the exam"
    },
    {
      "id": "l3zyzip",
      "body": "How Late was he to the exam Hall any details on that??"
    },
    {
      "id": "l3zzc0n",
      "body": "dude there are invigilators who take the job too seriously, some people are just sadistic like that"
    },
    {
      "id": "l3zzg98",
      "body": "This was directly caused by pes and they must be held responsible for it"
    },
    {
      "id": "l3zzlte",
      "body": "What if he was an Hour Late"
    },
    {
      "id": "l4005w4",
      "body": "They have rules and they enforced those rules. They did absolutely nothing wrong here Don't spread hate"
    },
    {
      "id": "l4017mu",
      "body": "Are you serious? The invigilator knows very well if he gets a backlog he cant sit for placements, and yet knowing fully well, he barred him from entering, we aren't dealing with robots, we're dealing with human beings with a life.\n\ninfact the invilgilator single handedly caused this death\n\n  \n\"spread hate\"? brother this man died, because a teacher didnt let him write the exam and ur worried about me spreading hate??"
    },
    {
      "id": "l4018jv",
      "body": "But it is on PES thu their app showed the wrong info and he missed his exam"
    },
    {
      "id": "l401h1v",
      "body": "Not enough information to conclude this. If he arrived within the permissible time limit (30 mins after ESA starts), then he should have been let in. If he arrived after, the rule strictly says you won't be able to write the exam. If the latter has happened, you cannot really blame PES for following their rules."
    },
    {
      "id": "l401uv1",
      "body": "Bro one person didn't allow me to keep my water bottle cause it's not transparent, I had a feeling of dehydration all throughout my exam because i felt I always needed water, sometimes I keep water for the sake of it even if I don't need it\nImagine denying that"
    },
    {
      "id": "l401vm7",
      "body": "No even in our exams many people find login issue but they fix it by calling the PESU Academy people"
    },
    {
      "id": "l401ydf",
      "body": "I am not taking any side here, but being sadistic has nothing to do with taking their job seriously. Back when I was in college, 30 mins was the limit for ESA and 15 mins for ISA. You cannot blame a faculty for doing their job and not letting a student beyond the permitted time limit."
    },
    {
      "id": "l401zp9",
      "body": "They might have tried calling PESU Academy People"
    },
    {
      "id": "l4022vf",
      "body": "He can sit for placement with a backlog whoever told u this crap is the real liar here because he's 3rd year not final year he can easily clear it next month"
    },
    {
      "id": "l4028r6",
      "body": "But yes I agree the invigilator should have sent the lad to the coe not given life lecture"
    },
    {
      "id": "l402ddf",
      "body": "Why down vote this is a sensible Question"
    },
    {
      "id": "l402ijv",
      "body": "This wasnt a login issue but the information given is wrong and its on pes because the academy ppl do come under the whole umbrella of pesu"
    },
    {
      "id": "l402iln",
      "body": "I faced Login issue in one of the ESAs and they Called the people and fixed it"
    },
    {
      "id": "l402inc",
      "body": "I don't mean to be harsh but how exactly is it possible for the app to show a single student the wrong timings but the correct one to everyone else?"
    },
    {
      "id": "l402wzv",
      "body": "If he was denied entry after being late **even by the permissible amount**, then it is on the student for not arriving on time. Rules are established for a reason, you cannot show up for an exam whenever you wish to.\n\nHowever, its a completely different story if he was denied entry before the permissible delay time ended. Since we don't have any information on how late he arrived, its too soon to point fingers."
    },
    {
      "id": "l402zif",
      "body": "Like see What if they Had rules that they Wouldn't be allowed after 30 Minutes"
    },
    {
      "id": "l4033ua",
      "body": "Even in Exams Like JEE-MAINS,KCET They have a rule if you come late by some amount of time you can't write the exam"
    },
    {
      "id": "l403ddh",
      "body": "I think Teachers only would have Informed this in First Year Second Year"
    },
    {
      "id": "l403fzi",
      "body": "Could be a server side error or something related to which admins can control or change"
    },
    {
      "id": "l403gi4",
      "body": "During Classes they Might have given this Instruction"
    },
    {
      "id": "l403khn",
      "body": "Otherwise Why Would the Teacher Bar. Teachers Blindly Follow the Rules Given to them For Invigilation"
    },
    {
      "id": "l403rc7",
      "body": "Why would the Teacher Bar Him from Writing the Exam the reason they Wouldn't have let him Is it would be a Rule and Teachers Follow Invigilation Rules Blindly So that The Teacher Doesn't Get questioned Later On."
    },
    {
      "id": "l403w2b",
      "body": "Teachers Just Blindly Follow Invigilation rules Given to them Otherwise why would they even Do this"
    },
    {
      "id": "l404al5",
      "body": "Now this is incredibly heartless on ur part, dick riding can be done to some extent, too much dick riding is straight up sad.\n\nYou're going to blame the guy that died, and not the cold enforcement of said rules as though we live in a sort of dictatorship, as i said, we're humans, not pieces of code that must be perfectly on time with no delay.\n\nIf he had no valid reason to show up late, then its on him fine, but if had a valid reason if he had a reason for which he came late and his academic records are fine, then how is it on him?? brother stop dick riding for the love of god, idk how much they pay u for this"
    },
    {
      "id": "l404iig",
      "body": "This Is sensible this was there even in my school exams these things what you expect is too Much"
    },
    {
      "id": "l404k4u",
      "body": "I agree with you exactly"
    },
    {
      "id": "l404m0h",
      "body": "Stop dickriding, are you  on pes payroll?"
    },
    {
      "id": "l404r26",
      "body": "If you were given invigilation duty and the rule says after Some amount of time The Student is not allowed to take the exam You would just do the Thing which is given in the rule book Right."
    },
    {
      "id": "l4058yn",
      "body": "No because I am in this college for 4 years I have not once been asked to do this, this is the first time and it's ridiculous"
    },
    {
      "id": "l405o5l",
      "body": "Bruv according to [this](https://new.reddit.com/r/bangalore/comments/1crs4aw/pes_university_suicide/) a post from r/bangalore he had come on 9:00 but the goddamn exam started at 8:30 am which more or less within the permissible time limit and the professor should have refrained themselves from speaking rudely to the person and asking them to go to the HOD and ask them for extra time."
    },
    {
      "id": "l405pfw",
      "body": "Here's a sneak peek of /r/bangalore using the [top posts](https://np.reddit.com/r/bangalore/top/?sort=top&t=year) of the year!\n\n\\#1: [Very serious matter. Posting here for maximum reach](https://www.reddit.com/gallery/154qmcy) | [374 comments](https://np.reddit.com/r/bangalore/comments/154qmcy/very_serious_matter_posting_here_for_maximum_reach/)  \n\\#2: [Ayo when did the Avengers have a battle at commercial Street](https://i.redd.it/mps52flnt15b1.jpg) | [204 comments](https://np.reddit.com/r/bangalore/comments/145f8wj/ayo_when_did_the_avengers_have_a_battle_at/)  \n\\#3: [For God sake.. don't encourage tipping culture in India!](https://np.reddit.com/r/bangalore/comments/13dklq3/for_god_sake_dont_encourage_tipping_culture_in/)\n\n----\n^^I'm ^^a ^^bot, ^^beep ^^boop ^^| ^^Downvote ^^to ^^remove ^^| ^^[Contact](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| ^^[Info](https://np.reddit.com/r/sneakpeekbot/) ^^| ^^[Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/o8wk1r/blacklist_ix/) ^^| ^^[GitHub](https://github.com/ghnr/sneakpeekbot)"
    },
    {
      "id": "l405v4d",
      "body": "Firstly, I don't get paid for anything and my opinions are completely my own.\n\nSecondly, I did not blame anyone. As I said, its too soon to point fingers. You are the one assuming that (1) he had a valid reason to be late and should have been permitted inside and (2) the invigilator should *not* have carried out his assigned responsibilities.\n\nThe instructions were known to everyone. The faculty was just doing their job by not letting anyone inside after the permitted time. The student arrived late for unknown reasons and was not allowed inside. How late? It is not clear. Thus too soon to say for sure who is at fault.\n\n>as i said, we're humans, not pieces of code that must be perfectly on time with no delay\n\nAnd so are the faculty, who want to just carry out their duties without consequences of not following them."
    },
    {
      "id": "l4061bv",
      "body": "Also I didn't downvote it someone else did"
    },
    {
      "id": "l406ni0",
      "body": "Please read what I have said I said what if there was a Rule that after the exam Starts if you're late to the exam by More than 30 Minutes obviously the Teacher wouldn't allow you write this is Not only in PES but in Every College Exams."
    },
    {
      "id": "l40713v",
      "body": "I am not on anyone's side. Objectively, it looks like the faculty was just doing their job and carrying out instructions which were known to everyone. Its too soon to point and say which party is at fault because there isn't enough info.\n\nAre you implying that the profs *should not* have done their job? Being sadistic is completely unrelated to carrying out what is expected of you."
    },
    {
      "id": "l4071xo",
      "body": "Teachers Just follow rules Given to them by Higher Ups Blindly"
    },
    {
      "id": "l40781m",
      "body": "But as Far as I Know this is a Basic Rule In Instruction Sheet only they Tell to Bring Only Transparent Bottles and Pouches are Not allowed"
    },
    {
      "id": "l407d21",
      "body": "I think you also Wrote Competitive exams four Years Back right or Board Examm the Same Rules are Followed in PESU Exams"
    },
    {
      "id": "l4084r3",
      "body": "I fully agree with you"
    },
    {
      "id": "l408fgo",
      "body": "Possible. Let's not comment about it actually being a server side bug without knowing if it actually happened."
    },
    {
      "id": "l408p0d",
      "body": "Ya I do agree with u"
    },
    {
      "id": "l4095br",
      "body": "The amount of dick riding going on is crazy"
    },
    {
      "id": "l409c5g",
      "body": "There’s no way he was denied entry because he was a few minutes late, I myself have been late by 20 mins and been allowed, I’ve seen students even entering after 30 mins and being allowed. Stop spreading hate on the college and Rowlet Sir without knowing the full details of the incident."
    },
    {
      "id": "l409mzp",
      "body": "Maybe the student body can start a protest or a petition against the university. 3 students have suicided something should change"
    },
    {
      "id": "l40ciqu",
      "body": "Fuhrer respects the dead 🫡"
    },
    {
      "id": "l40cnij",
      "body": "I understand for jee bro, PPL have insane ways of copying 😂 I just want my water cold so I have a thermos bottle during summer is very helpful to keep awake"
    },
    {
      "id": "l40dv1w",
      "body": "Just because it didn't happen with you doesn't give you the right to disregard it, especially since you are not from ec campus.I was not allowed to write isa for being exactly 13 min late, and after many days they also forced me to write a letter saying that i shall be punishable if i miss an other exam in future, seriously the rules and coe are just sadastic and enjoy seeing the student suffering. Also a year ago in ec campus moral policing was also done like taking photos of students for not wearing id cards in canteen threatening to take multiple actions, you couldnt even bunk classes even if u had attendance,snatching phones from windows and what not."
    },
    {
      "id": "l40dy4i",
      "body": "I was not allowed to write isa for being exactly 13 min late, and after many days they also forced me to write a letter saying that i shall be punishable if i miss an other exam in future, seriously the rules and coe are just sadastic and enjoy seeing the student suffering. Also a year ago in ec campus moral policing was also done like taking photos of students for not wearing id cards in canteen threatening to take multiple actions, you couldn't even bunk classes even if u had attendance, snatching phones from windows and what not."
    },
    {
      "id": "l40emg1",
      "body": "Yeah I agree with you 💯"
    },
    {
      "id": "l40erhv",
      "body": "Why do you want to jump to conclusions before we have exact information?"
    },
    {
      "id": "l40et5x",
      "body": "The exam hall has rules and you got to plan your arrival accordingly, it ain’t a movie theatre"
    },
    {
      "id": "l40f02l",
      "body": "30 minutes is the rule time for ESA. It is already mentioned on the instructions booklet. Do not blame faculty or anyone without proper information."
    },
    {
      "id": "l40fslo",
      "body": "Today my friend came 25 minutes late. He was allowed to write exam. I don't see why a faculty would restrict you??  \n30 minutes is the time allotted until which a student can come inside. \n\nI feel students should have more self power within themselves and control over their mind. Death is not the only solution to everything in this world"
    },
    {
      "id": "l40fwar",
      "body": "there are some things then can let go off. teachers have harassed me before because my hair was open, that's such a silly thing, im obviously not gonna hide a paper in my hair 😭😭 and most other profs would be okay with certain things that some of these profs don't allow. of others are allowing it it means its not such a big deal. some profs DO take their jobs too seriously and yss it IS because they're sadistic. maybe you've been out of college too long to remember this."
    },
    {
      "id": "l40g514",
      "body": "Firstly I blew your claims saying college allows to write even after their 30 min mark and now there's a difference between strict and sadistic but alas a dickrider like you wouldn't understand"
    },
    {
      "id": "l40gwem",
      "body": "What you mentioned is out of line and should have been brought up earlier, as a different incident of its own. They are in no way related to this incident, even though I do agree that what happened to you is wrong.\n\nAnd as u/Couch_Potato2002 said, exams aren't a movie theatre. Lets say you turn up late to your JEE Mains/Adv/GRE or any other exam and you aren't allowed to enter. Both you, as well the security personnel, are aware that if you miss it you will only be allowed to give it the next year, thus wasting all your efforts. Is the fault on *you* for not arriving on the instructed time, or is it on the *security* for doing their job? Would you still blame them instead of yourself for not doing what was instructed of you? Why should they be accountable for your errors?"
    },
    {
      "id": "l40hjn1",
      "body": "I totally agree with you, however there are reports that the faculty did say something on the lines of- \"You will not be eligible for placements as this subject will be a backlog\".... \n\nShould have just asked them to leave instead of giving these remarks out."
    },
    {
      "id": "l40hmmi",
      "body": "You not being allowed in after the permissible time is the exception, not the norm. You should have raised an issue about it when it occurred. \n\nA lot of people walk in late to exams (I myself have) within the max permitted time and they are allowed in. Don't normalise the exception."
    },
    {
      "id": "l40if6l",
      "body": "You clearly look like you're on PES' payroll, i mean i clearly don't understand what's your motive behind commenting on every single post about this incident at all the subreddits and saying not to drag the college and questioning the guy who has already passed away. Show some fucking empathy will ya? \n\nYes teachers blindly follow orders but does the management tell the teachers to be brutal and be a bunch of assholes towards the students? I guess not.\n\n\"Otherwise why would they even Do this\" - I guess you didn't learn anything regarding Aditya Prabhu's case, it was PES' mistake, and this incident too is PES' mistake. \n\nThat particular invigilator had plenty of options where he could have called the boy aside and talked to him with a bit of care assuring that \"things are going to be okay and if he is late then he should be barred from the exam as things are not in my hand and it is a rule stated\" yet he chose to say harsh things to that poor boy like he won't be able to sit in placements and all, if he had spoken to him with at least a bit of care and concern then he who knows he would have been alive now and might have no taken such a step towards ending his own life. \n\nYou are sitting somewhere commenting such shit, do you not know how precious a life is? Huh? Mark my words, be compassionate towards the person who lost his life and stop commenting such shit and questioning a person who's not alive anymore."
    },
    {
      "id": "l40ih9z",
      "body": "how is telling a student that they'll have a backlog and can't sit for placements justified??"
    },
    {
      "id": "l40j8zz",
      "body": "Not all the club heads and 4th year students desperately downvoting others and even saying things like 'dont spread hate about college'. Looks like they got an order from their masters to downplay this incident like the last 3 sucides"
    },
    {
      "id": "l40jcf4",
      "body": ">there are some things then can let go off\n\nThe 30 mins after the exam's start time *is* the \"let go off\" you speak of. 30 mins in a 3 hour exam is a pretty fair time period to allow late students to enter. After all, this is an exam and you cannot walk in at any time you want. I would like to see you do this for JEE or other entrances and still hold the security personnel accountable for you being late.\n\nAnd yes while I understand that some profs can be sadistic and annoying to deal with, its definitely not justified to label everyone the same. Profs take their jobs seriously not because they are sadistic but because that is what people do when they have a job - carry out their responsibilities to avoid consequences. Not everyone here is out to get you. Maybe once you start working and seeing others taking their jobs seriously, you will think twice before labelling them sadistic.\n\nAnd if you have been harassed by any faculty, reach out to the Dean. These incidents are not new and I am sorry they happened to you."
    },
    {
      "id": "l40jwk8",
      "body": "Replying to u/Feeling-Tomato-6572 in this comment as well:\n\nI am not justifying their words. Prof should not have said that (if they actually have). It was also factually incorrect. The student had plenty of time to clear backlogs before sitting for placements. The threat was meaningless and not required.\n\nHowever, I *am* justifying the prof not allowing the student inside after the permitted delay of 30 mins in the ESA. Can't hold the faculty accountable for you being late."
    },
    {
      "id": "l40ksoq",
      "body": "Read properly, not only me but 8 other students raised the issue instead of a an answer we were forced to write a letter saying i shall be punishable for missing any other exam.\n\nMr.Anirudh all these happened in this sem and last sem, you were in last year and again just because it didn't happen with you dont generalise please"
    },
    {
      "id": "l40lx0s",
      "body": "Dude I've been seeing you here for months, defending PES under every post like it's your job. Seriously go outside."
    },
    {
      "id": "l40mitz",
      "body": "Firstly, my name is not Anirudh. Secondly, trying to doxx someone on an anonymous platform isn't cool man.\n\nThirdly, multiple people have already stated that students are allowed in late. Someone even commented they came in 25 mins late today. There are enough positive examples, and I can vouch for the same since I myself have walked in late for many ESAs.\n\nIf the student today walked in late within the permissible time, only then it raises a question on why the faculty did not let them in. If they were beyond the permitted time, then there is no reason why the faculty is responsible. That is all we are trying to say.\n\nHave a good day."
    },
    {
      "id": "l40n7sw",
      "body": "Yeah totally agree with the professors following the rules"
    },
    {
      "id": "l40nrm6",
      "body": "Stfu for once, rules are made for a reason, you can’t enter exam halls whenever the fuck you want \nBe grateful at least PES allows leeway of at least 30 mins."
    },
    {
      "id": "l40omco",
      "body": "Bruh just because it didn't happen with you doesn't mean it doesnt happen at all. I can list out 7 people(3rd and 5th sem) who are not allowed to write isa for being 13-15 min late and instead forced me to write a letter saying that i shall be punishable if i miss an other exam in future. Seriously there's no point in arguing with you, rowjee.Not all the club heads and 4th year students desperately downvoting others and even saying things like 'dont spread hate about college'. Looks like they got an order from their masters to downplay this incident like the last 3 sucides"
    },
    {
      "id": "l40p32h",
      "body": "There are certain levels of dickr\\*ding but have crossed all, Dude I've been seeing you here for months, defending PES under every post like it's your job. Seriously look at thr gravity of the matter"
    },
    {
      "id": "l40prir",
      "body": "There are certain levels of dickr\\*ding but have crossed all, Dude I've been seeing you here for months, defending PES under every post like it's your job. Seriously look at thr gravity of the matter.\n\nDefending tour masters even in a situation like this 4 sucides, guess all you 4th years and club heads are employed for this ."
    },
    {
      "id": "l40s16q",
      "body": "You clearly look like you're on PES' payroll, i mean i absolutely don't understand what's your motive behind commenting on every single post about this incident at all the subreddits and saying not to drag the college and questioning the guy who has already passed away. Show some fucking empathy will ya?\n\nYes teachers blindly follow orders but does the management tell the teachers to be brutal and be a bunch of assholes towards the students? I guess not.\n\n\"Otherwise why would they even Do this\" - I guess you didn't learn anything regarding Aditya Prabhu's case, it was PES' mistake, and this incident too is PES' mistake.\n\nThat particular invigilator had plenty of options where he could have called the boy aside and talked to him with a bit of care assuring that \"things are going to be okay and if he is late then he should be barred from the exam as things are not in my hand and it is a rule stated\" yet he chose to say harsh things to that poor boy like he won't be able to sit in placements and all, if he had spoken to him with at least a bit of care and concern then who knows he would have been alive now and might have not taken such a step towards ending his own life.\n\nYou are sitting somewhere commenting such shit, do you not know how precious a life is? Huh? Mark my words, be compassionate towards the person who lost his life and stop commenting such shit and questioning a person who's not alive anymore."
    },
    {
      "id": "l40s62d",
      "body": "Lmao I came to isa 20 minutes late they allowed me \nFirst they were like not gonna allow but I told my reason they considered n allowed not everyone is bad \nOh forgot to mention I'm in 2nd yr \nAlso I do agree some faculty are very rude but you can't just put evryone under the same umbrella ."
    },
    {
      "id": "l40sd9s",
      "body": "Who do you think all this gonna affect? The more negative light the college is in the chances of companies backing out increasing, you are basically digging your own grave."
    },
    {
      "id": "l40u8fd",
      "body": "you're comparing the time limit for esas with isas. the limit for isas is 10 mins and esas is 30 (or 45). I agree the invigilator shouldn't have been unnecessarily rude, but i don't think they were in the wrong for not letting somebody enter after 9 when the exam started at 830"
    },
    {
      "id": "l40vfm0",
      "body": "This guy is chronically online"
    },
    {
      "id": "l40w1a9",
      "body": ">You clearly look like you're on PES' payroll, i mean i absolutely don't understand what's your motive behind commenting on every single post about this incident at all the subreddits and saying not to drag the college and questioning the guy who has already passed away. Show some fucking empathy will ya?\n\nAnd you say I am biased in my answers when clearly you've got no neutral opinion on this.\n\nAll I said was that we do not know how late the student arrived to point fingers. If they arrived after the permitted time (which is already 30 mins after the exam starts), then you cannot hold the faculty accountable for not letting them in. Their job was to ensure nobody enters after the stipulated time, and the student's responsibility is to ensure if they are on time. If the student arrived before the said time, only then does it raise questions about the faculty's actions (and words) and there definitely should be consequences. All I am asking is for all the details to be released before people start blaming either party.\n\nSecondly, quoting my other [comment](https://www.reddit.com/r/PESU/comments/1crqziu/comment/l40jwk8/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button):\n\n>I am not justifying their words. Prof should not have said that (if they actually have). It was also factually incorrect. The student had plenty of time to clear backlogs before sitting for placements. The threat was meaningless and not required.  \n  \nHowever, I am justifying the prof not allowing the student inside after the permitted delay of 30 mins in the ESA. Can't hold the faculty accountable for you being late.\n\nAnd regarding this statement:\n\n>\"Otherwise why would they even Do this\" - I guess you didn't learn anything regarding Aditya Prabhu's case, it was PES' mistake, and this incident too is PES' mistake.\n\nI agree that PES is at fault for how they handled that case. That is completely on them and everything they did could have been done much better. \n\n>You are sitting somewhere commenting such shit, do you not know how precious a life is? Huh? Mark my words, be compassionate towards the person who lost his life and stop commenting such shit and questioning a person who's not alive anymore.\n\nI lost one of my bestfriends to suicide 6 years ago, back when I just finished school, and every single year there are days when I feel that I could have done something to prevent it. So yes, I *do know* how it feels to lose someone and I know how it feel to have someone disappear out of your everyday life without any sign. I probably know better than most people here how it feels to lose someone to suicide and the trauma that follows. Don't assume you know everyone."
    },
    {
      "id": "l414hah",
      "body": "Dude did you just copy my comment? Damn.."
    },
    {
      "id": "l4189mp",
      "body": "To those arguing 'They were just following rules,' or 'It's not PES's fault,' I ask: Whose fault is it then? FOUR suicides in less than a year!   \nYes, rules exist, but when they lead to such tragic outcomes, they warrant scrutiny. Why is this happening at PES when other colleges have rules too?   \nThe institute should delve deeper into the root causes and take meaningful actions to prevent further loss."
    },
    {
      "id": "l41dp04",
      "body": "Those are exams conducted on a national scale and they have lakhs of students writing them and people dedicate an insane amount of time to JEE and KCET, there's far more at stake there(not denying how even the ESA paper being linked to placements is not worth something though) and maybe the rules mattering should make sense.\n\nWhen you look at a small exam such as an ISA or an ESA paper which is regional and localised to just our college, you can't expect there to be such strict rules where a person could be late and have a teacher tell him/her things about how he/she is not eligible to sit for placements, one of the biggest reasons one even joins BTECH.\n\nIf you're that insensitive where you think that every human being should live by a rule, it doesn't make them human, it makes them a machine and that's just an insane level of delusion on your part where you think that a student is completely perfect.\n\nYour argument is baseless and completely delusional, someone has lost their life and you're bringing up two very different things into the play here.\n\nThis is equivalent to me comparing narendra modi leading a country worth 1.4 billion people to a 5 year old child leading a pack of his other 5 year old children at a park."
    },
    {
      "id": "l41eud3",
      "body": "okay but a lot of these people are simply rude. they treat us like we are beneath them and not human beings deserving of respect. he could've just said, im sorry but i can't let you in after 30 mins, but knowing him im sure as hell he was much worse and probably spoke super rudely to the kid. this particular man takes pleasure in seeing us suffer. i don't wanna dox myself so i wont say much, but he took away my phone and i had to follow him around to get it back, and when i did, he would ignore and me and walk away like you ignore beggars on the street. alot of professors and especially invigilators talk to us so rudely when they're asking us to check our pockets or telling us bottles aren't allowed. they don't need to be rude to do their job, but they are."
    },
    {
      "id": "l41in4n",
      "body": "If they are rude, report them. Visit the Dean of Student Affairs. The DoSA is pretty chill and understanding about student matters.\n\n[Like I commented](https://www.reddit.com/r/PESU/comments/1crqziu/comment/l40jwk8/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button), I do not support the apparent rude behaviour or the comments the faculty made. If it was indeed said, then yes it was out of line. \n\nHowever, I don't see anything wrong in the prof not letting the student in after the allowed delay time. They carried out their responsibilities. It was the student's responsibility to be on time, and that is exactly what I have iterated all over this thread: unless we know how late the student arrived, we cannot conclude who is at fault. If they arrived within the 30 min mark, then by all means, raise questions on PES and I will join you too. If not, why would the faculty be accountable for a student's late arrival?"
    },
    {
      "id": "l41ltu2",
      "body": "We all know the fucking master who dances during AT."
    },
    {
      "id": "l41ntsh",
      "body": "Lore is they Tryna hide the body, how true it is?"
    },
    {
      "id": "l43xeld",
      "body": "One of the sad reality to say that  exams are not needed to be conducted bcz PPL are almost gng to bed like unhealthy \n\n\nWaste clg and waste staff unfit for anything 🤬"
    },
    {
      "id": "l44zud1",
      "body": "They told him he won't be eligible for placements.\nIs there no makeup exam?"
    },
    {
      "id": "l4513tv",
      "body": "There are makeup exams. The threat was unnecessary [as mentioned in previous comments](https://www.reddit.com/r/PESU/s/dhEaDj52mb)"
    }
  ]
}