{
  "id": "1crrgwm",
  "title": "Please be empathetic towards each other [ suicides in PES ]",
  "content": "Every day I hear a new person has committed suicide in this college. People just come here to get degree, there is no need for strict and rude behaviour, it's just 4 years, just let people pass by, why torture each other, be it teachers to students or students to other students or maybe even students to teachers. As far I know I have heard 5 suicides in this college overall.",
  "metadata": {
    "author": "Other_Scarcity_4270",
    "url": "https://www.reddit.com/r/PESU/comments/1crrgwm/please_be_empathetic_towards_each_other_suicides/",
    "permalink": "/r/PESU/comments/1crrgwm/please_be_empathetic_towards_each_other_suicides/",
    "score": 49,
    "created_utc": 1715691390,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l3zvyxy",
      "body": "3 alone in EC campus. \n\nThe audacity of the college to function normally without suspending classes as if nothing really happened shows the new lows of PES."
    },
    {
      "id": "l3zw361",
      "body": "And this is apparently a so called reputed college?"
    },
    {
      "id": "l3zw4re",
      "body": "It's a sham"
    },
    {
      "id": "l3zyd64",
      "body": "Most of the problem lies with these COE fuckers, whenever a student does any mistake, be it by mistake or even if it is intentional, these people treat you as if you were some criminal, and they make you feel that it is the end of the world for them, one of my friends had accidently carried a phone to his exam, and when he himself reported himself after finding out, he was reprimanded badly by those COE fuckers, according to him, they made him feel worthless..."
    },
    {
      "id": "l400351",
      "body": "Coe?"
    },
    {
      "id": "l400kq3",
      "body": "Chief examination officer"
    },
    {
      "id": "l400zc4",
      "body": "I have had some extremely bad memories in this college, I was in a very similar state as these folks, but somehow survived because I was spiritual by nature."
    },
    {
      "id": "l40dfeq",
      "body": "Its Controller of Examination"
    },
    {
      "id": "l4eqkwi",
      "body": "I know this incident. Such trashed up minds these people have to screw up the minds of others."
    }
  ]
}