{
  "id": "1crsqrf",
  "title": "What i actuaaly saw and the truth",
  "content": "So i was there in my class room, teacher taking the class... i turned to my right, i saw the guy(sorry idk his name, but the student whi su\\*cided), he was on the other side of the railing, between the 4th and third floor stairs of the boys washroom. first he left his hand and held the railing quickly, i thought he was just being dumb(it was all of a sudden, i am really sorry i couldnt process it that quick, i still regret). and the next second he left his hands completely. i forze for  few seconds and everyone in my class too got traumatized. \n\nwhy didnt i save him or inform others?  \nit happened really quick that 1 min was like 2-3 seconds.\n\nwhat happened next? ppl took him away, there wese gaurds and teachers out there.\n\nwhen did it happen? exact 10:10 am.\n\nwas it an accident? Hell no it wasnt.\n\n",
  "metadata": {
    "author": "More_Scholar6180",
    "url": "https://www.reddit.com/r/PESU/comments/1crsqrf/what_i_actuaaly_saw_and_the_truth/",
    "permalink": "/r/PESU/comments/1crsqrf/what_i_actuaaly_saw_and_the_truth/",
    "score": 95,
    "created_utc": 1715694894,
    "flair": "ANNOUNCEMENT :snoo:",
    "nsfw": true,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l405de3",
      "body": "Did they continue class for you?"
    },
    {
      "id": "l407ogk",
      "body": "Hey, buddy. It's not your fault. Please stop blaming yourself. I've read your multiple comments today and yeah, it's sad that it had to happen, but it was not under your control. It happened and there's nothing we can do about it. It's a sad day, but it is definitely not your fault. Everything happens in a spur of a moment. We cannot go back and change the past. So don't beat yourself up over it. The reaction time that you had is too less for anyone to do anything. If someone else were in your position, I doubt they would have been able to do anything.\n\nYou witnessed a traumatizing event, but it is not your fault. Please seek therapy if you need it, but please, do not blame yourself. You are just a witness."
    },
    {
      "id": "l409nrm",
      "body": "I'm really sorry you had to witness that. Just know that it wasn't your fault and there was no way you could have known it was going to happen. We cannot change what happened, but we can move forward with what we have. Its a pretty sad and unfortunate event, and I can understand how traumatising it could have been in the moment. I struggled with these exact feelings years ago and I still experience them sometimes. Its not easy, but you will slowly understand that it is not on you. Don't blame yourself. Please take care. \n\nThis goes for everyone in the vicinity of the incident."
    },
    {
      "id": "l40d8oy",
      "body": "Bro it's shock, at that point of time ur mind goes numb, you cannot do anything even if u want to. Don't beat urself up, it's not your fault."
    },
    {
      "id": "l40n1ua",
      "body": "Were you in mech or main block"
    },
    {
      "id": "l41rcdm",
      "body": "Did you guys get to know the reason behind it? Academic, social, financial??"
    },
    {
      "id": "l44lu3r",
      "body": "Apparently he turned up late to the exam due to some display error in the app, and the invigilator insulted him and refused to let him in, instead of calmly telling him that the rules won't allow him to write the exam if he comes over 30 mins late"
    },
    {
      "id": "l4blp9d",
      "body": "thanks bro, appriciate it"
    },
    {
      "id": "l4blqc6",
      "body": "main block"
    },
    {
      "id": "l4blrj0",
      "body": "yes"
    }
  ]
}