{
  "id": "1csdi0x",
  "title": "I woke up late and I missed my esa ",
  "content": "I woke up late and missed my linear algebra esa . I am in 4 th sem . Can anyone tell me what will happen. \nWill it be a backlog if so will it be shown as backlog forever .\nWill it affect me in the long run ?\nWill I have to write during summer ? \nI am really stressed out any info would be helpful.\nPlease \n",
  "metadata": {
    "author": "Illustrious-Leek8681",
    "url": "https://www.reddit.com/r/PESU/comments/1csdi0x/i_woke_up_late_and_i_missed_my_esa/",
    "permalink": "/r/PESU/comments/1csdi0x/i_woke_up_late_and_i_missed_my_esa/",
    "score": 34,
    "created_utc": 1715751559,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l449yxq",
      "body": "Dude Calm down. Nothing's gonna happen. You can  write it during the summer."
    },
    {
      "id": "l44aarm",
      "body": "How severely is it going to affect me ? \nI have a cgpa of 8.4 \nPlease don't sugar coat things based on the recent events. \nI have told my parents already and they are ok with what happens"
    },
    {
      "id": "l44cp4w",
      "body": "Chill out man there's always another chance. I have a friend who had a back in ACD and he cleared it within a year. It will defo bring your grade back up.\n\nJust take the extra time to study the subject better that's all"
    },
    {
      "id": "l44emgj",
      "body": "It's not going to affect your overall score. For now it's a backlog, then during the backlog exams , suppose you score an s grade , that's what is reflected on your overall grade."
    },
    {
      "id": "l44eqo8",
      "body": "Correct me if I am wrong... Isn't it better to miss exams then write backlog (cause of the extra study time)"
    },
    {
      "id": "l44ewd4",
      "body": "Yep precisely. If you write a half assed esa you'll end up with a d or c.instead miss it and study well for the same exam a month later."
    },
    {
      "id": "l44f26k",
      "body": "As far as I know backlogs don't consider internal marks so it depends fully on ESA. So you'll have a lesser margin for error. You have the divided by 2 advantage in regular which is lost in backlogs"
    },
    {
      "id": "l44fhgd",
      "body": "It won't severely affect you. You can clear it when backlog exams take place."
    },
    {
      "id": "l44og2y",
      "body": "I have 1 doubt \nFor backlog esa its only the esa component but is there a max grade limit ? Or if I get 90+ in esa will I get S"
    },
    {
      "id": "l44oiaz",
      "body": "If I remember correctly, there is a maximum grade limit. I don't remember which grade that is. Best to get it verified."
    },
    {
      "id": "l44tra9",
      "body": "I think it's possible to get an s in backlogs"
    },
    {
      "id": "l44vbpy",
      "body": "Did you sleep well atleast?"
    },
    {
      "id": "l44vqv5",
      "body": "i mean, jumping seems a good option ig, what do you think?"
    },
    {
      "id": "l44xq7m",
      "body": "Don't even joke about it, are you insane?"
    },
    {
      "id": "l450hhy",
      "body": "damn, i thought we all agreed onto this, we in univ were making jokes all along, damn, dint knew reddit was different, i mean how could reddit be good than irl?"
    },
    {
      "id": "l450u1e",
      "body": "u/ChromaticChaos, delete this"
    },
    {
      "id": "l451rfj",
      "body": "just tell me, i'll delete"
    },
    {
      "id": "l454b37",
      "body": "I missed one exam like this in first sem I got an S grade later don't worry it'll alright"
    },
    {
      "id": "l456d4i",
      "body": "That's good to know"
    },
    {
      "id": "l456g4z",
      "body": "Yea until i looked at time then holy fuck"
    },
    {
      "id": "l49zthp",
      "body": "One of my friends had the same GPA and missed a lab exam in her third semester and it did not affect her one bit. She cleared the backlog and her placements went very well. Do not worry."
    },
    {
      "id": "l9ngjxd",
      "body": "Don't spread bullshit everytime about maximum cap , there is no max cap for backlog people even got S grade"
    },
    {
      "id": "l9nlu90",
      "body": "Well there *used* to be a cap and it was a B grade for my batch. That's why I also suggested looking into the policy now. Policies change from year to year and it's not always possible for one person to know if something has changed. That's why this subreddit exists so everyone can contribute.\n\nNext time instead of attacking me you can contribute productively by helping the person who asked."
    }
  ]
}