{
  "id": "1cspnv9",
  "title": "How many more \"we call upon\" letters and \"speaking out\" posts..",
  "content": "4 students dead in less than a year. Screw 'action' being taken or anything, at what point will the college take cognizance of the fact that they need to pay more attention to their students? \n\nThere is literally no elected student council. There is no student organisation whatsoever to liaise with the management. There are no resources to seek help. The designated counsellor in college breaks confidentiality when spoken to and reports it to the management. There are no mental health awareness programs conducted. There are no workshops conducted to sensitise the professors. The management makes it a ritual to have a speech every year to call every new batch 'terrible'.\n\nThis does not sound like an institution that is blameless. This does not sound like a healthy environment. And this most certainly does NOT sound like the Pride of PESU or whatever. It hurts. And I don't know how to help fix it.",
  "metadata": {
    "author": "throwawayrandomlol",
    "url": "https://www.reddit.com/r/PESU/comments/1cspnv9/how_many_more_we_call_upon_letters_and_speaking/",
    "permalink": "/r/PESU/comments/1cspnv9/how_many_more_we_call_upon_letters_and_speaking/",
    "score": 97,
    "created_utc": 1715792054,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l46l9nq",
      "body": "The guys who were worried about PESSAT results need to rethink their admission here."
    },
    {
      "id": "l46q5xy",
      "body": "There is no student council so true. Random kids who have more connections and were licking the boots of teachers and the previous council become the new council. Forget elections 😔"
    },
    {
      "id": "l46qqrw",
      "body": ">The designated counsellor in college breaks confidentiality when spoken to and reports it to the management\n\nLol what?"
    },
    {
      "id": "l46tskp",
      "body": "Yeah, completely pointless"
    },
    {
      "id": "l46twvk",
      "body": "Unfortuantely there is not much we can do. Doreswamy and his family have political connections and can easily evade consequences. In the end this is a money making business, which means they will do anything to avoid tarnishing their so called reputation, even if it's something as awful as covering up deaths."
    },
    {
      "id": "l46txpf",
      "body": "\nCollege is not helping students with their mental wellness. very true. they give us a lot of shit for the smallest of things. true. \nEven though we are all aware of this, why take such a hasty decision?! Why end your life over something so trivial? That after being in this place for 3 years.... come on you know better\nIt's so sad to see someone lose their life like this. I can relate to the situation better than anyone else because I was literally in the same place an year ago.\nI went late to an esa and they didn't let me in. I raged out of the room. I was obviously very upset but I rewrote the exam next semester, I even got an S grade. \nIt's not the end of world.... it's just disappointing to see people give up so easily....."
    },
    {
      "id": "l46zrjg",
      "body": "It's great to see that you saw it as just another exam. But just putting this out there for all those who say \"don't give up\" or \"be stronger than this\". Not everyone is on the same boat. You couldv'e been in the exact situation as him(or you think so) BUT YOU'RE NOT!\n\nEvery individual processes things differently, we all come from different backgrounds, we're all in different financial situations and different kinds of pressure. So never for one second evaluate another's situation being in your own shoes. \n\nBeing aware of it still doesn't mean you know how to handle it. What's trivial to you may not be the same for another. Everyone is running a different race even if we're all physically dealing with the same things."
    },
    {
      "id": "l470izm",
      "body": "I could not agree more. The current student body is such a shame. I've personally had a few encounters with them(HER, to be more precise), and you can see the teacher's influence in their words and how they handle things.\n\nStudent council is for the STUDENT. Duh!\n\nYou'd think they know that but no, student council is just another powerhouse of PES where there's more micro control over the students"
    },
    {
      "id": "l471ay7",
      "body": "you come to college to learn. they are responsible for your education not your mental stability\n\nsay what you want about the other three but i don't think they are one bit responsible for this one."
    },
    {
      "id": "l472dzh",
      "body": "I think PES professors should also fill out the anti-ragging form."
    },
    {
      "id": "l472o5q",
      "body": "what a truly boomer emotionally bereft thing to say. If that were truly the case then there would be no laws mandating counsellors in educational institutions. But there are. Why? Because it IS part of the responsibility of an educational institution to provide all support needed for a student to learn and grow as both a professional' and as a human being. Shame on you."
    },
    {
      "id": "l473jpf",
      "body": "using laws to prove a point does nothing. i can list a million laws which aren't reasonable.\n\ninstead of calling to authority, come up with an actual argument. Shame on you"
    },
    {
      "id": "l473s7u",
      "body": "Exactly, they are useless (SHE tbh), the way they ruined our fests was worse. And they always look forward to lick the teachers. No support or interactions with the students. Extremely useless council. Just vk's pets."
    },
    {
      "id": "l474wk9",
      "body": "i could rant for HOURS"
    },
    {
      "id": "l475af3",
      "body": "What a terrible take lmao\n\nby that logic should all companies who offer mental health support and wellness to their employees stop? We only go there to work anyway\n\nAnd you're telling me it's an unreasonable law to ask colleges to have mental health support? Seek help dude"
    },
    {
      "id": "l475xa1",
      "body": "Ah yes shame on me for wanting universities to stop being uncaring unfeeling machines. Shame on me for wanting better support for the well being of all students. Shame on me for wishing there was a system in place (like there is in multiple foreign universities) to help vulnerable students. Shame indeed."
    },
    {
      "id": "l47vqh3",
      "body": "To add onto this, the student body is so non existent that neither me nor my friends know who the current presidents are, nor bothered to know who was elected. We are in 6th sem fyi."
    },
    {
      "id": "l482g8c",
      "body": "its coming today"
    },
    {
      "id": "l483x6v",
      "body": "y'all gotta protest or sumn bro this is scary \n\norganise something, stage a walkout, do ANYTHING"
    },
    {
      "id": "l48cuek",
      "body": "Hi guys, I am writing this in word doc instead of a WhatsApp msg, because its lengthy, and I want only the interested one read this. This is for students who are currently in college, and to anyone who is interested to read. I recently finished my Brach, my college days where memorable I had good friends, I had good teachers too, in my college I had few encounters with the College Management, I was part of many events, and I was actively involving myself with lot of leadership building tasks, I had situations where the college tried to frame students for their mistakes, when I tried to solve the issue only then I was able to see the system of education and universities with a better goggles. If I am a student in a college and I find injustice, inhuman behavior by staff, imposing non-logical rules on students from the management, can I do anything about it, can I raise my voice and not be targeted, I ask myself, are we just students who have to  obey what is been told, be quit towards everything that we can’t tolerate, are we just losers in students who are passing from the professor’s mercy?  As a citizen of our country what can we do to future students, will it be the same situation for the future students.  In India mainly there are two type of colleges or universities, autonomous and nonautonomous. An autonomous college that has been granted autonomy by the University Grants Commission (UGC) or the respective state government. The aided (non-autonomous) colleges are affiliated to any one of the state-governed Universities. Imagine a situation where the college as implemented a rough rule and few students have an issue with it, what can they do so that college will listen to them and consider their request. Let’s consider a good situation where the college is filled with good people and react to the students request honestly, then the students can request the college and get their problem solved. What it the college is filled with bad people? Firstly, I think no amount of complaints or request would force any college to take a decision which is not favoring them, or worst any saddest human is in charge of the college and decide not to change the decision to satisfy ego. What can a single student can do about it? Is it required to have a student body directly engaged with the College authorizing authority, for example UGC or govt University Committees? What can be powerful enough for the colleges to listen students and not ignore? It’s difficult to find a person or authority to whom colleges should be answering, even if the govt brings such facilities there will be lot of issues in execution. For example, imagine there is a section or person appointed to listen to students, it’s easy for colleges to buy him, and be in good terms because students change in 4 or 5 years but not university owners. Even though there are many criteria mentioned by the authority’s for colleges, to have a clubs or council in students’ extra activities to involve them in student politics. Many colleges ignore or destabilizes such interest in students, if they find it difficult to deal with it, I will list as many as possible techniques by colleges I have heard and seen. Colleges try to keep is as secret that in order to have a good score for being a better college in India or state ranking, or any type of ranking system for colleges, they need to have committees for students to help them and resolve their grievance. Few colleges smartly fake it, when it comes to records, they choose some favorite students who is either loyal or dumb to sign documents as testimony, which says they were part of many clubs and did many things which they didn’t do. Next one highly smart work of teachers who will find students who are hungry for more marks and appreciation to be the leaders and make them their puppets so when if there is a situation where the students are trying to go against the college favor, they can use the puppets to calm them down. Usually they make the elections to interested students who wants to be in charge of any group or council to have an interview selection as a criterion and pick their favorite there. Imagine there is situation and students are angry about college and thinking of a protest, they keep exams and internals to keep the students busy so that they wont have time to think of doing anything, or give tougher questions to make the students think that they are not concentrating on studies, which gives an opening for teachers to insult and keep them low.  There will be lot of spy teachers who keep track of all the things in the class and college, they will be friendly with students who are talkative and who likes to share all secrets they know easily. Most of them are good teachers, I am warning about the exclusive bad ones.  When you know few things you get angry, Don’t be short tempered and fight with anyone whom you find guilty, things you should be sacred of as a student, your Internals, exams, your degree certificate, your original Certificates which is taken in the time of admission, good behavior report for masters and visa, don’t be a fool who falls inside tiger cage. So, let us work on our question, what a single student can do?  Educate yourself with all the knowledge about how the colleges are running, be united. If you have any kind of groups or event groups stay connected with as many other block students. If there are any type of elections or anything make sure the elections are democratic, of course you cannot stand alone against the teachers, but you can try to convince your fellow students and to make sure none of your friends are becoming a puppet in their hands.  Imagine a situation you have to raise your voice against something in your college do you have any ways to inform every other student in your college, but if there is a committee of leaders from all the blocks who are responsible enough to inform to their respective fellow block students its possible, and now it’s not ‘a student voice it’s the students voice.’ Now you have a united student voice, ok whom to talk with? firstly find the humblest way you can to request the college, most of the colleges have good people in charge. Sometimes it’s the teachers who smartly blame the management sometimes vice versa, in few situations the approach towards the govt university committes will help in case of autonomous I think its UGC but I have no knowledge on how to complain.  If it’s only bad guys all around try finding someone who is above the bad guys. It’s the tough part, which I cant suggest as a guide to anyone with a format but I can give tips on finding your own ways.  Know as many past events and actions taken in your college which gives a hint towards the path, read about incidents around the country, try finding student unions and seek help. Personally, I don’t have any experience dealing with such issues. I believe it would take a lot of courage and leadership qualities for students to make any changes they want to. Everything you do in college years effects the juniors, if you know things share them, have a constructive support among students and make sure you can pass the knowledge and experience Find leaders in your juniors and support them. Thank you for reading, have a great day.  "
    },
    {
      "id": "l48jv1f",
      "body": "https://drive.google.com/file/d/1tRFPIE5GFO1LIg7XySsBvTDq8yiw0Xzs/view?usp=drivesdk"
    },
    {
      "id": "l497wht",
      "body": "Exactly Man But why are you getting Downvoted"
    },
    {
      "id": "l49812g",
      "body": "Sad That this College may Go to dustbin by these Kind of Comments.Really Sad"
    },
    {
      "id": "l4982a6",
      "body": "By Students of PES Themselves"
    },
    {
      "id": "l49clac",
      "body": "For the same damn reason you're getting down voted. You haven't replied to a single comment of mine, do it buddy let's have a talk and I'll open your eyes.."
    },
    {
      "id": "l49csly",
      "body": "I'm going to watch every fkng comment you make and down vote it,  because you've said some inhumane things regarding this case and I'm not letting you go until you have a talk with me."
    },
    {
      "id": "l49fcm9",
      "body": "I seem to be a bit unaware but what's this student council now?\n\nA few years ago PES did not have a student council (in the authentic sense atleast). The \"student council\" was basically just a collection of the different club heads, and there wasn't really any head. The \"council\" was just an honorary title with no actual power. All they did was go about organising events for their clubs and occasionally co-operate for larger shared events like fests. But there wasn't anything related to student welfare or representation. And club heads as you know aren't based on elections, so there isn't any democracy here. \n\nAre you referring to the same thing, or is there a new concept of an elected student body?"
    },
    {
      "id": "l49k9ta",
      "body": "Rowlet, in the batch both of us were in, they had a student council. Everybody who licked the one professors boot was a part of it. There has always been a student council at PES. Just never got the student."
    },
    {
      "id": "l49kk2y",
      "body": "Interesting. The fact that I didn't know we had one says enough about it I guess lol."
    },
    {
      "id": "l49qowd",
      "body": "People are so shallow minded and ignorant that they cannot even perceive different perspectives."
    },
    {
      "id": "l49qvht",
      "body": "College is absolutely responsible for your mental health. Shallow mindeded thinking won't get you anywhere."
    },
    {
      "id": "l49vjhn",
      "body": "Almost the same concept. The most famous and fav people become the student council. (Has a president and the vice president) They help in the approval of the club events. They are also responsible for some stuff while conducting fests. But they rather did nothing for fests. They didn't help the other students for stuff. They are just for name sake. They do nothing other than just listening to teachers and being on their side. And they do nothing when it comes to student welfare."
    },
    {
      "id": "l49vls1",
      "body": "Exactly"
    },
    {
      "id": "l49vntp",
      "body": "So true, they are just for the name sake. They don't do any work."
    },
    {
      "id": "l4a9mmv",
      "body": ">I've personally had a few encounters with them(HER, to be more precise)\n\nDo you mean L**i and M*k**d?\n\nOr did you guys get new ones now?"
    },
    {
      "id": "l4alnsv",
      "body": "There are new ones now"
    },
    {
      "id": "l4am6e1",
      "body": "kekw"
    },
    {
      "id": "l4amcb5",
      "body": "Uk the worst part? I was just sitting yesterday near the reception and was preparing for esa. I saw these few housekeeping staff (idk exactly who but looked like them) .... There was their leader who was giving extra money for people who did off - hours duty. She was telling her group \"ad yavano bid satodnalla, adhuna clean madake yaaru baraka ready ne irralilla, amele OT karisi clean madaste\" (someone random fell na yesterday, no one was ready to clean that mess, I had to call up OT to get it done) I was so shocked to see the adamant, rude and careless behaviour. People are so low minded here!"
    },
    {
      "id": "l4amj7n",
      "body": "This is exactly why Asian education systems face so much criticism. A student in an undergraduate program is highly impressionable. It is important to make sure that they know they're cared for and their feelings are valid. Youth is the biggest tool a country has. Our country has that tool, it is important to use it well."
    },
    {
      "id": "l4amnbz",
      "body": "Clearly, literacy doesn't imply education, which doesn't imply knowledge."
    },
    {
      "id": "l4ao1u4",
      "body": "instead of putting up all those banners pes should hire you to advertise it"
    },
    {
      "id": "l4aq1b4",
      "body": "you start replying only under posts where it is required to justify this shit show that we have to put up with.....dont you have esa's to study for....if you are a student here"
    },
    {
      "id": "l4bfp1c",
      "body": "sheesh"
    },
    {
      "id": "l4buedj",
      "body": "Th\\*\\*\\*s\\*a"
    },
    {
      "id": "l4ef94d",
      "body": "From information from another student who happened to be present near the student who passed away, it was definitely an hour delay on the part of the student going to write the exam. The college followed rules. The rules were also clearly communicated much prior to the exam. I don't see any faults on the side of the college. Not sure if teachers were harsh if that's the case then teachers must be trained to always call in the counselor to handle the situation and coach the student in a better fashion and calm him/her down and tell them it's ok to take the exam next time. It's an exam after all. Mental health seems to be an increasing problem nowadays. Is it the excessive usage of mobiles and gadgets that people have stopped communicating openly and are they having difficulty to own up a problem and self reflect and correct it.  Something is definitely wrong."
    },
    {
      "id": "l4ehjjz",
      "body": "Everyone is entitled to share their opinion. They are free to express it. You can express yours too in a nice way. This particular  message feels like a threat and it isn't good.  Just imagine if a teacher spoke in the same way. Let's be respectful to each other."
    },
    {
      "id": "l4f2gy4",
      "body": "You are right. Most of the childhood trauma shows up in adulthood. Family environment, Parenting, friends, and the person are responsible for their own mental health."
    },
    {
      "id": "l4fr19m",
      "body": "New ones  \nBut you were there during li and mu?"
    },
    {
      "id": "l4frz64",
      "body": "Yep, I'm a final sem student right now."
    },
    {
      "id": "l4g5e2i",
      "body": "Welcome to literally any club in pes.. I was a core member of a certain club(not gonna mention which), put in the time and effort and got good at the club, but because the club head didn't like me, he called me racist and bigoted(and yes, I have made certain racial jokes in game to a couple of my closer friends, who I've built a relation with for 3ish years and this club head was one of them.. a whole lotta drama caused us to split) and kicked me out of the club with literally not a word.. and if I approach the seniors they tell \"it's not our problem go deal with it\".. I mean like personal shit should never come in between club work."
    },
    {
      "id": "l4g5epk",
      "body": "Welcome to literally any club in pes.. I was a core member of a certain club(not gonna mention which), put in the time and effort and got good at the club, but because the club head didn't like me, he called me racist and bigoted(and yes, I have made certain racial jokes in game to a couple of my closer friends, who I've built a relation with for 3ish years and this club head was one of them.. a whole lotta drama caused us to split) and kicked me out of the club with literally not a word.. and if I approach the seniors they tell \"it's not our problem go deal with it\".. I mean like personal shit should never come in between club work."
    },
    {
      "id": "l4g5h05",
      "body": "Welcome to literally any club in pes.. I was a core member of a certain club(not gonna mention which), put in the time and effort and got good at the club, but because the club head didn't like me, he called me racist and bigoted(and yes, I have made certain racial jokes in game to a couple of my closer friends, who I've built a relation with for 3ish years and this club head was one of them.. a whole lotta drama caused us to split) and kicked me out of the club with literally not a word.. and if I approach the seniors they tell \"it's not our problem go deal with it\".. I mean like personal shit should never come in between club work."
    },
    {
      "id": "l4g5iag",
      "body": "Welcome to literally any club in pes.. I was a core member of a certain club(not gonna mention which), put in the time and effort and got good at the club, but because the club head didn't like me, he called me racist and bigoted(and yes, I have made certain racial jokes in game to a couple of my closer friends, who I've built a relation with for 3ish years and this club head was one of them.. a whole lotta drama caused us to split) and kicked me out of the club with literally not a word.. and if I approach the seniors they tell \"it's not our problem go deal with it\".. I mean like personal shit should never come in between club work."
    },
    {
      "id": "l4g9ym6",
      "body": "I'm so sorry that you had to go through that, really, that's unfair. \nAnd ik the kinda partiality that goes on within clubs. \nIf it still bothers you, you can still take it upto the faculty advisor of that particular club(although it won't make much of a difference if they're not as involved, but worth a try) "
    },
    {
      "id": "l4h5qgz",
      "body": "damn bro you built a relationship with this club head for 3 years but also they don't like you? pick a lane lol"
    },
    {
      "id": "l4h5y4r",
      "body": "Nah mate I'm out of college at the moment lol . Jus chill out lifes like that.. (and o hell ya I'm doing much better than that idiot of a club head lol)"
    },
    {
      "id": "l4h6059",
      "body": "weird; your Redbull ambassador was the chair of the 'council', as far as I remember"
    },
    {
      "id": "l4h63gt",
      "body": "Actually the club head weasled his way into my friends group and broke it apart in a year.. so fun fun :\")"
    },
    {
      "id": "l4h6wbu",
      "body": "okay now I'm curious, wow what even happened there"
    },
    {
      "id": "l4h7blm",
      "body": "This is what happens when talentless people become club heads. They become so narrow minded. They do whatever they like. I am so sorry to know this happened to you. I have also seen my own good friends becoming cheap shit after they become club heads. They get head weight. 😭"
    },
    {
      "id": "l4h7fxa",
      "body": "Way to go lesgoo 😀"
    },
    {
      "id": "l4h7owr",
      "body": "LmaO.. basically dude was from another department, liked a girl. Came into our group.. I and another guy helped him like get comfy with the grp.. then he kicked the other guy out cause apparently he was hanging out with other people too much.. then after a couple months kicked out a few more girls out cause apparently they didn't want to hang out as much(it was exam time atp).. then finally I was the last to exit cause apparently I was vying for his girl(I was not, and actually encouraged them to get together) finally a mutual friend told me that this dude liked another girl who he asked out and was rejected, and so he threw her and her friend out.. fun times, but only after this whole thing did I get to know who truly were my friends and who weren't"
    },
    {
      "id": "l4h7u4e",
      "body": "Head weight yes. But he wasn't completely talentless.. he was a first class ass kisser"
    },
    {
      "id": "l4h81f4",
      "body": "🤣🤣🤣🤣"
    },
    {
      "id": "l4n2orr",
      "body": "Wow"
    },
    {
      "id": "l4n8a26",
      "body": "Welcome to unnecessary drama.. tbh a huge red flag is when ur grp is hesitant to do literally anything"
    },
    {
      "id": "l6ov258",
      "body": "Which campus is this?"
    }
  ]
}