{
  "id": "1ct5kz1",
  "title": "The whole truth about the suicide",
  "content": "I pretty sure im the only one who was a witness to the cause of the suicide. I had gone to the office of the COE in the 3rd floor of Mech Block at around 9:35 AM. No other student was there, only the sir was there who always sits at the reception.  I asked him my question and he did not know so he told me that he would call one of the teachers. Before he could leave, one boy came into the room and stood just left of me. He first asked which exam was taking place at 10:00 AM and what was the room number for that exam. Then the time was around 9:40 AM. That sir said that no exam is there at that time, the only time for exams is 8:30 AM to 11:30 AM and then 12:00 PM to 3:00 PM. Then he said that in PESU app for him it was showing that the exam was at 9:30 AM. The sir asked him the subject code of the exam, he told it and sir said that the exam for that subject started at 8:30 AM. Then that sir went to call Saritha Maam. She came and he explained the situation to her. She said that it was more than 1 hour since the exam has started so he wont be allowed to write it now. He then said that in PESU app it was showing the time wrong and it was showing at 9:30 AM. She said that he should not have reffered to the PESU app and only looked at the time table. He then said that he was “an old student” and he asked if they could please somehow let him to write the exam. I didn’t really know what he meant by that. Then for the next 2 to 3 minutes he kept begging and pleading asking them if he could write the exam. He asked if they could go to the exam hall and ask the invigilator, but Saritha Maam said nothing can be done as he was more than an hour late. He asked a couple more times and then dejectedly left. I felt really bad hearing him. Im pretty sure he never even went to the exam hall or had any conversation with the invigilator at all cause he didnt even know which room the exam was happening in. He pretty much only talked to Saritha Maam and the sir who sits at the Office of COE. I personally never liked Saritha Maam and always thought of her as arrogant and rude (I was taught by her during my 2nd Semester), and i definitely felt that she handled this situation wrong as she could have atleast done something to try to help him. After he left I got the answer to my query and left probably a minute or two after he did. The time was around 9:45 AM by then. I  saw from another post that the suicide happened at 10:10 AM. Around 10:30 AM my friend called me and told me that one student had suicided. But that day around 7 PM was when i got to know that it was the guy who was with me in the Office of the COE who had done this. I really felt so horrible about this. I was not sure if I should post this but i dont think this deserves to to be kept in the dark.",
  "metadata": {
    "author": "TheBoss2607",
    "url": "https://www.reddit.com/r/PESU/comments/1ct5kz1/the_whole_truth_about_the_suicide/",
    "permalink": "/r/PESU/comments/1ct5kz1/the_whole_truth_about_the_suicide/",
    "score": 115,
    "created_utc": 1715837069,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": true,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l49p7fw",
      "body": "Did they say that he will be barred from placements?"
    },
    {
      "id": "l49qwpj",
      "body": "So there was no conversation about placements or backlogs? \n\nThere seems to be a lot of misinformation and twisting of truth going on in this particular case, thank you for sharing what you saw."
    },
    {
      "id": "l49slsb",
      "body": "Yes he was over an hour late, and there was nothing said about placement or backlogs."
    },
    {
      "id": "l49snbr",
      "body": "Nope nothing like that was said, only what i have written in the post nothing else was said."
    },
    {
      "id": "l49td04",
      "body": "Hmm so he he didnt go to the exam centre at all?"
    },
    {
      "id": "l49umet",
      "body": "The PESU app has always been unreliable as hell, I can believe this."
    },
    {
      "id": "l49x1jm",
      "body": "Hoping what you said is credible because there's a lot of misinformation regarding this."
    },
    {
      "id": "l49xnbh",
      "body": "Would you be willing to be a witness for the police report for this?"
    },
    {
      "id": "l49xsfr",
      "body": "OP has no clue what happened between him leaving this chamber and him committing suicide. This may provide context but this does not invalidate any other eyewitness accounts of who he spoke to and what he said."
    },
    {
      "id": "l49y2ov",
      "body": "Appreciate the initiative to provide information OP but calling it \"The Whole Truth\" is potentially misleading; by your own account you do not know what happened in the 25-30 minute gap between the student leaving the chamber and the actual suicide itself. It would be great if you made it very clear that you simply don't know what happened between the time he left and the incident.\n\nNonetheless, thanks for the further context and information!"
    },
    {
      "id": "l4a153g",
      "body": "Look atleast he has spoken out and we have a little clarity about the issue.. u can't expect OP to know everything like as if walls had ears to listen to everything"
    },
    {
      "id": "l4a1r3z",
      "body": "I dont think so but im not sure since there was around 15 to 20 mins between the time he left the COE Office and the suicide, the reason i dont think is because even when he went out he didnt know where the exam was taking place as they had not told him the room explicitly, or maybe he could have found out from some where else and gone."
    },
    {
      "id": "l4a1s99",
      "body": "Yea what I have said is true."
    },
    {
      "id": "l4a2005",
      "body": "not expecting that. just asked them to make it clear that they only know part of it and not \"the whole truth.\" Please try to comprehend. I have also thanked and appreciated the OP."
    },
    {
      "id": "l4a2lef",
      "body": "I called it the whole truth because this is mostly the reason why he did what he did. Yes i dont know what happened in 20 to 25 mins, and maybe something else did happen which pushed him over the edge but im just telling what i saw and heard."
    },
    {
      "id": "l4a6fol",
      "body": "Hmm okay"
    },
    {
      "id": "l4ae2gp",
      "body": "When everyone's PESU academy showed the same exam timing how can only his go wrong? PESU either doesn't reload or shows correct stuff most the time. He must be capping.."
    },
    {
      "id": "l4b0tld",
      "body": "He has replied to every comment under this post except this😂And no he won’t have the balls to do that.,and i don’t blame him ,even i prolly would have done the same"
    },
    {
      "id": "l4bv48n",
      "body": "The reason i didnt reply is because my parents told me not to get involved with the police regarding this, but if i decide to do it, what exactly would I have to do?"
    },
    {
      "id": "l4bwkon",
      "body": "is this already pushed under the rug or are the cops investigating this and holding pesu accountable?"
    },
    {
      "id": "l4c2ab4",
      "body": "Yeah the lady in the coe office is a rude bitch"
    },
    {
      "id": "l4cefm9",
      "body": "According to the established rule, no one is allowed to enter the examination hall 30 minutes after the exam has started. Changing this rule for a single individual, especially when all other classmates and friends have adhered to the timing, raises questions. It is difficult to understand how the timing information could be incorrect for just one student while being clear for everyone else.\n\nI do not intend to suggest that the student was lying, but merely expressing my point of view. When a student arrives more than an hour late, invigilators must follow the rules, which dictate that students are not allowed entry after 30 minutes. They are simply performing their duties. He was over an hour late, making it very difficult and potentially requiring a lot of work to let him take the exam.\n\nThis situation involves a professor in the COE room, who also has to adhere to these rules. COE stands for Controller of Examinations. If so, she is responsible for overseeing the whole examination process. This might not be the first time she has encountered a student arriving late or missing an exam, which could explain her response. According to the student, his PESU app indicated the exam started at 9:30. However, what was he doing till 9:40?"
    },
    {
      "id": "l4ck440",
      "body": "Based on the information I received , it appears that the statement about placement was made by the invigilators while they were in the exam hall. It is important for you to clearly mention that you have no knowledge of any events or statements that may have occurred outside of the COE room. Therefore, you can only confirm that the statement was not made within the context of the COE room, and cannot comment on any occurrences beyond that setting."
    }
  ]
}