{
  "id": "1ct9upz",
  "title": "I need help deciding which college to join",
  "content": " Posting it here again cuz it was removed by a moderator on the grounds of being repetitive. I already saw the post by rowlet owl I was asking for insights on which college I should choose and will PES refund my fees if I get a better college. How is that repetitive? Pls don't remove my post this time I really need help to make an informed decision🙏\n\n.[https://www.reddit.com/r/PESU/comments/1ct5ujc/which\\_branch\\_can\\_i\\_get\\_at\\_no\\_dont\\_make\\_such\\_posts/](https://www.reddit.com/r/PESU/comments/1ct5ujc/which_branch_can_i_get_at_no_dont_make_such_posts/) \n\nI fked up my CET and COMEDK so my only options now are VIT Vellore, PES and Amrita CSE core. If I go for PES or Amrita I can be a day scholar but if I go for VIT I have to go to hostel. But my main deciding factor is placement. Can someone list the priority order I should follow keeping this in mind? I got 14XX rank what are the odds of getting CSE in RR campus? ",
  "metadata": {
    "author": "crazy_confused96",
    "url": "https://www.reddit.com/r/PESU/comments/1ct9upz/i_need_help_deciding_which_college_to_join/",
    "permalink": "/r/PESU/comments/1ct9upz/i_need_help_deciding_which_college_to_join/",
    "score": 2,
    "created_utc": 1715855773,
    "flair": "PESSAT/Admission",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l4aq3p6",
      "body": "1. Refund is given only if you get PES also via CET. If I am not wrong, they used to also give a refund if you get into IIT/NIT. Any other reasons, no refund.\n2. You can see what branches you can get here: [https://www.reddit.com/r/PESU/comments/1ct5ujc/which\\_branch\\_can\\_i\\_get\\_at\\_no\\_dont\\_make\\_such\\_posts/](https://www.reddit.com/r/PESU/comments/1ct5ujc/which_branch_can_i_get_at_no_dont_make_such_posts/)\n3. As for your options, I would recommend PES > VIT > Amrita. The same link I attached also has my comment which includes placement statistics over the last 3 years."
    },
    {
      "id": "l4b5a9v",
      "body": "You can rule out Amrita Core CSE, PES and VIT are way more better"
    },
    {
      "id": "l4bm11k",
      "body": "pes is probably better than the rest. \n\nmaybe it's just the PRIDE OF PESU in me though"
    },
    {
      "id": "l4d8ip1",
      "body": "I have never heard of Amrita so I can't comment on that but pes is better than vit srm and all of those colleges "
    },
    {
      "id": "l4e0pwh",
      "body": "They won’t give a full refund, as per my knowledge when I asked if I could leave the college (management fees btw) I got a med school seat and they said that I can and a daily sum will be deducted for example for me 2 years ago so it was 2k so for every day of college you “attend” from the day of bootstrap they deduct a sum per day and they will give the rest.. but I think there’s a time limit upto a month? Or like 1.5 months. You can talk to the admission team about this they will give you an idea about what the rules are for the year. I understand it’s tough to take a decision but if you are from Bangalore Pes is the best option! Placement is better than most of the colleges and you can maintain a gpa for masters too. All the best!"
    },
    {
      "id": "l4f2h8e",
      "body": "What if a candidate blocks a seat through pessat and then he by chance cracks bitsat which is held in may end and june end \nThen what refund will he get?"
    },
    {
      "id": "l4fc458",
      "body": "Nobody can resist the pride"
    },
    {
      "id": "l4fc74k",
      "body": "You'll need to talk to them and find out. As far as I'm aware, the refund is only for CET seats at PES and IIT/NIT seats"
    },
    {
      "id": "l4fi6g1",
      "body": "Sure thanks"
    }
  ]
}