{
  "id": "1cthlcr",
  "title": "PES cse or BITS EEE",
  "content": "Should I go for PES cse or BITS pilani main campus EEE",
  "metadata": {
    "author": "Active-Year-8562",
    "url": "https://www.reddit.com/r/PESU/comments/1cthlcr/pes_cse_or_bits_eee/",
    "permalink": "/r/PESU/comments/1cthlcr/pes_cse_or_bits_eee/",
    "score": 0,
    "created_utc": 1715878358,
    "flair": "PESSAT/Admission",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l4by14f",
      "body": "counting your chickens before they hatch..."
    },
    {
      "id": "l4by7ru",
      "body": "I am pretty confident about the options"
    },
    {
      "id": "l4c80d9",
      "body": "Okay since people are downvoting , here's the truth I am already studying in bits eee, I had these options last year along with rvce ise, just wanted to see what yall would advice lol"
    },
    {
      "id": "l4c80ee",
      "body": "I took pes because i didn't know my marks were enough for eee, so I pulled out of the bits seat allotment process \n\nI was beating myself up for it back then but now I am glad i didn't take it.\n\nCS at pes is an absolute breeze. Everything till now is easy af and there isn't much stress at all. Easy 9+ gpa and get back 1 lakh a sem in scholarships \n\nEven first year at bits is quite hard, I've seen my brother's mechanics syllabus and it's insane what they make you do. My friend who got a seat there is struggling with a sub 7 gpa. Granted he doesn't study much, he does what i do. \n\nSo basically what I'm trying to say is that maybe it's advantageous to be in the top at a lower college than at the bottom of a better college. If you barely made it in, chances are that most people are smarter\n\nAnd most people who take electronics shift to computers anyways, if you're personally not interested in either i think you should pick the path which gives you better opportunities. Atm that's computers"
    },
    {
      "id": "l4c8c1u",
      "body": "Yeah actually you are right I should have taken rvce ise \n\" being at the top in lower college is better than being lower at better college \" is true"
    },
    {
      "id": "l4c9xyj",
      "body": "I didn't notice that you said bits main campus. Maybe take ece or something in hyd or Goa, the competitive culture is lower there."
    },
    {
      "id": "l4ccm0o",
      "body": "BITS anyday"
    },
    {
      "id": "l4cdjgx",
      "body": "the gpa at bits is a relative gradong system is it the same in pes? i dont think the placements are conparable though."
    },
    {
      "id": "l4ckcvh",
      "body": "nigga is this even a question, i see you're already in bits. is your cg bad or something that's making u think this"
    },
    {
      "id": "l4cpiel",
      "body": "No lol I just wanted ro show my friend that people will always be biased towards their college no matter what 😭"
    },
    {
      "id": "l4d0lj2",
      "body": "that's not true"
    },
    {
      "id": "l4gb18x",
      "body": "they say it's absolute grading but they do relative only. and the \"relativeness\" if you can call it that is not transparent. \n\nagain, the bottom students in bits would also definitely be struggling for placements. especially people in eee. all im saying is that it's also a reasonable choice to be one of the best in a lower tier college.\n\nwould you rather get placed at the lower end of electronics jobs at bits, or at the top companies that visit pes. college brand doesn't matter when literally everyone around you has the same badge on them as well."
    },
    {
      "id": "l4gb54r",
      "body": "what do you mean should've taken. cet or comedk results arent out yet right. or did you already choose bits or something"
    }
  ]
}