{
  "id": "1ctvxrd",
  "title": "PESU EC CAMPUS 1st Year Hostel(Super excited)",
  "content": "How is it?\n\ndouble sharing or more?\n\nHow is the food?\n\nCurfew timings?\n\nHow is the general vibe?",
  "metadata": {
    "author": "Top-Mud2566",
    "url": "https://www.reddit.com/r/PESU/comments/1ctvxrd/pesu_ec_campus_1st_year_hostelsuper_excited/",
    "permalink": "/r/PESU/comments/1ctvxrd/pesu_ec_campus_1st_year_hostelsuper_excited/",
    "score": 6,
    "created_utc": 1715917398,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l4eojuh",
      "body": "Also,are the girls and boys hostel common?ðŸ™ƒ\n\nðŸ‘‰ ðŸ‘ˆ"
    },
    {
      "id": "l4eq5rv",
      "body": "High expectations i se"
    },
    {
      "id": "l4eqde6",
      "body": "yessssðŸ™‚"
    },
    {
      "id": "l4eqo7t",
      "body": "Hostel is 6km away from campus. They put a bus every morning at like 7 or something and a bus back at the general class times. If you're class is over early you either wait or you go by auto or something\n\n3-4 people a room depending on the number of people there.\nLike first they'll fill 3 and then will sequentially add 4th guy if needed\n\nFirst year yes girls hostels are right next to the boys. From second year boys get hostel inside campus. Girls stay there for 4 years\n\nCurfew is like 7.30 the warden will allow you to take food orders till like 8 or 8.30"
    },
    {
      "id": "l4erpe1",
      "body": "curfew is 7:30???\n\nwottttt\n\neven on weekends?"
    },
    {
      "id": "l4erscy",
      "body": "Thanks a lot for the reply bhaiðŸ™"
    },
    {
      "id": "l4es9f5",
      "body": ">curfew is 7:30???\n\nBoys get exception once you become friends with the warden. The girls warden is a bitch. The boys warden is a bro."
    },
    {
      "id": "l4euqqr",
      "body": "Yeah you can get max 830 to 9 if you're in good terms with him\n\nI remember some comment a long time ago calling him a sweet panda or something lmao\n\nJust don't piss him off or he'll yell his ass out"
    },
    {
      "id": "l4ev9tv",
      "body": "Is there anyone who is currently studying in pes University? I got rank 4 in Pessat but I am really confused about a lot of things"
    },
    {
      "id": "l4ey1tp",
      "body": "Lol dm"
    },
    {
      "id": "l4f11lt",
      "body": "Yeah it's sad to see how excited you are, trust me it's not a good time. \n\nIf you're a girl then you're screwed completely and I suggest you don't join hostel but take a pg or something as the warden and the state of the girls hostel is beyond horrible and i mean it. \n\nIf you're a guy, it's fine if u join hostel as in the 2nd year you get shifted to the hostel in campus itself it's a little bit more tolerable if ur a guy"
    },
    {
      "id": "l4f1um2",
      "body": "Glad to see my bro Pandu getting some appreciation."
    },
    {
      "id": "l4fhtyw",
      "body": "Dude deleted the account itself after asking such a question lmao"
    },
    {
      "id": "l4hloyb",
      "body": "Worst part is that you can't order anything after 8pm"
    },
    {
      "id": "l4k785s",
      "body": "Be ready to eat raw veggies and half cooked shit in your lunch and dinner âœ¨"
    },
    {
      "id": "l51jp46",
      "body": "My house is 4.4 km away"
    },
    {
      "id": "l6ljj5x",
      "body": "Bro since the hostel is very costly in pesu can we live in a pg nearby and would it be cheaper ?"
    }
  ]
}