{
  "id": "1ctyvbr",
  "title": "Should i join PES",
  "content": "I got rank 6xx in PESSAT which is enough for RR campus CSE. Is it worth it to join pes?\n\nI may have messed up kcet and comedk but i might get something like BIT or dayanand sagar.\n\n",
  "metadata": {
    "author": "StraitBurr",
    "url": "https://www.reddit.com/r/PESU/comments/1ctyvbr/should_i_join_pes/",
    "permalink": "/r/PESU/comments/1ctyvbr/should_i_join_pes/",
    "score": 7,
    "created_utc": 1715928656,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l4f8nzu",
      "body": "Pes is popular among IT crowd so placement wise it's certainly worth it ( average package is 8 lpa)but if you are planning on pursuing ms right after passing out , I'm not sure because as a university it doesn't have a name worldwide and it doesn't come under top 100 in nirf"
    },
    {
      "id": "l4f9xao",
      "body": "If your only other options are bit, dayanad then join PES. There is more focus on academics here though"
    },
    {
      "id": "l4fdin9",
      "body": "Where do you get your facts from? PES has a really good alumni base, is well known, with a few good teachers left whose LoR are really valuable"
    },
    {
      "id": "l4fhcej",
      "body": "Well I mean if you want to pursue ms RIGHT AFTER PASSING OUT internationally , as I said placement wise it is excellent. It's sus in itself when they have explicitly made it mandatory for offline counselling which implies it's popular among the bangalore crowd and not elsewhere. I'm sure it would be easier to apply for ms once one has had experience in their 1 St job through in- campus placement and recruitment."
    },
    {
      "id": "l4fhred",
      "body": "You are pretty misinformed.\n\nPES alumni study at places like CMU, UCLA, UCSD, UPenn (and other Ivies) and so on. It does have a name worldwide, especially at CMU where there exists a pretty large PESt group. PES alumni base and crowd are one of its best advantages and are on-par with some of the best colleges in the country.\n\nAlso, the average package is close to 12LPA, not 8. And the latest stat is from 2024, when the market was bad. Check the stats."
    },
    {
      "id": "l4fjuh4",
      "body": "Between vit v and pes ec ?"
    },
    {
      "id": "l4fle2j",
      "body": "Average among computers or average overall"
    },
    {
      "id": "l4fmrxa",
      "body": "Vit V."
    },
    {
      "id": "l4fnsu7",
      "body": "CS"
    },
    {
      "id": "l4fo2i7",
      "body": "Is that pretty good then? Do you know the stats of similar colleges in Bangalore. Cs only ofcourse"
    },
    {
      "id": "l4fo7lu",
      "body": "Ayy maccha PES beda, bere college ge hogu, MS maadthya andre ninge PES inda jasthi use yen illa \nBari placements andre hogu PES ge"
    },
    {
      "id": "l4fpy07",
      "body": "Nope, no clue. RV is pretty similar, that's all I know"
    },
    {
      "id": "l4fvp91",
      "body": "Since you've got a pretty good rank, I'd say you're capable of surviving in pes. But pes is not for the weak of hearts.\n\nIf you can deal with pressure and can manage your time well and be balanced despite a tight timing schedule then go for PES it's great\n\n  \nBut if you need more time for your self, as in, self studies, doing your own project on your own time and work at your own pace then I wouldn't recommend"
    },
    {
      "id": "l4g27og",
      "body": "Pes ec "
    },
    {
      "id": "l4gtg75",
      "body": "Pes almost double fees"
    },
    {
      "id": "l4hx8q7",
      "body": "Vit v if you can work hard, I'm in the same situation as you but I'm choosing vit, atp you definitely have to work hard any clg you get"
    },
    {
      "id": "l4jssib",
      "body": "How double, your getting vit cat-1?? \nIf it's kcet then prefer pes ec "
    },
    {
      "id": "l4k132c",
      "body": "It's cat 2 and pessat"
    },
    {
      "id": "l4ltjtu",
      "body": "well the alumni of a lot of colleges go on to study in top colleges. just asking but wouldn't international recognition and worldwide reputation come from rankings in stuff like qs or nirf and MoUs for twinning programs and semester exchange programs? like if universities don't collaborate then it'll be hard to verify the claim of international recognition no? i feel that applies to other tier 2 colleges as well like say rv or daiict or lnm etc etc because for an institute overseas they might see the nirf rankings which are official government docs - we know the rankings suck but they don't. like there are MoUs of VIT and Manipal and others with universities worldwide like UNSW or John Hopkins etc etc?"
    },
    {
      "id": "l4m29fw",
      "body": "Speaking for US Uni's only since that is primarily what I know about, but is usually the same everywhere: reputation of Indian Uni's only matters if it is IIT/NIT/BITS. Any other Uni is treated practically the same. They don't really care about NIRF rankings. At the end of the day, your profile is what matters. A top reputed college simply provides you with more/better opportunities to build your profile while a lower ranked one wont have that many. A top college tag is known to be \"good to have\" rather than a \"must have\"."
    },
    {
      "id": "l4m3b9n",
      "body": "I see. also want to know ... i couldnt find any of PES' MoUs anywhere so do you know if they have semester exchange or 2+2 program tieups with any top colleges? to have an opportunity for the students to get to go to other top colleges internationally for experience etc etc"
    },
    {
      "id": "l4m3moz",
      "body": "PES used to have a semester exchange program, including a tie-up with UCB, but I'm not sure if it has resumed after COVID."
    },
    {
      "id": "l4m3x04",
      "body": "unfortunately doesn't look like it since I tried hard to find but couldn't see anything anywhere."
    }
  ]
}