{
  "id": "1ctzhip",
  "title": "PESSAT RESULTS",
  "content": "I got 2.6 rank in pessat, what are my chances of getting cse in pes main campus. I feel like I do have a chance coz there will be candidates who'll get pes through KCET and JEE (they will have lesser fees if they get pes through KCET and JEE). Anyone help??",
  "metadata": {
    "author": "Ldyboykiller",
    "url": "https://www.reddit.com/r/PESU/comments/1ctzhip/pessat_results/",
    "permalink": "/r/PESU/comments/1ctzhip/pessat_results/",
    "score": 0,
    "created_utc": 1715931266,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l4fhebw",
      "body": "[https://www.reddit.com/r/PESU/comments/1ct5ujc/which\\_branch\\_can\\_i\\_get\\_at\\_no\\_dont\\_make\\_such\\_posts/](https://www.reddit.com/r/PESU/comments/1ct5ujc/which_branch_can_i_get_at_no_dont_make_such_posts/)"
    },
    {
      "id": "l4fmav6",
      "body": "Fees for jee quota nd pessat quota is the same"
    },
    {
      "id": "l4fmixv",
      "body": "What's the jee cutoff rank wise?"
    },
    {
      "id": "l4fmput",
      "body": "I have tried to find jee cutoff everywhere but didnt get it specifically. Ppl here on reddit told me its around 98%ile for cse. I had applied thru jee main quota (i got 95.8%ile) today i got an email for provisional admission in which they offered only ME EEE and BT at RR campus"
    },
    {
      "id": "l4fmzkb",
      "body": "Ok but why would anyone scoring 98+ percentile go to pes 😭😭😭"
    },
    {
      "id": "l4fn6cu",
      "body": "Thts what i think! Every college i thought i had a chance to get cse in their cutoffs r 98%ile or more i be thinking if all 98%ilers r going to these clgs y r josaa clgs cutoff so high then 😭. Some clgs have to have lower cutoffs right coz their rnt these many 98%ilers"
    },
    {
      "id": "l4fnm97",
      "body": "You don't get any cs in any half decent college at 98. 99+ is where it's at for cs. Also lots of bangaloreans I know with 99ish percentile prefer pes because it's in bangalore so close to home."
    },
    {
      "id": "l4fpb5x",
      "body": "They could literally go to NIT'S or even IIIT. I'm sorry but pes is not better than nit's (brandwise) obviously some lower nit's are bad but at the end of the day it's a nit"
    },
    {
      "id": "l4fvmfq",
      "body": "I had 98.6%ile in mains, sorry to burst your bubble but no NIT or IIIT would take me in with CSE. Some northeast NITs sure, PES has better placements than those. If branch is not your priority then maybe it makes sense. Also my year I didn’t get CSE RR with jee mains"
    },
    {
      "id": "l4geksw",
      "body": "+1"
    }
  ]
}