{
  "id": "1cuahyu",
  "title": "Is pes even worth it anymore ?",
  "content": "The fees have skyrocketed and the placements simply do not keep par . also the 4th suicide in under a year has shocked me pretty bad . Overly strict overly pricy and simply not that good an option this year . that is why I’m not going to the counselling despite a 2K rank let me know if I’m making a mistake ",
  "metadata": {
    "author": "Front-Glove-4376",
    "url": "https://www.reddit.com/r/PESU/comments/1cuahyu/is_pes_even_worth_it_anymore/",
    "permalink": "/r/PESU/comments/1cuahyu/is_pes_even_worth_it_anymore/",
    "score": 28,
    "created_utc": 1715965471,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l4hcjf1",
      "body": "Your call Your Take Your wish"
    },
    {
      "id": "l4hcngi",
      "body": "Honestly I would rather take the risk and spend the amount in a decent college than take a low tier college and struggle to even find a basic job.\n\nNow coming to fees, Pessat fees is exorbitant, but if you are taking CSE I feels its worth the investment! \n\nAdding on to that if you are getting the better college than pes for lesser price then please GO FOR IT! \n\nPlacements are down everywhere so it isnt that just PES is affecting.."
    },
    {
      "id": "l4he1my",
      "body": "what other colleges do you have"
    },
    {
      "id": "l4hf7po",
      "body": "Depends on your other options"
    },
    {
      "id": "l4hg0fs",
      "body": "See Your Options in hand then decide"
    },
    {
      "id": "l4hgmdq",
      "body": "Depends on your options"
    },
    {
      "id": "l4hin86",
      "body": "kcet is only worth via KCET imo, youd rather pay that much for BITS at that point if youre getting it"
    },
    {
      "id": "l4hjzu6",
      "body": "No, if you ask me tbh, the faculty isn't really good here, competition is only getting higher as intake increases each other, which would mean high stress to maintain a certain level, and the fees through PESSAT definitely don't justify what you receive in return, maybe KCET fees is worth it but definitely not PESSAT, forget about management."
    },
    {
      "id": "l4hky1a",
      "body": "It's definitely not worth going to this college."
    },
    {
      "id": "l4hlbs2",
      "body": "lmao bro don't wanna be that person but your previous post says that your pessat rank is 3.5k? why you gotta lie bro?"
    },
    {
      "id": "l4hqueu",
      "body": "TLDR, not worth it, atleast through PESSAT.\n\nYou can read through the pros and cons for more details: https://bit.ly/pesu-faq"
    },
    {
      "id": "l4hs1ct",
      "body": "Lmfao. But you're also jobless enough to go through his history, so ima call it a draw"
    },
    {
      "id": "l4jiud9",
      "body": "Yeah I've also noticed this thing here some people on reddit check post history like whaat"
    },
    {
      "id": "l4jj8r6",
      "body": "kcet is only worth kcet?"
    },
    {
      "id": "l4jnucr",
      "body": "It’s not like PES is dying you have you, hundreds are ready to take the seat if you don’t want."
    },
    {
      "id": "l4k4ryo",
      "body": "pes* is worth via kcet"
    },
    {
      "id": "l4k8o83",
      "body": "Whyd you comment like 3 different things lmao?"
    },
    {
      "id": "l4keylx",
      "body": "What's your definition for Good Faculty"
    },
    {
      "id": "l4l84ah",
      "body": "Man i was so hyped after getting my PES results, turns out fees is 4.8L PA (only for tuition)"
    },
    {
      "id": "l4lczgw",
      "body": "Should PES create B.Tech (Hons) in addition to the regular B.Tech so that the regular B.Tech can be made easier to reduce academic stress?"
    },
    {
      "id": "l4ldfzq",
      "body": "Maybe joining IIT is a better option."
    },
    {
      "id": "l4loqf4",
      "body": "Bro this year I can’t trust anything I’ve increased by 1K rank to be completely safe with it"
    }
  ]
}