{
  "id": "1cv7jlo",
  "title": "How is EEE in rr campus",
  "content": "i was just wondering how eee in rr campus is",
  "metadata": {
    "author": "Wrong_Arrival_6875",
    "url": "https://www.reddit.com/r/PESU/comments/1cv7jlo/how_is_eee_in_rr_campus/",
    "permalink": "/r/PESU/comments/1cv7jlo/how_is_eee_in_rr_campus/",
    "score": 5,
    "created_utc": 1716067064,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l4nl4hl",
      "body": "Tough 4th sem is like hell pro Max \nAlready eee is tough in general  make your choice wisely if your really interested then take"
    },
    {
      "id": "l4o3t7r",
      "body": "Hi, I graduated from the EEE program in 2022 and I can help you with some answers. If you want to learn engineering and graduate and get a job, the program is good. If you are looking to do something like research, want to apply for master's programs, take a very calculated move. While most of the professors will teach you what is in the syllabus, get ready to read, as a few of them are not very approachable outside classrooms. \n\nMany professors have not/are in the process of getting their Ph.Ds and very few resort to exploiting students to complete their PhD work, which is unethical. Unfortunately, many professors are affected by department politics, which is essential to get ahead I guess. They are overworked, underpaid, stressed out, and talk like they're at dead-end jobs. A lot of good professors left the department due to this. There is a very weird hierarchy in the department. The HoD is extremely knowledgeable, good luck getting the benefit of any of that lol. I had a terrible experience doing research at PES, and I would suggest that you be very wary of this if you plan to join PES. \n\nTheir whole rule of publishing a paper for your capstone to graduate is absolute BS, as it gives accomplishment to bad, non-unique research, and students are forced to do something they are not interested in.\n\nIf you plan to join PES for EEE, do internships through summer breaks. Be proactive about your career. Most students go towards non-EEE jobs/MS programs after graduation - which says a lot about how trends are in the department.\n\nPES is definitely in ruin due to poor management and a lot of professors leaving. The recent unfortunate news does not help either, as it highlights how much the staff actually cares about students in the institution. \n\nPES might be much better for CSE or another branch, EEE has a long long long way to reach \"decent\", and from what I've heard, things aren't getting better."
    },
    {
      "id": "l4pdi5d",
      "body": "do yourself a favour and dont join eee in pes rr. the department is absolutely trash. very few teachers are actually good. they're all unnecessarily strict about the most random shit. this place is just sad. the placements arent great either cause hardly anyone gets that minimum gpa to qualify for placements."
    },
    {
      "id": "l4rdvcp",
      "body": "that bad huh"
    }
  ]
}