{
  "id": "1cvrevx",
  "title": "Need help",
  "content": "I got 2.6K rank in pessat, what are the chances of getting cse+aiml at rr campus in round 1? Or even if I get it in electronic City campus is it worse than rr campus??? As in the faculty and the campus there, are things like these better in rr campus than in electronic City te y campus???",
  "metadata": {
    "author": "Ldyboykiller",
    "url": "https://www.reddit.com/r/PESU/comments/1cvrevx/need_help/",
    "permalink": "/r/PESU/comments/1cvrevx/need_help/",
    "score": 0,
    "created_utc": 1716134013,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l4r336m",
      "body": "You will find your answers here:\n\n1. Branch cutoffs: [https://www.reddit.com/r/PESU/comments/1ct5ujc/which\\_branch\\_can\\_i\\_get\\_at\\_no\\_dont\\_make\\_such\\_posts/](https://www.reddit.com/r/PESU/comments/1ct5ujc/which_branch_can_i_get_at_no_dont_make_such_posts/)\n2. RR vs EC campus: [https://www.reddit.com/r/PESU/comments/14anjmd/comment/jobruzy/](https://www.reddit.com/r/PESU/comments/14anjmd/comment/jobruzy/)"
    },
    {
      "id": "l4r56jn",
      "body": "Thanks bro"
    },
    {
      "id": "l4reibt",
      "body": "Yes the placements are pooled but some recruiters give eligibility to only rr students."
    },
    {
      "id": "l4revaj",
      "body": "Can we take one seat in PES then again can we appear for 2nd round of councelling to try for better course??. Btw my rank is 1397 is cse core possible????"
    },
    {
      "id": "l4reynf",
      "body": "Someone pls reply it's urgent 🙏🙏"
    },
    {
      "id": "l4rurzr",
      "body": "Really? Can u specify the recruiters that have done this"
    },
    {
      "id": "l4ruuu9",
      "body": "Not sure but heard of it"
    },
    {
      "id": "l4rux4k",
      "body": "Pretty sure it's false"
    },
    {
      "id": "l4twp2n",
      "body": "That's not true. Recruiters don't even know which campus you're from. Make sure you're well informed before making such claims."
    },
    {
      "id": "l4twsey",
      "body": "Placements are pooled, which means that they take place together for RR and EC students. Recruiters cannot distinguish between students based on campus."
    },
    {
      "id": "l4twxf5",
      "body": "Yes, you can choose a branch in round 1 and then choose something else, if available, in round 2. \n\nNext time you can tag me or just make a new post. Commenting on a post only notifies the person who created it."
    },
    {
      "id": "l4txndc",
      "body": "I think that's coz of the huge difference in the number of students at RR campus and EC campus. Like one year there were 600 students in RR campus and only 300 in EC campus. So the probability of a student getting selected from rr campus is more than that of a student from ec campus"
    },
    {
      "id": "l4u7w7x",
      "body": "Ohhk thank you 🙏"
    },
    {
      "id": "l4vun7q",
      "body": "hey, am getting cse aiml in rr and cse in ecity. Can i chose cse in ecity campus and then switch to cse rr campus in the second round of counseling if seats are available?"
    },
    {
      "id": "l4vzbnv",
      "body": "Yes"
    }
  ]
}