{
  "id": "1cwjm4j",
  "title": "Bunking at PES",
  "content": "Basically the title, how hard is it to bunk classes at PES RR campus? I got pretty strict parents and I'd like to bunk once in a while. I know some of y'all smart fucks r gonna say \"omg if u wanna bunk then join other colleges\" but I've made my decision and bunking isn't really a priority but I'd like to know if I can get away with it without my parents knowing or not ",
  "metadata": {
    "author": "DotEmbarrassed664",
    "url": "https://www.reddit.com/r/PESU/comments/1cwjm4j/bunking_at_pes/",
    "permalink": "/r/PESU/comments/1cwjm4j/bunking_at_pes/",
    "score": 10,
    "created_utc": 1716222206,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l4w804b",
      "body": "If your parents care, they can see your attendance on an app. If they don't know about the app, they don't know your attendance"
    },
    {
      "id": "l4wakwo",
      "body": "Attendance is updated everyday on the Pesu app. Try hiding that fact from your parents. Also every student has a faculty advisor in this college, some of them can give a call to your parents in case your attendance falls below a certain number.\n\nYou should be fine with having around 70-75% attendance (this keeps getting more and more linient with every sem) and you can scam attendance with club activities."
    },
    {
      "id": "l4wc8vl",
      "body": "Just dont tell them about the PESU App."
    },
    {
      "id": "l4wpef8",
      "body": "If your parents check your attendance through PESU app, you cannot do anything, but if they do not, then you can easily bunk college up to 30% of your attendance worth of classes."
    },
    {
      "id": "l4wplpv",
      "body": "As others have said, just don't tell them about the PESU app if they want to check your attendance regularly. If they do install it and you cannot uninstall it from their phone without them noticing, just reset your password and it will sign out of all logged in sessions lmao. \n\nAnd as someone else pointed out, if a faculty advisor does call if your attendance is too low, there is nothing you can do about it"
    },
    {
      "id": "l4wu55y",
      "body": "What rank did you get?"
    },
    {
      "id": "l4wzsdz",
      "body": "10xx"
    },
    {
      "id": "l4yxan9",
      "body": "Just because you didn't tell them it doesn't mean they won't know or they won't find out. Btw, There is a parent's group and everything is discussed."
    },
    {
      "id": "l4yxj11",
      "body": "Suggest to be honest with your parents if you are bunking. Honesty is the best policy. Moreover, if you score well, then no parent would mind bunking some classes within the 75% attendance."
    },
    {
      "id": "l4z0ci0",
      "body": ">There is a parents group\n\nI have never heard of such a group till date. My dad and mom both have verified there is no such parents group. They only get mails regarding PTM"
    },
    {
      "id": "l4z5jnh",
      "body": "I remember the parents exchanging numbers during pessat councelling. This group was created by the parents themselves and not by the university."
    },
    {
      "id": "l4z5y5e",
      "body": "Oh okay, then I am not aware of this. for our batch this didn't happen."
    },
    {
      "id": "l4z6hii",
      "body": "Keep attendance abv 80 and ur good to go"
    },
    {
      "id": "l4znqlf",
      "body": "skill issue"
    },
    {
      "id": "l4zw3xf",
      "body": "![gif](giphy|TamGVAGxDTYDNt3dpn|downsized)"
    },
    {
      "id": "l514fhb",
      "body": "i have 50% attendance this sem , bunked more than 50% of classes (Got proxy also). At the end i gave fake medical certificate and all chill. They didnt call my parents also and parents dont check PESU app. So yeah bunked a lot of class this sem and Gave ESA without any problems. So yeah getting away with bunking is pretty easy."
    },
    {
      "id": "l5kzhcf",
      "body": "Goated advice"
    }
  ]
}