{
  "id": "1cxomyk",
  "title": "Will they give marks in esa for attempting questions",
  "content": "So I have an exam at 12 TODAY. And I realize I’m super fucked because I don’t know ANYTHING (it’s DC in 4th sem ece) I really don’t want a backlog. I have 27.5 internal marks so I need only 25 marks in esa to pass. But tbh idk anymore. I understand nothing in this subject. But apparently everyone’s struggling so they might give relative grading. If it’s relative grading does the passing mark come down to 30? \n\nAnd will they give me marks for attempting questions even if the answers (very) wrong. Pls help I’ve never been in this situation before and idk what to do to stop panicking\n(Don’t want a backlog coz I do NOT want to study this stupid subject again)\n",
  "metadata": {
    "author": "Zealousideal_Host785",
    "url": "https://www.reddit.com/r/PESU/comments/1cxomyk/will_they_give_marks_in_esa_for_attempting/",
    "permalink": "/r/PESU/comments/1cxomyk/will_they_give_marks_in_esa_for_attempting/",
    "score": 11,
    "created_utc": 1716341855,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l5409dl",
      "body": "Try to write something close to the original answer. Consider using ai to learn things (like load ur notes into some tool and have it explained simply). If u try to answer that way maybe u might get an E if relative is there. There is still time."
    },
    {
      "id": "l540fga",
      "body": "They're very inconsistent. Just write whatever and hope for the best. Nothing you can do"
    },
    {
      "id": "l549wek",
      "body": "Same situation man.But hopefully everyone is struggling"
    },
    {
      "id": "l54bqqw",
      "body": "Lol DC the worst subject on earth,anyways I passed it by fluke, I was in a similar spot just that I had a bit more internals 30 ig, I wrote utter trash and passed , but don't take my experience by the word anything can happen"
    },
    {
      "id": "l54k5cw",
      "body": "Does sireesha teach you? 😭😭"
    },
    {
      "id": "l54pwgu",
      "body": "As someone who like WINC domain and doing my capstone in WINC, I can feel the pain and I do understand that DC is the worst subject of this domain. \n\nFirstly it was a badly designed course, and its very underrated. It is a good course, but the teachers who actually knew DC left after teaching my batch DC (that is none other than the OG God Sanjeev Sir). Even the WINC domain people like Suganti, Vamshi sir themselves dont know DC properly. \n\nHence, without a proper teacher for DC, the subject has become traumatic for all students. So, what I suggest is, study from those Sanjeev Sir combined slides. It is golden resource. I am sure some topics will be removed for your batch due to 4-units revision, but most of it would be same. \n\nI shared it among some juniors of my club and some others whom I knew personally, but I don't know if they circulated among all 6 sections of DC.\n\nComing to your question, just write whatever you know bro. Write some shit in exam, you will atleast get some marks. try to score more in nurmericals / derivations bro. \n\nAnd lastly, DO NOT PANIC. This is your last ESA of this semester. DO well!! All the best !"
    }
  ]
}