{
  "id": "1cxpn4b",
  "title": "FEES REFUND POLICY DOUBT!!!",
  "content": "Im preparing for BITS.. im getting decent in tests.. i wont clear it in the first attempt but ik i will be able to in the second.. but pes we have to pay fees by 25th.. 4 lakh smth in my case.. and bits results n cutoffs n stuff will come on 3 july.. and pes start end of july/start of august.. so.. if i wanna ask for a refund before the semester starts how much will they give back? i read somewhere that according to ugc guidelines if i ask for a refund 15 days before the semester starts im supposed to get 100% of the fees back.. is this tru? or 4 lakh gone?",
  "metadata": {
    "author": "Spaceman_134",
    "url": "https://www.reddit.com/r/PESU/comments/1cxpn4b/fees_refund_policy_doubt/",
    "permalink": "/r/PESU/comments/1cxpn4b/fees_refund_policy_doubt/",
    "score": 7,
    "created_utc": 1716345009,
    "flair": "PESSAT/Admission",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l5482h9",
      "body": "If your are going for another college you have to give up your seat before the 2nd round of counseling \nMostly they will keep 10K and return everything, this was the case last year idk about this year"
    },
    {
      "id": "l54hcjq",
      "body": "even i have the same problem i want to give bits second attempt but wwill they return fees till that ttime since bits second atttemmpt is in end of june . And on their website pes has asked for original documents so do they keep that>?"
    },
    {
      "id": "l54qik1",
      "body": "the official email sent to me mentioned that withdrawal of admission can be done by July 10th and the total  amount will be refunded minus 10k"
    },
    {
      "id": "l55t7on",
      "body": "okay, thanks alot!"
    },
    {
      "id": "l55tbba",
      "body": "bro if possible cud u dm me the pic of the email... cus in the counselling email it wasnt mentioned for me...thanks for the help!!"
    },
    {
      "id": "l55tntg",
      "body": "yeah sure :))"
    },
    {
      "id": "l56cltp",
      "body": "bro can you dm me the pic of the email too, i didn't receive any email like that."
    },
    {
      "id": "l56dazk",
      "body": "sure"
    },
    {
      "id": "l56o8su",
      "body": "Please DM me also"
    },
    {
      "id": "l5avmvr",
      "body": "Bro pls DM me the pick too, I am having the same case as op here"
    },
    {
      "id": "l5awmqb",
      "body": "same same please dm"
    },
    {
      "id": "l5bsi6h",
      "body": "Can you DM the pic to me too??"
    },
    {
      "id": "l5bt4un",
      "body": "hey could you dm me the pic aswell… in the same situation rn thanks a lot"
    },
    {
      "id": "l6n2iqe",
      "body": "Can you dm me that email. This is the second time I see someone mentioning about it but it seems I have not received it."
    }
  ]
}