{
  "id": "1cxw2na",
  "title": "Manipal ECE vs PES ECE",
  "content": "The title ",
  "metadata": {
    "author": "RohitxD_",
    "url": "https://www.reddit.com/r/PESU/comments/1cxw2na/manipal_ece_vs_pes_ece/",
    "permalink": "/r/PESU/comments/1cxw2na/manipal_ece_vs_pes_ece/",
    "score": 1,
    "created_utc": 1716369957,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l55a6fr",
      "body": "Definitely not PES ECE, its not worth at all"
    },
    {
      "id": "l55a93g",
      "body": "I've seen you say that a few times..Can you explain why it's not worth it?"
    },
    {
      "id": "l55ad2p",
      "body": "i'd say manipal ece, pes is only known for it's cse placements and i'm not sure about other branches. On the other hand manipal has various students projects, clubs which can give you more domain exposure, and placements are also good i think"
    },
    {
      "id": "l55aiwu",
      "body": "Thanks for your response. I was thinking the same..BTW do you think cutoffs may change this year or be the same as last year? I am missing cse by about 60 ranks and don't know if I can get it or not"
    },
    {
      "id": "l55bj0q",
      "body": "yeah I will make a post about it soon after my exam ends tmrw. please wait"
    },
    {
      "id": "l55bm4q",
      "body": "Thank you and all the best for your exam"
    },
    {
      "id": "l55e08m",
      "body": "Counseling just before jee advanced and the fees will make many people not opt for PES. By third round you can get CSE easily"
    },
    {
      "id": "l55f89m",
      "body": "i'm not sure about that, but even if you're missing cse, you can take ai/ml or fintech if you are interested in any of them, cause 60-65% of the curriculum in these courses are similar to cse core"
    },
    {
      "id": "l55mws4",
      "body": "I am missing cse aiml by 60 ranks..no chance of getting core.. But didn't know that pes had fintech as well"
    },
    {
      "id": "l56fbsp",
      "body": "are there 3 rounds for the counselling??  \ni heard ki there are only 2??"
    },
    {
      "id": "l56fg8q",
      "body": "Usually teen hote hai na ?"
    },
    {
      "id": "l56fsdz",
      "body": "idk bro afaik 2 hi hote and first wale mai mostly saari seats bhar jaati to the people with ranks above 8k or above 10k have a very slim chance to get some good branch"
    },
    {
      "id": "l5a6bjw",
      "body": "oh wait mb, pes only has ai/ml. Manipal has ai/ml and fintech, i was talking about that"
    },
    {
      "id": "l5b5lr8",
      "body": "Nahi hote teen rounds, dont spread false info without backing"
    },
    {
      "id": "l5b5mjo",
      "body": "Yes, only 2 rounds"
    }
  ]
}