{
  "id": "1cxx7us",
  "title": "counseling documents doubt",
  "content": "in the instructions its given weve to submit the original documents...whats that supposed to mean do i have to give them my official board marksheets and other documents?",
  "metadata": {
    "author": "draught0fLivingDeath",
    "url": "https://www.reddit.com/r/PESU/comments/1cxx7us/counseling_documents_doubt/",
    "permalink": "/r/PESU/comments/1cxx7us/counseling_documents_doubt/",
    "score": 5,
    "created_utc": 1716374682,
    "flair": "PESSAT/Admission",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l55iepd",
      "body": "Yeah. These cunts will grab everything they can get their hands on"
    },
    {
      "id": "l55r1xg",
      "body": "yea i also have the same doubt but as the official marksheet isnt available yet ig we'll have to make do with the ones issued on digilocker"
    },
    {
      "id": "l55rkgh",
      "body": "yeah same i also have that only"
    },
    {
      "id": "l55s6nw",
      "body": "yk what, in the mail it also says that it should be signed by the college authority which ig refers to our school's principal, do you anything about it?"
    },
    {
      "id": "l55sfrd",
      "body": "summer vacations are going on school is closed ill just bring the printouts hopefully they wont create any issues 🥲"
    },
    {
      "id": "l55sjgs",
      "body": "ugh ikr same my schools out as well, btw have you got a transfer certificate from your school?"
    },
    {
      "id": "l55svp1",
      "body": "nothing at all i just have my 10th marksheet 😭😭 it also says that ill have to submit the original documents within some stipulated time if not now which would be hectic cause i dont live in karnataka"
    },
    {
      "id": "l55t0b5",
      "body": "bro same, can we speak on dms?"
    },
    {
      "id": "l55t0sy",
      "body": "any idea about character certificate? i only have that as of yet"
    },
    {
      "id": "l55t5m4",
      "body": "um not really, the email doesnt mention that but ig you should carry it"
    },
    {
      "id": "l55tihj",
      "body": "yeah sure"
    },
    {
      "id": "l55x7hk",
      "body": "I mean it's standard procedure everywhere"
    },
    {
      "id": "l55xf76",
      "body": "It's alright. If I remember correctly they do accept digilocker ones. I remember carrying them for my counseling too. Later when they ask for originals, you can submit them when they're available."
    },
    {
      "id": "l55xu7q",
      "body": "thank you! also is carrying a transfer certificate absolutely mandatory?"
    },
    {
      "id": "l55xzeu",
      "body": "I don't remember, my counseling was 6 years ago lol. I wouldn't suggest bringing more documents than necessary. They are usually precise with the documents you need to carry."
    },
    {
      "id": "l55yivq",
      "body": "the email regarding the counseling says to carry it if applicable but my schools out for summer vacay so theres no way i can get mine on time"
    },
    {
      "id": "l55ys7s",
      "body": "It's fine, don't stress it then. Most kids don't have all the originals during counseling. Submit copies of whatever you have for now, and later submit the originals."
    },
    {
      "id": "l56005x",
      "body": "thank you so much!"
    },
    {
      "id": "l5kwhk1",
      "body": "If I plan on rejecting the seat, do I have to bring the DDS and the necessary documents?"
    },
    {
      "id": "l5kwio3",
      "body": "If I plan on rejecting the seat, do I have to bring the DDS and the necessary documents?"
    },
    {
      "id": "l5kxdu3",
      "body": "I think they check for documents before letting you in"
    },
    {
      "id": "l5ky8tb",
      "body": "Thank you, will I be allowed to attend the second round of counseling if I don't attend the first round?"
    },
    {
      "id": "l5kycwd",
      "body": "Yes you can. Although I would not recommend that."
    },
    {
      "id": "l5kzzat",
      "body": "Thank you. Why not?"
    },
    {
      "id": "l5l1d1n",
      "body": "Answered here: [https://www.reddit.com/r/PESU/comments/1cxq14v/comment/l54ifi3/](https://www.reddit.com/r/PESU/comments/1cxq14v/comment/l54ifi3/)\n\nCheck the part about round 2."
    }
  ]
}