{
  "id": "1cy1te7",
  "title": "Senior opinion",
  "content": "I would like to go straight to the point, idk why do guys(seniors/just random asses) comment so negatively abt the college, it really messes up the opinion that someone might have abt this college,I just don't get it that if they are saying honest stuff or just bashing the the college, I am getting my documents ready for my counselling and I also have set my mind to join this college and opt ECE please share your honest opinion (please be honest cuz, it's  not only the matter of 4 yrs in this college but my career and life) is ECE really bad in this college or is there anything else other than that please do mention your opinion and also is getting ECE through PESSAT really WORTH IT your opinion is really valuable, try to ignore the long feed,cuz it's really frustrating about mixed comments about the college and any other branch rather than CSE\n..",
  "metadata": {
    "author": "davan_s_gowda",
    "url": "https://www.reddit.com/r/PESU/comments/1cy1te7/senior_opinion/",
    "permalink": "/r/PESU/comments/1cy1te7/senior_opinion/",
    "score": 0,
    "created_utc": 1716388677,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l56enh5",
      "body": "Did u try other colleges? like through CET, COMEDK or any other?"
    },
    {
      "id": "l56eq9g",
      "body": "!RemindMe"
    },
    {
      "id": "l56ewu2",
      "body": "RemindMe!"
    },
    {
      "id": "l56f1zc",
      "body": "**Defaulted to one day.**\n\nI will be messaging you on [**2024-05-23 14:52:16 UTC**](http://www.wolframalpha.com/input/?i=2024-05-23%2014:52:16%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/PESU/comments/1cy1te7/senior_opinion/l56ewu2/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2FPESU%2Fcomments%2F1cy1te7%2Fsenior_opinion%2Fl56ewu2%2F%5D%0A%0ARemindMe%21%202024-05-23%2014%3A52%3A16%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201cy1te7)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|"
    },
    {
      "id": "l56gqt3",
      "body": ">why do guys(seniors/just random asses) comment so negatively abt the college\n\nLol why do you think people in the college are negative? Placement for non Cs has been pretty much dead this year."
    },
    {
      "id": "l56h75o",
      "body": "Waiting for results"
    },
    {
      "id": "l56jdbq",
      "body": "'It messes up the opinions others have about this college'\nDon't you realise that people form opinions by reading what others have to say? If people are commenting negatively about this college, don't you think that they're making others aware about the negative aspects about this college?"
    },
    {
      "id": "l56mwiu",
      "body": "Ya that's exactly what's my point,it's just that I see less positive and very much negative commenting and I just try to express that might not be the case... I am really open to any comments so please do not hesitate to correct my judgement"
    },
    {
      "id": "l56sa8i",
      "body": "We say things for your concern and most of us are honest about it not that we are gonna gain something by lying. It's just we don't want you to suffer like we did. If there's something wrong it's definitely wrong. We don't say things without any knowledge of it. \n\nOur job is to help you out with doubts and the rest is upto you...."
    },
    {
      "id": "l56uatw",
      "body": "Ya that I expect and that's the reason I ask doubt on this online platform rather than asking couple of seniors but the thing I just confused that people on YouTube rating colleges(Ritik Meghwani,CFAL, Simplified Minds) all rate this college at #3 at least and here guys are just bashing that's why I made up my mind to clear this doubt and I am very open to more of your opinions please do not hesitate to correct my judgement at any time"
    },
    {
      "id": "l56ughz",
      "body": "Would you trust the YouTubers or would you trust the ones studying in this college?"
    },
    {
      "id": "l56uyi9",
      "body": "But the youtubers are not just the regular ones.. that's what messing my mind"
    },
    {
      "id": "l56v0s2",
      "body": "We are no one to decide what you have to choose if you're interested in something just go for it."
    },
    {
      "id": "l56v6yd",
      "body": "most youtubers use clickbait to attract viewers. do not rely on them."
    },
    {
      "id": "l56x51l",
      "body": "ECE is a joke at RR campus, EC campus is better but not by a wide margin. ECE sucks at most of the private Indian institutions with underinvestment in quality faculty, facilities and lack of vision. Try being modest the next time, people who do hate it must have gone through the ordeal, be it teaching, the capstone project or the workload. And yeah, I'm about to graduate this year and I absolutely hate PES."
    },
    {
      "id": "l5a565n",
      "body": "Talking about ECE in PES \n\nA) The Professors are average at best. Most good professor left during peak covid time. The ECE dept in general in RR campus is disoriented\n\nB) Placements of ECE are not good . While this is true in Most engineering colleges , pes is no exception to that . This season only 30% got placed in ECE dept with highest as 24.62 and median 8.5 ( Only 20-22 out of 551 ECE students got T1 placements ). Yes this time market was bad and placements was bad in general but usually it is not better by any significant margin for ece.\n\nC) The Labs and Facilities are average / bad / terrible if you wanna do ECE properly. They just have enough equipments and facilities to conduct small experiments for your coursework . Even to use what is left of those in the labs, you have to go through a tedious process to gain access to use the labs which is just a waste of time ( They just gaslight and catfish you into projects which can be made by even beginners who grasp a decent amount of Hardware , microcontroller and sensors knowledge and they just showcase that.\n\nD) If you are coming through PESSAT then the fees you pay for ECE is not justified or worth it."
    },
    {
      "id": "l5arlhd",
      "body": "The reason why there are so many more negative comments is *because* there is much more negative with PESU than positive.\n\nPESU was genuinely a good college pre Covid. Covid was the perfect excuse for the management to bleed the college dry. \n\nThere's a reason so many professors are leaving. The management is profit over humanity without any exceptions. \n\nThe only thing positive about PESU is the CS department and their ability to adapt the syllabus to current trends."
    }
  ]
}