{
  "id": "1cy3qdj",
  "title": "Is summer course compulsory to take if I didn’t take special topic in 3rd sem ?",
  "content": "Title ",
  "metadata": {
    "author": "Individual_Box_9116",
    "url": "https://www.reddit.com/r/PESU/comments/1cy3qdj/is_summer_course_compulsory_to_take_if_i_didnt/",
    "permalink": "/r/PESU/comments/1cy3qdj/is_summer_course_compulsory_to_take_if_i_didnt/",
    "score": 1,
    "created_utc": 1716393450,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l56xv1h",
      "body": "It's preferable\n\nSo that you don't have to take extra credits in the future"
    },
    {
      "id": "l56zi1t",
      "body": "It’s better cause you can do more productive things in the next summer break and it’s just 1 week so go for it"
    },
    {
      "id": "l571ef2",
      "body": "If I just take the credits provided in each sem and take special topics in 5th and 6th sem will I be able to cover the minimum required credits"
    },
    {
      "id": "l5753nt",
      "body": "You need to take 3 courses total (special topic + summer course) and you can take one in 3rd, 4th and 5th sem but not in 6th."
    },
    {
      "id": "l57ccxz",
      "body": "Last time I took three and they reduced the six credits to four coz yes 🤧"
    },
    {
      "id": "l57czmm",
      "body": "In case i dont the summer course and i didnt take special topic in 3rd sem , will it be fine and easy for me to cover the remaining credits required/"
    },
    {
      "id": "l5a7t69",
      "body": "You can't take 3 courses in summer ?"
    },
    {
      "id": "l5alm2i",
      "body": "It was last year. But recently they said that it will be reduced to four credit and the other two were considered as extra credits.\n\nIg they have a limit of summer course now or something . Not sure about this fact tho."
    },
    {
      "id": "l5cl26g",
      "body": "It’ll be more stressful next year cause you’ll need this summer break for a bit of placement preparation or a good cv building internship.. so try doing something that’s adding to either your cv or credits even in this holiday. If you aren’t doing an internship I would definitely suggest to do atleast one summer course. See I guess you can do 2 but 3 will be a stretch cause idk if Pes will have those many courses stretched out. Generally, it’s like there are different options, but all of it happens during the same Two weeks.but definitely go for summer course cause you didn’t do special topic also try removing burden from next year you’ll get busy with capstone also next summer"
    },
    {
      "id": "l5crwy3",
      "body": "Thx a lot I’ll definitely take the summer course"
    },
    {
      "id": "l5crz3f",
      "body": "Is each course 1 or 2 credits"
    },
    {
      "id": "l5czd7m",
      "body": "I hope you enjoy it! It’s just a week and mostly esa will be a project or super easy trust me with friends it’ll go by very quick!:)"
    },
    {
      "id": "l5czmhk",
      "body": "2 credits"
    }
  ]
}