{
  "id": "1cy4bli",
  "title": "Internship ",
  "content": "Has anyone done a six month internship after 6th semester . If I do not attend capstone reviews will they fail me or what grade will I get ?",
  "metadata": {
    "author": "internship_finder",
    "url": "https://www.reddit.com/r/PESU/comments/1cy4bli/internship/",
    "permalink": "/r/PESU/comments/1cy4bli/internship/",
    "score": 5,
    "created_utc": 1716394858,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l56z8is",
      "body": "You have to attend capstone reviews. you cant miss those. They will cut your grade"
    },
    {
      "id": "l578lio",
      "body": ">Has anyone done a six month internship after 6th semester .\n\nI think all the six month internships are after 6th sem.\n\n>. If I do not attend capstone reviews will they fail me or what grade will I get ?\n\nLol you'll not graduate in that case probably."
    },
    {
      "id": "l57dxac",
      "body": "I think you mean 2 months in summer and continuing in the 7th sem, I know a few people who managed to do their internship in the 7th sem managing capstone reviews, special topics, placement tests and their internship simultaneously. However you will be able to claim credits only for the summer(2 credits) and college won’t support you in your internship during the 7th sem in shifting your capstone reviews if they clash or providing any NOC. However I wouldn’t advise anyone to do it because things can get hectic at some points and you can end up messing everything."
    },
    {
      "id": "l58vpzb",
      "body": "Do 12th boards matter during placements and internships and what are the criteria for top companies, I am asking this because I got 79.6 in 12 boards(For 5 subjects) and around 85%(For top 4 subjects), will this create a problem for me?"
    },
    {
      "id": "l596htf",
      "body": "Shouldn't be a problem for most companies. Only a few of them have a 90% cutoff."
    },
    {
      "id": "l598lvc",
      "body": "Dude relax. Most people don't care about your 10th and 12th marks. And just remove that from your resume , only keep pes grades"
    },
    {
      "id": "l59989p",
      "body": "Im planning to just attend the final esa review I'm fine even with a D or E grade"
    },
    {
      "id": "l599co3",
      "body": "I'm planning to just attend the esa review. I'm fine if I get a D or E grade"
    },
    {
      "id": "l59bdq5",
      "body": "Im planning to only attend the esa review and am fine with a D or E grade"
    },
    {
      "id": "l59yqr4",
      "body": "Isn't it worth 6 credits in 7th sem? You do realise that will cause irreversible damage to your CGPA right?"
    },
    {
      "id": "l5a3pdt",
      "body": "No, you cannot do that bro. You have to come for all reviews. First I suggest you talk to your -  \nFaculty mentor / HoD, internship coordinator of your department, your capstone guide and your capstone team"
    },
    {
      "id": "l5aj338",
      "body": "okay thank you"
    },
    {
      "id": "l5dh26n",
      "body": "Will it create problems for me in fortune companies or high package offering companies?"
    },
    {
      "id": "l5dh4dj",
      "body": "Will it create problems for me in fortune companies or high package offering companies?"
    }
  ]
}