{
  "id": "1cywk1a",
  "title": "Guys help me out",
  "content": "I'm currently in eee branch in pes but got a sgpa of 9.8. Wht are the chances I'll get cse in rr if I score the same in my second sem.\nPlss also give me the idea of how many students drop out every year ( like average data)\n",
  "metadata": {
    "author": "skitzustudys",
    "url": "https://www.reddit.com/r/PESU/comments/1cywk1a/guys_help_me_out/",
    "permalink": "/r/PESU/comments/1cywk1a/guys_help_me_out/",
    "score": 8,
    "created_utc": 1716480574,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l5ep84p",
      "body": "Quite a good chance!"
    },
    {
      "id": "l5g55rn",
      "body": "Only chance?🥲"
    },
    {
      "id": "l5gc3qf",
      "body": "But it's a good one!"
    },
    {
      "id": "l5gd99w",
      "body": "You may never know some legend might enter the competition with 9.99 / 10 gpa... can't trust PESsants"
    },
    {
      "id": "l5gfjmv",
      "body": "Uski mkc😔😔"
    },
    {
      "id": "l5ggp5w",
      "body": "RR CS is hard, but EC campus CS is possible. Ppl in my batch had 10 cgpa and still didn't get RR CS. U gotta understand that there won't be many vacancies in RR CS seats and everyone from every other branch and campus will want those seats. So even if u get 10 in both sems, you still aren't guaranteed to get CS in RR. Ec campus CS isn't too bad either. See if you want that, you have a better chance of getting that than RR"
    },
    {
      "id": "l5gva9l",
      "body": "Wht about aiml at rr??"
    },
    {
      "id": "l5gxv3t",
      "body": "If u keep it above 9.6 u have a great chance. U will get ec campus cse by a landslide like even if u drop to 8 sgpa in 2nd sem"
    },
    {
      "id": "l5h61fb",
      "body": "Not sure mate. My batch didn't have aiml. It got introduced this year or last year I think. It's a very new course so I have no idea what the amount of seats and stuff is. Expect it to be very similar to cs tho. RR is a bit harder to change to in general because ppl from all branches like ece, eee, mech and biotech will make it their first priority. Apply for the branch change thing. There'll be a meeting with vc and all and they'll call our names one by one based on cgpa. They can choose whatever they want from the list of available vacant seats(kinda like pessat counseling actually). I'd suggest you keep your focus on cs or aiml and take whatever you get. PES isn't that worth it if you're not in CS imo. But it's your choice in the end. Choose whatever's best for you. Good luck :)"
    },
    {
      "id": "l5hkc9k",
      "body": "Oh did u also change your branch?"
    },
    {
      "id": "l5hl1hz",
      "body": "No but I saw my friends change it"
    },
    {
      "id": "l5hl6ou",
      "body": "Oh wht cgpa did they get"
    },
    {
      "id": "l5hmefl",
      "body": "I had more of my friends get into ec cse whose cutoff was just some 7.67.7.7 cgpa . One of my friends had 9.6 and he couldn't get into rr cse as cutoff was 9.64"
    },
    {
      "id": "l5hnbio",
      "body": "Oh y didn't he take aiml thn"
    },
    {
      "id": "l5hno91",
      "body": "Ec cse>rr aiml"
    },
    {
      "id": "l5hnt2y",
      "body": "Ohhh"
    },
    {
      "id": "l5l56ah",
      "body": "Get 10 next time"
    },
    {
      "id": "l5ljv3k",
      "body": "Tf🥰"
    }
  ]
}