{
  "id": "1czgaze",
  "title": "How is AIML specialisation in PES RR Campus",
  "content": "Is it worth it? Or is cse core the better option",
  "metadata": {
    "author": "Ok_Mark_3145",
    "url": "https://www.reddit.com/r/PESU/comments/1czgaze/how_is_aiml_specialisation_in_pes_rr_campus/",
    "permalink": "/r/PESU/comments/1czgaze/how_is_aiml_specialisation_in_pes_rr_campus/",
    "score": 6,
    "created_utc": 1716541009,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l5g38sf",
      "body": "Check the FAQs for why core CS is better: https://bit.ly/pesu-faq\n\nSummary: these seats are new, untested, and only introduced to increase intake for more money. It's not good to pigeonhole yourself in undergrad, which is for fundamental knowledge building and not specialising. If you pick core CS, you get the option to explore different fields and specialise in one of your choices (AIML too), while in AIML that choice is made *for* you, even before you realise what AIML is all about (ML is a math field and the specialisation is 85% or more, just math). There are also almost no AIML jobs for undergrads, most *actual* ML jobs require a MS degree at the minimum. The only ML jobs you see for undergrads are glorified SWE jobs that treat ML as a blackbox, and for these, you don't need an ML degree but rather really good CS concepts and SWE skills, which a CS degree does cover."
    },
    {
      "id": "l5g3gop",
      "body": "AIML is mostly Math, so take it only if you like Math.\nCore CSE gives you all lot of other options to explore like cybersecurity, web dev, IOT."
    },
    {
      "id": "l5g5299",
      "body": "Ohh but I'm not that good at math, and my parents have kept AIML as my first preference ahead of cse core for the first round of councelling, is there any way I can change it during the councelling?"
    },
    {
      "id": "l5g7mns",
      "body": "The preference you set is irrelevant, it's only for analytics. The actual branch you choose during counseling is your branch."
    }
  ]
}