{
  "id": "1cznsoe",
  "title": "Aiml vs ece at pes",
  "content": "Which branch is better and why? Just getting some info before counseling tomorrow ( I messed up mains and kcet pes is my only hope rn)",
  "metadata": {
    "author": "Green_Risk3731",
    "url": "https://www.reddit.com/r/PESU/comments/1cznsoe/aiml_vs_ece_at_pes/",
    "permalink": "/r/PESU/comments/1cznsoe/aiml_vs_ece_at_pes/",
    "score": 2,
    "created_utc": 1716565409,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l5hi1ct",
      "body": "You can't compare across branches. Choose the branch which interests you. The \"better\" branch is always the one you are passionate about."
    },
    {
      "id": "l5hjftq",
      "body": "Although I have researched both branches, I want the advice of seniors so that I don't end up regretting my decision later on... I don't really know what I'm interested in without actually studying it... Both seem appealing in different ways, I just want to know the opinions of people with more experience and based on that I'll have a clearer idea when it's time to make the decision:)"
    },
    {
      "id": "l5hkamh",
      "body": "Go through the syllabus of each branch, read through the topics, and see which ones you seem to be more interested in. You can find the syllabus in the FAQS (https://bit.ly/pesu-faq). \n\nThere is also a discussion about the AIML branch in the FAQs if you would like info about it.\n\nI wouldn't recommend choosing any branch (especially ECE) without knowing what you are in for."
    },
    {
      "id": "l5hl76v",
      "body": "I was getting ece via cet and cs via pessat. Went ahead with cs pessat even though the fees was much higher, had 0 interest in electronics and haven’t regretted since. Point is pick the one you like but interms of level of difficulty and placements, cse and related branches are up there. You don’t need to think twice. Plus more than half the ece kids look for cs jobs lol"
    },
    {
      "id": "l5hm8w5",
      "body": "If you are completely thinking about your future placements then go for AIML coz placements for ECE is really bad and almost ECE PPL are also getting CS jobs so ..."
    },
    {
      "id": "l5hmkzv",
      "body": "ECE in most of the Indian private institutions is a waste of time"
    },
    {
      "id": "l5hn795",
      "body": ">more than half the ece kids look for cs jobs lol\n\nThat's because the ECE branch in all colleges is mostly filled with kids who are passionate about CS and did not get CS :("
    },
    {
      "id": "l5hq0ql",
      "body": "Aiml without a doubt if u don't have any special interest for ece"
    },
    {
      "id": "l5i903g",
      "body": "Run the other way, no need to go to PES"
    }
  ]
}