{
  "id": "1d06c49",
  "title": "Remaining seats left after round 1 counselling",
  "content": "",
  "metadata": {
    "author": "Unique_Hamster2734",
    "url": "https://i.redd.it/h76uk0i9vi2d1.jpeg",
    "permalink": "/r/PESU/comments/1d06c49/remaining_seats_left_after_round_1_counselling/",
    "score": 44,
    "created_utc": 1716620897,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l5l0mcg",
      "body": "Although aiml had more like 90 seats left after round 1"
    },
    {
      "id": "l5l1e35",
      "body": "crazy how people would still take admission in a college with 4 confirmed sucides in the span of a year almost like a lamb to the slaughterhouse."
    },
    {
      "id": "l5l1oja",
      "body": "My pessat counselling is in 3rd batch do u think any case seat in ec campus will be left by then"
    },
    {
      "id": "l5l1v66",
      "body": "Dude suicides happen all the time it just depends on mental strength and ability to face setbacks"
    },
    {
      "id": "l5l259j",
      "body": "ec campus, aiml, closin rank 0? what does that mean"
    },
    {
      "id": "l5l29l0",
      "body": "it says last rank is 0. which means no one has chosen AIML in EC yet"
    },
    {
      "id": "l5l2co2",
      "body": "Yo keep giving us updates pls"
    },
    {
      "id": "l5l2f0n",
      "body": "ohh ok, thanks.   \nit says closing rank on the pes site so i was wonderin.."
    },
    {
      "id": "l5l2fmw",
      "body": "I’ll try my best to"
    },
    {
      "id": "l5l2qzh",
      "body": "Is the attendance normal or less ppl due to advanced"
    },
    {
      "id": "l5l2u6e",
      "body": "It’s less man like I got rank 134x but still got cse ai mL. But people are still showing up and they allowed students to come just to take fingerprint and head home to read for advanced and the parents can finish up the rest of the stuff"
    },
    {
      "id": "l5l2zyg",
      "body": "Morning session of 1500 invited about 700 showed up and maybe 10 were deferred as well"
    },
    {
      "id": "l5l49sm",
      "body": "iit/nit: lemme introduce myself -"
    },
    {
      "id": "l5l560r",
      "body": "Sour grapes man. Stop the fear-mongering, incidents happen everywhere and involve a lot of factors. What happened here can very well happen tomorrow (and does happen) at other colleges. PES has its flaws but it has consistently been one of the best options here in the city and state."
    },
    {
      "id": "l5l5e4c",
      "body": "na not likely by third round last time only mechanical and bt seats were left"
    },
    {
      "id": "l5l6j22",
      "body": "Oh no 😭, if less ppl show up I can expect a seat (further round)"
    },
    {
      "id": "l5l6zs3",
      "body": "Yeah, just because someone suicided, everyone should stay away and look for a suicide free college with shit reputation and 1 lakh cutoff"
    },
    {
      "id": "l5l708r",
      "body": "Whats the update now?"
    },
    {
      "id": "l5l71hx",
      "body": "Ai mL done Ece rr almost done but I just left the college"
    },
    {
      "id": "l5l7o5q",
      "body": "Preach man"
    },
    {
      "id": "l5l8asq",
      "body": "Will they not let you register if you don't have the dds now? Will they just not let you choose now?"
    },
    {
      "id": "l5l8d7i",
      "body": "They asked for them multiple times and he’s asked to show dd for registration but I also remember some uncle having some authorized letter or something but I wouldn’t risk it"
    },
    {
      "id": "l5l8h9e",
      "body": "Wait so should I not go at all? Can we give a check instead now and on Monday can I get the dds?"
    },
    {
      "id": "l5l8jqp",
      "body": "Idk man but I’d say you’d get rejected but just call the admission number and ask them"
    },
    {
      "id": "l5lbhuq",
      "body": "At what rank did aiml close"
    },
    {
      "id": "l5lbiq2",
      "body": "Updates?"
    },
    {
      "id": "l5lbjnm",
      "body": "I left man I’m sorry"
    },
    {
      "id": "l5lbmkf",
      "body": "Cs rr closed at 1050"
    },
    {
      "id": "l5lboe7",
      "body": "Yup and ai ml closed around 17 something if I’m not mistaken"
    },
    {
      "id": "l5lcnjd",
      "body": "As a senior, I'm appalled to see that 36 seats have been allowed for EE and ME."
    },
    {
      "id": "l5lda4q",
      "body": "Just closing ranks?"
    },
    {
      "id": "l5lebia",
      "body": "i was shitting myself😭😭 but yeah got in cse"
    },
    {
      "id": "l5lfv56",
      "body": "1735"
    },
    {
      "id": "l5llg8p",
      "body": "Can someone update me on the  seats remaining for day2 of counselling"
    },
    {
      "id": "l5lo5l9",
      "body": "Hey, if someone didn't apply for first round can they go for the second round?"
    },
    {
      "id": "l5ly82g",
      "body": "Can, you please tell me the cutoff for pes cs and elec branches with jm scores ???"
    },
    {
      "id": "l5lzqgm",
      "body": "Dude u could wait for few minutes more then my photo would be there in the screen 😅😅"
    },
    {
      "id": "l5lzu7y",
      "body": "Even if had waited little more I would’ve been on screen lol 😜 what was your rank?"
    },
    {
      "id": "l5m00uj",
      "body": "Ohh 😂\nMy rank is 1387 wbu"
    },
    {
      "id": "l5m02ik",
      "body": "1384 you came just after me I think"
    },
    {
      "id": "l5m2idd",
      "body": "Mofos took 1200 from me for admission through jee main score and didn't even tell me they had counselling today"
    },
    {
      "id": "l5mbj2c",
      "body": "Ohh😂"
    },
    {
      "id": "l5mqrmj",
      "body": "Any placement data shared during presentation."
    },
    {
      "id": "l5n9zip",
      "body": "I got 20X rank and kept this as a backup when is their next counselling"
    },
    {
      "id": "l5pcazu",
      "body": "Ay what happened to biotech and mechanical"
    },
    {
      "id": "l5pccxh",
      "body": "Bro biotech is not even there💀"
    },
    {
      "id": "l6mzmz7",
      "body": "What happened bro?"
    }
  ]
}