{
  "id": "1d0682n",
  "title": "Scholarship in pes",
  "content": "Hello Seniors so I got cse in rr campus today in counselling. Can you please tell how difficult is it to be in top 20 percent to get scholarship. I am a bit hesistant about the high fees since I can get cs in comedk colleges except rv at lower fees.",
  "metadata": {
    "author": "no_potential17",
    "url": "https://www.reddit.com/r/PESU/comments/1d0682n/scholarship_in_pes/",
    "permalink": "/r/PESU/comments/1d0682n/scholarship_in_pes/",
    "score": 4,
    "created_utc": 1716620443,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l5l1ake",
      "body": "Not too difficult, but largely depends on how your batch is. Back in my time, a top 20% meant you needed to score above 8.8 GPA per semester. That number is probably around the same or higher now. Getting that GPA does require some effort and consistency, it won't be straightforward.\n\nOn an unrelated note, if you can get CS at BMSCE via ComedK, it might be worth it. PES is not worth the PESSAT fees here. Best to compare across objective parameters and figure out for what exactly you are okay with paying so much more at PES."
    },
    {
      "id": "l5l28q0",
      "body": "Thank you so much. I will consider all these factors and decide"
    },
    {
      "id": "l5l6weh",
      "body": "if youre getting CS at BMSCE or MSRIT for the comedk fees id much rather recommend you to opt for that instead of going through pessat"
    },
    {
      "id": "l5le4kp",
      "body": "Well, the cutoff for first Sem Phy cycle was 8.5 and chem cycle was 8.59 in RR Campus"
    },
    {
      "id": "l5lzcil",
      "body": "Also the bald dude was like he doesnt honour comedk and stuff then will you get refund?"
    },
    {
      "id": "l5mxyj9",
      "body": "Oh yeahh he did say that! But I think op can surrender the seat before June 5th and it'll be fine"
    },
    {
      "id": "l5mz7xc",
      "body": "People keep saying that PES is not worth PESSAT fee? So if i am getting MIT manipal should i leave PES? aren't placement opportunities a bit better at PES? (these two are my only options)"
    },
    {
      "id": "l5n39oi",
      "body": "A college is not only its placement opportunities (which last time I checked, has negligible difference with Manipal) but much more. This includes other factors like infrastructure, faculty, management, research opportunities and labs, different ways to build your profile, and ofc, the reputation. At the end of your 4 years, you are not paying just for the sake of getting a job, but actually learning during your undergrad, picking up industry relevant skills and building a strong profile to stand out. Right now, PES can definitely provide you the former, but the latter two are much better at other colleges. Manipal also brings with it a more relaxed college life, better campus and an overall more pleasant college experience, unlike PES which is very much like an advanced schooling.\n\nIf all you care about is getting a good paying job and want to be in Bangalore, then sure, pick PES. But Manipal can offer you the same (or at least, equivalent) placements with an overall much better college experience."
    },
    {
      "id": "l6n0428",
      "body": "Can you tell on what basis is the phy and chem cycle decided? I have got CSE AIML at EC Campus through PESSAT, which cycle will I be in the 1st sem? Also, what things from class 11 and 12 PCM should I know during 1st year?"
    },
    {
      "id": "l6nb9yh",
      "body": "Usually you'll be grouped according to alphabetical order in the first year, so in one class there will be people from cs ece and aiml together for the first year. From second year you'll be separated according to your chosen major. Those whose names start with A ~ P usually do chem cycle in first sem and physics cycle in the second sem."
    },
    {
      "id": "l6nha1b",
      "body": "Thanks for the reply. Btw, I feel like I haven't really done 11th, 12th PCM that well, can you suggest what things I should know for 1st year."
    },
    {
      "id": "l6nkfrx",
      "body": "Neither did I, just chill out... You'll figure things out. For now take some rest and enjoy the summer vacation you have got."
    },
    {
      "id": "l6nlbak",
      "body": "Thanks."
    }
  ]
}