{
  "id": "1d0a4k9",
  "title": "PESU COUNSELLING 2024 latest updates",
  "content": "",
  "metadata": {
    "author": "Financial_Mushroom86",
    "url": "https://i.redd.it/c03sayan7k2d1.png",
    "permalink": "/r/PESU/comments/1d0a4k9/pesu_counselling_2024_latest_updates/",
    "score": 16,
    "created_utc": 1716637181,
    "flair": "ANNOUNCEMENT :snoo:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l5ls14u",
      "body": "any update?"
    },
    {
      "id": "l5lswyb",
      "body": "This is after the 2nd session??"
    },
    {
      "id": "l5lu5iz",
      "body": "oh so this are last available seats for tomorrow's councelling"
    },
    {
      "id": "l5lud4d",
      "body": "Yeah most likely"
    },
    {
      "id": "l5lxyrw",
      "body": "3rd session"
    },
    {
      "id": "l5mezsf",
      "body": "All gone except mech main campus"
    },
    {
      "id": "l5ml3zv",
      "body": "how is this even possible, who took biotech wtf?"
    },
    {
      "id": "l5mlfhy",
      "body": "Dear B.Tech Candidate,\nThe B.Tech branches with the available number of PESSAT seats for tomorrow (26th May – Sunday) are as listed below.\nPlease note, only those candidates who are interested in opting for the seats from the branches with the available seats as listed below can come for the counseling process tomorrow. Others need not come for the counseling process.\n• Ring Road Campus\no Computer Science Engineering - 0\no Computer Science Engineering (AIML) - 0\no Electronics & Communication Engineering - 0\no Electrical & Electronics Engineering - 0\no Biotechnology - 0\no Mechanical Engineering - 22\n• Electronic City Campus\no Computer Science Engineering - 0\no Computer Science Engineering (AIML) - 0\no Electronics & Communication Engineering - 0\nMail from PES"
    },
    {
      "id": "l5mlk5b",
      "body": "no point in going tomorrow then, can't believe bt is also gone smh"
    },
    {
      "id": "l5mlsia",
      "body": "Literally what I'm thinking rn, I'm gonna kms or smth pes was my last option.\nSo fucking done with the engineering crowd it's an unnecessary fuckall"
    },
    {
      "id": "l5mm1u9",
      "body": "nah like wtf what about people after 5k??"
    },
    {
      "id": "l5mm8qx",
      "body": "exactly. "
    },
    {
      "id": "l5mndxl",
      "body": "bhai wtf is this from session 1...couldn't attend counselling due to upcoming exam.....what will happen now?"
    },
    {
      "id": "l5mres5",
      "body": "People who are interested in biotech? It is the only branch where the people are in it out of pure interest, which is honestly very respectable."
    },
    {
      "id": "l5mrhw8",
      "body": "Seems like there have been way more applicants than usual this time. Usually, 6-6.5k is the cutoff"
    },
    {
      "id": "l5mrkm6",
      "body": "Mostly, no branch. Number of seats in round 2 is usually a handful in all branches."
    },
    {
      "id": "l5mrter",
      "body": "but the counselling date is clashing with bitsat and advance......how am i supposed to reach there"
    },
    {
      "id": "l5ms9i6",
      "body": "Unfortunately you should have known by now that PESU prioritises PESSAT over other exams. If they can start sessions in previous years without caring about CET kids' admissions, you really think they care about BITSAT and Advanced, where they know people serious about these exams will not choose PES?"
    },
    {
      "id": "l5n0eu7",
      "body": "Okay didn't know about that.....just wanted a decent backup option that's why was looking forward to get cs in counselling"
    },
    {
      "id": "l5n0pze",
      "body": "I am interested in biotech frankly but if it's gone I see no point in going tomorrow. Pes had a rlly good location and decent faculty for bt too was genuinely excited and came in just for this from north.\nFrankly speaking disappointed in myself more than the insti "
    },
    {
      "id": "l5n0spm",
      "body": "I guess. My rank is 6.1 so let's see ig"
    },
    {
      "id": "l5n21kn",
      "body": "Maybe try for round 2, although there isn't much hope to be honest."
    },
    {
      "id": "l5n26wq",
      "body": "That's what I'm going to do ig\nIdk man it's just depressing atp thinking of dropping an yr "
    },
    {
      "id": "l5n3wk2",
      "body": "Damn 3k rankers getting ece in ec? It was all wiped out by then in my batch, I assume they increased the seats significantly"
    }
  ]
}