{
  "id": "1d0b5pq",
  "title": "EC campus hostel and other facilities ",
  "content": "I got cse in EC campus, can anyone explain how things are in EC campus hostel for first year?? And other facilities in the campus too like library, badminton/basketball etc courts or like football ground/turf anything???",
  "metadata": {
    "author": "chIck-fil-A69_",
    "url": "https://www.reddit.com/r/PESU/comments/1d0b5pq/ec_campus_hostel_and_other_facilities/",
    "permalink": "/r/PESU/comments/1d0b5pq/ec_campus_hostel_and_other_facilities/",
    "score": 3,
    "created_utc": 1716640832,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l5mbl41",
      "body": "For the first year, your hostel won't be in the main campus, it would be 6kms away in the Aamatra Academy hostel. If you're a male you gotta be there for your first year or you can take a PG. For girls, they're supposed to stay all 4 years in the Aamatra Academy hostel.\nBus service is provided. You gotta wake up by around 6 30 in the morning, the bus leaves by around 7am. There's a small ground with a track in the hostel which can be used for some sports facilities.  Small goal posts are there for football. The gym is pretty small inside the room and the equipment is decent. But the gym in  the campus is top notch and a lot of sports facilities are there in the campus. Am abt to join pesu ec campus too this year. I went and checked the hostel facilities. The warden for the boys hostel seems pretty nice. He was like I'll snatch your phone if you use it while eating your food. And that he makes everybody go to sleep by around 10.. Idk if that's what really happens but we'll see. I'm gonna be freshie this year too so idk much abt what really happens but this is what I saw when I went there..looking forward to see you!!"
    },
    {
      "id": "l5micuu",
      "body": "Lol he won't force u to sleep. Just that u can't make a lot of noise. Don't piss him off or he would scream like a madman"
    },
    {
      "id": "l5pqe19",
      "body": "Thanks alot bro, one more question tho. The guy who was talking about the hostel after the admission processes were done said that rooms have already started to fill up. Was he saying the truth or was it simple marketing strat for us to go and pay the money as quickly as possible???"
    },
    {
      "id": "l5pu8nx",
      "body": "The warden told me that there are enough rooms and that they will be available even in June so you can easily come by then.. you'll get in easily."
    }
  ]
}