{
  "id": "1d0ulun",
  "title": "what are cutoffs for 2nd round Counselling in all the branches pls let me know my rank is 57XX what ",
  "content": "",
  "metadata": {
    "author": "Ok-Fruit3871",
    "url": "https://www.reddit.com/r/PESU/comments/1d0ulun/what_are_cutoffs_for_2nd_round_counselling_in_all/",
    "permalink": "/r/PESU/comments/1d0ulun/what_are_cutoffs_for_2nd_round_counselling_in_all/",
    "score": 3,
    "created_utc": 1716702076,
    "flair": "PESSAT/Admission",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l5ploup",
      "body": "Don't keep hope on 2nd round man, only surrended seats will be available. Last year cutoff decreased also"
    },
    {
      "id": "l5pmx32",
      "body": "If your rank is higher than the round 1 closing ranks, then it is almost impossible to get a seat in round 2. Although seats are surrendered before the second round, do not expect more than 20 (being extremely generous here, since last year it was <10) per branch. The aspirants that show up to the second round also include the kids with ranks lower than round 1 closing ranks who are directly appearing for round 2. So for example if CS closed at 1100 in round 1, expect students with ranks <1100 to also show up for round 2. Given this, it's always safe to assume that if you don't get a seat during round 1, it's unlikely you will get one in round 2."
    },
    {
      "id": "l5pvfib",
      "body": "the counselling was closed just before my rank was announced so do u think there is a chance?"
    },
    {
      "id": "l5pvibp",
      "body": "all i can do is hope for the best\n\ncause i messed up my comedK too"
    },
    {
      "id": "l5pyaj8",
      "body": "Which branch? If it's CS or AIML then mostly no"
    },
    {
      "id": "l5q5rr9",
      "body": "EEE or mechanical is what i am expecting"
    },
    {
      "id": "l5q6b86",
      "body": "How many seats are there for jee mains candidate and what will expected percentile?"
    }
  ]
}