{
  "id": "1d2f20w",
  "title": "summer courses and special topics",
  "content": "i just finished second year, so if i take up extra credits through summer courses now, can i skip special topics in the third and fourth years? i've asked teachers but nobody seems to have a proper answer to this. can some senior please help",
  "metadata": {
    "author": "shiurts",
    "url": "https://www.reddit.com/r/PESU/comments/1d2f20w/summer_courses_and_special_topics/",
    "permalink": "/r/PESU/comments/1d2f20w/summer_courses_and_special_topics/",
    "score": 2,
    "created_utc": 1716887214,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l60741u",
      "body": "Summer courses are taken up to ease credit requirements in the final year usually, because final year has a much lesser credit requirement per semester. This allows you to take up lesser number of special topics in the final year. Summer courses usually cannot be swapped with any other year. \n\nEvery semester has a minimum credit requirement set by your department. If your department needs 20 (example number) credits in sem 5, you *must* take up 20 credits in sem 5. However, this minimum credit requirement is very low for final year, that's when these summer courses come in handy. If you take up 2 courses now, you'll *probably* only need 1 course in final year."
    },
    {
      "id": "l60bdb4",
      "body": "ahh okay \nspecific to the cse dept, i haven't taken up my special topic for one semester in second year. would you recommend i do one or two summer courses? (definitely doing one at least to make up for the missed course) if i do two now, would my workload possibly grow a little lesser in my final year, hopefully helping in placement prep?"
    },
    {
      "id": "l60mwx4",
      "body": "I'd recommend doing 2 courses, since you are already running short by 2 credits."
    },
    {
      "id": "l60ut8f",
      "body": "okayy thanks a ton!! there's nobody to give proper information so this was super helpful :)"
    },
    {
      "id": "l60xhc4",
      "body": "Understandable. Its weird PES does not document everything."
    },
    {
      "id": "l61lrxv",
      "body": "yeahh i figured they would at least have it mentioned in the syllabus but there's nothing, so your reply was super helpful, thanks a lot!"
    },
    {
      "id": "l61mvgd",
      "body": "Anytime :)\n\nThe general rule is that there is no semester where you *cannot* take up 0 credits, and that's why there is no concept of early graduation at PES. So the workaround to reducing workload is to take up the minimum number of courses in final year by covering up the remaining earlier. \n\nIf you're entering third year, you can find out this number by finding out how many coursework + capstone credits (10 if I remember) you have in third and final year. These are usually fixed, so it's easy to find out. Then find out how many credits you need to meet the 160 credit requirement for your degree. The remaining number of credits is what needs to be met via internship and/or special topics. \n\nLet me know if you need any other help."
    },
    {
      "id": "l61u4u2",
      "body": "ah i see... i have access to last years course structure so i think i should be able to figure out the credits breakdown from there\n\n\nthanks a bunch!!"
    }
  ]
}