{
  "id": "1d2idj6",
  "title": "BMS CSE(comedk) or PESU CSE(pessat)",
  "content": "I am mainly interested in PLACEMENTS. Fests and events dont really matter much to me, is it better to save 12 lakhs (approx) by joining BMS than PES?. Is BMS really that chill as they say online? Does 1000+ CSE students in PES really affect the placements as compared to 300ish in BMS?",
  "metadata": {
    "author": "tejboss_4493",
    "url": "https://www.reddit.com/r/PESU/comments/1d2idj6/bms_csecomedk_or_pesu_csepessat/",
    "permalink": "/r/PESU/comments/1d2idj6/bms_csecomedk_or_pesu_csepessat/",
    "score": 4,
    "created_utc": 1716899649,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l60sim8",
      "body": "choose the cheaper option - bms comedk. also this is the main campus right? not bmsit"
    },
    {
      "id": "l60uvqw",
      "body": "yes, i am talking abt main campus(basvangudi) .... how are the placements comparatively?"
    },
    {
      "id": "l618xlg",
      "body": "Choose Bmsce cse, since intake pesu cse >>>> Bmsce cse"
    },
    {
      "id": "l619rmy",
      "body": "please elaborate"
    },
    {
      "id": "l61b7ax",
      "body": "Intake of pesu cse and allied more than 4 times of Bmsce cse and allied. Most of the companies (95%) visiting pesu, will visit Bmsce also. You will compete with less than 500 students compared to 2000 during placement process, Getting top placement will be easier. This is my personal opinion."
    },
    {
      "id": "l622ck5",
      "body": "Check 2024 placement record for BMS. Your 👁 will open"
    },
    {
      "id": "l64joqv",
      "body": "bms share toh karta nhi hai aur naa hi pes. median ke hisaab se bms is better. plus op will save a heck a lot of money choosing bms."
    },
    {
      "id": "l677i6x",
      "body": "Well one thing is that the placements in both the colleges is good it basically depends on how well you take the opportunities,pes gives a lot of pressure to it's students, it's like internal every 3 weeks and bms comparatively is very chill ,the crowd in pes is half of North and South Indians it's like a melting pot ,in bms a lot of people come from management since it cheaper than pes and rv and the ones who got in through cet are the locals and comedk is all over india ,the exposure is good and you could just take a role in organisation roles and would actually help you in your life , it's easier to take those roles in bms compared to pes since there isn't a lot of pressure and have a lot of time to yourself , which you actually really need in your college life ,you could use the time to learn various skills and upskill yourself or you could just waste it ,in pes a lot of things are spoon fed so it's better to join there if you usually are not very productive without pressure.Pes campus is big and bms campus is small , the facilities are better in pes but bms does not fall behind it's just that it is smaller."
    },
    {
      "id": "l8fpy7i",
      "body": "BMS intake for CS and CS family courses increased and looks like 1500+ now"
    },
    {
      "id": "l8fsujm",
      "body": "oh is it? can you please provide seat matrix?"
    },
    {
      "id": "llc3o1l",
      "body": "In bms too internals are every 3 weeks"
    }
  ]
}