{
  "id": "1d2in9u",
  "title": "What should i do to prep myself for cse aiml during the break?",
  "content": "Wanna know what i should learn, what books i should study and things i should do to prepare myself for cse aiml. Also waould like to know what courses or certificates i should get to help me do a post grad abroad. Thanks in advance!",
  "metadata": {
    "author": "Somewhere-Livid",
    "url": "https://www.reddit.com/r/PESU/comments/1d2in9u/what_should_i_do_to_prep_myself_for_cse_aiml/",
    "permalink": "/r/PESU/comments/1d2in9u/what_should_i_do_to_prep_myself_for_cse_aiml/",
    "score": 10,
    "created_utc": 1716900497,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l60s9bi",
      "body": "I would recommend just enjoying your last summer vacation - after this you will be busy every summer. If you really want to do something, check out MIT's Missing Semester and Harvard CS50. Also its too soon to even think about a Masters now, so its best to focus on undergrad. Things like how to prepare and what are needed are very subjective and depend on your plans and field of interest, which you probably have no idea about until you get to at least second year."
    },
    {
      "id": "l6134l9",
      "body": "I second Rowley Anna, take a break kiddo. You need and deserve it."
    },
    {
      "id": "l61iah0",
      "body": "We're from the same batch, you don't (and neither does anyone else) have to call me Anna lmao"
    },
    {
      "id": "l61mchv",
      "body": "Lol xD"
    },
    {
      "id": "l64c19k",
      "body": "Bruh people down voted you"
    },
    {
      "id": "l64g875",
      "body": "I've been getting that a lot lately :("
    },
    {
      "id": "l655wr3",
      "body": "Rowley anna 🔥🔥"
    },
    {
      "id": "l65e5m1",
      "body": "![gif](giphy|lbidtjzpO9l15mtx2R|downsized)"
    },
    {
      "id": "l665h88",
      "body": "ive spent the last few days doom scrolling absolute brain rot on insta even after binging on some popular shows, reading some books and even playing cricket everyday and i realized, damn, i could be doing something useful during that time.\n\nare there any programming languages that i could learn or some topics/subjects that i could do so that i could atleast do something \"useful\""
    },
    {
      "id": "l66c20j",
      "body": "They teach Python in sem 1 and C in sem 2. You could start with Python if you are interested. Although, I would recommend first picking up the Missing Semester course before learning a language."
    },
    {
      "id": "l66gqyu",
      "body": "Thanks very much"
    },
    {
      "id": "l67avsz",
      "body": "sorry but what do you mean by Missing Semester course?"
    },
    {
      "id": "l67bhej",
      "body": "I referred to it in my original comment - MIT Missing Semester course. Google it, pretty easy to find."
    },
    {
      "id": "l67cg8s",
      "body": "found it, thanks"
    },
    {
      "id": "l67di6s",
      "body": "well wanted to ask another thing regarding this, so I know python upto a basic level so should I just continue with it or start with C because if I learn a harder language first then I can learn others easily too..."
    },
    {
      "id": "l6ai6x3",
      "body": "learn mern stack, java spring boot ,CI/CD ,DOCKER\nDSA , VERSION CONTROL"
    },
    {
      "id": "l6amavm",
      "body": "k thanks!"
    },
    {
      "id": "l6bljmx",
      "body": "Sry nother thing, ive already studied comp in isc and icse and know surface level python, js and css. Do i need to do the missing sem thing cuz i couldnt find a proper link for it"
    },
    {
      "id": "l6ha6jf",
      "body": "You will have ai mL as a subject in college anyway worry about it then I'd say just sharpen up the skills you gained now and build some projects around it to show you have potential \n\nAND ALSO TAKE A FKN BREAK BRO IT AINT THAT DEEP\nSleeping till 12pm one day won't hurt your degree"
    },
    {
      "id": "l6i435x",
      "body": "1pm everyday 😎\nBut also, do cse and cse aiml students have classes together or separate? My friend got cse and i got aiml."
    },
    {
      "id": "l6i7gvq",
      "body": "im not sure about that cuz it got introduced recently itself \nif I had to guess they'll have it along with other cse folks cuz pes who took aiML as a special topic/elective"
    },
    {
      "id": "l6krlzk",
      "body": "there is a chance that cse and aiml people are together in the first year , but second year onwards its completely separate"
    }
  ]
}