{
  "id": "1d2qk14",
  "title": "How is placement in PES University for MCA?",
  "content": "Title",
  "metadata": {
    "author": "Available-Mind-8480",
    "url": "https://www.reddit.com/r/PESU/comments/1d2qk14/how_is_placement_in_pes_university_for_mca/",
    "permalink": "/r/PESU/comments/1d2qk14/how_is_placement_in_pes_university_for_mca/",
    "score": 3,
    "created_utc": 1716920880,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l62iiwa",
      "body": "Same, anyone can shed some light?"
    },
    {
      "id": "l63090i",
      "body": "cfbr"
    },
    {
      "id": "l69khd3",
      "body": "Here as well please"
    },
    {
      "id": "l6nu7qx",
      "body": "I'm in CSE so Idk much, but I met this guy printing his admit card for ESA and he was from MCA, he told only 4 people from his entire batch got placed."
    },
    {
      "id": "l8yz8pa",
      "body": "And what's the strength of MCA there?"
    },
    {
      "id": "l8yzcnk",
      "body": "What's strength of MCA there?"
    },
    {
      "id": "lh4vn93",
      "body": "I'm currently pursuing mca at pes, placements are going good this time we are in second sem already placements started for us and 15-20 students are already placed in different companies with more than six lakh package, our strength this time is 340"
    },
    {
      "id": "ls6glm1",
      "body": "Bro is it worth joining pes.\nAnd please tell about placement.  How placement for mca going on. Is there any betterment compared to last year."
    },
    {
      "id": "ls6hjmx",
      "body": "Yeah bro placements are better compared to last year, even this year mca student grabbed highest package in history of pes mca 14 lpa and college convincing almost all companies to include mca students with B Tech for Placements, But MCA Students are not Placed Much compared to B Tech  Students only because of skill and probelm solving issue, If U Have Skilla and Problem solving ability Pes is Best for MCA only downgrade is Campus is Crowded and Hectic Schedule, No other Activities for MCA students other than study"
    },
    {
      "id": "ls6j8rw",
      "body": "What's the usual class timing for MCA students."
    },
    {
      "id": "ls6jcak",
      "body": "Hey what's the usual class timing at PES for MCA students?"
    },
    {
      "id": "ls6k5gg",
      "body": "Thank u bro. \nPlease tell about class timing.\nHow many students are there in mca.\nAnd also please tell what percent of students are getting placed in mca. Thank u bro once again."
    },
    {
      "id": "ls88xoh",
      "body": "8 to 4 for odd semester, 9 to 5 for even"
    },
    {
      "id": "my83irl",
      "body": "did u took admison? Iam thinking to take admision in it"
    },
    {
      "id": "my83jfy",
      "body": "should i take admison in it or not"
    }
  ]
}