{
  "id": "1d33284",
  "title": "Regarding CDSAML and ISFCR internship in 6th Sem Summer Holidays.",
  "content": "Hello guys,\n\nI am in my 6th sem summer break. Is it good decision to join CDSAML or ISFCR intership at this time (i mean 6th sem) or should i focus more on DSA and projects which can help me in getting placed later on in companies. I don't have any special interests in research.\n\nThank you 😊",
  "metadata": {
    "author": "LoadAdditional922",
    "url": "https://www.reddit.com/r/PESU/comments/1d33284/regarding_cdsaml_and_isfcr_internship_in_6th_sem/",
    "permalink": "/r/PESU/comments/1d33284/regarding_cdsaml_and_isfcr_internship_in_6th_sem/",
    "score": 3,
    "created_utc": 1716954618,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l64uuuq",
      "body": "I discussed this on another thread but to summarise: any kind of work experience (research/industry) helps in this market. Standing out when the competition is skyrocketing by any means is important because it helps give your application a stronger chance at making it through the interviews. Also, having a *good* published paper also makes your overall profile stronger, and having research experience also opens doors for both research as well as engineering roles, which aren't possible with just industry roles. Additionally, there is also the added benefit of getting a strong academic LOR from your research advisor for potential future Masters applications, which FYI, is weighed stronger than industry LORs.\n\nWhile it is understandable that not everyone is interested in research, taking up a research internship might not be too bad and might also be a change of pace and give you a flavour of what research looks like. Trying out everything that life has to offer is also important! \n\nThat being said, regardless of which internship you choose, you should try to also keep up some level of DSA practice. The first companies tend to visit from the end of July, so you have about 2 months to prepare. Now is the time to grind. All the best!"
    }
  ]
}