{
  "id": "1d35nnj",
  "title": "Backlog examination ",
  "content": "Are backlog examinations harder, easier or of the same level as the original exam.\nI have a back in Mechanics and EPD",
  "metadata": {
    "author": "Ancient_Mud7997",
    "url": "https://www.reddit.com/r/PESU/comments/1d35nnj/backlog_examination/",
    "permalink": "/r/PESU/comments/1d35nnj/backlog_examination/",
    "score": 3,
    "created_utc": 1716964567,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l655zqo",
      "body": "While the difficulty of the ESA itself might not be higher than a standard ESA, you should know that (1) 100% of your grade is based on your backlog's score, thus there is more at stake when you make a mistake, and (2) you cannot get the maximum possible S grade and your score is capped at a certain grade (if I remember, it's a B). \n\nGiven these circumstances, I'd say arguably that a backlog exam is overall tougher to score well in."
    },
    {
      "id": "l65mwev",
      "body": "so my ISA marks and assignment marks won't count?"
    },
    {
      "id": "l65myen",
      "body": "Nope, they won't count."
    },
    {
      "id": "l65mzjm",
      "body": "thanks a lot"
    },
    {
      "id": "l6lul2w",
      "body": "My friend actually got an A in a backlog, I don't think it's capped at B"
    },
    {
      "id": "l6lvg06",
      "body": "Well, I've written more than 5 backlogs and all of them were waaaaay easier than the regular ESA. I wrote EPD too, coincidentally and I got a B in the. EPD is one of the easiest subjects to score marks in the exam. There's a lot of easy theory and the questions are very predictable. The same questions keep repeating every year. To pass, u need to get 40 in the backlog since there are no internal marks being considered. If by mechanics u mean civil(engineering mechanics statics or something), then I've written that too. They both were really really easy. If you're scared about passing, just read the 3 easiest units. Unit 1 and 5 are the easiest for both of these subjects. Do them first and whatever u find the next easiest, do that after these 2. It should be an easy pass for you if you do this. Backlog exams for first year subjects are very easy, they want you to pass. The correction is also very lenient. Don't stress, read 3 units perfectly and go. You'll be fine. Dm me if you want some more help on what to study first. All the best :)"
    },
    {
      "id": "l6uxdow",
      "body": "thanks a lot man appreciate it"
    },
    {
      "id": "l7c4vsw",
      "body": "No worries. Good luck!"
    }
  ]
}