{
  "id": "1d3fgp7",
  "title": "Confused till when can we surrender seat",
  "content": "Some people are saying june 5th \nSome people are saying july 5th \nSo now i am confused\n",
  "metadata": {
    "author": "LingonberryOwn657",
    "url": "https://www.reddit.com/r/PESU/comments/1d3fgp7/confused_till_when_can_we_surrender_seat/",
    "permalink": "/r/PESU/comments/1d3fgp7/confused_till_when_can_we_surrender_seat/",
    "score": 5,
    "created_utc": 1716997836,
    "flair": "PESSAT/Admission",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l670nac",
      "body": "Id you want to sit in 2nd round counselling , surrender before 2nd round counselling(whenever that is)\n\nElse they’ll give a date once KCET round 1 counselling is done.. based on that you can know"
    },
    {
      "id": "l67250r",
      "body": "it's july 5th"
    },
    {
      "id": "l672pq1",
      "body": "in pessat website, it is stated as 30 june"
    },
    {
      "id": "l674u2e",
      "body": "They wait for CET counselling/result and give one week time after that. to surrender seats. so Keep watching CET counselling dates.\n\nYou can have latest date on PES website also"
    },
    {
      "id": "l69xpdp",
      "body": "You don't need to surrender your seat to sit for 2nd round of counseling."
    },
    {
      "id": "l6a1kdx",
      "body": "No I think you do.. they’ve said this more than 5-6 times during round 1 counselling"
    },
    {
      "id": "l6a1ywg",
      "body": "Unless they changed it specifically for this year (which ideally they shouldn't have), you can always retain your seat and upgrade it in round 2. A lot of people do it, and I myself did it a few years ago. The only catch here is that if you've taken a seat in round 1, then you cannot give up the seat in round 2, so you cannot walk away with no seat. There's more details about the counseling process and second round in the FAQs: https://bit.ly/pesu-faq \n\nBut if you're sure about them having said it multiple times, I'd suggest you to confirm it with the admission department in person."
    },
    {
      "id": "l6c97xh",
      "body": "They will keep dragging it."
    },
    {
      "id": "l6c9a4m",
      "body": "Until KCET Results Come."
    },
    {
      "id": "l6c9fu4",
      "body": "Are you sure"
    },
    {
      "id": "l6c9jzu",
      "body": "Last Year when I attended they said that you could upgrade your seat by giving the DD's"
    },
    {
      "id": "l6c9n3o",
      "body": "If you get  the Seat You Want."
    },
    {
      "id": "l6chfaw",
      "body": "What they have said was… unless you give up your seat… you won’t have enough seats empty and then there’s no use for phase 2 counselling. If you want to sit again, seats should be there and seats will only be available if people give them up"
    },
    {
      "id": "l6cmn73",
      "body": "yes he said that, but now it's risky"
    }
  ]
}