{
  "id": "1d51opq",
  "title": "Previous years ESA papers",
  "content": "Can anyone tell how to download previous years ESA papers from library.pes.edu?",
  "metadata": {
    "author": "Ashamed_Performer_82",
    "url": "https://www.reddit.com/r/PESU/comments/1d51opq/previous_years_esa_papers/",
    "permalink": "/r/PESU/comments/1d51opq/previous_years_esa_papers/",
    "score": 5,
    "created_utc": 1717177857,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l6ifbzy",
      "body": "You're probably first year right. It's not worth it dude, just ask your friends or your batch's WhatsApp or discord group.\n\nYou'll be flooded with esa papers. Don't waste your time downloading them yourself"
    },
    {
      "id": "l6ioui9",
      "body": "Why isn't it \"worth it\" though? Aren't all the papers right there? It takes less than a minute to search through it."
    },
    {
      "id": "l6iqqkx",
      "body": "1. Visit http://library.pes.edu (note that it's http, not https)\n2. Click on Search. \n3. Set the \"Title\" to the course code *without* the year. So if your course code is UE23MA101, just put MA101. This is to search for all papers for that course. You can also search using course names, but the issue with this is that the course names sometimes change. Since course code always remains a constant (hopefully), it's best to search using it. \n4. Don't set any other fields and press search. Choose whichever paper you want to view and click on Download. \n5. It will mostly ask you to sign in to download. You can sign in using your PESU credentials."
    },
    {
      "id": "l6iqv7q",
      "body": "Step 1 - Go to [library.pes.edu](http://library.pes.edu)\n\nStep 2 - Click on \"My page\" on the top right hand corner as soon as you land on the website. \n\nStep 3 - Login with your credentials sent from Librarian\n\nStep 4 - Click on \"Search\" in the Top Bar\n\nStep 5 - In the **Title** section, fill the **subject name that you want the ESA paper of** and then under **Category** select **Digital Library**. Then, you get a set of Question papers\n\nStep 6 - Click on **Download** on any of the papers you want.\n\nAll the best !"
    },
    {
      "id": "l6ir3m4",
      "body": "Uff, we are 1 min away from sending"
    },
    {
      "id": "l6irfpn",
      "body": "Course codes do not change bro. Its the course names which change instead."
    },
    {
      "id": "l6irp8p",
      "body": "Course codes change? That's new. Usually it's the course names that changed for my batch. Okay well the summary is use both then xD"
    },
    {
      "id": "l6isc3x",
      "body": "Yep, for example my juniors had UE22CSXXX but we had UE22CSYYYY  \nIt changes every batch, and mainly electives its unpredictable"
    },
    {
      "id": "l6itwx3",
      "body": "Yeah this is definitely new. For us the course codes never changed for a course, and I remember this was true until 2022 as well because I was TA"
    },
    {
      "id": "l6k55hy",
      "body": "Doesn't take as long as it does to literally click a Google drive link"
    },
    {
      "id": "l6ke97u",
      "body": "Yeah but someone has to update those drive links too right xD"
    },
    {
      "id": "l6l895a",
      "body": "[https://drive.google.com/drive/folders/11U56PJ-VZ\\_5zaJ1fVrV6h3kzN4rnNX7E](https://drive.google.com/drive/folders/11U56PJ-VZ_5zaJ1fVrV6h3kzN4rnNX7E)\n\nthis might help"
    },
    {
      "id": "l6ld0j7",
      "body": "Thanks 🙏"
    }
  ]
}