{
  "id": "1d66gzl",
  "title": "AIML at PES vs AIML at BMSCE",
  "content": "I'm getting PES AIML at RR campus through PESSAT and AIML at BMSCE through kcet. Campus and college life isn't a priority. I'm a hardworking student and Solely looking for better placements and colleges abroad after my undergrad. What's a better option?",
  "metadata": {
    "author": "DotEmbarrassed664",
    "url": "https://www.reddit.com/r/PESU/comments/1d66gzl/aiml_at_pes_vs_aiml_at_bmsce/",
    "permalink": "/r/PESU/comments/1d66gzl/aiml_at_pes_vs_aiml_at_bmsce/",
    "score": 3,
    "created_utc": 1717307511,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l6qfq1x",
      "body": "There's a large difference in the fee structure so based on that i would choose BMSCE. Also if you want actual AIML i think it's better to go with BMSCE. If you're ok with the fee and if you're someone who's settling for AIML because you won't get CSE only then go for PES AIML because it is CSE(AIML). \nTill the third year there's only a couple subjects difference."
    },
    {
      "id": "l6qgazf",
      "body": "No I'm specifically looking to join AIML so BMS is a better option ud say?"
    },
    {
      "id": "l6qib5a",
      "body": "I would recommend BMSCE, because its cheaper and you would end up with similar returns.\n\nHowever, I am also dropping this link here on why you should not opt for AIML, from CS education, placements as well as a higher education point of view: [https://www.reddit.com/r/PESU/comments/147gamv/comment/jnve51g/](https://www.reddit.com/r/PESU/comments/147gamv/comment/jnve51g/)"
    },
    {
      "id": "l6qronu",
      "body": "I think the aiml degree from bms just literally says\"aiml\"\n\nThe pes one says cse(aiml), and the subjects themselves are very close to cse\n\nIf money is not a problem i would personally take pes. And placements should generally be better here. Otherwise take bms. \n\nOverall you'd probably get equal opportunities whichever you pick"
    },
    {
      "id": "l6re52u",
      "body": "I would go with pes (better edu, brand and placements)"
    },
    {
      "id": "l6uyfy5",
      "body": "Forgive my ignorance, but dont some people pursue masters in cs after completing undergrad in ece."
    },
    {
      "id": "l6v07vi",
      "body": "Yes, they do. But it's not that straightforward. I'll explain in detail:\n\nEach program has a set of minimum requirements you need to clear to even be eligible for consideration. If you're applying for MSCS, chances are that these are often core coursework in CS such as OS, DBMS, networks, compilers etc etc. It varies from program to program but it's usually mostly the same set of courses. If your undergrad education does not comprise these courses, then it immediately puts you in a tough situation because you don't meet the minimum requirements to even be considered, and thus, get rejected. \n\nHowever, the \"strictness\" of these requirements usually depends on the University status itself. Low/mid ranked Unis are often a little relaxed. They sometimes tend to ignore these requirements if you have other relevant experiences like internships or so. Some will even conditionally admit you on the conditions that you will need to take up undergrad level coursework to meet these requirements after you join. While almost all high ranked ones definitely do have strict requirements, with specific ones like CMU and others requiring you to explicitly specify how much you've obtained in said courses. So basically, the best case scenario is that you are made to take up these courses after reaching there and the worst case scenario is you aren't even considered. \n\nA majority of the ECE students who do get admitted into MSCS programs are those who have covered these CS courses, either through a Minor degree or by other means. Especially at PES, where the majority of the people taking up a Minor in CS from ECE are doing it solely to clear these requirements. Another way as I mentioned is to have relevant experiences via internships and work in the industry. Note that this doesn't eliminate the requirement but relaxes it at most.\n\nAlso, this is for US universities. If you're trying to apply in Europe, you might as well forget about it because Europe has stricter rules when it comes to STEM degrees and your undergrad *must* be the same, or a derivative, of the graduate program you're applying to. So without an UG in CS/IT, you can't apply for an MS in CS in Europe.\n\nSo to summarise, yes it's definitely possible to do MS in CS without having an undergrad in CS. But, it's a massively uphill task because you need to additionally prepare yourself through other means, and it also limits your options in Unis to quite an extent. However, if you're from CS, it's a straightforward road ahead. That's why, if you ever do plan on a Master's, ensuring your undergrad branch is *at least* related, is of utmost importance."
    },
    {
      "id": "l6vw6yl",
      "body": "Oh, is the placements for rr and ec campus held together?"
    },
    {
      "id": "l6vx5l3",
      "body": "Hey, centralised placements is what I have heard, but perhaps you should double check this since it's been 3 years since I graduated and I haven't been tracking this kinda info lately (also, I graduated from a completely different college)"
    },
    {
      "id": "l6vx7ns",
      "body": "Oh, ok thanks"
    }
  ]
}