{
  "id": "1d78103",
  "title": "College selection through kcet.",
  "content": "So i got 3k rank in kcet and i have chances of getting core cse in msrit and pes ec, but ill also probably getting cs specialization in bmsce and pes rr. So what should i be choosing? Also could anyone please inform on how eie and ete is different from ece, and should i be choosing it in rv? Thanks in advance for your guidance.",
  "metadata": {
    "author": "leolongway07",
    "url": "https://www.reddit.com/r/PESU/comments/1d78103/college_selection_through_kcet/",
    "permalink": "/r/PESU/comments/1d78103/college_selection_through_kcet/",
    "score": 4,
    "created_utc": 1717430548,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l6xgmmm",
      "body": "Don't take electronics unless you're interested. \n\nPrefer core SC in pes then msrit\n\nIf you want the location of bms or pes rr, then take specialisation"
    },
    {
      "id": "l6xgzep",
      "body": "I will be staying in hostel so i dont think location will an issue, so should i still choose cs core over cs specialization."
    },
    {
      "id": "l6xktge",
      "body": "You can refer to this comment for why you should always not choose specialisations in undergrad: [https://www.reddit.com/r/PESU/comments/147gamv/comment/jnve51g/](https://www.reddit.com/r/PESU/comments/147gamv/comment/jnve51g/)"
    },
    {
      "id": "l6xl2vs",
      "body": "Prefer CS core at PES.\nIf location isn't a problem then CS at pes rr and pes ec are the same. We share the same material, have equally uhh.. tolerable teachers, write exams on the same day and basically everything else. \nIf you're not really into electronics don't take it, the rigour is a lot more compared to core CS."
    },
    {
      "id": "l6xm6z3",
      "body": "Pes EC cse core>Msrit Cse core>BMSCE specialisation"
    },
    {
      "id": "l6xmrjv",
      "body": "Yes you probably should"
    },
    {
      "id": "l6xo5lh",
      "body": "Thank you sir."
    },
    {
      "id": "l6xu7uy",
      "body": "Cs specialisation in rvce or pes cs rr? Confused af.."
    },
    {
      "id": "l6xvouj",
      "body": "Rv"
    },
    {
      "id": "l709pui",
      "body": "Cs specialization in pes rr."
    },
    {
      "id": "l70uxa1",
      "body": "a little off topic but are the teachers actually bad and don't care about the student's mental health?"
    },
    {
      "id": "l70wp8s",
      "body": "Sorry i though u were asking my options, most would prefer rv over pes."
    },
    {
      "id": "l71dqwe",
      "body": "Nah. Not really. They're definitely mostly average at their jobs but most profs aren't the sadist/harassing type."
    },
    {
      "id": "l7ecccu",
      "body": "Lot of my friends(seniors) said pes is too hectic with little to no time to develop other skills and stuff, i want to balance both education and other hobbies, can you please expand on this?"
    },
    {
      "id": "l7gzg3t",
      "body": "Honestly depends on how well you can manage your time tbh. I manage to study what was done in class (at least an hour), I still find time to hit the gym everyday, and work on my personal projects (if not everyday, then at least on weekends). Yes, things get a little tight when the assignments are due, or during the last week of the sem when we have lab exams and tests and all that, but then I just don't go to the gym daily, and there's enough time for me to finish all my stuff. I also travel for an hour coming to college and an hour going back home, so ye.\nDepends on personal ability at the end of the day, if you can focus well in class, listen to what the teachers are saying and understand something, then you have less work at home while studying, glossing over it will be enough. \n\nPS: I'm a first year tho, so I don't really know how cramped the syllabus is (apparently the 3rd sem syllabus is filled to the brim), but this is my 2 cents at the moment about the whole too hectic thing. Maybe I'll find out next sem, if shit goes down 💀"
    },
    {
      "id": "n5rk1c1",
      "body": "So it's been a year since this comment, u might be in 5th sem by now how is ur take on it??"
    }
  ]
}