{
  "id": "1d7u79d",
  "title": "How many credits are required to graduate?",
  "content": "Title. \n\nI'm assuming we'd consistently get at least 22 credits for core subjects + electives per semester. That makes 8 * 22 = 176 credits. How many do you have to obtain by yourself with extra courses/internships to graduate?",
  "metadata": {
    "author": "Anurag_Rao",
    "url": "https://www.reddit.com/r/PESU/comments/1d7u79d/how_many_credits_are_required_to_graduate/",
    "permalink": "/r/PESU/comments/1d7u79d/how_many_credits_are_required_to_graduate/",
    "score": 6,
    "created_utc": 1717498280,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l71pnj0",
      "body": "Your assumption is wrong. In my batch we have 22 credits for the first 5 sems 24 credits for the 6th sem (additional 2 credits for capstone phase 1) and you need to do 20 credits across 7th and 8th combined so (5\\*22) + (1\\*24) + 20 = 154 credits and you need to do 3 summer courses/cie etc for the remaining 6 credits. Totally we need to do 160 credits to get our degree. 6 credits in the 8th sem are alloted for any internship uve done so no matter how many internships uve done you can claim a maximum of only 6 credits. Capstone Phase 2 and Phase 3 are 6 and 4 credits respectively. So in the final year out of the 20 credits you have to do 16 are fixed. You have to do 2 special topics in the 7th sem for the remaining 4 credits. You can however do more summer courses/cie in the lower semesters to make up for these 4 credits and reduce the burden during 7th sem and focus solely on placements and Capstone phase 2. Though From my seniors ive heard that special topics are pretty chill and you dont need to attend the online classes for them. If you dont get an internship in the 8th semester you can also make up for those 6 credits with 3 special topics . The credit distribution may vary from batch to batch .I told the case for 2025 batch. This is everything you need to know about credits . Cheers!"
    },
    {
      "id": "l72t0hq",
      "body": "Are all the special topic classes in 7th and 8th sem online? I mean the 4 remaining credits from 4th year + remaining 6 (or any) credits from the previous two years."
    },
    {
      "id": "l72tmjv",
      "body": "Ah, thanks!"
    },
    {
      "id": "l72xrz0",
      "body": "yeah all the special topics are online. You have to come to clg only for your capstone reviews ,mentor meeting , isa and esa during final yr."
    },
    {
      "id": "l77vdhh",
      "body": "You'll need 160 credits to pass\n\nYou'll have atleast 22 credits till your 5th sem\nYou'll have 24 credits for you 6th sem (Capstone Ph-1 included)\nYou'll have 10 credits for your 7th and 8th sems and 6 credits from special topics/Summer courses\n\n22×5 + 24 + 10×2 + 6 = 160"
    }
  ]
}