{
  "id": "1d7wn81",
  "title": "Called on Malpractice during ESA - What will happen now?",
  "content": "The title! - A student was called on malpractice in ESA (their mistake - was no careful but no copying), How does PESU handle the case and what will happen to the student. Pls explain in detail.",
  "metadata": {
    "author": "UniversityPlenty6960",
    "url": "https://www.reddit.com/r/PESU/comments/1d7wn81/called_on_malpractice_during_esa_what_will_happen/",
    "permalink": "/r/PESU/comments/1d7wn81/called_on_malpractice_during_esa_what_will_happen/",
    "score": 2,
    "created_utc": 1717506251,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l725ynt",
      "body": "Careful about what ? Did you accidentally try to peak into other's screen ?"
    },
    {
      "id": "l726ho3",
      "body": "Pls give more context"
    },
    {
      "id": "l72axq0",
      "body": "The student had a phone with them accidentally"
    },
    {
      "id": "l72b1zb",
      "body": "The student had a phone with them by accident and later themselves admitted to the checking"
    },
    {
      "id": "l72c8iw",
      "body": "Firstly don't panic. If you need mental health support please seek out. They may summon your parents, and listen to what they will say. If they prevent you from placements please don't panic, it's not the end of the world. Work hard in successive sems and you can get one outside, possibly a good-paying one. If they deny you scholarships, it may be disheartening, but that's not the end of the world, u can achieve things in other ways. U will get a backlog, cover it up possibly during the summer. They shouldn't be doing something more than this as you are still first year. If they want to do something extreme consider some kind of legal backup. But it will be ok, it's not the end of the world. Don't fall for their threats if they are trying to intimidate you."
    },
    {
      "id": "l72nrw5",
      "body": "Does the student have to chance to explain what happened and prove it ? What happens if the student gets backlog because of this?"
    },
    {
      "id": "l72ox82",
      "body": "Backlog can always be covered up dw. But do speak up and request CCTV footage of what happened. U should have the right to defend yourself, if you are prevented u can seek legal action."
    },
    {
      "id": "l72tl69",
      "body": "Why are you talking in third person tho?"
    },
    {
      "id": "l765ilk",
      "body": "Justice for Aditya Prabhu ⚖️"
    },
    {
      "id": "l765r6k",
      "body": "I'm asking for someone who is really worried and helpless. They are clueless about what to do. LEave all that, If you could help with some info or suggestion...It will be appreciated"
    },
    {
      "id": "l77oqf4",
      "body": "Has anyone experienced this before, The student's device was taken away and they were told they will be called for a meeting. When will that take place and what will happen during this.\n\nWill this incident or the backlog show up on the student's records forever now?  \nIf the backlog is cleared also, will no one know that the student did not clear a subject during regular semester. Will the consequences affect placements and masters admissions. If anyone can give clarity, it will be much relieving"
    },
    {
      "id": "l77ou57",
      "body": "Has anyone experienced this before, The student's device was taken away and they were told they will be called for a meeting. When will that take place and what will happen during this.\n\nWill this incident or the backlog show up on the student's records forever now?  \nIf the backlog is cleared also, will no one know that the student did not clear a subject during regular semester. Will the consequences affect placements and masters admissions. If anyone can give clarity, it will be much relieving\n\nPLs DM if you have experienced or know someone's experience"
    },
    {
      "id": "l77owx4",
      "body": "Has anyone experienced this before, The student's device was taken away and they were told they will be called for a meeting. When will that take place and what will happen during this.\n\nWill this incident or the backlog show up on the student's records forever now?  \nIf the backlog is cleared also, will no one know that the student did not clear a subject during regular semester. Will the consequences affect placements and masters admissions. If anyone can give clarity, it will be much relieving"
    },
    {
      "id": "l7bn4u4",
      "body": "Hey, remember Aditya Prabhu? His was the same case. Please please don't panic okay. They'll call your parents and stuff let them, they'll threaten they won't let you sit for placements and all but that will be fine as long as you handle this situation calmly and apologize if needed and let them know it was a mistake (if you argue and keep saying it wasn't your mistake, they'll handle it worse). They might give you a backlog, that's fine again, clear it off within 4 years before graduation and they won't show it in your final transcript. Hold onto a good behaviour for a while, maintain attendance and everything, study well and things will work out okay. If it's genuinely a mistake just don't try to outsmart them. IT WILL 100% BE FINE as long as you're polite and handle whatever comes calmly."
    }
  ]
}