{
  "id": "1d7xapi",
  "title": "Relative grading for this ESA RESULTS",
  "content": "pretty simple. Was there no relative grading this esa? If so why was it not there?",
  "metadata": {
    "author": "Bright_Excitement637",
    "url": "https://www.reddit.com/r/PESU/comments/1d7xapi/relative_grading_for_this_esa_results/",
    "permalink": "/r/PESU/comments/1d7xapi/relative_grading_for_this_esa_results/",
    "score": 15,
    "created_utc": 1717508061,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l72ag8x",
      "body": "If the results are disastrous, can't they change it to relative grading now?"
    },
    {
      "id": "l72b548",
      "body": "In the website its still showing final results tmrw"
    },
    {
      "id": "l72ctvm",
      "body": "Why this sem there is no relative grading ?"
    },
    {
      "id": "l72dk6e",
      "body": "I failed an exam, it was a 6th sem subject, when will I be able to clear this backlog? I am feeling suicidal right now..."
    },
    {
      "id": "l72eh7l",
      "body": "Relative grading is applied only when the overall performance is catastrophic. Fortunately (or unfortunately?), it looks like your batch did not perform that bad to need relative grading."
    },
    {
      "id": "l72exkn",
      "body": "Toppers have scored 7.5 bro, people who were expecting 9+ and apparently rr campus peeps have been graded properly"
    },
    {
      "id": "l72f6fh",
      "body": "no that's always shown"
    },
    {
      "id": "l72fe2i",
      "body": "but will they change it now after it's released?"
    },
    {
      "id": "l72ftfr",
      "body": "Idk abt that but this doesn't seem fair , according to the result I scored 20-30 in every exam, they went bad but not that bad also"
    },
    {
      "id": "l72ggf3",
      "body": "same mine was much much lower than i expected which is weird cus i heard they're generally lenient in the even semesters"
    },
    {
      "id": "l72hmcw",
      "body": "i don't think it's different in rr campus"
    },
    {
      "id": "l72im8i",
      "body": "You will get through this  \nBe strong"
    },
    {
      "id": "l72ixnt",
      "body": "July is the time bro even i got one don't worry don't feel tensed"
    },
    {
      "id": "l72ln6q",
      "body": "CD right? Same here, I learnt literally nothing from my CD teacher. How will I even be able to clear this backlog?"
    },
    {
      "id": "l72p1fb",
      "body": "They won’t"
    },
    {
      "id": "l72qv0f",
      "body": "they removed the results now though from the app and the website so idk"
    },
    {
      "id": "l72yjrz",
      "body": "Its not that different in RR, majority of the scores have slipped for even toppers"
    },
    {
      "id": "l72yqnb",
      "body": "Nah man it’s still there"
    },
    {
      "id": "l7306qw",
      "body": "It's gone only for ec campus afaik"
    },
    {
      "id": "l732ind",
      "body": "wait what?? you guys can still see it?"
    },
    {
      "id": "l73459a",
      "body": "I didn't check. But an rr friend said it's there. All ec campus people are saying it's gone."
    },
    {
      "id": "l7351j7",
      "body": "ohh,,,\n\nit's definitely gone for everybody in ecc but they wouldn't change it just for one campus would they"
    },
    {
      "id": "l737opy",
      "body": "Definitely not. I hope atleast"
    },
    {
      "id": "l74jtbg",
      "body": "The results shown is per campus or across both campus ?"
    },
    {
      "id": "l75lk89",
      "body": "Graded properly? Do told you that?"
    },
    {
      "id": "l762hus",
      "body": "Ah yeah I read about it on discord. Good luck guys, worst case just reval everything"
    },
    {
      "id": "l76nurd",
      "body": "The review and revaluation notification is out. Does this mean we don't have a chance of relative grading ?"
    },
    {
      "id": "l76so8n",
      "body": "Across both campuses as the total no. of students from the graph is 1600"
    }
  ]
}