{
  "id": "1d8mdb4",
  "title": "Internship ",
  "content": "does anyone know the approx range of money people get paid for a cse internship ",
  "metadata": {
    "author": "depressed_simp234",
    "url": "https://www.reddit.com/r/PESU/comments/1d8mdb4/internship/",
    "permalink": "/r/PESU/comments/1d8mdb4/internship/",
    "score": 9,
    "created_utc": 1717582320,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l774cj1",
      "body": "what?"
    },
    {
      "id": "l77egzz",
      "body": "does anyone know the approx range of money people get paid for a cse internship"
    },
    {
      "id": "l77g8f9",
      "body": "It depends on company (and role), we cannot tell that for sure."
    },
    {
      "id": "l77n40d",
      "body": "Varies between 0 to 1L pm"
    },
    {
      "id": "l7851hl",
      "body": "very informative thanks"
    },
    {
      "id": "l78924y",
      "body": "I’m doing one rn for the summer I’m being paid 20k and I just finished 2nd year"
    },
    {
      "id": "l7ehtrh",
      "body": "Does PES offer internship opportunities for the summer between 3rd and 4th years?"
    },
    {
      "id": "l7el7ca",
      "body": "Yeah they do some are sent though mails like outside companies generally have a hackathon or like coding test rounds or you can do in college itself that won’t be paid most of the times but credits will be given . In Pes itself there are a lot of opportunities but yeah a lot of people go for it . Try pulling outside strings and go out and do better real life experience with people on the industry."
    },
    {
      "id": "l7emepj",
      "body": "I specifically meant industry internships. Like do companies come for summer internships which can become FTE roles via a PPO? Like Microsoft, Amazon, JPMC, Atlassian, etc?"
    },
    {
      "id": "l7emxyu",
      "body": "Not sure of getting a ppo via summer internships cause that’s barely 2 months . I know seniors who do the 6 month internship in the final year and get Ppo . Sorry you can ask others about this😬jpmc has done a 6 month internship and then Ppo thing last year for my sister. Idk about summer no idea"
    },
    {
      "id": "l7eobv5",
      "body": "Leave the ppo thing aside, but companies come for those 2 month internships on campus or not?"
    },
    {
      "id": "l7eordb",
      "body": "I can’t give you that exact information I’m not sure sorry. I just know there’s a bunch of them that we get informed about it through mail like very few but those have limited availability so yeah . Proper on campus I’m not sure wrong person to answer🤷🏻‍♂️"
    },
    {
      "id": "l7epc6s",
      "body": "No worries. Thanks for responding,"
    },
    {
      "id": "l7i085e",
      "body": "there's no range bro it depends on the size of the company you get an offer from that's all"
    }
  ]
}