{
  "id": "1d8oegr",
  "title": "CONFUSED 😕",
  "content": "So I got 2.6k rank in kcet \nSo I don't if I will get or not but in case if I get, should I go for pes cse with AIML specialisation over BIT cse core ?\n\nI know pes cse with AIML has better ranking in terms of cutoff than BIT but if pes then I have to go for hostel but for BIT I can be a day scholar.\n\nPlease Help🙏🙏🙏\n",
  "metadata": {
    "author": "AppointmentSad5410",
    "url": "https://www.reddit.com/r/PESU/comments/1d8oegr/confused/",
    "permalink": "/r/PESU/comments/1d8oegr/confused/",
    "score": 7,
    "created_utc": 1717589589,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l77kju3",
      "body": "Pes is much better. But maybe consider ec campus if you want core. \n\nAiml at rr is not a bad option either"
    },
    {
      "id": "l77xfjl",
      "body": "at this rank you'll get pes rr cse aiml, pes ec cse, bmsce cse spec, msrit cse spec... these are better options than bit"
    },
    {
      "id": "l77xg42",
      "body": "at this rank you'll get pes rr cse aiml, pes ec cse, bmsce cse spec, msrit cse spec... these are better options than bit"
    },
    {
      "id": "l78f8mg",
      "body": "I feel a bit the same, but in house my parents are not preferring cse with spec........ They are not very confident to join in cse with spec because spec has started very recently and we don't know about the placement situation and also they think that it might effect me in future while applying for govt jobs like ISRO and all becoz they(ISRO and all) don't specify whether cse with spec are allowed to apply for the job they just mention cse.... Is there anything wrong with this thought?"
    },
    {
      "id": "l78h2bn",
      "body": "Bit is a very bad college,I mean if you want to pursue government jobs after this then CSE core in bit might help a tiny bit but bit is not a good college only thing is that government's college do they do government tasks like providing stipends faster but it's not recommended not even for CSE I'd you have 2.6k in cet you could really try for BMS ,Rv CSE core is tough to get ,pes is a lot better than bit"
    },
    {
      "id": "l78ixp6",
      "body": "In house my parents are not preferring cse with spec........ They are not very confident to join in cse with spec because spec has started very recently and we don't know about the placement situation and also they think that it might effect me in future while applying for govt jobs like ISRO and all becoz they(ISRO and all) don't specify whether cse with spec are allowed to apply for the job they just mention cse.... Is there anything wrong with this thought?"
    },
    {
      "id": "l78j8tg",
      "body": "And also according to which factors are you saying that but is a bad College?"
    },
    {
      "id": "l78nfiy",
      "body": "The placement for cse with specialisation in pes ,BMS ,RV ,Msrit are much higher than bit CSE core anytime ,the median package at bit is 5 lacks this time and pes rv and all is around 8-10 lacks ,the thing is bit not only has very bad campus facilities , laboratories, classrooms it also does not offer good placements while BMS pes rv and even dayananda Sagar are comparatively very better to bit.\n\nThe second thing the criteria for eligibility in isro is btech with minimum 65% score,they offer their exam to anyone who has these criteria and depending on your stream.Now the job vacancies in isro generally require a cse, information technology, information science streams and the specialisation in cse is all included as long as the word \"computer\" is the degree name\n\nWhat i recommend to you is research about the placements in the top colleges in Bangalore and compare it with bit ,find out what college you can get in 2.6k rank and how to make your councelling option list in cet , don't keep cse core in Bit in the first place at all tho.Get the data discuss it with your parents and then make a decision because you'd be spending 4 years of your life in this college and may very well dictate how your professional career is in the future so take this seriously."
    },
    {
      "id": "l78o6ke",
      "body": "Thank you so much 🙏🙏🙏"
    },
    {
      "id": "l78tuno",
      "body": "Placements, crowd, quality of education, campus facilities, labs, probably one of the smallest campus in Bengaluru in terms of size"
    },
    {
      "id": "l7bpcgc",
      "body": "Brother, at this rank you might even get ISE in BMSCE and you also have pes rr cse(aiml) as an option, which is not bad. If you really want to go to CSE core, there are colleges like UVCE, RIT, DSCE etc which are slightly better than BIT cse core."
    },
    {
      "id": "l7bpwfu",
      "body": "What are your sources on BIT? You seem very wrong and just speaking rubbish here. I Agree BIT is not at par with PES, RV, BMS etc but it is not as bad as you have described."
    },
    {
      "id": "l7c2bgi",
      "body": "The thing with BIT is that I don't have to go to the hostel and all other colleges you mentioned (UVCE,RIT,DSCE) I Would have to go to hostel and I spoke to some students in BIT ,they were like the placements is almost same in all these colleges so I didn't mention about UVCE,RIT,DSCE .....\nBut are you sure that I will get ISE in BMSCE or PES RR CSE AIML because last year's cutoff was around 2k."
    },
    {
      "id": "l7c6nwy",
      "body": "If you're comfortable answering here, where exactly do you live? Because BIT, BMSCE and DSCE are quite close to each other. I don't think you will need a hostel for these colleges. \nSpeaking of placements, these three colleges have slightly better placements than BIT. You sure can give a try for ise and cse aiml in bms and pes rr. Just keep them at the top of the option list."
    },
    {
      "id": "l7cstve",
      "body": "PES is toxic"
    },
    {
      "id": "l7ctsl2",
      "body": "What do you mean by that?"
    },
    {
      "id": "l7ctzx8",
      "body": "Please check PES college news in Google"
    },
    {
      "id": "l7eh2dk",
      "body": "Okay, so if you don't want spec, going with PES EC Campus CSE is a very good option. Also, ISRO has a list of branches it accepts for CS jobs, it includes a lot of specs, search on google."
    }
  ]
}