{
  "id": "1d8vttw",
  "title": "Scared to my soul",
  "content": "6th sem cse here, I’ve been an above average student so far and I’m currently preparing for placements. However, I fell sick two days before my weakest subject’s ESA this semester and unfortunately flunked it. I will have to rewrite it and I’m scared if the backlog exam doesn’t happen on time it’ll come in the way of placements. \nSeniors, please help, im scared to my soul. ",
  "metadata": {
    "author": "Head_Limit2",
    "url": "https://www.reddit.com/r/PESU/comments/1d8vttw/scared_to_my_soul/",
    "permalink": "/r/PESU/comments/1d8vttw/scared_to_my_soul/",
    "score": 6,
    "created_utc": 1717609031,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l793wdj",
      "body": "You don’t have to worry…you’ll have summer backlog exams so you can clear it then and it’ll be right before placements too. \nUsually it’s okay if you clear it, it doesn’t come in the way of your placements but just don’t have an active backlog and try your best to clear it right now itself. \nOther than that, a few companies don’t want backlogs at all so that might be a lil unfortunate but you can still apply and see if it works out. \nYou don’t have to worry too much, you’ll be fine!"
    },
    {
      "id": "l794clm",
      "body": "Thank you so much dude, this comes as a huge relief. \nI know I’ll have to live with the fact I ended up getting a backlog in the last semester of college🥲"
    },
    {
      "id": "l794yod",
      "body": "I don’t think you should be too worried abt that…I mean yes I get that it sucks but I’ve seen and heard soo many ppl with backlogs getting placed in good companies. At the end of the day, you should show that you’ve got the skills they need and you’re ready to learn and improve. And I’m sure your overall gpa didnt dip too much…if it’s above 7 then you can apply to a pretty good amt of companies so keep your head high…you’re gonna be more than okay"
    },
    {
      "id": "l79o2k2",
      "body": "Is it possible to get placed in t1 or t2 companies  with cgpa in the 7 to 7.5 range ?"
    },
    {
      "id": "l79z1gc",
      "body": "Yeah"
    },
    {
      "id": "l7c2jqu",
      "body": "I have question that in PES Companies Offers Placement Regarding of their Branch like [B.tech](http://B.tech) and MCA or They Discriminate Between Them."
    }
  ]
}