{
  "id": "1d99q9m",
  "title": "Doubt regarding seat selection /counselling ",
  "content": "Hi guys.I have gotten a seat in PES through PESSAT first round counseling (AIML). This issue is, with my KCET rank (2.5k), I won't be getting  seat in AIML in the first round KCET counseling itself, but there is a high chance in second round. The doubt is, do I have to give up my PESSAT seat in order to attend 2nd round KCET counseling/ is it not possible for me to attend 2nd round KCET counseling once I submit all original documents by June 30th? Can a senior or anybody please guide me through this?  \n",
  "metadata": {
    "author": "DurianFriendly6901",
    "url": "https://www.reddit.com/r/PESU/comments/1d99q9m/doubt_regarding_seat_selection_counselling/",
    "permalink": "/r/PESU/comments/1d99q9m/doubt_regarding_seat_selection_counselling/",
    "score": 3,
    "created_utc": 1717647896,
    "flair": "PESSAT/Admission",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l7bx8ee",
      "body": "I had the same exact question, I went to the college and I enquired about it. As long as ure joining PES in the 2nd extended round, they will refund the entire amount withholding 10k. But if u join any other college, then the fee would be deducted"
    },
    {
      "id": "l7bz6nw",
      "body": "so we can attend cet counseling without giving up the pessat seat?"
    },
    {
      "id": "l7c6pza",
      "body": "Yes"
    },
    {
      "id": "l7clt2p",
      "body": "but the second round cet counselling results would be declared around September and classes would have already started wouldnt it?"
    },
    {
      "id": "l7dkav2",
      "body": "Yes. KCET students will join late and have a separate section/batch for the first semester. From the 2nd sem, its the same for all students regardless of how you were admitted."
    },
    {
      "id": "l7dklfz",
      "body": "so can I still go for kcet counselling when the college has already started for pessat students? thanks in advance"
    },
    {
      "id": "l7dm3zc",
      "body": "Yeah you can"
    },
    {
      "id": "l7e9lx2",
      "body": "Yes u can, as long as ure continuing in PES, they don't mind, whenever u get a seat through kcet, ur fee structure would be changed. I confirmed this by going to the campus and talking to them about a week ago"
    },
    {
      "id": "l7e9oqc",
      "body": "Definitely"
    },
    {
      "id": "l7hveqy",
      "body": "alrighttt tysm"
    }
  ]
}