{
  "id": "1d9mqgq",
  "title": "Maths ",
  "content": "Is it enough if I just work out all the cw problems?? I mean in isa some questions just came straight from the cw but will it be the same case for esa? Or is extra reference required?",
  "metadata": {
    "author": "ConfidentTiger1237",
    "url": "https://www.reddit.com/r/PESU/comments/1d9mqgq/maths/",
    "permalink": "/r/PESU/comments/1d9mqgq/maths/",
    "score": 4,
    "created_utc": 1717692178,
    "flair": "Study Help :table:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l7ei0so",
      "body": "For us they asked both ESAs almost fully ditto from cw"
    },
    {
      "id": "l7ejx7v",
      "body": "For us in 1st sem esa they fked us bad paper was hard, damn scared for exam"
    },
    {
      "id": "l7en0lb",
      "body": "See some of the typical questions in question bank, assignment also"
    },
    {
      "id": "l7ep6g9",
      "body": "In CSE and CSE AI-ML, is there rote learning involved in  anyway in PESU? Like, do they ask for stuff which you would need to memorise as opposed to understanding? I'm scared coz I don't really like memorising stuff compared to understanding it."
    },
    {
      "id": "l7erj1y",
      "body": "Yes there are many subjects in cse that require large amounts of memorization. Idk abt ai/ml"
    },
    {
      "id": "l7esevx",
      "body": "Really? So not based on understanding but memorization! That is crazy! Is it just PESU that has this issue or every college has it?"
    },
    {
      "id": "l7etfen",
      "body": "U can understand things too but certain have so much theory that I u have no choice but to memorize. Every college has this issue"
    },
    {
      "id": "l7etvth",
      "body": "But dw it's pretty manageable if u study beforehand. Don't wait for the day before exams"
    },
    {
      "id": "l7f11nh",
      "body": "Alright, got it. Thank you for replying."
    },
    {
      "id": "l7h8ad5",
      "body": "CS is not just programming, there is a *lot* more to CS. Coding is just a means to apply these concepts. So yes, you'll find that some courses will be math heavy, some will be entirely theoretical, some are applied, etc."
    },
    {
      "id": "l7k2xhz",
      "body": "Average topper 🫡"
    },
    {
      "id": "l7k3c01",
      "body": "Lol, just speaking from the pov of toppers. U were telling me abt easy electives a few days ago😭😭"
    },
    {
      "id": "l7k3i5q",
      "body": "yeah lol got that. just kidding 😂"
    }
  ]
}