{
  "id": "1da24ro",
  "title": "Capstone doubt",
  "content": "I am publishing a review paper with my team for my capstone work , but from do I get tools to make pics and design which i can put in my paper.",
  "metadata": {
    "author": "Firm-Chair-5897",
    "url": "https://www.reddit.com/r/PESU/comments/1da24ro/capstone_doubt/",
    "permalink": "/r/PESU/comments/1da24ro/capstone_doubt/",
    "score": 4,
    "created_utc": 1717734501,
    "flair": "Study Help :table:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l7hn89k",
      "body": "Tools in the sense? Could you be more specific?"
    },
    {
      "id": "l7hnnpa",
      "body": "As in what tools can I use to make pictures.\nLike in my thing I have to use 3d cnn so like i can't just copy paste from other papers or internet that's what our sir said .\nHe said to make own pics and own visualisation for the review paper.\nReview paper will be published now and the main paper later on in 8th sem"
    },
    {
      "id": "l7hooz1",
      "body": "You can use draw.io"
    },
    {
      "id": "l7hpbpf",
      "body": "Draw.io I have used that to make all those diagrams swimlane sequence entity diagram etc.\nI need something to make images of the model\n\nWell now ya we have to write 2 papers one review paper and one for the main project we build."
    },
    {
      "id": "l7hposy",
      "body": "[https://docs.google.com/spreadsheets/d/1nHmTpgdgCgxuHdYcATvDss6cQBnaS5cn34eSUu779B4/edit?usp=sharing](https://docs.google.com/spreadsheets/d/1nHmTpgdgCgxuHdYcATvDss6cQBnaS5cn34eSUu779B4/edit?usp=sharing)\n\ngo to the survey paper section in the sheet in that you will see images   \nI need help with that"
    },
    {
      "id": "l7hppvy",
      "body": "[https://docs.google.com/spreadsheets/d/1nHmTpgdgCgxuHdYcATvDss6cQBnaS5cn34eSUu779B4/edit?usp=sharing](https://docs.google.com/spreadsheets/d/1nHmTpgdgCgxuHdYcATvDss6cQBnaS5cn34eSUu779B4/edit?usp=sharing)  \ngo to the survey paper section i need help w that"
    },
    {
      "id": "l7hpqqm",
      "body": "Bro, not every team **has to publish 2 papers**. Maybe some guides have told so in CSE.   \nAtleast in ECE, its only paper thats all"
    },
    {
      "id": "l7hqgl7",
      "body": "You mean, you want to copy these images and paste in your survey paper draft? Or do u want to draw those yourself and then copy your *drawn image* into your survey paper draft?   \n  \nThen, Are u using latex?"
    },
    {
      "id": "l7hsmoe",
      "body": "So basically my survey paper I am writing it in overleaf on a template so now in that I want to add pics .\nBut I can't just add pics from others papers I'll get copyrighted I need to make my own for my own model so for that i need ur help as to how should I make it and what tools should I use to make it"
    },
    {
      "id": "l7hsnor",
      "body": "Ya it's a latex editor"
    },
    {
      "id": "l7htmpb",
      "body": "You can make all those diagrams using draw.io itself. I've used it to create diagrams for my papers. There isn't any automated tool as far as I'm aware that makes these diagrams. A lot of researchers also use powerpoint to make the figures and then export them."
    },
    {
      "id": "l7hu18c",
      "body": "As suggested by others, you can use [draw.io](http://draw.io) then, it seems to be good"
    },
    {
      "id": "l7hu7dr",
      "body": "Ohk"
    }
  ]
}