{
  "id": "1dacrki",
  "title": "pes cs rr vs vit vellore cs",
  "content": "ive booked a seat in both the colleges, will be paying similar fees if i got to any of them.i think the placements r also similar.  \njust wanted to know what you guys would prefer and why?  \nty is advance <3",
  "metadata": {
    "author": "crytios",
    "url": "https://www.reddit.com/r/PESU/comments/1dacrki/pes_cs_rr_vs_vit_vellore_cs/",
    "permalink": "/r/PESU/comments/1dacrki/pes_cs_rr_vs_vit_vellore_cs/",
    "score": 16,
    "created_utc": 1717772136,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l7jf7yo",
      "body": "cfbr"
    },
    {
      "id": "l7jgvr8",
      "body": "cfbr"
    },
    {
      "id": "l7jh7ot",
      "body": "Placements are similar 😂"
    },
    {
      "id": "l7jhsn7",
      "body": ">think the placements r also similar\n\nKuch bol dunga  tho vivaad ho jayega"
    },
    {
      "id": "l7jizat",
      "body": "I'd definitely recommend PES for the following reasons  \n1) You're getting cse in the main campus , placements are very good. It's in Bangalore which is the IT hub so u have better exposure and internship opportunities\n\n2) Not worth paying that much fee for VIT because the peer group there isn't great , not to mention the weather too haha ( Peer group because they have 1k rankers as well as 50k rankers in the batch) and PES cse is mostly the under 1k rankers only\n\n3) PES tag is very famous in Karnataka \n\n4) Campus life is not at all great or any better in VIT because it's rules are way stricter , even the curfew timings are almost 2 hours earlier comparatively.\n\nJust another suggestion : Have you tried for CSE at Manipal main campus too?"
    },
    {
      "id": "l7jkt7w",
      "body": "Wdym"
    },
    {
      "id": "l7jl3se",
      "body": "Huh isn't there a huge chunk of management seats?"
    },
    {
      "id": "l7jlq89",
      "body": "This ain’t LinkedIn bruh 😂\nUpvotes the only way you can increase reach"
    },
    {
      "id": "l7jmgc4",
      "body": "If fees is same, for CS, definitely PES!\nAs its located in Blr, location matters too much in this field buddy\nIf uh would have asked for other branches, then vit would be the perfect and!"
    },
    {
      "id": "l7jntyn",
      "body": "He means pes is better"
    },
    {
      "id": "l7jxhb5",
      "body": "didnt get cs main campus rip"
    },
    {
      "id": "l7jy1js",
      "body": "What is s ki jagah c"
    },
    {
      "id": "l7k1xok",
      "body": "Hey, pes ec campus cse vs manipal cse?"
    },
    {
      "id": "l7k2hhq",
      "body": "This is reddit sir. Not Linkedln"
    },
    {
      "id": "l7k8vt5",
      "body": "Yall Mfs just see stuff and copy it without even knowing how shit works"
    },
    {
      "id": "l7k8zg4",
      "body": "The placements are bad in vit? Damn\nI thought it was good for cs atleast "
    },
    {
      "id": "l7ko1i0",
      "body": "Take pes, pes crowd and coding culture is definitely better than manipals"
    },
    {
      "id": "l7l3d1j",
      "body": "What are you yapping nigg? Vit tag>>pes tag. And under 1k in pessat where 7k write and vit 20k among 3 lakhs."
    },
    {
      "id": "l7l8zz8",
      "body": "Whats wrong with you 💀"
    },
    {
      "id": "l7lb4a2",
      "body": "No"
    },
    {
      "id": "l7mb23b",
      "body": "Placements are way bad in vit Vellore cs than pes cs , a simple comparison would be the tier system of companies \nAt pesu\nT1 :12+lac\nT2:5-9lac\nT3: <5lac\nDream :Apple (60+ lac CTC)\n\nAt VIT: \nDream offer :9+ lpa \nT1: somewhere around range of 5-9lpa not sure\n\nThe concept is if you get T1 offer at pesu you get locked from placements till you get dream.Also you can go for T1 if you hold a T2 company offer \nIn Vit same ,if you get dream offer you're done but the range is lesser"
    },
    {
      "id": "l7mcte4",
      "body": "Choose Manipal only if it's main campus. Else pick PES"
    },
    {
      "id": "l7mdk3s",
      "body": "Thanks bro, I was so confused between those two frfr"
    },
    {
      "id": "l7n3bt2",
      "body": "PES CS any given day"
    },
    {
      "id": "l7n3fmf",
      "body": "nigga find me a single VIT student that would recommend their college lmaoo  \nI have family at vellore cse who would tell me to take any college other than VIT for so many reasons. I can list them out if you really want."
    },
    {
      "id": "l7n8fab",
      "body": "Tff do u mean vit tag, no private Institute has tag other thn bits \nAlso good luck with ur delulu"
    },
    {
      "id": "l7nasgt",
      "body": "U just talked about tag so I mentioned vit has a better brand value and yeah, I'm sorry I ain't no 3 digit ranker 😔😔😔😔"
    },
    {
      "id": "l7nbic7",
      "body": "Thanks I suck at Hindi"
    },
    {
      "id": "l7ogpwk",
      "body": "u guys are just delusional we're not,thatsall and btw non blr peeps in vit wouldnt have known what pes is until those suicides so stop acting relevant"
    },
    {
      "id": "l7ousw1",
      "body": "Bruh trust me i was in vit for a month last year before coming here after cet counselling, no1z excited to be at vit, and yea vit suicides wud never cm out public so they do a great job.... "
    },
    {
      "id": "l7plbjm",
      "body": "I'm there in vit from a year😎"
    },
    {
      "id": "lce6e68",
      "body": "Could you list out some cons of vit vellore except for huge student intake? I also have cs but at ec campus and was getting vit too but didn't take."
    },
    {
      "id": "m8r3t4x",
      "body": "How uninformed and confident."
    }
  ]
}