{
  "id": "1dahl1x",
  "title": "PES ec cse or mit manipal cce/IT",
  "content": "**hey I am really confused at this point which one would be better...**",
  "metadata": {
    "author": "Unusual_Sky5634",
    "url": "https://www.reddit.com/r/PESU/comments/1dahl1x/pes_ec_cse_or_mit_manipal_cceit/",
    "permalink": "/r/PESU/comments/1dahl1x/pes_ec_cse_or_mit_manipal_cceit/",
    "score": 1,
    "created_utc": 1717783930,
    "flair": "PESSAT/Admission",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l7kdjiy",
      "body": "copied from u/rowlet-owl 's [comment ](https://www.reddit.com/r/PESU/comments/1d2c6xi/comment/l5zumuy/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)\n\n>I would recommend Manipal over PES. Both are pretty similar when it comes to placements but unfortunately at this moment all PES has are its placements and location advantage. Manipal offers more opportunities to build a good profile, a better campus & campus life with better campus clubs and other events, lesser academic rigour and stress, a slightly better reputation and as you mentioned, slightly better placements too. The only disadvantage would probably be the fees and the location, however IMO these are not crucial factors. UG is an investment, and it is important to invest wisely to get the best ROI."
    },
    {
      "id": "l7mxvio",
      "body": "but we are comparing cse with cce/IT here"
    },
    {
      "id": "l7my56y",
      "body": "u/rowlet-owl do u still agree?"
    },
    {
      "id": "l7n0f73",
      "body": "If you're interested in CCE (which to the best of my knowledge is a combination of CS + ECE), only then pick CCE at Manipal.\n\nIf you're interested in CS only, the you'll need to look into the syllabus of IT and CS at Manipal. As far as I remember, they are almost the same with only a handful of changes. Most people consider them equivalent. If that is the case, then pick Manipal. But if you see that the courses are very different, then opt for PES CS."
    },
    {
      "id": "l7nw9f9",
      "body": "I dont like ECE and all those communication stuff  \nI comared the syllabus for manipal,  yes differences are there for IT and cse but im not very knowledgeable about all this and I would most probably be doing a masters in cse and I dont want IT to affect that... I would need little help"
    },
    {
      "id": "l7obwo9",
      "body": "Sure, I can help. You can DM me."
    }
  ]
}