{
  "id": "1daq7pd",
  "title": "How's PES Electronic City campus for CSE?",
  "content": "Most of my cousins and seniors are suggesting me to join PES due to it's brand name but I'm worried about the faculty and environment in EC campus due to the negative opinions coz of the recent suicide cases. Plz give an honest opinion ",
  "metadata": {
    "author": "Acrobatic-Ad-4095",
    "url": "https://www.reddit.com/r/PESU/comments/1daq7pd/hows_pes_electronic_city_campus_for_cse/",
    "permalink": "/r/PESU/comments/1daq7pd/hows_pes_electronic_city_campus_for_cse/",
    "score": 8,
    "created_utc": 1717806524,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l7m1l1k",
      "body": "Has a better campus than RR(imo RR is really cramped and crowded) cse department is decent and a great crowd of people, but you will be under a lot of academic pressure and the teachers can be assholes. Placements are combined so no issues there and we occasionally will have diss tracks on each other."
    },
    {
      "id": "l7n7onf",
      "body": "You can find a comparison of the campuses on the [FAQs](https://bit.ly/pesu-faq).\n\nBut to summarise, they are objectively as good as RR: same placements, same syllabus, same tests/exams and unfortunately also similar quality of average faculty. The only things different about the EC campus are subjective ones: smaller fests, not as fancy a campus as RR (but this is also because RR's current iconic building was constructed only a year ago and is brand new), and fewer clubs. However, it also has a couple of advantages over RR being a more spacious and open campus and a significantly better tech culture and CS clubs.\n\nDon't use the suicides as the benchmark for comparison since this year has been an extreme outlier. Before this year, the last incident was in 2012. Yes, there is the rare issue of someone getting harassed for unnecessary reasons but most graduates as well as current students can vouch for the fact that although most profs suck at their jobs none of them care enough to pick on you. There are also some good profs still in college who care about students, and they are pretty friendly with students. Most harassment stories only surfaced in an emotional reaction to the incidents this year, until then there had been almost no stories. Yes, incidents have happened but they are not the norm, so there isn't anything to be afraid of."
    },
    {
      "id": "l7oiig7",
      "body": "Diss tracks got me 😭"
    }
  ]
}