{
  "id": "1dc0fdm",
  "title": "Help ",
  "content": "I am planning to join pes and I will get a seat but in third round of cet counselling.I heard that I might miss classes.So if anyone has any idea pls let me know.",
  "metadata": {
    "author": "Ok_Survey_5718",
    "url": "https://www.reddit.com/r/PESU/comments/1dc0fdm/help/",
    "permalink": "/r/PESU/comments/1dc0fdm/help/",
    "score": 7,
    "created_utc": 1717957447,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l7unbc3",
      "body": "Classes for third-round students will begin immediately after the third round concludes. They will start from first topic only in all subjects."
    },
    {
      "id": "l7uo866",
      "body": "Yes, you will miss a few weeks worth of classes. You will be put in a separate section with only 3rd round CET students.\n\nThey usually make for it by rushing portions and keeping classes till 4 everyday."
    },
    {
      "id": "l7v4heo",
      "body": "Are PESSAT students and CET first round students given different classes?"
    },
    {
      "id": "l7vwb75",
      "body": "Ig it's too late to tell you this but goddamm don't join PES."
    },
    {
      "id": "l7wd3s8",
      "body": "Nope"
    },
    {
      "id": "l7wkpm9",
      "body": "Can u pls tell the reasons , it will help me decide bw rv and pes"
    },
    {
      "id": "l7xb0n5",
      "body": "What are your options? If its RV CS then obviously go for RV."
    },
    {
      "id": "l7xhs7v",
      "body": "Thanks for the help :)"
    },
    {
      "id": "l7xpa6b",
      "body": "my options are rv ise and pes cse"
    },
    {
      "id": "l7zaqct",
      "body": "Rv ise anyday, pes doesn't have any advantage over rv "
    },
    {
      "id": "l7zc444",
      "body": "I'd suggest comparing the syllabus before deciding this because the syllabus can affect a lot of things, especially if you intend to pursue Masters later. But if the goal is only placements, pick RV."
    },
    {
      "id": "l7zugi0",
      "body": "I mean how does pesu syllabus benifit us for masters? \nAlso I always wondered, since pes is considered much more academically hectic and tough then other colleges\n\n\nDoes it actually have some sort of benifit at the end of the day, or it's just extra load\n, since most of the stuff important for placements wouldn't be covered entirely in syllabus itself"
    },
    {
      "id": "l7zvkn9",
      "body": "It's not about which is more hectic (although PES definitely is more hectic), it's about which one covers all base requirements to ensure you don't run into issues during MS applications. If you care only about placements, then it doesn't really matter which you pick. And yes, the syllabus isn't enough to get you placed, you need to work on yourself beyond the book.\n\nI've commented about MS related coursework requirements in detail here: https://www.reddit.com/r/PESU/s/EpUOGln8CM"
    },
    {
      "id": "l8xbhob",
      "body": "Faculty is really really really bad. PES will try to mint money wherever and whenever possible. I'm sure you must have heard about all the suicide cases as well. It'll be like 4 years of torture and schooling again. You'll have no freedom of your own. The only good thing I see in the end is that a lot of good colleges come to PES but the job market is also an iffy situation rn and all of this at the cost of pulling your hair apart on a daily basis for 4 years. \n\nI can't say anything about rvce. I have no context."
    }
  ]
}