{
  "id": "1dchf02",
  "title": "What tier does pesu fall into when compared to top colleges like iits, nits and bits?",
  "content": "Title",
  "metadata": {
    "author": "Few_Distance7092",
    "url": "https://www.reddit.com/r/PESU/comments/1dchf02/what_tier_does_pesu_fall_into_when_compared_to/",
    "permalink": "/r/PESU/comments/1dchf02/what_tier_does_pesu_fall_into_when_compared_to/",
    "score": 12,
    "created_utc": 1718011703,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l7xvl2i",
      "body": "Tier 3"
    },
    {
      "id": "l7xw636",
      "body": "Why is that so? Isn't pes u in top colleges in bangalore?"
    },
    {
      "id": "l7xwc96",
      "body": "Not in India right? Check the nirf ranking. Doesn't matter if they're autonomous they just don't have the facilities and environment like most IITs and NITs do."
    },
    {
      "id": "l7xwkq8",
      "body": "All private colleges in India are tier 3/4 except BITS"
    },
    {
      "id": "l7xwnyd",
      "body": "Oh okay"
    },
    {
      "id": "l7y75lt",
      "body": "Tier 2 easily man , if u think pesu is bad take a look at like actual tier 3 colleges ,shit placements, shit infra, shit faculty compared to that pesu is much better...and has some reputation in Karnataka atleast"
    },
    {
      "id": "l7ya701",
      "body": "🙏"
    },
    {
      "id": "l7yxufp",
      "body": "Near the trailing end of tier 2"
    },
    {
      "id": "l7yy8ot",
      "body": "Tier 2"
    },
    {
      "id": "l7yyx4l",
      "body": "whats a top tier 2 or near tier 1"
    },
    {
      "id": "l7z8o7w",
      "body": "Ig.Jadavpur( before comming to abuse me go and see State quota, infrastructure and placement , ha fees low hai but kya ukhad le usse) , new iits , lower and north eastern nits"
    },
    {
      "id": "l7z9hni",
      "body": "ight"
    },
    {
      "id": "l812tqh",
      "body": "North eastern nits se cse/ece acchi hoti hai?"
    },
    {
      "id": "l82pwgt",
      "body": "Lots of suicides tho more than normal"
    },
    {
      "id": "l82ytkw",
      "body": "nirf has very weird rankings. vit and amrita are one of the top colleges according to them. better than many NITs and BITS"
    },
    {
      "id": "l82zqp9",
      "body": "They rank universities based on the achievements and number of research papers published by the universities."
    },
    {
      "id": "l831o3i",
      "body": "it's not just that, it's based on a lot of criteria. but the outcome of the ranking is clearly not good though"
    },
    {
      "id": "l83m110",
      "body": "I don't understand why there's downvotes for this. When I've applied for jobs in India as well as Masters programs abroad, PES has always been considered  as Tier 3.\nOnly within Bangalore it may be considered any higher."
    },
    {
      "id": "l83m7gz",
      "body": "They just left this 🧠 in their washroom."
    },
    {
      "id": "l8e1y5q",
      "body": "Wht do u consider tier 2"
    },
    {
      "id": "l8e3ah2",
      "body": "This isn't a personal opinion, it is a fact based on global opinions. \nTier 1: Old IITs (Madras, Delhi, Kanpur, etc.), BITS (Pilani only, IIIT (Hyderabad, Allahabad, Bangalore), some NITs (Trichy, Surathkal, etc.).\n\nTier 2: Remaining NITs, IIITs, BITS campuses. \nTier 2.5?: MIT Manipal, VIT Vellore, SRM, etc., RVCE and MSRIT would come under this too\n\nTier 3: PESU, BMS, Dayanand Sagar (in Karnataka)\n\nA good detailed realistic list can be found here: \n[Choosing Engineering College ](https://workat.tech/general/article/choosing-engineering-college-branch-ageyubs2sxip)"
    },
    {
      "id": "l8e6ga0",
      "body": "Bro what are you smoking , srm in tier 2 , pes and bms in tier 3 wow..."
    },
    {
      "id": "l8e76lt",
      "body": "That's why I put the Tier 2.5+? They're not tier 2. Please read before lashing out, hope you're doing well. Added a link for reference too so, good luck with that attitude!"
    },
    {
      "id": "l8e7e15",
      "body": "Sorry for being rude but this link has no credibility, each website has its own stuff"
    },
    {
      "id": "l8e7ln1",
      "body": "Yes, because the tiers themselves are very subjective. I have tried to compile a short list of examples based on my own and my friends experiences. This tier list is more or less what any higher education counselor will tell you. Companies outside Karnataka as well, same."
    }
  ]
}