{
  "id": "1dcm8ny",
  "title": "I got 3.3k Rank, can I get ECE in the main campus next round?",
  "content": "My other option is Manipal Institute of Technology, Manipal where I got 3.7k rank, I may be able to get CS with FinTech there, but it would be way more expensive since I live in Bangalore and would have to stay in a hostel there and stuff. Any help is appreciated!",
  "metadata": {
    "author": "Gold-Put4888",
    "url": "https://www.reddit.com/r/PESU/comments/1dcm8ny/i_got_33k_rank_can_i_get_ece_in_the_main_campus/",
    "permalink": "/r/PESU/comments/1dcm8ny/i_got_33k_rank_can_i_get_ece_in_the_main_campus/",
    "score": 6,
    "created_utc": 1718028089,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l7z2sv8",
      "body": "If the seats are there well you might but do you really wanna do ece or are you just taking ece cause you want to join the main campus, cause ece is harder than cse and the placements are pooled together. So I don't see the point of taking ece just for the sake of getting into the main campus."
    },
    {
      "id": "l7z7hj8",
      "body": "I've heard that switching from ECE to CSE in the first year is possible if your GPA is high enough. My idea was to get ECE at least since I would essentially get the same placement opportunities as the CSE students and study a similar course as they are. Please let me know if I am wrong though."
    },
    {
      "id": "l7z7y9y",
      "body": "Yep it is possible but mate you will have to slog like anything to get a branch change, as a ece you can sit for cse placements there is no problem there at all."
    },
    {
      "id": "l7z9oqr",
      "body": "You can switch to RR CSE only if your CGPA is above 9.5 in the first year, and this is again only possible if people give up seats. Add these factors together and you will realise that there is a very small chance of this happening. On the other hand, you can switch to CS at EC campus with an 8.5-9. Don't choose ECE just because its the RR campus, its a brain dead move. Branch over campus always, especially because your campus matters for 3 years at most but your branch will affect you in the longer run.\n\nAnd you should only pick ECE if you are interested in it. If you are interested in CS, pick the one closest to CS (in this case, AIML), such that you get to study the course most related to your interests even if you cannot switch branches."
    },
    {
      "id": "l7zd6zm",
      "body": "Oh wow. Would you know what kind of gpa I would need to move to CSE? Thanks for helping me out again stranger :))"
    },
    {
      "id": "l7zdvso",
      "body": "College states 8.5 realistically 9.0 to change to aiml/ cse in ec campus 9.5+ in RR campus, it also depends on your batch and how many seats are Available if they don't have seat no branch change. No problem you bout to be my junior so you gonna suffer 🥰"
    },
    {
      "id": "l7zk1at",
      "body": "ECE 2023 grad here. Companies will always prefer a CSE student for core software jobs. ECE peeps can answer the same technical questions with a little prep, but that's only useful at the interview round where it's ignored. For all placement exams, especially if its a core software job, the shortlist will be almost always CSE only. \n\nDo not take ECE if you are dead set on a software engineer role."
    },
    {
      "id": "l80gmbj",
      "body": "Thank you so much. Btw, I did get CSE AIML in the EC Campus in the first round of counseling, so that is the back up!"
    },
    {
      "id": "l80gwdp",
      "body": "As long as y'all don't sing that Meet The Grahams cover 😭"
    },
    {
      "id": "l80h4tl",
      "body": "Thank you bro. Ik this is a dumb question, but isn't the point of engineering to understand the hardware behind computers anyway - whether you take CSE or ECE won't most of the course be more aligned to hardware? Am I missing something, or have I not understood that correctly?"
    },
    {
      "id": "l8309z3",
      "body": "Engineering isn't only about computers, just like how CSE isn't about coding/programming. Computer Science involves a lot of fields from hardware to software, and is focused on solving problems using these concepts. We implement these solutions (usually) through instructions, which are code."
    },
    {
      "id": "l832wml",
      "body": "Thank you for clearing that bruv! Appreciate it."
    }
  ]
}