{
  "id": "1dcwrh0",
  "title": "Is RV University better or Reva PESU for bba?",
  "content": "Having conflicting thoughts between RV, PES and Reva. \nOnly issue i have with pesu is that I'll have to wear a uniform for 4 years if I'm going for bba",
  "metadata": {
    "author": "ISTLA_18",
    "url": "https://www.reddit.com/r/PESU/comments/1dcwrh0/is_rv_university_better_or_reva_pesu_for_bba/",
    "permalink": "/r/PESU/comments/1dcwrh0/is_rv_university_better_or_reva_pesu_for_bba/",
    "score": 1,
    "created_utc": 1718053931,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l80uwq5",
      "body": "Wait, do Engineering students have to wear a uniform as well?"
    },
    {
      "id": "l80xpo8",
      "body": "I don't think so.\nAs far as I know, only management students have to wear uniform"
    },
    {
      "id": "l8119m4",
      "body": "Nope"
    },
    {
      "id": "l82jh9v",
      "body": "Not sure about RV and Reva but my friend from bba at PES says its too much like a school, super monotonous and teachers drain any liking you might develop for the subjects. There are too many worksheets and case studies so ig if you're someone who can handle the workload then you can give it a try, but maybe keep PES as a last option"
    },
    {
      "id": "l82rqs0",
      "body": "The only uniform we need is the Pride of PESU :vckek:"
    },
    {
      "id": "l8jozzb",
      "body": "For BBA, best choice should be Christ, jain, SJCC rather tech universities."
    },
    {
      "id": "lac5gys",
      "body": "Is Jain better or PES for BBA (I'm ok at handling work load as such)"
    },
    {
      "id": "ladd3rn",
      "body": "Honestly it depends on the crowd that you're more comfortable with, jain kids tend to be a bit more relaxed than pes kids (mainly because of the school type environment) so I'd say visit both campuses and interact with some students and hopefully you'll find it easier to decide"
    },
    {
      "id": "lbcr7or",
      "body": "I got into cms bc pes was far😭😭\nThanks tho"
    }
  ]
}