{
  "id": "1dd5bj5",
  "title": "Need advice. #Culture at PES. #Pune vs Banglore . ",
  "content": "\n\nHey everyone,\n\nI am a student living in Pune currently and I'm confused about deciding between VIT Pune (CSE) and PES University Bangalore (CSE). I'm especially interested in hearing from students who have moved from Pune to colleges in Bangalore, but all inputs are welcome!\n\nI'm trying to understand the cultural differences between the two places. How is the overall atmosphere at PES University? I've heard a lot about PES being amazing for internships and job placements, but I also want to know if they provide support for students aiming for a master's degree, especially abroad. \n\nAdditionally, how are the extracurricular activities at PES? Some people have mentioned that living in a hostel might not leave much time for these activities, like online courses or learning a new language, which are important for applying to foreign universities. \n\nFor those staying in hostels at PES:\n- How much free time do you get?\n- Does PES provide single rooms, or do we get to choose our roommates?\n- Is finding food a hassle? I've heard mixed reviews about the quality of hostel food, with some saying it's so bad they often eat out. Is this true?\n\nEven if you're currently studying at PES and not from Pune, feel free to share your experiences. Any advice or insight would be really helpful!\n\nThanks in advance!\n",
  "metadata": {
    "author": "Disastrous_Memorry",
    "url": "https://www.reddit.com/r/PESU/comments/1dd5bj5/need_advice_culture_at_pes_pune_vs_banglore/",
    "permalink": "/r/PESU/comments/1dd5bj5/need_advice_culture_at_pes_pune_vs_banglore/",
    "score": 10,
    "created_utc": 1718079087,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l82tfbj",
      "body": "Note: I am not someone who moved from Pune to Bangalore. So this answer does not cover the angle you might be looking for.\n\nI recommend PES CS over VIT Pune, mainly because it is not the main VIT campus and because of the ridiculous batch size at VIT. Everything from placements to on-campus opportunities will be extremely competitive at VIT.\n\nRegarding atmosphere, its a pretty chill scene here, but it depends on how you take competition. Atleast 60% of students at PES are those who were born and/or raised in Bangalore and come from well-known schools in the city. PES at one point in time used to be a big NPS and DPS reunion, but I am not sure if that's the case anymore. Regardless, PES is still considered one of the best colleges in the state, consistently considered right behind RV. Given this, the crowd is also pretty competitive and almost everyone has a goal in mind, be it Masters or placements. Most people are serious about their career and are constantly trying to reach their goals. The crowd, including its alumni (which have gone on to work at FAANG or pursue MS from top Unis like CMU and the like) is one of PES' top advantages.\n\nRegarding support for a Masters degree, refer to [this comment](https://www.reddit.com/r/PESU/comments/1dbrk3w/comment/l7tadiz/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button) for details.\n\nPES is however academically rigorous and hectic, way more than other colleges, but it does not mean that you cannot take out time for other activities. [There is this other detailed comment](https://www.reddit.com/r/PESU/comments/1d66ywv/comment/l6qhycx/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button) that highlights about time management and pursuing other interests alongside PESU. I would also go on to say that most grads (including me) have found that the academic rigour helped in the longer run because it helped us not only build stronger profiles with better projects and academic credentials, but also helped us in the industry by aiding us to manage our time well and quickly catch with to industry delivery standards.\n\nI wasn't in hostel, so someone else will need to fill in more details (or you can check the [FAQs](https://www.reddit.com/r/PESU/comments/14c1iym/faqs/), or search this subreddit). But from whatever limited information I know: yes, you do get time (covered already), PES does provide single rooms but not for freshmen, and you might be able to choose your roommate, Finding food isn't a hassle since there are lots of places around campus to eat out at, including the infamous sutta gully.\n\nMy suggestion would be to come with an open mind. Undergrad is a new chapter in your life and its best to come in without expectations. You can join the PESU Discord server (link in FAQs), meet seniors/alumni and post other questions if you have any."
    },
    {
      "id": "l82wkdy",
      "body": "I agree with all this, I would add about the hostel stuff, I stayed for 2 years(Covid batch), your first year blocks are different and reserved only for first years. They are mainly 2/3 sharing rooms with some with attached washroom and some with common washrooms. The number of hostel rooms available are too less compared to the batch size of the college, so complete the process faster to get a room of your choice. The rooms are decently spaced with decent amenities, are cleaned on alternate days. From second year onwards you can get single rooms but they come with common washrooms. The curfew time is till 9/10pm (you can’t go out after 9pm but can enter by 10pm). Coming to the food you have three messes which provide a mix of north and South Indian food, there will be a monthly selection process of the messes which will be based on fastest fingers first. The food tends to get monotonous after a point but you do have many eateries right besides college aka as sutta gully which are decently priced. Hostel is where you make your true friends and can enjoy the college life truly if you find the right mix of people. Coming to the free time it depends on how you utilize it, the boy hostel in RR campus is right inside the college you there will be no travel time. College usually gets over 3ish, so it depends on how you utilise your time. Now with the 2 ISA system back you will be having more time. If you have any more doubts feel free to DM me."
    },
    {
      "id": "l82xfzf",
      "body": "Bro vit Pune is not vellore institute of technology its vishwakarma institute of technology"
    },
    {
      "id": "l82xj9r",
      "body": "Bro vit Pune is not vellore institute of technology its vishwakarma institute of technology"
    },
    {
      "id": "l82y8h8",
      "body": "Yes uh. Lol my bad OP, I have no clue about this college."
    },
    {
      "id": "l836w3j",
      "body": "bro would you recommend pes EC campus cse over vit vellore cse (both are almost same fees), some people told me that only pes RR was worth it over vit main campus but people here said the placements were centralized only so Im not too sure..."
    },
    {
      "id": "l83j9k7",
      "body": "Yes I would. There is no difference between the two campuses. Check the FAQs for more details."
    },
    {
      "id": "l86f0ec",
      "body": "Then don't make comparisons and don't answer his question? I'm not from either of these colleges and idk why this post was recommended to me but why answer in such detail if you \"have no clue about this college\"?"
    },
    {
      "id": "l87m7wj",
      "body": "The only comparison that exists is in the second paragraph, between PES and VIT Pune, and this was cleared up after I posted my answer. OP wanted information on other things at PES and my comment already addresses those in detail. Maybe if you read the answer properly you wouldn't have asked this question."
    }
  ]
}