{
  "id": "1decu03",
  "title": "Bsc psychology ",
  "content": "I'm interested in bsc psychology and I wanted to know how it is in pesu and also about the campus life there...thank you ",
  "metadata": {
    "author": "_eternally_confused_",
    "url": "https://www.reddit.com/r/PESU/comments/1decu03/bsc_psychology/",
    "permalink": "/r/PESU/comments/1decu03/bsc_psychology/",
    "score": 4,
    "created_utc": 1718214611,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l8borzs",
      "body": "Not a senior tho, but joining there this year and having talked to a couple of seniors the course is good, but planning and management is not, you have to plan all by yourself, it is hectic. But exposures are good"
    },
    {
      "id": "l8dgqrl",
      "body": "Thank you...how was the interview? Was it difficult?"
    },
    {
      "id": "l8dt9fn",
      "body": "It was moderate you got to know what your saying, wbu are yous selected?"
    },
    {
      "id": "l8e61h1",
      "body": "No, i was planning to apply to pes..so i wanted to know how it is there before applying"
    },
    {
      "id": "l8emehc",
      "body": "It would be fairly decent, people would be nice there's a lot of intake of people so it all depends on the friends you make, have you applied elsewhere?"
    },
    {
      "id": "l8eqdu8",
      "body": "I have written cuet...I wanted to apply for christ but I got to know about it after they closed applications...so i thought of pes for backup"
    },
    {
      "id": "l8f9ouf",
      "body": "Same man, I wrote christ I got Delhi ncr but couldn't join due to  some issues, other colleges like mcc have ba which is not what I wanted, ramaiah has bsc but couldn't find reviews on it"
    },
    {
      "id": "l8ft9bu",
      "body": "Can relate to u so much... it's tough to find bsc psychology"
    },
    {
      "id": "l8fwwmb",
      "body": "Take the interview, if you get in it would be honestly fine"
    },
    {
      "id": "lscc0xk",
      "body": "Hey... Which clg did u choose now?"
    },
    {
      "id": "lsmswvs",
      "body": "Pesu"
    },
    {
      "id": "lsx6fw2",
      "body": "How's pes? Is it worth joining?"
    },
    {
      "id": "lsx6j9q",
      "body": "How's pes? Is it worth joining?"
    },
    {
      "id": "lt0d0wf",
      "body": "I kinda like it ,but it has its flaws"
    },
    {
      "id": "lt1ckbn",
      "body": "Currently I'm in 12th pcmb.... Planning to join pes next year for bsc psychology... Is it worth joining or should I check any other universities?"
    },
    {
      "id": "lt6lukz",
      "body": "I honestly think course is decent and all ,but for the best all around thing I’d say try Christ first and ask people their for the course ,from what I heard it’s chill and good but also attendance is more and it can get hectic a lot too ,Pes is also good option ,if you can’t get in"
    },
    {
      "id": "lt7j4b1",
      "body": "Christ was my first option... But christ kengeri is too far.. I would waste half of my day in travelling... And ppl said Christ bgr isn't tht great... So confused abt it 🫠 MCC and St Joseph doesn't hv bsc psychology..."
    },
    {
      "id": "ltamoyt",
      "body": "Yeah that’s what I thought too"
    },
    {
      "id": "lte9szb",
      "body": "So what's the criteria to get into pes? What's the percentage required?"
    },
    {
      "id": "ltirmmy",
      "body": "should be above 60 , have to Pessat ig from next year or maybe not ,it was not their for me and you have to give an interview"
    },
    {
      "id": "ltwoq3q",
      "body": "How was the interview? Wt type of questions do they ask?"
    }
  ]
}