{
  "id": "1dewrv3",
  "title": "Help me decide!",
  "content": "PES CS or BMS CS (specialisation) what to prefer and best for placements I can get RVCE ECE can I prefer it too?? \nPlease help me to choose the best 🥲",
  "metadata": {
    "author": "AbbreviationsFar6504",
    "url": "https://www.reddit.com/r/PESU/comments/1dewrv3/help_me_decide/",
    "permalink": "/r/PESU/comments/1dewrv3/help_me_decide/",
    "score": 5,
    "created_utc": 1718278281,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l8etsee",
      "body": "Always go for core CS course bro there will be a lot of specialisations which you can explore and decide later which one you want to follow up."
    },
    {
      "id": "l8evtoa",
      "body": "It's close.\n\nTake pes cs if you're fine with the population and the somewhat strictness\n\nOtherwise you won't really be worse off by taking bms either. \n\nJust take the one closest to home or something"
    },
    {
      "id": "l8f2a2q",
      "body": "I am not from B'lore and I am getting these colleges through Kcet so hostel is a must for me\nThank you for your advice will look into it 😄"
    },
    {
      "id": "l8f2bz7",
      "body": "Okay thank you for your advice 😊"
    },
    {
      "id": "l8f2ssy",
      "body": "What about RVCE ECE ?:"
    },
    {
      "id": "l8f31zh",
      "body": "See no doubt RVCE is a good college but your comparing two different branches here. If your good at mathematics and have interest in electronics go for ECE or else you can go with CSE itself."
    },
    {
      "id": "l8f38ga",
      "body": "Ok thank you bro !"
    },
    {
      "id": "l8fd5b6",
      "body": "Ece is looking much more stable in job wise compared to cs but a masters would be preferable"
    },
    {
      "id": "l8fvnpx",
      "body": "Take ECE only if you are interested in ECE. \n\nIf you are interested in CS and are getting these through KCET, then pick PES CS. I would recommend picking core CS over a specialisation, more details in the FAQs: [https://bit.ly/pesu-faq](https://bit.ly/pesu-faq)"
    },
    {
      "id": "l8g9egk",
      "body": "My dead ass read it as “Help me suicide!”"
    },
    {
      "id": "l8gafmw",
      "body": "Damnn😂"
    },
    {
      "id": "l8gajzx",
      "body": "Btw what to choose BMS CS or PES CS? Based on placements solely \nYou from PES?"
    },
    {
      "id": "l8getgh",
      "body": "I have no clue on how good or bad bms is so i can’t say if its better than pes"
    },
    {
      "id": "l8gezg5",
      "body": "Yeah okay what about PES? How's it ?"
    },
    {
      "id": "l8gf93a",
      "body": "Its good i guess ,not bad but not great.\n\nSome of the faculty is ass tho"
    },
    {
      "id": "l8gffqa",
      "body": "Ok tq 👍"
    }
  ]
}