{
  "id": "1df0zd3",
  "title": "How do I withdraw from PESU and get the refund?",
  "content": "I got into a better college and would therefore like to get my fees refunded. Can anyone help me out? ",
  "metadata": {
    "author": "GoldPut-007",
    "url": "https://www.reddit.com/r/PESU/comments/1df0zd3/how_do_i_withdraw_from_pesu_and_get_the_refund/",
    "permalink": "/r/PESU/comments/1df0zd3/how_do_i_withdraw_from_pesu_and_get_the_refund/",
    "score": 4,
    "created_utc": 1718290576,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l8fvcl1",
      "body": "You can leave PES, but PES will never leave you.\n\nJokes aside, you will need to visit the admission department and raise a request there. Carry whatever documents they provided."
    },
    {
      "id": "l8g43nu",
      "body": "Dude like physically wtf?"
    },
    {
      "id": "l8g4ezz",
      "body": "As I said, PES will never leave you lmao"
    },
    {
      "id": "l8g5ydu",
      "body": "Which college BTW?"
    },
    {
      "id": "l8g7pyh",
      "body": "DM? I don't want to cause a stir here."
    },
    {
      "id": "l8gi418",
      "body": "Yo, you can't say that and disappear. This subreddit loves some drama"
    },
    {
      "id": "l8gjlfr",
      "body": "ayy I wanna know which iit you got"
    },
    {
      "id": "l8gjn3a",
      "body": "hahahaha well let's just say it's a college that's in Karnataka and not in Bangalore"
    },
    {
      "id": "l8glzjm",
      "body": "Manipal👀"
    },
    {
      "id": "l8j58ak",
      "body": "There are two options \n\nIf u stay out of Karnataka u need to wait for them to write u a cheque, they'll say they need some time(days mostly) as they need to get some permissions or some shit(They'll mail u the refund cheque through mail)\n\nIf u stay in banglore u can just go there, they won't give out at that moment itself but u can demand it faster or they'll delay it as much as possible"
    },
    {
      "id": "l8jywr8",
      "body": "👀🔪"
    },
    {
      "id": "l8jz1ml",
      "body": "Oh God. I live in blr so I might as well pester them. Why does it have to be this way 😭"
    },
    {
      "id": "l8kz2w1",
      "body": "PES-ter them indeed"
    },
    {
      "id": "mund29t",
      "body": "Did you end up getting the refund?"
    }
  ]
}