{
  "id": "1dfiecg",
  "title": "EC CAMPUS IS NOW A JAIL!!",
  "content": "Okay this is unbelievable. I don't have any more words left to say.",
  "metadata": {
    "author": "anonymous_talks_0101",
    "url": "https://i.redd.it/8fq2v93esg6d1.jpeg",
    "permalink": "/r/PESU/comments/1dfiecg/ec_campus_is_now_a_jail/",
    "score": 114,
    "created_utc": 1718339108,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l8jb72m",
      "body": "wtf is wrong with management are they fucking retarded instead of helping the students they making a fucking bird cage out of the college. fucking retards"
    },
    {
      "id": "l8je24n",
      "body": "Can I bring my DSLR to the zoo? /s"
    },
    {
      "id": "l8je8pw",
      "body": "rn animals are on break I guess, why don't you wait till August?"
    },
    {
      "id": "l8jerzj",
      "body": "Damn, thanks for the heads up. Will bring my camera and capture the specimen in a few months."
    },
    {
      "id": "l8jgiju",
      "body": "Time to make this campus viral all over Bangalore"
    },
    {
      "id": "l8ji95h",
      "body": "Omg the students are committing suicide.... Let's lock them in a cage instead of solving the actual issues."
    },
    {
      "id": "l8jkt9o",
      "body": "What's going on here? Explain."
    },
    {
      "id": "l8jl00v",
      "body": "What's going on here? Explain."
    },
    {
      "id": "l8jmhg3",
      "body": "No other Choice left for them bro the Education would have instructed them to do this As they Were 4 Sucide Cases So the UGC Would have advised them or the police would have advised them to do this"
    },
    {
      "id": "l8jmzad",
      "body": "Some of us animals are still struggling with this exhibit called ESA, you can come witness the magic if you wish to"
    },
    {
      "id": "l8jn1vv",
      "body": "This is not a college, it is jail."
    },
    {
      "id": "l8jne9a",
      "body": "Ugc gave advise to make the exams easier and open book tests, they didn't tell to close the entire campus with steel bars,but again who does what the counsil says it's generally just \"advisory\""
    },
    {
      "id": "l8jnkuz",
      "body": "I feel sorry for the juniors now"
    },
    {
      "id": "l8joiuq",
      "body": "Post it on r/bangalore. Make sure college gets so embarrassed they remove this."
    },
    {
      "id": "l8jqp8b",
      "body": "Thank God I don't have to go to jail anymore"
    },
    {
      "id": "l8jrazi",
      "body": "Theyre putting up grills because of the recent incidents of students committing suicides"
    },
    {
      "id": "l8js3pv",
      "body": "is this problem specific to ec? Isn't ec the fun one."
    },
    {
      "id": "l8jsz9p",
      "body": "Anyways, even if this not happens I am not counting myself for a free heaven ride."
    },
    {
      "id": "l8jt6y7",
      "body": "I seen them when cage was being made, I think they (cage building fellas) had some contract do before ESA results come. They were chilling on their laptop."
    },
    {
      "id": "l8jumgu",
      "body": "As an upcoming 1st sem. Student 😢"
    },
    {
      "id": "l8jx7ss",
      "body": "Can't wait :))"
    },
    {
      "id": "l8jxbzn",
      "body": "pigeon house :("
    },
    {
      "id": "l8jxknx",
      "body": "Sir this is PESU"
    },
    {
      "id": "l8jxxrf",
      "body": "On the bright side, you can finally see your friends where they truly belong - the snakes den /s"
    },
    {
      "id": "l8jy4pn",
      "body": "Will put in leave at work just for this. Which exhibit will I find you in? Bird cage in MRD or the aquatic exhibit near the lake"
    },
    {
      "id": "l8jy5jr",
      "body": "Bruh"
    },
    {
      "id": "l8jy6u4",
      "body": "What is fun in PESU?"
    },
    {
      "id": "l8jycs3",
      "body": "relatively compared to rr, rr seems cramped af."
    },
    {
      "id": "l8k0pyj",
      "body": "No way ur at it again to defend this college💀"
    },
    {
      "id": "l8k0xom",
      "body": "I would like to call it as concentration camp"
    },
    {
      "id": "l8k0yep",
      "body": "![img](avatar_exp|138199880|fire)\n\nBIRD SANCTUARY"
    },
    {
      "id": "l8k1m9t",
      "body": "Not about defending colleges\nIt’s about no other choice."
    },
    {
      "id": "l8k1p97",
      "body": "Bro if weaklings are throwing themselves off for the most trivial of reasons, college can’t help them, you can’t help them and even god can’t. This is the only solution for stupid fuckers killing themselves."
    },
    {
      "id": "l8k246q",
      "body": "What’s the actual issue here? Students being pussies and offing themselves over trivial issues. End of discussion"
    },
    {
      "id": "l8k6xuq",
      "body": "8.30 - 11.30, Mech block, animal torture exhibit, aka the exam halls. That place is literally a mental torture facility at this point given how bad my ESAs have gone. \nAfter that, the MRD Bird Cage is my preferred choice of... Uhh, cage ? \n\nPS: You've heard of Pick Your Poison. Now get ready for Pick Your Prison. Proudly brought to you by PES EC."
    },
    {
      "id": "l8kjtwz",
      "body": "good luck getting new admissions now lmao"
    },
    {
      "id": "l8kjxh2",
      "body": "My session starts in august in ec campus, please explain what happened"
    },
    {
      "id": "l8kk8kw",
      "body": "I have gotten admission in the first round of counselling, please explain what happened and why"
    },
    {
      "id": "l8km1r4",
      "body": "Makes so much sense tbh, OP should consider the suggestion"
    },
    {
      "id": "l8kvrlq",
      "body": "They turned the beautiful block into a bird cage"
    },
    {
      "id": "l8l886c",
      "body": "No shit, y'all keep jumping off"
    },
    {
      "id": "l8osikb",
      "body": "PESU's hold on the mainstream media is insane. Good luck to the clueless future juniors :')"
    },
    {
      "id": "l8qa058",
      "body": "There were 3 suicides in pes ec this year alone, \n\nThis was management's answer to that. \n\nIf u can still get something in the jee or bits counseling take that. \n\nI am sorry but this isn't a place where u should spend ur 4 years. There was already close to 0 campus life, now its a jail. Like what ????\n\nStupid ppl in management."
    },
    {
      "id": "lbllglk",
      "body": "What are they actually doing?"
    },
    {
      "id": "lhftue4",
      "body": "Is the situation the same now, are these grills removed? Got allotted ec campus cse in mock, what should I do?"
    },
    {
      "id": "lhlyqr6",
      "body": "Try for RR Campus, BMS CSE, MSRIT CSE   \nDon't think RV CE is even a question rn. \n\nif you don't get any of those clgs then PES EC isn't terrible either, sure the grills would suck but atleast you prolly won't be unemployed with choices like Dyanand sagar etc. \n\nAnyways there was never that much of \"college life\" to begin with and lots of times we just go out of campus to spend time. \n\nMoreover I think decent amount of people will forget about the grills in time but ya its certainly not better than not having grills"
    }
  ]
}