{
  "id": "1dfpvrv",
  "title": "PES EC AIML vs Manipal Data Science and Engineering ",
  "content": "What are your thoughts? Ik this subreddit us going to be partial towards PES but given that I've gotten admission only into the EC Campus and I've been hearing sm vile things about that place, what is the public opinion on the same.\n\nI've gotten admission into both the above branches fyi",
  "metadata": {
    "author": "GoldPut-007",
    "url": "https://www.reddit.com/r/PESU/comments/1dfpvrv/pes_ec_aiml_vs_manipal_data_science_and/",
    "permalink": "/r/PESU/comments/1dfpvrv/pes_ec_aiml_vs_manipal_data_science_and/",
    "score": 5,
    "created_utc": 1718368889,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l8kyc5q",
      "body": ">I've gotten admission only into the EC Campus\n\nBoth campuses are objectively the same.\n\n>vile things about that place\n\nIf you look around for poor feedback, you will hear vile things about the RR campus as well. \n\nCheck the [FAQs](https://www.reddit.com/r/PESU/comments/14c1iym/faqs/) for more info on campus differences.\n\nI would recommend PES given that the branch at Manipal is a specialised one, while at least at PES it does cover some CS coursework."
    },
    {
      "id": "l8kyubr",
      "body": "\n\n>If you look around for poor feedback, you will hear vile things about the RR campus as well.\n\nI saw a post about EC Campus being a literal cage on this subreddit 😭\n\n\n\n>I would recommend PES given that the branch at Manipal is a specialised one, while at least at PES it does cover some CS coursework.\n\nFair dude, but placements wise won't i be better off at Manipal main campus then EC Campus?"
    },
    {
      "id": "l8kzzg2",
      "body": "youll be better of at manipal , run away and have a good time, best you will get here is a good 'school' life with some smart peeps"
    },
    {
      "id": "l8l127o",
      "body": "Placements are only slightly better at Manipal. And unless I am wrong, Manipal is also more expensive. If you are from BLR, you will additionally have to pay for hostel, which is pretty expensive at Manipal.\n\nIf you think the slightly better placements justify the extra costs and questionable branch choice, then sure."
    },
    {
      "id": "l8lwidu",
      "body": "i think pes has better placements than manipal."
    },
    {
      "id": "l8m7g7p",
      "body": "Hmm, someone showed me the stats for 2024 and they were better for CS? They had like 17L avg"
    },
    {
      "id": "l8m9aiz",
      "body": "what no, it was like 12 avg."
    },
    {
      "id": "l8mayfm",
      "body": "Interesting, looks like someone in my DMs is a Manipal fan\n\n![gif](giphy|dhPG6a6SagtQk|downsized)"
    },
    {
      "id": "l8md3d5",
      "body": "lmao 17 is like nit level shit"
    },
    {
      "id": "l8mec2c",
      "body": "wait its not even 12.. avg is 10.4 and median is 8.3. I cant tag a photo in this comment so..."
    },
    {
      "id": "l8oc8sd",
      "body": "Isn't that overall? He is specifically talking about CS."
    }
  ]
}