{
  "id": "1dfph71",
  "title": "I’ve taken admission into EC campus and heard things",
  "content": "I have recently gotten admission into Pes ec campus, I’ve not visited it as my session starts from august but I’ve seen some Reddit posts about the ec campus having steel bars and being made into a prison so can someone explain what actually is happening?",
  "metadata": {
    "author": "JellyfishLonely9155",
    "url": "https://www.reddit.com/r/PESU/comments/1dfph71/ive_taken_admission_into_ec_campus_and_heard/",
    "permalink": "/r/PESU/comments/1dfph71/ive_taken_admission_into_ec_campus_and_heard/",
    "score": 17,
    "created_utc": 1718367578,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l8kkhjb",
      "body": "3 guys from ec campus have jumped from the buildings in the past 1 year so they are trying to avoid such incidents in the future"
    },
    {
      "id": "l8kktju",
      "body": "But is there something specific to that campus that so many people attempt suicide?"
    },
    {
      "id": "l8kla78",
      "body": "tension, stress, pressure"
    },
    {
      "id": "l8klkqp",
      "body": "Not really specific to the campus.\nBut yes the staff are quite insensitive, so be prepared to face the lowest forms of humanity. Special mention to PES management - they encourage you to jump off."
    },
    {
      "id": "l8klm0x",
      "body": "No, it's just a coincidence , they might be quite strict at times for  things like coming in a bit late for ur exam or cheating but other than that it's nothing that u can't handle"
    },
    {
      "id": "l8kmbcw",
      "body": "I still don’t get what does having steel bars so can you explain their logic a bit?"
    },
    {
      "id": "l8kmlcp",
      "body": "People jumped inspite of railings being present in the upper floors that's why they covered the space with steel bars"
    },
    {
      "id": "l8kqgd1",
      "body": "Bars are there to make sure you always take the stairs/lift."
    },
    {
      "id": "l8kxy4r",
      "body": ">But yes the staff are quite insensitive, so be prepared to face the lowest forms of humanity\n\nExaggerated, don't you think? Not sure when you graduated to say this but except the last year, there are usually *no* reports of harassment from faculty. I joined in 2018, I am in touch with seniors who joined way before me as well - everyone agrees that until this year there had never been such incidents that validate them being \"insensitive\". A horrible interaction with a faculty member is an exception, not the norm here. They are extremely incapable at their jobs but that's pretty much where it ends."
    },
    {
      "id": "l8kzbk8",
      "body": "Coincide? No. Management is showing their true colours."
    },
    {
      "id": "l8l9vgc",
      "body": "Bro it's literally being done  to prevent students from jumping off\nIt's not like they'll encapture you and not send you home for days or some shit\nChill out"
    },
    {
      "id": "l8lmue6",
      "body": "The dickriding is just insane"
    },
    {
      "id": "l8loiw8",
      "body": "Lol I've interacted with and known these profs way longer than you have. Given the amount of criticism I've posted on this subreddit, trust me I'd be the first to call it out if profs were insensitive day in and day out. And this is after being aware that some profs know who exactly runs this account."
    },
    {
      "id": "l8lqdev",
      "body": "Manegement got tired of people MLG water bucketing to the ground floor and not removing the water"
    },
    {
      "id": "l8mo1go",
      "body": "You can use fire plot armor and do MLG lava bucket though. That steel is not stopping it"
    },
    {
      "id": "l8ok300",
      "body": "I have joined after 2019, there have been atleast one suicide every year with some ECE teachers even taking pride in students jumping off because of them! Management is just very good at hiding things, hence most people don't even know such incidents happen. And inhumanity is an everyday thing, it's just not everybody jumps off the floors rather goes through a phase of depression until they walk out of that place and take a breath!"
    },
    {
      "id": "l8oo5z2",
      "body": "One suicide every year? So you're saying there have been atleast 5 (2019-2023) + 4 (2023-2024) = 9 suicides over these 5 years?\n\nYou're going to have to bring facts and evidence to the table and not pull numbers out of your ass for me to actually believe that. Criticise the university where due. Don't spread a false narrative just because it looks cool to hate on the college. You're forgetting that batches before yours had most of the profs you do."
    },
    {
      "id": "l8opy4d",
      "body": "Defending nonsense won't help. Maybe instead of questioning my facts, you should stay in touch with your batchmates and juniors rather than believing whatever has been told to you, in case your source of confirmation is college itself. Your batch has got some \"numbers\" too, only if you'd have bothered what's happening in your surroundings during college, you'd have known. Nobody's building any narrative here, everybody here is now aware enough to not let things go anymore which batches \"before mine\" did as they had no other choice. Incidents have always been there, but coming out and talking about it puts lots of careers at stake which is why no one ever did. Go speak to people even now and you'll know the \"narrative\" or the \"reality\""
    },
    {
      "id": "l8oq7c8",
      "body": "And yes, I have spoken to seniors too and they have confirmed that incidents have been there before, not as bad as last one year but they have always been there"
    },
    {
      "id": "l8or0f5",
      "body": "Maybe you should instead stay in touch with your juniors and batchmates and you'd know if it's the \"narrative\" or the reality. Your batch has had an incident too btw, just letting you know. Maybe just make yourself a little aware of your surroundings. And about me, I have seen them every year of my engineering from the very 1st sem! There have been suicide notes with specific faculties' names on them FYI. Might as well check your facts first!"
    },
    {
      "id": "l8orjek",
      "body": "I am in touch with a lot of batchmates and juniors, they're my source of information. Lol you really think I'm out of touch with things at PES? Not just me, there are multiple from my batch and earlier who are in touch with current students. We know what happens and what doesn't happen. How do you think I know about changes to syllabus, management or faculty? Or are you one of those people who think I'm being paid by PESU to loiter around on a subreddit?\n\nAnd my batch didn't have any incident. We had the first 3/8 semesters of regular college, everything else was shut due to COVID, nobody else turned up to college after that. Maybe you should check with your source once before saying I'm unaware of my surroundings.\n\nUnless you actually have any evidence of these *other* incidents you speak of, these are at best just rumours. I'll be happy to accept my mistake if you can show me any sort of evidence. Until then, have a good day :)"
    },
    {
      "id": "l93xpb0",
      "body": "I most likely think it is mostly the generation gap isuue too.. We used to respect our teachers almost blindly and mostly would not question their behaviour and teaching etc. Those who used to teach well, we used to be like them and fond of them and those who were not capable enough, simply we used to ignore them. But, the children these days will use harsh derogatory words against their teachers easily which was not the case previously. I am not conveying it is wrong or right, but the respect and admiration we used to have to our teachers in our growing years is missing these days.. I am a millennial and in between generation to gen X and current students gen Z.. So, noticing this huge gap between the teacher - student scenario. \n\nEven if few teachers scolded us, we used to think it is for our own good because we were brought up by our parents too with little bit of discipline at home and respecting elders was like taken for granted. But, these days children are brought up with so much of love, freedom, and even pamper both boys and girls, that they find this restrictions or discipline by teachers almost intolerable as they are not used to it in their upbringing nor anywhere else. But, teachers continue their sternness and strick disciplinary way of teaching and guiding students and hence these clashes and severe clashes may lead to such extreme steps as suicides. It is not one way problem. It is two way problem where there is much more widening generation gap between students gen and teachers gen."
    },
    {
      "id": "l93yl0l",
      "body": "Few teachers might be narcissistic and enjoy the pain and humiliation of students and this should be looked into by the management if repeat incidents are happening. And such teachers can be transferred as a deterrent to their awful narcissistic behaviours if not stricter actions to be taken rather than putting grills everywhere in the campus."
    },
    {
      "id": "mec46cz",
      "body": "hahahahaah"
    }
  ]
}