{
  "id": "1dg8zyd",
  "title": "Placement cgpa ",
  "content": "My cgpa is really bad it's 7.9 so what should I do ? In august the company starts coming and ik that I won't qualify the cutoff.\nBy which month can I expect to clear cutoff and atleast sit for the placement tests ",
  "metadata": {
    "author": "Firm-Chair-5897",
    "url": "https://www.reddit.com/r/PESU/comments/1dg8zyd/placement_cgpa/",
    "permalink": "/r/PESU/comments/1dg8zyd/placement_cgpa/",
    "score": 3,
    "created_utc": 1718422767,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l8oozs0",
      "body": "How many credits do you have in total. If you want you can go for a summer course in July and up your grade a little."
    },
    {
      "id": "l8opg13",
      "body": "I have already completed 116 credits"
    },
    {
      "id": "l8opo25",
      "body": "Firstly, your CGPA isn't really bad. I've seen kids get shortlisted with a low-8 as well. But you're going to have to be more than your CGPA - polish your DSA concepts, revise CS theory, work on your resume etc. Since your GPA is on the lower end, you will need to complement it however you can. \n\nYou will be allowed to write the OA for most if not all companies. The only time you'll face difficulties is shortlisting for interviews. Since each company shortlists independently on different criteria, it's really difficult to predict when you might get shortlisted. It's possible the first few companies aren't rigid about CGPA requirements, while it's also possible that the first few companies are extremely strict about it. Or it could also be a random distribution. \n\nRegardless, it's not something you can do much about anyway. My suggestion would be to prepare well for placements such that your problem solving skills and CS theory concepts aren't the reason for not getting shortlisted. Aim for perfecting your abilities and ensure that you give your best during the OA, aiming for as high a score as possible. That will only leave CGPA as the bottleneck. Also - focus a bit on special topics and other components this semester, make sure to get an S grade. If unluckily you *do* not happen to get any opportunities this semester, then you should ensure that when you continue to apply in 8th semester you do have a better CGPA."
    },
    {
      "id": "l8p3lk0",
      "body": "Wait so below 8 you can't even sit for placements 😭"
    },
    {
      "id": "l8p3ny6",
      "body": "You won't be shortlisted for many of them"
    },
    {
      "id": "l8p3pma",
      "body": "So to have a 50℅ chance u need 8.5+?"
    },
    {
      "id": "l8p46qb",
      "body": "8.5+ is enough for most. Only a few keep cutoffs higher than that and even fewer keep it at 9+"
    },
    {
      "id": "l8p7z7l",
      "body": "So 8.5 is bare minimum if you want 10+lpa"
    },
    {
      "id": "l8pa94f",
      "body": "I wouldn't say the bare minimum, since it depends on how companies shortlist. They use a combination of parameters including your performance in the OA and your CGPA. But yeah, if you want to get placed early with a T1 package, you ideally would want to have an 8.5+"
    }
  ]
}