{
  "id": "1dgcwsr",
  "title": "Startup Culture here?",
  "content": "Hey guys, so im gonna be joining pesu for cse mostly and was curious abt the startup culture here\n\nI had asked abt level of bangalore colleges on another post in btechtards and i got feedback that manipal core cse would offer me more opportunities than pes, is that true? \n\nAlso general question on how college life is here, should i prefer rvce ECE over this?",
  "metadata": {
    "author": "RaspberryNo8046",
    "url": "https://www.reddit.com/r/PESU/comments/1dgcwsr/startup_culture_here/",
    "permalink": "/r/PESU/comments/1dgcwsr/startup_culture_here/",
    "score": 3,
    "created_utc": 1718438123,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l8p99bz",
      "body": "There's something called PESU venture labs who help students with interesting ideas come up with a startup by funding it. \n\nThen there's a course(special topic)called CIE which is taught in two levels in 2nd year which again helps you in building entrepreneurship skills.\n\n\nAt this point if you're still confused just flip a coin and then just explore the option."
    },
    {
      "id": "l8p9cja",
      "body": "Thats good, have alumni from pesu founded any startups that are doing well?"
    },
    {
      "id": "l8pc6ws",
      "body": "Rapido co founder Rishikesh SR ,   \nMANISH SINGHCEO, Innovators Bay  \nDEEPAK BHATT AND KUNAL BHATNAGARFounders, Soldrit\n\n# Manoj Sanker\n\nCTO, Co-Founder, NEMOCARE WELLNESS   (recently appeared on Shark Tank)\n\nAnanya Mungara, founder of SmartChakra"
    },
    {
      "id": "l8quiwx",
      "body": "bro have you lost it ece and cse are totally different streams leading to different career paths if you stick to the core of their respective branches. Flip a coin it seems LMFAO"
    },
    {
      "id": "l8qutpv",
      "body": "I had already explained about ECE vs CSE differences in earlier posts but these guys don't even think about going through related posts before putting a new question so had to say it :/"
    },
    {
      "id": "ls6oqf0",
      "body": "Rapido"
    }
  ]
}