{
  "id": "1dghai9",
  "title": "SERIOUSLY!? WTF!?!?",
  "content": "Where the hell is the damn student body? Why the silence on such inhuman behavior? Where are the protests? Where is our goddamn basic right to roam freely on campus without feeling like fucking criminals? It's complete bullshit that just being here now makes us feel like we've committed a crime. This place was supposed to be where we make memories, not where we're counting down the days to leave. How can the management think these changes make things better? \nThese make it WORSE!!!\nThese make it SO MUCH WORSEEEE NOW!!!!",
  "metadata": {
    "author": "anonymous_talks_0101",
    "url": "https://i.redd.it/r8kdkbjnfq6d1.jpeg",
    "permalink": "/r/PESU/comments/1dghai9/seriously_wtf/",
    "score": 94,
    "created_utc": 1718455895,
    "flair": "ANNOUNCEMENT :snoo:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l8pxdx5",
      "body": "Is this another building at EC campus, or another angle of the same place from the [previous post](https://www.reddit.com/r/PESU/comments/1dfiecg/ec_campus_is_now_a_jail/)?\n\nRegardless, since its vacation time you won't see the student body do anything (although I don't think they do much anyway either). Why not collectively raise a formal request to DoSA? Has anyone tried contacting the management over this, directly or indirectly?"
    },
    {
      "id": "l8pxpnb",
      "body": "We have a DoSA ?"
    },
    {
      "id": "l8pxsmv",
      "body": "Jeus this is scary"
    },
    {
      "id": "l8pxw7x",
      "body": "ec has one?"
    },
    {
      "id": "l8pxx5q",
      "body": "truly nonsense"
    },
    {
      "id": "l8q07ay",
      "body": "Back when I was studying there. It seemed peaceful. When I see this now, it seems crazy."
    },
    {
      "id": "l8q0gc4",
      "body": "Same across campuses."
    },
    {
      "id": "l8q0jpg",
      "body": "PESU jail construction in progress lmao 😂😂"
    },
    {
      "id": "l8q0pqr",
      "body": "report report report then"
    },
    {
      "id": "l8q2anq",
      "body": "How do you not know the DoSA? He was one of the best people at PES back when I was there"
    },
    {
      "id": "l8q2bza",
      "body": "Petition to call it a zoo instead"
    },
    {
      "id": "l8q2i84",
      "body": "This came up on my feed all of a sudden on my feed\nI studied in this campus a few years ago and this used to be one the best places 😭😭.. what have they done😭😭"
    },
    {
      "id": "l8q6bwk",
      "body": "Dosa?"
    },
    {
      "id": "l8q8mwa",
      "body": "Dean of Student Affairs"
    },
    {
      "id": "l8q8w1x",
      "body": "Its same as RR campus no? I dont think there is separate Dean"
    },
    {
      "id": "l8q8xwo",
      "body": "Yeah same - VK"
    },
    {
      "id": "l8qirgx",
      "body": "Well, students can still commit suicide, if not on campus. Unless the college addresses the core issues, such cases will still happen."
    },
    {
      "id": "l8qpavx",
      "body": "it's like treating individual symptoms rather than the actual disease"
    },
    {
      "id": "l8rd32u",
      "body": "All the new kids visiting campus during admission season genuinely made me feel like a zoo animal on display😭"
    },
    {
      "id": "l8tbkct",
      "body": "I mean like we can send a proposal to Bangalore City police to accommodate criminals in PESU EC campus, just in case the parappana agrahara central jail runs out of space...."
    },
    {
      "id": "l8tdrri",
      "body": "The student body is the most useless shit you can ever see on the EC Campus."
    },
    {
      "id": "l8te3n9",
      "body": "Start rattling the cages for dramatic effect"
    },
    {
      "id": "l8tkt6h",
      "body": "I flipped around like a caffeinated dolphin, hopefully i scared them away😌"
    },
    {
      "id": "l8tkzdx",
      "body": "Depends on what you speak to him about honestly."
    },
    {
      "id": "l8tz2s4",
      "body": "Please do this the next time I bring my camera to campus"
    },
    {
      "id": "l8tzws9",
      "body": "It'll turn into a dance battle bw the two campuses✨️"
    },
    {
      "id": "l8u6uju",
      "body": "Yeah Dosa quality is also so mid in EC canteen"
    },
    {
      "id": "lllk2rk",
      "body": "Yooo 😭 am I doing wrong joining this clg ?"
    }
  ]
}