{
  "id": "1dgk75t",
  "title": "help",
  "content": "I've enrolled for cse ai and ml in ec campus. Any advise from seniors? Regarding clubs/extracurriculars/studies, anything you wish you had done earlier, as a senior? What advice would you give your younger self? Also, I have started working on a project where you build an application related to facial recognition with python. Would that be useful For sem 1? Would really appreciate it if someone could post the course syllabus for sem1.",
  "metadata": {
    "author": "RaspberryOk2215",
    "url": "https://www.reddit.com/r/PESU/comments/1dgk75t/help/",
    "permalink": "/r/PESU/comments/1dgk75t/help/",
    "score": 10,
    "created_utc": 1718464527,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l8qq0i5",
      "body": "Not panic and ask this same thing on Discord server of mighty PESU(in ask a senior channel).\n[pes](https://discord.com/invite/pesu-discord-742797665301168220)"
    },
    {
      "id": "l8r9mva",
      "body": "ok"
    },
    {
      "id": "l8tcdy8",
      "body": "Firstly, Congratulations on Joining PES. \nSecondly, don't rush into everything at once. I get the enthusiasm and I'll share the same thing I share with my students too (thou they are in the masters program but the same rule applies)\n\n1. It's a long way, don't rush into anything too quick and whatever you do plan big and be ready to fail. I'll make a system better than Google on this but if it doesn't work out, it wouldn't take a day to move on to the next idea. That's how we all learn and develop.\n\n2. However irresistible, don't think of placement from day 1 (extremely hard to do). The reason is very clear after you are in the market and have gained some experience, learning is the objective. You'll see that soon, your placement is heavily dependent on the companies your college brings. And in that regard, congratulations you are in PES if you do well (top 20%ile) getting a comfy job isn't difficult.\n\nNow something from the experience side,\nJobs will not be the same by the time you graduate. No one knows what it will be like, but surely not what it is today. Your skills to solve, think critically will be far more valuable cause coding is a cake walk today with GPT and that will only improve. Learning how to use GPT isn't going to be a skill (yeah prompt engg is BS). So, what can you do to make yourself valuable so they pay you.\n\nUnderstand the Issues, Think critically and Learn to Present.\n\nFor instance, the facial recognition \nGpt will give you a code for it immediately. Yes it's good you know how it works but that's also something it can explain. Where do we need you? \n1. Does it work with all faces well?  Does it recognise only certain demographic faces, usually it doesn't \nCheck - https://www.theguardian.com/us-news/2023/feb/08/us-immigration-cbp-one-app-facial-recognition-bias\nNow fixing this problem is worth it, gpt will help but it can't solve this problem on its own.\n2. Does the system make mistakes? Like say a deep fake of Obama being circulated can you as an engineer solve it such that it doesn't recognise a deep fake as real? That's a problem work solving \nMeta even has a challenge on it with the dataset provided : https://ai.meta.com/datasets/dfdc/\n\nThere are 10 different ways I can spin this problem and why the algorithm by default isn't good enough and that's where a fantastic PES , Grad with AI ML expertise is needed.\n\nSo spend time looking around and see what the problem is today, work on real problems and even if you are not the one with the best solution it works. Would you hire\nThe guy who says came first in a college hackathon with 300 students or\nThe other pal who came 6th while losing to the chief architect of Meta and the US govt.\n\n\nBut but, enjoy the subject. It's very fun to watch 3 idiots and appreciate Rancho (here to learn and have fun), but everyone has a chatur inside(only focus on outcome jobs). Type to strike a good balance \n\nEnjoy the city, the college and the peers🙌🙌"
    },
    {
      "id": "l8vghd9",
      "body": "hi thanks for the feedback. Will integrate it in the process and let you know how it goes!"
    },
    {
      "id": "l995rh4",
      "body": "Thank you for the reply.\nBut I'm just mentioning focus on a real problem, and try to solve that instead of a working code with some libraries and try to replicate that, however in the first year even that's something really impressive.\n\nAll the best and I hope you find a problem you are passionate about."
    },
    {
      "id": "lb3u8pl",
      "body": "thanks!!"
    }
  ]
}