{
  "id": "1dhaf1b",
  "title": "Review ",
  "content": "I have got CS(aiml) in ec campus.\nI have seen lot of negative reviews about both the campus as well as the aiml specialisation which made my decision of joining pes questionable \nIs it exaggerated or is it the same case for all the colleges ",
  "metadata": {
    "author": "69_anonymous_",
    "url": "https://www.reddit.com/r/PESU/comments/1dhaf1b/review/",
    "permalink": "/r/PESU/comments/1dhaf1b/review/",
    "score": 3,
    "created_utc": 1718552801,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l8vovnn",
      "body": "AIML is a new branch at PESU. I heard there's been a lot of experimentation going on, they replacing some CS subjects with new ones, like SDCA in place of DDCO and MML in place of Linear Algebra."
    },
    {
      "id": "l8vp4te",
      "body": "The scepticism about the AIML branch is well justified. There are no placements yet, some courses are rushed and not covered in as much detail as they should, some classes are not planned out well and some are getting replaced. There are more details in the link attached below. \n\nAs for reviews about the campus itself, well yeah things aren't great but things aren't bad either. It's just that negative feedback is louder than positive feedback. Sure PES is hectic and like a school but it's also much better than most other colleges in the state. PES for all its flaws also gets a lot of things right compared to other colleges such as its reasonable placement policy, focus on hands-on learning and updated syllabus. But PES is also infamous for taking bad decisions and the issue is that when it *does* take a bad decision, it happens to be a terrible fucking decision that affects everyone, for example, the barricading of the open areas on campus.\n\nTLDR, there are both sides to the story, it is not all black or white. You will find both sunny days as well as rainy days at PES with it being sunny, or at most cloudy, on most days. But when it rains, you are going to be flooded and wiped off your feet.\n\nThese links might help you:\n\n1. [Pros and Cons of PESU](https://www.reddit.com/r/PESU/comments/13ygg68/comment/jmmro6e)\n2. [CS vs CS (AIML)](https://www.reddit.com/r/PESU/comments/147gamv/comment/jnve51g/?utm_source=share&utm_medium=web2x&context=3)"
    },
    {
      "id": "l9o8x6o",
      "body": "Nro I joined in cse in ec campus"
    }
  ]
}