{
  "id": "1dhx0ab",
  "title": "help me choose",
  "content": "vit vellore cse (fee is 4.5lpa)\nmit manipal cse (fee is 5lpa)\nbms cse aiml(fee is 2lpa)\npes main campus (fee is 5lpa)\npes ec campus (fee is 1lpa)\ni can compromise on college life, placements wise which is the better clg?",
  "metadata": {
    "author": "Tight-Common-7247",
    "url": "https://www.reddit.com/r/PESU/comments/1dhx0ab/help_me_choose/",
    "permalink": "/r/PESU/comments/1dhx0ab/help_me_choose/",
    "score": 4,
    "created_utc": 1718627780,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l8zroc0",
      "body": "BMS"
    },
    {
      "id": "l8zssmf",
      "body": "Pes ec campus overall seems like the best choice. \n\nThere's a plethora of reasons why say pes>vit (you can see in this in other qs). \n\nI don't think aiml / any specialisation is the best idea in undergrad esp since you have other / better options\n\nPes ec campus = rr campus for all intents and purposes (only real difference would be peer group). So since ur getting pes ec through cet I'd say go for it 100%."
    },
    {
      "id": "l8zt3tr",
      "body": "what about manipal tho, I'm confused about it"
    },
    {
      "id": "l8ztdn0",
      "body": "if you can afford it, MIT is better choice . If you feel 5lakhs is too high, pes ec campus is better.The only thing you will missout by choosing ec campus is college life"
    },
    {
      "id": "l8ztiie",
      "body": "but like placements wise only, I don't mind college life\n(and parents are hesitant for manipal because of the drug culture there)"
    },
    {
      "id": "l8ztijc",
      "body": "If money is not a problem take mit\n\nOtherwise ec campus"
    },
    {
      "id": "l8ztkwo",
      "body": "mit>bms>pes ec"
    },
    {
      "id": "l8ztngm",
      "body": "PES EC campus. \n\nManipal is the only college on the list which is better than PES, but I don't think the differences are worth 16L."
    },
    {
      "id": "l8ztq45",
      "body": "placements wise which is better tho?"
    },
    {
      "id": "l8ztrdn",
      "body": "\n\nOverall in terms of placements and everything Manipal and PES are more or less the same. Manipal does have more of a campus life if that's important to you. You can still have a lot of fun at pes I feel since it's all down to friend group\n\nAND ofc fees. It depends on how big a factor fees is for you. If you're okay with 5L, then Manipal and PES RR come back into the picture. \n\nThere are some v descriptive answers regarding manipal vs pes in this subreddit which you should go through."
    },
    {
      "id": "l8ztyr5",
      "body": "no actually my parents are hesitant for manipal because of the drug culture"
    },
    {
      "id": "l8zu4ir",
      "body": "placements in rr and ec campus are the same?"
    },
    {
      "id": "l8zuccu",
      "body": "placements wise both are equal, but you will have tougher competition in pes due to large amount of people"
    },
    {
      "id": "l8zvs09",
      "body": "Mit is overall better. Placements wise, should be similar"
    },
    {
      "id": "l8zwa26",
      "body": "parents are hesitant for mit because of drug culture, so will pes ec campus be a better option?"
    },
    {
      "id": "l8zwbvr",
      "body": "Tbh even Manipal main is no better now because it too has multiple CS-allied branches - CS, CS+AIML, CS+DS, DS, IT, CCE etc. Plus last time I heard, the BLR campus will have pooled placements with main campus. I don't think the \"lower batch strength\" argument will apply when OP will reach final year."
    },
    {
      "id": "l8zwhgc",
      "body": "Yes they are the same. You can check the FAQs for a detailed comparison between campuses: [https://bit.ly/pesu-faq](https://bit.ly/pesu-faq)"
    },
    {
      "id": "l8zwhr3",
      "body": "Placements of both are pooled so it's the same"
    },
    {
      "id": "l9084id",
      "body": "Yes PES and Manipal MIT are easily at par in academics and placements , just apart from the campus"
    },
    {
      "id": "l908ea5",
      "body": "If we're removing the fees factor and considering placements/academics/peergroup the order is  \nPES RR > PES EC > MIT Manipal > BMS > VIT vellore\n\nConsidering the fees ur getting  \nPES EC > PES RR > MIT Manipal > BMS > Vit Vellore"
    },
    {
      "id": "l908lbs",
      "body": "bestie, pes ec over manipal, fr???"
    },
    {
      "id": "l908pe8",
      "body": "alright so I might choose pes ec campus"
    },
    {
      "id": "l9099pd",
      "body": "Well he did say placements/academics wise so it's similar for ec and rr\n\nCampus/exposure wise mit> pes electronic city"
    },
    {
      "id": "l909jfh",
      "body": "no actually parents are hesitant for manipal because of the drug culture there"
    },
    {
      "id": "l909ord",
      "body": "Yea makes sense , then you have your answer and what to chose"
    },
    {
      "id": "l909uax",
      "body": "shall I go for pes ec campus, like I'm genuinely stressed and scared"
    },
    {
      "id": "l90jf0t",
      "body": "there are close to 2k students in cs and cs-branches in pes( both branches), thats a lot"
    },
    {
      "id": "l90yx5k",
      "body": "I would go for BMS first, lesser batch size so more opportunities"
    },
    {
      "id": "l916kwp",
      "body": "My parents too but i talked to some seniors and they say it's bs. If u wanted to u can and will get yourself into substance abuse anywhere."
    },
    {
      "id": "l917b2z",
      "body": "get a nice bike with the saved money lol."
    },
    {
      "id": "l91gab7",
      "body": "Really? The people I talked to remarked that drugs are rampant in the college and I  know some  people afflicted by this drug menace"
    },
    {
      "id": "l93assp",
      "body": "💀 what"
    },
    {
      "id": "l93goyh",
      "body": "my man drugs r in every college u go to... u just gotta choose whom to hang out with"
    },
    {
      "id": "l94cnmo",
      "body": "I had chosen ec campus (fee is 1lpa). Obviously MIT, VIT have better clg life, but I have learnt a lot here, The courses are boring with too many tests, but the ppl here are good (If you find a good circle)."
    },
    {
      "id": "l94cx38",
      "body": "I don't mind about college life, placements wise which is a better choice?"
    }
  ]
}