{
  "id": "1dixpmh",
  "title": "College vs Branch",
  "content": "Im not able to decide if i should priorise college (rvce) and choose any cs with specialisation course or if i should prioritise branch (cse core) and go to pesu(through kcet quota). Idc about college life and im ready to grind in pesu.\nSo if i do get datascience or ai in rvce should i prefer that? (Im confident about getting cs in pesu) also what exactly is the difference bw cse core, cs with specialisation and IS. I got a rank of 157x in kcet and i have obc reservation so i might be getting rvce cs specialisation. Please help",
  "metadata": {
    "author": "luna_2521",
    "url": "https://www.reddit.com/r/PESU/comments/1dixpmh/college_vs_branch/",
    "permalink": "/r/PESU/comments/1dixpmh/college_vs_branch/",
    "score": 10,
    "created_utc": 1718735173,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l98otid",
      "body": "I'm not sure about those courses offered there. \n\nIf the course itself is \"data science\", then take pes. If it's written as \"cse(data science)\" or your degree, only then consider them \n\nAlso if possible just go through the syllabus and compare it to the cs one. If it's only a couple courses that are different, take rv\n\nOtherwise id probably pick pes"
    },
    {
      "id": "l99d1gg",
      "body": "I would say even if it's cse(data science) go for pes cse core. I personally don't think rv is that much better than pes. Crowd in pes is more but I would argue is better from what friends have said (+so many management seats in rv). \n\nAlso placements-wise rvce is not much better than pes and rvce for cse(data science) we do not know the placement data.\n\nImo go for pes"
    },
    {
      "id": "l99iki8",
      "body": "Choose RVCE if the branch is called CSE(DS) if not choose PES core CSE."
    },
    {
      "id": "l99o0ae",
      "body": "So firstly, there is no realistic difference in the reputation of these colleges. Both are similar on the reputation scale with RV having slightly better placements. Since you also mention that: \"Idc about college life and im ready to grind in pesu\", then I'd also go on to say that the other advantages of RV such as the more relaxed environment and better campus life and other factors also go away. That leaves only your branch.\n\nI always recommend picking core CS over any CS-allied branch. And definitely, do not pick any complete specialisation. Remember that undergrad is for fundamentals, not specialisations. Its for exploring CS and figuring out your own interests, not being forced down one path. And that is just the beginning. Most of these branches are just to increase intake and are not planned well, they tend to replace core CS fundamental courses with specialised ones, which is not a good sign. [Here is a detailed comment on why you should NOT pick any specialised program](https://www.reddit.com/r/PESU/comments/147gamv/comment/jnve51g/). Make sure to also read the other comment attached inside the link.\n\nThe only time I would recommend picking these specialisations is if you don't give a rat's ass about what you are going to study and are just interested in getting a good job after BTech. In that case, the outcomes from both specialisations will be the same so it does not matter which you pick. But be warned that this is a very brain-dead way to make an important career altering decision."
    }
  ]
}