{
  "id": "1dk7977",
  "title": "Specialisation in electives",
  "content": "What is specialisation? How many courses do we have to pick under electives for specialisation ",
  "metadata": {
    "author": "Early_Discipline_174",
    "url": "https://www.reddit.com/r/PESU/comments/1dk7977/specialisation_in_electives/",
    "permalink": "/r/PESU/comments/1dk7977/specialisation_in_electives/",
    "score": 3,
    "created_utc": 1718874824,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l9ftimn",
      "body": "Your degree certificate will say b tech in [field] with [some] specialization \nTo get the specialization you want:\nPick your 2 electives in 5th sem belonging to the specialization you want \nPick your 2 electives in 6th sem belonging to the specialization you want too\nIf any one elective (in 5th or 6th sem) you choose does not belong to the specialization you want , you do not get the specialization"
    },
    {
      "id": "l9fxf41",
      "body": "That's the same thing we aiml people will apparently get our degree in. Glad to know it's not that different\n\nBut can cs people choose all electives from a specialisation and still request that it not be mentioned in their degree?"
    },
    {
      "id": "l9fy35h",
      "body": "Small correction - your degree, neither transcript, will mention the specialisation because your degree is still CS. This won't apply to the CS(AIML) kids because their degree/transcript will mention AIML as well. \n\nYou instead will get a separate specialisation certificate which will mention that you completed the requirements for specialisation X."
    },
    {
      "id": "l9fy5aw",
      "body": "CS people will not have it mentioned on their degree. Check my other comment."
    },
    {
      "id": "l9g9f5s",
      "body": "Is it compulsory for u guys to take subjects only from MIDS or some other specialisation or u are free to take any subjects as cse kids ?"
    },
    {
      "id": "l9gny91",
      "body": "CS kids can take electives from any specialisation. Its just that if they *do* take all from a single specialisation group, they are awarded its certificate."
    },
    {
      "id": "l9hbxp8",
      "body": "Anyone can do any elective from any department,but specialization you need to do from your branch ig"
    },
    {
      "id": "l9hvt3g",
      "body": "Yup, specialisations are restricted to your branch only."
    },
    {
      "id": "lh38iib",
      "body": "Is specialization certificate important for placements or masters .....does it have an important effect??"
    },
    {
      "id": "lh3jnvx",
      "body": "The actual physical certificate isn't given until your convocation, which is usually in July. Which means that for placement season (7th and 8th sem), you don't have it. You can state the specialisation on your resume but as mentioned earlier there isn't much benefit to it. \n\nAdditionally, if you choose to pursue MS right after BTech, you won't have the certificate either since applications are submitted by 7th sem December. Also note that MS admissions will always specifically ask for your transcript, not degree, during applications. So even if you submit your MS application after 2 years, although you'll have the certificate, you won't really submit it anywhere. I graduated in 2022 and wasn't required or even prompted to submit it anywhere. \n\nSo at best, it's a line on your resume. The importance will depend on if someone actually cares to make a difference with that one line."
    }
  ]
}