{
  "id": "1dkcu1k",
  "title": "Any chances? ",
  "content": "I was not able to attend round 1 of pessat , gonna attend round 2 directly , my rank is 129X, any chances of aiml in rr campus?? ",
  "metadata": {
    "author": "Slickgohan47",
    "url": "https://www.reddit.com/r/PESU/comments/1dkcu1k/any_chances/",
    "permalink": "/r/PESU/comments/1dkcu1k/any_chances/",
    "score": 8,
    "created_utc": 1718893253,
    "flair": "PESSAT/Admission",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l9h1u8a",
      "body": "all the seats have been occupied for aiml rr campus thru pessat  \nif someone were to give up their seat then probably   \n\n\nbut then again it is rank wise. someone someone with rank lower than yours also attends second round the preference would be given to them"
    },
    {
      "id": "l9hbgh2",
      "body": "Ohh ok ig that's how it works all the time right, 2nd round is based on how many seats are given up, guess it will be a gamble only, I'll keep vit vellore cse as backup"
    },
    {
      "id": "l9hdd7s",
      "body": "What other ranks/ options do you have?"
    },
    {
      "id": "l9hebe3",
      "body": "Vit vellore cse (core) is my backup, ig I got manipal also but only eee so I'm not taking it"
    },
    {
      "id": "l9i2e9e",
      "body": "very less chance of gamble to cause last year there were -ve seats"
    },
    {
      "id": "l9lu64m",
      "body": "Coz last year they sold Pessat seats to higher fee quota students and were caught. Hopefully they won't do it this time."
    },
    {
      "id": "l9luojr",
      "body": "Bruh wth is caught!? It ain't anything illegal and they are doing this time too by high fees quota you mean donation right ?"
    },
    {
      "id": "l9lvy83",
      "body": "You did not understand. They sold leftover PESSAT seats to donation people instead of having a proper second round. There is a reason why the cutoff of round 1 became the final cutoff in 2023 (as far as CS and allied are concerned)."
    },
    {
      "id": "l9lwou7",
      "body": "Blud they already announced that pesseat seat goes for management quota"
    },
    {
      "id": "l9lx60o",
      "body": "Where? Can you give me a link or something?"
    },
    {
      "id": "la2f68z",
      "body": "i dont have the link but they told that half of seats are for kcet and rest half is for pessat, jee mains and higher fee quota that is management quota and one of my know already got admission thorough managemnt quota there so hence there isnt any scam and most probably this will happen this year too cause it happens everytime"
    },
    {
      "id": "la3fe20",
      "body": "[https://pes.edu/intake-of-courses/](https://pes.edu/intake-of-courses/)\n\nFor eg, in RR Core CSE, 108/720 seats are for management quota, that is clear. What I am saying is that of the 288 Pessat seats, the seats that were available for second round were also converted to management quota seats instead of being given to Pessat students in the 2nd round. That is why the 1st round cutoff became the final cutoff in 2023. There had to be SOME change in cutoff if it was done the way it would have been expected."
    },
    {
      "id": "lac75ih",
      "body": "but this year too the intake in the first one was listed as 360 seats"
    },
    {
      "id": "lac7o30",
      "body": "Coz lots of people abandon their seats, especially when PESSAT round 1 happened before basically all the important counsellings began. So they just booked the Pessat seat as a backup and they'll leave/ have already left the seats."
    }
  ]
}