{
  "id": "1dl65az",
  "title": "help",
  "content": "\n\n[View Poll](https://www.reddit.com/poll/1dl65az)",
  "metadata": {
    "author": "Tight-Common-7247",
    "url": "https://www.reddit.com/r/PESU/comments/1dl65az/help/",
    "permalink": "/r/PESU/comments/1dl65az/help/",
    "score": 0,
    "created_utc": 1718982188,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l9mi768",
      "body": "Choose PES EC CSE via KCET. Unless you have an extra 20L lying around to pay for Manipal."
    },
    {
      "id": "l9misd6",
      "body": "nah bro, not that rich also😭😭"
    },
    {
      "id": "l9mxl0m",
      "body": "pes ec = manipal in terms of academics and placements. MIT > pes for college life but at the cost of 15-20 extra lakhs."
    },
    {
      "id": "l9nd4le",
      "body": "so shall I go with pes ec?"
    },
    {
      "id": "l9qgl5j",
      "body": "Bro then why are you even asking this q  , this is like nth time you have posted college admissions query in this subreddit"
    },
    {
      "id": "l9qji8e",
      "body": "sorry man, just confused 😭😭"
    },
    {
      "id": "laamed0",
      "body": "What are my chances of getting PES CS @ RR campus with 2.7k in comedk and 3.1k in kcet? Thank you in advance"
    },
    {
      "id": "labqvtg",
      "body": "PES does not take admissions via ComedK. You can check the KCET cutoffs for last year by going through [this](https://www.reddit.com/r/PESU/comments/1ct5ujc/which_branch_can_i_get_at_no_dont_make_such_posts/) post."
    },
    {
      "id": "ladongf",
      "body": "Ok thank you. Also another question, I heard some people say that the placements from both the campuses is combined. What does that mean? Do all the students head to a common placement unit in the placement season?"
    },
    {
      "id": "ladpo0m",
      "body": "Pooled placements implies that both campuses have the same placement process. Which means that when a company visits, students from both campuses write the same OA at the same time, students are shortlisted from both campuses without knowing which campus a student is from, all interviews happen at the placement cell together for both campuses and results are also announced at the same time for everyone. There is no discrimination when it comes to campus. You get the same emails at the same time and go through the same process as if everyone is part of one campus."
    },
    {
      "id": "ladrrs6",
      "body": "Thank you so much for elaborating on that!"
    },
    {
      "id": "lagrgrq",
      "body": "Hi again. had another doubt and didn't wanna make an entire post about it. How does transferring from EC campus to RR campus after the first yearr work? What are the requirements?"
    },
    {
      "id": "lagsxj9",
      "body": "There are details about branch switching in the FAQs: https://bit.ly/pesu-faq\n\nBut basically you need a really high CGPA at the end of the first year. Don't join some other branch if the intention is to switch branches in 2nd year because it depends on how many empty seats are available + your CGPA."
    }
  ]
}