{
  "id": "1dl7gz3",
  "title": "5th Sem electives",
  "content": "I am interested in taking DA and BD as my electives, but I don't have a good cgpa, so I am not sure what to do...I don't want to risk my cgpa and at the same time, I don't want to waste my learning; so I thought of taking either DA and GTA or HCI and BD...But I am still confused...so I was hoping for some advice ",
  "metadata": {
    "author": "Shzz_283",
    "url": "https://www.reddit.com/r/PESU/comments/1dl7gz3/5th_sem_electives/",
    "permalink": "/r/PESU/comments/1dl7gz3/5th_sem_electives/",
    "score": 7,
    "created_utc": 1718985626,
    "flair": "Study Help :table:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l9nd7jk",
      "body": "Take courses you are interested in. Interest goes a long way in making courses easy to learn, grasp and perform well in. If you show interest, you will automatically be inclined to put in more effort because you like studying it, and thus will probably also perform better.\n\nI've always found myself performing on par or mostly better at tougher courses I'm interested in compared to easy courses which I dislike."
    },
    {
      "id": "l9ppom7",
      "body": "Hey! I was in a similar situation as you were, my CGPA wasn't all that great so I wanted to take \"easy\" subjects- at first I filled the form with HCI and GT. I didn't attend any HCI classes but I did attend a session of GT.  I shifted to DA and BD after my first GT class and in hindsight it was a great decision! The subjects were really interesting and the ISAs and ESAs for my batch were quite easy. DA's ISAs and ESAs are pretty application-based and any tough formulae will be outright stated in the question paper. BD ISAs were tricky but the ESA was easy. I got an A in both.\n\nDA had a hackathon+four worksheets for a total of 10 marks. (6 marks for the hackathon and 1 mark for each worksheet). The hackathon was conducted on Kaggle and lasts for a week. BD had two assignments and a project. For the assignments, the code wasn't hard to write but getting the optimal solution with all edge-cases accounted for was difficult. The project wasn't easy but I learnt about some helpful tools like Prometheus and Grafana through it and I'm genuinely glad I was able to add a great project to my CV through my BD project.\n\nThe only downside is that the assignments and worksheets take up a lot of time but at the same time, you don't get questioned on writing code in the ISAs or ESAs since these assignments cover most of the coding you'll need to know."
    },
    {
      "id": "l9q20ru",
      "body": "> They're VERY strict about plagiarism though\n\nThanks, I was the one who integrated it almost 3 years ago when I built the submission portal. Glad it's still annoying everyone else :D"
    },
    {
      "id": "l9qn0y1",
      "body": "Haha, honestly I found it annoying when I did take the course but looking back on it, I wouldn't have it any other way. This was one of the few courses where I gave my best for assignments and learnt a lot in the process!"
    },
    {
      "id": "l9qnall",
      "body": "That's great! BD is such a 10/10 course. I still recommend it to everyone. It's by far my most favourite course and the only one where I learnt so much. It also helped me get my first job."
    },
    {
      "id": "l9vn3kk",
      "body": "Agreed! Taking it was a good decision on my end and I'd encourage anyone on the fence about taking it to go for it!"
    },
    {
      "id": "l9wqsam",
      "body": "Haha yes! My work at office is a massively scaled-up version of the cute little projects and assignments you work on in the course."
    }
  ]
}