{
  "id": "1dl7wgs",
  "title": "Any Senior who took IOT here??",
  "content": "I am having a fair amount of interest in Internet of Things (IOT) elective. But I have few questions about it :-\n\n1. Difficulty level of the syllabus in terms of its length and complexity. It would be great if someone can provide me last year's IOT study material (slides,etc.) drive link or something. (BetterPES has only 1 unit uploaded for IOT)\n\n2. Grading scheme and exams difficulty (ISAs and ESA). \n\nI would really appreciate a senior's insights who actually took IOT as their elective in 5th sem..",
  "metadata": {
    "author": "Content-Walk9994",
    "url": "https://www.reddit.com/r/PESU/comments/1dl7wgs/any_senior_who_took_iot_here/",
    "permalink": "/r/PESU/comments/1dl7wgs/any_senior_who_took_iot_here/",
    "score": 7,
    "created_utc": 1718986691,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l9qsy6l",
      "body": "1. Not at all difficult, quite easy as compared to earlier syllabus which included lots of practical knowledge. The syllabus now is mostly theory and easy. 50 marks of ur ISA is divided into 30 from ISA and 20 from the project. For study material you can join the discord server. \n\n2. one of the easiest and most scoring subjects you could chose, it’ll help you focus on other heavy subjects. plus if you chose accordingly you can get ur specialisation in cybersecurity."
    },
    {
      "id": "l9qtps9",
      "body": "I checked on the discord server, it has old IOT syllabus slides (2022). The syllabus listed for us in the coursework for it is different than the 2022 one (I cross checked). \n\nAlso IOT falls under both MIDS and cybersecurity specialization so that's peace"
    },
    {
      "id": "l9qtvre",
      "body": "syllabus on discord isn’t that different from the current one. Only teachers have access to the most recent ones"
    },
    {
      "id": "l9qurm2",
      "body": "Okay then. The only issue with the subject is how theoretically heavy the subject is. It looks like a distant relative of OS lmao.. Anyways what's your take on HCI for elective-1"
    },
    {
      "id": "l9quxqh",
      "body": "as I said it’s not heavy in the slightest. OS is the polar opposite of this subject. for my batch people took HCI thinking its scoring and easy (which it is) but no body scored an S"
    },
    {
      "id": "l9qw5qg",
      "body": ">but no body scored an S\n\nI think that's because they (pes) did not want to skew the results in favour of those who took HCI as their elective and went on to get a pretty easy S grade. Getting an S in any other subject is always very tough so they try to make it levelled somehow iykwim..\n\nNow the thing is if I take Big Data as my elective-2 then I would want my elective-1 to be pretty easy and scoring.. So can you tell me how were the ISAs for IOT?.."
    }
  ]
}