{
  "id": "1dlql71",
  "title": "Sem-3 AiMl slides",
  "content": "Just completed my second semester and tried to find slides for sem-3 aiml branch but none of the Pes resources had it so seniors pls bless me with the required shit.",
  "metadata": {
    "author": "SnooJokes9347",
    "url": "https://www.reddit.com/r/PESU/comments/1dlql71/sem3_aiml_slides/",
    "permalink": "/r/PESU/comments/1dlql71/sem3_aiml_slides/",
    "score": 5,
    "created_utc": 1719043147,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l9rshhw",
      "body": "Hey, I'm sorry for invading your question but, how was the first year for you? Is there rote memorisation involved in things, like we have to memorise definitions or such? Or is it all conceptual based on understanding? Any idea about the second and third year courses for CS and/or AIML? Are they mostly conceptual or is there rote memorisation involved as well?\n\nBy rote memorisation, I mean the kind of \"ratta\" you did for stuff like SST and Bio in school, you know, learning definitions, paragraphs, differences and all."
    },
    {
      "id": "l9rvcua",
      "body": "https://drive.google.com/file/d/1ZQ8dkt5KfWoNX5_y9rWW0hE0s2pAnADE/view?usp=drivesdk\n\nThis is the entire first and second year"
    },
    {
      "id": "l9s8pgk",
      "body": "Ok so what in the world is this syllabus. What a shift from sem2 to sem3 and do we need to take electives as well with this??"
    },
    {
      "id": "l9sspwg",
      "body": "Ok so honestly C and python are the easiest to understand if you understand basic concepts of coding, maths in both sem is something you’ll have to understand, subjects like physics,chemistry, mechanical, constitution, Evs ( we still have these two for some reason) are proper memorisation based \nWhereas subjects like epd, electrical, mechanics lie in both the domains.\n\nOverall there is a good amount of both involved also if you want to know more about the syllabus and course structure and a lot of other stuff [check this](https://pesufy.netlify.app/)"
    },
    {
      "id": "l9t8cws",
      "body": "Electives start from sem 5"
    }
  ]
}