{
  "id": "1dm2gpv",
  "title": "Hookups situation in EC campus.",
  "content": "I'm a freshman at PES University this year, I just wanted to ask the seniors of PES about the sex situation and hookup culture there and like boys jaa skte hai kya girls ke room Mai in EC campus hostel, and also in which year do we get single rooms.",
  "metadata": {
    "author": "anastusuh",
    "url": "https://www.reddit.com/r/PESU/comments/1dm2gpv/hookups_situation_in_ec_campus/",
    "permalink": "/r/PESU/comments/1dm2gpv/hookups_situation_in_ec_campus/",
    "score": 0,
    "created_utc": 1719081777,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l9srdit",
      "body": "Bro didn’t do any research on Pes itself😂😂\nThere is no EC campus girls hostel, only Amaatra girls hostel and the warden there(well you’ll know soon enough ), sneaking in Amaatra hostels is not possible campus hostel idk\nAlso you will never get single rooms here ever\n4sharing for first year(Amaatra)and 3 sharing for the rest 3(campus)"
    },
    {
      "id": "l9ssq5u",
      "body": "isse kehte hai rusticated hone wali harkate \nslides kholne ki umar mein... shorts kholne chale hai bhaijan"
    },
    {
      "id": "l9t2x7h",
      "body": "NO hookups and single rooms, sweet summer child"
    },
    {
      "id": "l9tg58r",
      "body": "you loser"
    },
    {
      "id": "l9umnhx",
      "body": "Aur iske baad shorts kb kholunga, ek baar naukri lg gyi maa-baap shaadi kr denge."
    },
    {
      "id": "l9umq38",
      "body": "I know Pandu Rangan, he did seem chill."
    },
    {
      "id": "l9umsqs",
      "body": "So like we gotta take some sort of PG or something for all this."
    },
    {
      "id": "l9uyzu6",
      "body": "For single rooms , look for pgs , idk for hookups"
    },
    {
      "id": "l9uz167",
      "body": "Dude has no clue about which college he's joined"
    },
    {
      "id": "l9v0j5c",
      "body": "In ecc you can only hook yourself to the grills they put"
    },
    {
      "id": "l9v12gk",
      "body": "On the bright side with an IQ like that you probably don't have to worry about finding a job and getting married off"
    },
    {
      "id": "l9v2mfj",
      "body": "Bro thought its moordale secondary 😂"
    },
    {
      "id": "l9v5ne2",
      "body": "Not every person who thinks about hookups is dumb. Like, that's just very ignorant of you to presume."
    },
    {
      "id": "l9v660h",
      "body": "Obviously not. You're one of the few who happens to be blessed with both 🤗\n\nHorny enough to ask for hookups, dumb enough to make such a post. Read the room and you'll figure out why you're being downvoted everywhere. Cheers."
    },
    {
      "id": "l9v6brn",
      "body": "Gentleman I'm well aware of all the strictness and the tough coursework and all but I presumed some of you must have found out some loop holes for such stuff, given we're all engineers to be. I expected better from atleast the PRIDE OF PESU."
    },
    {
      "id": "l9v70md",
      "body": "Lol there are no loopholes given there are separate hostels. You're not going to find a very active hookup culture here because as you yourself said - everyone is busy. Good luck with your endeavours my dude."
    },
    {
      "id": "l9v8om9",
      "body": "Can't disagree on the dumb part, now that I read some other posts."
    },
    {
      "id": "l9vrjyt",
      "body": "He is chill, but u haven't seen his other side, when he is angry he hurls abuses too"
    },
    {
      "id": "l9zrkmc",
      "body": "lund buddhi ho kya bhai?"
    }
  ]
}