{
  "id": "1dmhh5z",
  "title": "Hanging out with friends.",
  "content": "Do people at amaatra hostel hangout with each on weekends or like there is a lot of assignments for weekends that they can't even go out on weekends to some movies or something.",
  "metadata": {
    "author": "anastusuh",
    "url": "https://www.reddit.com/r/PESU/comments/1dmhh5z/hanging_out_with_friends/",
    "permalink": "/r/PESU/comments/1dmhh5z/hanging_out_with_friends/",
    "score": 3,
    "created_utc": 1719130943,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "l9vphvj",
      "body": "My man still has ptsd from his PU days. \nCollege is not as hectic as your PU days, if you learn to manage your time during weekdays you can easily enjoy your weekends unless it’s ISA week."
    },
    {
      "id": "l9vpv8k",
      "body": "It's nowhere near as bad as you apparently think it is. The only weekends you won't be free are the days before exams"
    },
    {
      "id": "l9vqmg1",
      "body": "Ur usually free on weekends so no worries"
    },
    {
      "id": "l9vrc2i",
      "body": "Depends on your campus tbh, in rr campus, for the first year atleast all the assignments were taken during last week of the semester so we could chill and do pretty much whatever."
    },
    {
      "id": "l9vv7rw",
      "body": "I was in amaatra hostel for a year, don't worry it's all chill we usually hangout during the weekends or maybe Wednesdays. A Week near ISAs we don't, apart from that it wasn't hectic with 2 ISAs so I don't know if the uni will continue with the same or change it next academic year. Assignments were usually given a week before ISA 2. Plan ahead properly and you'll be good to go:)"
    },
    {
      "id": "l9vzcvr",
      "body": "What’s the hostel timings in amaatra and can you stay later than that outside?"
    },
    {
      "id": "l9w0b11",
      "body": "If you're a girl then NO. Strict curfew timings, need to be in the hostel by 6:30 pm.\nBut for boys I don't think they care much lmao"
    },
    {
      "id": "l9zcld2",
      "body": "Can you wear shorts in the hostel? Also is the warden really as bad as people say"
    },
    {
      "id": "la8fypd",
      "body": "No you can’t, and yes, lol."
    },
    {
      "id": "la8gc4t",
      "body": "Inside your room, sure but not on the corridors or literally anywhere else. And yes she’s a bit unbearable."
    }
  ]
}