{
  "id": "1dn6xps",
  "title": "Pes ec campus hostel",
  "content": "Is the hostel for first years situated in the campus or outside and do we get to choose for the latter years \n",
  "metadata": {
    "author": "Cautious-Answer3776",
    "url": "https://www.reddit.com/r/PESU/comments/1dn6xps/pes_ec_campus_hostel/",
    "permalink": "/r/PESU/comments/1dn6xps/pes_ec_campus_hostel/",
    "score": 12,
    "created_utc": 1719210671,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "la0p55j",
      "body": "Also wanted to know from 2nd year and onwards, what is the process for getting single room hostel and also how does the fees differ."
    },
    {
      "id": "la0q7yq",
      "body": "For the 1st year, both boys and girls hostel is 7 km far from ec campus, in amaatra (4 sharing). From 2nd year boys will be shifted to ec campus hostel (3 sharing) but girls have to either continue in amaatra or search for a PG nearby campus"
    },
    {
      "id": "la0w8ha",
      "body": "U can't get single room at ecc boys hostel, fees is about 20k more excluding caution deposit"
    },
    {
      "id": "la102eg",
      "body": "Don't stay in the amaatra hostel, istg you'll have full restrictions, it's ass"
    },
    {
      "id": "la1f1bj",
      "body": "Is single room available at rr?"
    },
    {
      "id": "la1f4io",
      "body": "Is single or even double sharing not available in ec? What about rr?"
    },
    {
      "id": "la1fahx",
      "body": "Idk"
    },
    {
      "id": "la1gbpg",
      "body": "No not in ecc, idk about rr"
    },
    {
      "id": "la617wf",
      "body": "nope, not in ec campus. for rr all hostels are in campus for boys\n\nfirst year is 3 sharing for all\n\nfrom second year you can choose 3,2,1. the preference is based on who paid the hostel fee first."
    },
    {
      "id": "la6ebnu",
      "body": "Ok, so I plan on branch change after first year (no need to say very difficult or you can't or whatever, we'll see what happens). But like, will I be able to get single sharing in rr boys hostel then? I'm sorry if this is a weird question."
    },
    {
      "id": "labefq1",
      "body": "good chances"
    },
    {
      "id": "lbk616x",
      "body": "Then how many people you gotta share the room with ? 2 ,3 ? Do you get options also how are the washrooms for 1st 2nd year etc."
    },
    {
      "id": "lbkedf1",
      "body": "3 people at ecc, 4 at amaatra, most people leave hostel in 4th year. In 1st year at amaatra u get a common washroom for one floor and in ec campus there is an attached washroom in each room."
    },
    {
      "id": "lbvmwxy",
      "body": "I visited the EC campus hostel for 1st years which is outside the campus and it's got 4 people sharing and common bathrooms for the floors"
    },
    {
      "id": "lbvmz3y",
      "body": "not for 1st year in ec campus"
    },
    {
      "id": "llfzoqv",
      "body": "I'm going to join pes ec and have doubts abt the amaatra hostel. Is the washroom situation as bad as they say it is \nAnd also how many floors are there in the boys hostel and how many rooms in each floor"
    }
  ]
}