{
  "id": "1dnd1i7",
  "title": "Pes EC gym and entertainment ",
  "content": "I will be joining Pes EC campus next month and I wanted to know what activities and other things are available to do for hostellers like is there a college gym and how much do they charge etc and other things",
  "metadata": {
    "author": "JellyfishLonely9155",
    "url": "https://www.reddit.com/r/PESU/comments/1dnd1i7/pes_ec_gym_and_entertainment/",
    "permalink": "/r/PESU/comments/1dnd1i7/pes_ec_gym_and_entertainment/",
    "score": 8,
    "created_utc": 1719234392,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "la1s9hw",
      "body": "You've got bungee jumping without ropes.\n\nAnd bird watching, especially pigeons, from inside the cage."
    },
    {
      "id": "la1x7ka",
      "body": "Sounds exciting enough \n\n\n\nBut in all seriousness damn that's tuf"
    },
    {
      "id": "la2043x",
      "body": "If you would be staying in hostel....your first year would be in the amaatra academy hostel.....you don't have a gym there.... there's a basketball court that you're not allowed to play in....\nThere's a running track that was out of bounds for us for nearly the whole year there....the girl's hostel warden and a few of the guards go out of their way to create problems for you ....\nAnd you can't go out after 7pm...after coming back to the hostel around 5:30\nSo.....tough luck.. you are not getting much physical activity....\nThere's the option of the in campus gym but that would be there even if you are not in hostel"
    },
    {
      "id": "la24syr",
      "body": "The in-campus gym is pretty good. It's located in the MRD Student center. As others highlighted, you'd be living in the out-of-campus hostel. I don't remember the exact number for the fees but it was pretty liberal. You also have badminton courts(silicon floor), billiards, darts, chess, a running track, squash etc in the same building."
    },
    {
      "id": "la2y69k",
      "body": "hey could u lmk about the cricket scene there"
    },
    {
      "id": "la3jxda",
      "body": "The gym price is 6k per year, along with the gym there are many games and sports you can play in the mrd center like chess, carrom, table tennis, snookers, squash and badminton. \nHowever these are all inside the campus, so you have to probably stay back after your college or have to travel additional 10km up-down from the Hostel. There is a ground and a basketball court in amaatra hostel, the gym there is a cubical trash with a bench, a treadmill and some dumbbells throw around. There is no table tennis or any kind of indoor games available in the Hostel. \nAnd one important to remember is the cerfuee timing is 7pm, so you even have to manage that."
    },
    {
      "id": "la5objy",
      "body": "They r constructing a gym there idk even it will be finished"
    },
    {
      "id": "la629oc",
      "body": "That won't be for us...only for the Amaatra school students"
    },
    {
      "id": "la67nh3",
      "body": "What is the curfew timing for the campus hostel for 2nd years?"
    },
    {
      "id": "la6aep8",
      "body": "No idea, I am a fresher"
    },
    {
      "id": "la6gpql",
      "body": "It’s 10:30 pm, that too with an out pass"
    },
    {
      "id": "la8xec8",
      "body": "Even the ec campus has something called mrd?"
    },
    {
      "id": "laaufkd",
      "body": "Yep"
    },
    {
      "id": "laauj6c",
      "body": "I'm not into cricket but there's a cricket ground here. I don't know if it's up to spec but it looks like it is"
    },
    {
      "id": "lacoise",
      "body": "tysm"
    }
  ]
}