{
  "id": "1dp6in5",
  "title": "DUCK PES",
  "content": "PES TO STUDENTS:                                                                                                                            \nDUCK UR SOCIAL LIFE.                                                                                                                        \nGET DUCKED BY ATTENDANCE .                                             \nGET DUCKED BY ASSIGNMENTS.                                         \nGET DUCKED BY PROFS WHO PERSONALLY HATE U.            \nGET DUCKED BY OUR CURRICULUM.                                     \nGET DUCKED BY OUR TOUGH ASS EXAMS\nGET DUCKED BY OUR FUCKING GRADING SYSTEM.             \nWE WANT YOU TO FAIL(310 PPL FAILED IN MATH). \nWE WANT U TO SUFFER.                                                       DUCK U ALL STUDENTS.                                                                               \n                                                                                                  \n                                                                                                  \nFUCK U PES                                                                             \nI LITERALLY MEAN FUCK YOU.                                            \n                                                                                                    \nFUCK U ONE MORE TIME.                                                      \n                                                                                                  \nOK FOR THE LAST TIME FUCK YOU",
  "metadata": {
    "author": "PYUchiha7",
    "url": "https://www.reddit.com/r/PESU/comments/1dp6in5/duck_pes/",
    "permalink": "/r/PESU/comments/1dp6in5/duck_pes/",
    "score": 79,
    "created_utc": 1719428397,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "laemd3g",
      "body": "FUCK U MORE                                                                                          (THIS IS THE LAST)"
    },
    {
      "id": "laenfwo",
      "body": "You know you can just say \"FUCK\" right"
    },
    {
      "id": "laeo8j8",
      "body": "I was not actually that frustrated when I was writing those lines. As I continued I got to know my friends fucked up heavily too, so yeah switched to original"
    },
    {
      "id": "laeuspn",
      "body": "I am thinking of partial drop from PES. how delusional am I?"
    },
    {
      "id": "laew5u9",
      "body": "Ik a guy who sits right in front of me, he took partial drop too, his sgpa for sem 1 was 6-7 and his mains are 96-97 percentile in both attempts (he scored more in his pu days).\nHe tried for advance,but after the exam he gave up hope.Now at the end he almost ignored sem 2 and is preparing for BITS. Idk abt u,can't comment,but yeah u have to be a genius if u want to balance everything"
    },
    {
      "id": "lafayr9",
      "body": "Fr bruh"
    },
    {
      "id": "lafcyg8",
      "body": "Also get fucked by overpriced canteens bruh"
    },
    {
      "id": "lagart9",
      "body": "Ohhh. Results came?"
    },
    {
      "id": "lagqhl0",
      "body": "Real, results were fucked for us also. CS results in RR was bad. Most got Cs and Ds this sem. My gpa stagnated, didn't increase or decrease lol."
    },
    {
      "id": "lagtp58",
      "body": "More strength to u guys as ur placements are nearing.                  I hope companies ease their gpa criteria."
    },
    {
      "id": "lagy8uh",
      "body": "Add to that, get ducked by the club activities that were supposed to be fun🤡"
    },
    {
      "id": "lagzngx",
      "body": "Second sem results came?"
    },
    {
      "id": "lah4cxc",
      "body": "Yeah, Fuck PES. I'm so happy I'm done with it now"
    },
    {
      "id": "lah4pyn",
      "body": "Omg which college did I join 😭"
    },
    {
      "id": "lah58au",
      "body": "I hope I'll be done with it before I am done with myself"
    },
    {
      "id": "lah5jz5",
      "body": "First time?"
    },
    {
      "id": "lah6cod",
      "body": "im sorry but yall are pathetic"
    },
    {
      "id": "lah7n0y",
      "body": "Can u explain what you mean by that, I'm deciding on whether to join pes or not"
    },
    {
      "id": "lahf0xd",
      "body": "+1, FUCK PES, WHY DOES THIS FUCKING COLLEGE EVEN EXIST, THE BIGGEST MISTAKE OF MY LIFE WAS JOINING PES, ANYONE WHO STILL DIDN'T JOIN PES WOULD BE DOING A FAVOR TO THEMSELVES."
    },
    {
      "id": "lahh1ld",
      "body": "Why"
    },
    {
      "id": "lahhjpk",
      "body": "Clubs shouldnt affect your decision of college relax, they aren't mandatory. But basically some of the clubs here tend to plan events last moment and don't exactly respect time and efforts from the side of the club members. The club heads are insanely out of touch with the rest of the team and after a point, even if you joined just for fun you stop enjoying and it just adds to your never ending pile of work"
    },
    {
      "id": "lahp0ik",
      "body": "Curriculum ☠️"
    },
    {
      "id": "lahvs43",
      "body": "yes they arent mandatory but yk, if i join might as well have decent clubs(i thought id join like 4 different ones and theyd be awesome cuz pes)"
    },
    {
      "id": "lahwjq8",
      "body": "One year to go Brodie. Hang in there"
    },
    {
      "id": "lai161b",
      "body": "![gif](giphy|n48QIy84cYwopQMLOX|downsized)"
    },
    {
      "id": "lai3djq",
      "body": "Im about to join PES this year,just tell me wheter PES is more hectic than jee prer or not ao i'll have an idea"
    },
    {
      "id": "laic9nc",
      "body": "SKILL ISSUE. FR. 💯"
    },
    {
      "id": "laiv6ll",
      "body": "everytime a post of this subreddit comes up on my page (idk why but it does) I feel so happy to have left PES. Man I love my college."
    },
    {
      "id": "laiyfrn",
      "body": "Which clg are u in brother?"
    },
    {
      "id": "laiz067",
      "body": "BITS Pilani"
    },
    {
      "id": "laj5gia",
      "body": "Bro won 2 times"
    },
    {
      "id": "laj6iwr",
      "body": "Update us on how his BITSAT goes. Because if their BITSAT is screwed up too then dude would have effectively fucked up both PES CGPA as well as partial drop"
    },
    {
      "id": "lajeiw4",
      "body": "I'll try to get in contact with him.It takes time though,I'll reply here itself if I manage to do it."
    },
    {
      "id": "lajj3u4",
      "body": "Sure, thanks."
    },
    {
      "id": "lajj9tp",
      "body": "Make this the most upvoted on r/PES"
    },
    {
      "id": "lanc066",
      "body": "Yes lmao lmk too"
    },
    {
      "id": "laoj5l7",
      "body": "u joined pes and then left?"
    },
    {
      "id": "laojb9c",
      "body": "same, rip us 😭"
    },
    {
      "id": "lap8ai0",
      "body": "I paid fees after round one pessat counselling when I got CSE in RR campus. I had spoken to BITS seniors, the director or some guy of pes was placing before me the most medicore of stats and some old as satellite with Modi's tweet n shit. They told electives and I was like \"huh that's all?\" (In context BITS has 40+ electives of CS alone and we can do any course of any other department as well if we're interested)\n\nSo I told my parents to withdraw their money (10k gone). Either I go BITS else I take a drop and try for some other good college. \nThankfully I didn't have to take a drop and got BITS. So yay."
    },
    {
      "id": "lapn5qw",
      "body": "Which branch?"
    },
    {
      "id": "laq6qf9",
      "body": "ece 🤡"
    }
  ]
}