{
  "id": "1dp6lpf",
  "title": "PES CS RR OR BITS MECHANICAL?? LIFE AT PES?",
  "content": "I have already taken admission in PES RR CAMPUS CS (through PESSAT btw), although it's refundable if i give up my seat before 2nd round of counselling of PES, got around 230 in 1st attempt of BITSAT, got my 2nd attempt tmrw, really confused wht to do if i get Mechanical at BITS (asking abt Mechanical, cuz if i getting any branch above it, obviously i'll go and anything below it i wont), cuz they both gonna cost almost the same, and also been hearing pretty good stuff abt PES Placements lately, so a lil confused.  \n  \nAlso heard a lot about how strict PES is and stuff, can anyone please elaborate how hard or stressful life at PES really is (I'm pretty good in CS, not saying on the basis of 12th marks or smtg, just had interest in it so got good with time, and also i was in coaching for 11th 12th, so my Phy and Maths is pretty good as well) ? do u get time for other stuff ?  \n  \nHow strict is the Boys Hostel, especially abt the last entry time and stuff ?\n\nHow hard is it to avail the 40% , 50% fee waiver scholarship, is it semester wise, or if u avail it once, it's permanent for the 4 years, and also are there any additional conditions or problems that they aren't mentioning?\n\nJust in general what all should i know about PES before joining that they aren't telling?\n\nAlso is it possible to do some side hustle in PES, like freelancing and stuff?\n\n(Thanks a lot in advance for anyone taking their time to answer, sry for so many questions, just a lil too confused and anxious)",
  "metadata": {
    "author": "Phantom0p",
    "url": "https://www.reddit.com/r/PESU/comments/1dp6lpf/pes_cs_rr_or_bits_mechanical_life_at_pes/",
    "permalink": "/r/PESU/comments/1dp6lpf/pes_cs_rr_or_bits_mechanical_life_at_pes/",
    "score": 1,
    "created_utc": 1719428585,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "laen5q1",
      "body": "Go to bits"
    },
    {
      "id": "laequ4m",
      "body": "I commented about BITS vs PES in the last post posted earlier today [here](https://www.reddit.com/r/PESU/comments/1doxx78/comment/lad10qi/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button). Here is the summary of the comment quoted from the other post:\n\n>To summarise, you will have to see which is more important to you. If all you care about is getting the best package and are ok with sacrificing your interests, then BITS. Otherwise, you might be better off at PES.\n\nChoose BITS if you want that brand name and better salary right out of undergrad, but at the risk of sacrificing your interests. Else study your interests at PES while working hard to create opportunities for yourself so you can match the pay scales by BITSians.\n\n>Also heard a lot about how strict PES is and stuff, can anyone please elaborate how hard or stressful life at PES really is\n\nYou can refer to these comments. They outline everything about academic rigour.\n\n* [https://www.reddit.com/r/PESU/comments/1d66ywv/comment/l6qhycx/](https://www.reddit.com/r/PESU/comments/1d66ywv/comment/l6qhycx/)\n* [https://www.reddit.com/r/PESU/comments/1do5u5x/comment/la7g42j/](https://www.reddit.com/r/PESU/comments/1do5u5x/comment/la7g42j/)\n\n>How strict is the Boys Hostel, especially abt the last entry time and stuff ?\n\nI was not in hostel, so I will let someone else answer this. You can also search through the subreddit or post this on discord.\n\n>How hard is it to avail the 40% , 50% fee waiver scholarship, is it semester wise, or if u avail it once, it's permanent for the 4 years, and also are there any additional conditions or problems that they aren't mentioning?\n\nEach scholarship is semester-wise, so you need to be in the top x% every semester to avail it for the given semester. As for how difficult, it depends on how the batch performs since there's no minimum GPA based filter. If the batch performs well, it will be tougher while if the batch underperforms, its usually easier. Said that, usually an 8.75 guarantees the \"lower\" scholarship (they keep messing around with the names so its hard to keep track) while a 9.5+ usually guarantees the higher one. A 7.75 is enough for DAC, which is the lowest one. More details can be found [here](https://www.reddit.com/r/PESU/comments/1aob1yt/comment/kpy21v0/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button).\n\n>Just in general what all should i know about PES before joining that they aren't telling?\n\nToo broad and vague to answer. Just know that you are in for the experience of a lifetime lmao. You will definitely walk away a changed man and will witness things that are beyond your wildest dreams.\n\n>Also is it possible to do some side hustle in PES, like freelancing and stuff?\n\nDepends on how well you manage time. I know some people who were able to do it. It all goes down to your ability to balance academics and work."
    },
    {
      "id": "lagqzfi",
      "body": "Hi when is round 2 PESSAT counselling?"
    },
    {
      "id": "laj2c52",
      "body": "x"
    }
  ]
}