{
  "id": "1dpgzzg",
  "title": "background: I live in blr, don't really wanna move to chennai but my parents think that srm ktr has a better brand name than pes ec (as it's not the main campus). Please advise. also they're completely okay if I get PES RR CSE via kcet",
  "content": "\n\n[View Poll](https://www.reddit.com/poll/1dpgzzg)",
  "metadata": {
    "author": "Time-Hyena-6584",
    "url": "https://www.reddit.com/r/PESU/comments/1dpgzzg/background_i_live_in_blr_dont_really_wanna_move/",
    "permalink": "/r/PESU/comments/1dpgzzg/background_i_live_in_blr_dont_really_wanna_move/",
    "score": 0,
    "created_utc": 1719456954,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lagvqcp",
      "body": "Since when did SRM have a better brand name than PES? Both PES campuses are all the same anyway - your degree/transcripts won't mention which campus you're from so it's not like someone's going to be able to tell the difference. \n\nPES is much better than SRM, across several parameters."
    },
    {
      "id": "lagx1ns",
      "body": "Hmm I see. I think they believe it's that way because PES isn't known as much outside of karnataka? Should that be of any concern, or does it even matter as much? And will staying in bangalore help me in getting better internships since well blr is the IT hub of india?"
    },
    {
      "id": "lah5eb1",
      "body": "Bruh when you get your degree certificate it'll just say pes \n university not pes(rr) or pes(ec) so chill"
    },
    {
      "id": "lah7lri",
      "body": " 1. I wouldn't recommend SRM considering how they conduct their Remote Proctored Online Exam (People basically write entrance exams from homes) \nThe majority of the people cheat in this exam, and due to this, you never know what kind of peer group you would b getting in SRM. I personally know people who couldn't even secure Mech in PES (through PESSAT )join SRM KTR last year\n2. SRM student intake is insanely high. It's basically just another VIT or worse. When u compare student intake of SRM KTR and Chennai , PES student intake (considering all branches) is barely a fraction of it.\n\nAnd as a PESticide it feels bad when u compare PES to SRM 😭"
    },
    {
      "id": "lahdadh",
      "body": "pes rr= pes ec"
    },
    {
      "id": "lahocyt",
      "body": "I do agree with both of your points which is why I was a bit skeptical. And I'm sorry 😭"
    },
    {
      "id": "laj230l",
      "body": ">PES isn't known as much outside of karnataka?\n\nUnderstandable, but honestly that is because SRM has an astronomically larger intake. Until a few years ago, PES' entire CS intake was just 600. At the same point in time, SRM's intake was already 1000+. SRM is simply more popular because more students get a shot at it. But objectively when you compare factors that matter, PES is the superior choice any day.\n\nAnd about reputation - unless you are from IIT/NIT/IIIT/BITS or other T1 Unis, there is no special treatment for your university. Its all under the same category.\n\nAnd yes, location does play a huge advantage. Compare placement stats this year from PES compared other colleges in country on par with PES. You will see that PES has performed significantly better because of the location, which brought in more startups and the like."
    }
  ]
}