{
  "id": "1dpkr3m",
  "title": "CIE L1 doubt ",
  "content": "Just finished 1st year. We've got a notification saying that we need to fill up the pre registration form by 5th July... is it really necessary to do so by then or can we register once the remaining special topics list comes out? also if we do pre register for it now but decide to pick a different one later are we allowed to switch later on?  TIA",
  "metadata": {
    "author": "Student535",
    "url": "https://www.reddit.com/r/PESU/comments/1dpkr3m/cie_l1_doubt/",
    "permalink": "/r/PESU/comments/1dpkr3m/cie_l1_doubt/",
    "score": 3,
    "created_utc": 1719470364,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lahjtk2",
      "body": "U can register after the special topics list is released  but u would have to request the CIE mentors to add you , and u can withdraw from it too if u find any other special topic intresting"
    },
    {
      "id": "lahspbw",
      "body": "Take it only if u r interested.. I had a pretty bad experience with my team \nWe had a heck lot of things to do and submit before deadline"
    },
    {
      "id": "lai1f38",
      "body": "wait where did you find this form? also rr or ec"
    },
    {
      "id": "lai4i9d",
      "body": "it's on pesuacademy, I'm from rr"
    },
    {
      "id": "lai4qy5",
      "body": "oh ok, how scoring is it though? (my 2nd sem sgpa hasn't been the best and I'll really have to try and better it next sem)"
    },
    {
      "id": "laio5cq",
      "body": "Its easy.. just 1 isa and esa will be presenting your startup idea to external jury. \n\nYou just need to have a really good team and a really good idea. the least grade given is B and majority get A grade from this special topic course"
    },
    {
      "id": "lannngs",
      "body": "Lol my friend got a c"
    },
    {
      "id": "lansklw",
      "body": "lol sad fella.. which year did he do L1?"
    },
    {
      "id": "lansofj",
      "body": "Just last year 3rd sem"
    },
    {
      "id": "lansv7b",
      "body": "ahh I did in 4th Sem, so I didnt know"
    }
  ]
}