{
  "id": "1dpmntf",
  "title": "Doubt Regarding Course Credits",
  "content": "Could someone please clarify this?\n\nFor CSE/AI&ML, how many credits do we need to graduate? Could you provide a breakdown of how the credits are split across each sem and the weightage of Capstone Project, Special Topic, Internship etc.?\n\nHow many of these credits we need to secure before 7th sem i.e., by the time placement starts?\n\nIs there a cap on the max number of credits we can gain in 1 sem?\n\nHow much min credits do we have to keep to be completed in 4th year or like what is the max number of credits we can obtain before 7th sem (start of placement)?\n\nThankyou",
  "metadata": {
    "author": "Head_Fish794",
    "url": "https://www.reddit.com/r/PESU/comments/1dpmntf/doubt_regarding_course_credits/",
    "permalink": "/r/PESU/comments/1dpmntf/doubt_regarding_course_credits/",
    "score": 4,
    "created_utc": 1719478540,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lahzt3w",
      "body": "You need to have 160 credits by the time you graduate. \n\nYou can earn either 24 or 22 credits in total, this is only the main subjects. There will be special topics (2 credits), internships etc. that you can take up in order to get more credits. \n\nYou can earn credits in summer too, by doing special topics and internships.\n\nIn your 4th year, you will have to earn 12 and 8 credits in your 7th and 8th semester respectively. This will include your special topics, swayam courses, MOOC courses, internships and capstone project."
    },
    {
      "id": "lahzuva",
      "body": "I'm not sure about the maximum credits you can earn each sem. You can ask your mentor about that."
    },
    {
      "id": "lahzxgr",
      "body": "This is all based on what I learned during my time in PES. The credits each sem vary so it's best to ask your mentor."
    },
    {
      "id": "laj01g1",
      "body": "Max credits per sem is 24 (including the optional special topic)."
    },
    {
      "id": "lajlert",
      "body": "Thankyou"
    },
    {
      "id": "lajnkhn",
      "body": "3rd and 4th sem has 22 mandatory credits, so if I take a special topic in 4th sem and then get an internship in the summer (in college or outside), will I get those internship credits listed in the 4th sem or 5th sem grade card? And in 5th and 6th sem, is the total mandatory credits 20 or 22? Because if it's 22 and say the 2 credits of the internship/special topic I did in the summer gets transferred to the 5th sem, will I not be allowed to take up any special topic that sem as I've already got 24 credits for the sem?   \n\nAlso, if I take up a special topic during the summer say after 4th sem, will it's credits come under 4th or 5th?"
    },
    {
      "id": "lajo1b9",
      "body": "For the CNR/MRD Scholarships, do they look at grading of all courses taken up by the student (including special topic and other credits) or do they only look at the mandatory courses everyone in that branch have?"
    },
    {
      "id": "lajs2kx",
      "body": "The scholarships are based on CGPA. So yes, they look at only the mandatory courses for these scholarships."
    },
    {
      "id": "lajskgx",
      "body": "It depends on your SGPA as well. If you get a good SGPA in one sem, you get half of the scholarship amount. If you do just as good in the next sem you get the other half. Otherwise you don't."
    },
    {
      "id": "lajullp",
      "body": "not sure if special topics will be considered"
    },
    {
      "id": "lakhuws",
      "body": "u/rowlet-owl"
    },
    {
      "id": "lakkhlz",
      "body": "> will I get those internship credits listed in the 4th sem or 5th sem grade card?\n\nInternship credits (max = 6) always reflect in the 8th semester's results, even if you have split them into multiple internships. So whether you split it as:\n\n* 6: Claim all 6 in the 8th semester\n* 2+4: Claim 2 in the summer after 3rd year and 4 in the 8th semester\n* 2+2+2: Claim 2 in the summer after 2nd, 2 in the summer after 3rd and 2 in 8th semester\n\nYou will see the results for all combinations only in the 8th sem results.\n\n>And in 5th and 6th sem, is the total mandatory credits 20 or 22?\n\nI don't quite remember + PES keeps changing things. Since internship credits only reflect in 8th sem you can take up special topics as long as they are offered in a semester because they will still be under the max credit limit.\n\n>Also, if I take up a special topic during the summer say after 4th sem, will it's credits come under 4th or 5th?\n\nTbh I do not remember anymore. I think they show up as summer course credits? I personally never took any summer courses so I cannot say *where* they show up but I do know that they do show up and count towards the requirement and people have used them to swap for STs in future sems"
    },
    {
      "id": "lamutcr",
      "body": "the scholarships are based on your overall sgpa/cgpa so if you've taken a special topic, it'll include that grade too"
    },
    {
      "id": "lan8oyf",
      "body": "How many total mandatory credits you guys have in 5th and 6th sem? Is it 20 or 22?"
    },
    {
      "id": "lan8w70",
      "body": "Thankyou!"
    },
    {
      "id": "lanb8g6",
      "body": "This is how it was for me. This is only mandatory courses. \n\nFirst 4 semesters - 22 credits\n5th sem - 22 credits\n6th sem - 24 credits\n7th sem - 12 credits\n8th sem - 8 credits\n\nTotal - 154 credits\nExtra credits you need to earn- 6 credits"
    }
  ]
}