{
  "id": "1dqrny7",
  "title": "Bits vs Pes",
  "content": "Obv ik bits is better but my bits went hell and now my father will think like I didn’t try hard enough or anything and idk where he heard ki Pes dosent have good placements and it’s a shit college so now I need points to for Pes to convince him it’s good and I’ll get a good placement, for example I have one point that Pes highest package 2023 was 65lpa and bits was 60lpa",
  "metadata": {
    "author": "JellyfishLonely9155",
    "url": "https://www.reddit.com/r/PESU/comments/1dqrny7/bits_vs_pes/",
    "permalink": "/r/PESU/comments/1dqrny7/bits_vs_pes/",
    "score": 0,
    "created_utc": 1719601956,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "laqlq3c",
      "body": "🫡"
    },
    {
      "id": "larv2dj",
      "body": "If you replace the\"b\" in bits with a \"t\", you get tits\n\nIf you replace the \"p\" with a \"b\" and add a \"t\" at the end, you get \"best\"\n\nCoincidence!!?? I think not!!!"
    },
    {
      "id": "lasbe3i",
      "body": "\"PES UNIVERSITY\" has 14 characters (including whitespace)\n\n14 is a multiple of 7. \n\nThala for a reason."
    },
    {
      "id": "lasebad",
      "body": "Loda for a reason"
    },
    {
      "id": "lasecgn",
      "body": "Frfr"
    },
    {
      "id": "lasft68",
      "body": "Highest package comparison 🤡"
    },
    {
      "id": "lasfwj1",
      "body": "Only point in where pes is better than bits is that its located in bangalore , but bits hyd kinda negates that point"
    },
    {
      "id": "lasnbm3",
      "body": "Rowlet-owl Anna = 14 characters multiple of 7 thala for a reason"
    },
    {
      "id": "lasnbn0",
      "body": "Haan toh bhai I agree bits better hai but meri vaat lagni hai aaj shaam ko"
    },
    {
      "id": "lasq13u",
      "body": "Pes = piss\nBits = best"
    },
    {
      "id": "lassmfl",
      "body": "Bhai pes ke advantages hai but you can't really expect anything better than bits. NitK is good but there's nothing better in it when compared to iitB"
    },
    {
      "id": "lasukoh",
      "body": "Ik bhai ik I just want points to defend Pes and not like this is my only option merko vellore aur bms wagera mil jayega nit Srinagar wagera bhi mil rha hai but unko kaise samjhaun ki meri choice hai majburi nhi, abh jaise I was looking at IIT jammu placement stats and cse ke liye it’s exactly like Pes so woh sab bolke dekhenge"
    },
    {
      "id": "lasz41n",
      "body": "how about comparing median packages instead of highest ones.   \ncheck out the pinned post abt pesus pros and cons by rowlet-owl . ull get some ideas"
    }
  ]
}