{
  "id": "1dr3lev",
  "title": "BITSAT: 226, Already have CSE at Manipal and VIT",
  "content": "Got 226 in BITSAT second attempt. I already have CSE Core in VIT Chennai and Manipal BLR. In BITS, will probably get MSc dual. What should I choose. Couldn't get PESU RR CSE, did not take EC CSE.",
  "metadata": {
    "author": "OkRecognition2932",
    "url": "https://www.reddit.com/r/PESU/comments/1dr3lev/bitsat_226_already_have_cse_at_manipal_and_vit/",
    "permalink": "/r/PESU/comments/1dr3lev/bitsat_226_already_have_cse_at_manipal_and_vit/",
    "score": 3,
    "created_utc": 1719637561,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lasin5c",
      "body": "I think you should take the dual degree in a field you're interested in"
    },
    {
      "id": "laspedq",
      "body": "Hey man, i have slightly better options than u, VIT vellore core cse and manipal main campus core cse and scored around the same in bitsat\n\nI wont be getting a dual i want in bits(will only get bio/chem best case) so im leaving it for pes rr cse, u might get cse in 2nd round if ur rank in close to cutoff\n\nHonestly pes rr cse aiml is also better than ur current options tbh"
    },
    {
      "id": "lasqpac",
      "body": "Choose Manipal Main CSE, not PESU."
    },
    {
      "id": "lasr0zg",
      "body": "Last year cutoffs - [https://www.bitsadmission.com/bitsat/2023/BITSAT-2023\\_Cut-off\\_Scores.pdf](https://www.bitsadmission.com/bitsat/2023/BITSAT-2023_Cut-off_Scores.pdf)"
    },
    {
      "id": "last12e",
      "body": "Cutoffs are gonna rise by a LOT this time, i wouldnt keep my hopes up for same cutoffs as last year"
    },
    {
      "id": "last6tj",
      "body": "I thought about it a lot man, i have personal reasons for staying in Bangalore and from what i can gather the only reason people recommend manipal is because of campus life, that is not a huge priority for me rn\n\nMy father is also at a pretty high position in tech and he did not get good reviews of manipal from any of his colleagues/friends who own their own companies \n\nLooking at all this i decided pes is the better choice for me, might not be for everyone tho"
    },
    {
      "id": "lasuzc0",
      "body": "I'd say campus life is one aspect. I have friends from Manipal who all say that there are a lot of opportunities to build your profile when it comes to placements and MS admissions. Manipal also has semester exchange programs with quite a few well known Unis in the US. All of these matter so much more than your campus life benefits. The only reason I do recommend Manipal is because of this. PES is nothing but it's placements. You will not have any of the opportunities you are sacrificing on. And you are already aware of college/campus life. \n\nWhen you have an option that delivers the placements of PES (and slightly better) plus significantly better benefits, why are you letting it go? PES' research clubs are all shutting down. There's barely any good research here, and profs are all mediocre except a handful. Management is a shitshow. No semester exchange programs. No college life. You'll be paying 5L per year just for the placements and nothing else. \n\nOf course the final decision is yours. I'm just here trying to ensure you take a well informed decision."
    },
    {
      "id": "lasvsir",
      "body": "Ah, well what would u recommend to someone who does not want to go abroad at all? I had an opportunity to go the US for my bachelors but i ended up turning it down as im not really inclined to go there and work till the end of time, indians on H1B there cant start a business and the whole thing seems very restrictive to me\n\nMy goals are building something truly worthwhile and quite ambitious frankly, im privileged in the sense that i do not have to really work for money and will always have a safety net in life, so the go to US work a job and earn money route doesnt appeal at all to me, im very entrepreneurially inclined and Bangalore does have good opportunities to explore\n\nI want to take a different path through life and going abroad for work isnt for me\n\nAnother reason that may seem silly is that, i have the love of my life and tons of friends here, so thats why campus life is a null point for me\n\nDont get me wrong, if i had gotten msc eco at bits pilani i wouldve left in a second, but somehow i cant see the benefit of leaving all this to go to manipal\n\nIs the condition at pes really that bad?"
    },
    {
      "id": "laswemn",
      "body": "That's ok. Let us wait for the counselling results. I am by nature optimist :)."
    },
    {
      "id": "laswpt3",
      "body": "Yea true, which college u deciding on then, except for bits i mean"
    },
    {
      "id": "lat1gmf",
      "body": ">Ah, well what would u recommend to someone who does not want to go abroad at all?\n\nWell in that case it brings down the difference but Manipal is slightly ahead. Both have similar placements. Although you'd arguably find way better campus opportunities from research and other student clubs at Manipal. It might not directly affect placements but will definitely help you shape your profile and prepare you for a job. \n\n>im very entrepreneurially inclined and Bangalore does have good opportunities to explore\n\nIf you're pretty sure about staying in BLR for the entrepreneurial benefits, then that's a fair decision. The city does have its location advantages over Manipal and frankly that's what saved PES from having a horrendous placement season this year. If your goal is to start your own venture then being in Bangalore and studying at PES might be a better option. However I'm saying this purely from the fact that I do not know about the startup culture in Manipal. Maybe find out more but all I do know is that PES does have a decent support system for startups and entrepreneurs.\n\n>Another reason that may seem silly is that, i have the love of my life and tons of friends here, so thats why campus life is a null point for me\n\nA little bit of life advice - you need to get out of your comfort zone from time to time. The only way we can grow is by getting out of our shells. Putting yourself out there, gaining new experiences and making new friends is all a part of life. Remember that everyone in your life can be there today and gone tomorrow. Cherish whatever time you have with them, but also look forward to new memories. Because gaining new experiences and friends does not mean getting rid of old ones. \n\nI'm 24. I'm still in touch with my school friends. Most of them have left the country (and are spread across different ones too) and are working abroad but we still make time for each other through regular video calls. I'm also in touch with my first ever friends from college from when I was 18, and some of them have left the country too, and I'm leaving the remaining this year. \n\nIf your friendship is as strong as you say, it will last. Life is about cherishing old memories as you make new ones. You can't live in a bubble all your life. It's scary, definitely, but what's life without a little adventure? Remember the good times but don't let that stop you from seeing what the world has to offer. Your friends and your partner will always be there for you, but this time to explore will not. \n\n>Is the condition at pes really that bad? Also dont get me wrong, im still open to suggestions and if u could help me, seeing my full situation that would be great\n\nYou can check the pros and cons on the FAQs. It's documented in detail. But yes. It's pretty bad. The only reasons I recommend PES nowadays is (1) you are getting CS through CET and (2) all you care about is a good package at the end of 4 years. Unless you don't have better options at comparable costs, there is no reason to join this place. As I said, PES is nothing without its placements and crowd. \n\n>Also another reason im hesitant for manipal is that a close family friend of mine went to manipal last year and ended up getting addicted to drugs\n\nDrugs are everywhere, in every college, from IITs to even PES. There are lowlifes in every college that peddle drugs. It depends on your self control and tendencies. The only difference between Manipal and other colleges is that other colleges manage to hide it well while Manipal does a shit job of doing it.\n\nI'd highly recommend you joining the discord server and listening to more opinions on your dilemma. My DMs are open too. At the end of the day, the decision is yours. However it's important to know all the facts before making a decision."
    },
    {
      "id": "latar66",
      "body": "Hey man why don't u take bio as dual?"
    },
    {
      "id": "latshsj",
      "body": "I just cant study biology man, i do not really like the subject and its not what i want to do with my life"
    },
    {
      "id": "latsqm7",
      "body": "Thanks for the really descriptive comment man, helped me a ton!\n\nYou are right about me being comfortable inside my bubble\n\nI will think a bit more about this and see, gonna weigh my personal pros and cons once more"
    },
    {
      "id": "lau7sft",
      "body": "Well the good thing is bio has some of the chillest profs so grading ain't a prob and also bio in college is applied bio it's somewhat diff than the one u study in school so it will be a bit interesting and also bio is really easy compared to those hectic and egotistical graded math phy and chem\nbut still ur choice man it's better to grind in college than in drop because God knows the competition next year \nI got a similar score (222) hoping for msc bio"
    },
    {
      "id": "lb9yuvf",
      "body": "Honestly bruh pes rr cse is op but specialization in Ai ml isn't, it's jus narrows down your subjects in the final years and I have heard from my seniors that it's only worth it if you are doing a masters in it too... Unless once just wants to do it for a degree sake and low-key a backup option then staying in Blr and taking up pes is worth it imo"
    },
    {
      "id": "lbaq9mu",
      "body": "Yea cse with specs limits u but its still better than his other options\n\nYep, pes should always be backup college, who will aim for pes lmao\n\nF thats hard, maybe u could get the scholarship? But atb whatever u do"
    },
    {
      "id": "lqsmi45",
      "body": "Thanks for trying to save me man, I joined pes and im regretting so hard rn I feel like dying, my friends in manipal visit beaches every other day and actually enjoy hostel life while im living at home going to jee coaching 2.0, my life sucks so bad man, why didnt I take manipal\n\nCan you tell me anyway to make life bearable here?, I feel like I already missed out on the best 4 years of my life"
    }
  ]
}