{
  "id": "1drdoag",
  "title": "Difference between CSE & AIML?",
  "content": "Not related to PESU but would appreciate if someone can help me out\n\nI'm confused if I should have AIML (I'm not talking about the specialization) my KCET option entry or not, I'm inclined towards programming, \n\n1. what's the difference between CSE & AIML speaking in terms of subjects and opportunities\n2. does AIML cover core CSE topics?",
  "metadata": {
    "author": "ksvk_26",
    "url": "https://www.reddit.com/r/PESU/comments/1drdoag/difference_between_cse_aiml/",
    "permalink": "/r/PESU/comments/1drdoag/difference_between_cse_aiml/",
    "score": 4,
    "created_utc": 1719674772,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lauftox",
      "body": "1a) For Btech there's absolutely no difference in terms of job and placement. There are companies that only want AIMl students , there are some that only want core and there are most that want any based on how ur interview goes. \n\n1b) Core CS is recommended if you dont know anything about AIML and wanna play it safe , also it would be better for Masters if ur planning to pursue one\n\n  \n2) Yes it does , and it has extra topics apart from that too ( like Mathematics for ML )"
    },
    {
      "id": "laumqp2",
      "body": "My suggestion as a graduate \n\nUse your college time to learn basics/core\nThere's enough resources outside college courses to help you specialise later"
    },
    {
      "id": "laun7rj",
      "body": "Thank you!"
    },
    {
      "id": "launikn",
      "body": "Yeah I've heard that from others as well, but colleges have introduced AIML as a branch itself so I was thinking about that, but I'm not sure I wanna get into the AI field yet, but as another fellow redditor recommended i could do AIML for masters"
    },
    {
      "id": "lauo55a",
      "body": "All B.E/BTech in CSE (AI/ML) and CSE (IoT) courses are a scam. Please don't fall for it."
    },
    {
      "id": "lauostl",
      "body": "I wasn't asking about those, but AIML as an entire branch/course\n\nI.e B.tech in AIML"
    },
    {
      "id": "lauqktv",
      "body": "Colleges also act like businesses, they see the demand and react, yes good course \n\nBut for a BTech, i would do CSE with in-college specialisation of AIML or  external courses"
    },
    {
      "id": "lauy7n5",
      "body": "This answer covers most things. However I would like to also attach this link which covers the remaining: [CS vs CS-AIML](https://www.reddit.com/r/PESU/comments/147gamv/comment/jnve51g/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)"
    },
    {
      "id": "lavfzr7",
      "body": "If you take up aiml as ug degree can you get a masters in cs?"
    },
    {
      "id": "lbegomk",
      "body": "Such specialisation is useless for a first degree period! It will hurt same as it hurt IT degrees in the past and everything returned to normalcy."
    },
    {
      "id": "lfnz2l2",
      "body": "will there be any issue in future if my degree saying aiml but i got skills and i want to get placement job roles like software engineer in big mnc ? will only artificial intelligence companies accepts aiml and cse core branch companies? is it safe to get aiml if not getting IT or CSE?"
    },
    {
      "id": "mtr8zqo",
      "body": "Yes bro same question"
    },
    {
      "id": "mtsy393",
      "body": "CSE > IT > SPECIALIZATIONS"
    }
  ]
}