{
  "id": "1drdt4h",
  "title": "PESU Haters need to chill ðŸ¤£",
  "content": "I've been seeing juniors on this subreddit ask for advice regarding PES and many people commenting \"omg there's no college life\" , \"no it sucks\".\n\nDon't pay attention to these random people who probably expect to go to college to party all day ( Manipal is the place for u then ðŸ¤£ðŸ™). If you're a smart , decent , academic student who's willing to study and yes enjoy ( RR campus is beautiful , i don't know when u haters graduated and why you are shitting on it but constructions almost over now and shit is fire) ( the gym and sports facilities are amazing too ) , then PES is the best place for you ( also its in Bangalore and you'll understand why that's advantageous during your 4 years ) \n\nThe only negative feedback would be that it's expensive , but it's not their fault that u didnt do well in KCET and are relying on management/PESSAT.\n\nAlso suicides happen everywhere. There's dumb people who aren't mentally strong enough to cope with stuff and end up killing themself stupidly without thinking about their family members and other things everywhere , so you cant go around saying 'if i join pes ill suicide oh no!' \n\nPosting anonymously so rowlet and whoever else that stalks reddit 24/7 doesen't spam me ðŸ™\n\nAnother thing to mention is , every senior always shits on their own college. I know IIT Kanpur'ians who say that they wished they were in IIT-B and RVCE students say that management/campus/academics suck and etc etc . So don't trust everything they say here and make ur decision independently.\n\n  \nAlso the hate on AIML is completely false  ( u/rowlet-owl ) ðŸ˜‚ , AIML will perform very well and already has a lot of scope , imagine 4 years from now. Placements of most colleges in AIML have been better than CSE, and if u check the syllabus of PES , there's nothing wrong with it. The only con would be that it's a hard subject which again depends on the student. Placements for undergrads in CSE(AIML) will be exactly same if not better than CSE students. The only problem would be for Masters   , which is also not as big of a problem as they make it seem and doesen't affect everyone.",
  "metadata": {
    "author": "Traditional-Bath13",
    "url": "https://www.reddit.com/r/PESU/comments/1drdt4h/pesu_haters_need_to_chill/",
    "permalink": "/r/PESU/comments/1drdt4h/pesu_haters_need_to_chill/",
    "score": 0,
    "created_utc": 1719675133,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "laugxqe",
      "body": "Also suicides happen everywhere. There's dumb people who aren't mentally strong enough to cope with stuff and end up killing themself stupidly without thinking about their family members and other things everywhere , so you cant go around saying 'if i join pes ill suicide oh no!'\n\n-wtf is this reasoning"
    },
    {
      "id": "lauh7gu",
      "body": "anyone who kills themself on the basis of \"academic stress\" , \"oh no i failed an exam\" is retarded . This kind of 'trauma' is not justified enough to take ur life , especially if ur like 19 years old and haven't even lived life"
    },
    {
      "id": "lauijsa",
      "body": "Half knowlege\n\nHalf facts\n\nHalf understanding\n\nFull on meat riding"
    },
    {
      "id": "lauipv6",
      "body": "Would be better if u elaborated on which half I'm wrong about ðŸ’€ðŸ˜‚"
    },
    {
      "id": "lauj3ts",
      "body": "tl ; dr \nthe grass is not always greener on the other side."
    },
    {
      "id": "laulsum",
      "body": "i agree with the first half of what you said but not at all about the aiml part, which you obviously joined. \n\nthe simple fact is that the college is just as clueless as we are about the subjects. they are half baked, and for us 5th sem people we don't even know what subjects we'll have. \n\nnotice how you can be a student of a college and yet not be a full time cuck for them."
    },
    {
      "id": "lauo9s3",
      "body": "So, my job allows me to hire developers (not HR)\n\nI understand why you are defending AIML; it has some truth to it; however, in your eventual placements - what we (hiring companies) look for while hiring freshers for start-ups is how strong is the fundamentals\n\nSo, irrespective of the stream, build your fundamentals. Btech Degree can be used to build a foundation; and luckily you have enough online resources to specialise during/after college degree. So yes, AI ML is relevant af (my company is also building for it) but, fundamentals is key\n\nAnd coming to Rowlet; you absolutely have no idea how much he has done in college and the knowledge he has; and if he's suggesting something, think of it as a good senior's advice. He's an amazing guy who has helped too many juniors by giving unbiased and amazing advice. As a senior, what he's saying is just advice, it's on you to take it or not! \n\nAnyways good luck on your degree and remember, build fundamentals and a strong foundation"
    },
    {
      "id": "lauraa7",
      "body": "100 % agree with rowlet on most aspects but him misguiding aiml students is not one of those things. Some dude asked how to start aiml prep cuz hes taking it this year and rowlets reply was , \"to start by switching to another branch\" ?? ðŸ˜‚\n\nAlso quick question , I understood your point about working on skill over degree... These companies' decisions solely rely on our projects and interview and skill right , and not if we are aiml students , or cybersec or core cs"
    },
    {
      "id": "laurn13",
      "body": "Wdym by clueless. Are you implying that the teachers dont know what they're teaching in the past 2 years of aiml ? If you're talking about 3rd year syllabus , they'll obviously release it before 3rd year starts , its a new branch and its the first time theyre doing it so dont call that being clueless."
    },
    {
      "id": "lauveid",
      "body": ">Also the hate on AIML is completely false ( u/rowlet-owl ) ðŸ˜‚ , AIML will perform very well and already has a lot of scope , imagine 4 years from now. Placements of most colleges in AIML have been better than CSE,\n\n>Placements for undergrads in CSE(AIML) will be exactly same if not better than CSE students. \n\nHalf knowledge at best. \n\nAs someone who literally has been in this field for almost 4-5 years now AND knows how recruitment for these roles work, trust me when I say I know what I am talking about. The roles you see which brand themselves as \"ML Engineers\" - they aren't ML roles. You will not be doing any ML work. These are glorified Cloud Engineers or DevOps (nowadays called MLOps) roles. And what work do they do? They simply work with existing models and ship them to customers for their use. And what skills do they need? Holy shit what a surprise they need to know topics like OS, cloud, networking and so on which (again wait for it) are core CS fundamentals. You will be using zero knowledge of ML for these roles, that's why you will be seeing CSE grads and SWEs primarily working in these positions. I've spoken to engineers at multiple companies - most, if not all, engineers in these roles don't really know what ML topics they are working with and neither is it required.\n\nSo now your question might be, \"wait, whats a proper ML job?\" - these are researcher/scientist roles (often called Applied Scientist) which are reserved for applicants with *at least* a Masters degree AND years of research experience. Just make a quick google search and you will find that even the most entry level role in this field requires at least a couple of years of experience which means that these aren't roles for undergrads. There are about a handful of roles at most which do recruit undergrads, but getting into them is close to impossible. These are pure research driven roles in which you pursue research like an academic setting. \n\nUnless you are someone who wants to get into research, you have the same career prospects as someone in core CSE. Also, the drawbacks of AIML were never in its placements because it was always known that people would jobs from the former category.\n\n> and if u check the syllabus of PES , there's nothing wrong with it. The only con would be that it's a hard subject which again depends on the student. \n\nLMAO. PES is merging core courses together. Its teaching courses like Big Data which are often correlated with concepts in OS and networks without teaching them first. And nobody knows which courses get the same treatment in 3rd year. Meanwhile, students in CS not only get to cover all the CS fundamentals but they get to cover the *same* ML courses as electives. People opting into a mathematical field without even knowing that they are is the biggest con. It wouldn't have been an issue if PES *added* AIML coursework to CS coursework, and not replaced bits and pieces to make a mishmash of whats there.\n\n>The only problem would be for Masters , which is also not as big of a problem as they make it seem and doesen't affect everyone.\n\nReally want to see how kids from AIML cover courses like Adv. computer architecture or compilers or other core CS coursework in MSCS programs without covering the base courses in undergrad. And this is if they consider you for admission. As the prestige of the program you are applying to increases, so does how keenly they look into what coursework you have covered. If US Unis already consider courses like compiler design in PES to be inadequate for undergrad level, you think courses which are a mishmash of multiple ones do any better?\n\nOf course, you are free to assume that I have no clue what I am talking about and that I pull shit out of my ass."
    },
    {
      "id": "lauvmp2",
      "body": "I'm not misguiding anyone. I just shared my opinions on the matter. And given that it is not just me who says this but also people who graduated before me as well as after, there might be at least a glimpse of truth to what I am saying."
    },
    {
      "id": "lauwnex",
      "body": ">Are you implying that the teachers dont know what they're teaching in the past 2 years of aiml\n\nGiven that the profs which are teaching AIML courses now were (1) not even teaching ML courses a couple of years ago or (2) specialise in different CS fields, I would highly question it. Forget that, you are probably too new to even know that PESU profs from multiple branches have been going through AIML training since 2021-ish so they can \"adapt\" to teach AIML. If these are the same profs teaching you these courses then you have my condolences.\n\nThere are about a handful of profs who were specialised enough to teach the course. There were more before, but most have left. Most of the others are jack of all trades."
    },
    {
      "id": "lav7yf3",
      "body": "This is the best proof of Half knowledge is quite dangerous"
    },
    {
      "id": "lave2dz",
      "body": "Yes, but, the only exposure you have to \"coding\" is your college degree... Until and unless you spend a lot of time doing external courses and doubling down on it (possible) you will mostly approach code as the degree you studied in\n\nSo yes, project and skill, but as a fresher, degree will also play a good role"
    },
    {
      "id": "laveiix",
      "body": "Pride of PESU for a reason"
    },
    {
      "id": "laxkll1",
      "body": "Have you every failed? Anybody who makes it here be it pessat or kcet kave a certain degree of criterias met, they may not be extraordinary but they haven't failed shit before , when it happens the first time in your life you will understand,"
    },
    {
      "id": "laxksa8",
      "body": "Have you every failed? Anybody who makes it here be it pessat or kcet kave a certain degree of criterias met, they may not be extraordinary but they haven't failed shit before , when it happens the first time in your life you will understand,"
    },
    {
      "id": "laxmb91",
      "body": "nah honestly the aiml professors as of now are actually quite good\n\nfor big data we had this guy called srinivas katrigupe and for math we had bhaskarjyoti das\n\nboth are pretty good and much better than your average teacher at pes\n\nwhat i meant by clueless is that they are still debating and discussing the courses for 5th sem."
    },
    {
      "id": "laxmhfp",
      "body": "cs people already chose their electives\n\nthere's one month till college starts and we still have no idea what any of our subjects will be. neither do they. that's the literal definition of being clueless"
    },
    {
      "id": "laxni8p",
      "body": "KSS and BJD are great and fall under the handful I mentioned.\n\nYou're yet to meet the specimens I'm referring to"
    },
    {
      "id": "lay0bt5",
      "body": "all the teachers who taught us cs courses like os are shitty. but these two are currently taking the aiml courses and they said that they'd be taking them for our third year as well. \n\n  \ni guess we are just somewhat lucky being the first batch, since the aiml people going into second year now mostly won't get them i think"
    },
    {
      "id": "layra27",
      "body": "Jesus Christ how goddamn privileged can you get? You have no idea what's going on in their heads and it is not as straightforward as you think it is. I can only hope you change your outlook because this is one of the most braindead comments I have ever had the displeasure of reading. Somewhere there is a tree which worked very hard to make the oxygen you're breathing right now, i want you to go find that tree and apologise."
    },
    {
      "id": "lbkcyiz",
      "body": "Bro so is it advisable to take vit vellore core cs over pes ec campus aiml, if I have higher studies plan?"
    },
    {
      "id": "lbkqhhw",
      "body": "If you plan to pursue MS, then unless you are from IIT/BITS/NIT or any other T1 college, your college's reputation does not add anything. So PES = SRM = Manipal = VIT = Thapar = any other college reputation."
    },
    {
      "id": "lbksjsw",
      "body": "Acc to bro NIT Manipur is a tier 1 college ..and VIT is comparable to PESU"
    },
    {
      "id": "lbkt5gu",
      "body": "As someone who went through this process this year, has been following this for a couple of years and is in touch with current students, faculty and alumni who have all known/gone through this, I'd say yes I do know what I'm talking about. \n\nUnis in the US recognise only the T1 colleges as ones having a superior status, but they don't really know the difference (or if they do, they don't account for it as much difference) between NITs, between IITs and so on. Never did I say that NIT Manipur is T1 in India. But to them they are all under the same umbrella. Think of them considering all NITs as multiple campuses of the same university."
    },
    {
      "id": "lbkutga",
      "body": "I completely differ you at this point ...many of my knowns from VIT Thapar and manipal are doing MS in top universities of US ...they did agree that at least VIT and thapar one did get an edge bcoz of their ABET accredition ..and is still respected in those universities ..moreover focus was given more in performance ..and college brands were used as tie breakers ...otherwise people from nit Rourkela have been rejected for MS .for having a poor academic performance"
    },
    {
      "id": "lbl4bhj",
      "body": "Not denying performance and skills - I never said that that's all you need. I'm simply stating that beyond the T1 tag, they do not really recognise other colleges with any kind of special status. You're obviously allowed to disagree ofc. \n\nCollege tag is helpful only if you have a good profile, on its own it's not too useful. People getting rejected from NIT has nothing to do with their college status and everything to do with them not having enough academic credentials. It's the main reason you see so many from PES and other colleges at schools like CMU, UCLA, UCSD, UPenn and the like."
    },
    {
      "id": "leo6as4",
      "body": "hey you said that real ML roles require years of research experience.....how does an undergrad get that?"
    },
    {
      "id": "leo6vxw",
      "body": "Very difficult to get those kind of roles. Do a quick search for Applied scientist roles - you'll see they either need a Master's and/or years of research experience."
    },
    {
      "id": "lhpvfhj",
      "body": "legit the most retarded post i have seen on this subreddit"
    }
  ]
}