{
  "id": "1ds4d8m",
  "title": "Have an idea for an app/website ",
  "content": "I'll need help to build it though, if anyone's interested, lmk. \n\nBasically a website which has additional questions based on AI(I will use ChatGPT to make similar questions to the ones already present in the exam) for an entrance exam which currently has very few.\n\nBasically, I will need help to build a quiz website, but I'm confident there is money in this. The problem is, just like everyone else I don't have the funding as of right now, but I can promise that as we sell the questions, I will give you a cut.\n\nIf you wanna discuss this, DM me, let's talk about how to get this going and we can get this website up and running.",
  "metadata": {
    "author": "GoldPut-007",
    "url": "https://www.reddit.com/r/PESU/comments/1ds4d8m/have_an_idea_for_an_appwebsite/",
    "permalink": "/r/PESU/comments/1ds4d8m/have_an_idea_for_an_appwebsite/",
    "score": 3,
    "created_utc": 1719762181,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lazrf04",
      "body": "I don't wanna disappoint you, but in every hackathon, a app like the one u mentioned has already been done SEVERAL TIMES.. However there might be a possibility of improving the project, try researching and make sure you check github."
    },
    {
      "id": "lazwbx1",
      "body": "Can I dm you?"
    },
    {
      "id": "lb0bdsl",
      "body": "Bro I’ve got the same idea😭 I thought I was the only one. I was thinking to start a prep site with gpt questions for SAT."
    },
    {
      "id": "lb0glb1",
      "body": "We did something similar for pesu as our capstone"
    },
    {
      "id": "lb0iae5",
      "body": "Let's work on it together then! :))"
    },
    {
      "id": "lb0icg4",
      "body": "Wanna work on it together?"
    },
    {
      "id": "lb0v45s",
      "body": "I  have finished college, but if you want we can discuss it when i come back to banglore next month"
    },
    {
      "id": "lb10p29",
      "body": "Sure, hmu!"
    },
    {
      "id": "lb2xapt",
      "body": "What exam did u want to make the quiz and questions for tho?"
    },
    {
      "id": "lb46tdw",
      "body": "A couple foreign ones like you caught on :)"
    },
    {
      "id": "lb4l0cp",
      "body": "Atb man!!! Hope it works out! I’ll be starting mine soon"
    },
    {
      "id": "lbmjflc",
      "body": "sure dmm"
    }
  ]
}