{
  "id": "1dslp0h",
  "title": "PES BTech CSE RR/EC campus or Dual degree ECD/CND at IIIT Hyderabad? ",
  "content": "Which would be a better choice PES BTech CSE RR/EC or Dual degree ECD/CND at IIIT Hyderabad and why?\n\nAre there opportunities for research if choosing BTech CSE either on campus or via internships?",
  "metadata": {
    "author": "Ok_Scholar6343",
    "url": "https://www.reddit.com/r/PESU/comments/1dslp0h/pes_btech_cse_rrec_campus_or_dual_degree_ecdcnd/",
    "permalink": "/r/PESU/comments/1dslp0h/pes_btech_cse_rrec_campus_or_dual_degree_ecdcnd/",
    "score": 0,
    "created_utc": 1719813461,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lb39pfk",
      "body": "How is this even a choice, go to IIITH no brainer"
    },
    {
      "id": "lb3a72f",
      "body": "Could you please explain? Why?"
    },
    {
      "id": "lb3afgi",
      "body": "Bro, its IIITH, it has one of the best cse programs in india and is a whole tier above colleges like pes, unless u absolutely hate research and wanna go the startup route rejecting IIITH for freaking pes makes no sense man\n\nU are leaving a college compared with IITs for whats at best a good state level college"
    },
    {
      "id": "lb3aq8p",
      "body": "Pes is good tier 3 \nIiith is best tier 1"
    },
    {
      "id": "lb3bu5g",
      "body": "He has come here to flex bro... obviously he's not gonna tame pes"
    },
    {
      "id": "lb3ck60",
      "body": "I mean maybe he is really confused? And idk i dont consider colleges as a flex unless its IITD or smthing so i dont mind"
    },
    {
      "id": "lb3eqvr",
      "body": "Bhai you are dumb if you have put both of them together as option. IIITH has the best programmes in cse and it's related fields and is on par with IITs..how can you even compare it bro"
    },
    {
      "id": "lb3fc0f",
      "body": "So, startup route is an option with PES? Branch over college. It is 4 year BTech CSE vs 5 year Dual Degree ECD/CND and research duration might extend, right?"
    },
    {
      "id": "lb3fm9c",
      "body": "There isnt a startup route per se, its just that IIITH has a very research focused culture and is hectic with acads so startups are rare over there, while pes is a lower tier college being in Bangalore and having relatively chill acads might help \n\nYes the 4 year and 5 year difference is there\n\nHonestly if i was in ur place i would introspect about what direction u want to pursue\n\nPS: Even tho im startup inclined i wouldve prolly taken IIITH if i had gotten it because of the amazing peer group there"
    },
    {
      "id": "lb3hb0q",
      "body": "Please take pes, clearly ur too dumb for iiith."
    },
    {
      "id": "lb3iqk8",
      "body": "Amazing peer group seems to apply for PES as well. This is based on what I have been hearing, observing and also going by the balanced responses, posts by students and alumni."
    },
    {
      "id": "lb3jtgj",
      "body": "How is this even a valid question lol."
    },
    {
      "id": "lb3kcqk",
      "body": "See, if ur convinced for pes its no problem to come here, im also leaving supposedly better options to come here but thats because i have specific priorities that are better served by staying in pes\n\nDont take a blind decision and think about what u want out of college"
    },
    {
      "id": "lb3l3i2",
      "body": "Sometimes the wrong answer is indeed the right answer"
    },
    {
      "id": "lb4bw9k",
      "body": "Same here. Specific priorities guiding the decision. Thanks for your messages. \n\nPoint is to make an informed decision, but to watch out for blind spots. Have also gone through in detail all the pros and cons shared by PES seniors."
    },
    {
      "id": "lb4cict",
      "body": "True. Went through the pros and cons post in detail. Found it very helpful. Thanks much."
    },
    {
      "id": "lb4cuhp",
      "body": "No prob man, maybe we ll meet if u come to pes"
    }
  ]
}