{
  "id": "1dsoy06",
  "title": "IIIT Kottayam, Sri City ece vs BMS or MSRIT ece",
  "content": "Interested in getting into core ece. Also got nitk civil, not gonna go there anyway",
  "metadata": {
    "author": "T13NMY",
    "url": "https://www.reddit.com/r/PESU/comments/1dsoy06/iiit_kottayam_sri_city_ece_vs_bms_or_msrit_ece/",
    "permalink": "/r/PESU/comments/1dsoy06/iiit_kottayam_sri_city_ece_vs_bms_or_msrit_ece/",
    "score": 3,
    "created_utc": 1719826806,
    "flair": "PESSAT/Admission",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lb3rdf3",
      "body": "Bro came to the pes subreddit to ask everything but😂\n\nI honestly don't know though. But I've got a guy feeling that the iiits might be a better choice"
    },
    {
      "id": "lb3rkij",
      "body": "They absolutely are for cse, I'm not sure about ece tho..cuz more core ece companies come to Bangalore colleges n internships might be easier to find. Idk much about internships n how much clg helps in them.\nBtw I'm also getting ece in PES RR, read that profs ain't good n bms is better, so gave it higher preference😃"
    },
    {
      "id": "lb3ruxz",
      "body": "Go for rvce"
    },
    {
      "id": "lb3rxu3",
      "body": "I'm not getting ece in rvce. Will get at bms, msrit via kcet n in iiit kottayam, Sri City, ranchi via jeeM"
    },
    {
      "id": "lb3s10m",
      "body": "You may gey manipal cs with jee rank"
    },
    {
      "id": "lb3s8jy",
      "body": "Not interested in cse, wanna go to core ece and interested in masters n research in the field"
    },
    {
      "id": "lb3sdcz",
      "body": "Then go with some reputed college if you want for masters outside \nIf here idk  try to get into  any college with kess sattendce and grind gate for psus or top 7 iits"
    },
    {
      "id": "lb3sfev",
      "body": "Since when doesn Manipal accept JEE?"
    },
    {
      "id": "lb3t8eh",
      "body": "Yes few sears though jee mains score"
    },
    {
      "id": "lb3w324",
      "body": "I'm not getting any reputed colleges, hence my question. Can't afford bits n other colleges, gonna get chemical or civil in bits anyway"
    },
    {
      "id": "lb3z98r",
      "body": "Then \nRvce>pes>bms>msrit>dsce\nShould be order"
    },
    {
      "id": "lb4nxye",
      "body": "One of my school frnd is at IIIT Kottayam, but he is CSE. I can ask him once if u really want IIIT Kottayam ECE"
    },
    {
      "id": "lb54irw",
      "body": "Please, that'd help me a lot. Please ask them about core ece internships opportunities there"
    },
    {
      "id": "lb55ei6",
      "body": "All I k is new IIITs are not worth it mostly without core CSE."
    },
    {
      "id": "lb5gcmq",
      "body": "Done, I have asked"
    },
    {
      "id": "lb5ghdj",
      "body": "Hmmm yeah, he was telling college is shit there too when i called him a few months ago"
    },
    {
      "id": "lb5jlqa",
      "body": "Every IIIT besides the top 3/4 are shite. My one friend is in IIIT Bhagalpur and it's basically shit"
    },
    {
      "id": "lb64mp3",
      "body": "Idk why but whenever ppl ask qns like these i get mad pissed.\nNo matter where you get into, u will suffer and regret your life's choices."
    },
    {
      "id": "lb7u7v9",
      "body": "Bruh, so you mean I shouldn't choose engineering at all lmfao. Why haven't you dropped out of clg yet then"
    },
    {
      "id": "lb8bzvw",
      "body": "Never heard of Bhagalpur xD 😂"
    },
    {
      "id": "lbeqr9f",
      "body": "They don't even have their own building."
    },
    {
      "id": "lbese86",
      "body": "wtf lmao"
    },
    {
      "id": "lbeshwd",
      "body": "Yeah lol. Placements are 50% and all. My friend won an award in singing contest and that's his LinkedIn. 😒 I think they study in NIT campus."
    },
    {
      "id": "lbeslr6",
      "body": "OMG"
    },
    {
      "id": "lbesrpy",
      "body": "Best advice I've heard on reddit =\n\nI'd u don't get Tier 1 college... Choose tier 1 city. My friend feels that now. Could have taken MSRIT / DSCE but IIIT KA TAG ( non existent unless IIITH ) Lena tha use."
    }
  ]
}