{
  "id": "1dsp563",
  "title": "Is ipad helpful for cse?",
  "content": "I just finished first year and i have been thinking of getting an ipad to organize notes. If there are lots of diagrams and visualisations required in the further sems, i think an ipad may help. Pls help..",
  "metadata": {
    "author": "tsukkisimp204",
    "url": "https://www.reddit.com/r/PESU/comments/1dsp563/is_ipad_helpful_for_cse/",
    "permalink": "/r/PESU/comments/1dsp563/is_ipad_helpful_for_cse/",
    "score": 7,
    "created_utc": 1719827623,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lb3tbog",
      "body": "Do ipads have special features that u can use to make diagrams and visualisations or smt\n\n\nCoz u can use a pc/phone / physical notes"
    },
    {
      "id": "lb3tw6f",
      "body": "I have no idea of that but I have heard that ipad is preferable for notes making"
    },
    {
      "id": "lb3uwdq",
      "body": "Just use a pen and paper when necessary. An iPad won't improve anything"
    },
    {
      "id": "lb3uzp6",
      "body": "Alright!"
    },
    {
      "id": "lb3vigx",
      "body": "As someone who has an iPad, it is not at all necessary. It is a \"good to have\" thing but realistically you won't enjoy it as much. Also depending on your college, you might not even be allowed to take it in class. Also especially during the open book exams they won't allow printed notes (atleast in my college) so better stick to pen and paper."
    },
    {
      "id": "lb3vtbx",
      "body": "Yes even in our obts we are not allowed to use printed notes.. I'll stick with pen paper."
    },
    {
      "id": "lb3vzc0",
      "body": "No need, a guy used to make notes in class on ipad in our 1st year and people including teachers gave pretty bad looks to him and apart from that also no need"
    },
    {
      "id": "lb3wqhd",
      "body": "Wow that's brutal. I won't pick it up now."
    },
    {
      "id": "lb3z4qr",
      "body": "Unless you are like Vibha masti it ain’t much use"
    },
    {
      "id": "lb3zbt8",
      "body": "If you want to pass engineering then use paper and pencil."
    },
    {
      "id": "lb3zcz6",
      "body": "I'm not like her so ye prolly won't suit me"
    },
    {
      "id": "lb426ei",
      "body": "iPad is just overhyped. I would prefer making physical notes that’s wt I did. Few of my friends took it n all they did is binge watch, im not telling u would do that but i didnt not find it really useful."
    },
    {
      "id": "lb42aki",
      "body": "Ye ipad shouldn't become YouTube or Netflix machine.. I'll go with paper and pen"
    },
    {
      "id": "lb46nua",
      "body": "Good !! \nTrust me slowly ull start enjoying making notes"
    },
    {
      "id": "lb4f7ds",
      "body": "bro barely anyone writes notes , the content on pesuacademy combined with some youtube vids is enough for all the exams"
    },
    {
      "id": "lb4flr7",
      "body": "You are right but I think with notes is important but I understood ipad is not useful"
    },
    {
      "id": "lb4t06i",
      "body": "If you really want to organise notes, just use notion or obsidian app"
    },
    {
      "id": "lb4uhal",
      "body": "Yes I'm using notion for noteskeeping."
    },
    {
      "id": "lb4uuko",
      "body": "There's an app called GoodNotes which is predominantly used by medical students. They have a lot of features that make the notes look visually appealing and help with memorising. That's why they buy iPads.\n\nFor CSE, all of us passed by watching YouTube videos to understand and apply the concepts. So save your money✌🏻 (ideally by not coming to PES in the first place 🤣)"
    },
    {
      "id": "lb4v9ka",
      "body": "Are you from PESU?"
    },
    {
      "id": "lb4wuuz",
      "body": "Yes I am"
    },
    {
      "id": "lb4x7m8",
      "body": "I'm happy that I came thru kcet cos it saved me a lot of money but ye ipad notes does seem aesthetically pleasing hence why😃"
    },
    {
      "id": "lb4xy6v",
      "body": "Ah CET means it's fine. 2018-22 batch pass out, so 2 years ago"
    },
    {
      "id": "lb5224l",
      "body": "Ohh nice. Were online classes horrible or manageable?"
    },
    {
      "id": "lb5244r",
      "body": "Who dat"
    },
    {
      "id": "lb52ctv",
      "body": "Cool, same here and I don't think you should buy an Ipad(waste of money) imo. Its still upto you tho if you badly want it go for it."
    },
    {
      "id": "lb52fc3",
      "body": "Straying away from this thread so DM and I'll help you out with any questions"
    },
    {
      "id": "lb53dzh",
      "body": "Nah I think I'm good with my laptop for notes making and iPads are indeed very costly"
    },
    {
      "id": "lb6ao7q",
      "body": "How do you not know about important alumni lol"
    },
    {
      "id": "lb6sjxt",
      "body": "Fresher\nWho is she?\nBeen seeing her name mentioned a lot in discord\nAnd people share her notes as well"
    },
    {
      "id": "lb84xoi",
      "body": "Google and you'll find out"
    }
  ]
}