{
  "id": "1dstpw9",
  "title": "Doubt regarding Fees payment ",
  "content": "1. Do we have to pay the 4L all together between the mentioned time frame ,Can we pay the fees anytime \n\n2. Do we have to pay the fees for both years or can it be paid semester wise",
  "metadata": {
    "author": "dark_surfer8",
    "url": "https://i.redd.it/n8vvsxiryw9d1.png",
    "permalink": "/r/PESU/comments/1dstpw9/doubt_regarding_fees_payment/",
    "score": 3,
    "created_utc": 1719842508,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lb4oug3",
      "body": "You'll have to pay it for the whole year within the timeframe. Part payments can be done as well."
    },
    {
      "id": "lb4qifn",
      "body": "Like can we pay 1L in the time frame and the other 3L by the end of the semester or the entire 4L by the time frame"
    },
    {
      "id": "lb4qzmf",
      "body": "Idts, maybe you'll need to ask them permission to be able to do that."
    },
    {
      "id": "lb4rb7p",
      "body": "Can we make payments throught the semester before the semester ends"
    },
    {
      "id": "lb4rrmb",
      "body": "I don't think it's possible unless you plead your case. "
    },
    {
      "id": "lb4rxzf",
      "body": "Bruh anyways thanks for the help"
    },
    {
      "id": "lb4sniv",
      "body": "No issues, happy to help."
    },
    {
      "id": "lb5707q",
      "body": "Bruh they hiked the fees for kcet ppl they made the extra fee from 50k to 58k lmao"
    },
    {
      "id": "lb5iwu7",
      "body": "You have to pay within the time frame given otherwise they penalise you for per day/week.\nWhereas, the whole payment can be made in several installments within the time frame given."
    },
    {
      "id": "lb5pood",
      "body": "we have to pay the same amount what we have paid in first year right? with scholarship 128000 and without 118000 (96574+11088+11088)"
    },
    {
      "id": "lb7hxi5",
      "body": "No option to pay without scholarship from second year…. You have to pay and you can get scholarship even if you didn’t in first year"
    },
    {
      "id": "lb8dug0",
      "body": "No I think it's not like that last time also in payment portal it's showing 128000 but me and my friends just paid 118000 and we didn't got scholarship "
    },
    {
      "id": "lb8e8av",
      "body": "And I think of you haven't paid 10000 for extra then you can't pay it for next sem also"
    },
    {
      "id": "lbegwh8",
      "body": "Does the given cet fees in the circular include kea fees???"
    },
    {
      "id": "lbev0ol",
      "body": "Yes"
    },
    {
      "id": "lbev4d4",
      "body": "Yes .Once you opted scholarship you can’t go back.if you didn’t apply you can’t apply in the future."
    },
    {
      "id": "lephfcm",
      "body": "Are you sure about it since this year how much should be paid since last year10k scholarship fee was mentioned separately while this year it's mentioned along with miscellaneous fees?"
    },
    {
      "id": "lephg0o",
      "body": "Are you sure about it since this year how much should be paid since last year10k scholarship fee was mentioned separately while this year it's mentioned along with miscellaneous fees?"
    },
    {
      "id": "lepjh8a",
      "body": "100% sure I asked the accounts department"
    },
    {
      "id": "leqdbt1",
      "body": "Just to clarify, did you ask that this year? If yes, they are trying to fool people by including those 10k in misc fees."
    }
  ]
}