{
  "id": "1dtgzb5",
  "title": "Am about to write my backlog exams within 3 weeks and idk wht to study ( and also can anyone comment on how will be the difficulty level of the backlog papers cause i heard the passing marks is 40 out of 100 )",
  "content": "Its like idk wht to do anymore and its just overall so confusing and i am so disappointed with my results and i have to prep fast, i am just so confused on wht to do and how to do it and i am really very stressed as well as can anyone advice me on how to go on about it in a cool manner and how is the difficulty level of the backlog paper",
  "metadata": {
    "author": "doc_cupcakes",
    "url": "https://www.reddit.com/r/PESU/comments/1dtgzb5/am_about_to_write_my_backlog_exams_within_3_weeks/",
    "permalink": "/r/PESU/comments/1dtgzb5/am_about_to_write_my_backlog_exams_within_3_weeks/",
    "score": 1,
    "created_utc": 1719909605,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lb9bzx6",
      "body": "Isn't passing marks 35?"
    },
    {
      "id": "lb9dnzu",
      "body": "Make a timetable and stick to it. Keep a goal for the day and follow through. Revision is a must. Read the slides that should be more than enough."
    },
    {
      "id": "lb9fg1w",
      "body": "Na it's 40 afik"
    },
    {
      "id": "lb9fjsa",
      "body": "Well first see the esa pyqs so uk which topics they are most likely going to ask questions on. And after that just grind slides on pesuacsdemy and go through the qb/assignment questions"
    },
    {
      "id": "lb9ijl4",
      "body": "The actual fuck? This college is trash"
    },
    {
      "id": "lb9jfgv",
      "body": "Which subjects"
    },
    {
      "id": "lbb5jef",
      "body": "thts wht some people say its 35 some say 40 idk its so confusing"
    },
    {
      "id": "lbb5ktm",
      "body": "ahhh math 1 and physics"
    },
    {
      "id": "lbb5x1c",
      "body": "well i did the pyqs for the esa and it backfired completely but yeah i will now go through the sildes but bruh when i look at the slides i lose hope for some reason and the passing mark is 40 , so its not less idk man i am freaking out"
    },
    {
      "id": "lbb93wr",
      "body": "Which subject backlog exactly?"
    },
    {
      "id": "lbbl0a6",
      "body": "Depends if they apply relative ig but my profs said 40"
    },
    {
      "id": "lbbl7bd",
      "body": "Well math 1 just do the cw questions hopefully they don't give a fuck all paper like esa we had 🫠\n\n\nFor physics just refer Faisal sir slides best bet honestly"
    },
    {
      "id": "lbc4bny",
      "body": "math 1 and physics"
    },
    {
      "id": "lbc4o6c",
      "body": "well for math 2 i did the entire cw and guess wht i got a D so yeah almost close to failing Math 2 too and is faisal sirs slides good enough for phys ?? i think they are about 712 slides or so"
    },
    {
      "id": "lbelss2",
      "body": "Ye Faisal slides are the pesu ones are pretty bad. It's around 727 to be exact"
    },
    {
      "id": "lbeol06",
      "body": "pretty bad??"
    },
    {
      "id": "lbeqmvz",
      "body": "Sorry I meant that the pesu slides are bad. Faisal sir slides are better both are different."
    },
    {
      "id": "lbf22wf",
      "body": "Hello bud, i wrote the same m1 and phy backlogs. It’s not a big deal. Calm down what has happened has happened. As of now do 3 units completely from the slides. Since you have the esa qps online go through so uk the topics on which questions will be repeated. M1 especially youll have to practice the answers. The passing mark is 35 try scoring around that range. You can search similar topics on yt or if youve notes just study those and youll clear it."
    },
    {
      "id": "lbg3zdz",
      "body": "is notes enough for maths cause i did notes for m2 and it flopped bad and if u have m1 notes can u share it here and are u sure the passing marks is 35 cause many of them were saying tht it was 40"
    },
    {
      "id": "lc80yav",
      "body": "The level is same tbh... Just go through the important topics and don't just rely on previous year papers"
    }
  ]
}