{
  "id": "1du81sy",
  "title": "Change of branch doubt",
  "content": "What is the minimum CGPA or SGPA required for change of branch to Cs.is it related to cgpa or SGPA?",
  "metadata": {
    "author": "Diligenthustler",
    "url": "https://www.reddit.com/r/PESU/comments/1du81sy/change_of_branch_doubt/",
    "permalink": "/r/PESU/comments/1du81sy/change_of_branch_doubt/",
    "score": 3,
    "created_utc": 1719989834,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lbes5ko",
      "body": "It is related to CGPA. There is no set minimum CGPA since it depends on how the batch performs. The kid with the highest CGPA gets to pick first, and then the kid with the second highest and so on. Note that for branch change there also needs to be enough seats.\n\nIf you want to know last year's stats, then if I remember reading correctly: RR CS needed 9.5+ and EC CS needed 8+."
    },
    {
      "id": "lbesfm7",
      "body": "Aiml rr was 8+ \n\nEc cs was 7.4"
    },
    {
      "id": "lbetw51",
      "body": "AIML in RR campus is 8+??if yes pls can you say what are the procedures"
    },
    {
      "id": "lbeu132",
      "body": "Tq what are the procedures ?since we have holiday right now when should I start change of branch?what should I do ?whom should I contact??"
    },
    {
      "id": "lbeu8bl",
      "body": "Tq"
    },
    {
      "id": "lbewejg",
      "body": "The branch change process is exactly like another seat allotment. the difference is that seats are freed up when someone leaves the college or something. seats remaining last year were roughly 10 in each branch. but only 3 in CSE RR.\n\nThe number of available seats in each branch or campus is displayed on the screen. Students are called based on their CGPA rather than rank, similar to how it's done in PESSAT round 2.\n\nWhen a student decides to change their branch, an additional seat is allocated to their old branch.\n\n(before the allotment, there is a form which you have to fill on pesuacademy which has 3 of your branch change preferences. (cse at rr, cse at ec, count as two different choices)\n\nYOUR CURRENT BRANCH AND CAMPUT DO NOT HAVE ANY IMPACT AT ALL\n\nFor reference, here are last year's cutoffs:\n\n* CS at RR: 9.68\n* AI/ML at RR: 8.2\n* CS at EC: 7.4\n* the others are lower but i'm not really sure.\n* To apply for a branch change, a minimum CGPA of 6.75 is required.\n\nJust so you have reasonable expectations i'm including some cgpa stats at the end of MY first year\n\n* 5% of students get above 9.3\n* 20% get approximately 8.6-8.8\n* About 50% of the batch gets above 7.75\n\nTHESE NUMBERS ARE NOT EXACT, But sort of close to the real thing. I have gone through the scholarship list in both campuses and just roughly made this estimate.\n\nIf you are joining another branch with the intention of CSE at RR in branch change, DO NOT. it is really difficult, and really rare to get a GPA that high.\n\nfor other branches and especially CSE at EC, i think it's a reasonable goal to have. it is not really that hard to get above 7.5 and it's a very good option to consider if you are not getting good opportunities at other colleges.\n\nBut again, it is not guaranteed so only do this as a last ditch effort. don't feel like you have it until you actually do."
    },
    {
      "id": "lbewj01",
      "body": "Tq Annie!!"
    },
    {
      "id": "lbewlmr",
      "body": "Annie rection"
    },
    {
      "id": "lbewmf7",
      "body": "Can you tell how should I start?"
    },
    {
      "id": "lbewq9f",
      "body": "Start what?"
    },
    {
      "id": "lbewrhd",
      "body": "Change of branch"
    },
    {
      "id": "lbewsn2",
      "body": "I have DM ed you can you reply??"
    },
    {
      "id": "lbewx1s",
      "body": "What's your gpa? And current branch and your desired branch\n\nThey will send a notice on pesuacademy and they will open another tab for branch change\n\nAlso your teacher will post in in the WhatsApp group. Usually during the first few weeks of second year"
    },
    {
      "id": "lbewzbd",
      "body": "They will contact you dude. They'll send a form out once the time comes. Right now the final results for sem 2 aren't out yet. How will they start it before final CGPA has been calculated?"
    },
    {
      "id": "lbex4jx",
      "body": "Not final but provisional are fine to decide right"
    },
    {
      "id": "lbexdvc",
      "body": "Nope, because if re-eval results improves someone's grade (and thus their CGPA), then they will get a higher priority to pick than before their re-eval results."
    },
    {
      "id": "lbexfm3",
      "body": "Thanks, remind me to add this to the FAQs"
    },
    {
      "id": "lbexkdq",
      "body": "Tq for the help"
    },
    {
      "id": "lbey5e6",
      "body": "I copied if from a comment below yours in the faq"
    },
    {
      "id": "lbgdir4",
      "body": "If he is asking minimum cgpa to be eligible it's 6.75 ."
    },
    {
      "id": "mcib8sl",
      "body": "How favorable is Mech to.eee"
    }
  ]
}