{
  "id": "1ducizn",
  "title": "How to milk the max out of Student ID?",
  "content": "What all can we do with ID? Please do let me know ",
  "metadata": {
    "author": "Brilliant_Mangi",
    "url": "https://www.reddit.com/r/PESU/comments/1ducizn/how_to_milk_the_max_out_of_student_id/",
    "permalink": "/r/PESU/comments/1ducizn/how_to_milk_the_max_out_of_student_id/",
    "score": 21,
    "created_utc": 1720007806,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lbfjjlf",
      "body": "by wearing it around your neck when you enter the college to avoid \"kind requests\" by the body guards in kannada."
    },
    {
      "id": "lbfqgaq",
      "body": "Other than college entry-Library entry and exit,,borrowing the books (it’s like a pass),exams(ISA and ESA)if you don’t have they will trouble you"
    },
    {
      "id": "lbfsu59",
      "body": "1. You can use it to get Library books  \n2. Flex to others that you are in PESU /s  \n3. Show to the security while going and coming in  \n4. If you go for any industrial visit, do wear it to show that you are from PES\n\nThis is all you can do"
    },
    {
      "id": "lbftavm",
      "body": "General benefits of a student ID: discount+extra weight allowance while travelling through flight, Spotify student premium, Amazon prime student discount, there are other general discounts in places like escape rooms and amusement parks that you can check out. Hope this helps."
    },
    {
      "id": "lbftcl5",
      "body": "Guys, I am asking about Unidays etc.. what other student discounts can we get by using ID Card?"
    },
    {
      "id": "lbfw1o9",
      "body": "U can get GitHub pro(for students )I think . U need to follow the steps at some point they ask for pic of id"
    },
    {
      "id": "lbfxjhr",
      "body": "On any electronic gadgets if they say there is student discount than you have to give you id card for example(real)my friend purchased a mac he availed 5% discount on it"
    },
    {
      "id": "lbfy3h8",
      "body": "I used to go to the PU,I got asked if I studied in the Ringroad campus when I traveled back home one time,they thought I was studying engineering when I haven't even finished my 12th"
    },
    {
      "id": "lbg5p63",
      "body": "Unidays and other sites generally just ask for your college email ID. I have mine even 2 years after graduating and happily milk the pro JetBrains IDEs and a lot of Samsung products.\nGot a MacBook via UniDays as well."
    },
    {
      "id": "lbgpjs7",
      "body": "Exactly, such a flex to study at such a well known college /s"
    },
    {
      "id": "lbgvmg9",
      "body": "Thank you for response"
    },
    {
      "id": "lbgvnf9",
      "body": "Thanks"
    },
    {
      "id": "lbgvnzc",
      "body": "Thank you"
    }
  ]
}