{
  "id": "1duje79",
  "title": "PES RR AIML",
  "content": "Hey, I just wanted to know if taking AIML at the RR campus is worth it through PESSAT\nAt the same time I’m getting EEE at RV through KCET",
  "metadata": {
    "author": "Fickle_Imagination21",
    "url": "https://www.reddit.com/r/PESU/comments/1duje79/pes_rr_aiml/",
    "permalink": "/r/PESU/comments/1duje79/pes_rr_aiml/",
    "score": 3,
    "created_utc": 1720026041,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lbgw1dt",
      "body": "RV seems better according to the previous answers by seniors"
    },
    {
      "id": "lbgym25",
      "body": "I agree that RV is a better college, but the issue is that I’m getting a lower branch there as compared to PES."
    },
    {
      "id": "lbgzxk9",
      "body": "If you want immediate placement right after 4 years, do CS\nbut if you want a good tag in your life using which you’ll upscale yourself and get better placements in the longer run, take RV\nIf I were in your shoes, I would’ve  taken RV without a second thought \nAll the best ✌️"
    },
    {
      "id": "lbh0o25",
      "body": "Thank you :)\nIf you don’t mind me asking, which college and branch had you taken?"
    },
    {
      "id": "lbh1opi",
      "body": "AIML at RR via pessat :)"
    },
    {
      "id": "lbh2b0t",
      "body": "That is a WONDERFUL coincidence. Do you have any regrets about that decision?"
    },
    {
      "id": "lbh3879",
      "body": "No regrets. I’m happy 😃"
    },
    {
      "id": "lbh3ppn",
      "body": "Have you opted for the hostel?"
    },
    {
      "id": "lbh4td6",
      "body": "RV doesnt have a brand value like wt IITs/NITs and IIITs have it is a well known college yes but doesnt have a \"Tag\" necessarily"
    },
    {
      "id": "lbhcjp4",
      "body": "Realistically both RV and PES have similar reputations as top colleges in Bangalore for CS.  When you look at the larger picture from a higher education POV, neither will give you an edge."
    },
    {
      "id": "lbhumve",
      "body": "Don't you think IIT's as well are the headstart, in long term people focus on skills not tags"
    },
    {
      "id": "lbhun1z",
      "body": "Oh alright. Which would you say has a better student life?"
    },
    {
      "id": "lbhz2ib",
      "body": "RVCE, by a fair margin"
    },
    {
      "id": "lbj4e52",
      "body": "You will, once second year starts"
    },
    {
      "id": "lbjfkk9",
      "body": "Thanks for the demotivating advice \nBut I intentionally chose AIML\nThanks ☺️"
    },
    {
      "id": "lbjju9u",
      "body": "It's not advice. It's your future, take it from a senior. \n\nHonestly try to shift to ec campus cs or something, aiml is just objectively worse"
    },
    {
      "id": "lbju65j",
      "body": "There’s an IIT faculty in the BBA dept. I’ve spoken to him, he suggested my to take aiml"
    },
    {
      "id": "lbjwzfp",
      "body": "And you're sure he gave you an informed answer after looking through all the different courses that aiml has? Which would be quite difficult cause even the hod of the aiml department didn't decide on the 5th sem courses yet.\n\nHim being from an iit and teaching BBA must mean that he knows about everything doesn't it"
    },
    {
      "id": "lbk7hh7",
      "body": "Can I dm you?"
    },
    {
      "id": "lbm3ymn",
      "body": "Why tf are comments deleted bruh"
    },
    {
      "id": "lbovely",
      "body": "Not deleted, just have to click on the usernames individually to view them"
    },
    {
      "id": "lc08mgj",
      "body": "I'm joining pes rr aiml this year .. y'all are scaring me"
    },
    {
      "id": "lc0er82",
      "body": "Cs is objectively better but aiml isn't bad don't worry"
    },
    {
      "id": "lc125vi",
      "body": "That gives a relief"
    }
  ]
}