{
  "id": "1dumryi",
  "title": "MIT Nuclear Engineering vs PESU CSE RR Campus ",
  "content": "Please help me out ... 🙏\n\nThis is not a troll question ❗\n\nWhich one could give me a better CTC??\n\n",
  "metadata": {
    "author": "Mission_Disk7459",
    "url": "https://www.reddit.com/r/PESU/comments/1dumryi/mit_nuclear_engineering_vs_pesu_cse_rr_campus/",
    "permalink": "/r/PESU/comments/1dumryi/mit_nuclear_engineering_vs_pesu_cse_rr_campus/",
    "score": 0,
    "created_utc": 1720034430,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lbhmrt6",
      "body": "MIT as in Massachusetts Institute of Technology..??"
    },
    {
      "id": "lbhot53",
      "body": "yeah"
    },
    {
      "id": "lbhqjj8",
      "body": "Well if you actually like nuclear physics then go for it! All fields provide equal opportunity in the US."
    },
    {
      "id": "lbhrh96",
      "body": "I mean, are you comparing between an Indian Univ and an Ivy league that too top 1?   \nBro, just go to MIT man"
    },
    {
      "id": "lbhsiyc",
      "body": "Are you serious bro? I will come to your house and strangle you if you don't take up MIT. Wtf why are you comparing it with pes?"
    },
    {
      "id": "lbhta8i",
      "body": "Yes and since those are my options"
    },
    {
      "id": "lbhtvgg",
      "body": "In PESU subreddit I've seen peeps hailing its comp science dept and drawing parallels with Carnegie Mellon, which made me post this qsn"
    },
    {
      "id": "lbhuisy",
      "body": "Hmm, I don't think there'll be much of a resurgence in nuclear power plants like the 70' and 80'"
    },
    {
      "id": "lbhux3o",
      "body": "Why there is any need of a doubt? MIT is one the worlds best uni, there is literally no comparison, not even IITs lol. Just go for MIT dude. I am assuming you are confused because for MIT you will need to invest a lot of money from fees, travel, cost of living, etc. But believe me dude, no matter how many people say that all you need is skill to grow your career, that is all good but the reality is that having a big college brand in your resume mean alot and way alot than anything. Even you got the nuclear engineering domain, just don't worry much down the line you can easily grow with the name of MIT."
    },
    {
      "id": "lbhw53a",
      "body": "Thanks for your insight"
    },
    {
      "id": "lbhwe1n",
      "body": "this is definitely a troll question, fucking liar, if you were smart enough to get into it, you would have figured it out yourself"
    },
    {
      "id": "lbhwhqe",
      "body": "the people who said that are retarded"
    },
    {
      "id": "lbhwr7v",
      "body": "even if you dont like it, just go to mit over any other indian university, I don't think op even got in if he is asking such dumbass questions"
    },
    {
      "id": "lbhxay7",
      "body": "Nobody compared it with CMU 😭"
    },
    {
      "id": "lbhxp4t",
      "body": "Everybody at MIT is passionate about what they do and that is the sole reason they got selected. If you’re worry is about ROI then i don’t think you should have even applied for nuclear engineering in the first place."
    },
    {
      "id": "lbhxr2y",
      "body": "MIT isn't Ivy League btw. The Ivy League Unis are Princeton, Cornell, Harvard, Columbia, UPenn, Brown, Dartmouth, and Yale."
    },
    {
      "id": "lbhxuyw",
      "body": "How did you get mit ? If possible can you plz send your resume 😭😭😭🙏🙏🙏🙏"
    },
    {
      "id": "lbhyij0",
      "body": "Lmao OP is one of those kids from IITs and other colleges posting here to find out why this subreddit asks people to choose PES CS over some mickey mouse engineering at IIT/NIT/BITS. \n\nWe've seen enough of you. Do you really think we're that stupid?"
    },
    {
      "id": "lbi0q28",
      "body": "mit is better than them for engeineering atleast"
    },
    {
      "id": "lbi0yjr",
      "body": "any cs might bhi better than iit ceramic if you just look the money, did not even know of you guys , came to know from ops post in another sub"
    },
    {
      "id": "lbi0yzl",
      "body": "Didn't deny that, just correcting a usual assumption most people have about Stanford and MIT being Ivies."
    },
    {
      "id": "lbi291r",
      "body": "If you still did not get it, this is a troll post. Everyone knows the answer here. There are multiple of these that pop up during the admission season. OP is just the latest one. Scroll a bit back and you'll find one from a BITSian.\n\nPES CS is nowhere close to being the best but is still a reasonably good choice. It's just that most T1 college kids think that college tag is everything and branch is irrelevant, that's why they make these posts trying to make fun of us while they're making a fool out of themselves."
    },
    {
      "id": "lbi3cq8",
      "body": "i was the first one who got it, realized a mit accepted person would never ask this question, yeah branch does matter but the T1 tag is also pretty valuable"
    },
    {
      "id": "lbi4qs1",
      "body": "Are you acoustic or something?"
    },
    {
      "id": "lbicf5i",
      "body": "Chup chap take mit and don't ever look back."
    },
    {
      "id": "lbjh7kl",
      "body": "It's valuable yes, but some people make it everything about them. It's great to have a good college tag but it's not a must have. I personally know alumni from PES and similar colleges who have gone on to achieve significantly more than the average IITian. \n\nTbf I've been working for a while now and one thing I've observed is that the best engineers I've interacted with both in and out of office aren't actually the T1 kids. It's always the T2/3/4 college kids who show the most passion and better skillset when it comes to engineering. Most IITians I've interacted with in the workforce are pretty lousy, disinterested and burnt out engineers who hardly put in the bare minimum to not get kicked out. Rarely you'll find them replicate the same work ethic they did during their JEE days. Most of them are comfortable with the paychecks they start with and don't do anything beyond what's asked, while it's these others who quickly rise up in their careers. \n\nSure, the average IITian is miles ahead when it comes to solving PCM questions but that honestly doesn't translate to industry skills."
    },
    {
      "id": "lbjrvdu",
      "body": "Oh my bad sorry,"
    },
    {
      "id": "lbkmij3",
      "body": "hey i need some help!! would you recommend aiml in pes over cs with cyber security/business systems in bms?"
    },
    {
      "id": "lbktb7z",
      "body": "Both of these are specialisations. Since you aren't getting core CS in any, just pick the specialisation you like. If you cannot decide, then pick the cheapest one. If you're getting PES through CET, pick PES. Else BMS."
    },
    {
      "id": "lbl9jkq",
      "body": "what are you smoking bro"
    }
  ]
}