{
  "id": "1dvcbhr",
  "title": "Regarding additional course",
  "content": "So the thing is I've got an offer from BITS Pilani for Bsc Computer science online degree. It's the same as IIT Madras online degree,So I would like to ask my seniors about this , should I accept the offer and do that course with my btech cse in pesu which I'm doing? Would it be difficult to balance my curriculum? And mainly is IT OF ANY USE ???\nPls give some advice seniors,I'm confused as hell 🥲🥲🥲",
  "metadata": {
    "author": "AggressiveTable5725",
    "url": "https://www.reddit.com/r/PESU/comments/1dvcbhr/regarding_additional_course/",
    "permalink": "/r/PESU/comments/1dvcbhr/regarding_additional_course/",
    "score": 1,
    "created_utc": 1720113884,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lbmibps",
      "body": "What is the point of holding multiple bachelor's degrees in CS? It would have made more sense if you weren't in CS already. I am curious to know why you think multiple UG degrees in CS will help you."
    },
    {
      "id": "lbmiptg",
      "body": "Actually I thought that as it's of BITS ,it would give me more opportunities in future during placements"
    },
    {
      "id": "lbmjrci",
      "body": "1. Online degrees do not carry the same weight as equivalent offline ones (at least, not yet) since the entry bar is much lower. It is not the same as actually pursuing the degree offline from BITS. You will still be considered a graduate of PES with an online degree from BITS. Not a graduate of BITS. \n2. You will sit for placements from PES, which means you will be recognised as a PESt. When it comes to off-campus, do you plan to hide your PES degree? If yes then you have only an online UG degree which companies do not prefer and is not treated seriously. If not, then don't think that having 2 CS degrees is going to raise eyebrows about your decision?"
    },
    {
      "id": "lbmlgmf",
      "body": "Hey I’m no senior but the iitm degree seems to be a bit different , although there are quite a large no of people joining only hundreds are completing all the way till the Bs degree , but if you still want another degree the iitm seems to be the top pick over others like iit g as they offer the certificate with nothing mentioned saying it’s online , they also do advertise it as a hybrid degree than online as the all the exams ( which happen every month ) are offline, you’d have to go to a centre to write it."
    },
    {
      "id": "lbmqsxx",
      "body": "Okay then,I'll consider ur advice,thx :)"
    },
    {
      "id": "lbmrc4z",
      "body": "1. well the bits and iitm seem to be two different degrees, not entirely different but quite different\n\niitm offers a Bs degree in data science which seems to be treated as a specialization and advertised as a hybrid degree more than an online one as all the exams are to be written offline like the ones for jee mains \n\nbits on the other hand seems to a general CSE degree with Coursera (if I looked at the right one) there's a similar one from iit g as well in ai ml also form Coursera \n\nas for the comparison goes there are huge no of people joining but I believe only people in hundreds are finishing the course till Bs (due to multiple exit options)\n\n\\* (I do not know how the certificate would be awarded and what would be written on it i.e. online / offline but iitm does not mention) \\*\n\n2. I believe pesu has a very hectic curriculum which can he hard on manage time on both courses \n\n  \nI am looking into these courses, but I'll be waiting till the last date to decide, but if I do end up taking it would mostly be iit m"
    },
    {
      "id": "lbmufjp",
      "body": "I'm just sharing my opinion here based on what I know from the industry about these degrees.\n\nYou need to be able to convince yourself why it's a reasonable choice before you take it up. As long as you can convince yourself, then it's all good."
    },
    {
      "id": "lbmz6pu",
      "body": "He iss right  its bs course  girl !!!\nTry for gate you can get bits  or iits \nTbh pes you can fetch good  placemnt easily!!and youtube courses like dsa system low level design cs50 all are enough and better than these!!"
    },
    {
      "id": "lbnbohl",
      "body": "Can this type of online degree help me in building my profile for further studies?"
    },
    {
      "id": "lbp37jr",
      "body": "It's not an offer, anybody who wishes to pursue that online degree can pay the fee and do it on coursera"
    },
    {
      "id": "lbp9c49",
      "body": "Yeah but I got a mail from them which says accept your offer"
    },
    {
      "id": "lbp9eim",
      "body": "just a way of marketing"
    },
    {
      "id": "lbp9hm8",
      "body": "Yeah that's ryt:)"
    },
    {
      "id": "lbpm61j",
      "body": "Brother even PES sends us emails to enroll for MTech, does not mean they are inviting you personally xD"
    },
    {
      "id": "lbpmj15",
      "body": "They can help you cover missing coursework requirements but will not replace your PES degree."
    },
    {
      "id": "lbpnbzt",
      "body": "No no.... I mean can these types of various courses help me to strengthen my resume for further studies."
    },
    {
      "id": "lbpozeh",
      "body": "Doing courses does not strengthen your resume. Only skills matter, and evidence of those skills are projects or experiences. These courses can at best help you cover missing courses that might be needed to clear admission requirements. At worst, they aren't going to add anything.\n\nIf your goal is a Masters, then it is your CGPA, SOP and other essays, LORs and overall profile comprising your skills, experiences, projects etc that will matter. Completing a course from BITS/IIT etc will not add anything here, except to help you meet requirements as I mentioned. If you are in ECE or other non-CS branches and do not take up a CS Minors at PES, then it is reasonable to take it up. However, if you are already from CS, and are applying to CS programs, then you already have those requirements met and the course will add zero value."
    },
    {
      "id": "lbpqink",
      "body": "Ah thanks now I got it"
    }
  ]
}