{
  "id": "1dwu90v",
  "title": "First Day/Week at PES?",
  "content": "Now that the joining date is drawing close, what can we first years expect will happen on the first day/week in PES? If there is any differences between campuses please mention that too. ",
  "metadata": {
    "author": "nishdafish05",
    "url": "https://www.reddit.com/r/PESU/comments/1dwu90v/first_dayweek_at_pes/",
    "permalink": "/r/PESU/comments/1dwu90v/first_dayweek_at_pes/",
    "score": 19,
    "created_utc": 1720285330,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lbxb61s",
      "body": "Which date BTW 🫠"
    },
    {
      "id": "lbxerhk",
      "body": "Ig its 5th"
    },
    {
      "id": "lbxf2gz",
      "body": "Orientation?"
    },
    {
      "id": "lbxfehe",
      "body": "Naah they said the commencement of classes...but i think the delay of kcet can affect it"
    },
    {
      "id": "lbxl75u",
      "body": "when did they say this?"
    },
    {
      "id": "lbxnncp",
      "body": "During the 1st counselling,and in the website its given July last week or August 1st week...(btw jb khujli hoti hogi toh electric racquet sata lena)"
    },
    {
      "id": "lbxnyd1",
      "body": "Vaise bhi abhi nothing is sure not even the dates of 2nd counselling"
    },
    {
      "id": "lbxnz9f",
      "body": "Vaise bhi abhi nothing is sure not even the dates of 2nd counselling"
    },
    {
      "id": "lbxuw1m",
      "body": "Usually, following the orientation date there are 5 days of bootstrap. Bootstrap is a week-long period during which on each day you will get to explore each branch by carrying out simple and fun activities (if you are in CS, you will still have to explore other branches). It isn't mandatory to attend but serves as a fun icebreaker to meet batchmates and seniors.\n\nNormal classes will begin after bootstrap. There won't be anything special and you will have normal classes from day 1."
    },
    {
      "id": "lbzl3hn",
      "body": "Yup 👍"
    },
    {
      "id": "lc014ap",
      "body": "Was it not preponed to 22nd? Official website also says that."
    },
    {
      "id": "lc08u8q",
      "body": "Tf‽ 22nd July???....link share crow😠"
    },
    {
      "id": "lc0c21w",
      "body": "In RR campus, they'll be bootstrap activities in week 1. In my first year i bunked that week and just chilled at home. If you wanna make like new friends and have new experiences you can go for it. From what I've heard it's actually quite nice. You'll meet your classmates and paint schools with them 🐸 \nOther than that the college campus is, well I don't like how it looks 😂. Try to do as much as you can ig cause before you know it your time in college will be over 🥲 unless you fail or something."
    },
    {
      "id": "lc0fb1f",
      "body": "Online and people who went for counseling later both tell me that. I'm honestly super confused myself too cause there's no official communication from PESU about start dates"
    },
    {
      "id": "lc0g5iv",
      "body": "This is really helpful, thanks"
    },
    {
      "id": "lc0g6pj",
      "body": "Yeah i might check it out for sure. Thanks for the info"
    },
    {
      "id": "lc0h72g",
      "body": "Is bootstrap held in both the campus' or just rr campus?\nIf only rr campus are ec campus people allowed?"
    },
    {
      "id": "lc0hbjp",
      "body": "During my time, both campus kids would come to RR for bootstrap - but this is also when PES did not have an exponential boom in student intake. So I do know that it takes place for both campuses, but I'm not sure if they still occur at the same campus."
    },
    {
      "id": "lc0hlv0",
      "body": "oh okay"
    },
    {
      "id": "lc0x5ke",
      "body": "Important advice: Network as much as you can during these 5 days"
    },
    {
      "id": "lc0xyad",
      "body": "No bootstrap happens in respective campuses now."
    },
    {
      "id": "lc10ou1",
      "body": "U made me panic for a bit ovr there😢"
    },
    {
      "id": "lc1ezqu",
      "body": "Different in each campus now"
    },
    {
      "id": "lc1fuws",
      "body": "okie"
    },
    {
      "id": "lc1lduu",
      "body": "Woah what last year i saw the ec campus students come to rr for bootstrap"
    },
    {
      "id": "lcbv172",
      "body": "What about kcet kids since theyre most prolly gonna join later. No bootstrap for them?"
    },
    {
      "id": "lcbvapx",
      "body": "No bootstrap if you join late."
    }
  ]
}