{
  "id": "1dxqw51",
  "title": "Capstone ",
  "content": "I'm a female who will be starting 3rd year \ni don't know if I want to work on it with my friends or even if they want to work with me on that\nI'm scared I won't find a team for capstone!! \nWhat will happen ?",
  "metadata": {
    "author": "Frequent_Umpire8571",
    "url": "https://www.reddit.com/r/PESU/comments/1dxqw51/capstone/",
    "permalink": "/r/PESU/comments/1dxqw51/capstone/",
    "score": 9,
    "created_utc": 1720386221,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lc5q923",
      "body": "Why state your gender tho ? 🤔"
    },
    {
      "id": "lc5qocw",
      "body": "Because there is a rule to have one female candidate in your team mandatorily"
    },
    {
      "id": "lc5qtsu",
      "body": "Damn seriously"
    },
    {
      "id": "lc5stts",
      "body": "if u are girl many men will be looking for 4th girl member so u maybe safe"
    },
    {
      "id": "lc5suzq",
      "body": "How do I find those men?"
    },
    {
      "id": "lc5wzn5",
      "body": "wtf legit? Grils ke sath toh koi interaction bhi nahi kiya maine"
    },
    {
      "id": "lc5x6hd",
      "body": "hahaha yess"
    },
    {
      "id": "lc64j30",
      "body": "Wtaf?? I would have failed atp.. also aren't there more guys than girls in pes?"
    },
    {
      "id": "lc665xa",
      "body": "just ask many people literally u should feel free to dm anyone in ur class who u think is smart and feel u guys can put together a good project ,and make sure u have someone confirm to u u can join them"
    },
    {
      "id": "lc66c3k",
      "body": "if they dont reply or seenzone in few days take it as a no"
    },
    {
      "id": "lc6bl04",
      "body": "Yes there are that's what"
    },
    {
      "id": "lc6sq4q",
      "body": "Why does this sound like a comment from a dating subreddit 😭😭"
    },
    {
      "id": "lc6t15v",
      "body": "As others have said - if you do not find a team you will find guys looking around to meet the gender requirement lol. Of course if you already know people you can work with, its easier and better than teaming up with people you don't. Just reach out to people who share similar interests (not necessarily friends) and ask them."
    },
    {
      "id": "lcbisn1",
      "body": "I mean ngl, there will always be a couple of teams who need a 4th. Or if ur close with a prof ask if they know anyone who needs a 4th.. remember, they don't fail anyone (unless y'all have done some shit work)"
    },
    {
      "id": "lcbkgcr",
      "body": "Hahaha no I'm not scared of failing im scared of not finding a good team to work with on a good project"
    },
    {
      "id": "lcbl6v9",
      "body": "Best is to ask ur prof.. otherwise discord and put ur area of interest"
    }
  ]
}