{
  "id": "1dz5ydc",
  "title": "Nitk civil or pes rr cse?",
  "content": "",
  "metadata": {
    "author": "weheeee",
    "url": "https://www.reddit.com/r/PESU/comments/1dz5ydc/nitk_civil_or_pes_rr_cse/",
    "permalink": "/r/PESU/comments/1dz5ydc/nitk_civil_or_pes_rr_cse/",
    "score": 6,
    "created_utc": 1720540573,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lcddj5n",
      "body": "Lmao, even I have the same options, I'm choosing pes rr cs.."
    },
    {
      "id": "lcdf7vx",
      "body": "Pes cs"
    },
    {
      "id": "lcdfgm8",
      "body": "First of all Civil vs CS is a wise career decision you have to make.\n\nI don’t see any advantage except the tag ‘NIT’ , so I would suggest PES RR CS."
    },
    {
      "id": "lcdi0ra",
      "body": "There was a recent thread on college vs branch a few days ago. I will quote relevant bits of my comments from there. Note that the comparison was with BITS, but just replace it with NIT.\n\n>To summarise, you will have to see which is more important to you. If all you care about is getting the best package and are ok with sacrificing your interests, then BITS. Otherwise, you might be better off at PES.   \n  \nChoose BITS if you want that brand name and better salary right out of undergrad, but at the risk of sacrificing your interests. Else study your interests at PES while working hard to create opportunities for yourself so you can match the pay scales by BITSians.  \n  \n..you will never get to actually study a program you want to. To me at least, the course is more important than the college and pursuing your interests is very important. The branch sticks with you forever. With hard work, you can cover the distance between a T1 and T2/3 college.\n\nLinks to comments:\n\n1. [https://www.reddit.com/r/PESU/comments/1doxx78/comment/lad10qi/](https://www.reddit.com/r/PESU/comments/1doxx78/comment/lad10qi/)\n2. [https://www.reddit.com/r/PESU/comments/1dp6lpf/comment/laequ4m/](https://www.reddit.com/r/PESU/comments/1dp6lpf/comment/laequ4m/)"
    },
    {
      "id": "lceq7i0",
      "body": "if ur doing engineering for money or like cs, pes cs. else nitk civil."
    },
    {
      "id": "lcgvdsb",
      "body": "It’s always branch over college"
    },
    {
      "id": "lci5vec",
      "body": "same.. i choose pes cse"
    },
    {
      "id": "lci63s5",
      "body": "rightly said, interest is all that matters"
    }
  ]
}