{
  "id": "1dzpu11",
  "title": "pes rr aiml vs pes ec cse",
  "content": "I might get both through kcet and rr is near my home so traveling time is less, ec campus is pretty far.\nI might also get bms cse through comedk(but hesitant because the number of seats increased in bms)\nwhich would be the best option, please share your opinions.",
  "metadata": {
    "author": "Tight-Common-7247",
    "url": "https://www.reddit.com/r/PESU/comments/1dzpu11/pes_rr_aiml_vs_pes_ec_cse/",
    "permalink": "/r/PESU/comments/1dzpu11/pes_rr_aiml_vs_pes_ec_cse/",
    "score": 11,
    "created_utc": 1720596836,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lchejwx",
      "body": "[Detailed comparison on CS vs CS-AIML](https://www.reddit.com/r/PESU/comments/147gamv/comment/jnve51g/?utm_source=share&utm_medium=web2x&context=3)\n\nCheck the above comment (including the linked comments in the comment) for a branch-wise comparison.\n\nIMO you should keep core CS options first: PES CS > BMS CS > PES CS-AIML > MSRIT ISE"
    },
    {
      "id": "lchfklu",
      "body": "Now that we have the third year portions for aiml i can actually recommend it to people. \n\nSecond year is actually quite decent, and in third year we can choose cybersecurity related electives from cs department or aiml related stuff from aiml department.\n\nObviously cs in ec campus is still better, but if you care about location i don't think aiml is a bad option either"
    },
    {
      "id": "lchfuyc",
      "body": "well what about bms or msrit(might get cse in upcoming rounds), is it better than pes ec cse?"
    },
    {
      "id": "lchfz02",
      "body": "what abt cse in bms or msrit(might get in further rounds), is it better than pes?"
    },
    {
      "id": "lchhz9l",
      "body": "Dmd you, need some advice"
    },
    {
      "id": "lchizfy",
      "body": "If you want clg life, I heard bms is better for that. Altho since there is an increase in seats, it might get competitive there too. So pes ec campus is probably best option"
    },
    {
      "id": "lchkj1k",
      "body": "nope I'm more into academics tbh"
    },
    {
      "id": "lcho1zp",
      "body": "Msrit definitely not. But bms is probably equivalent. \n\nOf these three just take one depending on fee, location, and infrastructure\n\nPes ec cs,\nBms cs,\nPes rr aiml\n\nMostly not much difference"
    },
    {
      "id": "lchp4go",
      "body": "Yep then pes ec campus if transport not an issue or else take rr campus aiml"
    },
    {
      "id": "lci7qhx",
      "body": "Just an update: Wouldn't recommend BMSCE anymore, as they have about 900 seats for core CSE now and 300 seats for AIML whereas MSRIT has only about 220 for CSE core."
    },
    {
      "id": "lci7ryn",
      "body": "Just an update: Wouldn't recommend BMSCE anymore, as they have about 900 seats for core CSE now and 300 seats for AIML whereas MSRIT has only about 220 for CSE core."
    },
    {
      "id": "lciht17",
      "body": "Ah, so that is roughly similar to PES' intake for CS. If I remember its around 1300 now. Well its still cheaper being through CET/ComedK so I'd say BMSCE still over MSRIT."
    },
    {
      "id": "lciifql",
      "body": "except that PESU is able to attract so many companies whereas BMSCE struggled to get 900+ offers (according to their website)  \nWhat? He's getting both through COMEDK lol, so idk what the last part of your sentence implies"
    },
    {
      "id": "lcj7hbx",
      "body": "so um pes ec would be better right?"
    },
    {
      "id": "lcj9ext",
      "body": "im not gonna say anything about that cuz i havent been in pesu (ec) for more than 1.5 months  \nbut between bmsce cse and msrit cse, i personally think its better to choose the latter, from this year onwards as you would have to compete with only about 540 students in msrit (cse and group) whereas with about 1400 students in bmsce (cse and group)"
    },
    {
      "id": "lcjyrm7",
      "body": "Is placements same for PES RR and PES EC campus? I mean if a company visit PES RR, then will the PES EC campus students be eligible?"
    },
    {
      "id": "lck6i0s",
      "body": "Yes yes, both can sit for same company"
    }
  ]
}