{
  "id": "1dzqvj3",
  "title": "Document Submission ",
  "content": "The website says that the last day to submit documents is 15th July. Do I need to travel all the way to Bangalore to submit 12th Marksheet? Can it not be done when I visit for 2nd round of counselling?\nPlease share your inputs? Help if you have any information about this",
  "metadata": {
    "author": "LopsidedPineapple606",
    "url": "https://www.reddit.com/r/PESU/comments/1dzqvj3/document_submission/",
    "permalink": "/r/PESU/comments/1dzqvj3/document_submission/",
    "score": 4,
    "created_utc": 1720601169,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lcho1l4",
      "body": "Yeah afaik the important documents need to be submitted before july 15th .. Few documents like Migration Certificate can be submitted after july 15th too"
    },
    {
      "id": "lci8zee",
      "body": "i think they moved the date to 25th july"
    },
    {
      "id": "lcifpn8",
      "body": "heard you can submit them even after classes begin"
    },
    {
      "id": "lciky89",
      "body": "I love how there are 3 other comments and each comment mentions a different date. Not even day 1 and PESts are already confused. PESU Masterstroke as always."
    },
    {
      "id": "lcj246y",
      "body": "Where can I get the correct answer?🥲"
    },
    {
      "id": "lcj27nk",
      "body": "But are people travelling all the way to Bangalore to just submit the documents?"
    },
    {
      "id": "lcj2942",
      "body": "Is it posted on the website?"
    },
    {
      "id": "lcj2b7v",
      "body": "Where can I confirm this?"
    },
    {
      "id": "lcj54aa",
      "body": "well a few seniors said happened last yr also now the date has been extended to 15 july and probably be extended again"
    },
    {
      "id": "lcj6n8w",
      "body": "Yeah they have everything offline, but you can also go check out the hostel while you are in banglore."
    },
    {
      "id": "lcjo798",
      "body": "yea"
    },
    {
      "id": "lck7hfa",
      "body": "I went for counselling of round 1 where i submitted a few copies of documents , but at that time all the results and documents werent released yet ,so we have to go to PES MRD block admission office to submit a few original documents & do a couple of signs , its a 15 mins process.. I went there on july 6th as my hostel admission was alloted on july 7th , so i clubbed both the trips to banglore. They told us that Migration Certificate & some long memo of 12th can be submmited on the date of joining or anytime after july 15th, everything else need to submitted before 15th. Thats what they told on july 6th. idk whatll happen if we dont submit I have to go again for 2nd counselling . PES has everything offline .. they should make a couple of things online. Hope you got some clarity. Now they have extended it to july 25th according to their website (i think it happens every year)  \nImportant Dates :- [https://pes.edu/important-dates/](https://pes.edu/important-dates/)"
    },
    {
      "id": "lck7up1",
      "body": "The last date is 25th now and yes you have to go there in person"
    },
    {
      "id": "lcmdh5p",
      "body": "If you have any relative or friend in blr, you can just post it to them and they'll submit it for you"
    },
    {
      "id": "lcmlnzl",
      "body": "Thanks, this helped. Regarding hostel allotment, where was this information posted? I also got a seat in 1st round but there is no information regarding hostel? Do I need to contact them for this as well?"
    },
    {
      "id": "lcna6t2",
      "body": "You get a mail .. the optios were june 30th , july 7th , july 20th. this for the people who wrote their name when they went for the round 1 counselling otherwise , you should wait until july 20th i think. I got mail with a document attatched for hostel of rr campus and all the documents that are required"
    }
  ]
}