{
  "id": "1e0t9ys",
  "title": "Drop or Pes?",
  "content": "Hi! This yr neither Jee nor Bitsat( 20X marks) went well for me. Should I continue in Pes or take a drop for 2025? I am willing to grind everyday but worried caz of the rank inflation, and I dont want to end up in the same place again next yr. Plus my parents are totally against drop. Also, I dont have RR campus( the infra felt great when I went to write Pessat), I have EC campus CS and that campus being called jail demotivates me a lot and most of my friends are going to RR. The last date for seat surrender is extended to 25 july, but I don't want to be in dilemma till that time. Pls seniors or droppers help.",
  "metadata": {
    "author": "grinderOP",
    "url": "https://www.reddit.com/r/PESU/comments/1e0t9ys/drop_or_pes/",
    "permalink": "/r/PESU/comments/1e0t9ys/drop_or_pes/",
    "score": 16,
    "created_utc": 1720715708,
    "flair": "PESSAT/Admission",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lcp6oyw",
      "body": "take pes"
    },
    {
      "id": "lcpd2dq",
      "body": "Drop"
    },
    {
      "id": "lcpdi3o",
      "body": "If ur getting pes then take it unless you are very sure of ur self studying skills or else 1 yr will be a waste"
    },
    {
      "id": "lcpe5m6",
      "body": "Yea I am planning to do self study+ take test series to evaluate myself continously, but no one can be 100 percent sure where they will be next yr despite doing hard work. Caz many people who took drop last year got a better percentile but a worser rank. Thats why I am still confused."
    },
    {
      "id": "lcpetyj",
      "body": "Yep it just depends in your consistency, here's what u can do at this month end you can test yourself from any of these JEE,kcet,comedk,bitsat just pick one and then give a test, after evaluating urself the marks makes u confident then take a drop other than that take what's given to u"
    },
    {
      "id": "lcpfi0z",
      "body": "\"Nothing ever goes as planned in this accursed world\"\n\nAfter covid everything is increasing let it be inflation,  competition, etc. \n\"everything\""
    },
    {
      "id": "lcpo44g",
      "body": "Hmm will try thanks!"
    },
    {
      "id": "lcpset5",
      "body": "Never PES"
    },
    {
      "id": "lcpskv4",
      "body": "Pls give some reasons"
    },
    {
      "id": "lcpsq3p",
      "body": "Shit college, shit management, shit environment, go to Tier 3 and grind leetcode you’ll end up better"
    },
    {
      "id": "lcpt97g",
      "body": "Sorry, feeling bad for u(and myself if I go) Btw u r in which yr and from which campus? "
    },
    {
      "id": "lcptlbx",
      "body": "Dont feel bad for me buddy, i am a 2023 grad"
    },
    {
      "id": "lcpts9g",
      "body": "How was ur experience so far in Pes? "
    },
    {
      "id": "lcptw5h",
      "body": "First comment should sum it up"
    },
    {
      "id": "lcpu60q",
      "body": "Is it that bad? I am in for a ride then. "
    },
    {
      "id": "lcpu8bj",
      "body": "Wishing you luck"
    },
    {
      "id": "lcpudkl",
      "body": "Yeah Imma need that"
    },
    {
      "id": "lcq4ds2",
      "body": "did you write comedk/kcet ?  \nif you got a decent rank   \nyou can join a vtu college and do partial drop   \nsince you are sure you can grind and stuff  \nand vtu syllabus is comparitively easier to manage compared to pesu syllabus"
    },
    {
      "id": "lcq52rh",
      "body": "Why should I bother joining a college then? I am not interested in partial drop, its very hard to manage"
    },
    {
      "id": "lcq8rvg",
      "body": "Okie"
    },
    {
      "id": "lcqhejq",
      "body": "I was in pretty much the same situation a couple of years ago, I went with pes. I'd thought it would be safer to go with this than rolling the dice with jee mains and bitsat is 2023.  At the time it seemed like a good idea cause this is guarenteed while my performance in the 2023 enterance exams wouldnt have been. if you really feel like you can do it then you should try to convince your parents that its a good idea. PES increases the fee every year so if you take pes next year i would imagine that youd have to pay more than you would do now. \n\njust a side not but there are many people that ive met who go to pes despite of taking a drop year. (even met a guy  who was born in 2002)\n\nAbout the college:\n\nthe college experience sort of falls into the it is what it is category. From what ive noticed there's a bit of language barrier sort of thing. people tend to be in friend groups where people mostly speak the same langauge (for example most of the people in my friend group are north indians and speak hindi).  \n\nThe college is pretty strict when it comes to attendance (75% min), the classes can at times be boring so yeah attendance is a pain in the ass\n\nthe college fests are kind of a snoozefest and they keep them at the worst times possible like the night before diwali or the night before an exam\n\nsome of the rules in the college are strict and goofy in pes. so thats a bit of a pain point as well.\n\nOne of the good things about pes is that they provide all the study material on their website or the teacher's drive link. Many colleges even the reputated ones like delhi uni dont provide such stuff.  This means that even if youre not the type of guy who pays attention in class you can still study later and score good marks and also that you dont have to buy any books for most of the subjects.\n\ngpa and change of branch/campus: it is easy to score a gpa of over 8, to score 8.5 or 9+ youd have to study a bit harder. if you have like a high gpa you can change your brnach/ campus after the first year. youd need like 9,7 or 9.6 for rr.\n\nscholarships: if you score a good sgpa then you can get a scholarship of around 80k (top 20 percent of the students get this scholarship if im not wrong)\n\nplacements: you need to have a gpa of at least 8 to be shortlisted but that doesnt guarentee youll get placed and below 6.7 youre not even allowed to sit for placements. for ece the placements have been abysmal.\n\nclubs :they do have a lot of clubs (but  most of them are a waste of time unless its something you give a shit about  like music art or whatever) they do have tech clubs too which are kinda decent.  taking parts in clubs in mandatory or anything its just something people do for socializing and to make connection ot to meet new people\n\ni cant really say much about the jail thing. its not gonna be pretty but what can we do. in the end were just heer to get the degree, get placed and if were lucky make a few friends on the way. Lastly id like to say you dont have to get a btech, maybe theres some otehr stuff that you'd enjoy. dont a btech just for the sake of getting one."
    },
    {
      "id": "lcqlzny",
      "body": "Wow! Thanks for the detailed answer! Really appreciate it!"
    },
    {
      "id": "lcs5fjr",
      "body": "Bro rr is also a jail only, both campuses are literally the same just that rr has better infra and people hype over it because it's called the \"main campus\". Also campus is irrelevant after 3 years it's not like you're gonna live there your whole life"
    },
    {
      "id": "lcs9k1z",
      "body": "if the user name checks out, then take pes"
    },
    {
      "id": "lcsbm5g",
      "body": "Damn,nice answer dude. So are you from ec branch or rr"
    },
    {
      "id": "lcsq6zy",
      "body": "im from ec campus"
    },
    {
      "id": "lcsqixf",
      "body": "happy to help!"
    },
    {
      "id": "lcsvmfj",
      "body": "A drop year has turned out to be worse for most people. I'd suggest to go ahead with PES for CSE only. If you have the ability to work hard and grind, you'll do well."
    },
    {
      "id": "lcta0mn",
      "body": "I agree with the other guy as well, PES is trash, you did say that you have got a decent COMEDK rank, if you are getting any of the top 5 colleges in Karnataka through COMEDK, then go for it. The faculty in PES is really bad, professors here don't know how to teach and you'd have to depend only on yourself for studies, exam pattern and exams themselves are very difficult which makes it tougher to maintain a decent CGPA. I am speaking as someone who got PES RR CSE through KCET GM and how badly I am struggling and regretting my decision badly."
    },
    {
      "id": "lctlja7",
      "body": "Damn. Which year are you in? What would you recommend to a fresher to keep up a good cgpa? Any learnings from how you went about studying that you would like to share?\n\n  \nAlso I'm getting DCSE CSE (IOT & Cyber Security Including Block Chain Technology) through comedk. Might choose PES EC CSE core over it?"
    },
    {
      "id": "lctqvug",
      "body": "Idk bro, if you had gotten CS core then I would have told you to take DCSE CS IOT, are you not getting core CS anywhere else apart from PES EC CSE?"
    },
    {
      "id": "lctv23w",
      "body": "I have SRM KTR CSE core as an option."
    },
    {
      "id": "lcw4gu7",
      "body": "Take pes!The competition is increasing every year.In drop yeara,There are chances of getting distracted too,So go for whatever you have now"
    },
    {
      "id": "lczvfag",
      "body": "did u try for campus change to rr? How much efforts will I need to pull to get 9.6-9.7 cgpa?"
    },
    {
      "id": "ld184k9",
      "body": "If you're willing to settle for aiml in rr campus you could realistically get it by scoring somewhere around 8. \nIf you wanna go to rr for cse then you'd have to score 9.7 \nAnd no it isn't easy to score 9.7 it takes a lot of hard work. Scoring gpa gets harder once you start getting close to 9."
    },
    {
      "id": "ld18818",
      "body": "I didn't try for change of campus as my gpa was 8.7 and I didn't wanna go for aiml"
    },
    {
      "id": "ld18dic",
      "body": "Hmm I thought so it would be tough. Will it beneficial to change from ec campus CS to rr campus( Aiml)?"
    },
    {
      "id": "ld18krn",
      "body": "oh ok thanks! How are the technical and non technical clubs of ec campus? I went through pesufy site for details but still wanted a senior's review."
    },
    {
      "id": "ld18saa",
      "body": "Not much "
    },
    {
      "id": "ld18wz0",
      "body": "Ohk thnx"
    },
    {
      "id": "ld190kx",
      "body": "[https://www.reddit.com/r/PESU/comments/147gamv/deleted\\_by\\_user/?utm\\_source=share&utm\\_medium=web3x&utm\\_name=web3xcss&utm\\_term=1&utm\\_content=share\\_button](https://www.reddit.com/r/PESU/comments/147gamv/deleted_by_user/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)\n\nhere's something on that topic"
    },
    {
      "id": "ld19hpx",
      "body": "Although i dont have any first hand experience, the non tech clubs seem to be good. theres MUN, Traditional Dance, Western Dance, Designer club, theatre.\n\nthe tech ones are alright too ig"
    },
    {
      "id": "ld1af6z",
      "body": "Thanks for sharing, I prefer cse core over specialization"
    },
    {
      "id": "ld1anh9",
      "body": "Okay thanks! How's the coding culture according to you, did anyone get selected in GSOC from PES in recent years?"
    }
  ]
}