{
  "id": "1e1e1a9",
  "title": "Another dumb question",
  "content": "Do some people at PESU complete their 4 yrs [b.tech](http://b.tech) course in 3-3.5 yrs ?",
  "metadata": {
    "author": "Interstellar777077",
    "url": "https://www.reddit.com/r/PESU/comments/1e1e1a9/another_dumb_question/",
    "permalink": "/r/PESU/comments/1e1e1a9/another_dumb_question/",
    "score": 0,
    "created_utc": 1720779030,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lctm9l8",
      "body": "No but some complete 4 year course in 5-7 years"
    },
    {
      "id": "lctnl9l",
      "body": "Tf why? Wdym?"
    },
    {
      "id": "lcto9df",
      "body": "backlogs?\n\nwhat else da"
    },
    {
      "id": "lctodgh",
      "body": "Damn, pes people get backlogs? Won't the best crowd come there for cse.. Don't they study there?"
    },
    {
      "id": "lctp8fi",
      "body": "depends from person to person. I know a person who got into IIT Guwahati but passed out a year or 2 later than his batchmates, some. people dont study that much after getting into college, drugs also play a role.. many things tbh. Just cause you score a good rank anoll doesnt mean youll do extremely well in college"
    },
    {
      "id": "lctqesq",
      "body": ">know a person who got into IIT Guwahati but passed out a year or 2 later than his batchmates\n\nAyo, can u elaborate? \n\n>Just cause you score a good rank anoll doesnt mean youll do extremely well in college\n\n🙂🙂 I'm scared.."
    },
    {
      "id": "lctsb0g",
      "body": "well, he got into weed and other drugs. He didnt have a good friend group basically, all that shit caused him to fall behind.\n\nDw bro, just work hard in college. I dont have much knowledge abt this but afaik, youll learn as you progress in college"
    },
    {
      "id": "lctsyyu",
      "body": "Ahh, tqsm man.."
    },
    {
      "id": "lcttzvg",
      "body": "Yes i knew a guy who made a time machine for his project and used it to travel back and finish his college course in 1 year"
    },
    {
      "id": "lcu23kj",
      "body": "XD, I mean is the course structured in that way, or the crowd isn't really interested in doing it ?"
    },
    {
      "id": "lcur8q0",
      "body": "This is actually not a dumb question :D  \nYou cannot graduate early at PES. Each semester has a minimum number of credits you need to enroll for (including final year semesters)"
    },
    {
      "id": "lcytyxu",
      "body": "I remember this guy!\n\nSuch a smart man"
    },
    {
      "id": "lcyx8yu",
      "body": "So any updates on my application?"
    },
    {
      "id": "lcyz60j",
      "body": "Working on it bro, takes some time"
    }
  ]
}