{
  "id": "1e1mu8j",
  "title": "Ashoka vs PES EC for cs AI ML",
  "content": "\n\nI'm currently facing a tough decision between Ashoka University and PES University for pursuing cs. I'm really torn because while I value the potential for strong career prospects after graduation (which PES seems to offer), I also want to ensure I have a fulfilling college life that includes my passions for sports and theatre. Has anyone here attended either university or faced a similar decision? I would greatly appreciate any insights or advice you could share to help me make an informed choice.\n\nThanks in advance!",
  "metadata": {
    "author": "HonestOpinions12",
    "url": "https://www.reddit.com/r/PESU/comments/1e1mu8j/ashoka_vs_pes_ec_for_cs_ai_ml/",
    "permalink": "/r/PESU/comments/1e1mu8j/ashoka_vs_pes_ec_for_cs_ai_ml/",
    "score": 3,
    "created_utc": 1720803930,
    "flair": "PESSAT/Admission",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lcv5xnu",
      "body": "I was in a similar dilemma while choosing between Manipal CSE and PES CSE 3 years ago and regretted my decision within a few months I'd say choose college with a more liberal environment, at this point I'm not sure what I learned from the college itself other than being highly competitive and apathetic towards other people."
    },
    {
      "id": "lcv8knp",
      "body": "hmm! i completely agree, but the issue is ashoka is double the fee at pes with not as good placements + bsc degree. so my parents are obv leaning towards the safer bet which is pes, but I want to go to ashoka not just for the learning method but the environment & exposure..."
    },
    {
      "id": "lcvbhyr",
      "body": "If you're leaning towards a safer option then ofc PES is promising in terms of placements but placements depend on your capabilities rather than the college."
    },
    {
      "id": "lcyefc0",
      "body": "Bro who chooses pes over freaking manipal"
    },
    {
      "id": "lcygdmv",
      "body": "I mean, i did lol"
    },
    {
      "id": "lcystns",
      "body": "I did too lmao manipal isn't a nit💀"
    },
    {
      "id": "lcz4i6h",
      "body": "bro main branch is pretty good no"
    },
    {
      "id": "lcz5zyp",
      "body": "It's same as pes lol , infact the cs avg was lesser than pes last year lol"
    }
  ]
}