{
  "id": "1e21eas",
  "title": "Laptop Recs for AIML",
  "content": "I’m joining PES this year and I’m in need of upgrading my laptop.\nWhat are the laptops that people use generally in this branch and is there any specific requirements, if so please share\nI was thinking of going for MacBook Air M2 with 8core GPU, 8gb ram 256gb ssd.\nWould this satisfy the requirements?\n\n",
  "metadata": {
    "author": "Different_Aspect_561",
    "url": "https://www.reddit.com/r/PESU/comments/1e21eas/laptop_recs_for_aiml/",
    "permalink": "/r/PESU/comments/1e21eas/laptop_recs_for_aiml/",
    "score": 4,
    "created_utc": 1720843851,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lcy8dn2",
      "body": "8GB RAM and 256 GB should do good for your first year because you're just gonna do basic coding and if possible a decent graphics card."
    },
    {
      "id": "lcy8iug",
      "body": "Idts it's worth buying a brand new mac book at the moment because even a normal laptop like Dell/HP will suffice. If you're interested in mac then look for a second hand one."
    },
    {
      "id": "ld1tzyl",
      "body": "well it won't be much of a problem to use mac in the first year, but then in the 2nd year we use ARM processor for the weekly assignments which you won't be able to easily download ,so all the Mac users had to use their friend's laptop for this one. I say stick to windows"
    },
    {
      "id": "ld30t7w",
      "body": "You can use the ARM simulator on Mac using wine. It runs pretty well"
    },
    {
      "id": "ld31lyz",
      "body": "The RAM and storage are too small. You'll face an issue with that especially while localhosting LLMs. I'm not into AI ML but I presume other projects too would use tonnes of RAM and storage(because datasets and trained models can be huge) \n\nThe mac also uses shared memory. That is, the GPU does not have its own RAM. It uses the common block of RAM for both CPU and GPU. \n\nGo with the 16/512 mac if your budget allows, or I'd suggest going with a ThinkPad. Explained why [here](https://www.reddit.com/r/PESU/s/sRFXjQ3zkj)"
    }
  ]
}