{
  "id": "1e22uwp",
  "title": "Doubt abt aiml ",
  "content": "Wts the diff between picking cse aiml ,and core cs and aiml as electives ?? ",
  "metadata": {
    "author": "Admirable-Source2514",
    "url": "https://www.reddit.com/r/PESU/comments/1e22uwp/doubt_abt_aiml/",
    "permalink": "/r/PESU/comments/1e22uwp/doubt_abt_aiml/",
    "score": 3,
    "created_utc": 1720849097,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lcyano7",
      "body": "CS-AIML is a specialised *degree*. Which means your degree name will be CS-AIML. If you choose all electives from CS-AIML from a single specialisation group in your 3rd year, you will be eligible for a specialisation certificate. If I remember correctly, the specialisation groups were healthcare, advanced ML and something else.\n\n  \nCore CS (or just \"CS\"), is a non-specialised degree. Your degree name will be CS. If you choose all electives from CS from within a single specialisation group, you will be awarded its specialisation certificate. The groups here were cybersecurity, systems and MIDS. Note that MIDS (Machine Intelligence and Data Science) specialisation comprises AIML-related courses like Big Data, NLP, CV, Data Analytics, Graph Theory, IR and so on. Quite a few of these overlap with AIML elective options."
    },
    {
      "id": "lcyf5g8",
      "body": "So a person picking aiml n core cs cant study together??"
    },
    {
      "id": "lcyfls0",
      "body": "Although courses overlap, they're different branches, just the way CS and ECE are different branches. The only way both students can study together in the same class is if a CS student takes a CS-AIML elective or vice versa."
    },
    {
      "id": "lczaij7",
      "body": "I dont mean studing in same class. I mean like same topics after college ??\n i hve heard tht aiml placements are better or the same as core like in bms is it true ??"
    },
    {
      "id": "lczcezu",
      "body": "AIML hasn't even had placements. They'll end up being similar to CS placements. I'd suggest reading through the link I attached in my original comment."
    }
  ]
}