{
  "id": "1e33x34",
  "title": "Should I open ig account after coming to college? Is it necessary to a ig account? ",
  "content": "I've not been using ig since 2 years, focused on my jee prep, should I open it now? Is it necessary or not? \n\nScored 98.1 perc this year, joining pes rr aiml.. ",
  "metadata": {
    "author": "DforDOLPHIN",
    "url": "https://www.reddit.com/r/PESU/comments/1e33x34/should_i_open_ig_account_after_coming_to_college/",
    "permalink": "/r/PESU/comments/1e33x34/should_i_open_ig_account_after_coming_to_college/",
    "score": 1,
    "created_utc": 1720968067,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ld594hl",
      "body": "dont worry bro none of the faculty post their lectures as stories and notes as posts"
    },
    {
      "id": "ld59ayl",
      "body": "Bro.. Im serious, ain't kidding 😭"
    },
    {
      "id": "ld59n2v",
      "body": "Naa , trust me, it's damn distracting. I deleted IG , and my mental health is better. "
    },
    {
      "id": "ld59sju",
      "body": "Are you missing out smtg? Like people say it's better to have an ig account, it helps in building connections and stuff, is it true?"
    },
    {
      "id": "ld5a5ti",
      "body": "Nope. If u wanna build connections u got LinkedIn for that. I found that scrolling was eating most of time away so I quit. U can build connections in other ways like discord and LinkedIn . "
    },
    {
      "id": "ld5alka",
      "body": "Ah, okay.. Thanks a lot mann.."
    },
    {
      "id": "ld5blfp",
      "body": "bro make linkedin for connections and career related stuff /reaching out to seniors . Instagram is cool if you want to know only whats happening in your closest circle of say 20 friends if its beyond that it just becomes a huge distraction , endless scrolling ,time waste in reading confessions of who likes whom in your class lmfao . I personally deleted mine for a better life , I found myself constantly comparing my life with my followers and it just sucked. Just call friends once a week or so catch up with their real life, share your problems, ask for help if you need some, keep it real, Only the real ones stay in touch after school . Instagram is only the highlights ,nobody posts their lowlights on there."
    },
    {
      "id": "ld5eg2i",
      "body": "Okay bro.. Sure.."
    },
    {
      "id": "ld5gunj",
      "body": "I have never and will never use instagram , you should be fine for the most part, some times some club event ads are like “check out our instagram story for more info”"
    },
    {
      "id": "ld5htsn",
      "body": "It's easier to keep in touch with your friends through IG. But its not necessary"
    },
    {
      "id": "ld5v84f",
      "body": "Na bro issoke\nEven I'll be inactive most like 90% of a year, I'll browse on chrome if needed, issoke\nSometimes if you're into clubs and stuffz, you'll be needed to post some stories regarding hackathon, competition that's it worst case\nNothing else \nI'm happy by choosing not to use insta, uff I save lotta capacity of brain, without letting it to focus only for short spans."
    },
    {
      "id": "ld5w9r4",
      "body": "Ok mann.. Thankyou sm."
    },
    {
      "id": "ld5waix",
      "body": "Tqsm man.."
    },
    {
      "id": "ld5wbsx",
      "body": "Ah, thanks mann"
    },
    {
      "id": "ldkt4kx",
      "body": "Just open it....keep it in inactive state mostly bcz it's distracting....it's useful during the fest time u get most info from ig abt it. Also, for club recruitment and activities \nBut u can also find the info on watsapp groups...so its not compulsary "
    }
  ]
}