{
  "id": "1e4tx2m",
  "title": "Doubt regarding cs and cs specialization",
  "content": "I have heard everyone say core cse is better but eventually even core cse students should choose their electives right? .. Suppose I'm interested in a particular specialization and I'm getting it in a college ( where I'm not getting core cse) is it better to opt for it? Or students of cs specialization field miss out few basics which core cse students study and then choose their electives.. \nPlease do correct me if I'm wrong in something.. \nThanks ",
  "metadata": {
    "author": "Darknight_444_",
    "url": "https://www.reddit.com/r/PESU/comments/1e4tx2m/doubt_regarding_cs_and_cs_specialization/",
    "permalink": "/r/PESU/comments/1e4tx2m/doubt_regarding_cs_and_cs_specialization/",
    "score": 3,
    "created_utc": 1721149404,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ldht961",
      "body": "Yeah.. some core subjects will be missed, go through the \"specialization\" course in the other uni and make sure data structures, Os, database system exist, and you won't be missing out on much. Electives here is kinda situational.. you can't plan for what you'll select for electives now, so go for the other course if these subjects exist.. these are main subjects in core cse."
    },
    {
      "id": "ldke1zt",
      "body": "So i should check the syllabus of the specialization and see whether ds, os and database system subjects exist.."
    },
    {
      "id": "ldks7z3",
      "body": "Yeah, if these exist, you won't be missing out on much. These subjects and computer networks.."
    },
    {
      "id": "ldktbd2",
      "body": "Refer to this for the syllabus in detail with subjects  for aiml  \n[https://www.reddit.com/r/PESU/comments/1e2umzb/comment/ld3p5yf/?utm\\_source=share&utm\\_medium=web3x&utm\\_name=web3xcss&utm\\_term=1&utm\\_content=share\\_button](https://www.reddit.com/r/PESU/comments/1e2umzb/comment/ld3p5yf/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)"
    }
  ]
}