{
  "id": "1e5ovo5",
  "title": "How many students from pes prepare for gate? Do we get some time to prepare for this exam? ",
  "content": "I want to persue mtech in aiml from any top iit, so i think I'll be preparing for this exam.. So is it possible to take out time and study.. And do people study for all these exams in pes? ",
  "metadata": {
    "author": "DforDOLPHIN",
    "url": "https://www.reddit.com/r/PESU/comments/1e5ovo5/how_many_students_from_pes_prepare_for_gate_do_we/",
    "permalink": "/r/PESU/comments/1e5ovo5/how_many_students_from_pes_prepare_for_gate_do_we/",
    "score": 11,
    "created_utc": 1721239354,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ldnemw1",
      "body": "Dont tell me you joined through jee"
    },
    {
      "id": "ldneqou",
      "body": "I joined through jee only.. Yy?"
    },
    {
      "id": "ldnf3hh",
      "body": "Didnt you get any nits/iiits\nIk rank inflation be crazy but you couldve gotten mid tier nits right?"
    },
    {
      "id": "ldnf3k3",
      "body": ">Also percentile flex karne ka tarika thoda casual he\n\n98.1 percentile pe kya milega Bhai bta do jara"
    },
    {
      "id": "ldnf72x",
      "body": "Mid tier nits aren't worth it man.."
    },
    {
      "id": "ldnfpwz",
      "body": "Bruh they are worth anyday over paying 4.8 lakhs every year as long as you are getting a decent branch"
    },
    {
      "id": "ldnfxqs",
      "body": "I'll be taking admission thru kcet after the counselling, so fee ain't an issue"
    },
    {
      "id": "ldng662",
      "body": "Ohhh \nI thought you were going through just jee quota\nThen its upto you to decide\nHeard josaa is a bit fucked up this year"
    },
    {
      "id": "ldngbkc",
      "body": ">Heard josaa is a bit fucked up this year\n\nNot just a bit bro.. It's disastrous this year.."
    },
    {
      "id": "ldnhqd9",
      "body": "abe tere liye what rank does 98.1 percentile translate to?"
    },
    {
      "id": "ldnhuoo",
      "body": "30k this yr"
    },
    {
      "id": "ldo50rn",
      "body": "What the actual fuck, that 98.17 percentile back in my day was like 18k rank. That was good enough to get into your local nit dtu ya whatever (software engineering it ya ece kisi branch meÂ "
    },
    {
      "id": "ldo5da0",
      "body": "And during your time, the marks req for 98 was also less, this year I scored 220 to get this percentile lol.. Last year 150 was 98 percentile.. This year the competition was fucking huge man Ngl.."
    },
    {
      "id": "ldo5o5i",
      "body": "Kitte laundo ne diya h jee mains is bar"
    },
    {
      "id": "ldo5qpe",
      "body": "15l"
    },
    {
      "id": "ldo5uf0",
      "body": "Damn bro so depressing to see ki itte log are just stuck in this rat raceÂ "
    },
    {
      "id": "ldo60z9",
      "body": "Bhai question ka ans bta deðŸ¤§"
    },
    {
      "id": "ldo612v",
      "body": "Tera home state konsa h"
    },
    {
      "id": "ldo63em",
      "body": "Ktaka"
    },
    {
      "id": "ldo6b05",
      "body": "Acha delhi ya punjab Hota toh dtu pec mill jata pes me cs ki branch aur dtu/nsut me eceÂ "
    },
    {
      "id": "ldo6r2m",
      "body": "Acha, so yaha pe there's no classes in fourth year. After sixth sem you don't have to come to college.Â  As far as I know you may have a couple off online classes fourth year me jinke sirf exam likhne yaha anna hoga aside froom that the entire thing is online.\nPeople use the fourth year to prepare gate, cat and all.Â \nÂ "
    },
    {
      "id": "ldo6y3o",
      "body": "Damn.. Fourth yr mein no classes?"
    },
    {
      "id": "ldo79w6",
      "body": "Haan agar internship lag Jaye and you get the credits from that. Otherwise you would have to take up additional courses in the final year to make for that"
    },
    {
      "id": "ldo7fbw",
      "body": "Ok bro.. TqsmðŸ™Œ"
    },
    {
      "id": "ldo7oyz",
      "body": "No problem"
    },
    {
      "id": "ldqbnsq",
      "body": "Majority of students choose to work for a couple of years and then go do Masters abroad. Very very few who decide to write GATE. I do not know a single person from my batch who has. I know of 2-3 juniors max.\n\nAlso, PES workload is pretty substantial, you may not have time to prepare for GATE. You may have a little bit of free time in your 4th year, apart from your internship. Watch GateSmashers and NesoAcademy videos on YT throughout your degree, and you should be good to go ðŸ‘ðŸ»"
    },
    {
      "id": "ldqc9jz",
      "body": ">Watch GateSmashers and NesoAcademy videos on YT throughout your degree, and you should be good to go\n\nIs this enough or should I purchase go classes?"
    },
    {
      "id": "ldqctzt",
      "body": "I do not know anything about GO classes or GATE prep for that matter. Hope someone else can help you out"
    },
    {
      "id": "ldqcvrb",
      "body": "Ahh, thanks for the help man.."
    }
  ]
}