{
  "id": "1e7btx5",
  "title": "random",
  "content": "are people who play video games screwed",
  "metadata": {
    "author": "aryan-horse",
    "url": "https://www.reddit.com/r/PESU/comments/1e7btx5/random/",
    "permalink": "/r/PESU/comments/1e7btx5/random/",
    "score": 2,
    "created_utc": 1721416395,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ldz50od",
      "body": "I wouldn't say so. I play valorant 3 hours a day but my gpa is above 8.5 but that's just me. I know many people who play genshin impact or whatever all day bug still some how manage to maintain a GPA of 9 or above"
    },
    {
      "id": "ldz57du",
      "body": "No I meant is the WiFi not gonna block the games"
    },
    {
      "id": "ldz5n1y",
      "body": "Oh is that what you meant lmao \nYou can't play video games on the college wifi they've taken the liberty to disable Chess.com as well lmao. \nIm not sure about the hostel wifi but I think you should be able to play stuff using that"
    },
    {
      "id": "ldz5pj9",
      "body": "Ya the college WiFi"
    },
    {
      "id": "ldz5r4r",
      "body": "And is the speed in rr campus good"
    },
    {
      "id": "ldz5svw",
      "body": "Yeah you can't play games using that"
    },
    {
      "id": "ldz5x53",
      "body": "And the hostel WiFi and is it good speeds"
    },
    {
      "id": "ldz67pk",
      "body": "I don't go to rr campus so I wouldn't have an idea about that and neither am I from the hostel. But from what I've been told, the hostel wifi in ec campus at least is not that great people at times have to use their mobile data instead of that"
    },
    {
      "id": "ldz6clh",
      "body": "Thank you"
    },
    {
      "id": "ldz6cto",
      "body": "Not in ec campus at least"
    },
    {
      "id": "ldz6d5m",
      "body": "Thank you"
    },
    {
      "id": "le0xerm",
      "body": "Rank? And give your id"
    },
    {
      "id": "le17tch",
      "body": "Side note - please frame better titles for your posts. It becomes difficult for someone to search for relevant posts if the title is \"random\"."
    }
  ]
}