{
  "id": "1e8mv7z",
  "title": "Pes University Ring road campus Total fees through Dcet ",
  "content": "",
  "metadata": {
    "author": "Ok-Builder5071",
    "url": "https://www.reddit.com/r/PESU/comments/1e8mv7z/pes_university_ring_road_campus_total_fees/",
    "permalink": "/r/PESU/comments/1e8mv7z/pes_university_ring_road_campus_total_fees/",
    "score": 5,
    "created_utc": 1721570114,
    "flair": "PESSAT/Admission",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "le8ayjf",
      "body": "Not sure when Delhi started it's entrance test 🤔"
    },
    {
      "id": "le8hvy1",
      "body": "It's not Delhi..it's diploma common entrance test"
    },
    {
      "id": "leawdrz",
      "body": "It's the same as kcet fees. Some years ago it was 1.13 lakhs. It might have increased now. I am not sure. If you are eligible for quota, then it will be less than that for general merit students."
    },
    {
      "id": "lecx61z",
      "body": "It’s the same as kcet fees, around 1.2L per year. There is the MRD/CNR scholarship where you can get 40-50% of your fees back in come in the top 20% of your batch and various other government schemes if you are eligible for it ."
    },
    {
      "id": "lecxjr5",
      "body": "Bro my budget is around 1.4l.. the dcet fees is 99k.. so what will be the additional fee that I have to pay during admission.."
    },
    {
      "id": "led6g8v",
      "body": "There’s a university fees or something of roughly 15k"
    },
    {
      "id": "lf6nc16",
      "body": " do you have any idea abt this year's kcet fee? It's 1,07,495 right as per released free sturcture, and 20k included in that amt right? Where's extra 13k or so coming from?"
    },
    {
      "id": "lf77421",
      "body": "You better confirm with the account department. \nAfaik you got to pay the fees at once during the start of the academic year. \nDuring the first you got to pay roughly 50k to KEA and remaining odd 70k to the college, from second year onwards it’s direct full amount to the college."
    },
    {
      "id": "lf7fyt8",
      "body": "I'm more confused now bruh\n\n\nI probably should go ask in person "
    }
  ]
}