{
  "id": "1e8rre7",
  "title": "Wierd question ",
  "content": "As the title suggests\nDoes EC campus allow long hair(I'm a guy).\nSometimes I put a manbun and sometimes I let it flow . And please the dress codes also\n\n help 😭",
  "metadata": {
    "author": "SmoothSeesaw6189",
    "url": "https://www.reddit.com/r/PESU/comments/1e8rre7/wierd_question/",
    "permalink": "/r/PESU/comments/1e8rre7/wierd_question/",
    "score": 6,
    "created_utc": 1721583403,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "le9eyxr",
      "body": "I know a guy that had long hair and no teacher said anything about it. But I don't think anyone can demand you to chop off your hair."
    },
    {
      "id": "le9h0vh",
      "body": "I have long hairs my self and except for mentor no one cares \nAt most they may ask you tie it up"
    },
    {
      "id": "le9hspu",
      "body": "Mentors?"
    },
    {
      "id": "le9kxer",
      "body": "Bhai school thodi hai, chalta hai ye sab"
    },
    {
      "id": "le9mynz",
      "body": "tbh PES feels like school but without the dress/hair codes"
    },
    {
      "id": "le9pcr1",
      "body": "You will be assigned a personal mentor, you will have to meet with them like once a week and fill out a form about how you are currently doing and you can ask them for guidance or some shit like that"
    },
    {
      "id": "lea0u09",
      "body": "I got long curls as a guy. No teacher except one asked \"are they natural?\" And that's it nobody cares ."
    },
    {
      "id": "lecolub",
      "body": "Damn.. Can u explain in detail?"
    },
    {
      "id": "lecomf7",
      "body": "babysitting type shit 😭"
    },
    {
      "id": "lecoqc1",
      "body": "Damn"
    },
    {
      "id": "lecor5m",
      "body": "Cool cool"
    },
    {
      "id": "led5msw",
      "body": "What they are supposed to do i guide you and answer your questions and be the first person you talk to about any college issues idk about other mentors but the one i got, i just go and fill a form like every week that’s it and tbh i prefer this that him asking questions about how my college life is going on or something"
    },
    {
      "id": "ledm3j8",
      "body": "I was in ECE and my trachers used to be pretty strict about long hair but after I went to third year nobody gave a shit anymore. I had a small bun, now my hair comes up to my shoulders and I wrote all my exams like that only"
    }
  ]
}