{
  "id": "1e95f90",
  "title": "Pes rr ece or bmsce ece",
  "content": "Should I take pes rr ece or bms ece . I will probably get both throught cet . ( If not I have pessat ece rr seat) . Disregarding fees , which college is straight up bette for ece. Ty any help is appreciated.",
  "metadata": {
    "author": "Konquorer",
    "url": "https://www.reddit.com/r/PESU/comments/1e95f90/pes_rr_ece_or_bmsce_ece/",
    "permalink": "/r/PESU/comments/1e95f90/pes_rr_ece_or_bmsce_ece/",
    "score": 4,
    "created_utc": 1721622198,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lec4f6i",
      "body": "Wouldnt have hesitated to recommend bmsce ece if they didnt increase intake of cse related branches so much\n\nI feel like bmsce ece will fall in the same dilemma which pes ece has that is there are so many students in cse core+ aiml that management doesnt care about ece \nEven the placements are bad for pes ece \n\nive seen the cutoffs predicting your rank is around 5k\nPes rr ece cutoff is similar to msrit ece cutoff so would recommend going for it instead \nAnd if you arent particularly interested in ece why not pes ec cse"
    },
    {
      "id": "lec84s7",
      "body": "But bmsce also increased ece seats I'm pretty sure. And even if not I want ece only not cs . But thank you for responding I will consider what you've said."
    },
    {
      "id": "lecfxb3",
      "body": "Bmsce ece shud be your choice"
    },
    {
      "id": "lecial2",
      "body": "Why"
    },
    {
      "id": "lecm10o",
      "body": "Yes bmsce increased ece seats after removing one branch ete or eie I forgot"
    },
    {
      "id": "lecnulz",
      "body": "Bmsce has nice fests and life is chill my senior told. As pesu is academically oriented it might be hard as you are taking electronics which is already a tough subject and requires hardwork and dedication"
    },
    {
      "id": "lecogeb",
      "body": "I'll make do bro . Ty"
    },
    {
      "id": "lefd1ct",
      "body": "I think pes has better syllabus, talked to a rvit proff once and he said vtu colleges have pretty outdated syllabus and pes folk say the syllabus is relatively up to date for ece.   \ntbh i don't think u will have any dramatic difference between the two once you graduate."
    },
    {
      "id": "lntvdul",
      "body": "Pes has better fests and more events"
    }
  ]
}