{
  "id": "1e97hkp",
  "title": "prof selection for BD ",
  "content": "https://preview.redd.it/0j14z5qwl0ed1.jpg?width=1280&format=pjpg&auto=webp&s=08c33979615cad8b599690436d672ca6203e5925\n\ncan anyone give advise on which professor teaches the subject well, anyone i should avoid in particular? ",
  "metadata": {
    "author": "a_soggy_french_fry",
    "url": "https://www.reddit.com/r/PESU/comments/1e97hkp/prof_selection_for_bd/",
    "permalink": "/r/PESU/comments/1e97hkp/prof_selection_for_bd/",
    "score": 8,
    "created_utc": 1721630148,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lecl03o",
      "body": "I've already commented about this in detail before but here's a TLDR (I'll link my old comment once I find it): Prafullata and Suresh are really good. \n\nPrafullata is a good prof who knows the subject really well. She can teach decently well and also specialises in Big Data and Cloud, so she is pretty knowledgeable in the domain. She was also the default head of CCBD after KVS left. Many CCBD events are still organised primarily by her. She's also really friendly and nice with students and stays in touch with them long after they graduate. She invited us to her PhD graduation ceremony last year too. She's also in touch with KVS and gets him to sometimes advise students or interact with them which is a big plus. \n\nSuresh is one of those profs who is although knows the in and out in the subject, unfortunately isn't that great at teaching in the classroom. He is definitely one of the most specialised and experienced profs when it comes to courses like databases and big data (the dude has years of work experience and teaching experience in the field, India and  abroad) and is truly one of the few profs at PES like this. You can practically ask him anything outside the book related to the subject and he will know it. Unfortunately, he cannot teach that well. He's okay in the classroom, however he's pretty nice too. A lot of students used to approach him post classes for better explanations, he seemed to be better at those than teaching in class. A few people did their capstone under him related to databases and other stuff, they said it was a great experience too.\n\nI do not know the rest so I can't comment about them."
    },
    {
      "id": "lecnmuy",
      "body": "Thank you for the help!"
    },
    {
      "id": "leda3v2",
      "body": "Prafullata then Suresh \nTry avoiding Shruthi, no class control and poor communication, at least in cloud computing"
    },
    {
      "id": "ledch9g",
      "body": "any advice on the others? we have 4 preferences to fill in"
    },
    {
      "id": "ledcvmg",
      "body": "thank you for the advice!"
    }
  ]
}