{
  "id": "1e9br38",
  "title": "pawrty kaha?",
  "content": "I get that PES is academically focused and strict. But like is there no fun element in PES for students apart from one yearly program that occurs? I heard theres no fresher party either :? ",
  "metadata": {
    "author": "Icy-Sprinkles682",
    "url": "https://www.reddit.com/r/PESU/comments/1e9br38/pawrty_kaha/",
    "permalink": "/r/PESU/comments/1e9br38/pawrty_kaha/",
    "score": 2,
    "created_utc": 1721647199,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "led7239",
      "body": "Infra makes u think its party place but it rlly aint boss"
    },
    {
      "id": "leda7ks",
      "body": "Join lpu ameity\nRozzz party he"
    },
    {
      "id": "ledavjr",
      "body": "Pawry karenge, jab events ya fest ho tab. \n\nUntil then grind grind grind"
    },
    {
      "id": "ledfep7",
      "body": "Freshers party? Lmao.\n\nAll incoming PESts' parents are sent an email in the first month or so about their children taking part in illegal activities and parties and to keep an eye on their children. It's a canon event. If someone has, they can paste the email here for you to read."
    },
    {
      "id": "ledj0uz",
      "body": "Dear Students and Parents,\n\n\n\nIt has come to our notice that a group of students claiming to be higher semester students are hosting a 'Freshers' Party', in private places. \n\n\n\nPlease note that all such activities are illegal and have no approval from the University.\n\n\n\nPlease do not be part of such activities which could put you in a wrong group and lead you to a situation of no return. Such activities are normally organised by a set of people trying to collect money from gullible students and in places which are unsafe and dangerous.\n\n\n\nWe have noticed such activities in the past and have reported the same to the concerned authorities, who have taken effective steps to stop them from happening, where our own students would land up as victims.\n\n\n\nThe Vice-Chancellor, Registrar and Dean, Student Affairs, PES University, have been informed about this activity. Parents are also informed, to inform their wards to stay away from such activities.\n\n\n\nStay informed, keep away from these nefarious activities and stay safe.\n\n\n\nRegards,\n\nPES University\n\n\n\n\nPadh le beta"
    },
    {
      "id": "ledpb9w",
      "body": "The only party PES approved would be somewhat like your 7th year birthday party; fanta, samosa with ketchup and some sparkles"
    },
    {
      "id": "ledv60t",
      "body": "They sold me fanta behind the the store"
    },
    {
      "id": "ledyksd",
      "body": "fanta-nyl for your fanta-sea"
    },
    {
      "id": "ledzv7h",
      "body": "huge L"
    },
    {
      "id": "lee03dm",
      "body": "wth?? what is the management trying to achieve with that-"
    },
    {
      "id": "lee07zy",
      "body": "BUT BUT theres just one or two events per year :("
    },
    {
      "id": "lee0auu",
      "body": "🤡🤡🤡"
    },
    {
      "id": "leecgug",
      "body": "This is so genius-ly funny im displaying this on my wall😭😭😭🏆"
    },
    {
      "id": "leedjde",
      "body": "wth are you sure theres no freshers party?"
    },
    {
      "id": "leedpii",
      "body": "but fr tho is there any unofficial freshers party or any unofficial parties at all"
    },
    {
      "id": "leee3w6",
      "body": "No one from the college is gonna give you freshers party not even unofficially so don't keep hopes"
    },
    {
      "id": "leeg2k9",
      "body": "yeah thought so"
    },
    {
      "id": "leejn3e",
      "body": "there there , just one"
    },
    {
      "id": "leeok8f",
      "body": "lmao like clockwork they send a mail saying “no freshers party, sit and study” to everyone in every year. It’s extremely funny"
    },
    {
      "id": "leewrfa",
      "body": "I went for unofficial ones and they were damn  fun"
    },
    {
      "id": "lef28nx",
      "body": "when was it and who hosted"
    },
    {
      "id": "lef3h8z",
      "body": "2019 Aug and Nov times ,a senior contacted got passed ready we were freshers then"
    },
    {
      "id": "lef4l1u",
      "body": "Scare your parents into thinking that their children are involved in illegal activities. \n\nBut yeah, that's the sad state of affairs here. As we said before, this is advanced schooling, not college."
    },
    {
      "id": "lef568t",
      "body": "Grateful for the honour ✨"
    },
    {
      "id": "lefh10y",
      "body": "lucky"
    },
    {
      "id": "lefo2lv",
      "body": "If there was, every freshman in PESU would be happy"
    },
    {
      "id": "left1vj",
      "body": "Funnily enough they had sent the exact same message to my parents back in 2022"
    },
    {
      "id": "lehtj0u",
      "body": "They used to ,strange that now seniors are also hesitating to throw for juniors"
    },
    {
      "id": "lenvw24",
      "body": "Nope, those are major events.."
    }
  ]
}