{
  "id": "1e9gtlk",
  "title": "Is hostel randomly alloted to you or do you have to choose it",
  "content": "I have submitted my orignal documents but I am not sure about the process of hostel booking for freshers pls tell me",
  "metadata": {
    "author": "Such_Monk_7468",
    "url": "https://www.reddit.com/r/PESU/comments/1e9gtlk/is_hostel_randomly_alloted_to_you_or_do_you_have/",
    "permalink": "/r/PESU/comments/1e9gtlk/is_hostel_randomly_alloted_to_you_or_do_you_have/",
    "score": 3,
    "created_utc": 1721661387,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "leedh5r",
      "body": "Bro lol you lost it, hostel applications start right after your first round counselling and it's hella competitive, it easier to get a cse seat than hostel, if you have any influential family background you might try now if not you lost"
    },
    {
      "id": "leefs4c",
      "body": "what no the last time i visted campus I filled the application form and got allotted in unit 2 but the warden wasn't showing all the rooms but my question is do we get to choose our rooms and number of roommates?"
    },
    {
      "id": "leefy6i",
      "body": "Unit 2? Are you talking about ec campus?"
    },
    {
      "id": "leeg85o",
      "body": "Even if you are at first there is temporary allotment so the warden gives you random rooms with random roommates, then after a few weeks you get to choose your roommates and rooms based off on who paid first"
    },
    {
      "id": "leekbr3",
      "body": "Is this the case with EC campus too?"
    },
    {
      "id": "leekp84",
      "body": "no rr"
    },
    {
      "id": "leekshn",
      "body": "oh alrr thankss"
    },
    {
      "id": "leeolf2",
      "body": "Ig so, this is in rr campus"
    },
    {
      "id": "lef4ccg",
      "body": "ec campus still has alot of empty rooms so if you are in ec campus you can choose your room. Thats what i did"
    }
  ]
}