{
  "id": "1eay0gf",
  "title": "Urgent help plsss",
  "content": "Bits Goa msc bio vs pes rr cs",
  "metadata": {
    "author": "Excellent-Pin-2764",
    "url": "https://www.reddit.com/r/PESU/comments/1eay0gf/urgent_help_plsss/",
    "permalink": "/r/PESU/comments/1eay0gf/urgent_help_plsss/",
    "score": 5,
    "created_utc": 1721816722,
    "flair": "Study Help :table:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "leoyk7v",
      "body": "PES rr CS"
    },
    {
      "id": "leoyr2y",
      "body": "Why?"
    },
    {
      "id": "lep03e7",
      "body": "PES University is a highly reputed institution known for its excellent placements and vibrant campus life. Pursuing Computer Science at PES significantly enhances one's resume and attracts top companies.\n\n The university offers numerous opportunities for students to improve their skills and knowledge through various clubs and hackathons. While BITS Pilani holds a slightly higher regard than its Goa campus, I believe the Bioinformatics course doesn't compare as favorably to Computer Science.\n\n Ultimately, placements, skills, and job opportunities are crucial for students after college, and PES RR campus excels in providing these with its strong Computer Science program. \n\nNO OFFENSE TO BITS goa ,  it's just the course that matters . Suppose if u get a chance u can pursue ur CS course in BITS goa . That would worth it"
    },
    {
      "id": "lep5df8",
      "body": "Lmao…pes management on Reddit"
    },
    {
      "id": "lep7j3b",
      "body": "I study in PES dude , I know it better .😉"
    },
    {
      "id": "lepd187",
      "body": "Unless this is the monthly troll post (yes we have multiple of these), here is my opinion on [branch vs college](https://www.reddit.com/r/PESU/comments/1dz5ydc/comment/lcdi0ra/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button). Its a long comment with multiple linked comments, please go through them. \n\nTLDR - pick the one that best suits what you want to pursue. Pick BITS if you only care about landing the highest-paying job out of undergrad. If you want to study what you are interested in and are passionate about CS, choose PES. The only right decision here is the one which helps you the most."
    },
    {
      "id": "lepe00u",
      "body": "if you can afford bits msc then definitely bits, get a decent cg and take up a good branch for bachelors"
    },
    {
      "id": "lepehux",
      "body": "Yes I wil be mostly taking bits…Ty so much for the advice"
    },
    {
      "id": "lepekrh",
      "body": "i will be mostly taking bits…Ty so much for the advice"
    },
    {
      "id": "lepep8f",
      "body": "just wait till the last iteration you may get a better branch  \nwhat was your bitsat score?"
    },
    {
      "id": "lepeuu0",
      "body": "236"
    },
    {
      "id": "lepewyd",
      "body": " I am hoping for hyd phy"
    },
    {
      "id": "lepfs2s",
      "body": "then you may even get phy at goa, very slight chance but it's possible. ATB"
    },
    {
      "id": "lepg3sx",
      "body": "Ty hope so…which clg are u joining?"
    },
    {
      "id": "lepgd0u",
      "body": "NITK"
    },
    {
      "id": "lepghps",
      "body": "ohh niceee…which branch?"
    },
    {
      "id": "lepgnlg",
      "body": "AI"
    },
    {
      "id": "lepgvam",
      "body": "Oooo…nice"
    },
    {
      "id": "lepirun",
      "body": "No problem, all the best and good luck!"
    },
    {
      "id": "lepj74b",
      "body": "And people say that *I* am on PESU's payroll wow"
    },
    {
      "id": "lepzezz",
      "body": "i had this exact same decision to make two years ago. i chose pes. it turns out i would've even gotten EEE at bits goa, but since i removed myself from the seat allotment i didn't get it.\n\ni beat myself over it at the time but now personally i'm honestly glad i chose pes. the competition is much easier and it's so easy to score good gpas without much effort at all. the syllabus is so tough at bits and the competition even more so, studying a week before exams will make you a topper at pes.\n\nif you take an msc you have another year of basically JEE and you compete among a smart group of people to choose a branch. i'd consider it worth it if you can get anything electronics or above, but below that i would say pes is 100% better\n\nobjectively speaking i think you will get somewhat similar but better opportunities if you pick bits, but for someone like me who is really lazy pes is definitely better. But if you're a competitive guy and are confident that you'll do well in the first year, you should probably take bits and hope for the best.\n\ni am definitely biased cause im in pes lmao, but i think this is a reasonable take on the comparison"
    },
    {
      "id": "leqheh3",
      "body": "Hmm…I think I am gonna take Msc bio considering that there is a 75 percent chance we can get electronics or above in goa campus"
    },
    {
      "id": "lercrkt",
      "body": "if u want cs come to pes only, getting cse from in the dual degree is quite hard, if ur ready to settle for mech and circuital branches go to bits.   \nAlso dual degree gets quite hectic too."
    },
    {
      "id": "lerdisj",
      "body": "but do be ready for other courses or its gonna suck for the duration of the course or longer.   \nConsidering u will be competing with people who are already at least the same \"level\" as you, the competion is gonna be quite hard for the dual degree."
    },
    {
      "id": "lerdrw4",
      "body": "come with real account pes."
    }
  ]
}