{
  "id": "1eazd2x",
  "title": "not writing backlog",
  "content": "i don’t think i am ready for my math backlog exam tomorrow so what happens if i don’t write it? will it show up on my marks card or transcript that i registered but didn’t write it? i think i would prefer writing it during 4th sem because i am facing some personal and family problems right and really don’t have the ability to prepare for it.",
  "metadata": {
    "author": "whathuhwhywhen",
    "url": "https://www.reddit.com/r/PESU/comments/1eazd2x/not_writing_backlog/",
    "permalink": "/r/PESU/comments/1eazd2x/not_writing_backlog/",
    "score": 1,
    "created_utc": 1721821417,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lep46t2",
      "body": "why do you wanna let 1k go in vain? you still have time till 12 tomorrow. just go through, as in, just glance all the cw questions, and make sure u practice the sureshot questions once. and no need to cover all the 4 units. but instead be thorough with 2 or 3 units. but if u wanna write the exam fully prepared, then just dont go. and coming back to your question, no it doesnt show on your marks card or transcript that you had registered and didnt write it. there will be a \"F\", unless and until you clear that exam."
    },
    {
      "id": "leqonz7",
      "body": "I heard that 3rd and 4th sem are harder it's better to complete the backlog now than stressing about it later right? Just get it over with. Probability is an easy concept and Fourier series and transforms have very similar try going through all the cw questions."
    },
    {
      "id": "les0rma",
      "body": "I wanted to know that do we need to be well versed with certain topics of 11th and 12th for first year? If so, which ones should I focus on? Assume that I'm not that strong with 11th, 12th syllabus. \n\nOr do they teach everything from basics?"
    },
    {
      "id": "letjci9",
      "body": "They honestly teach everything from scratch at least my professors did. don't worry about it too much."
    },
    {
      "id": "letjii9",
      "body": "Oh but don't be me and study consistently cause studying one day before the exam clearly didn't help me."
    },
    {
      "id": "levfbs3",
      "body": "Thanks for the advice!"
    }
  ]
}