{
  "id": "1eb439h",
  "title": "Is round 3 risky in kcet counselling?",
  "content": "Hey guys should i confirm a seat in round 2 or wait until round 3. Many people say its risky and all. Has anybody gone to round 3 can maybe enlighten or if your friends/relative have done so?",
  "metadata": {
    "author": "LilSkulll",
    "url": "https://www.reddit.com/r/PESU/comments/1eb439h/is_round_3_risky_in_kcet_counselling/",
    "permalink": "/r/PESU/comments/1eb439h/is_round_3_risky_in_kcet_counselling/",
    "score": 8,
    "created_utc": 1721834379,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "leqcnum",
      "body": "What branch and college are you waiting for? Depends on that. Also a backup college and branch should be there so that if you don't get first choice, you should get a proper second choice"
    },
    {
      "id": "leqcvek",
      "body": "Im trying rvitm any course as i couldnt get ece in rvce. I have written no other exams only kcet."
    },
    {
      "id": "leqe241",
      "body": "If the colleges above the college which u were allotted in round 2 are those which ur sure about, then it's not a problem at all cause in round 3 cutoffs differ kinda more. So make ur choices wisely,don't gamble,imo gng to round 3 is a must.U never know when u get lucky"
    },
    {
      "id": "leqekdk",
      "body": "im talking about kcet btw"
    },
    {
      "id": "leqeqjp",
      "body": "Yeah kcet only"
    },
    {
      "id": "leqhrim",
      "body": "Can u list your college options list?"
    },
    {
      "id": "leqj3rw",
      "body": "im tryna get rvitm bro like thats main focus"
    },
    {
      "id": "leqk73s",
      "body": "And rank is 149XX"
    },
    {
      "id": "leqn19q",
      "body": "If you wait for 3rd round you'll prolly get branches like eee or mech in rvitm."
    },
    {
      "id": "leqn876",
      "body": "I myself waited till third round for rvce cse but I couldn't get it and instead got pesu cse"
    },
    {
      "id": "ler283a",
      "body": "This guy knows what he's talking about. As a round 3 student I +1 this"
    },
    {
      "id": "leurl9h",
      "body": "rvitm is different bro\n\nthey are rv institution but have higher cutoffs for cse ise and ece + they have same placements as rvce"
    },
    {
      "id": "leuyvjw",
      "body": "I think you can wait for ece. I have doubts about the other two."
    },
    {
      "id": "lev555g",
      "body": "Wait for 3rd round by holding the 2nd round seat.\n\nYou will get better seat or get the seat that you already have in 2nd round."
    },
    {
      "id": "levdurd",
      "body": "Are you talking about kcet? I dont think so you can do that??"
    },
    {
      "id": "levdz53",
      "body": "yea and also bmsce added 1000 seats and many colleges increased their seats i might get ise too."
    },
    {
      "id": "leve1b5",
      "body": "Yea bro kcet, I did this very thing just last year."
    },
    {
      "id": "levpd0n",
      "body": "Prolly. Upto you"
    },
    {
      "id": "mu6k229",
      "body": "so if I'm not satisfied with my 3rd round college I can go with the 2nd one??"
    },
    {
      "id": "mu6p4rq",
      "body": "Yes\n\nIf you have chosen to enter the 3rd round by holding the 2nd round seat"
    },
    {
      "id": "mu6qbiv",
      "body": "ohh damn okay. thanks. \nWill there be any guidelines kinda thing given before the counselling starts?"
    },
    {
      "id": "mu6qx3b",
      "body": "Yea before every round they will give some guidelines, double check whatever I have said with those guidelines.\n\nMy counseling was almost 2 years ago."
    },
    {
      "id": "mu6s54x",
      "body": "oh okay. thank you so much"
    }
  ]
}