{
  "id": "1ec17gw",
  "title": "option priority ",
  "content": "so I have a rank of 1.8k in kcet and I prefer core cs\n\nI plan to enter the options as \nRV CS>PES CS>RV CYBER SEC(there are other specialisations too but this is the only one I'm likely to get)> PES AIML\n\nshould I have PES AIML higher than RV CY SEC?\nif I do not get any core cs branches I'm likely to get anyone of these two so I would appreciate some feedback on what would be better\n\nconsidering everything like the pes alumni network, the competition, scholarship, college life",
  "metadata": {
    "author": "Autistic_Snecc",
    "url": "https://www.reddit.com/r/PESU/comments/1ec17gw/option_priority/",
    "permalink": "/r/PESU/comments/1ec17gw/option_priority/",
    "score": 9,
    "created_utc": 1721929842,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lez5mbj",
      "body": "Choose rv as travel time will be a huge factor"
    },
    {
      "id": "lezbhf6",
      "body": "I got near 300 in kcet nd i m choosing rvce cs\nBut it takes me 1hr to travel on metro💀💀"
    },
    {
      "id": "lezczoi",
      "body": "thank you"
    },
    {
      "id": "lezd1rh",
      "body": "goddamm thats nice but yeah travelling for an hour is a pain"
    },
    {
      "id": "lezdwh7",
      "body": "Every specialization has 60 to 70% same syllabus as core CS in most collages, if your gonna have to choose between rv cyber security vs pes rr ces than pes is a better choice."
    },
    {
      "id": "lezhepk",
      "body": "thank you again"
    },
    {
      "id": "leznckn",
      "body": "what should I choose between rv and pes if travel time is not an issue(I'm getting AIML in rv acc to previous year cutoffs and CSE at pes)"
    },
    {
      "id": "leznojd",
      "body": "If it's cse at rr branch then go for it , core CS is still better than aiml specialization."
    },
    {
      "id": "lezoktj",
      "body": "alright, thanks!"
    },
    {
      "id": "lezrzup",
      "body": "Stay in hostel then"
    },
    {
      "id": "lezsk3h",
      "body": "Ya prolly for 3rd yr nd 4th yr ig"
    },
    {
      "id": "lf36fbd",
      "body": "choose rv for better placements and alumni network"
    }
  ]
}