{
  "id": "1ee038s",
  "title": "I'm worried if They'd not Announce Round 2 before Comedk seat cancellation period",
  "content": "Should I consider Manipal ECE as a backup too. In comedk I'm getting NIE Mysuru CI\n\nAlso why tf is there so much delay this year..\n\n",
  "metadata": {
    "author": "Miserable-Raise2771",
    "url": "https://www.reddit.com/r/PESU/comments/1ee038s/im_worried_if_theyd_not_announce_round_2_before/",
    "permalink": "/r/PESU/comments/1ee038s/im_worried_if_theyd_not_announce_round_2_before/",
    "score": 5,
    "created_utc": 1722144208,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lfapymu",
      "body": "if it's Manipal main campus keep it as your first priority. Manipal is only comparable to top comedk colleges. imo Manipal>NIE"
    },
    {
      "id": "lfaq3yk",
      "body": "Main campus but it's ece and I legit don't have any idea about ece and it's placements etc.."
    },
    {
      "id": "lfaqev1",
      "body": "ece isn't a bad branch dw. It's the branch considered to be the best after CS related branches.  \nIf you want to know about placements and all just visit r/Manipal_Academics"
    },
    {
      "id": "lfaqigy",
      "body": "Couldn't find about placements in ECE in that sub sadly, infact couldn't find it anywhere on internet."
    },
    {
      "id": "lfaqxmz",
      "body": "bruh just look for it properly. I myself searched and found 2 posts claiming the median is 9-10lpa"
    },
    {
      "id": "lfarzjv",
      "body": "9-10 lpa is impressive bro"
    },
    {
      "id": "lfat6hw",
      "body": "if u want max salary right out of the gate dont go for ece. Its much harder then cse and core jobs aint easy to get.  If u plan on going for it jobs either way go for cse.   \nIf u stick to core ece jobs, it pays much better in long run, but get ready to do masters and phd.   \nHonestly in the long rn, ece is much better then cse. Cs is getting saturated.   \nThe AI thing is like a gold rush, and in gold rush its best to be the one selling the shovels, hence electronics is better in the long run imo."
    }
  ]
}