{
  "id": "1efn3b9",
  "title": "Need advice ",
  "content": "So I have a rank of 17** and category 1 reservation which gets me PES CS in the first round and I might get RV ISE in the second extended round. From what I've seen placements for these two are very similar and PES definitely has the better campus. So what do I choose?",
  "metadata": {
    "author": "xerxes_8888",
    "url": "https://www.reddit.com/r/PESU/comments/1efn3b9/need_advice/",
    "permalink": "/r/PESU/comments/1efn3b9/need_advice/",
    "score": 1,
    "created_utc": 1722323629,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lfm78vi",
      "body": "Rv ise"
    },
    {
      "id": "lfm7cls",
      "body": "Could you tell me why?"
    },
    {
      "id": "lfmcool",
      "body": "Smaller batch size, lesser competition"
    },
    {
      "id": "lfmmltg",
      "body": "Similar situation buddy,\nWhat'd you decide?"
    },
    {
      "id": "lfmn515",
      "body": "I'm really into sports so the facilities at PES are really tipping the scale but I'm also having to decide between friends so...."
    },
    {
      "id": "lfnm4sm",
      "body": "Friends should not affect your decision. You should choose what benefits your career the most. If you are into sports, your friends cannot play the game for you lol."
    },
    {
      "id": "lfnq5xg",
      "body": "Yeah I agree. But when there's no clear winner (atleast to me) these factors should also be considered. RV does have a smaller batch size but PES is still on even footing with it in terms of placements (for the options that are available to me) and I definitely prefer the PES campus which again isn't a factor for most people but it is to me. Now I don't know if others opinions really help but after fucking everything up, I atleast wanna make the right decision here."
    },
    {
      "id": "lfnq91q",
      "body": "Also I really appreciate the input"
    },
    {
      "id": "lfnqn1p",
      "body": "Unrelated but someone on insta called me a PESticide. "
    }
  ]
}