{
  "id": "1egqwvl",
  "title": "College club(s)",
  "content": "Okay this might be long but sincerely, fuck the fashion club Meraki. And i know a bunch of university clubs with the most incompetent heads who are completely out of touch with the rest of the team. But Meraki in specific has the most problematic people with the worst ego because why?? They're ✨️models✨️ and hence better than everyone else.\n\n These people look good on stage because of the outfits and makeup the design team comes up with. Forget about giving the designers credit, these models take everything for granted, are extremely hard to work with and pass offensive comments about the outfits too(stuff like ew that looks gay, ew it looks cheap etc etc). Just straight bullshit comments that make them think they're cool but in reality makes them sound like a pissy 13 year old.\n I'm not generalizing since there are a couple of decent people but most of them are so unpleasant it pisses me off. And the funniest part? The models having some weird heirarchy going on so if you're not part of the \"cool\" aka rude gang, you'll be alienated and not involved in most of the events. \n\nSo why am i dropping this info here? Hopefully to tell enough freshers to NOT audition for the club either as a model or a designer or a makeup artist cuz the toxicity is not worth it. And also to take out a whole year's worth of frustration. We put in so much work, stay in campus long after classes are done just to finish off the whole team's clothes just to be disrespected  and ofc the club head didn't do jack shit about the whole deal. ",
  "metadata": {
    "author": "Whyisyourmom",
    "url": "https://www.reddit.com/r/PESU/comments/1egqwvl/college_clubs/",
    "permalink": "/r/PESU/comments/1egqwvl/college_clubs/",
    "score": 83,
    "created_utc": 1722441803,
    "flair": "Club Post :upvote:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lfu0c14",
      "body": "The fucking audacity wowwwza"
    },
    {
      "id": "lfu3o2n",
      "body": "Honestly a lot of clubs are like this. Lot of politics and partiality. The club heads are also often biased towards certain members."
    },
    {
      "id": "lfu50z0",
      "body": "What a shitshow. It's baffling that club heads would carry this much head weight. It's well known that every club has its own power play and politics but this is just disgusting, if you want to be a leader atleast learn to treat your club members with the respect they deserve."
    },
    {
      "id": "lfu5c3u",
      "body": "is this how it feels to be in middle school again? damn what a bunch of immature fucks"
    },
    {
      "id": "lfu7y8s",
      "body": "Club heads and models living upto PESticide level of toxicity godamn"
    },
    {
      "id": "lfv80hj",
      "body": "Tbh clubheads are only there to put the title on their resume. And those kinda people are annoying."
    },
    {
      "id": "lfw6b50",
      "body": "I say start your own club as a fuck you babe, I'll join you < 333"
    },
    {
      "id": "lfxcn50",
      "body": "Ahaha that would be fun, what do we call it?"
    },
    {
      "id": "lfxillu",
      "body": "Terrymaaki"
    },
    {
      "id": "lfxo65o",
      "body": "Instead of designer clothes, we make designer roasts💥😎"
    },
    {
      "id": "lfxrcle",
      "body": "is that a house md reference?😭"
    },
    {
      "id": "lfxus9d",
      "body": "XD thats hilarious!"
    },
    {
      "id": "lfy4qv5",
      "body": "This seems straight out of a gossip girl episode lmao, what a dumpster fire of a club."
    },
    {
      "id": "lfzdnv1",
      "body": "should be fun"
    }
  ]
}