{
  "id": "1ehank7",
  "title": "How to cope",
  "content": "Pessat has now been removed, my backup for drop next yr. Not even eligible for Kcet. What should be req Jee percentile for Pes RR and EC cs next yr? Got 220 in Bitsat, fk myself. Comedk 6k rank. Jee adv not qualified. All my hopes of going to Tier 1 now are dead. Still haven't surrendered PES seat so should I just join PES? Partial drop seems tough. Full drop is risky since idk what Jee percentile would be required for Pes. ",
  "metadata": {
    "author": "DistributionDizzy297",
    "url": "https://www.reddit.com/r/PESU/comments/1ehank7/how_to_cope/",
    "permalink": "/r/PESU/comments/1ehank7/how_to_cope/",
    "score": 25,
    "created_utc": 1722497355,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lfxyboz",
      "body": "Bhai just join pes, next year is gonna be a bloodbath, half of my friends are taking a drop. Grind in college and start coding. PCM is not gonna get u a job, coding will. And PES is a  good college"
    },
    {
      "id": "lfy26f4",
      "body": "Bro dont u have confidence that u will get IIT? if not, just join PES. maximum u can do is partial(very diffficult).  If you have not yet started full drop its too late btw. So dont think of starting now. the race is halfway through already."
    },
    {
      "id": "lfy2n85",
      "body": "Where are you getting that information from? It is not officially on their website either. Looks like PESSAT/Mains and KCET will be accepted."
    },
    {
      "id": "lfy5q1m",
      "body": "If someone gets Bangalore top colleges… just grind hard and u will be ok. Just keep grinding OP. Don’t let go of the seat. JEE and NEET in India are bloodbaths. Will be more so in the coming years. \n\nSure it’s no IIT… but do ur best and u can get Tier 1 opportunities."
    },
    {
      "id": "lfy67jj",
      "body": "I think cutoff will be 96%ile ish for cs in atleast ec\nAs 96%ile-98%ile kids might prefer pes because of location and placements \nJosaa is progressively getting worse every year"
    },
    {
      "id": "lfy95nf",
      "body": "I've joined pes this year through jee mains in rr campus cse, my percentile was 98.5"
    },
    {
      "id": "lfy9ghx",
      "body": "whats the fees you pay. cause i had 98.7 but i am going thru pessat"
    },
    {
      "id": "lfy9ijp",
      "body": "Join PES."
    },
    {
      "id": "lfy9jq4",
      "body": "Same as pessat but I'm taking seat through kcet once counseling starts"
    },
    {
      "id": "lfybh5p",
      "body": "Don't surrender your seat join pes"
    },
    {
      "id": "lfyka9u",
      "body": "Ohk, what was ur pessat rank btw? "
    },
    {
      "id": "lfykiua",
      "body": "Ohk thnx, and pes RR might be 98+ only?"
    },
    {
      "id": "lfyl3l3",
      "body": "981"
    },
    {
      "id": "lfym614",
      "body": "Maybe not that high but we cant predict either if it will be lower completely dependent on people if they choose mid/lower tier nits or go for pes"
    },
    {
      "id": "lfzxcnl",
      "body": "Looks like I'm late to this thread. Let me add my views:\n\nA partial drop will not work out at PES. I'm pretty sure you have already read the multiple opinions posted by others on how academically rigorous PES is, and there isn't much time left beyond standard deliverables for courses. If you are adamant on getting into IIT/NIT/BITS, you should go for a complete drop. Most people who opt for a partial drop at PES end up screwing over both their GPA and their tests, and since they don't have too many options, they only end up with something slightly better than PES, or worst case, they end up with a GPA that cannot be redeemed.\n\nBut PES isn't that bad, provided you put in the effort. PES has great placements and a strong academic focus with a good and updated curriculum. It also has a great alumni network that is working at great companies including FAANG, or are studying at some of the world's top universities ranging from CMU, UCLA, Stanford, NYU and even Ivies like UPenn. It has a decent reputation in Bangalore and India, and having worked 2 years in the industry, I can vouch for and say that PES grads are seen as one of the most skilled engineers in any company owing to the syllabus and the demographic of students here.\n\nTo summarise, yes PES is definitely no IIT/NIT/BITS. But is IIT the end of the world? Nah. People make it to great companies and unis from PES every single year. There are opportunities to work on yourself provided you put in the hard work. A T1 college will simply determine your starting position in your career, but with hard work, you can cover the gap. Beyond the starting point, its all on you.\n\nI added [this](https://www.reddit.com/r/Btechtards/comments/1dphj65/comment/lah9ux3/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button) comment on r/BTechards a few weeks ago to talk about my story in undergrad. I'll also attach a few other comments I wrote about IITs/T1 colleges for reference.\n\n1. [https://www.reddit.com/r/PESU/comments/1e24i2n/comment/lcyrr22/](https://www.reddit.com/r/PESU/comments/1e24i2n/comment/lcyrr22/)\n2. [https://www.reddit.com/r/PESU/comments/1dumryi/comment/lbjh7kl/](https://www.reddit.com/r/PESU/comments/1dumryi/comment/lbjh7kl/)\n3. [https://www.reddit.com/r/PESU/comments/1dxg3m8/comment/lc66wwy/](https://www.reddit.com/r/PESU/comments/1dxg3m8/comment/lc66wwy/)\n\nHope this helps. Whatever you decide to do, good luck!"
    },
    {
      "id": "lg0ohhy",
      "body": "People are downvoting but it's facts"
    },
    {
      "id": "lg5b4no",
      "body": "Just join PES bro, study well.  getting in some top IIT or NIT is prolly harder then cracking an amazing job from PES."
    },
    {
      "id": "lirnwdz",
      "body": "great. how much u got in comedk and bitsat caz there were my target?"
    }
  ]
}