{
  "id": "1ei00zx",
  "title": "No college until September ",
  "content": "Enjoy one more month of vacation ",
  "metadata": {
    "author": "Brilliant_Mangi",
    "url": "https://i.redd.it/zl6ykj9x66gd1.jpeg",
    "permalink": "/r/PESU/comments/1ei00zx/no_college_until_september/",
    "score": 59,
    "created_utc": 1722569303,
    "flair": "ANNOUNCEMENT :snoo:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lg34kiz",
      "body": "Yay yay yay yay yay yay yay yay .everybody can suck my dick "
    },
    {
      "id": "lg35c3l",
      "body": "I will kms 🥹"
    },
    {
      "id": "lg35u0b",
      "body": "Oh hell naw!"
    },
    {
      "id": "lg38zcz",
      "body": "This is for kcet students... I am sure the classes will commence for peseta students"
    },
    {
      "id": "lg396s8",
      "body": "You mean October?"
    },
    {
      "id": "lg39fc6",
      "body": "Say goodbye to one month of summer vacation lmao"
    },
    {
      "id": "lg3a3av",
      "body": "No if first round is not done then pessat students will also have to wait"
    },
    {
      "id": "lg3a4mn",
      "body": "Hi pride of pesu"
    },
    {
      "id": "lg3a8p9",
      "body": "Brother I am your senior, I know what they had done last year.."
    },
    {
      "id": "lg3aqyf",
      "body": "Brother we spoke to the faculty they told us that they are going to start at once for everybody if kea delays\nWe wait "
    },
    {
      "id": "lg3cy90",
      "body": "Wow, kids get more time to enjoy now, at the cost of losing holidays later xD. \n\nEnjoy kids"
    },
    {
      "id": "lg3dmmf",
      "body": "PES doesn't care about CET. They've started without CET kids in the past. It can definitely happen again."
    },
    {
      "id": "lg3dotn",
      "body": "Hello"
    },
    {
      "id": "lg3e5yo",
      "body": "But if first round results are not released then how is first round over. Pesu are waiting for it to finish right"
    },
    {
      "id": "lg3egwv",
      "body": "PES *usually* waits for the first round to end, but in the past they've also gone ahead and started classes for PESSAT kids without CET's round 1 because the latter was extremely delayed. So yes it *can* happen if PES wants it to happen because they've done so in the past. Whether they do the same this year is up to them."
    },
    {
      "id": "lg3eo2p",
      "body": "Is it getting extremely delayed this time"
    },
    {
      "id": "lg3etpa",
      "body": "Probably has not reached \"extremely\" delayed yet, given that they can still start the semester in the third week of August if they wanted to (based on the article). But anything beyond September first week is extremely delayed."
    },
    {
      "id": "lg3f2vg",
      "body": "So you also think it might get started in September but possibility to start in August also is what you are trying to say"
    },
    {
      "id": "lg3fak5",
      "body": "Yes. Although what I think is irrelevant here, it's up to PES and KEA."
    },
    {
      "id": "lg3gd52",
      "body": "Bro what 😭 that's unfair as fuck no? Ud think there are rules abt this stuff that they'd follow."
    },
    {
      "id": "lg3genq",
      "body": "Hi can I dm u"
    },
    {
      "id": "lg3ho31",
      "body": "where are the moderators"
    },
    {
      "id": "lg3r5ik",
      "body": "Who is that \"faculty\" lmao... faculty have no clue what the management is upto.   \nIf thats the case then enjoy your vacay"
    },
    {
      "id": "lg3s6g9",
      "body": "Corona batch having at college started in January:"
    },
    {
      "id": "lg3smuo",
      "body": "Sure"
    },
    {
      "id": "lg3z55h",
      "body": "I rallied most of this subreddit to downvote me lol . Keep going"
    },
    {
      "id": "lg3zpb1",
      "body": "that was 2 years ago , last year they waited out till first round of cet counceling which may happen in september this year ig"
    },
    {
      "id": "lg41y0n",
      "body": "Yep, but it doesn't remove the possibility of them starting without CET if needed."
    },
    {
      "id": "lg4aacg",
      "body": "September mid i suppose"
    },
    {
      "id": "lg5voay",
      "body": "They manage to bridge the two, after a sem or two"
    },
    {
      "id": "lg6pa4t",
      "body": "Not related but rowlet is probably my favorite starter"
    },
    {
      "id": "lg94k5t",
      "body": "Yes yes for sure, they'd done the same for our batch"
    },
    {
      "id": "lg9fz0v",
      "body": "You kids dont know how PES functions lol"
    },
    {
      "id": "lgaxw76",
      "body": "What’s the duration of summer break?"
    },
    {
      "id": "lgb4un0",
      "body": "Usually 2.5 months if there are no delays. Check FAQs for details."
    }
  ]
}