{
  "id": "1eib1n6",
  "title": "when will they realise the results for the backlogs ??",
  "content": "and also when does the college start for 3rd sem [b.tech](http://b.tech) students ",
  "metadata": {
    "author": "doc_cupcakes",
    "url": "https://www.reddit.com/r/PESU/comments/1eib1n6/when_will_they_realise_the_results_for_the/",
    "permalink": "/r/PESU/comments/1eib1n6/when_will_they_realise_the_results_for_the/",
    "score": 3,
    "created_utc": 1722607861,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lg5b8k4",
      "body": "Realise?"
    },
    {
      "id": "lg5bflb",
      "body": "release\\*\\*\\* sorry"
    },
    {
      "id": "lg5zo5o",
      "body": "Also what happens if someone fails backlog?"
    },
    {
      "id": "lg60jzm",
      "body": "i have heard tht for 1st year if u have credit score below 22 they would make u have a year back but most of my friends have gotten sections already for next sem , i guess we just take the exam again and then clear it bit i have heard they will do a year back from 2nd year onwards"
    },
    {
      "id": "lg613ck",
      "body": "Hopefully I pass this time, and fuck CD"
    },
    {
      "id": "lg63721",
      "body": "i never expected EEE to be soo hard bruh like wtf its a backlog paper yaar"
    },
    {
      "id": "lg63fe5",
      "body": "Sometimes I think college is failing us on purpose just to mint out the backlog registration fees!"
    },
    {
      "id": "lg63u6z",
      "body": "its like 250 per credit no college takes 250 per credit dude do EC students get placed also cause i came to pes for placements"
    },
    {
      "id": "lg641w6",
      "body": "Yeah we've been scammed by the hype this college makes, I would have been way better off in BMS"
    },
    {
      "id": "lg6b39f",
      "body": "yeah bms is just if u want fun they aint getting placed esp if u are from ec batch"
    },
    {
      "id": "lg7fnm2",
      "body": "Pretty sure this takes affect from first year itself tho. \n\nIf your friends allready got sections for next sem which means their total backlogs is below 22 credits right?"
    },
    {
      "id": "lg7g0e0",
      "body": "But I would have gotten CS and CS in BMS in terms of placements is more or less the same."
    },
    {
      "id": "lg8qkt0",
      "body": "i think it is 24 pending credits , but a lot of my friends are failing some of their backlog exams for sure so yeah if they fail it will take them to 24 but they have already got their assigned classes"
    },
    {
      "id": "lg9nt63",
      "body": "isnt the total credits 22"
    },
    {
      "id": "lgg9et6",
      "body": "pending credits is 24 total credits is 22"
    }
  ]
}