{
  "id": "1eidefn",
  "title": "Bootstrap",
  "content": "what exactly is it? 😭 pls explainn",
  "metadata": {
    "author": "Such_Monk_7468",
    "url": "https://www.reddit.com/r/PESU/comments/1eidefn/bootstrap/",
    "permalink": "/r/PESU/comments/1eidefn/bootstrap/",
    "score": 3,
    "created_utc": 1722613559,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lg5qxu2",
      "body": "Like it's a third party comprehensive stylesheet, has loads of features that make styling your webpage whole lot easier, compared to when u manually styled it urself.\n\n\nOh and it's free :D"
    },
    {
      "id": "lg5rlkq",
      "body": "Tailwind CSS>>. \n\nIt uses utility classes that are independent of components. This allows for more flexibility and unique layouts,"
    },
    {
      "id": "lg5rt2i",
      "body": "This isn't the boostrap OP is talking about unless you meant /s"
    },
    {
      "id": "lg5sitk",
      "body": "Bootstrap is a 5 day program where you guys are divided into 5 groups. These groups are usually named red, blue, etc. \n\nEach group has one theme per day. The themes are mechanical, design thinking, community service etc. \n\nDuring design thinking, you have a hackathon style event  \nDuring mechanical, you get a presentation about the latest advancements (boring shit) and then move on to the interesting stuff (The Aero design club, Avions; the go kart club vegavath) etc. \n\nYou also have electrical, electronics etc. \n\nOn the community service day, you usually go to a school to paint their walls or some other sort of community service like that. \n\nIt's a really fun thing that takes place during the first week of your first year. It gives a glimpse of all the departments and clubs in the university"
    },
    {
      "id": "lg5t8em",
      "body": "Free labor for pes"
    },
    {
      "id": "lg5y4rj",
      "body": "Adding to this: bootstrap is essentially meant for networking and meeting your peers for the first time. You get to meet your batchmates and seniors as well, break the ice, make friends etc. The activities are simply to help you bond over some event. \n\nWhile bootstrap is optional, it's highly recommended so you can go around campus, get a feel of college life and make new friends."
    },
    {
      "id": "lg69twy",
      "body": "Oh I thought he was asking about that bootstrap\nKill me 🤡"
    },
    {
      "id": "lg6a2k8",
      "body": "Does this happen at beginning of every year, cuz kcet students might miss it if so"
    },
    {
      "id": "lg6ekas",
      "body": "Yup it does, and usually a good portion of CET students end up missing it."
    },
    {
      "id": "lg6fdg0",
      "body": "No love for kcet guys fr😞"
    },
    {
      "id": "lg984mr",
      "body": "Oh damn maybe I'll try using it one day"
    },
    {
      "id": "lgbhbye",
      "body": "okayy tyy"
    }
  ]
}