{
  "id": "1eil9ah",
  "title": "Need advice",
  "content": "Hi im a first year now second year\nAIML student\nI have 6 backlogs\nAnd I feel like it’s not working for me\nShould I quit Pes?\nOr is there a possibility where I can give an accademic comeback \nI’m a management student ( I pay 11 L per year and I feel like I’m wasting my parents money )\n",
  "metadata": {
    "author": "Own_Ambition_807",
    "url": "https://www.reddit.com/r/PESU/comments/1eil9ah/need_advice/",
    "permalink": "/r/PESU/comments/1eil9ah/need_advice/",
    "score": 17,
    "created_utc": 1722632743,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lg7d514",
      "body": "Well if you have no interest in the course it's difficult for an academic come back with respect to any field of study honestly.\n\nNow if you aren't interested then you must know wt interests you and if it's compelling enough drop this to pursue something you can strive for.\n\n\nNow if sticking to this course is your only option the only thing you can do is just put your head down and grind it out but first find wt issues you are facing which caused you to end up with so many backlogs and then work on those."
    },
    {
      "id": "lg8sia4",
      "body": "you feel💀?"
    },
    {
      "id": "lg8z3mr",
      "body": "I think your goals are not set correctly. If your goals are not set properly, and you aren't putting in effort towards your goal, a lot of time and money will go wasted. Think correctly and don't float from career to career without setting goals. \n\nIf your health is good, then work towards your career goal. The career goal should be such that at the end of it, you should be able to generate wealth so you can become independent and take up further responsibilities.\n\nComing to your question, having 6 backlogs isn't good. But clearing them is achievable if you put your mind to it. Make sure you have no more backlogs in the coming years. Immerse yourself into study. Take help from parents, teachers, mentors and fellow students. Maintain relationship goal by showing gratitude to all the people who helped you achieve your goals."
    },
    {
      "id": "lg92uvy",
      "body": "If you can't help them don't hate"
    },
    {
      "id": "lg9empf",
      "body": "Why are some of you so unnecessarily mean? From your post history it's evident that you haven't even started college yet so shut the fuck up."
    },
    {
      "id": "lg9kdi6",
      "body": "Dude isn't aware of how stressful and rigorous exams can get at PES and is pulling others down. What a clown."
    },
    {
      "id": "lg9phg9",
      "body": " Dude isn't even going to PES, he just wants to be an edgelord"
    },
    {
      "id": "lga1a6i",
      "body": "Honestly, it's completely upto you. It's not too late to quit, but you can definitely clear all your backs and get a decent cgpa by sem 6 if you grind properly before the exams. I am in ECE and had 9 backs before sem 3 and 14 overall and I was able to clear almost all of them by sem 8. AIML subjects will be way easier dw. This is not a bad time to quit, but you have to consider your other options as well. If you have a better and more chill college ready, you should probably go for it. Most other colleges are way less stressful than PES and usually more chill. It's better to just cut your losses with the 11 lakh than spend like 45 lakh and be miserable for 4 years. But if this is your only option, you can definitely make it work, though your cgpa will be a bit on the lower side. College shouldn't feel like a chore and if you have better options than PES I'd 100% recommend it"
    }
  ]
}