{
  "id": "1eiyebm",
  "title": "Is Cse in EC campus is good or EC branch in BMSCE",
  "content": "I'm getting an EC branch in BMS through CET, and also getting  Cs branch in PES electronic city I'm baffled. Can you guys help me with this please.",
  "metadata": {
    "author": "ObjectiveAd2346",
    "url": "https://www.reddit.com/r/PESU/comments/1eiyebm/is_cse_in_ec_campus_is_good_or_ec_branch_in_bmsce/",
    "permalink": "/r/PESU/comments/1eiyebm/is_cse_in_ec_campus_is_good_or_ec_branch_in_bmsce/",
    "score": 5,
    "created_utc": 1722674023,
    "flair": "PESSAT/Admission",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lg9uhx1",
      "body": "If your truly intrested or passionate in EC go for it , if your main focus is on job opportunity or placements go for PES cs"
    },
    {
      "id": "lg9utb4",
      "body": "Tbh I have no idea about any branch since i was a neet aspirant \nnow idk what branch has what in specific so what I care more about is placements \nbut dont you think ring road campus is more prioritised when it comes to placements"
    },
    {
      "id": "lg9v4xc",
      "body": "1) if you care more about placements go for PES cs \n2 ) no rr and EC campus have join placements, contrary to what is believed online there is no kinda of partiality towards placements of 2 campus folks , it's just that many ( not all ) ec folks score lower on avg than rr and there are more students in rr than ec hence why the placement stats look like more rr folks are hired."
    },
    {
      "id": "lg9voy8",
      "body": "If ec campus is so good, why is the cutoff so bad and its easy to get into cs branch?"
    },
    {
      "id": "lg9w24g",
      "body": "Cutoff is bad?? What you smoking bro ,  sure the cutoffs may not be on the level rvce or msrit or bms or rr branch but aside from those it's a higher cutoff than every other collage. Another reason is that comparatively EC campus is newer than the rr one so  haven't accumulated as much prestige as the rr one . In the end of your degree it's doesn't mention anything about which campus you were bro, it just says PES UNIVERSITY."
    },
    {
      "id": "lg9wbgj",
      "body": "Well colleges like SIT and BVB have a better cutoff?"
    },
    {
      "id": "lg9wpoh",
      "body": "And both those are not in Bangalore are they bro?? I don't know much about bvb but if I had to choose between SIT or pes ec cse I would still choose pes."
    },
    {
      "id": "lg9wwlp",
      "body": "Alright thanks for your time man!"
    },
    {
      "id": "lg9x8jw",
      "body": "Bro cutoffs are not everything remember, also if I remember bms seems to have increased their seat intake for 2024 by 2x right? I feel if you take core branches alone have more than 2k students , don't know how it'll affect placements and all."
    },
    {
      "id": "lga058z",
      "body": "All your questions about differences between campuses and why RR is preferred have been answered in the FAQs: https://bit.ly/pesu-faq"
    },
    {
      "id": "lgab3lq",
      "body": "The cutoffs are low due to the fact that pes e city isn't the main campus and there are around 288 cse seats through kcet so inevitably cutoffs will be lower than other colleges which have lesser cse seats available through kcet . Pes e city is a decent option if you aren't getting cs in bms msr rv or pes rr"
    },
    {
      "id": "lgactj3",
      "body": "Also idk this might be a lame question, for a guy coming from biology, is it hard for him to maintain a 8 cgpa and get good placement? (I hate maths)"
    },
    {
      "id": "lgad352",
      "body": "If you work hard you can bro, you just gotta be consistent with your studies thats all."
    }
  ]
}