{
  "id": "1ej5kvl",
  "title": "Can someone explain what CIE is",
  "content": "And is it mandatory?",
  "metadata": {
    "author": "friedchutney",
    "url": "https://www.reddit.com/r/PESU/comments/1ej5kvl/can_someone_explain_what_cie_is/",
    "permalink": "/r/PESU/comments/1ej5kvl/can_someone_explain_what_cie_is/",
    "score": 8,
    "created_utc": 1722697767,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lgb7l16",
      "body": "Is it mandatory in sem 5"
    },
    {
      "id": "lgb8qmw",
      "body": "Is there any benefit to taking it in sem 3?"
    },
    {
      "id": "lgbd0md",
      "body": "Nope"
    },
    {
      "id": "lgbjg2m",
      "body": "It is somewhere you can spend some leisure time in an Air Conditioned classroom and then flood the WhatsApp groups for surveys and at the end you realise that you got an A grade inspite of doing everything"
    },
    {
      "id": "lgbmkp3",
      "body": "Benefit depends on you"
    },
    {
      "id": "lgbpu1y",
      "body": "And the worst would be when you have single handedly carried your team and still getting just A grade"
    },
    {
      "id": "lgddu8d",
      "body": "It is Continuous Internal Evaluation.\n\nEx-PES here😂"
    },
    {
      "id": "lge3wf5",
      "body": "CIE stands for Centre of Innovation and Entrepreneurship. Afaik it was optional in 2nd and 3rd year but going forward it is mandatory in 2nd year. 5th and 6th sem are already 24 credits so idk what’s the plan there"
    },
    {
      "id": "lgedxfw",
      "body": "Thank you for being the only person here to actually answer the question."
    },
    {
      "id": "lgeja7e",
      "body": "Its mandatory?? Also its not their for rr peeps right"
    },
    {
      "id": "lgek2qq",
      "body": "Afaik it’s mandatory in ec campus and it’s rr campus who were pushing for this so I’m assuming it’s mandatory there too"
    },
    {
      "id": "lgem3nw",
      "body": "The timetable of rrc doesn't have it, but how are they planning to fill in so many students inside one cie lab"
    },
    {
      "id": "lgese7s",
      "body": "I love this definition lol"
    },
    {
      "id": "lggld1x",
      "body": "CIE had 2 phases in our batch. 1 and 2 and I think they were optional in odd semesters (3rd and 5th). From outside perspective (someone who didn't opt for them, but had several friends take it), it's free 2 credits kinda sorta. You need to work hard for the esa, but it will be pretty chill throughout the semester. The esas are not standard written cbt, but a pitch for your product kind of a deal. Do that well and you ace it. (Also, I say free 2 credits because even if you mess it up, you are getting a B minimum as long as you didn't just wake up and show up for the esa without any prep)."
    },
    {
      "id": "lgh6rnv",
      "body": "Thank you for the reply! \n\n3rd semester subjects seem difficult so I'm not sure if I'll be able to manage this CIE thing too. At the same time I also want to improve my gpa, even if it's by a little. Is it really worth it?"
    },
    {
      "id": "lghdeow",
      "body": "I struggled in some subjects in my 3rd semester as well. However, I would recommend going for it if you have any entrepreneurial aspirations after college. Not for the course itself, but the nature of the course should ideally allow you meet more like minded people within the college.The thing is that some 3rd sem subjects are really important ( data structures). If you are in the gear for studying this semester, then I don't think you will face any issues with managing CIE. The last week might get a little bit hectic, but it would be worth it if you push through. Point being that it should not ideally hinder you if you are even a bit serious regarding college. \n\nAnother thing to note is that since you get 2 credits during the semester itself, you will have less pressure for attending summer courses and more time to go home (if you are coming from anywhere outside Bengaluru) or do summer internships :p\n\nAlso, free gpa."
    },
    {
      "id": "lglyv2d",
      "body": "And fair enough also"
    }
  ]
}