{
  "id": "1ejn618",
  "title": "I NEED HELP",
  "content": "okay so today is last date for option entry, i have a rank of 157x in kcet, rn my option entry list is \n1)rvce cs\n2)rvce is\n3)pes cs\n4)bms cs\n5)mrit cs\n6)...\nIm confident about the first 3 options but idrk wether to prioritise bms or msrit after the seat increase in bms, my father is kinda forcing me to keep bms over msrit cuz of all the bs relatives have been feeding him but in all honesty i genuinely dk which one to prefer. ",
  "metadata": {
    "author": "scumragg",
    "url": "https://www.reddit.com/r/PESU/comments/1ejn618/i_need_help/",
    "permalink": "/r/PESU/comments/1ejn618/i_need_help/",
    "score": 12,
    "created_utc": 1722747045,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lgetu7r",
      "body": "The thing is u will get one of those 1st 3 itself.Still if u just wanna put, BMS>MSRIT even after the seats increase."
    },
    {
      "id": "lgeu2cb",
      "body": "I would reccomend taking BMS over MSRIT a few of my friends study in MSRIT they genuinely hate it there, the principal has made the place a complete shitshow, educationally its decent but the college life is absolutely horrible. the timings are horrible and you don't have fests. \n\nif you are a GM student remove RVCE CSE as your first option there is no chance of you getting it, RVCE IS cutoffs afaik was less than 1000 rank for GM. you could get RVCE ECE if you are a GM student. if you have a category check it thoroughly once and put in RVCE."
    },
    {
      "id": "lgeua4i",
      "body": "Im a 3A student but my category cutoffs aint really sweet and sure ill consider removing rvce but doesnt it not matter"
    },
    {
      "id": "lgeudf8",
      "body": "There's no harm in keeping options even if there's 0 chance of getting it. There's no limit in cet option entry afaik"
    },
    {
      "id": "lgeudss",
      "body": "Yes but since neet students might reserve engineering seats too i just wanna make sure i wont end up choosing the wrong college😭😭😭 also thanks for the advice"
    },
    {
      "id": "lgeuh0c",
      "body": "Also thanks for the advice"
    },
    {
      "id": "lgeup63",
      "body": "yea fair"
    },
    {
      "id": "lgeuxgw",
      "body": "Usually the 3rd round will be held after the neet counseling ends, so I don't have to worry much abt that"
    },
    {
      "id": "lgev1v5",
      "body": "idk what 3A is (kcet is really confusing ) but do try your luck. hopefully you get a really good college , also don't remove any option just change order cause my college teachers had told me that you should keep the first option as the seat you will pakka get."
    },
    {
      "id": "lgf32gx",
      "body": "pes aiml>bms cs"
    },
    {
      "id": "lgfe9r3",
      "body": "Aiml is og🛐"
    },
    {
      "id": "lgfs075",
      "body": "why is bms better even after the increase in seats"
    },
    {
      "id": "lgl2b3a",
      "body": "BMSCE or BMSIT which college u r getting??"
    },
    {
      "id": "lgnb14r",
      "body": "Bmsce bruh obv"
    },
    {
      "id": "lgnb5qj",
      "body": "I’m getting bmsce but my priority is pes"
    },
    {
      "id": "lgwhocz",
      "body": "I study in pes, currently in 3rd year, i would prefer bms over pes anyday because the management just does not support you the best, and a lot of faculty is very mediocre compared to the ones in bms , and placements are pretty much the same , bms fests and hostels are way mote flexible and better than pes."
    },
    {
      "id": "lgwhxlt",
      "body": "The main reason i prioritised pes was cuz of travel, for pes my travel time is 20-25mins while ramaiah is 45mins and bms takes an whole hour. But yes ty for your advice ill consider it, but is bms still better even with the seat increase?"
    },
    {
      "id": "lgxszvz",
      "body": "I would say it is, but all college has its demerits , I've seen people suffering in pes and suffer myself to some nonsense policies , so yeah i would still go with bms, but if pes is convenient, its your choice"
    },
    {
      "id": "lhee1xp",
      "body": "Hey since you study in pes I want to ask you pes cs vs msrit cs?"
    }
  ]
}