{
  "id": "1ekh2bd",
  "title": "Is ETE branch in MSRIT worth it?, please read the context",
  "content": "Hey guys, I wanna know how good ETE branch in msrit is? Like in terms of internship and placement opportunities in companies like nvidia, Intel, amd, Samsung. Im interested in core electronics and not CSE. The thing is KEA fucked my kcet by not considering 22 out of syllabus qns and being in cbse class12 instead of PUC. I got 7K rank in KCET and 97%ile in JEE Main and can get into IIITs for ece easily but they're quite costly compared to kcet colleges and idk if they're worth shifting to some other place from Bengaluru and live in hostel. So, I'm considering to join msrit. Also I'm more inclined towards preparing for GATE and masters in core electronics. So I'm kinda considering joining ETE branch here, therefore wanted to know about internship scenario in core electronics companies. Also please tell me what's the avg package of ETE branch here. Thanks!\nMy initial thinking was to join ete at bmsce but they removed the branch, dont know if I can get ece at 7k rank this year due to increase in seats. Thus the confusion",
  "metadata": {
    "author": "T13NMY",
    "url": "https://www.reddit.com/r/PESU/comments/1ekh2bd/is_ete_branch_in_msrit_worth_it_please_read_the/",
    "permalink": "/r/PESU/comments/1ekh2bd/is_ete_branch_in_msrit_worth_it_please_read_the/",
    "score": 0,
    "created_utc": 1722839883,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lgkk6nb",
      "body": "I can still join IIIT like Kottayam. So confused whether to join IIIT Kottayam or into MSRIT keeping masters in mind"
    },
    {
      "id": "lgkn1k1",
      "body": "I think its better if you post this question on r/MSRITians"
    },
    {
      "id": "lgkn807",
      "body": "OP is so confused that they ended up posting it on the wrong subreddit.\n\nSir this is PESU, please post this on their subreddit."
    },
    {
      "id": "lgknhv5",
      "body": "I know brother. If you're in PESU, I'm sure lots of ppl would've come in via kcet, so would have idea of the colleges I mentioned. Moreover I can also get ece in PES ec campus via kcet. So ig it's okay"
    },
    {
      "id": "lgko0z6",
      "body": "I've posted it there as well"
    },
    {
      "id": "lgkypx4",
      "body": "PLEASE LOOK AT THE REDDIT PAGE AGAIN"
    }
  ]
}