{
  "id": "1ekzoba",
  "title": "IS CSE IN PES OR MSRIT OR BMS WORTH IT?",
  "content": "I want to pursue masters abroad and I would like to know if any of the colleges from above actually teach stuff that makes you smarter and fit for masters.\nIf yes, which college is the best one for a ug for pursuing masters abroad.",
  "metadata": {
    "author": "who-am-itellmeplease",
    "url": "https://www.reddit.com/r/PESU/comments/1ekzoba/is_cse_in_pes_or_msrit_or_bms_worth_it/",
    "permalink": "/r/PESU/comments/1ekzoba/is_cse_in_pes_or_msrit_or_bms_worth_it/",
    "score": 5,
    "created_utc": 1722893164,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lgq63ht",
      "body": "Firstly, none of these colleges (or any colleges in the country) will \"teach\" you what is needed for MS admissions. Admissions abroad depend on a host of factors including but not limited to your CGPA, essays (SOP and others), LORs, your research/work experience, publications and so on. The only thing that depends on the university itself is its reputation, everything else depends on how well you build your profile and network given the opportunities at hand or ones you create. \n\nGiven that PES, BMSCE, MSRIT are seen as equivalent in reputation, none of them will give you a significant advantage on their own. If you want to discuss indirect parameters, then a college where scoring high CGPAs is easier, where the strong academic rigour/curriculum helps you work on good projects/papers and one with profs with high (international) reputation will be ideal for *you* to build your profile. These parameters not by default increase your chances on their own, but rather help you work on yourself. It's difficult to score well at PES but it does provide a good curriculum to build good projects and publish papers. On the other hand, scoring at BMS and MSRIT will be significantly easier but their academic rigour isn't as strong. PES has a few very well known profs but it's at most a handful. I have no clue about the others. To summarise, pick the one which has the right balance."
    }
  ]
}