{
  "id": "1elbi5g",
  "title": "I am prolly gonna choose BMS CSE Core above RVCE ECE and MSRIT CSE. How fucked or unfucked am I ?",
  "content": "Wrt placements and opportunities and internships and cllg life and holidays and startups ... Did I make the right decision ?\n\nI'm generally a good student and will work hard to be in top 10% of batch whatsoever.",
  "metadata": {
    "author": "ValiantJudge29500",
    "url": "https://www.reddit.com/r/PESU/comments/1elbi5g/i_am_prolly_gonna_choose_bms_cse_core_above_rvce/",
    "permalink": "/r/PESU/comments/1elbi5g/i_am_prolly_gonna_choose_bms_cse_core_above_rvce/",
    "score": 0,
    "created_utc": 1722928990,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lgqmgu6",
      "body": "...you do realise this is r/PESU right?\n\nThis is better suited for their subreddits, not here. If you want an opinion, branch > college."
    },
    {
      "id": "lgqmjih",
      "body": "Thanx for the opinion. I basically posted here so u specifically could reply. Thanx buddy."
    },
    {
      "id": "lgqn0ih",
      "body": " you know you can just dm him right if you want specifically him to reply"
    },
    {
      "id": "lgqn2cc",
      "body": "Yeah I know. But I’d love community inputs as well."
    },
    {
      "id": "lgqoaxe",
      "body": "its not a bad choice   \nmsrit management is fucked up   \nrvce ece isnt recommended by seniors either  \nbms may start getting competitive now\n\napparently bmsce is getting an \"apple recruitment cell\" from this year seems like their management is increasing opportunities in response to the increase in intake"
    },
    {
      "id": "lgqof3j",
      "body": "Yeah I heard abt the apple incubation centre from students in bmsce. Verified info. Hope they increase opportunities for students and actually take this in a good direction."
    },
    {
      "id": "lgqoflm",
      "body": "Huge thanx."
    },
    {
      "id": "lgqq3tw",
      "body": "Can you throw some light on the \"apple recruitment cell\", I am just not up to date to the info."
    },
    {
      "id": "lgqqevq",
      "body": "Apple incubation centre to teach students abt Mac OS Dev and Mac OS apps and other things related to iOS / iPadOS / macOS. Leading to additional projects or internships and maybe jobs."
    },
    {
      "id": "lgqqlq7",
      "body": "Is it only exclusive for bmsce Or any other college also have?"
    },
    {
      "id": "lgqqo0b",
      "body": "Afaik only bmsce has setup an official apple incubation centre. So prolly only BMS."
    },
    {
      "id": "lgqqo6s",
      "body": "afaik its exclusive"
    },
    {
      "id": "lgqtrg5",
      "body": "Wait, what's this from msrit then?\n\nhttps://msrit.edu/research/apple.html\nThere's an apple lab in msrit as well"
    },
    {
      "id": "lgqttne",
      "body": "my b"
    },
    {
      "id": "lgqtxw1",
      "body": "https://msrit.edu/research/apple.html\n\nLooks like the same is available in msrit as well"
    },
    {
      "id": "lgqu1t3",
      "body": "I’m not too sure. Maybe the same or maybe different scopes. Idk. Only one way to find out…."
    },
    {
      "id": "lgqxvxx",
      "body": "This is something you should be posting on r/Btechtards OP."
    },
    {
      "id": "lgrphog",
      "body": "Looks like my reputation has grown beyond PESU lol. At this rate I should just open up a student counseling center and make profits."
    },
    {
      "id": "lgrq9te",
      "body": "Owl guy center  to sound more accurate rowlet pes councilor \n😂😂🤣"
    },
    {
      "id": "lgw3o0x",
      "body": "Pride of PESU -> Pride of Colleges"
    }
  ]
}