{
  "id": "1eldi4k",
  "title": "Need a help",
  "content": "Guys,It is taking a long year for the first year to start.Can anyone share any material,syllabus and reference books for the first year. So that I can start preparation from now. I m planning to join eee through kcet.",
  "metadata": {
    "author": "Equivalent-Glass9877",
    "url": "https://www.reddit.com/r/PESU/comments/1eldi4k/need_a_help/",
    "permalink": "/r/PESU/comments/1eldi4k/need_a_help/",
    "score": 10,
    "created_utc": 1722937199,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lgr1120",
      "body": "[https://better-pes.vercel.app/](https://better-pes.vercel.app/)"
    },
    {
      "id": "lgr3odj",
      "body": "Bro chill out , don't take too much tension and all man , cause after clg starts you ain't gonna have a lot of free time and stuff so enjoy it while it lasts ."
    },
    {
      "id": "lgr8uas",
      "body": "No bro I know that was just planning to work atleast 1 hr a day"
    },
    {
      "id": "lgr8y0a",
      "body": "Before I was enjoying but now it became a bit boring"
    },
    {
      "id": "lgra3pc",
      "body": "Thank for the site lingon berry own,and is there python in the first year. And the notes in this are relevant right."
    },
    {
      "id": "lgrbmba",
      "body": "First year doesn't require much prep , after the classes start just listen to them carefully and study 1 week before internals , you are good to go"
    },
    {
      "id": "lgrgu30",
      "body": "Ok ok dude thank you"
    },
    {
      "id": "lgrh1k7",
      "body": "Brother but the thing is mostly I will get ece in pes ec campus or eee in pesu rr. so I wish to atleast change my branch to pesu ec campus cs aiml"
    },
    {
      "id": "lgwb920",
      "body": "when do you think the classes will start??"
    },
    {
      "id": "lgwop4b",
      "body": "go visit [www.edx.org](http://www.edx.org)  Edx has loads of courses from pretty good colleges, i am doing cs50 for fun rn."
    },
    {
      "id": "lgwotl9",
      "body": "RVCE folk said first week of september, pes could decide to dump kcet kids and just start directly"
    },
    {
      "id": "lh8lvx9",
      "body": "Ok bro I will look into it"
    }
  ]
}