{
  "id": "1eldgnc",
  "title": "What languages (ie English, Kannada, Hindi) do we need to take in Pesu",
  "content": "I will be joining Pesu rr campus this year and was am wondering whether taking kannada is compulsory or not because Im not a native speaker.",
  "metadata": {
    "author": "violentmilkshake72",
    "url": "https://www.reddit.com/r/PESU/comments/1eldgnc/what_languages_ie_english_kannada_hindi_do_we/",
    "permalink": "/r/PESU/comments/1eldgnc/what_languages_ie_english_kannada_hindi_do_we/",
    "score": 8,
    "created_utc": 1722937038,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lgqx8sa",
      "body": "You don't need to take Kannada. Knowing english is sufficient.\n\nBut I think you should and learn basic kannada. Like words and phrases that will help you get around the city. I'm also not a kannadiga (though i am a resident) but knowing to speak kannada has been helpful."
    },
    {
      "id": "lgr129t",
      "body": "Keanu reaves is the goat"
    },
    {
      "id": "lgr2312",
      "body": "English is enough bro"
    },
    {
      "id": "lgr3fj8",
      "body": "Bruh unlike how it's portrayed in the media English alone is more than enough,  belive it or that more people speak Tamil,  Telugu and Malayalam in pes than kannada bro 😂"
    },
    {
      "id": "lgrgn2n",
      "body": "U can join linguista club where they'll teach you kannada, but English is enough"
    },
    {
      "id": "lgroo0f",
      "body": "Relax bro it's a uni, english is enough"
    },
    {
      "id": "lgrrvsq",
      "body": "I would advise you to learn chinese, It would help you in being able to communicate with a large number of people."
    },
    {
      "id": "lgrw2yo",
      "body": "only in VTU, kannada subject is compulsory. Its not needed in PESU."
    },
    {
      "id": "lgrwi7r",
      "body": "I think most of the ppl mistook me. I meant is there a compulsory subject of language that we need to take and write exams for like there is in BMSIT (kannada is mandatory subject to take over there)"
    },
    {
      "id": "lgrwysc",
      "body": "So there aren't any language exams we need to write?"
    },
    {
      "id": "lgrx9ld",
      "body": "right. No regional language exams."
    },
    {
      "id": "lgrxat9",
      "body": "NO. PES is not VTU"
    },
    {
      "id": "lgrxd6t",
      "body": "Thank goododdd. And thank you too for sharing this info"
    },
    {
      "id": "lgrxf2y",
      "body": "Thanks mate"
    },
    {
      "id": "lgx89jg",
      "body": "Java, C, python, c++"
    },
    {
      "id": "li3rkt9",
      "body": "What do you mean? Its an English medium school."
    },
    {
      "id": "lofu3fj",
      "body": "You're wrong lmao pes has majority kannada students especially in engineering and computer science , there might be telugus but tamilians and mallus no way!!"
    }
  ]
}