{
  "id": "1em6x1y",
  "title": "What should I choose",
  "content": "I got PES cse in ec campus through mamagement quota and with comedk result I am getting Dayanand Sagar ece. I am basically paying 12 lakhs in PES while I can pay 3 lakh and getting ece in Dayanand sagar. So what should I choose between both these colleges.",
  "metadata": {
    "author": "CompetitiveClue1820",
    "url": "https://www.reddit.com/r/PESU/comments/1em6x1y/what_should_i_choose/",
    "permalink": "/r/PESU/comments/1em6x1y/what_should_i_choose/",
    "score": 12,
    "created_utc": 1723020918,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lgwtyxt",
      "body": "DSCE"
    },
    {
      "id": "lgwv217",
      "body": "Bro go for dsce"
    },
    {
      "id": "lgwviyo",
      "body": "Consider fees"
    },
    {
      "id": "lgwxath",
      "body": "My father can pay that huge amount but the question arises whether it will be worth it? What if I get no placement then 50 lakhs has just gone waste."
    },
    {
      "id": "lgwxgnd",
      "body": "The management fee just straight up isn't worth it.\nGo with the comedk college"
    },
    {
      "id": "lgwxpbq",
      "body": "Yes that is what I am thinking. Btw is ece good branch? I know that within 5-6 years ece might have the biggest market in India but I can't trust on the basis of whatever decisions being made by the government. The actual potential of getting a high paying job is only if you apply for another country in case of ece"
    },
    {
      "id": "lgx5pwm",
      "body": "Depends on you. Are you willing to put in the work to make that 50 lacks worth it or do you want to do your level best and ace Dayannd Sagar."
    },
    {
      "id": "lgxcmht",
      "body": "My view is that - Go where you deserve i.e. by merit... It's hard to predict where the world will be in 4 years, even whether the IT sector will exist by then..."
    },
    {
      "id": "lgxih66",
      "body": "Fr I am already feeling enough guilt that I am not taking admission by my merit."
    },
    {
      "id": "lgxjo1j",
      "body": "If you can get into Dsce ece be ready to put in a lot of effort, as ECE is demanding. If you can get into Dsce for ECE, you should also be able to get into technical branches like AI/ML or ISE at BMSIT. PES CSE is really good but comes with a lot of competition. Keep in mind that education is priceless and not just about money."
    },
    {
      "id": "lgxp2oe",
      "body": "Go to Dayanand Sagar. Im a final year ECE student that went in through management in 2021, was 5L per annum at that time for a management ECE seat. It's just not worth it."
    },
    {
      "id": "lgxtsbh",
      "body": "So how is the placement record and how many companies approach in college"
    },
    {
      "id": "lgzqct9",
      "body": "what is the fees you payed for management quota"
    },
    {
      "id": "lh4vazo",
      "body": "im in a cs related branch here in dsce, from what ive heard some or most of professors in ece dept are not that good dk abt teaching but they are kinda strict n force u n treat u like school kids"
    }
  ]
}