{
  "id": "1em7xeu",
  "title": "Pes ec cs or VITv cs or dsce cs ",
  "content": "Im getting dsce through comedk and pes through pessat \nWhich college would be better considering the fees and the opportunities provided ",
  "metadata": {
    "author": "ALPha--29k",
    "url": "https://www.reddit.com/r/PESU/comments/1em7xeu/pes_ec_cs_or_vitv_cs_or_dsce_cs/",
    "permalink": "/r/PESU/comments/1em7xeu/pes_ec_cs_or_vitv_cs_or_dsce_cs/",
    "score": 10,
    "created_utc": 1723025021,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lgxlcn4",
      "body": "Anyday VIT... because even if it is category 5 the fees in VIT = fees at PES"
    },
    {
      "id": "lgxndpg",
      "body": "Yeah but the crowd and placement and management of VIT <<<< PES 😂😂"
    },
    {
      "id": "lgxnpqe",
      "body": "Overall better college - PES CS ( in terms of placements , academics ,crowd and scholarships )\n\nIf fees really is a problem then you can consider DSCE , but if you're academic you can still join PES and try for scholarships\n\nDon't go for VIT. No senior of VIT recommends to join it , they're having their own problems especially with placement,crowd and the market right now. 1200 students haven't been able to chose credits due to their server issues and the immense intake there,  and  they can't attend placements this year as well"
    },
    {
      "id": "lgxo0qa",
      "body": "Hm true... but if you give preference to campus life and college brand then go for VIT."
    },
    {
      "id": "lgxowlu",
      "body": "In the words of ChatGPT ( which I agree with as well )  \nBoth PES University  and VIT Vellore are well-regarded for their computer science programs, but they each have distinct advantages. Here’s a comparison:\n\n\\*\\*Crowd\\*\\*\n\nPES University : The student body at PES is generally competitive and academically focused. It attracts a lot of local talent from Bangalore, which is a hub for IT and startups.\n\nVIT Vellore: VIT has a more diverse student population, with students from all over India and even international students. The environment is competitive, and there is a strong focus on innovation and extracurricular activities.\n\n\\*\\*Placements\\*\\*\n\nPES University : PES has strong ties with the IT industry in Bangalore. Companies like Microsoft, Amazon, and Google regularly recruit from PES. The placement cell is active, and students often secure high-paying jobs.\n\nVIT Vellore: VIT also boasts impressive placement statistics with a wide range of companies visiting for campus placements. Their placement office is proactive, and students have opportunities to work with top tech firms.\n\n\\*\\*Salary Packages\\*\\*\n\nPES University : Average salary packages are generally high, often ranging between INR 12-18 lakhs per annum for CSE graduates, with top performers securing offers above INR 20 lakhs per annum.\n\nVIT Vellore: VIT’s average salary packages are competitive, often in the range of INR 7-9 lakhs per annum for CSE graduates, with top offers going up to INR 20 lakhs per annum or more.\n\n\\*\\*Recommendations\\*\\*\n\nFor Better Campus Life: VIT Vellore might offer a more diverse and dynamic student experience.\n\nFor Better Placements and Exposure : PES University may have an edge due to its strong connections with the tech industry."
    },
    {
      "id": "lgxpewf",
      "body": "And what about dsce?"
    },
    {
      "id": "lgxpkbo",
      "body": "That isn't really close to any of the other 2 in comparison."
    },
    {
      "id": "lgxu846",
      "body": "Lmao did you really say \"college brand\"? Neither of these have any kind of brand value in our country or outside."
    }
  ]
}