{
  "id": "1emdea2",
  "title": "Preparation for placements",
  "content": "Here 5th sem cse student. I am not interested in dsa stuff. I like data science related domains. Heard that placements in college hire only sde roles(which requires dsa practice). I'm in dilemma whether to take up the challenge of practising dsa or prepare for the roles available in my interested domains. Need some suggestions. Thanks.",
  "metadata": {
    "author": "DaikonEmbarrassed147",
    "url": "https://www.reddit.com/r/PESU/comments/1emdea2/preparation_for_placements/",
    "permalink": "/r/PESU/comments/1emdea2/preparation_for_placements/",
    "score": 3,
    "created_utc": 1723041315,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lgy37vf",
      "body": "You cannot dislike DSA because that's what they're gonna ask you as part of coding assessments, which are basic problem solving skills. So do practice DSA."
    },
    {
      "id": "lgyff3i",
      "body": "You can find more details in [this](https://www.reddit.com/r/PESU/comments/148kf62/comment/jo16nkc/) old comment. TLDR - you will need DSA."
    },
    {
      "id": "lgzw0y5",
      "body": "You should learn DSA. Do not skip it bro."
    },
    {
      "id": "lh0xgba",
      "body": "For DSA, Do it from Striver TUF+ paid course, he just launched, and its one-hell of an experience! \n\nTo join this TUF+ course, apply from this link - [https://takeuforward.org/plus/?affiliate=Being\\_lazy\\_tuf](https://takeuforward.org/plus/?affiliate=Being_lazy_tuf)\n\nYou will get a discount with this.  \nAlso, use the coupon code - **TUFPLUS** after that."
    },
    {
      "id": "lh1mlto",
      "body": "it just launched. how is it \"one-hell of an experience\"?"
    },
    {
      "id": "lh26cwf",
      "body": "Look at their comment history lmao. Didn't know Striver sends his team to advertise directly on reddit lol"
    },
    {
      "id": "lh2d0g8",
      "body": "xd"
    },
    {
      "id": "lh2djr8",
      "body": "Check it out - [https://www.youtube.com/watch?v=4Xh9DLUQCWs](https://www.youtube.com/watch?v=4Xh9DLUQCWs)\n\nImo it’s a pretty cool platform that’s got a ton of features,it has its own code judge, customizable schedule, ai assisted doubt portal, and even live code reviews with tc and sc analysis, and some other richy stuff which i dont remember, but it’s definitely worth trying out!"
    },
    {
      "id": "lh2gop6",
      "body": "It wasn't a compliment.\n\nGiven that the course has just launched and you're calling it \"one-hell of an experience\" and spamming it literally everywhere (and also getting downvoted everywhere lmao), its clear you're just here to sell the course. You're the last person someone should take placement prep advice from.\n\nIf the course helped you, cheers. Now do something with what you learnt instead of spamming it everywhere. The results will advertise the course on their own."
    },
    {
      "id": "lh3rkxv",
      "body": "Bro if anybody wants TUF+ striver course lifetime can dm me I am giving away my course for 4000 only."
    }
  ]
}