{
  "id": "1entr7o",
  "title": "Why is PES underrated outside karnakata?",
  "content": "Among top private colleges like VIT, MIT, SRM, BITS, etc. why is PES so unknown in north? While I had heard about RVCE and other comedk related colleges, I got to know about PES through my bangalore relatives only. Looking at the packages, it should be pretty famous all over India, but colleges like VIT, BITS, MIT, SRM supercede in popularity by a significant margin. Why so?",
  "metadata": {
    "author": "Audaticreddit",
    "url": "https://www.reddit.com/r/PESU/comments/1entr7o/why_is_pes_underrated_outside_karnakata/",
    "permalink": "/r/PESU/comments/1entr7o/why_is_pes_underrated_outside_karnakata/",
    "score": 36,
    "created_utc": 1723189036,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lh8qclr",
      "body": "bro mentioned bits in the same sentence as vit mit srm lmao"
    },
    {
      "id": "lh8qmuo",
      "body": "As you said, you know about RVCE and other COMEDK colleges. PES doesn't participate in COMEDK counselling and up till this year, it conducted its own entrance test, PESSAT (This has been scrapped from 2025 onwards and admissions will instead be made based on JEE scores). Had it participated in COMEDK counselling, it would have been known as the second best COMEDK college by students and parents."
    },
    {
      "id": "lh8qphp",
      "body": "Lol I see ur point, but it's still an expensive private college. More reputable and better than others, but still in the same category."
    },
    {
      "id": "lh8r31y",
      "body": "I agree, but as a standalone private college, PES is still very good. Other tier 2 pvt colleges also have their own examinations, but they have a much larger no. of students giving them than pessat. I wanted to know why that is so, is it due to it being newer or something?"
    },
    {
      "id": "lh8wefs",
      "body": "I think you've misunderstood. \n\nMost of the other colleges have campuses in the north, but PES doesn't. Having a presence in North India also builds reputation and word spreads about placements and opportunities. That's why you'll find that not many know about PES beyond the southern 4 states. \n\nAdditionally, PES has always been one to have a significantly higher fee + restricted intake via PESSAT. Since it does not take ComedK, this further restricts its reputation to the south. Kids in the north giving ComedK know about RVCE, BMS etc because they take it as a mode of admission. Additionally, PES does have a higher fee so for a large section of society PES isn't a feasible option, even if they know about it. They will find cheaper colleges through ComedK or other exams."
    },
    {
      "id": "lh8z8n0",
      "body": "About the location, it is a very very small minority who get to know about south colleges through their north campus. Majority hear about such colleges through word-of-mouth about their placements and fame (mainly placements). Eg. Jadavpur University is only located in West Bengal, yet it is famous all throughout India without the presence of other campuses. I don't believe that north campus is a major reason that people are aware of VIT MIT SRM etc, (it can be a minor reason) but let's agree to disagree.\n\nI think the second point you stated might be a major contributing reason. No presence in comedk surely affects the reputation in north, but the fee is more or less similar to all the other tier 2 pvt colleges out there (Maybe the similar fees is a recent thing, idk). It is strange though, other colleges also have their seperate exams, but PES is weirdly unknown despite that (Might be the lower intake, but it's not that much lower, but also comparably fewer people give pessat in the first place than compared to something like viteee or srmjeee)."
    },
    {
      "id": "lh8zqpt",
      "body": "Nice question \n\nPerhaps the other colleges marketed themselves better in the north. Can't say for sure.\n\nBut pes deserves a lot more respect than it currently gets."
    },
    {
      "id": "lh92us3",
      "body": "Yo pes only specalises in cse and nothing else.They dont even have civil and not even in good in other branches ,only famous for cse,anyways with cse dying pes has no future"
    },
    {
      "id": "lh931r3",
      "body": "Oh hell nah cse ain't dying anytime soon, but yeah being cse centric can be a reason"
    },
    {
      "id": "lh98h9f",
      "body": "To fix that they scrapped PESSAT , and switched to JEE MAINS"
    },
    {
      "id": "lhfqlhe",
      "body": "Cse dying ? What are you smoking 💀"
    },
    {
      "id": "lhfre61",
      "body": "Kcet mein bhi kuch hua?"
    },
    {
      "id": "lhgl7at",
      "body": "Is it true? Are they only gud at  cse? Im thinking of taking bsc nursing there but i cant find any reviews online or anywhere apart from their own site…will i regret ny decision? I rllyy need help..im out of state too so i cant possibly have any ppl to reach out there"
    },
    {
      "id": "lhk0ar9",
      "body": "Afaik BSc nursing is at the Electronic City campus right? If so then it's a new branch. Only 1-2 years old. \n\nWrt PES being known only for CS that's true for engineering. Most of us can't comment on non engineering braches."
    },
    {
      "id": "lju6txw",
      "body": "I am a 2025tard so help me understand but does this mean they are going to increase seats via jee main quota?"
    },
    {
      "id": "ljuc9tf",
      "body": "All the seats under pessat quota now fall under JEE MAINS quota. \nYou will have to give JEE MAINS , and then apply for PES University through their form , they shall make a merit list according to percentiles and then allot seats!"
    }
  ]
}