{
  "id": "1envyp2",
  "title": "Doubt",
  "content": "As I already took admission into PESU (RR campus), do I have the access to the library there ?",
  "metadata": {
    "author": "Interstellar777077",
    "url": "https://www.reddit.com/r/PESU/comments/1envyp2/doubt/",
    "permalink": "/r/PESU/comments/1envyp2/doubt/",
    "score": 9,
    "created_utc": 1723198090,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lh9cgho",
      "body": "After you get your SRN and PRN number you can access the pes library through the pesu app and pesu academy I think"
    },
    {
      "id": "lh9dokt",
      "body": "Once you get your ID card you can use it to access the library and borrow books."
    },
    {
      "id": "lha1amg",
      "body": "Can I not just sit in library and study with my own study material, is there any other place to do the same ?"
    },
    {
      "id": "lha1vxm",
      "body": "Yes you can sit in the Library"
    },
    {
      "id": "lhabx44",
      "body": "Yes, I have been going for a few days now. The security does not say anything if you wear the temporary id.  \nWhen entering libraries, sometimes they may ask to scan it, just tell them it's temporary, and you'll get the proper one when you start your session next month.   \nFor wifi, I just took the credentials of a senior who I know, you can do this too.  \n  \nOr try:  \nUsername - graviton01\n\nPassword - graviton01\n\ngraviton02 and graviton03 should work too  \n  \nA senior said they were given these credentials in an old hackathon, and they still work. Haven't tried them myself, though."
    },
    {
      "id": "lhaipck",
      "body": "Ahh cool thnx alot, this was helpful .... "
    },
    {
      "id": "lhaiqt4",
      "body": "Okk"
    },
    {
      "id": "lhalv5i",
      "body": "yes you have access"
    },
    {
      "id": "lhan1r8",
      "body": "np, btw, if you just want to sit, avoid the libraries which have books, they will be stricter there. Security in the non-book lending libraries is pretty chill. You can try the 13th floor BE block one for example."
    },
    {
      "id": "lhbladm",
      "body": "Okk"
    },
    {
      "id": "lhqutk5",
      "body": "what is the difference between srn and prn? Also, is SRN the one on ID card?"
    },
    {
      "id": "lhwa22p",
      "body": "what is the difference between srn and prn? Also, is SRN the one on ID card? When I checked my profile on pesu academy, it showed SRN- NA"
    },
    {
      "id": "lhwahnc",
      "body": "what is the difference between srn and prn? Also, is SRN the one on ID card? When I checked my profile on pesu academy, it showed SRN- NA"
    },
    {
      "id": "lhwat17",
      "body": "SRN is your department specific roll number whereas your PRN is your university roll number. The one on your id card is PRN. You can use both to access the library. You'll get your SRN issued in  pesuacademy soon don't worry."
    },
    {
      "id": "lhwil8e",
      "body": "ohkay thanks"
    },
    {
      "id": "lhxlzfd",
      "body": "I think they use prn as temporary student identity during counselling time, probably cause a lot of people would give up their seat or pick a different college. As far as I know, once you actually join, you'll be using your srn only everywhere.\n\nSo yeah, the one on your temporary id is prn, and you'll get your srn later."
    }
  ]
}