{
  "id": "1epf046",
  "title": "PES RR ECE VS PES EC CSE",
  "content": "Pls suggest, I can get both through kcet. \nI have interest in both, I've heard the placements of CSE is same for both campus, is that true?? \n\nPls suggest what I shld preffer\n\n[View Poll](https://www.reddit.com/poll/1epf046)",
  "metadata": {
    "author": "Terrible_Practice974",
    "url": "https://www.reddit.com/r/PESU/comments/1epf046/pes_rr_ece_vs_pes_ec_cse/",
    "permalink": "/r/PESU/comments/1epf046/pes_rr_ece_vs_pes_ec_cse/",
    "score": 3,
    "created_utc": 1723361167,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lhk5bkd",
      "body": "Choose the branch you are more interested in. If you are more interested in CS, pick CS at ECC. Else pick ECE at RR. If you are unsure, go with CS at ECC since it provides better placements."
    },
    {
      "id": "lhk6gxb",
      "body": "How about college life difference in both campuses"
    },
    {
      "id": "lhk7p1f",
      "body": "Pretty similar. RR has a bigger budget so fests tend to be better here but the club culture (especially for tech) is significantly better at EC. \n\nHonestly, given that you have different branches at each campus, I'd suggest you to choose based on branch preference and not based on factors like clubs/college life because these things are inconsequential after 3rd year (and usually, even a bit before 3rd year ends). Your branch on the other hand determines a lot of career outcomes down the line."
    },
    {
      "id": "lhkdv4r",
      "body": "Is it true I can join clubs of other campus too? And participate in other campus hackathons?"
    },
    {
      "id": "lhkh2q4",
      "body": "Yes. Why would I mention it if not true."
    },
    {
      "id": "lhkh8q4",
      "body": "Even the hackathons and stuff?"
    },
    {
      "id": "lhkibl9",
      "body": "Bruh. I just said yes. All events at PES (clubs, fests, hackathons and everything under the sun) are open to students from both campuses."
    },
    {
      "id": "lhko3ng",
      "body": "Does PES usually conduct team hackathons or solo hacks? and do we have to be present at the campus that the hackathon is taking place at or can this be done online too?"
    },
    {
      "id": "lhksgt9",
      "body": "Ok ok I was just confirming . Ty 🙏"
    },
    {
      "id": "lhlzeun",
      "body": "Depends on the hack. Almost all require teams. Most are offline but some are online (and some hybrid)."
    },
    {
      "id": "lhpo0p4",
      "body": "In the end its up to you."
    },
    {
      "id": "lhpo3ai",
      "body": "Ha yehi advice chahiye tha merko"
    }
  ]
}