{
  "id": "1epk3on",
  "title": "Why this discrimination????",
  "content": "Why does RR ppl have more half day in a week than EC .. Didnt they RR and EC are same ... Y do ppl from EC hav 8-4 classes (except Wednesdays) where as RR ppl have 8-12:15/1pm except on lab days ....????????????",
  "metadata": {
    "author": "Top-Blueberry-47",
    "url": "https://www.reddit.com/r/PESU/comments/1epk3on/why_this_discrimination/",
    "permalink": "/r/PESU/comments/1epk3on/why_this_discrimination/",
    "score": 26,
    "created_utc": 1723380804,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lhkz81g",
      "body": "Is this true ?"
    },
    {
      "id": "lhl02v8",
      "body": "Yes"
    },
    {
      "id": "lhl1vbk",
      "body": "Ig this is the actual reason for pes rr aiml for having higher cgpa cutoff than pes ec cse.😭"
    },
    {
      "id": "lhl2099",
      "body": "Bro nah no way 😭"
    },
    {
      "id": "lhl240n",
      "body": "Then why does rr aiml has higher cutoff than ec cse.. Are pes people dumbb?😭"
    },
    {
      "id": "lhl2irp",
      "body": "Iirc pes ecity was vtu affiliated until some 2019 or 2020. Then it became autonomous. While one in rr was always autonomous.\n\n\nHow does kea even decide cutoffs for that matter? Always was curious\n\n\nBtw did u know there's a pes mandya?"
    },
    {
      "id": "lhl2sdd",
      "body": " I'm not talking about the kcet cutoffs.. I saw a post in which some wrote a cmnt saying, rr aiml had a cgpa cutoff of 8.6 whereas ec cse had a cg cutoff of 8.1 for branch change.."
    },
    {
      "id": "lhl31j7",
      "body": "pes mandya and this pes isn't related lol"
    },
    {
      "id": "lhl475a",
      "body": "Bro, are the grills installed a month ago still in place ? Also is this just for cs guys and does it change in 2nd year."
    },
    {
      "id": "lhl4dux",
      "body": "I'm taking abt 2nd year only... Even in first year it was like tht...."
    },
    {
      "id": "lhl4lhz",
      "body": "I kinda understand why they call it a school, also are the grills in the campus permanent?"
    },
    {
      "id": "lhl4oe9",
      "body": "S ig"
    },
    {
      "id": "lhl5npt",
      "body": "Also second years have CIE offline and RR has online for"
    },
    {
      "id": "lhlab0j",
      "body": "Ohh.\nThat's weird asf ngl, I expected them to like release some cutoff lost based on some ranking or smth"
    },
    {
      "id": "lhlb8rs",
      "body": "Sorry for so many questions, but got pes ecc cse in mock. Do u think I should choose it?"
    },
    {
      "id": "lhlg10p",
      "body": "Fr?? Man I can't sit for 3 hours every Tuesday and listen to that takla speak I'm so done"
    },
    {
      "id": "lhlhocb",
      "body": "You need to keep in mind that RR \"Campus\" and EC \"Campus\" are not just campuses. They are two distinct colleges under the PES University. That is the structure. This means that the EC Campus \"College\" has discretion over such matters."
    },
    {
      "id": "lhlmrkr",
      "body": "ask management bro.. how can we answer?"
    },
    {
      "id": "lhlsp40",
      "body": "You gotta blame your HODs tbf not blame rr for discrimination."
    },
    {
      "id": "lhlw6b5",
      "body": "Saturdays and sundays are off right?"
    },
    {
      "id": "lhlz8il",
      "body": "Check the FAQs"
    },
    {
      "id": "lhlzeib",
      "body": "Rowlet anna, new dp looks amazing.. \n\nBtw,  I've already read every faq present in this sub .."
    },
    {
      "id": "lhmbvwy",
      "body": "Thanks, my friend drew it :) - all credit goes to her."
    },
    {
      "id": "lhmbysd",
      "body": "Girl friend?"
    },
    {
      "id": "lhmcka7",
      "body": "No, just friend. \n\nRR tends to have slightly higher cutoffs. More people want to shift to RR for some reason so the cutoff increases."
    },
    {
      "id": "lhmczom",
      "body": "You aren't getting her hints, no friend puts efforts in drawing things for free.. Hope you understand this"
    },
    {
      "id": "lhohpa0",
      "body": "Depends on your other options too"
    },
    {
      "id": "lhpcb13",
      "body": "the reason this year was timetable , CIE(main reason) and same course with a better campus + opportunity ...  \nMany from CSE ECC went to RR AIML ....... just cuz of campus"
    },
    {
      "id": "lhqjyuk",
      "body": "This has been answered in a previous post by rowlet, check the faqs"
    },
    {
      "id": "li3qcix",
      "body": "Yes"
    },
    {
      "id": "lo34z2h",
      "body": "Is mandya pes good ?? I got it through kcet now should I join ???"
    }
  ]
}