{
  "id": "1eq4vtf",
  "title": "Doubt ",
  "content": "How to survive as an introvert in pesu ec campus.",
  "metadata": {
    "author": "MaintenanceOld4482",
    "url": "https://www.reddit.com/r/PESU/comments/1eq4vtf/doubt/",
    "permalink": "/r/PESU/comments/1eq4vtf/doubt/",
    "score": 15,
    "created_utc": 1723437698,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lhp9hda",
      "body": "If ur aim is to get a nice job in the corporate world, then u also have to change ur attitude towards talking with people.\n\nNot my words, from some known people in that field. \n\nI'm also a freshie and introvert like u in the EC campus."
    },
    {
      "id": "lhp9n37",
      "body": "Yeah bro i feel so awkward and shy when i meet new people. I almost have a panic attack."
    },
    {
      "id": "lhpaowv",
      "body": "Meet me(I'm also an introvert)"
    },
    {
      "id": "lhpd3ng",
      "body": "Well, I am also like u, I barely have any friends even after JEE or before JEE, not even one from my school days, as people say, you have ur best time in school, but this is not correct in case of mine.\n\nJust take a deep breath man and don't think about the consequences of talking to other people, like \"what will other people think about me\" and all like that and u will be doing good."
    },
    {
      "id": "lhpfwpr",
      "body": "Maybe all introverts together can form a group and help each other lose the introvertness."
    },
    {
      "id": "lhpqylh",
      "body": "Same.. its so hard for me to start or even continue a conversation"
    },
    {
      "id": "lhptf72",
      "body": "brother you will get used to it with time don't worry too much, you will find alot of people like you and find a nice circle.. just try to get out of your comfort zone a bit and initiate conversations sometimes"
    },
    {
      "id": "lhptlu0",
      "body": "which branch brother"
    },
    {
      "id": "lhpu5v9",
      "body": "Cse what about you?"
    },
    {
      "id": "lhpuft3",
      "body": "getting cse but considering other options too, have you finalised on this?"
    },
    {
      "id": "lhpvk60",
      "body": "waiting for Mhtcet counselling, but most probably pes"
    },
    {
      "id": "lhpw078",
      "body": "oh cool mhtcet rank kiti aahe  \ndm?"
    },
    {
      "id": "lhpzro4",
      "body": "we should totally make an introvert group guys 😭🤌"
    },
    {
      "id": "lhq1a8q",
      "body": "Survive‽‽ U gotta take a drop.....😇"
    },
    {
      "id": "lhr2y3k",
      "body": "open for DM, for a little chat   \nhave confidence only due to the anonymity of my identity 🥲"
    },
    {
      "id": "lhr30t9",
      "body": "fr 😂"
    },
    {
      "id": "li10d8t",
      "body": "Just try and join clubs of your interest, most of the time the seniors there are welcoming so it's a good start to trying to socialize"
    }
  ]
}