{
  "id": "1eqch63",
  "title": "URGENT HELP NEEDED!!!",
  "content": "ok so im joining pes cs and i just want to know that if i study college work on the weedays and do cs related courses on weekends religiously would that be sufficient for a t1 job?",
  "metadata": {
    "author": "Commercial-Bed-7728",
    "url": "https://www.reddit.com/r/PESU/comments/1eqch63/urgent_help_needed/",
    "permalink": "/r/PESU/comments/1eqch63/urgent_help_needed/",
    "score": 5,
    "created_utc": 1723465920,
    "flair": "ANNOUNCEMENT :snoo:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lhqlu5z",
      "body": "can someone pls reply?"
    },
    {
      "id": "lhqmx3u",
      "body": "It depends on how much you learn and how much effort you put in. It's not as easy as 'oh I'll do courses during the weekends, T1 company guaranteed!!'.  There are various factors such as your coding skills, your projects, your communication skills, building a network, etc. To answer your question, sure, you can get into a T1 company if you put in the efforts and upskill yourself in multiple areas as I mentioned above with your current plan."
    },
    {
      "id": "lhqnbsx",
      "body": "Can i dm you?"
    },
    {
      "id": "lhqv0tw",
      "body": "Bro what's with the world ending life or death scenario title? calm down dude ur just joining the college"
    },
    {
      "id": "lhqwoff",
      "body": "i wanna do well here cause i left an iit (mech seat) and a nit suratkal(mech seat) for a seat in cs here"
    },
    {
      "id": "lhqxmad",
      "body": "Just keep your CGPA above 8.5 and obviously do the side hustles, actively search for opportunities like internships, projects, etc and do something unique to keep your resume eye catching"
    },
    {
      "id": "lhqyhqk",
      "body": "im thinking of starting a 6 month python course in my 1st sem is that enough or anything else?"
    },
    {
      "id": "lhuy2wj",
      "body": "Dude relax !! I can understand your situation. But clg is all about exploring things, connecting with people, learning new skills. I am not telling u to just chill. Maintain good academics simultaneously do competitive coding. Maintain 8.5+ CGPA so that ull be eligible for most of t1 companies like 90%. If u have 9+ then no one gonna stop u. So that’s pretty much it."
    },
    {
      "id": "lhvshok",
      "body": "Same, but I left civil xdd"
    },
    {
      "id": "lhwxsqh",
      "body": "Idk which iit but why give up nit suratkal??\nFeel like you're making mistake. The atmosphere, peer group and infra everything is much better there at nit suratkal.\nI'd understand if it were t2/t3 nit but not surathkal"
    },
    {
      "id": "lhx3gtj",
      "body": "I got only mechanical and I hate mechanical "
    },
    {
      "id": "lhx4kov",
      "body": "Your call brother."
    },
    {
      "id": "lids9sv",
      "body": "In that case I left nit suratkal (chemical) for cse in pes rr"
    },
    {
      "id": "lieb6iy",
      "body": "2023 mech grad here, (pursuing masters in mathematics and CS applied to mech), my opinion may or may not be what you’re exactly looking for, but here me out. I am sure all your batch mates also have a similar ambition in mind. \n\nMy batch mates and immediate juniors were also obsessed with getting a T1 job (who isn’t ?) and they put in (real) hard work just to get into one the T1 companies right from year 1. It turned out, roughly 2 or 3 out of 10 made it into such companies. The remaining had to settle for far less than their potential. \n\nFirst off, have you asked yourself few questions: \n\n1. Are you naturally inclined to CS ? (If the answer is NO, then it’s completely fine. I know my friends who took bio as their optional elective in PU and have absolutely killed it in CS. They went in with an open mind and had the natural tendency to absorb stuff like a sponge. They had a special trait of falling in love with the process, irrespective of what they did) \n\n2. If the answer to the first question is YES, you haven’t mentioned anything about the domain you’re interested in or any specific T1 company(/ies) you are interested in that you want to get into. Saying jargons like AI-ML or backed simply isn’t going to help. \n\nMy humble suggestions to you would be the following:\n\n1. Assuming you have no idea about CS, give yourself good 3-4 semesters to figure out where you want your career to “START”. Meanwhile show your passion and dedication in every subject and try to score an above average grade (> 8.5 GPA) That automatically makes your stand out from the rest. \n2. Following up to suggestion 1, take Labs and projects seriously. Don’t be one of those guys who just waits for somebody else to complete their project and plagiarize it. Just doing the course work meticulously enough and understanding it, is enough to get you a T2 job (seen my best friends doing this and ended up getting T1’s)\n3. In today’s scenario, given enough training to a donkey, even it can learn to code. India and PES have enough donkeys. Just don’t be one among them. Use your CS knowledge to solve problems from different domains (maybe some other engineering branch or non science branches) Look around the campus, search for a problem that you are genuinely interested in solving and start towards working out a solution using tech (adds value to your CV and gives you a strong purpose) instead of building a stupid calculator or doing the same thing that 100’s of people have done and copy pasted on their CV\n4. Understand the fundamentals like OS, DBMS, DS-Algo and other core subjects.  (CS friends can help me out on other such subjects) Reason out why specific things are happening. Just don’t blindly mug up for the sake of an exam. This is simply suicidal. \n5. Provided you have time left after following suggestions 1-4, practice whatever you’ve learnt on the side (leet code, Hacker rank etc). Just don’t blindly jump into now. Get your fundamentals right only then start. I’ve seen people getting demotivated because everything seems tough if your  basics are not strong. \n6. Enjoy life. You’ve worked your socks off to crack JEE. You have earned the right to not worry for sometime. Just be with the right friends circle and everything will fall into place.\n\nGood luck and may the force be with you !"
    },
    {
      "id": "liwyvlf",
      "body": "Which IIT? Even I left a seat in nitk mech."
    }
  ]
}