{
  "id": "1eqfkhb",
  "title": "Is RR worth it?",
  "content": "I have a PES ec cse seat already allotted, in the second councelling, I’ll most probably get RR aiml if I attend it.\nIs it worth it?\n\nEC CSE ~ RR AIML \nWhat’s better?",
  "metadata": {
    "author": "Blowing-up-bawls",
    "url": "https://www.reddit.com/r/PESU/comments/1eqfkhb/is_rr_worth_it/",
    "permalink": "/r/PESU/comments/1eqfkhb/is_rr_worth_it/",
    "score": 14,
    "created_utc": 1723473823,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lhr4016",
      "body": "And also I’ll need a hostel, so after the second councelling, is there any chance of me getting a hostel in RR?"
    },
    {
      "id": "lhr5r3m",
      "body": "I think crowd and infrastructure is the only difference. You could visit the campus and decide if you'd want to switch or not. Placements will be the same , syllabus as well"
    },
    {
      "id": "lhr5y3e",
      "body": "They haven't really started any hostel selection for anyone from Bangalore yet. Probably waiting for KCET, but I don't think you'll get it if you're from blr"
    },
    {
      "id": "lhrcu89",
      "body": "I’m from the north though"
    },
    {
      "id": "lhrcwk5",
      "body": "I did visit and love the campus, but is it worth it?\nAre the people worth it?"
    },
    {
      "id": "lhro76p",
      "body": "I think now with the updated aiml syllabus, rr aiml and ec cs r comparable. From what I've researched and asked seniors, ec cs is still better but by a small margin. I'd say if travel time is better to rr , it's worth it (I was gonna pick ec cs but now will mostly pick rr aiml due to syllabus change)"
    },
    {
      "id": "lhrwxpm",
      "body": "Not sure what you meant by people but the crowd is pretty good. You can probably already tell by the number of seniors that are active on discord and send material to help etc."
    },
    {
      "id": "lhrx2ax",
      "body": "You can try calling the warden then , I'm not too sure tho , it's been very uncertain due to kcet's delay"
    },
    {
      "id": "lhttar8",
      "body": "what was yr rank ?"
    },
    {
      "id": "lhuy08m",
      "body": "1800"
    },
    {
      "id": "lhuy0wp",
      "body": "Hmm"
    },
    {
      "id": "lhvawbv",
      "body": "Could u please explain about aiml syllabus change?"
    },
    {
      "id": "lhvfu9p",
      "body": "rank in pessat?"
    },
    {
      "id": "lhvnr4k",
      "body": "Objectively ECC CS is better. BTech should always be core subject. Taking specialization this early makes no sense. \n\n\n\nThat being said this is true very w.r.t masters. Core subjects will get priority over **any** specialization branch. Furthermore you will have to justify taking a specialization this early in your career.\n\n\n\nWhen it comes to placements we can't say anything. There is no guarantee that CS and AiML will have pooled placements. It is very likely to be pooled. It is very likely that companies will prefer core CS over AiML (even for ML jobs). This is based off of how companies treat specialized branches in other collages. \n\n\n\nI'd say only take AiML in RR only if it is very hard for you to get to EC campus. (Tho you said you are looking for hostel so this is a null point). The crowd is basically the same w.r.t to CS but there is more diversity in RR Campus. The infrastructure is definitely better in RR."
    },
    {
      "id": "lhvvrx6",
      "body": "I'm taking admission through cet, not pessat"
    },
    {
      "id": "lhvvtlk",
      "body": "A senior in aiml would be better suited to answer, I don't want to mislead you"
    },
    {
      "id": "lhw4uts",
      "body": "okay\n\ni will get cs through pessat, and ec ECE branch through kcet \n\nwhich one is better?"
    },
    {
      "id": "lhwl3ui",
      "body": "Alr, thanks man."
    },
    {
      "id": "liujsza",
      "body": "even I have a rank of 1790 and in the same dilemma. what have you decided then?"
    }
  ]
}