{
  "id": "1eqix6e",
  "title": "choose amongst them",
  "content": "Guys, I have gotten into PES RR AIML through PESSAT. I chose AIML even when I was getting CSE since one of my cousins(who has a lot of experience in this field) suggested me. Now that I was scrolling through the comments, I wonder if I should apply for PES CSE at EC which I will get through KCET. The fee at RR this time through PESSAT is 5L and I figured it would be around 3L at least in EC since I would have to lookout for a hostel. So what do you guys suggest, Seniors please hop in! Also what do you think about my decision of choosing AIML over CSE?",
  "metadata": {
    "author": "No-Yard6142",
    "url": "https://www.reddit.com/r/PESU/comments/1eqix6e/choose_amongst_them/",
    "permalink": "/r/PESU/comments/1eqix6e/choose_amongst_them/",
    "score": 10,
    "created_utc": 1723481697,
    "flair": "Club Post :upvote:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lhrvga5",
      "body": "NOT A SENIOR \nbut i would recommend to take cs over ai/ml as for future studies you would have a wide field, but ai/ml at rr is better than cs at ec . I am also getting ai/ml at rr campus but through kcet . But if you are concerned about the fees then it's up to you"
    },
    {
      "id": "lhu2mw1",
      "body": "This [comment](https://www.reddit.com/jnve51g?utm_source=share&utm_medium=android_app&utm_name=androidcss&utm_term=1&utm_content=2) goes through the concerns with AI/ML. But basically, you're too young and uninformed to know what you want to do yet. So don't specialise in AI/ML."
    },
    {
      "id": "lhvistk",
      "body": "You should definitely go for CS through CET. There's no way AIML in PES is worth 20 lakh. The only difference between AIML and CD is very small. They're almost tye same thing. EC campus is not as chill as RR definitely but getting in through KCET is way better than PESSAT"
    },
    {
      "id": "lhw1yc2",
      "body": "all seniors say CSE at EC is better then ai at RR."
    },
    {
      "id": "lhw2m6i",
      "body": "omg there are so many mixed opinions from PES seniors, Just recently on another post seniors were saying EC is more chill because of the management being in RR."
    },
    {
      "id": "lhw67yy",
      "body": "RR is more chill. However most adminstrative changes are made first at RR.(RR had bouncers b4 EC). So it can feel more strict sometimes."
    },
    {
      "id": "lhwfjs7",
      "body": "I get that not everyone has the same experiences across both campuses but whoever is saying EC is better than RR is on some serious copium because generally, teachers are way more chill and most people have a nicer time in RR.  This is definitely the case for ECE. I was in both campuses and maybe a few things are better in EC campus but RR campus is always better in almost every way"
    },
    {
      "id": "lhwnlqc",
      "body": " I just noticed I have another option- I can drop my AIML seat in order to look for a CSE seat at RR in PESSAT 2nd round counselling. Guys for once lets say fee is not a problem ik it matters a lot but assuming that fee ain't a problem then what would you guys suggest?"
    },
    {
      "id": "lhx3b55",
      "body": "What did u find better at ec campus? need a bit copium, caz I found infra and better at rr. Is the teaching and research opportunity same in both?"
    },
    {
      "id": "lhx7h6k",
      "body": "The campus is bigger and the MRD student centre is pretty big and has pool tables, darts, TT tables and stuff so after clg u can hang out there for a while with your frnds. But I'm just here picking like the most insignificant things. RR is just plain better brodie. It's unfortunate that you're in EC campus but as long as you're not in ECE, it's not too bad. You could be doing way worse"
    },
    {
      "id": "li10bcv",
      "body": "wdym they have bouncers 💀"
    },
    {
      "id": "li14toa",
      "body": "Well ya. Regular bouncers. Big dudes in a black shirt making sure students don't have fun. \n\nEssentially they make it hard to bunk classes and spend time in canteens or just roaming around."
    },
    {
      "id": "li84jo2",
      "body": "sounds like something out of a cartoon bruh"
    },
    {
      "id": "li8ekmz",
      "body": "😭"
    }
  ]
}