{
  "id": "1eqltty",
  "title": "Help me out folks!",
  "content": "BMS CS V/S MSRIT CS V/S PES (RR)AIML?\nLooking at the first KCET mock allotment cut-off\nMSRIT CS -1.1k\nBMS CS -1.9k\nPES AI -1.8k\nIn my priority order list: Bms cs>msrit cs> pes rr ai \nMy rank: 13xx \nWhat do you guys think?\nShould I follow the cut-off while editing my priority order or just keep it as it is..?",
  "metadata": {
    "author": "ashith_rao",
    "url": "https://www.reddit.com/r/PESU/comments/1eqltty/help_me_out_folks/",
    "permalink": "/r/PESU/comments/1eqltty/help_me_out_folks/",
    "score": 4,
    "created_utc": 1723488436,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lhuiaz0",
      "body": "Id choose rammiah cs"
    },
    {
      "id": "lhvmbw5",
      "body": "Brother u will get pes cse in 2nd extended round"
    },
    {
      "id": "lhw2qw6",
      "body": "id say PES is better then MSRIT"
    },
    {
      "id": "lhw2yic",
      "body": "There is definitely a high chance but still to be on the safer side I was asking"
    },
    {
      "id": "lhw3518",
      "body": "Why exactly bro? Most of my relatives know about MSRIT but only a few of them knew PES.\nHow do they both differ?"
    },
    {
      "id": "lhw383n",
      "body": "Bro have you got any idea about the avg placements for MSRIT CSE?"
    },
    {
      "id": "lhw3puz",
      "body": "Bro it's almost the same level as pes interms of placements that is around 6-7lpa , people don't know about pes cause it's really lowkey af outside karnataka but it's placements is topteir , even comparable to teir 2 iit and nit . But in pes in your second year as Long as you have a high cgpa , around 9.5 you can change your branch to cse too. Right now the syllabus of cse and aiml are pretty much same except the electives in 3rd year . So choose your clg be it msrit or pes based on your convenience,  like fees , distance from house , etc."
    },
    {
      "id": "lhw5gaz",
      "body": "Hello can you please tell the electives of cse with aiml?"
    },
    {
      "id": "lhw64xl",
      "body": "check FAQ"
    },
    {
      "id": "lhwcnrz",
      "body": "Thank you so much my man. Distance doesn't matter since I'm coming from a long way. So prolly gonna stay in the hostels or nearby pg."
    },
    {
      "id": "lhx3ktv",
      "body": "tier 2 iit and nit bfr"
    },
    {
      "id": "li1007p",
      "body": "idk man, all my relatives know about pes, even ones who live in other states.   \nI heard msrit culture is not that good or something, plus its VTU college so old syllabus.   \nYou wont have a massive difference between the three though, all have their own flaws and benefits."
    }
  ]
}