{
  "id": "1er2ka9",
  "title": "Get ready for this placement season with nucleusFUSION!",
  "content": "We’re a student-led community that connects you with alumni from PES University who are already working in the organizations you’re targeting. Get insights on how to prepare for interviews, learn more about the company culture, and get your questions answered directly from those who have been in your shoes.\n\nWhy Nucleus Fusion?\n•⁠ Connect with PES alumni working at top companies.\n•⁠ Gain valuable insights from their experiences, interview tips, and career journeys.\n•⁠ Build professional networks that can help you advance in your career.\n\nWe are a community for students, by students.\nWe recommend using a PC for better experience.\n\n🔗 Check it out now: [nucleusFUSION](https:// nucleusfusion dot netlify dot app/)\n\nP.S.: No financials involved for anyone.",
  "metadata": {
    "author": "Repulsive_Low7985",
    "url": "https://www.reddit.com/r/PESU/comments/1er2ka9/get_ready_for_this_placement_season_with/",
    "permalink": "/r/PESU/comments/1er2ka9/get_ready_for_this_placement_season_with/",
    "score": 31,
    "created_utc": 1723537496,
    "flair": "ANNOUNCEMENT :snoo:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lhvt68u",
      "body": "W"
    },
    {
      "id": "lhvyy28",
      "body": "great initiative,needed this"
    },
    {
      "id": "lhw85qa",
      "body": "I'm not able to open the link can someone send it to me pls"
    },
    {
      "id": "lhw8fei",
      "body": "Hi, just replace [dot] with actual dots on your web browser. Reddit wouldn't allow direct links"
    },
    {
      "id": "lhwadsh",
      "body": "Ok tnx"
    },
    {
      "id": "lhwvr2d",
      "body": "Great work, but need some additions, like add another field for connecting with alumni studying abroad etc"
    },
    {
      "id": "lhwyxko",
      "body": "I’m a 2024 graduate, but after finishing the verification srn it take me to the student section. \nHow do I sign up as a mentor?"
    },
    {
      "id": "li16r2g",
      "body": "CFBR"
    }
  ]
}