{
  "id": "1er6egm",
  "title": "we are so cooked..",
  "content": "Feel like we are back to school.. \nNew HOD has gone mad lmao making 21 year old adults to sit according to roll number ðŸ˜ƒðŸ‘, that too with a laminated name plate lmao",
  "metadata": {
    "author": "Niranjan_69_",
    "url": "https://i.redd.it/utbt1yjkbfid1.jpeg",
    "permalink": "/r/PESU/comments/1er6egm/we_are_so_cooked/",
    "score": 94,
    "created_utc": 1723551522,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lhwfz1v",
      "body": "which campus is this?"
    },
    {
      "id": "lhwg6px",
      "body": "Seems like ec"
    },
    {
      "id": "lhwgkhd",
      "body": "Another reason for rr aiml to have higher gpa cutoff than ecc cse"
    },
    {
      "id": "lhwgsq4",
      "body": "lmao please tell me this is ajey i will get another reason to hate on him"
    },
    {
      "id": "lhwgxv9",
      "body": "Ajey and Satish deserve hell"
    },
    {
      "id": "lhwh35f",
      "body": "RR campus broski"
    },
    {
      "id": "lhwh3y8",
      "body": "i think the branch change cutoffs for aiml was extremly low,some dude with a 7gpa got into aiml dont know which campus. and for freshers ngl just choose cse aiml is just cse with your electives pre determined"
    },
    {
      "id": "lhwh9qh",
      "body": "nah please feel free to name them and shit on them"
    },
    {
      "id": "lhwhbfl",
      "body": "real ajey is a peak gandu"
    },
    {
      "id": "lhwhc3u",
      "body": "I saw a cmnt which said, cse rr - 9.3, aiml rr - 8.6, cse ecc - 8"
    },
    {
      "id": "lhwhjbb",
      "body": "the last  cgpa for aiml was 7 he was from our class itself idk which campus tho"
    },
    {
      "id": "lhwhmsw",
      "body": "I think it was of ec campus, coz 4 seats were vacant at last in ecc aiml"
    },
    {
      "id": "lhwj8bl",
      "body": "No way this is ec campus it has to be rr na?"
    },
    {
      "id": "lhwkelr",
      "body": "No offence but you haven't even joined college yet. Why do so many of you kids come here and behave as if you're experts on everything."
    },
    {
      "id": "lhwkvxh",
      "body": "This is a fucking lie. Pls tell me u can go sit wherever u want next day and this is just stunt"
    },
    {
      "id": "lhwkzad",
      "body": "Dude, what did I even say? \n\nI'm genuinely asking this? Why did aiml in rr have a higher gpa cutoff than ecc cse? Isn't ecc good or smtg? I ain't behaving as an expert.. I actually asked this question a lot of times, but I didn't get a genuine answer... What does rr have that ecc doesn't? Why do students choose rr aiml than ecc cse? Coz cse>>aiml right.. Everyone knows this.. Just whyyyyy?"
    },
    {
      "id": "lhwl7bk",
      "body": "No no, this guy has kept his name as his username"
    },
    {
      "id": "lhwlc73",
      "body": "is this btech ?"
    },
    {
      "id": "lhwlugc",
      "body": "Not singling you out dude chill. I've just seen too many 12th grade kids here pretending they know everything.\n\nRr infrastructure is better and also has the advantage of metro connectivity. Ig that's why people prefer it."
    },
    {
      "id": "lhwm4w2",
      "body": "Do rr and ec campus have same HOD?"
    },
    {
      "id": "lhwm88x",
      "body": "Haha no you wish lmao its the same for bba, and its prolly worse for them cuz they've got the uniform thing goingðŸ¤¡"
    },
    {
      "id": "lhwm97l",
      "body": "RR's management is also bad or what?"
    },
    {
      "id": "lhwq2ir",
      "body": "Btech students also need to wear uniform daily?"
    },
    {
      "id": "lhwqqqg",
      "body": "they say if we don't sit in place , they'll cut attendance...the good ol' threat"
    },
    {
      "id": "lhwqsnt",
      "body": "Feels like school? This **is** a school not a university."
    },
    {
      "id": "lhwr8w5",
      "body": "pretty simple RR campus is still the main campus, why would people go to BITS HYD if they getting BITS PILANI, RR is also the ladla of dore they get the better fests and infra than us, doesnt mean EC is bad and you talking shit about EC CSE aint facts boss, everybody in PES knows AIML was made to increase CSE seats and make more money, the 2nd year syllabus for CSE and AIML is the same no difference. why CSE>>> AIML is also simple it gives you more choice instead of being bound to CSE with AIML . EC campus has wayyy better events and clubs than RR , the fests are wayy better in RR than EC"
    },
    {
      "id": "lhwrdwr",
      "body": "What course r u in?"
    },
    {
      "id": "lhwrn0p",
      "body": ">you talking shit about EC CSE aint facts boss\n\nWhere did I talk shit? \n\nBtw, thanks for this genuine answer and this was much needed.."
    },
    {
      "id": "lhwrsaf",
      "body": "Bro what the fuck. My school was better than this shit.Â \nWhy they gotta do this"
    },
    {
      "id": "lhwsd3a",
      "body": "i assumed you were talking shit cause you got downvoted to oblivion, if you weren't my bad bruh"
    },
    {
      "id": "lhwt1wv",
      "body": "People just downvote if the comment is getting downvoted.. Anyways, thx for the ans"
    },
    {
      "id": "lhwtgml",
      "body": "No uniform is only for the commerce department"
    },
    {
      "id": "lhwtkt2",
      "body": "brother one thing to keep in mind about this college is that no student will rag you cause management rags all of us. doredaddy loves making our lives miserable"
    },
    {
      "id": "lhwtp9i",
      "body": "Lol should I be happy or sad?"
    },
    {
      "id": "lhwttb3",
      "body": "Even my school allowed us to sit wherever we wanted wtf"
    },
    {
      "id": "lhwxoed",
      "body": "Thank God I'm outta this place"
    },
    {
      "id": "lhx1zoq",
      "body": "Which stream is this"
    },
    {
      "id": "lhx3be3",
      "body": "RR campus ka naya RR"
    },
    {
      "id": "lhx6e81",
      "body": "Lmao big brain move"
    },
    {
      "id": "lhx72ql",
      "body": "5th sem bba guy here. We are told to sit like this but none of us actually do"
    },
    {
      "id": "lhxarjb",
      "body": "Truer words have never been spoken\n\n\nHow to prevent ragging in your college? Cut the middleman, and rag the students directly"
    },
    {
      "id": "lhxhjs5",
      "body": "Thank God I've graduated ðŸ˜‚"
    },
    {
      "id": "lhxp5y5",
      "body": "Give some fking info, which campus which branch"
    },
    {
      "id": "lhxq3ky",
      "body": "Nope"
    },
    {
      "id": "lhxq6m1",
      "body": "bcom??"
    },
    {
      "id": "lhxtijx",
      "body": "are u in physics cycle ?"
    },
    {
      "id": "lhxtpra",
      "body": "ðŸ“ŒB.com , RR campus"
    },
    {
      "id": "lhxu76h",
      "body": "That's relieving to hear\nOnly issue is I'm a cs guy(going to be)"
    },
    {
      "id": "lhyd91g",
      "body": "Ig y'all can sit wherever if it's a guest lecturer's class... Btw looks like G section lol"
    },
    {
      "id": "lhyehe4",
      "body": "Thank god I didn't join pes. It would be like school once again"
    },
    {
      "id": "li1gcjy",
      "body": "We can sit next to a girl that way /s"
    },
    {
      "id": "li25fuy",
      "body": "Bba .... btech hadnt started"
    },
    {
      "id": "li2v0dn",
      "body": "I'm going to be a CS guy too. This almost made me cry."
    }
  ]
}