{
  "id": "1erbf55",
  "title": "NEED HONEST ADVICE PLS!!!",
  "content": "I got 7.6 CGPA now and im in 5th sem , how can i increase it upto a decent level,  atleast so that i could attend most of the tier 1 interviews and is CGPA really important (ik its important , but how much )  ",
  "metadata": {
    "author": "Zealousideal_Gur5959",
    "url": "https://www.reddit.com/r/PESU/comments/1erbf55/need_honest_advice_pls/",
    "permalink": "/r/PESU/comments/1erbf55/need_honest_advice_pls/",
    "score": 12,
    "created_utc": 1723564317,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lhxxd9v",
      "body": "for tier 1s yeah you need 8+ for most of them"
    },
    {
      "id": "lhxyys8",
      "body": "Choose easy electives and study for ISAs and don't mess with teachers."
    },
    {
      "id": "lhy4wfg",
      "body": "If I'm not wrong as long as you have a 7CGPA with no backlogs you'd be eligible for 90% of the companies.\n\nYou might be surprised, it's tier 1 companies that don't care about CGPA much because they know anyone can by heart stuff and pour it down on a piece of paper.\n\nIt's only (good) startups that require you to have an 8+ CGPA."
    },
    {
      "id": "lhymvss",
      "body": "Keeping it above 7.5 is good enough. Just don't do worse and you'll be fine. Ideally, get it to 8+ \n\nSem 7,8 really really help to get your GPA up in the end, but by sem 8 you're already placed in the internship.\n\nSo for now in sem 6 just get the best grades you can. \n\n>is CGPA really important (ik its important , but how much)\n\nFor tier 1 placements 7.5+ is generally fine. You won't get disqualified. Mostly 8+ get selected, but really just depends on skills. Skills (proven via projects, research, etc.) >>> GPA anyday."
    },
    {
      "id": "li3nlhk",
      "body": "You don't have to worry. Most companies require at least 6.68 to go to placements. You're in the clear. If  you're really worried about gpa take easy electives and focus on your studies so that your gpa doesn't slip."
    },
    {
      "id": "lj6jtjs",
      "body": "You have three subjects to pull it up. You are way above average so you're in the clear."
    },
    {
      "id": "m06dvwf",
      "body": "What are the easy electives"
    },
    {
      "id": "m06w5eg",
      "body": "That depends on your branch. I look Biotechnology"
    }
  ]
}