{
  "id": "1etq4un",
  "title": "Pes ece (rr) or Pes cse (ec)",
  "content": "I have to choose in either of these can anyone guide me which one to go for.   \nEven though cse has better placements anyday but I have heard pes ec peer groups and faculty standards are quite low . Honestly I am really confused . Your opinion would help me to choose one :)) ",
  "metadata": {
    "author": "Lopsided_Pilot1901",
    "url": "https://www.reddit.com/r/PESU/comments/1etq4un/pes_ece_rr_or_pes_cse_ec/",
    "permalink": "/r/PESU/comments/1etq4un/pes_ece_rr_or_pes_cse_ec/",
    "score": 0,
    "created_utc": 1723818247,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "liet4xn",
      "body": "Are you interested in ece ?"
    },
    {
      "id": "liev1sm",
      "body": "Not really since ece ppl also have same opportunities as cse students . And RR campus is better than electronic city i heard ."
    },
    {
      "id": "liev3bm",
      "body": "Not really since ece ppl also have same opportunities as cse students . And RR campus is better than electronic city i heard ."
    },
    {
      "id": "liewb9u",
      "body": "Unless you're interested in ece, this is a no-brainer\n\nFaculty are kinda bad in both campuses, but that doesn't mean *all* teachers are bad.\n\nI don't know why people on this subreddit think the \"peer\n group\" in ec is bad  , the median for ec campus cs last year was 12lpa and the median for rr campus cs was like 12.6 lpa , so yes rr campus has a (slightly) better peer group , but in the grand scheme of things how much does that really matter?\n\nECE placements aren't really the best in pes in general"
    },
    {
      "id": "liewdmk",
      "body": "Both campuses r objectively the same. Did you bother reading any of the tens of posts that list out the difference b/w the campuses ? If not id suggest u do that. And taking ece if you aren't interested in it dosent really make sense as cse has better placements. (I'm assuming ur interested in neither ece or cse). And afaik the placements r combined for both rr and ece with no bias (again this is isn't first hand knowledge, almost everyone has assured me that they r the same though)"
    },
    {
      "id": "liexpsj",
      "body": "Ohh alright. One more question since you are a senior how are the peer group and your seniors as well are they friendly and helpful. For me club intrest more and want to join various club especially the aerospace related clubs since my intrest is towards aerospace are there aerospace clubs in ec too."
    },
    {
      "id": "lieykmz",
      "body": "I'm not a senior. I'm joining this year as well. As i said whatever I mentioned is second hand information from verified seniors."
    },
    {
      "id": "lieylzz",
      "body": "Ohh thanks for the valuable inputs."
    },
    {
      "id": "liezs16",
      "body": "Ohh alr so what are you planning to join to?"
    },
    {
      "id": "lif6jzx",
      "body": "CSE>>>>>>ECE. Especially in PES. If you can get CSE over ECE, you should not even think about it. ECE sucks in both campuses and even in placements, most of the ECE students just get CSE jobs itself. Branch is 100 times more important than Campus. Unless you really like ECE, which I'm guessing you don't, you should 10000% go for CSE"
    },
    {
      "id": "lif7kw3",
      "body": "Just looking at the package ECE students got doesn't really paint the full picture. They might have got 12 lpa median but most of those companies will be software companies. And if it's software companies, then if you compare it with CSE's median, you'll see a big difference no? ECE students don't get placed in a lot of core companies and if they're going for software, then CS is a way better choice"
    }
  ]
}