{
  "id": "1etrenw",
  "title": "Seeking other freshers!",
  "content": "Let's be friends and get to know each other, comment your branch",
  "metadata": {
    "author": "FriendlyMango80",
    "url": "https://www.reddit.com/r/PESU/comments/1etrenw/seeking_other_freshers/",
    "permalink": "/r/PESU/comments/1etrenw/seeking_other_freshers/",
    "score": 13,
    "created_utc": 1723821246,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lif68ww",
      "body": "I'll be an upcoming fresher in ec campus but yeah it'll be good to have friends in this uni beforehand. So do dm me"
    },
    {
      "id": "lif8xvt",
      "body": "Me too! I'm an upcoming fresher at PES EC campus. Feel free to DM, it would be great to connect before college starts!"
    },
    {
      "id": "lifaglf",
      "body": "I say there should be a insta gc or something of the freshers, btw I’m in the EC campus"
    },
    {
      "id": "lifaopo",
      "body": "There's a pesu discord server. You should join it, it'll help with study material and connecting with a lot of ppl"
    },
    {
      "id": "lifbi2v",
      "body": "I joined it and you had to verify that you’re a student of Pes, can you tell what ID we’re supposed to put in cuz I put in my PRN and it was invalid"
    },
    {
      "id": "lifev0u",
      "body": "Hey! I'll be joining ec campus this year. Let's connect."
    },
    {
      "id": "lifgsxn",
      "body": "Rr campus blr resident and I’ll be joining pes cs ai mL"
    },
    {
      "id": "lifgwxw",
      "body": "There is also an option to login through pesuacademy, try that."
    },
    {
      "id": "lifh2h1",
      "body": "There is also a discord server for the 28' batch. Join!  \n[https://discord.gg/3ravKMVa](https://discord.gg/3ravKMVa)"
    },
    {
      "id": "lifm7iq",
      "body": "Anyone from MSc Psychology RR campus"
    },
    {
      "id": "lifoa5b",
      "body": "Joining the EC campus for the CSE branch, looking for friends who are freshers, and wanna use their free time for some productive work of coding or something else with me 🙂\n \n\nOpen for dm"
    },
    {
      "id": "lifq15b",
      "body": "wait what? i don't remember doing anything like this. Try your SRN, nobody uses PRN. Your SRN has a format like PES2UG20ECXX. Have you got that number yet?"
    },
    {
      "id": "lifszob",
      "body": "No I’ve not, I just have the PES22024XXXXX"
    },
    {
      "id": "liftu5j",
      "body": "Hi, I'm a freshman at PES EC campus, surely would like to know you guys."
    },
    {
      "id": "lifwyuq",
      "body": "Same"
    },
    {
      "id": "ligqo21",
      "body": "Same but I’m taking ece"
    },
    {
      "id": "lih0jh7",
      "body": "+1"
    },
    {
      "id": "lih0n8o",
      "body": "Ayyo you a football fan?"
    },
    {
      "id": "lih0qat",
      "body": "DE BRUYNE IS THE BEST"
    },
    {
      "id": "lih0tu3",
      "body": "Eh debatable"
    },
    {
      "id": "lih0wfw",
      "body": "Did you watch the manu match? W signing imo"
    },
    {
      "id": "lih18rg",
      "body": "Real, maguire played great, onana made no mistakes, mount looked determined, Martinez played well too, I’d say add a little more attacking prowess and utd could easily compete for the top 4"
    },
    {
      "id": "lih1l1i",
      "body": "De ligt and that other fullback. Gonna be good but i feel de ligt might loose his form. Madrid match was good too, atlanta defender tried to dribble in his own post line😭😭"
    },
    {
      "id": "lih1vqr",
      "body": "Dude tbh, I have little to no hopes from de ligt, I mean he’s a great player but he hasn’t stayed at a single club for more than 3 seasons which is questionable and Madrid was way too good for Atlanta lmao"
    },
    {
      "id": "lih251v",
      "body": "Laliga imo is gonna be lit. Barca madrid and athletico, all have formed good attacking thirds. But yk who's gonna top the table(🐢)"
    },
    {
      "id": "lih4heh",
      "body": "Idk about barca man, the olmo signing was good but they already have players at that position plus olmo struggles with injuries, atletico might be good this season as they have made somewhat smart moves in the market"
    },
    {
      "id": "lih5b5s",
      "body": "No proper left winger and holding midfielder😭. I really wish kessie was still in Barca, used to score bangers"
    },
    {
      "id": "lih5mc2",
      "body": "Barca is depending a little too much on a 16 yr old, they should’ve signed a striker as lewa is inconsistent"
    },
    {
      "id": "liiclwr",
      "body": "Hello there\nCse ring road campus"
    },
    {
      "id": "liiln55",
      "body": "Hey everyone! I'm joining PES ECC. Feel free to DM. Cheers!!"
    },
    {
      "id": "liip8gq",
      "body": "heyy im joining ec campus cse"
    },
    {
      "id": "liiqpx0",
      "body": "Die hard united one yea"
    },
    {
      "id": "liir6t2",
      "body": "Hi bro i will be upcoming fresher in eccampus ece  branch"
    },
    {
      "id": "liiz1ya",
      "body": "Ec campus cse, would love to make friends before college starts"
    },
    {
      "id": "lij2zau",
      "body": "Make off insta gc send a link"
    },
    {
      "id": "lij5duc",
      "body": "Same"
    },
    {
      "id": "lij5mu6",
      "body": "Hey there\nI'm joining rr campus cse branch!! Would be pretty cool to know ppl before classes. Thanks for posting this, I'm sure it'll be helpful."
    },
    {
      "id": "lij5p2q",
      "body": "Do u mind if I DM you?"
    },
    {
      "id": "lijgivf",
      "body": "Dang that must have been a hard journey lol but kudos to you for sticking around man"
    },
    {
      "id": "lijhsy3",
      "body": "Hey! Me too! But my branch is cse with aiml"
    },
    {
      "id": "lijkod2",
      "body": "Do u wanna dm"
    },
    {
      "id": "lijkuun",
      "body": "Ohhh then maybe you need to wait for your srn. Or dm some mod"
    },
    {
      "id": "lijyzif",
      "body": "DMed you"
    },
    {
      "id": "lijz3a3",
      "body": "DMed you"
    },
    {
      "id": "lijz7w8",
      "body": "DMed you"
    },
    {
      "id": "lijze0x",
      "body": "DMed you"
    },
    {
      "id": "lik0otj",
      "body": "yup"
    },
    {
      "id": "lik22mi",
      "body": "Hey!\nI'll also be mostly joining ec campus but for some reason I'm not able to dm you, possibly cuz I've just created my own reddit account... feel free to dm me!"
    },
    {
      "id": "lik4an7",
      "body": "Even me but I'll be in hostel"
    },
    {
      "id": "likiapp",
      "body": "I was born one and I will die one, I also follow bayern quite hard so it’s kind of ok lol"
    },
    {
      "id": "likig9p",
      "body": "Ahh yes the perfect balance lmao"
    },
    {
      "id": "likij67",
      "body": "You a football fan to?"
    },
    {
      "id": "likipai",
      "body": "Yep, been a Madridista for a good 11yrs now"
    },
    {
      "id": "likiswd",
      "body": "Oof will dm now :)"
    },
    {
      "id": "likiwm0",
      "body": "Yeah sure"
    },
    {
      "id": "likjbbh",
      "body": "Can I dm?"
    },
    {
      "id": "likmayu",
      "body": "Yes ofc"
    },
    {
      "id": "likmfih",
      "body": "https://ig.me/j/AbabzAtQl5QoHLap/"
    },
    {
      "id": "likmg94",
      "body": "All freshers please join this"
    },
    {
      "id": "likmw6r",
      "body": "Created an insta gc link is here and I’ve put is as a post join when you can"
    },
    {
      "id": "likn775",
      "body": "Join this \n[insta gc](https://ig.me/j/AbabzAtQl5QoHLap/)"
    },
    {
      "id": "likn9vx",
      "body": "Done :)\n\n[Insta GC](https://ig.me/j/AbabzAtQl5QoHLap/)"
    },
    {
      "id": "liknc0y",
      "body": "Join this\n\n[Insta GC](https://ig.me/j/AbabzAtQl5QoHLap/)"
    },
    {
      "id": "lil36w2",
      "body": "Y'all make a group or something "
    },
    {
      "id": "lil5ufe",
      "body": "maybe theres an whatsapp group, ill let u know when i get in"
    },
    {
      "id": "lj09dwb",
      "body": "Sure anytime"
    },
    {
      "id": "ljf5dw6",
      "body": "Hey there, I'm joining ec campus cse branch?!! it would be nice to make friends before joining"
    }
  ]
}