{
  "id": "1eujojn",
  "title": "which would be better",
  "content": "I wanna pursue masters in abroad in cse realated branches, which would be better, I've heard that nit gets preference during masters, so according to that which would be better\n\n[View Poll](https://www.reddit.com/poll/1eujojn)",
  "metadata": {
    "author": "itzmee__hi",
    "url": "https://www.reddit.com/r/PESU/comments/1eujojn/which_would_be_better/",
    "permalink": "/r/PESU/comments/1eujojn/which_would_be_better/",
    "score": 0,
    "created_utc": 1723906692,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "likp2ga",
      "body": "lol and people are arguing in the subreddit whether aiml specialization will lead to straight rejects lmao.\n\nIf you want to do MS in CS pursure ur bachelors in CS you will get straight rejects unless you prove youself with Experience in IT field"
    },
    {
      "id": "likpb9t",
      "body": "oh got it, but will the nit tag help in anyway? coz I can take get nit nagaland cse also"
    },
    {
      "id": "likpyuq",
      "body": "you can switch streams for masters tho right? like from UG in ECE to masters in CSE?"
    },
    {
      "id": "likqz7k",
      "body": "it will definitely help but its not like THE deciding factor for admissions. Your focus should be Working on research ,publishing papers ,getting strong LORs from professors , good gre scores , good cgpa (v important factor when it comes to tiebreakers) etc . People from PESU which is not IIT/NIT but have focused on these things have gone on to get admits from Universities like CMU which is like best in the world for CSE and have gone on to achieve more than an average IITian."
    },
    {
      "id": "likrjue",
      "body": "like i said you will need to prove you can cope with a ms in cs with work experience. I think the chances are very bleak for top universities with cut throat competition."
    },
    {
      "id": "likrmzs",
      "body": "oh that's reassuring thanks mate"
    },
    {
      "id": "liks4t9",
      "body": "one last q, pes cse would be better than nit nagaland cse right?"
    },
    {
      "id": "likuwb1",
      "body": "Focus on the things I mentioned bro for MS admissions perspective, admission mainly depends on you. If you want placements as a backup then pick which ever has better stats ig . \n\nRead about nit nagaland , how the proffs are , if they are willing to offer you some kind of research experience , publish papers, give strong LORs if thats the case then you will get similar outcomes from both places."
    }
  ]
}