{
  "id": "1euodta",
  "title": "I guess I did a mistake",
  "content": "I picked pes ec cse instead of nit meghalaya cse(I wasn't aware I could get that) and I guess I fucked up. I don't know what to do anymore and feels like life is just messed up rn.",
  "metadata": {
    "author": "itzmee__hi",
    "url": "https://www.reddit.com/r/PESU/comments/1euodta/i_guess_i_did_a_mistake/",
    "permalink": "/r/PESU/comments/1euodta/i_guess_i_did_a_mistake/",
    "score": 10,
    "created_utc": 1723919062,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "liln80s",
      "body": "What's done is done , atleast you are still ending up with a Tier 2 CSE"
    },
    {
      "id": "lilnw6x",
      "body": "well you may think of this as copium   \nbut going so far from home ( assuming you are from karnataka)   \nfor not even a mid tier nit is not worth it man  \n[also found placement stats from 2 years back looks like they have similar level of placements as pesu](https://www.reddit.com/r/Btechtards/comments/x6807l/comment/in67xq7/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)  \nso yeah you didnt make a bad choice in any way"
    },
    {
      "id": "lilot7j",
      "body": "yah doesn't the placement stats look better?😔"
    },
    {
      "id": "lilpcsr",
      "body": "but nit meghalaya would've been better right?"
    },
    {
      "id": "lilpp4u",
      "body": "Obv , that's a big regret . You missed NITs tag and what not , but what can one do now  !?"
    },
    {
      "id": "lilunqz",
      "body": "Bhai same but I missed out on NITK mech"
    },
    {
      "id": "lilv3kn",
      "body": "Fuck nitk mech is absolutely worth it. \nCrowd, learning opportunities and just abt everything is amazing at nitk.\nI read some post the other day abt some guy taking pes cs over nitk mech or civil. Hope he doesn't regret it"
    },
    {
      "id": "lilvdkt",
      "body": "Was getting in csab.\nFool me missed out on it.\nRegretting now.\nWill go for partial drop ig? Maybe I'll see ."
    },
    {
      "id": "lily5dg",
      "body": "bro i left nit agartala cse for pes cse. because north east isnt the best for clg life. +home state quota will bring people with very less rank. pes has good placements + banglore life.+ girls(if you are male). your clg life will be better, in banglore."
    },
    {
      "id": "lilybct",
      "body": "hey even i am doing partial from pes, even i left nitk mech, nit agartala cse. i was a clown."
    },
    {
      "id": "lim18rt",
      "body": "I fucked up man"
    },
    {
      "id": "lim1cjf",
      "body": "nit meghalaya would've been better, I just gotta digest the bitter truth"
    },
    {
      "id": "lim8bm1",
      "body": "Honestly, Idts you're really missing out on anything. All the north east Nits except silchar and maybe Agartala are worse than Pes. Ik many people, including myself, who left North East nit cs seats for other colleges that don't have the 'nit' tag(Explains the absurdly low cutoffs for NE ). The peer group at Nit meghalaya would be significantly worse than pes due to the hs quota and the cutoffs go north of the 2 lakh mark"
    },
    {
      "id": "lim9lw1",
      "body": "How are you planning to do partial with pes, can you give a brief idea? Even I wanted to but seniors told it's hard to maintian cgpa here."
    },
    {
      "id": "lio3hki",
      "body": "I don't think partial is possible from pes.\nBecause they keep your documents during admission and return after 4 years.\nSo if you leave after 1st year they won't return docs until you pay full 4 years fees."
    },
    {
      "id": "lio4r9m",
      "body": "At least you are getting cse. Be happy with that. . i got ece . "
    },
    {
      "id": "lio5vel",
      "body": "They gave my documents back after one year. Have they changed it to 4 years?"
    },
    {
      "id": "lio64zm",
      "body": "That's not legally possible so dw"
    },
    {
      "id": "liodhy0",
      "body": "Wait really?\nCoz I've seen some people saying that partial drop isn't possible there due to the reason I mentioned."
    },
    {
      "id": "liof24g",
      "body": "Nah comedk colleges hesitate to return documents ig\nPesu returns original documents after 1 year"
    },
    {
      "id": "liof6kk",
      "body": "Partial drop from pes is hard I've heard. Pes is demanding and has lots of workload apparently."
    },
    {
      "id": "liog9qe",
      "body": "Nit meghalaya is bad lmao take a look at the reviews online"
    },
    {
      "id": "lip16ci",
      "body": "Don't feel bad, you can just say that you didn't want to leave Karnataka. Not like you are missing NITK Surathkal."
    },
    {
      "id": "lipjcat",
      "body": "It's almost impossible from pesu seniors have told.\nSo I'm going bmsce, it's a decent clg and return documents after sem1. And have loads of free time."
    },
    {
      "id": "lipjde8",
      "body": "Yes.\nSo decided on bmsce."
    },
    {
      "id": "lipknn2",
      "body": "ohh so ur doing partial from bms? So how u planning to study for jee alongside? btw what are ur target colleges for next yr?"
    },
    {
      "id": "liqcbba",
      "body": "You haven’t done anything wrong. You're going to study a cutting-edge, world-class syllabus in CSE. I assure you that the placement opportunities are among the best in India. Don’t worry about missing out on another branch in NIT; this program is comparable to the top NIT CSE courses. If you’re among the top 100 students, you could secure a package of 30 LPA or more. After 2 to 3 years of experience, your skills will matter more than the college you attended. Some people might comment, \"Oh, you’re from NIT,\" but if you don’t land a good placement, the same people might say you got into NIT by luck. Focus on your studies instead of the college name. PES University is an excellent choice for CSE. Don’t regret it—focus on your studies."
    },
    {
      "id": "liqm7is",
      "body": "DM?"
    },
    {
      "id": "liuh4si",
      "body": "Placements depend on you not the college. Top companies and top offers come to PES as well. It's up to you, how you build your resume and portfolio of projects and skills. \n\nI always believe looking at a college's placement stats is absolutely useless. If you're good you'll get placed regardless. \n\nFrom your post it comes across as though you aren't looking for advice but more so for sympathy when really there isn't any need for it. \nNIT Meghalaya at the end of the day is in Meghalaya. PES is in an excellent part of Bangalore, you are only just starting your college life and so you may feel that the supposed prestige of an NIT is more important to you. \n\nBut I can guarantee that your college life will be very different from your expectations and you may even change your future goals radically as you get exposed to newer fields and technologies. \n\nKeep an open mind. PES offers a very up to date curriculum, exposure to the top companies and many alumni of PES are pursuing their Masters or MBAs in top universities across the world. \n\nIn short, stop whining, your life is only getting started, focus on making it what you want it to be. Remember you decide your outcome not the college. PES allows you to be academically focused while also having some kind of a social life (which you'll soon realise is extremely important).\n\n\nBeing in Bangalore is also an added advantage as all companies are located here, the move from Engineering to a job won't be as dramatic."
    },
    {
      "id": "liw1fb1",
      "body": "I think I fucked up right bro, nit meghalaya is bs. "
    },
    {
      "id": "liw1x9d",
      "body": "u in not meghalaya?"
    },
    {
      "id": "liw2f6j",
      "body": "What?"
    },
    {
      "id": "liw37an",
      "body": "are you in nit meghalaya?"
    },
    {
      "id": "liw5c20",
      "body": "No but uk people who went to these lower nits and iits and absolutely regret it. "
    },
    {
      "id": "liw5lip",
      "body": "may I ask why?"
    },
    {
      "id": "liw5qky",
      "body": "Ouch, some of us like ece "
    },
    {
      "id": "liw6dx0",
      "body": "Yeah but cse is much better than ece and almost everyone aims for cse . ece for most people is a compromise "
    },
    {
      "id": "liw73sq",
      "body": "Unemployment and culture is weird half the kids in lower nits are from state quota so student quality is kinda bad. Ur gonna have all the downsides of gov colleges ie shit hostels and mess food."
    },
    {
      "id": "liw7rz7",
      "body": "but how is the placement stats so good,is it inflated or smth?"
    },
    {
      "id": "lj1n8wr",
      "body": "Where you see the placement stat is good? Can you show a comparison between PESU CSE vs Lower NIT CSE"
    }
  ]
}