{
  "id": "1ev4lhe",
  "title": "Any north Indians (Not from Bengaluru) joining pes this year? Through pessat or management or whatever?",
  "content": "I'm very scared that there will be no north Indians and I'll be singled out. ",
  "metadata": {
    "author": "tastypavbhaji",
    "url": "https://www.reddit.com/r/PESU/comments/1ev4lhe/any_north_indians_not_from_bengaluru_joining_pes/",
    "permalink": "/r/PESU/comments/1ev4lhe/any_north_indians_not_from_bengaluru_joining_pes/",
    "score": 0,
    "created_utc": 1723970521,
    "flair": "PESSAT/Admission",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "liovzzd",
      "body": "I love pav bhaji's ;)"
    },
    {
      "id": "liow4oz",
      "body": "Yepppp jai jagannath!!!!"
    },
    {
      "id": "liowikr",
      "body": "I am from North living in bengalore for about 2 years and will be joining pes through kcet"
    },
    {
      "id": "liowkic",
      "body": "I love cholle bhature"
    },
    {
      "id": "liox1j7",
      "body": "I've literally met more North Indians here than Kannadigas themselves. Chill."
    },
    {
      "id": "lioy8tp",
      "body": "Depends on which branch you are talking about. If it is CSE or IS or ECE its mostly north indians or malayalis or Gujaratis. If it is mechanical or civil or mechanical or aerospace then its mostly Kannadigas."
    },
    {
      "id": "lioyarr",
      "body": "How?I thought for KCET you need to have studied in Karnataka for 7 years"
    },
    {
      "id": "lioyezs",
      "body": "Man chill out there will be many, even i m joining this yr"
    },
    {
      "id": "lioynd3",
      "body": "Or u can do 11th nd 12th here nd still write it"
    },
    {
      "id": "lioys8t",
      "body": "Interesting, i didnt know that. Thank you"
    },
    {
      "id": "lip2dwa",
      "body": "Madrassis: aiyyo that is not our culchar saar 🤬🤬🤬"
    },
    {
      "id": "lip47sl",
      "body": "Why does every single comment happen to have so many downvotes lmfao"
    },
    {
      "id": "lip4bo4",
      "body": "It is applicable when you are a government employee ward"
    },
    {
      "id": "lipfbwe",
      "body": "Learn to accept and embrace cultures all over India my friend. I get that you won't get the \"homely\" feel if you can't find someone of your own. I'm pretty sure you'll find enough North Indian people in the campus. Make friends with south indian people too :))"
    },
    {
      "id": "lipfqcq",
      "body": "Juniors are brigading on all the posts on this sub for no reason"
    },
    {
      "id": "lipp76y",
      "body": "There's a lot of people from all around India. Don't worry"
    },
    {
      "id": "lipsk2i",
      "body": "I sure will! I was just concerned about the language barriers bro"
    },
    {
      "id": "lipxtjp",
      "body": "Just try to learn Kannada , only the basics tho , it just gives the other south India students a message that you are trying to learn the language and this is a very good for a boost in friendship"
    },
    {
      "id": "liq01g1",
      "body": "why so many downvotes 💀"
    },
    {
      "id": "liq0dqi",
      "body": "😂 these people from karnataka are just as always being rude to North indians just ignore them"
    },
    {
      "id": "liq0zvo",
      "body": "whole thread is getting downvotes for some reason 💀"
    },
    {
      "id": "liqgwms",
      "body": "Bro just say \"kannada gothilla\" It means I don't know kannada and they will start communicating in English"
    },
    {
      "id": "liqj4vp",
      "body": "Okay! Thanks"
    },
    {
      "id": "liqmgsq",
      "body": "No offense.. But a slight change in the way u approach would be greatly appreciated.. Instead of saying 'kannada gotilla which implies u don't know the lang.. U can say ' kannada kalitha idini' instead which means ur learning the language.. Those small efforts would make a whole lot of difference.. \nNonetheless, be chill, just like others hv already told, majority of us, would be welcoming and embrace u n ur lang, culture, just like hw bengaluru has always been"
    },
    {
      "id": "liqmqom",
      "body": "💯"
    },
    {
      "id": "liqrjn1",
      "body": "Thanks for helping 🙃"
    }
  ]
}