{
  "id": "1ev69v9",
  "title": "which would be a better pick",
  "content": "\n\n[View Poll](https://www.reddit.com/poll/1ev69v9)",
  "metadata": {
    "author": "itzmee__hi",
    "url": "https://www.reddit.com/r/PESU/comments/1ev69v9/which_would_be_a_better_pick/",
    "permalink": "/r/PESU/comments/1ev69v9/which_would_be_a_better_pick/",
    "score": 1,
    "created_utc": 1723977675,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "liq5upf",
      "body": "The question is do you really wanna go to meghalaya?\nNobody would speak your language there and it's not like hyderabad or Chennai which are just a train ride away. You'd have to spend a lot of money flight tickets. \nThere's gonna be a culture shock for you.\n\nI personally wouldn't go to meghalaya just for the nit tag even though it is cse just cause of the language and culture thing.\n I can't really speak about nit meghalaya's placements stats but I can assure they are nothing like top nits, dtu, nsut etc. \nIf you wanna know about pes' placements stats you can just search them up on the sub"
    },
    {
      "id": "liqmapr",
      "body": "but the nit tag will help during masters right"
    },
    {
      "id": "liqvr8f",
      "body": "i dont think it would."
    },
    {
      "id": "liqy4iu",
      "body": "fr? coz like I've been regretting not picking nit meghalaya for this reason"
    },
    {
      "id": "lir42fr",
      "body": "So let me get this straight, you've already made the decision? If you have, just live with it."
    },
    {
      "id": "litm41d",
      "body": "No Indian uni will help you in masters on its own"
    },
    {
      "id": "liuaj9g",
      "body": "oh so the tier 2 nit won't give me any sorta tag preferences?"
    },
    {
      "id": "liumd36",
      "body": "pretty much"
    },
    {
      "id": "liumh53",
      "body": "calling nit Meghalaya tier 2 is bit of a stretch."
    },
    {
      "id": "liut98d",
      "body": "tier 3* and I'm hoping that it's gonna be of no help during masters."
    }
  ]
}