{
  "id": "1evj276",
  "title": "Why is academics here comparatively tougher than other comedk colleges?",
  "content": "What makes the difference? Is it tougher question papers or grading? ",
  "metadata": {
    "author": "grinderOP",
    "url": "https://www.reddit.com/r/PESU/comments/1evj276/why_is_academics_here_comparatively_tougher_than/",
    "permalink": "/r/PESU/comments/1evj276/why_is_academics_here_comparatively_tougher_than/",
    "score": 7,
    "created_utc": 1724012915,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "litwsog",
      "body": "Comparatively tougher syllabus, ofc tougher QPs and complex grading system(u must do so many things apart from the final sem exam to score a decent grade) and shittier evaluations together contribute to shitter grades"
    },
    {
      "id": "liu6rei",
      "body": "Even if you finish the all slides/classnotes which is a lot, questions in the exam wont come straightforward. In the exams the focus is on Understanding of the concept and logical thinking and application of concepts theyve taught. Very few subjects in CSE course are theoretical and Memorization based. There are assignments, quiz for lab components , 2 internals, 1 end semester and a mini project for each subject. All these together will contribute to determine your final grade. Scoring even 8 cgpa will require consistent efforts throughout the semester. In comedk colleges you should be able to get 8 or even 9 by studying even just 2 days before the exam, it all comes directly from previous year papers."
    },
    {
      "id": "lium4e0",
      "body": "pes is not even there in comedk right."
    },
    {
      "id": "livqym6",
      "body": "Very difficult I must say\nI know so many people who consistently scored good till 12th but are struggling here\nIt's all about how regularly u study nd how logically u apply those concepts"
    },
    {
      "id": "liwhab7",
      "body": "was that his point?"
    }
  ]
}