{
  "id": "1evvc9g",
  "title": "Pes or thapar?",
  "content": "I have cse core in both which will be better for placements and masters abroad?",
  "metadata": {
    "author": "Simple-Antelope5228",
    "url": "https://www.reddit.com/r/PESU/comments/1evvc9g/pes_or_thapar/",
    "permalink": "/r/PESU/comments/1evvc9g/pes_or_thapar/",
    "score": 3,
    "created_utc": 1724050580,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "liu7g6j",
      "body": "If through cet then pes, if through pessat then thapar"
    },
    {
      "id": "liu92zp",
      "body": "why do I see you everywhere"
    },
    {
      "id": "liu9bbt",
      "body": "Clg hasn't started brudda, what else can I even do other than shitting around in some random subs.."
    },
    {
      "id": "liu9gj7",
      "body": "😂😂"
    },
    {
      "id": "liucxm8",
      "body": "Academics and placements is essentially equal.\nI would just take pes, being in Bangalore makes internships easier. \nPlus Punjab....."
    },
    {
      "id": "liudofn",
      "body": "Being in blr doesn't make a clg better my bro🤓\n\nThere are shit ton of other clgs as well, is it any easier to get internships from those clgs? You have to thank pes here for giving better opportunities not banglore, ofc blr gives you some added benefit but that should not be the sole reason to choose some clg.."
    },
    {
      "id": "liujwdg",
      "body": "I mean both are not that much different in placements so its the small things that can tip the scale towards one or the other. "
    },
    {
      "id": "liukjk1",
      "body": "Nah man thapar is chill asf, not academically as strict as pes.. So thapar would be better coz the fee is similar with a better clg life and less competition (pes literally has 2160 kids in cse, so that's a huge num), in every aspect thapar is still leading pes.. If op is admitting thru kcet then pes>>> but if thru pessat he should consider thapar.."
    },
    {
      "id": "liul03y",
      "body": "See ur just telling him to decide based on price difference, which I don't he should worry about unless he is breaking the bank for it. The money u save is gonna be insignificant in ur career that's gonna last decades. He should just go to the one that's better, whichever that is."
    },
    {
      "id": "liul52d",
      "body": "Dude money was the only factor supporting him to take pes, if money is not at all a problem then thapar leads pes in every fucking aspect.."
    },
    {
      "id": "liulcim",
      "body": "U urself said placements are pretty close."
    },
    {
      "id": "liulew4",
      "body": "Yeah, that's why i told him to choose thapar coz a mix of both placements and clg life.."
    },
    {
      "id": "liv3ues",
      "body": "Go for Thapar"
    },
    {
      "id": "lyxanxm",
      "body": "Siddhu Mossewala"
    }
  ]
}