{
  "id": "1evxjv3",
  "title": "CURRENT PES",
  "content": "3nd and 5th Sem Introduction ",
  "metadata": {
    "author": "Stealth_Whiz",
    "url": "https://www.reddit.com/gallery/1evxjv3",
    "permalink": "/r/PESU/comments/1evxjv3/current_pes/",
    "score": 51,
    "created_utc": 1724060052,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "liun2po",
      "body": "Lol for us in the orientation they showed almost 18% people have 9+ cg in cse"
    },
    {
      "id": "liuo9ox",
      "body": "What’s the difference between scholarship offered vs secured"
    },
    {
      "id": "liuu2c2",
      "body": "Simply means the uni offers X number of scholarships, but only Y students actually met the conditions to secure it, i.e., they were awarded the scholarship."
    },
    {
      "id": "liuuc4i",
      "body": "Thanks for sharing the data. Good to see median compensations still above 10 LPA. \n\nBut looks like a third of the students haven't been placed. Anyone on campus know more about the situation?"
    },
    {
      "id": "liuwi2f",
      "body": "From which semesters these scholarships are applicable? Are freshers eligible for any scholarship in 1st semester?"
    },
    {
      "id": "liuzd5n",
      "body": "So, the placements rate stand at 62.45 % for the 2024 batch."
    },
    {
      "id": "liv9r44",
      "body": "From 1st semester itself. Three types of scholarships. There's the 50 percent fee reduction, 40 percent fee reduction and another lower scholarships but idk the amount"
    },
    {
      "id": "livfo1f",
      "body": "As a 4th year student , Im curious as to what the mean by Ai in assesment and beyond. Can someone elaborate. Did we dodge a bullet?"
    },
    {
      "id": "livhtkl",
      "body": "so basically they use ai generated answer as a reference point during correction and rank the students answers based on the most similar it is to the model answer , if by chance they write a answer which is better that the ai generated one , the techer gets to star the answer marking it as better than the ai one."
    },
    {
      "id": "livhxch",
      "body": "yes from 1st sem itself you can avail all 3 scholarships."
    },
    {
      "id": "livhzfr",
      "body": "yup but still ongoing so have to see"
    },
    {
      "id": "livi4c9",
      "body": "the placements are still ongoing so have to see the finale data"
    },
    {
      "id": "livia4i",
      "body": "Hmm so basically \nThey AI is going to evaluate the ISA ESA papers to help the teachers by arranging the best to worst order and the teachers also evaluate it. Then both the evaluation are compared and mismatched ones (like questions where AI gives 4/4 and teachers give 3/4)will be re-evaluated again"
    },
    {
      "id": "livivny",
      "body": "But 2024 batch has graduated right, convocation will be in September. So the numbers should be pretty close to the finale one by now.\n\n2025 batch sure the placements have just started."
    },
    {
      "id": "livj9xk",
      "body": "Did you mean based on 1st semester grades (waiver for 2nd semester fees) or did you actually mean waiver for 1st semster fees? If it later, then what is it based on (criteria)?  \n  \nHow does it work? As students have already paid full fees for 1st and 2nd semester, will the students get a refund?"
    },
    {
      "id": "livk8bl",
      "body": "hmmm true , the vice Chancellor  guy was like placements are still going on for them and shit"
    },
    {
      "id": "livop6y",
      "body": "68.73 for cse"
    },
    {
      "id": "livxg4x",
      "body": "Oh wow our placements really did get fucked big time"
    },
    {
      "id": "livxoye",
      "body": "Wait I actually have a doubt, do students having ppos also register for placements and get placed?"
    },
    {
      "id": "livxwrf",
      "body": "They can, if they’re not happy with the ppo"
    },
    {
      "id": "livy5lr",
      "body": "The AI doesn't generate answers. The AI does the same job as the evaluator does. That is reference a model answer and set of points and verify weather these points are mentioned in the student's answer. The AI gives a final score to this answer. \n\nThen the answers are ranked in the decreasing order of answer quality on the basis of marks secured in the AI evaluation for the real human evaluator. \n\nAt the end of the human evaluator's session, if there are any miss matches between the score AI gave and the score the human gave, the human is given another chance to revisit these answers. \n\nIf the human teacher finds an answer written by a student that is better than the answer key, they are marked the star answer. They did not elaborate further on where this star answer is used. They just mentioned that this star answer, if exists, would be displayed to all the students during review. \n\nAnother AI feature mentioned is that if you have lost marks in an example, the AI system will cite the reason why you lost marks. This feature was already there for human evaluators but many did not cite a reason for cutting marks. Only a few good evaluators did.\n\nThis all sounds great but I'm worried about somebody prompt injecting and breaking it. In the current scenario, there's still a human on the way to vet your answer. But if they do eliminate this, then there'd be a problem."
    },
    {
      "id": "livy7ph",
      "body": "Coz almost 900 students got placed if u also include ppos (source the spreadsheet shared in this sub)"
    },
    {
      "id": "liw8v8o",
      "body": "7.75 is a bullshit line to be fair because companies either have 8 or 7 I haven't seen 7.75 for any company, it's maybe 80% if you have a cgpa above 8."
    },
    {
      "id": "liw96wf",
      "body": "1350 eligible for 25 batch ? Definitely horseshit because 25 batch will have more students than 24 batch."
    },
    {
      "id": "liw9tkj",
      "body": "Damn bro didn't know that shit mb I guess. I heard that guy say ai generates answer so I thought it was something like that along the line ."
    },
    {
      "id": "liwc57f",
      "body": "Dk man, I calculateed based on this and the previous data which was actually shared on this sub"
    },
    {
      "id": "liwddba",
      "body": "And what are the conditions to secure a scholarship?"
    },
    {
      "id": "liwfb4x",
      "body": "lol it sounds like we dodged a bullet lmfao. Thank god."
    },
    {
      "id": "liwz8dk",
      "body": "they'll refund a percentage (either 40 or 50, based on the scholarship you get) of that particular semester's fee. if you get the dac scholarship, you'll be given 2000 rupees"
    },
    {
      "id": "lixkvu9",
      "body": "Sad to see ECE become a shitshow"
    },
    {
      "id": "liy92hk",
      "body": "7.75+ for dac, 8.5+ for cnr, 9+ (cgpa) for mrd"
    }
  ]
}