{
  "id": "1ew8k2a",
  "title": "Seniors living in Bangalore, how do you commute to RR campus?",
  "content": "Where do you live, how do you commute, commute time?  \n  \nEg: Indira Nagar - Public Bus/PES Bus/Metro/Bike - 1 hour per side\n\nPlease feel free to elaborate about your commute experience. i.e. Pros and Cons or things to keep in mind.  \n  \nThis will help freshers to plan better.",
  "metadata": {
    "author": "ReasonableFeed2045",
    "url": "https://www.reddit.com/r/PESU/comments/1ew8k2a/seniors_living_in_bangalore_how_do_you_commute_to/",
    "permalink": "/r/PESU/comments/1ew8k2a/seniors_living_in_bangalore_how_do_you_commute_to/",
    "score": 5,
    "created_utc": 1724090526,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "liwunrz",
      "body": "Indiranagar metro station to Mysore road metro station. And then you can board the bus till college"
    },
    {
      "id": "liwv8n3",
      "body": "Does Metro offer pass for students? \n\nBy bus from metro station you mean PES Bus? How frequently they run bus from metro station or to metro station?"
    },
    {
      "id": "liwyodw",
      "body": "Bmtc bro"
    },
    {
      "id": "lix4eij",
      "body": "pes bus only   \nig you can hop on any college bus passing by"
    },
    {
      "id": "lix4gar",
      "body": "no you can hop on the pes bus as well"
    },
    {
      "id": "lixedoi",
      "body": "RR Nagar - Bike - 10 mins per side"
    },
    {
      "id": "lizb7qf",
      "body": "How much does pesu bus facility cost?"
    },
    {
      "id": "lizzkf1",
      "body": "Check the website its different for different routes and the length of the route you are travelling"
    },
    {
      "id": "lj012g2",
      "body": "Vijayanagar, 15 minutes commute each way through scooter. Roughly 7 km."
    },
    {
      "id": "lj1hxub",
      "body": "For free?🤭"
    },
    {
      "id": "lj6ijpb",
      "body": "PES RR do provide bus facilities if you want. Other routes are public transport or driving."
    },
    {
      "id": "ljyuq1r",
      "body": "I am new to Bangalore. I will be staying with my cousin in Whitefield and planning to take metro from there to Mysore road.\n\nCan you tell me   \na) Name of the BMTC bus stop near Mysore road metro station  \nb) Name of the BMTC stop near PES University  \nc) Couple of BMTC routes that goes to and fro from Mysore road metro station and PES University  \nd) How much is the fare?"
    }
  ]
}