{
  "id": "1ews7d2",
  "title": "Seniors, how do I commute to EC campus?",
  "content": "I live in Akshayanagar, and the bus route closest would be via Meenakshi Mall( 15 mins from my area) Gottigere- Nice road. And the Campus is 30 mins away from my area. So should I take this bus route or find any other way? When I enquired, they told these are the final routes.",
  "metadata": {
    "author": "DistributionDizzy297",
    "url": "https://www.reddit.com/r/PESU/comments/1ews7d2/seniors_how_do_i_commute_to_ec_campus/",
    "permalink": "/r/PESU/comments/1ews7d2/seniors_how_do_i_commute_to_ec_campus/",
    "score": 4,
    "created_utc": 1724150107,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lj0xirs",
      "body": "If you have a reliable and cheap way to reach the Meenakshi mall stop then use the college bus. \n\n\nOtherwise figure out the bmtc route or take scooter/ bike thru nice road."
    },
    {
      "id": "lj1ykyi",
      "body": "I found you driving directions from Akshayanagar to PES University E City Campus via Meenakshi Mall. The drive time is 38 minutes, which is slightly faster than the bus route you mentioned. You can see the directions[here](https://www.google.com/maps/dir/Akshayanagar,+Akshayanagar,+Bengaluru,+Karnataka,+India/Royal+Meenakshi+Mall,+Bannerghatta+Rd,+Hulimavu,+Bengaluru,+Karnataka+560076,+India/PES+University+Electronic+City+Campus,+VM67%2BHVP,+Hosur+Rd,+Konappana+Agrahara,+Electronic+City,+Bengaluru,+Karnataka+560100,+India/data=!4m20!4m19!1m5!1m1!19sChIJ6bvUfi5rrjsR1bHxnKWR7QA!2m2!1d77.6166843!2d12.8677991!1m5!1m1!19sChIJCYgAwiwVrjsRWk69HWg1HG8!2m2!1d77.595766!2d12.8757!1m5!1m1!19sChIJwb4iy7xsrjsRdl79p7cwrUs!2m2!1d77.6647081!2d12.8614515!3e0).\n\nI would recommend taking the bus route if it is available. It is often faster and more efficient than driving, especially during rush hour. If you are unsure about the bus route, you can contact the local bus authority for more information."
    },
    {
      "id": "lj2rjo5",
      "body": "Damn bike on nice road will take some guts"
    },
    {
      "id": "lj5gah0",
      "body": "If you have your own vehicle, you can just go from inside through Begur Lake road and Manipal county road and you'll reach pretty quick with barely any traffic both ways. I used to come from Hulimavu and it took me 30-35 mins to reach college. There's also the bonus of you being able to leave a bit late from your house. College bus arrives at like 6:35 I think and its a pain to wake up that early"
    }
  ]
}