{
  "id": "1exjvv7",
  "title": "What do u think pests? Is this true? ",
  "content": "Demand higher for core engineering students? ",
  "metadata": {
    "author": "Unfair-Strength272",
    "url": "https://i.redd.it/59n5mtid4zjd1.png",
    "permalink": "/r/PESU/comments/1exjvv7/what_do_u_think_pests_is_this_true/",
    "score": 50,
    "created_utc": 1724227089,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lj6e51d",
      "body": "BENGALURU: Top engineering colleges in the city have reported a higher participation from companies in campus recruitment drives this year compared to last year. Recruitment for 2025 started at the end of July and the first week of this month. According to RV College of Engineering, salaries offered this year have seen a 20-25% increase over last year.\n\nA statement from RVCE, which started its placement drive on Aug 1, said: \"There's been a good start to the recruitment drive. So far, 42 firms have visited our institution and recruited 108 candidates. Another 40 companies have confirmed their participation this time.\"\n\nIn comparison, last year, 35 firms had taken part in campus recruitment at RVCE and hired 110 students. \"The highest pay package offered to RVCE students this year is Rs 56 lakh per annum (LPA). The median salary is around Rs 19LPA as against Rs 16.57LPA last year,\" the RVCE principal said\n\n# The average salary this year is around Rs 22 LPA, while it was Rs 19.6 LPA last year,\" Subramanya added. KS Shridhar, registrar of PES University, said the college has had more than 20 companies making job offers since the first week of this month. One of the trends this year is the early onset of placements for core engineering students, Shridhar added.\n\n# \"Our students have received offers from four core companies already. Electrical, electronics, and mechanical engineering students are among those picked. The manufacturing sector is booming, while the semiconductor industry has also had a big boost,\" Shridhar added.\n\n\n\n\nBMS College of Engineering (BMSCE) said mass recruiters are also back on campuses. \"Following Covid-19, when recruitment drive was held online, companies are now back on campuses. They want face-to-face interactions and physical meetings,\" said J Sharana Basavaraja, placement officer, BMSCE.\n\n\nSavitha Rani M, training and placement officer, Ramaiah Institute of Technology, said: \"Though hiring by mass recruiters has fallen from three digits to single digits, we are seeing more international companies and good startups hiring this year. This includes five big firms from Japan.\" She added: \"Today's job market demands adaptability and continuous learning, as AI reshapes industries and creates new opportunities.\"\n\nNITTE Meenakshi Institute of Technology confirmed receiving around 30 firms more this year. \"Screenings have been tightened and offers are made to those who meet the mark,\" said Bhanurekha Reddy, director, placement and trainin"
    },
    {
      "id": "lj6e7hg",
      "body": "Highlighted statements were given by pesu."
    },
    {
      "id": "lj6eyh4",
      "body": "Want to catch them young is crazy"
    },
    {
      "id": "lj6f79e",
      "body": "Lol"
    },
    {
      "id": "lj6ffms",
      "body": "U are in every subreddit I go to lmao"
    },
    {
      "id": "lj6fk12",
      "body": "Just like doredaddy fr"
    },
    {
      "id": "lj6fkhv",
      "body": "I'm only active on r/jeeneetards, r/kcet, r/btechtards, r/pesu , wt can i do if we all are active in these subs😭😭"
    },
    {
      "id": "lj6i44o",
      "body": "At PES biotech has less placement options for the stream itself. They can join for other jobs non biotech...but without the skills its not doable. Mostly either go for higher studies or look elsewhere for placements."
    },
    {
      "id": "lj6i7mj",
      "body": "Right after rumors of KSS being fired, they include him in the newspaper. He was a great prof tho , RIP"
    },
    {
      "id": "lj6kcb3",
      "body": "This kss and that kss are different💀"
    },
    {
      "id": "lj6o7vu",
      "body": "Ain't no way, your cmnt has more upvotes than my original comment.."
    },
    {
      "id": "lj6p6kp",
      "body": "No way avg package for core branches is 20lpa"
    },
    {
      "id": "lj6pnvr",
      "body": "Bro that's RVCE's Statement"
    },
    {
      "id": "lj6pthr",
      "body": "It was of pesu"
    },
    {
      "id": "lj6q4ep",
      "body": "Still not possible even in iits it won't be that high"
    },
    {
      "id": "lj6qisa",
      "body": "The avg of 20lpa is for cse duh, it's pretty much possible"
    },
    {
      "id": "lj6qppj",
      "body": "It's not like that you don't read it like that read it properly Bro"
    },
    {
      "id": "lj6qw6b",
      "body": "What's not like that?"
    },
    {
      "id": "lj6qz0t",
      "body": "Oh but they haven't specified right\n\n\nThey topic was of core branches"
    },
    {
      "id": "lj6r4qt",
      "body": "They haven't but that was cse only ig"
    },
    {
      "id": "lj6r7k8",
      "body": "Please Ignore"
    },
    {
      "id": "lj6vgkr",
      "body": "Lmaoo 😂"
    },
    {
      "id": "lj6vm9q",
      "body": "Real. I see this person everywhere lol"
    },
    {
      "id": "lj6z37n",
      "body": "Wrong kss but does anyone know the lore of him getting fired?"
    },
    {
      "id": "lj73i8p",
      "body": "Oh yeah? Damn, this is the registrar. I didn't see :')"
    },
    {
      "id": "lj73q02",
      "body": "He made a very spicy linked in post against the CS (or AIML) HOD about how incompetent they were and their rise to the position was a fluke. The post didn't directly name anyone tho. After all this bro just got fired and pes claims his research papers were scammed and copied"
    },
    {
      "id": "ljb2apc",
      "body": "whats his full name?"
    },
    {
      "id": "ljc9keh",
      "body": "It's called contextual marketing.\nWill you join the less demand department of the college if they say we are good or when they say they got jobs before CS."
    }
  ]
}