{
  "id": "1exk800",
  "title": "Help from seniors on deciding budget on laptop or custom PC",
  "content": "Have a budget from 80k to 110k for laptop\nAround 130K for a custom built PC. Need help deciding what exactly to get. I'm going to be doing mostly AI/ML work and heavy editing and blender. Need someone who's experienced to limit my budget and save my parents some cash. I don't really what I guy as long as it functions well and has good build quality. Don't want to compromise too much either. Thanks ",
  "metadata": {
    "author": "Aye_Klutch",
    "url": "https://www.reddit.com/r/PESU/comments/1exk800/help_from_seniors_on_deciding_budget_on_laptop_or/",
    "permalink": "/r/PESU/comments/1exk800/help_from_seniors_on_deciding_budget_on_laptop_or/",
    "score": 0,
    "created_utc": 1724228503,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lj6im0t",
      "body": "Get a ryzen 7000series ka cpu and rtx 4050 with a 16gb ram"
    },
    {
      "id": "lj6iobo",
      "body": "Give me a budget quote and recommend models please"
    },
    {
      "id": "lj6irvj",
      "body": "I bought a lenevo loq ryzen 7 7840hs rtx 4050.. It coated around 85k..u can get this, it's working super fine"
    },
    {
      "id": "lj6k8ta",
      "body": "Buy a 2nd end Thinkpad laptop(25-35K) and set up a desktop (way more powerful)"
    },
    {
      "id": "lj6kdar",
      "body": "Yeah this is what I wanted to do. Build a custom PC but I need portability and will probably build a rig later down the line. For right now I'm going towards the laptop direction"
    },
    {
      "id": "lj7nkaw",
      "body": "If portability is a priority, the Lenovo LOQ laptops with an RTX 3050 (6 GB) are a great option, especially with an i5 12th gen processor at a good price. \nBut as someone who built a custom PC a couple of years ago, I’d still choose a custom rig any day. Despite the lack of portability, the insane performance, endless customization options, and the ability to set up your entire room around your PC, adding liquid cooling, make it an unbeatable experience."
    },
    {
      "id": "lj7nsck",
      "body": "Yea I know man. I believe in the Pc master race too. But like for the next 2 or 3 years I'm not gonna be sitting in one place. I want to bring work with me wherever I go"
    },
    {
      "id": "lj7o1fv",
      "body": "Yea I know. I believe in the Pc master race too. But like for the next 2 or 3 years I'm not gonna be sitting in one place. I want to bring work with me wherever I go. \n\nDo you think I could DM you to talk about cost vs performance and good deals on hardware?"
    },
    {
      "id": "lj7pi1f",
      "body": "Yeah, we can definitely talk about cost vs performance, but I’m not the best person to ask about deals since I’m not actively researching laptops. I did my research during my first year and built my PC in my second year"
    },
    {
      "id": "lj7pn40",
      "body": "Just having someone with much more knowledge is enough. I hope you don't mind me piggy backing off you"
    },
    {
      "id": "lj8gu31",
      "body": "Hey op! I had the same debate as you and decided with the custom pc and have no regrets! Figure what you really require from it and then I’d say get a good enough windows laptop and put the rest in your pc. Then you can use stuff like Anydesk and other Remote Desktop to even make use of the pc from college also!"
    },
    {
      "id": "lj8gynl",
      "body": "Since you need heavy blender and machine learning go for a ryzen 5 7600x or something a little lower(if you can) and throw the rest into that gpu"
    },
    {
      "id": "lj8h3uf",
      "body": "At that point might as well go for Google colab. But yeah I think I'll buy like a decent but not over the top laptop"
    }
  ]
}