{
  "id": "1exmr3l",
  "title": "FOMO ho raha hai",
  "content": "I know mein pehle bhi yaha post kar chuka hua but brain kehta rehta hai ki aur mehnat kyu nahi ki. Na IIT, BITS, NIT kuch nahi mila. Srm and vit nahi jana tha.I didn't even get RR campus in PES. College bhi nahi start ho raha. Kuch karna ka man nahi karta. Waapis JEE ke liye padhe ka man karta hai caz I am delusional to get hopes of getting good IIT next yr. Is anyone facing this situation, ya sirf mein hi gadha hun? ",
  "metadata": {
    "author": "DistributionDizzy297",
    "url": "https://www.reddit.com/r/PESU/comments/1exmr3l/fomo_ho_raha_hai/",
    "permalink": "/r/PESU/comments/1exmr3l/fomo_ho_raha_hai/",
    "score": 24,
    "created_utc": 1724238327,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lj70r30",
      "body": "Us"
    },
    {
      "id": "lj70ub7",
      "body": "Don't dwell on the past, it's only gonna set your back further. Obviously, this is easier said than done but at some point you'll have to accept the mistakes that you made in school and move on."
    },
    {
      "id": "lj71mz1",
      "body": "Sounds like me 4 years back"
    },
    {
      "id": "lj71r6m",
      "body": "us bhai us"
    },
    {
      "id": "lj71xmm",
      "body": "Bhai ye pagal pana chod agar soch raha hai re appear ka jee ke liye tho ek cheez yaad rakh was your score above 96%ile? If not mat de wapas\nJo college hai wahi ruk if you want cse grind in first year get 9+ cgpa and change branch, and if not grind in core according to jo tujhe karna hai"
    },
    {
      "id": "lj73asw",
      "body": "Nahi 95 tha, aur cs ec campus mein hai. Branch ka dikkat nahi hai bas dream college na milne ka dukh satata rehta hai. Mein hi dhang se preparation nahi ki. "
    },
    {
      "id": "lj74pic",
      "body": "bro i got rr and i am still having fomo, you are not alone."
    },
    {
      "id": "lj77pil",
      "body": "Don't worry man, take lessons from ur past and move on, next year it can be worse than this year"
    },
    {
      "id": "lj7cg06",
      "body": "Lol same mann, CSE in RR campus, still fome ( Thru PESSAT tho 😅 )"
    },
    {
      "id": "lj7it9y",
      "body": "Ab kahan ho aap bhai? "
    },
    {
      "id": "lj7j0ij",
      "body": "Pesu rr eee"
    },
    {
      "id": "lj8z79t",
      "body": "I'm getting cse in rr, still in fomo (thru cet)"
    },
    {
      "id": "lj958la",
      "body": "Dude what is done is done man just think how can you do well in future learning stuff which will help you with ur course try maintain good cgpa work hard you’ll have no regrets just do your work on time forget everything change the mindset it’ll all work out surely be consistent and do you best I know it’s easy to just tell but yes to make a change you gotta do it somehow"
    },
    {
      "id": "lj971o6",
      "body": "College matters only for the first job, how you progress in the rest of the career will be decided based on how you perform in the job.   \n  \nSo, do not worry about it so much, wholeheartedly focus on what you have and give your best in it."
    },
    {
      "id": "ljbf2eh",
      "body": "Enjoy holidays "
    },
    {
      "id": "ljbfn7h",
      "body": "Next year it will be harder and you will have higher fomo as most of your friends would be in colleges and you will be grinding for jee"
    },
    {
      "id": "ljbgp66",
      "body": "And to get a decent branch in good nit you need 99.2+\n\n\nAnd for iit you need less than 7k"
    },
    {
      "id": "ljc5a8x",
      "body": "+1"
    },
    {
      "id": "ljchyiy",
      "body": "Can you share your experience in placements?"
    },
    {
      "id": "ljckf0q",
      "body": "It’s only worth if you have above 8.5cgp preferably above 9"
    },
    {
      "id": "ljcwed7",
      "body": "Taking drop is worth....."
    },
    {
      "id": "ljenbz9",
      "body": "bro i got cse ec campus, same situation, even i am in the hopes of taking partial drop but then won't be able to manage college together. 2nd counselling me aiml lene ka try karunga rr campus me but mushkil lag raha hai ye bhi."
    },
    {
      "id": "ljfyhfq",
      "body": "Sameeeee bhai. Even I wanted to do Partial drop but it's tough in pes. Pessat mein kya rank hai? Even I wanted rr aiml"
    },
    {
      "id": "ljg3gs1",
      "body": "U r which yr brooo?"
    },
    {
      "id": "ljg3mgm",
      "body": "Ig we were suppose to console him, lol \nham yaha apna 'flex' karne me lage pade he bc"
    },
    {
      "id": "ljg79d5",
      "body": "jee main me to 90.6 thi, honestly never prepared seriously, soch to raha hu college me grind karunga but abhi soch raha hu, saari books bhi pack kar di hai bag me lol."
    },
    {
      "id": "ljg7lct",
      "body": "90.6 ,  honestly never prepared seriously, ab soch raha hu grind karu, saari books bhi bag me pack kar di hai college le jane ke liye lol."
    },
    {
      "id": "ljhiweh",
      "body": "Fresher😐😐"
    },
    {
      "id": "lji66jq",
      "body": "Ohh naiceee"
    },
    {
      "id": "lji9ots",
      "body": "Haan yaar, ab vo ye sb dekke uska aur fatgyi hogi"
    },
    {
      "id": "ljp3nqq",
      "body": "Whatever happened happened, you still got so many opportunities, if you’re confident you can get an IIT next year take a drop, or if you have the money you can join PES and write JEE… if not PES is an okay college as well, if you put in efforts from now you’ll get placed or atleast have an opportunity to do smtg! Don’t dwell in the past, look ahead and keep walking"
    },
    {
      "id": "ljtr6cp",
      "body": "Bhai couldn't relate more , but ab time nahi bacha hai for drop"
    },
    {
      "id": "ljxodj7",
      "body": "Hey man , if u don't mind can I dm u ?\nHad queries regarding hostel"
    },
    {
      "id": "ljyq8es",
      "body": "What hostel which hostel and who hostel.. I'm a fresher duh.."
    },
    {
      "id": "ljyteb2",
      "body": "My bad shud have been more clear, abt pesu hostel"
    },
    {
      "id": "ljyu1sd",
      "body": "Anna, I'm a fresher, idk shit abt hostels"
    },
    {
      "id": "llzc055",
      "body": "true. how much u got in bitsat da?"
    },
    {
      "id": "llze9t5",
      "body": "Didn't write "
    },
    {
      "id": "llzf7be",
      "body": "oh"
    }
  ]
}