{
  "id": "1eyh64d",
  "title": "Few questions",
  "content": "How many notebooks we have to maintain in first sem? Does notebook checking happen like in school or we can make notes however we want? Will the club recruitments begin when college will start or they have begun already?( Becaz there were few announcements of hackathons and everything in pes app and the last dates to register were of next week)",
  "metadata": {
    "author": "DistributionDizzy297",
    "url": "https://www.reddit.com/r/PESU/comments/1eyh64d/few_questions/",
    "permalink": "/r/PESU/comments/1eyh64d/few_questions/",
    "score": 9,
    "created_utc": 1724326991,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ljdae86",
      "body": "Notebook check? That shit stops after sixth grade. \nI never maintained a single notebook and never will."
    },
    {
      "id": "ljdb96y",
      "body": "Bruh nobody gives a fuk if you maintain a notebook or not ,this ain't school bro 🤣as for club recruitment,  it's usually around September."
    },
    {
      "id": "ljddl6q",
      "body": "This is true, but some lecturers may ask u if ur not noting it down despite informing u to do so, however such ppl r very less and they trouble much too"
    },
    {
      "id": "ljdhls5",
      "body": "I Heard pes is like school only, so asked."
    },
    {
      "id": "ljdhpsv",
      "body": "Ehh, if u r in regular school, then u need to do it till 12th. "
    },
    {
      "id": "ljdi0jg",
      "body": "😂😂😂😂😂😂😂"
    },
    {
      "id": "ljdil1d",
      "body": "Bruh they gaslighting you da , unless and until you do some major fuck up no one gives a fuk"
    },
    {
      "id": "ljdiuhm",
      "body": "But they have already started with the hackathons and some workshops? Should we attend those? "
    },
    {
      "id": "ljdjklv",
      "body": "Ohh lesgo. Btw what is dress code in this college? Can we wear tshirts and jeans everyday Or we need to wear that Pesu shirt daily? "
    },
    {
      "id": "ljdk9cg",
      "body": "Is this how the management laughs at students of pesu?"
    },
    {
      "id": "ljdn96o",
      "body": "Attend if you want no ones gonna force you out"
    },
    {
      "id": "ljdnfrn",
      "body": "Wear anything other than shots and your gud . No dress code and all , that pes shirt we use as a curtain in out hostel rooms"
    },
    {
      "id": "ljdnt54",
      "body": "ayo lol i'll use it in holi then, if pes gives holiday."
    },
    {
      "id": "ljdo3mu",
      "body": "You first years didn't get calander for the sem? They give like 3 days holiday for Holi I guess"
    },
    {
      "id": "ljdolp2",
      "body": "ohkay i will see. senior should I got for second round if I have 2.3k rank in pessat to get RR aiml- I don't want to simply waste time caz the chances seem low?"
    },
    {
      "id": "ljdoy1v",
      "body": "What are you getting now?"
    },
    {
      "id": "ljdq27m",
      "body": "3 days tf?! A 3rd yr guy said this here- \"Here's a shocker for you, yaha Holi ki chuti nahi milti\" --- it was a post where they asked about navratri and other holidays."
    },
    {
      "id": "ljdq7rj",
      "body": "cse in ec campus"
    },
    {
      "id": "ljdqwpb",
      "body": "Mb that was for Dashara,  Holi on Friday nah if you take a leave that day Fri, sat and sun holiday then 😉"
    },
    {
      "id": "ljdr216",
      "body": "I am also a fresher,😄"
    },
    {
      "id": "ljdrch2",
      "body": "Taking core cse over aiml is my opinion always , at the end of the day depends upon you , ( my roomate says for pessat 2.5K highly doubt you'll get aiml in rr )"
    },
    {
      "id": "ljdsiec",
      "body": "Hmm true, I wanted to get rr aiml caz of rr campus mostly. They hv kept round 1 with ranks 1-2500 in second round counseling."
    },
    {
      "id": "ljdsv0r",
      "body": "hehe boii"
    },
    {
      "id": "ljdtty0",
      "body": "Realistically you only have to maintain the physics lab file and Chem lab file. But again there are no notebook submissions."
    },
    {
      "id": "ljemg26",
      "body": "bro i got 1793 rank, is there a chance. ig cse aiml closed at 1730s this time"
    },
    {
      "id": "ljhva2h",
      "body": "you can maintain notebooks how you want to, but take measure of the teachers traits. a more stern teacher might check on how you're doing a problem."
    }
  ]
}