{
  "id": "1ez5xvx",
  "title": "Getting 9.5 cgpa",
  "content": "Im joining as a fresher in PES RR CSE. I'd like to ask seniors what exactly you did to get 9.5 cgpa while balancing other projects, hackathons,developing skills, events in college, etcetc. can pessat students be better than cet ppl by putting in extra effort? \n\nanother doubt is my main aim is MS abroad. So  should i sit for placement and then reject the package i am offered.  ",
  "metadata": {
    "author": "Confident_Chard7453",
    "url": "https://www.reddit.com/r/PESU/comments/1ez5xvx/getting_95_cgpa/",
    "permalink": "/r/PESU/comments/1ez5xvx/getting_95_cgpa/",
    "score": 34,
    "created_utc": 1724395034,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ljinhw5",
      "body": "Regarding your second doubt.. you’re still joining PES\nYou shouldn’t worry about placements from today itself\nWorry about it after 5th sem starts"
    },
    {
      "id": "ljj799d",
      "body": "You are junior .you are not qualified to speak about it . Let a senior talk about the second part "
    },
    {
      "id": "ljj9ia0",
      "body": "Bro you go spam every 2 weeks on this Reddit regarding when will college reopen like you’ve been doing"
    },
    {
      "id": "ljj9qrc",
      "body": "Not relevant "
    },
    {
      "id": "ljj9xup",
      "body": "Neither are your posts relevant\n\nLiterally every 2 weeks you ask a question whxib nobody has an answer to\n\nBefore pointing at others, see what you’re doing first\n\nAt least I’m helping someone unlike you\nGrow up"
    },
    {
      "id": "ljjadfw",
      "body": "I said not relevant to what i am saying . I post when is college reopening because many people are bored and waiting for college to start. To get mental peace . You are trying to help . But when you don't know or are not qualified to talk about the second part of the topic let a senior talk"
    },
    {
      "id": "ljjayxx",
      "body": "Not really. It has a tag called ask a senior "
    },
    {
      "id": "ljjaze8",
      "body": " If OP wants to hear my opinion, he shall. It was a doubt asked by him and not by you. If you asked the doubt and if I had responded, you could’ve told me that I don’t have experience as I am a fresher\nYou’re not even the one who asked the question at the first place.\n\n\nAgain maybe you’re finding it too hard to understand .\nIt’s an open platform and anybody can reply"
    },
    {
      "id": "ljjb6ku",
      "body": "The post literally has ask a senior .better to not talk rather than spread misinformation "
    },
    {
      "id": "ljjbc1n",
      "body": "The flair is so that Seniors can easily access it. \nIt doesn’t prevent anybody except seniors to respond\n\nWell, it’s has a tag regarding seniors right. Why have you responded in this seniors post"
    },
    {
      "id": "ljjbpqb",
      "body": "Let a senior tell what I’ve told is misinformation, then I’ll delete my replies\n\nAnyway, how will a person keep on spamming same question over and over again, a question which doesn’t even have an answer to, understand what is correct information and what’s not"
    },
    {
      "id": "ljjbvle",
      "body": "Because a junior like you was spreading misinformation "
    },
    {
      "id": "ljjc8qj",
      "body": "Ok boss\n\nYou’re so talented enough and smart enough that you being a fresher yourself are able to correct others\n\nI admire your talent\n\nI’m not responding further to useless discussions\n\nI responded to help OP\nUnlike you who’s putting up an unless argument \n\nAnd for gods sake.. stop spamming about when will college start. \n\n✌️"
    },
    {
      "id": "ljjcatg",
      "body": "So that they can stay updated on the latest dates and speculations . So that any sudden changes do not come and so that they have mental peace . People are really bored staying in home .and i am not the only one asking this question all the time . Check discord forums also. This question is very common "
    },
    {
      "id": "ljjcjmo",
      "body": "Kay. Will not spam .live in peace "
    },
    {
      "id": "ljjcmxe",
      "body": "Just because all are doing wrong, doesn’t give you any rights to do the same mistake\n\nAlso.. for knowing when college shall start, there is an official pes website and they’ll update it. PES won’t give out a circular and tell college is starting tomorrow and all must attend. So there won’t be so called “sudden changes”"
    },
    {
      "id": "ljjcp4i",
      "body": "And better to not help rather than spread my misinformation "
    },
    {
      "id": "ljjd2hd",
      "body": "Man\n\nHats off to what your brain perceived as misinformation\n \nI can’t win an argument with you\n\nI give up"
    },
    {
      "id": "ljjd98d",
      "body": "I didn't know when college will start asking is wrong . Yes ik pes has offical website but kea and other factors also influence nah .you can't just sit and think college will start one day .as many people are fed up of holidays and just want college to start. Ik it's annoying to post the same thing in subreddit but it's literally what anyone can do"
    },
    {
      "id": "ljjdbxs",
      "body": "Well,even a high school passed out guy who scrolled this/any btech related sub would tell the same.I'd advice you to do that too, it will help genuinely help u"
    },
    {
      "id": "ljjdj9n",
      "body": "You yourself are accepting that it’s annoying for posting the same  thing over and over again\n\nYet you’re supporting yourself that what you’re doing is right\n\n 🫡"
    },
    {
      "id": "ljjdjy7",
      "body": "Nice . It is hard to win an argument against a smart person . It is impossible to win an argument against a stupid person like me huh . This vibes i am getting lol"
    },
    {
      "id": "ljjdzea",
      "body": "It is fun to do chutiyappa in reddit lol"
    },
    {
      "id": "ljjf2ld",
      "body": "Thanks man\nI hope that maintenance guy does maintenance to himself 😂\n\n✌️"
    },
    {
      "id": "ljjfj4x",
      "body": "Go do your  useless shit in other servers. This server is for helping people. Not for your “chutiyappa “"
    },
    {
      "id": "ljjkjls",
      "body": "Did you go through this subreddit before posting the question? No offence,   \nbut what do you mean by \"reject the package I am offered?\" I dont think you understand how placements work"
    },
    {
      "id": "ljjnbdq",
      "body": "You yourself said that this is open reddit and anyone can post. lol what a hypocrite.gets angry when someone corrects them due to massive ego and when i said that it is fun to do chutiyappa i meant with you bcoz you can't accept a single thing properly due to debate brain and big ego.arguing witha person like you is literally doing chutiyappa only"
    },
    {
      "id": "ljjnxn5",
      "body": "He did not support you . He said that people like you can speak that much only and he said that yes you can do both also or something "
    },
    {
      "id": "ljjnyn2",
      "body": "Anyway,  i can’t be jobless and keep arguing with a INSANE guy like you. \n\nLet’s end it here for the decorum of this server\n\nPeace out"
    },
    {
      "id": "ljjqfm2",
      "body": "Look at what the other fourth year senior is saying .what you are saying everyone knows.everyone knows placement is in fourth year but do you know what the fourth year senior is saying? No social stfu and mind your business "
    },
    {
      "id": "ljk7i3o",
      "body": "I'm not a 9.5 cgpa person but this what I have learnt.\n• Try revising concepts done daily.\n• Do not leave stuff for last minute.\n• Listen to classes(try ur best at least)\n• Youtube lectures are your savior(good for revision as well as first time)\n• Making notes helps, especially from 2nd year. Those notes will be important from placement poverty as well\n• Textbook questions? ( I never did them but I've been told it helps )\n• Participate in hackathons and events. ( Experience sake)\n\nProjects and certifications \n• Full stack projects are prefer\n• Keep Github and LinkedIn updated \n• Certifications are a bit important. Try doing one or two( Full stack and whichever stream u r interested in)\n\nPlacements\n• start coding from now or 2nd year pakka. Doesn't have to be strict everyday but weekly? (Regret not doing this)\n• Projects, work experience are imp ig\n• increase coding yearly. U learn more concepts in 2nd year. By the time placements come around it's much easier for u to think about the logic behind solving.\n\nThat's about it. I hope this helps a bit. I've told all the things i was told to do but didn't follow and now regret it GREATLY.\nLearn from your mistakes😭"
    },
    {
      "id": "ljkbrbb",
      "body": "Bro where were u these days in this sub? such a good input!"
    },
    {
      "id": "ljkcbg3",
      "body": "To be honest I only know people who are exceptionally good at coding and all but doesn’t have a gpa above 9, and people who have 9+ gpa are just some avg and slightly above avg"
    },
    {
      "id": "ljnkfdb",
      "body": "Which YouTube lectures are you referring to? Thank you for this"
    },
    {
      "id": "ljo331y",
      "body": "Sounds like wanna be \"SIGMA\"🤣\n\nLike some random company will plead with him to come join us XD"
    },
    {
      "id": "ljo935g",
      "body": "Bro thinks companies will come to him 😂😂"
    },
    {
      "id": "ljocrto",
      "body": "Thanks😂"
    },
    {
      "id": "ljoda2b",
      "body": "• Gate smashers (This saved me last minute but do it prior xD)\n• Apna College\n• PESU AV summary(if it is good)\n• etc\n\nJust search the topic on youtube u have many available. Some have playlists too. \n\nTry finding a channel whose explanations make sense to you. (Gate smashers for me) \n\nIf I remember more channels I'll let you guys know.\n\nEnjoy studying ig? 😂"
    },
    {
      "id": "ljogeoe",
      "body": "Proper placements start around end of 6th sem."
    },
    {
      "id": "ljp847q",
      "body": "thanks mate this is a great advice. rn which what r u abt?"
    },
    {
      "id": "lju8lqh",
      "body": "Anytime! I didn't quite understand the second part tho?"
    },
    {
      "id": "lju9ubj",
      "body": "Haha thank you for this! but what is AV summary?"
    },
    {
      "id": "ljua8df",
      "body": "Basically u have access to PESU ka official sight where you get your lectures, question banks, etc. AV summary is just one of the faculty or TAs teaching that lecture. \n\nDownside, some of the videos are live classes so end up being 1 hour long."
    },
    {
      "id": "ljvb9xs",
      "body": "I see thanks for explaining"
    },
    {
      "id": "llaippb",
      "body": "hey bro or u/rowlet-owl , many people are telling that rr aiml is now exactly same as ecity cs course wise..... forget about masters but for placements the recruiters won't sit and see ur courses right, they will see the degree and it will have aiml. so wont they recruite u moree for ml jobs like data analyst? ik the placements havent started but this is what I think."
    },
    {
      "id": "llaoo1o",
      "body": "I actually dk cuz aiml started in the batch after mine. Some companies do come for specific ml related so that may give a little edge. You still need to be well versed with ur course syllabus cuz most of it they might ask in placements. \nAlso degree they'll see only after u graduate during job changes, rn courses matter more. Your knowledge about those courses matters most.\n\nSo in my opinion not much difference?"
    },
    {
      "id": "llze86s",
      "body": "I actually love studying esp math n phy (integration)"
    },
    {
      "id": "lmeenp3",
      "body": "Nvm I'll figure out"
    }
  ]
}