{
  "id": "1f0zpkn",
  "title": "Lor ",
  "content": "What can you do to impress your professors enough to get a good letter of recommendation?",
  "metadata": {
    "author": "RaspberryOk2215",
    "url": "https://www.reddit.com/r/PESU/comments/1f0zpkn/lor/",
    "permalink": "/r/PESU/comments/1f0zpkn/lor/",
    "score": 13,
    "created_utc": 1724601635,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ljvilqu",
      "body": "The quality of an LOR depends on the prof's reputation and your working history with the prof. The better the history, the better the content. Working with profs as their RA/TA is ideally the best possibility since it gives you a really strong LOR (provided of course, you actually perform your duties well)."
    },
    {
      "id": "ljvlljc",
      "body": "What can you do to become a research assistant/teaching assistant"
    },
    {
      "id": "ljvo0u8",
      "body": "Can I get an LOR if I’m not a TA , and I’m average in studies"
    },
    {
      "id": "ljzahxo",
      "body": "Interact with the teacher well during the course, get an A or an S in the course and ask them if you can be a TA next semester for that course"
    },
    {
      "id": "ljzaz8n",
      "body": "Okay thanks. And as for research assistant, you would need to take to teachers from another field. What’s your advice on attaining the same here?"
    },
    {
      "id": "lk0756j",
      "body": "Not sure fam. Lot of my friends are TAs but idk anyone who's a research assistant. Maybe do your own research on the subject, find a nice teacher and tell them you're interested and ask what the procedure is"
    },
    {
      "id": "lk0z29j",
      "body": "Okay"
    },
    {
      "id": "lk3rdr6",
      "body": "You can, but you will get an average LOR which will not help you much. Although you will mostly get rejected for an LOR."
    },
    {
      "id": "lk3rheh",
      "body": "You can also work with profs on their research projects as part of mini project or summer research internships such as CCBD/CDSAML/etc"
    },
    {
      "id": "lk4ob2q",
      "body": "Cool thanks 👍"
    },
    {
      "id": "lk7o27d",
      "body": "I think I’m cooked 💀"
    }
  ]
}