{
  "id": "1f11sks",
  "title": "Urgent help!!",
  "content": "So I might end up PES CSE this yr 2024-25, and I am thinking for a partial drop for IIT, would I be able to make some time in 1st yr for JEE, urgent helpp, please help me out....much appreciated....",
  "metadata": {
    "author": "baraddhanush",
    "url": "https://www.reddit.com/r/PESU/comments/1f11sks/urgent_help/",
    "permalink": "/r/PESU/comments/1f11sks/urgent_help/",
    "score": 11,
    "created_utc": 1724606886,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ljw11e3",
      "body": "Same situation.\nDM if you got the answer to it."
    },
    {
      "id": "ljw2gz4",
      "body": "partial drop this late from pes  \nsounds like a disastrous combo to me tbh  \nfocus on academics in pes and you can get a tier 1 job"
    },
    {
      "id": "ljw696n",
      "body": "Search this subreddit, you'll find answers to your question."
    },
    {
      "id": "ljw6cg1",
      "body": "i tried to take partial drop last year, i had called a few colleges to ask them if i can leave after first year cause  i got to know from many places that if you leave in between you will have to pay all four years fees , only then they will return your original docs . idk about pes, and i am not spreading any fear . but please once confirm this before making the decision .\n\nAll the best !"
    },
    {
      "id": "ljwckgs",
      "body": "You can't really get away with having your feet in two different boats. The odds are stacked against you."
    },
    {
      "id": "ljyqdcp",
      "body": "Fuck no. Pes is good enough."
    },
    {
      "id": "ljz068j",
      "body": "partial drop itself is not a great idea, and from a college like pes this late, nah bro just drop fully or dont."
    },
    {
      "id": "ljz2vpn",
      "body": "u copied my flair."
    },
    {
      "id": "ljz3um3",
      "body": "its one of the default options lol wdym."
    },
    {
      "id": "ljz4k6o",
      "body": "lol, it was not a default option before. dont know why they macde it one"
    },
    {
      "id": "lk01uta",
      "body": "It was a default one lol"
    },
    {
      "id": "lk03ksq",
      "body": "nope. there was a default one which could be changed, i changed my flair. dont know how it the new became default. if you are mod you should remember\\\\"
    },
    {
      "id": "lk03la6",
      "body": "Nope bad idea. Pes is known for being hectic, so Im afraid ud mess up ur first year gpa and jee , and first year is important for maintaining your overall gpa at the end if ur keeping pes as backup.\nCompetition will also increase next year. If cse is what ur concerned about then pes is a good option"
    },
    {
      "id": "lk0mis0",
      "body": "yoo"
    },
    {
      "id": "lk0mmoa",
      "body": "its been there for as long as i can remember."
    },
    {
      "id": "lk11xfx",
      "body": "Dude, first of all your esa will collide around the same time as JEE Advanced, considering the late start of batch. It would super hard to prepare for both. Besides you are in a good spot with PES CSE, as they are given higher preference. You are in a good spot. You would not want to risk your GPA."
    },
    {
      "id": "lk1ej6l",
      "body": "> if you leave in between you will have to pay all four years fees , only then they will return your original docs .\n\nIsnt legal"
    },
    {
      "id": "lk1fthk",
      "body": "actually i called few colleges like new horizon and msrit, they said the seat will be empty for the next four years and it will be a loss to the college. hence the payment. yes you can fight a little , maybe threaten to sue. but it will be time taking. so i am just asking him to check beforehand and then get into it ."
    },
    {
      "id": "lk25sbz",
      "body": "Have already done it but ended up at bitsh not iit dm if u want more info"
    },
    {
      "id": "lk4luau",
      "body": "If u think u can crack iit in 10 months then take take full drop it will be worth it otherwise join pes"
    },
    {
      "id": "lkdxf3l",
      "body": "Bro are months of January and april- march packed with exams? If someone wants to reappear for jee/comedk/bitsat and all."
    },
    {
      "id": "lkdxk6g",
      "body": "So where r u now? In pes itself or some other college?"
    },
    {
      "id": "lkdz91q",
      "body": "bro what did u decide? r u going ahead for partial?"
    },
    {
      "id": "lkg97ly",
      "body": "i will be joining pes this year"
    },
    {
      "id": "lkhmhq8",
      "body": "won't the exams clash with isa/esa? If i can reappear for bitsat, will exams be there around apr-may?"
    },
    {
      "id": "lkjvmwn",
      "body": "Not in Pes I left only had to give 1 yr fees"
    }
  ]
}