{
  "id": "1f2e0f6",
  "title": "Is this true? ",
  "content": "Are the engineering branches going to be shifted to rr campus or just some rumour? Also will it be applicable for our batch or next batches onwards? ",
  "metadata": {
    "author": "DistributionDizzy297",
    "url": "https://www.reddit.com/r/PESU/comments/1f2e0f6/is_this_true/",
    "permalink": "/r/PESU/comments/1f2e0f6/is_this_true/",
    "score": 26,
    "created_utc": 1724755812,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lk5osee",
      "body": "I too would like to know the ans to this\nBtw thanks for the info"
    },
    {
      "id": "lk5ppt6",
      "body": "+1"
    },
    {
      "id": "lk5pqh6",
      "body": "I've heard a lot of people and heard 2 teachers talk about this. It actually makes a lot of sense too. Medical colleges make a lot of money and the only thing PES seems to care about is money so making EC campus completely for medical seems like a logical choice. But at this point, it's all just rumours and the only people who know for sure are the people in the upper management"
    },
    {
      "id": "lk69tj4",
      "body": "Wt would they do with the engineering block in ec campus then?"
    },
    {
      "id": "lk7cz2u",
      "body": "Well , previously it was in EC,  but that got discontinued long back. Apparently,  It has been discontinued in rr from this year I think (Not 100% sure). Last batch with Mech is 2023-27 batch."
    },
    {
      "id": "lk7dlcj",
      "body": "No"
    },
    {
      "id": "lke3c54",
      "body": "ohk so can we expect this change next year then for our batch(2028)? or will it take some time caz of the construction of medical college and rr campus being small to accommodate."
    },
    {
      "id": "lkgmftp",
      "body": "this year mech was there in the choices."
    },
    {
      "id": "lkgzqzp",
      "body": "Probably not gonna be happening anytime soon. The medical college is almost finished and nursing and bpharma students have been coming from last year so the building doesn't seem to be an issue. But since the engg admissions haven't really changed, it's probably not happening anytime soon. But like I said, it's all just speculation and the only ppl who know are Doreswamy and his peeps in the upper management"
    }
  ]
}