{
  "id": "1f34b9b",
  "title": "Did I make a mistake",
  "content": "I got 96.7 percentile in jee and left nit meghalaya cse, iiit bhopal ece and many in that range for pes ec cse, please be brutally honest, did I make a mistake?\n\nmy main motive is placements and masters abroad, and I've been preparing for drop already, so even that's in the list.\n\n[View Poll](https://www.reddit.com/poll/1f34b9b)",
  "metadata": {
    "author": "Fair_Combination_548",
    "url": "https://www.reddit.com/r/PESU/comments/1f34b9b/did_i_make_a_mistake/",
    "permalink": "/r/PESU/comments/1f34b9b/did_i_make_a_mistake/",
    "score": 0,
    "created_utc": 1724830695,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lkb2t2n",
      "body": "Dude do you actually think you achieved smtg by scoring a mere 96 percentile? Why are you posting the same post again and again? The cutoff of pesu cse was 98.5, you couldn't have got pesu thru mains if u actually wanted.. So stop this validation seeking post for gods sake.."
    },
    {
      "id": "lkb4p0l",
      "body": "Youve been posting this question on several subreddits for days now  \nall im saying is just decide one thing   \nyou either take a drop and stop contemplating or you join pes  \nwhats done is done   \nyou cant change it"
    },
    {
      "id": "lkb4zh5",
      "body": "sorry I just wanna confirm is I did the right choice, coz if I didn't, I'm ready to take a drop"
    },
    {
      "id": "lkbb2pw",
      "body": "how many times will u keep asking the same question. you cant change the past. I left nit agartala cse, nit k mechanical, iiit sri city cse, i left bits mechanical, for pes cse. The max you can do is partial, or full drop if you have sooo much regret. Clg will start in next 10 days, can you study 14 hrs every day?? then drop full, if not stop overthinking."
    },
    {
      "id": "lkbd3u1",
      "body": "yeah bro you made the right choice dw it'll be fine"
    },
    {
      "id": "lkbulc8",
      "body": "If you are planning on doing master's it won't matter from where you have done your Bachelor's, look you should have chosen whatever college was cheaper, tbh drop isn't worth it assuming you stick to your master's plan just maintain a good CGPA, what is done is done, don't think too much about it just focus on enjoying college life while maintaining a good CGPA... Good Luck!"
    },
    {
      "id": "lkbyzff",
      "body": "but I just would like to know if I did the right thing or fucked up"
    },
    {
      "id": "lkc5wb4",
      "body": "As I already said it doesn't matter now.. dw it's fine just focus on the present... And set a good aim for your future...\n\nI chose VIT over BITS against a lot of peoples opinions here on reddit, because I thought it was right and I didn't find any exceptional reasons.. No one can say it all depends on you..."
    },
    {
      "id": "lkcivj0",
      "body": ">Simply put College is like a Canvas, it all depends on how beautifully you paint it..\n\nDamn, this is such a beautiful quote, made my day lol... Tqsm"
    },
    {
      "id": "lkcoxht",
      "body": "Those iiits don't even have a campus😭"
    },
    {
      "id": "lkcp1j0",
      "body": "Yeah"
    },
    {
      "id": "lkd4dgk",
      "body": "Very similar situation, op"
    },
    {
      "id": "lkglu0l",
      "body": "meanwhile jee quota kids join at 99%ile."
    }
  ]
}