{
  "id": "1f38oem",
  "title": "DOUBT",
  "content": "I’ve been allotted CSE (ECC) in the first round of counselling with a rank in the 1790s, and I have a few questions:\n\n1. **AIML in RR Campus:** Do you think there's a chance I could get AIML in the RR campus in the second round of counselling? (idc about the core cse and all)\n2. **EC Campus Hostel Info:** Has anyone been allotted a hostel room at the EC campus, or does anyone have any information about it? I haven’t visited the campus yet, so I’m a bit lost regarding the hostel situation.\n3. **Sports in the First Year:** Will I be able to participate in sports like cricket and badminton in the first year? I’m concerned because the EC campus hostel is quite far from the college and seems to have specific timings.\n4. **Hostel Room Availability:** Is there a possibility I won’t get a hostel room (either at the EC or RR campus) due to limited availability?\n5. **Second Counselling:** Is it acceptable if only a parent attends the second round of counselling on my behalf.",
  "metadata": {
    "author": "Timely_Skin4135",
    "url": "https://www.reddit.com/r/PESU/comments/1f38oem/doubt/",
    "permalink": "/r/PESU/comments/1f38oem/doubt/",
    "score": 6,
    "created_utc": 1724847394,
    "flair": "PESSAT/Admission",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lkc9lwc",
      "body": "They told during the counciling to go to hostel after taking the welcome kit. I went that day and warden wrote fown my name somewhere and explained me everything and asked me to bring so and so documents. After 3 days i sent a post to my local guardian with all signed documents which he submitted and selected a room for me"
    },
    {
      "id": "lkcby1o",
      "body": "ohk thanKs. just wanted to ask if you have given the hostel fees?"
    },
    {
      "id": "lkccvf9",
      "body": "Yeah i have submitted 1.5L(price might be wrong i am sorry) DD to them and a few documents. Also yesterday when i went to submit the original documents to administration i was bored and had time so i went to check out hostel and warden told me that all rooms have been filled. I am guessing he didn't actually mean all beds are filled cuz they wont make it so there are less beds than seats. So good luck op on getting ur bed 🛏️🛏️."
    },
    {
      "id": "lkch9rm",
      "body": "damn now im scared if i'll get a bed or not"
    },
    {
      "id": "lknsjua",
      "body": "I think hostels are full in rr, not sure about ec but you'd better check as soon as you can x')"
    },
    {
      "id": "lks8hvt",
      "body": "I went to rr yesterday, thye said that 4 sharing with common bathroom are available"
    }
  ]
}