{
  "id": "1f6wtzl",
  "title": "Pesu app",
  "content": "I'm a fresher and I have my info to login into the app but I want to change my mail and phone number as both are my mom's will i face any problem if i change it now?",
  "metadata": {
    "author": "_eternally_confused_",
    "url": "https://www.reddit.com/r/PESU/comments/1f6wtzl/pesu_app/",
    "permalink": "/r/PESU/comments/1f6wtzl/pesu_app/",
    "score": 5,
    "created_utc": 1725247208,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ll3e9bf",
      "body": "There will be no issue.  \n\n\n Even I have changed it to mine and I faced no issue"
    },
    {
      "id": "ll3id9m",
      "body": "Ok thank you"
    },
    {
      "id": "ll3kb9j",
      "body": "Don't we need srn number/username and password for sign in after college starts? (Correct me if I'm wrong 'cause I'm a fresher too)\nOr are you talking about the mail one with pesuacademy.com?"
    },
    {
      "id": "ll3kky8",
      "body": "They told tht we can login with prn sent to mail and a paper about tht was given during document submission"
    },
    {
      "id": "ll3m0ix",
      "body": "Bro are you getting regular updates (emails) like before i mean after changing it"
    },
    {
      "id": "ll3mqgq",
      "body": "There are no regular updates given so far. I changed it after1st round counselling. They have rarely sent any mails."
    },
    {
      "id": "ll3opmn",
      "body": "Bro i also did that on same time from then i didn't got a single mail (to mention not even the one which told to submit the originals) so i asked you"
    },
    {
      "id": "ll47qpg",
      "body": "How did you change it? In the app or?"
    },
    {
      "id": "ll4gfgp",
      "body": "I did change my phone number bt I m still receiving my noti on my previous number"
    },
    {
      "id": "ll4vyi8",
      "body": "That’s what I’m telling right.. they haven’t mailed anything"
    },
    {
      "id": "ll4vz8f",
      "body": "I changed on website"
    },
    {
      "id": "ll4xmfw",
      "body": "They have but we didn't got it my friend has received some updates in mail"
    },
    {
      "id": "ll5a6mp",
      "body": "👍"
    },
    {
      "id": "ll5ov1e",
      "body": "You can change it to your own. \nI also had this issue, so when i asked the admission office they said you can change it later anytime."
    }
  ]
}