{
  "id": "1f72jar",
  "title": "Hostels at RR campus ",
  "content": "I've heard from many people that almost all hostels are full. Is there like a policy or something like certain number of rooms are reserved for kcet students? Becuz I'll be joining through kcet and i really want to live in the hostel rather then other accommodation. Please help ",
  "metadata": {
    "author": "AimWTF",
    "url": "https://www.reddit.com/r/PESU/comments/1f72jar/hostels_at_rr_campus/",
    "permalink": "/r/PESU/comments/1f72jar/hostels_at_rr_campus/",
    "score": 12,
    "created_utc": 1725269248,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ll4eols",
      "body": "+1"
    },
    {
      "id": "ll4h0ek",
      "body": "+1"
    },
    {
      "id": "ll4hkcm",
      "body": "+1"
    },
    {
      "id": "ll9ppos",
      "body": "Yeep. They have reserved rooms for students who come in through kcet dw"
    },
    {
      "id": "ll9zuco",
      "body": "OH THANK YOU!!!!"
    },
    {
      "id": "lla0mzh",
      "body": "is it the same for electronic city? i will be joining too"
    },
    {
      "id": "llff50d",
      "body": "I went to get admission today thru cet.when I went to check hostel availability they said all nbx block is full.\nThey are giving IT  block that too without confirmation, afterbthe warden  noted  my details down they were like 'the hostels aren't assured until bootstrap, if u get message abt bootstrap then yes u have a chance of getting the rooms'. I was on queue of 100 to 110."
    },
    {
      "id": "llgs922",
      "body": "Yeah i had been there too. This is just outrageous. If u are going to give us rooms then inform us earlier so that we can atleast go and search for rooms or pgs."
    },
    {
      "id": "llgtnxu",
      "body": "Ikr 😔 I hope we get hostels man.\nIf not major L on their side"
    },
    {
      "id": "llgujwy",
      "body": "Yeah, they increased the fees and also made the 3 sharing into 4 sharing just pathetic."
    },
    {
      "id": "llgx421",
      "body": "Ikr. bitches fr\nWhts ur backup?"
    },
    {
      "id": "llgxn27",
      "body": "I dont have any backup just hoping to get the hostel"
    },
    {
      "id": "llgy1x6",
      "body": "Let's hope for the best🫠"
    },
    {
      "id": "llkt7yd",
      "body": "As and 2nd yr std , even I faced the same problem last year but I can say that 80% of the 1st round kcet std get hostel for sure(nb or nbx I can't guarantee) you get option as It or mess block. According to me and my friends IT>>>>>>>>>>>>NB"
    },
    {
      "id": "lllm6b7",
      "body": "U were right, I got the message regarding the briefing session"
    },
    {
      "id": "llmmsbn",
      "body": "When did you submit your request for hostel room and when is the briefing scheduled for?"
    },
    {
      "id": "lls2mrl",
      "body": "I submitted on 4 sep around 11\n8th sep is the briefing session"
    }
  ]
}