{
  "id": "1f7v79s",
  "title": "Need help",
  "content": "I secured admission through the management quota for CSE, but with a 6.1k rank in PESSAT, I was eligible for CSE (AI&ML) at the Ecity campus. When I called the reception today to inquire about converting my management seat to a PESSAT seat, they mentioned I need to visit the campus to do so. I asked if there’s a realistic chance of making the switch before I travel from Delhi to Bengaluru, and they said it is possible. Should I go to the main campus, or would it be a waste of my father’s money on flight tickets?",
  "metadata": {
    "author": "Sobo-prithvi",
    "url": "https://www.reddit.com/r/PESU/comments/1f7v79s/need_help/",
    "permalink": "/r/PESU/comments/1f7v79s/need_help/",
    "score": 10,
    "created_utc": 1725353877,
    "flair": "PESSAT/Admission",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lla28oo",
      "body": "The final round of counselling is done so ask them that"
    },
    {
      "id": "lla2gr3",
      "body": "Definitely try that. What if it works."
    },
    {
      "id": "lla2xup",
      "body": "Yeah I asked about it, they kept saying it is possible I think it is because I have a ‘confirmed seat’ in pes"
    },
    {
      "id": "lla3007",
      "body": "I hope converting one seat to another is applicable after counselling"
    },
    {
      "id": "lla31bc",
      "body": "Yeah bro I am asking my parents about it"
    },
    {
      "id": "lla3auz",
      "body": "People at the reception dont know much"
    },
    {
      "id": "lla3cfu",
      "body": "Specify that u have to come from Delhi and ask for a connection to some higher up person"
    },
    {
      "id": "lla3gds",
      "body": "Thats also true, I asked them about orientation and class dates, and still they weren’t confirmed about the date"
    },
    {
      "id": "lla3ko4",
      "body": "Your flight maybe after-all 20k at max. \n\nBut do suppose you get a seat via PESSAT, your fees will only be 25L including hostel.\n\nIf you don't get it, max you'll lose is the 20k which you spent for travel.\n\nBut if you do get it via PESSAT,  you'll save upto 14Lakhs. \n\nIf you don't try, you are at 0%  \nBut if you make an attempt, there is atleast 0.1% chance\n\nIf you feel 20k is more worth than 14 lakhs, then dont \\*waste\\* your precious 20k."
    },
    {
      "id": "lla450q",
      "body": "Thank you, Im asking my parents about it"
    },
    {
      "id": "lla8o3m",
      "body": "30 lakhs dude*\nMq fees is around 54lakhs including hostel. Pessat quota will make that 24 so approximately 30 lakhs will be saved."
    },
    {
      "id": "llabsjt",
      "body": "Mq is 48 lakhs"
    },
    {
      "id": "llabxqm",
      "body": "I included hostel fee that is around 6 lakhs for 4 years."
    },
    {
      "id": "llavd94",
      "body": "Not the best advice , but if you can get any engineering course thru pessat quota , and u can maintain a cgpa of 7.5 ish u can easily get a switch to cse related branches through internal sliding in the 3rd sem"
    },
    {
      "id": "llbjyub",
      "body": "Bro the sole problem is that I AINT GETTING ANY PESSAT SEAT CZ I DIDN’T ATTENDED THE COUNSELLING 😭"
    },
    {
      "id": "llc89gm",
      "body": "Is switching branch possible through management quota? if i maintain a good cgpa"
    },
    {
      "id": "lleyq2y",
      "body": "My parents were ready to spend 48L for just the seat in Main campus. I made sure to attend second round counselling and got the same cs aiml seat in ec campus. Saved my parents about 32L. \n\nMy friend had applied for the management seat in ec campus, aiml. He didn't attend second round counselling where his rank was 500 ranks better than mine. He could've got the same seat thru pessat.\n\nMoral, don't close your options and try everything to save that money. Its a few years of your parents life you're talking about"
    },
    {
      "id": "lmmva3j",
      "body": "I think so, but not sure"
    }
  ]
}