{
  "id": "1f7y6oo",
  "title": "How to start DSA as a complete beginner in 3rd sem?",
  "content": "I am about to start 3rd sem, i know java and cpp and just the very basics of data structures like lists, stacks, queue etc(basic as in just definitions)...how should i start learning DSA? Should i buy some course from udemy or cousera? I initially started with Striver A2Z DSA sheet but idk if its completely beginner friendly and will take from basics to advanced level.",
  "metadata": {
    "author": "NoBox4354",
    "url": "https://www.reddit.com/r/PESU/comments/1f7y6oo/how_to_start_dsa_as_a_complete_beginner_in_3rd_sem/",
    "permalink": "/r/PESU/comments/1f7y6oo/how_to_start_dsa_as_a_complete_beginner_in_3rd_sem/",
    "score": 10,
    "created_utc": 1725365091,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "llaosca",
      "body": "Watch Apna college Dsa course"
    },
    {
      "id": "llax8qh",
      "body": "/ s"
    },
    {
      "id": "llbxocu",
      "body": "Lmfao "
    },
    {
      "id": "llc07fp",
      "body": "Start coding on Leetcode while following Neetcode."
    },
    {
      "id": "llc15wx",
      "body": "Hasn't 3rd Semester start for u all, already ..."
    },
    {
      "id": "llcc9s1",
      "body": "Neetcode (a popular YouTube channel) has tons of videos on leetcode problems. You could watch that.\n\nBut if you want to learn in a more systematic manner , I suggest you go to neetcode.io website , in that , go to roadmap , there you have everything mapped out very very well. You can start from there. You'll figure it out how to start yourself.\n\nWish someone taught me this when I was in my 3rd year."
    },
    {
      "id": "llf7bnd",
      "body": "I am currently doing the AI tutor led DSA course in edmigo.in. The doubt solving feature helps for a beginner like me."
    },
    {
      "id": "llgrckn",
      "body": "interesting. what field do you think should a fresher focus on, web dev or dsa or anything else? im more interested in freelancing so i can cover my expenses while aalso studying"
    },
    {
      "id": "llhc6x3",
      "body": "DSA is something you can't skip. No matter what company or job role you apply to , it could be frontend development , backend development, data science jobs , devops job , anything , you'll need DSA because every company shortlists students based on DSA (which is always the first round in an interview).\n\nAs for freelancing , web development is super helpful. If you learn full stack (both front end and backend) , you can take small projects on sites like fiverr"
    },
    {
      "id": "lsu60eh",
      "body": "Bro just I checked dsa syllabus of unit 3 and unit 4. 😭Bro what's that syllabus ?it's so huge. And av summaries length 💀. How did you manage it?"
    }
  ]
}