{
  "id": "1f8mnnr",
  "title": "When is the right time to focus DSA (which semester)? ",
  "content": "In 1st year should we focus more on developing fundamentals and start DSA in 3rd semester or should we try to start DSA early?",
  "metadata": {
    "author": "ReasonableFeed2045",
    "url": "https://www.reddit.com/r/PESU/comments/1f8mnnr/when_is_the_right_time_to_focus_dsa_which_semester/",
    "permalink": "/r/PESU/comments/1f8mnnr/when_is_the_right_time_to_focus_dsa_which_semester/",
    "score": 14,
    "created_utc": 1725432125,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "llg9ubq",
      "body": "Oh god I fucking hate how people have JEE-fied the entire field now. The time to prepare for placements will come later, now is the time to explore and actually do the thing you are *in* college for: learn."
    },
    {
      "id": "llgc4rk",
      "body": "Maybe he jus means when's the right time to start delving  into dsa in general, nothing to do with placements"
    },
    {
      "id": "llgi594",
      "body": "That \"maybe\" is a huge stretch given that most people only care about DSA to get placed and not work on their problem solving skills. Either way, the question is already on FAQs for OP to refer to"
    },
    {
      "id": "llgn3tb",
      "body": "Do it in 3rd sem along side the course \nLearn other stuff now"
    },
    {
      "id": "llgvu9x",
      "body": "Wt courses shld we do in 1st semester?"
    },
    {
      "id": "llhe1lz",
      "body": "No dsa not only requires knowledge of data structures taught in 3rd sem but also the algorithms and methodologies like greedy and dynamic programming taught in 4th sem. The ideal time to start leetcoding would be after 4th sem in the summer. Its not the number of questions you solve that matters but the problem solving ability and applying the concepts of various ds and algos that matters."
    },
    {
      "id": "lli3uny",
      "body": "The earlier the better"
    },
    {
      "id": "llklyzc",
      "body": "Problem solving skills come from cp not dsa"
    },
    {
      "id": "lllawkq",
      "body": "Yesterday was the best time, and after that, today is. Just start small and learn it step by step without hurrying up"
    },
    {
      "id": "llz9qsw",
      "body": "Betichod ye sab karne se accha hai padhne baith ja"
    }
  ]
}