{
  "id": "1f8v1qv",
  "title": "does pesu allow retest for esa if someone misses or comes late.",
  "content": "https://www.hindustantimes.com/cities/bengaluru-news/btech-student-at-bengalurus-pes-university-dies-by-suicide-3rd-incident-in-a-row-101715841510100.html#:\\~:text=An%20anonymous%20social%20media%20user,college%20campus%20in%20Electronics%20City.",
  "metadata": {
    "author": "DistributionDizzy297",
    "url": "https://www.reddit.com/r/PESU/comments/1f8v1qv/does_pesu_allow_retest_for_esa_if_someone_misses/",
    "permalink": "/r/PESU/comments/1f8v1qv/does_pesu_allow_retest_for_esa_if_someone_misses/",
    "score": 9,
    "created_utc": 1725460888,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "llh2hv8",
      "body": "nope"
    },
    {
      "id": "llh2nxq",
      "body": "No"
    },
    {
      "id": "llh52ai",
      "body": "It will be a backlog and you can clear it during normal backlog exams"
    },
    {
      "id": "llh57iu",
      "body": "If you miss an ESA, you fail the course and get a backlog. You can attempt backlog exams as many times until you pass. So it's not a \"retest\", but it is not the end of the world since you have unlimited (paid) chances to clear it."
    },
    {
      "id": "llhfoj0",
      "body": "But won’t you get multiple certificates if you’re writing again and again ?"
    },
    {
      "id": "lli5e70",
      "body": "Only if you pass you're gonna get a separate marks card for the summer term."
    },
    {
      "id": "llk6vo9",
      "body": "Yes then isn’t it a bad thing? It’s always good to have 1 certificate instead of multiple right?"
    },
    {
      "id": "llkmenf",
      "body": "No you didn't understand, if you fail a subject, they'll provide you the semester markscard with that subject marked as F. Then later once you pass that subject they're gonna provide you a separate marks card for summer term only for that subject. If you failed more than one subject, those many subjects will be printed in that markscard."
    },
    {
      "id": "lllp630",
      "body": "Yes this I know.. But suppose you go to passport renewal.. Shouldn't you be taking both the certificates ie. the one which shows you failed and the one which shows you passed that subject later?"
    },
    {
      "id": "llnr4n8",
      "body": "oh so that will affect the final cgpa then?"
    },
    {
      "id": "llr81ij",
      "body": "How much do I have to pay?"
    },
    {
      "id": "llr882l",
      "body": "How much do I have to pay?"
    }
  ]
}