{
  "id": "1f9g165",
  "title": "Ece placements in pes",
  "content": "I am joining pes ece in ecc is the placements that bad as they say this year?",
  "metadata": {
    "author": "Wankandaman",
    "url": "https://www.reddit.com/r/PESU/comments/1f9g165/ece_placements_in_pes/",
    "permalink": "/r/PESU/comments/1f9g165/ece_placements_in_pes/",
    "score": 10,
    "created_utc": 1725518789,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "llldosu",
      "body": "i was gonna join but i am confused between msrit ete/eie/eee and pes elec city ece now"
    },
    {
      "id": "lllds9v",
      "body": "I had an option to go to rvitm ece ,dsce ece"
    },
    {
      "id": "lllduw0",
      "body": "Don't take eee it's very hard and not worth the work u will end up with ece or cse placements eventually"
    },
    {
      "id": "llldwji",
      "body": "i can get dsce cs , but i haven't heard anything good about it"
    },
    {
      "id": "lllf6p6",
      "body": "Only 30%placed ig"
    },
    {
      "id": "lllfb1l",
      "body": "Should I take rvitm ece?"
    },
    {
      "id": "lllfkey",
      "body": "Cse or cs spec which college u will get"
    },
    {
      "id": "lllflur",
      "body": "I have 7k rank and ece"
    },
    {
      "id": "lllfpre",
      "body": "Cet or comedk if cet then ig u can get pes ecc cs ai"
    },
    {
      "id": "lllfxwg",
      "body": "Kcet and I want ece"
    },
    {
      "id": "lllg1f8",
      "body": "Oh"
    },
    {
      "id": "lllm65h",
      "body": "what about ete ?"
    },
    {
      "id": "lllp9ab",
      "body": "Placements won't be combined ig with RVCE , but don't know that surely so check with them .. if placements aren't pooled with RVCE , then rvitm ain't worth."
    },
    {
      "id": "lllpuaj",
      "body": "When ever I ask someone that they say either it's combined and some say not combined honestly can't believe which is true,some say they asked management and they said it will be combined and some say they just say so students won't choose the clg!"
    },
    {
      "id": "lllrgp4",
      "body": "take pes ece ecc\natleast you can upgrade to cs if you work hard enough in your 2nd year\ndont take dsce\nand rit isnt sooo great, pes is way better"
    },
    {
      "id": "lllrlzz",
      "body": "i ws thinking of msrit ete ,\n\nlet's see\n\nwill do more research"
    },
    {
      "id": "lllrnul",
      "body": "I was in the same position as you, no regrets taking pes ecity"
    },
    {
      "id": "llltd1b",
      "body": "I've also gotten ece at EC.Someone please help me on this too https://www.reddit.com/r/PESU/s/qZqLVeLFan"
    },
    {
      "id": "lllthde",
      "body": "Don't take ete there are no good companies most companies take ece itself nd don't want ete ,,if u want to u shd be in top 10 in the branch...go with ece in pes ECity nd work smart u can change branch ,,even in ring road campus"
    },
    {
      "id": "llo3dqk",
      "body": "Xd , I have some of my friends ( RV peeps) who took admission in RVCE main campus , they asked about it and management Said that it will also depend on CGPA ( should be 9+ ) or so . And that 2023s batch was last batch to have common placements yet no clear information afaik"
    },
    {
      "id": "llqwrzp",
      "body": "Yes the placements were really bad this year. I'm in ECE EC campus and the last time I checked, which was around may, less than 10 people out of like 120 had been placed. The market hasn't been very good from last year and companies aren't hiring the way they used to. I'm not sure about the overall placements, but I've heard it was like 45%-55% this year"
    },
    {
      "id": "llqx3m9",
      "body": "You should probably go to MSR itself. PES ece isn't worth it and EC campus is definitely the worse pne when it comes to ECE. Imo, PES CS is maybe worth it but there's no reason to go for ECE, especially in EC campus"
    },
    {
      "id": "llqxu3a",
      "body": "Will it get better in next 4 years?"
    },
    {
      "id": "llr4343",
      "body": "even crowd is an issue in pes\n\n2700 kids just from kcet\n\npessat and management added, will be hectic af"
    },
    {
      "id": "llri6gr",
      "body": "Should probably be stabilized by the time you graduate. Effects of COVID started hitting last year and until it's fixed, the entire market will be down"
    },
    {
      "id": "llxafc2",
      "body": "Ahh that's rough unless you enjoy ECE"
    }
  ]
}