{
  "id": "1f9q276",
  "title": "Travelling ",
  "content": "I will be joining ec campus this year and I live 26 km away(RR nagar) from electronic city. I know I will be spending 1-1.5 hours in travelling from one side. I also applied for college bus but they said they will confirm after 2 days. So anyone already travelling to ec campus in and around RR nagar , how have you managed so far and what mode of transport do you use ?",
  "metadata": {
    "author": "Lost-Step-8395",
    "url": "https://www.reddit.com/r/PESU/comments/1f9q276/travelling/",
    "permalink": "/r/PESU/comments/1f9q276/travelling/",
    "score": 13,
    "created_utc": 1725552161,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "llngqft",
      "body": "naive of you to assume its 1-1.5hrs im assuming rr nagar is rajarajeshwari nagar i can guareentee you that while coming back it will take 2 -2.5 hrs to reach home in the evening,mornings it will be 1.5hrs, I didnt go through college bus as it was way to expensive for almost them same time , i travel through BMTC only you can use the nice road bmtc route but you have to change multiple busses to reach home but its faster."
    },
    {
      "id": "llnjevq",
      "body": "Yes rr nagar is Rajarajeshwari Nagar. I have a few questions so please don't mind me. Which bus do you travel by and how is the frequency of the buses?\nAnd did travelling affect your studies in any way?"
    },
    {
      "id": "llnjh4k",
      "body": "metro will be operational in ec by jan 2025. So till then its a struggle."
    },
    {
      "id": "llnpnol",
      "body": "I don't live in RR nagar I live near mudalapalya I take 2 busses to reach college one is 410/501 which goes to Banashankari then I go in 600f which goes to konappana agrahara which is the nearest bus stop to pes, in the mornings its pretty sweet to travel as no rush high frequency of busses the main problem is evening if the classes are till 4 there is an insane rush in both 600f and 410 i reach home by 6.30 ish and yes it does affect studying I have to study till 1 cause I'm in ECE so my sleep schedule is kinda fucked(only on 4pm days luckily it's in Thursday and Friday so Thursday is the only day I stay up late to study) rest all is kinda manageable but you have to effectively use your weekends since travelling wastes a lot of time"
    },
    {
      "id": "llntule",
      "body": "If OP lives near NICE road then there's bmtc buses which go thru it, afaik its called NICE-10 bmtc bus route. The bus frequency is 10-20mins"
    },
    {
      "id": "llnw14g",
      "body": "Oh okay , thanks"
    },
    {
      "id": "llnw4x5",
      "body": "No its a bit far from where I live."
    },
    {
      "id": "llo636a",
      "body": "Don't use college bus it leaves only at 5pm everyday regardless of when class ends. You just have to waste time in clg and reach home very late."
    },
    {
      "id": "llo6ohn",
      "body": "I suggest opting for PG it makes much better sense. It'll be a hassle to travel so far up and down everyday. If you're halfway in the travel in the morning and realise you forgot a book or some other item you're screwed. Plus you can't participate in clubs or other activities properly solely because of the travel back home.\nYes it's costly but in the long run it'll make much better sense trust me."
    },
    {
      "id": "llo980g",
      "body": "Do u know some good boys pg's nearby 🫠"
    },
    {
      "id": "lltt99g",
      "body": "I doubt it will start by Jan also, but hopefully pes will run shuttles to the station when it does start"
    },
    {
      "id": "lnqlqpx",
      "body": "Is 600f and 410 frequency low in the evenings?\nI have heard it's tough to catch them"
    },
    {
      "id": "lnqyuwz",
      "body": "Yep both have a little low frequency in evenings but hopefully your timetable will have only 2 days till 4pm if not I wish you all the best, cause to get into a 410 after 4pm is like a war"
    },
    {
      "id": "lnr071c",
      "body": "Damnn, only till the metro comes ig 🥲\nBtw any idea on how many half days are usually there in a week for the first-year?\nMaybe people like me joining through cet will have more full days too to compensate for the classes missed"
    },
    {
      "id": "lnr47cn",
      "body": "Which round if you guys are coming in through? for 2nd round councelling asfaik they had 4 days till 4pm and 1 day till 2.30 and this sem has already started late so...."
    },
    {
      "id": "lnr4kzf",
      "body": "Yeah I might be joining round 3 since I'm hoping for an upgrade to rr aiml"
    },
    {
      "id": "lnr74np",
      "body": "All the best man, this sem ain't gonna be fun for you"
    },
    {
      "id": "lnrasol",
      "body": "Amazing!"
    }
  ]
}