{
  "id": "1faanbs",
  "title": "Scared",
  "content": "I am a fresher of ece rr campus(I wanted ece only). I don't know why I am suddenly very scared about joining this college after reading this subreddit. Did I make the right decision? Is it really that bad? Pls seniors help. \n",
  "metadata": {
    "author": "BaseComprehensive323",
    "url": "https://www.reddit.com/r/PESU/comments/1faanbs/scared/",
    "permalink": "/r/PESU/comments/1faanbs/scared/",
    "score": 21,
    "created_utc": 1725613446,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "llrs05c",
      "body": "It will be pain in ass at beginning but worth during placements, and the knowledge you gain will be worth at the end cause syllabus is updated compare to others college"
    },
    {
      "id": "llrseqn",
      "body": "I am a fresher and I feel u when even I was reading more and more comments so me and my friends even searched other college comments and almost every where ull have such comments which will make us feel scared or feel if our decision is correct or not even I don't not have a proper answer I feel like we should just try and enjoy with the opportunity we get  and work hard and make the best of it that's all I can say"
    },
    {
      "id": "llsgovd",
      "body": "You've made a decision already and you'll stick with it. It's good that you're scared because it means that you know it'll not be easy and you'll put in the required effort. Moreover, a right or wrong decision is purely subjective and you get what you search for and not what you need on the internet. As a senior I can tell you that it's a good college with a lot of opportunities. You just gotta make the best of it. I wish you all the best for having 4 amazing years of your life."
    },
    {
      "id": "llsnkhn",
      "body": "The thing you've to understand is that people will be more keen on sharing their negative experiences than highlighting their good ones and also, people's negative reviews tend to retain our attention more than good ones. \nSo all I have to say is wherever you go you'll have to contend with both good and bad things. \nIt's upto you(and also a bit of luck) now to carve up a good four years for yourself."
    },
    {
      "id": "llt1gbc",
      "body": "Pes ece placements are shit\n\nIf fees isn't an issue thapar ece is definitely better for ece"
    },
    {
      "id": "lltn0go",
      "body": "Ece has great placements just study well and you'll get a good job. Do coding practice in the free time post 2nd year onwards ."
    },
    {
      "id": "lltst0j",
      "body": "Chill lol it's fine, pes is doing fine"
    },
    {
      "id": "llu1e8j",
      "body": ">I wanted ECE only\n\n>Do coding practice in the free time\n\nWhy will he want ECE if he plans to get a job in the Software field?"
    },
    {
      "id": "llw810c",
      "body": "It's one of the best colleges out there. There are people who'd give anything to join PES. Consider yourself extremely lucky"
    },
    {
      "id": "llwj6rv",
      "body": "Only last year in 2023 they were good"
    },
    {
      "id": "llx5tmn",
      "body": "Ece is like the pcmb of degree. Gives you an option to branch into either sw or hw fields."
    },
    {
      "id": "llx7kl5",
      "body": "Hey junior, I study here currently in 3rd sem. Trust me the teachers here are all in from your second year very very enthusiastic and ready to teach you 10 times (ik you hear this a lot) but trust you've made a good choice. Just go through the pes staff of ec campus for ece they are all highly educated trained professionals teaching from decades trust me if you are ready to put in all the effort you got they will help you through everything all you gotta do is approach them."
    },
    {
      "id": "llx7txn",
      "body": "And btw by the time you pass out the placements will be good because many companies are still setting up around Bengaluru placements won't be an issue. There are plenty of jobs but our people are not skillful all they want is a job but you gotta study good as well to get it."
    },
    {
      "id": "llx7xpa",
      "body": "Coding on what languages or a any particular ones? I'm in my 2nd year"
    },
    {
      "id": "llyoptm",
      "body": "Focus on DSAs and algorithms as most questions are on that . Core Java , python, SQL, Java script they'll ask you questions on that. Practice on leetcode or hackerrank and you'll do fine."
    },
    {
      "id": "llyp2bg",
      "body": "Most High paying jobs are software related, very few core subject placements will be there. ( Like barely 10% of the batch ) ."
    },
    {
      "id": "llytt8k",
      "body": "What does that have to do with my comment? Do you guys even read anything?"
    },
    {
      "id": "llyvfl2",
      "body": "Most people who take ece , electrical or mechanical to get core job end up taking IT/ Software jobs only . When you graduate come back to this comment and read the post/comment before replying."
    },
    {
      "id": "llyvlja",
      "body": "Are you dumb?"
    },
    {
      "id": "loseb3y",
      "body": "Ok thanks"
    }
  ]
}