{
  "id": "1fb0v6o",
  "title": "IS AIML JUST A HYPE ?",
  "content": "",
  "metadata": {
    "author": "PRAJWALHC",
    "url": "https://www.reddit.com/r/PESU/comments/1fb0v6o/is_aiml_just_a_hype/",
    "permalink": "/r/PESU/comments/1fb0v6o/is_aiml_just_a_hype/",
    "score": 14,
    "created_utc": 1725691439,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "llx6gko",
      "body": "Yea in ecity ig"
    },
    {
      "id": "llx6la5",
      "body": "Soo it's the mathematical thing and no 95% cse related as I heard 😂 ?"
    },
    {
      "id": "llx6v3d",
      "body": "Its just cse for those who couldn't get cse"
    },
    {
      "id": "llx708g",
      "body": "wdym?"
    },
    {
      "id": "llx7yz3",
      "body": "Aiml is more into mathematics and stuffs ?"
    },
    {
      "id": "llx814u",
      "body": "I have the option to choose cse in new horizon ( diff clg ) and pes aiml in ec campus Now what 🥹"
    },
    {
      "id": "llx899s",
      "body": "Search abt new horizon college on reddit and see what reviews PPL have to say. Same with ai ml branch.\nThen make your decision\nDo u have literally no other options?"
    },
    {
      "id": "llx8utt",
      "body": "There's no ruch reddit for new horizon ( it shows a game called new horizon 😂) And yeahh I don't have the other options"
    },
    {
      "id": "llx91jh",
      "body": "yes"
    },
    {
      "id": "llx96br",
      "body": "Abey no not their subreddit.\nJust go on Google and search new horizon college reddit, lots of PPL have complained on other subs like r/bangalore"
    },
    {
      "id": "llx98v9",
      "body": "I have seen all of them none are recent 🙃 or more info that I wanted"
    },
    {
      "id": "llx9m9w",
      "body": "Pes aiml course is way better than other colleges in blores aiml. They've included all core topics"
    },
    {
      "id": "llx9qdm",
      "body": "Hm. \nWell if it's placements that ur concerned about then pes probably has better placements. Ec campus has decent infra too. \nThe only issue is the branch. I've heard choice of electives for ai ml branch was limited. Nowadays ppl are saying not much difference between aiml and cs syllabus.\nAnd aiml placements will probably be similar to cs.\n\n\nIdk anything abt nhce placements , infra , syllabus,  peer grp etc."
    },
    {
      "id": "llx9qf9",
      "body": "Ohh okayy"
    },
    {
      "id": "llxa00g",
      "body": "Like being in aiml can i study for core cs and be a software engineer ? Like for the future ( not being an ml engineer stuffs )"
    },
    {
      "id": "llxagfx",
      "body": "\nU can read faqs on ai ml vs cs for more detailed answer from rowlet owl guy.\nBut tldr yes. I've heard u usually don't get hired for ai ml roles fresh out of ug, and need at least masters. \n\nSo ud be getting hired for same roles regular cs guys would anyway."
    },
    {
      "id": "llxb7k2",
      "body": "Yeahh I have read the whole thing that's why I am so confused 😭 some people say college>> course"
    },
    {
      "id": "llxd03j",
      "body": "I'd say course > college but the quality of the college also does matter. Do your research on NH, and if you think it'll work for you, go ahead with that"
    },
    {
      "id": "llxdhhf",
      "body": "Yeahh thanks 🫠"
    },
    {
      "id": "llxkx9j",
      "body": "Not sure about new horizon, it’s not in the top 10 list of colleges in Bengaluru so I would recommend cse aiml in ece but yes, do try to get in contact with people who know about the college and take a decision"
    },
    {
      "id": "llxl0r9",
      "body": "Yeah sure thanks 👍"
    },
    {
      "id": "llxq6qu",
      "body": "MS/PhD in AIML? Yes\n\nBE/BTech in AI? No\n\nYou'll be learning the basics of AI,ML,DL & Gen AI/LLM at max. Anyhow the college will teach you DS,Algos,CN,OS COA & other subjects which are important for Interviews & higher education"
    },
    {
      "id": "llxqetf",
      "body": "Ohh okayy 🧐 so I can take aiml just to complete btech ? And move on with software engineering?"
    },
    {
      "id": "llxqjo3",
      "body": "Yea why not?\n\nJust like what everyone said,AIML/ISE & etc were introduced so colleges can milk more money from CSE seats"
    },
    {
      "id": "llxqpe3",
      "body": "Yeahh I meant is it hard to manage both for cgpa ? I heard aiml is kinda tough soo"
    },
    {
      "id": "llxqrzn",
      "body": "For the academics"
    },
    {
      "id": "llxqxkz",
      "body": "I heard 95% of core cse syllabus is now merged with aiml is that true?"
    },
    {
      "id": "llxqxqj",
      "body": "AIML is just CSE-Hardwarw+AI subjects. TBH It should be easy to maintain good CGPA in AI compared to Elec subjects like Microcontrollers or other complex subjects like Cryptography which CSE offers. And it mostly depends on your faculty too."
    },
    {
      "id": "llxqzs6",
      "body": "Hoo okayy"
    },
    {
      "id": "llxrq4j",
      "body": "AIML in any college is  just cse with ai"
    },
    {
      "id": "llxsjy0",
      "body": "A lot of them say it is just introduced to milk money 😂 what are your veiws on this"
    },
    {
      "id": "llydwlc",
      "body": "Dude obv PES ecc aiml. Aiml is a perfectly good branch it's literally just cse with a few changes, very few. My cousin studied in new horizon and he says it sucks. The crowd is bad and the college takes little to no initiatives in any sort of industry connects plus, placements suck. PES ecc aiml is 100% better than new horizon cse. You can still do anything a cse core student can do. Companies do not treat you any differently in terms of opportunities."
    },
    {
      "id": "llyu0q3",
      "body": "Alright thanks I'll consider this 🦅🦅"
    },
    {
      "id": "lm3yvnm",
      "body": "it kind of is hype at the btech level, freshers aren't even being hire for spec roles just cause they have a degree with that spec, just take the better college.   \nAs the other guy put it, its just cse for people who couldn't get cse, the syllabus is really close."
    },
    {
      "id": "lm3zaje",
      "body": "it is right, if i am not wrong there is a limit on the number of students that can be there in one course, so they just created really similar ones, like cse( data science) or ( buisness systems), (cybersecurity) etc to get more students."
    },
    {
      "id": "lm9wck1",
      "body": "Ohk thanks :)"
    }
  ]
}