{
  "id": "1fb483x",
  "title": "For anyone who wants to join PESU for MBA",
  "content": "1. College timings for MBA is from 8 am to 6 45 pm\n2. Placement percentage is less than 50% past year\n3. For Completion of 1 year you have to complete three trimesters, so there will be total of 6 trimesters (T1- T6)\n4. T1 & T2 are mixture of every subjects like finance marketing HR . \n3. In T3 you have to choose your major and minor subjects \n4. After T4 you should start your interns\nThese are about academics .\nApart from that you will have research papers to submit which is senseless according to me. They will treat you as a PU Students.\nThere will be no happiness until and unless you get a good placement. They will not let you to sit free. They may even call you on Saturday and make a full day class. \nIf you have 15 lakhs and you want to enjoy your degree you should join other b school which ensures better placement also. \nAny queries feel free to ask.",
  "metadata": {
    "author": "Beautiful-Star2108",
    "url": "https://www.reddit.com/r/PESU/comments/1fb483x/for_anyone_who_wants_to_join_pesu_for_mba/",
    "permalink": "/r/PESU/comments/1fb483x/for_anyone_who_wants_to_join_pesu_for_mba/",
    "score": 36,
    "created_utc": 1725706482,
    "flair": "PESSAT/Admission",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "llysmzh",
      "body": "Really, less than 50% placement!?"
    },
    {
      "id": "llysqdj",
      "body": "Could I please text you regarding this?"
    },
    {
      "id": "llyx4p9",
      "body": "8 to 6.45 ? Why dude??"
    },
    {
      "id": "llyy94a",
      "body": "Ok"
    },
    {
      "id": "llyyel9",
      "body": "170-180 out of 400 got placed"
    },
    {
      "id": "llyyhsp",
      "body": "That's mental😭"
    },
    {
      "id": "llyyqvn",
      "body": "P in PESU stands for Prison"
    },
    {
      "id": "llyywta",
      "body": "Your classes started late or for wt reason?\n\nWill this be the same for the upcoming batch?"
    },
    {
      "id": "llyz6ho",
      "body": "No but either way they have to finish 6 trimesters right"
    },
    {
      "id": "llyz8nz",
      "body": "No particular reason. Dean thinks she is running IIM college"
    },
    {
      "id": "llyza1d",
      "body": "So two whole years either way, but yeah Christ and Dayanand Sagar management batches have already started"
    },
    {
      "id": "llyzoeu",
      "body": "That's sad dude.One of my friends who are super chill about academics is gonna join this year via pessat,this sounds concerning \n\nAny idea on when the classes may start?"
    },
    {
      "id": "llyzqg1",
      "body": "Is there a possibility that management quota students haven't been filled up for this year given the cost for each seat is 14 lakhs for two years??"
    },
    {
      "id": "llyzwjc",
      "body": "So for the whole two years that the timetable for you??"
    },
    {
      "id": "llz00ps",
      "body": "Even I'm joining this year, and I have a smalllllll feeling people have rejected the 14 lakhs seat and not joined and that is why the classes haven't started cuz they are finding more people to join their course. \nAlso PES MBA ads are blowing up and hence my suspicion."
    },
    {
      "id": "llz0a1o",
      "body": "Keep saying next month for sure it would start usually, whenever I have called them. Also said Oct tho pakka it would start. It is also related to PGCET somehow is what the front desk person says when I call them"
    },
    {
      "id": "llz0f84",
      "body": "Ohh,maybe idk.Last year for MCA it was in October,idk if it was the same for MBA too"
    },
    {
      "id": "llz0leg",
      "body": "Ohh makes sense.\n\nEnjoy your time now only then!"
    },
    {
      "id": "llz0s4v",
      "body": "Quite frankly I'm doing just that, thanks :)"
    },
    {
      "id": "llz1ilk",
      "body": "One have to write pessat exam but there are possibilities to enter without giving entrance exam"
    },
    {
      "id": "llzqmcs",
      "body": "October for Pessat students"
    },
    {
      "id": "lm3asqw",
      "body": "Bro not only MBA all management course are sameeee\n\nYou will feel like dying if ur dad doesn't have money to send u to abroad \n\nWhatever that chancellor speaks in orientation is false \nPlease do not trust this shit college \nPes is just good for infrastructure that's it"
    },
    {
      "id": "ltb6ljj",
      "body": "For this hectic schedule of PES I’m thinking to skip pes and opt Dayanand sagar. Pls give suggestions regarding it. My rank in pgcet is 553"
    },
    {
      "id": "mcdd2ey",
      "body": "Hey I am joining this year can anyone give a review on how the placements are?"
    },
    {
      "id": "mdklq7e",
      "body": "Hey even I am planning to join here can you tell about college life please "
    },
    {
      "id": "mdl5d3s",
      "body": "Good for marketing"
    },
    {
      "id": "mll43zj",
      "body": "how are placements for hr ????"
    },
    {
      "id": "mnfr5sb",
      "body": "HELL"
    },
    {
      "id": "mnfu3cv",
      "body": "As someone currently doing B.Com at PES, I want to be brutally honest—please think twice before considering an MBA here.\n\nI’ve spoken to several seniors, many of whom are currently doing their MBA at PES, and almost none of them recommend it. Even some of the faculty subtly (or openly) discourage students from pursuing it here. Why? Because it’s simply not worth the money or the mental toll.\n\nPlacements are underwhelming at best. The orientation for B.Com specializations in my 3rd semester was a huge red flag. The dean, without hesitation, said: “We take in only top-notch students with good rankings for MBA, so we don’t have to work much on them.”That right there shows the mindset they won’t support you, they’ll use your academic record to promote the institution while giving you the bare minimum in return.\n\nThey’re more focused on image than outcome. Don’t fall for the branding—look beyond the campus tours and glossy brochures. Choose wisely."
    }
  ]
}