{
  "id": "1fe9dut",
  "title": "NEED HELP",
  "content": "Hello seniors, I'm joining cse in ec campus this year through PESSAT. I may get ece in ec campus through kcet in 2nd round or extended round. Please help me take firm descision , should I continue with cse (PESSAT) or should I take ece (kcet) and shift to cse next year via branch change . I read in reddit that last branch change to cse in ecc happened at 8.05 last year. Also please let me know with your experience that how difficult is it to change from ece to cse in ecc. ",
  "metadata": {
    "author": "Working-Bank4419",
    "url": "https://www.reddit.com/r/PESU/comments/1fe9dut/need_help/",
    "permalink": "/r/PESU/comments/1fe9dut/need_help/",
    "score": 3,
    "created_utc": 1726059212,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lmljn6v",
      "body": "if your really 100% confident your gonna score atlaeast 9+cgpa by studying hard 1st year go for ece then you can do a branch change , if not i would stick to cse"
    },
    {
      "id": "lmlnl7m",
      "body": "Ece opportunities seem to be horrible in pes stick to cse will save you a lot of pain later"
    },
    {
      "id": "lmlw3jp",
      "body": "Don't take ece assuming ull get cse. If u study well there's a high chance u will but if u take ece be ready to stick with it if things don't go your way"
    },
    {
      "id": "lmm1ss8",
      "body": "I think in my first year, people who got above 9.5 were allowed to move to CSE. And believe me , getting something above 9 in the first year is really hard!\n\nIf you're very good , then take EC , otherwise , I suggest you stick with PESSAT CSE"
    },
    {
      "id": "lmmkqnd",
      "body": "Cse at ec campus has a much lower cut-off if I'm not mistaken around 7.5 for my batch"
    },
    {
      "id": "lmp71xt",
      "body": "Yeah last year it was 8.05 cgpa . Someone posted in reddit"
    },
    {
      "id": "lmqqx0r",
      "body": "This"
    }
  ]
}