{
  "id": "1fexx6e",
  "title": "Is choosing RVU over PESU a Viable decision? RVITM having combined placements is a doubt but RVU is confirmed atleast for another 5-6 years. With the limited batch size, syllabus not as updated as PESU but better than VTU. Even though RVU's first batch is yet to be placed I think this is a base line",
  "content": "",
  "metadata": {
    "author": "samrth_1991",
    "url": "https://i.redd.it/07cl1xdxfbod1.png",
    "permalink": "/r/PESU/comments/1fexx6e/is_choosing_rvu_over_pesu_a_viable_decision_rvitm/",
    "score": 1,
    "created_utc": 1726131235,
    "flair": "PESSAT/Admission",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lmqlhob",
      "body": "I ll fuck u up if u sit with us for placements after 4 yrs"
    },
    {
      "id": "lmqlk2k",
      "body": "I personally don't think it's worth it"
    },
    {
      "id": "lmqmbub",
      "body": "wrt to PES EC vs RVU too? ik EC campus has combined placements with RR.  \npeer group aint gonna be any different in EC with RVU even people with 7k in pessat got in CSE   \n7k/28k people who wrote the exam so a 25% chance of getting in if you attended counselling  \nwhereas RVU is 6.7k(first round cutoff) out of 71k  people attending kcet counselling though they also take through  their own exam(RVSAT)"
    },
    {
      "id": "lmqmfgt",
      "body": "fuel your rage towards the management not RVU/RVITM students.   \nits not their fault to want better oppurtunities now is it."
    },
    {
      "id": "lmqq57y",
      "body": "It's not like it's the students fault for picking the best offer put in front of them, do rvce students expect us to go \n\nHmm I'll get the best placements in rvu, but it'll annoy rvce so I'll instead sabotage myself and pick another college"
    },
    {
      "id": "lmqq8i8",
      "body": "I think it might be worth it if compared to ecc and in that non cse batch, because rv placements we've clearly seen are absolutely bonkers even in their side chicks colleges"
    },
    {
      "id": "lmqqpdv",
      "body": "It's still pre placements so idk at this point, but looking at rvitm it might be worth it so I'll put it this way \n\nIf it's PES university (pessat) vs RVU (kcet) pick RVU \nIf it's PES university (kcet) vs RVU (kcet) either works but maybe pesu for the proven track record \nIf it's PES university (pessat) vs RVU (rvsat) either works"
    },
    {
      "id": "lmqramj",
      "body": "Same companies even visit pes and the only advantage that rvce has over pesu is it's lesser crowd until now but now cs allied branches,rvitm and rvu being in same campus would definitely affect placements"
    },
    {
      "id": "lmqrdof",
      "body": "Nooo only rvce is good rest all are scam"
    },
    {
      "id": "lmqrphg",
      "body": "How are RVU and rvitm a scam, they have great placements man"
    },
    {
      "id": "lmqrspl",
      "body": "Rvu not even one batch has passed😅and placements depend on your skills"
    },
    {
      "id": "lmqrxx3",
      "body": "Rvsat cost is 6lpa "
    },
    {
      "id": "lmqs3x7",
      "body": "IMO, RVU is like a better option. RVU is insane, all their infrastructure is really nice and as for the placements they club RVU, RVITM and RVCE. When the companies come for interviews/tests, they usually don't tell wether the student is from RVU/RVITM/RVCE. I'm not sure if PESU is going through some sort of recession or what but this years placement has been barely touching 50%."
    },
    {
      "id": "lmqs78v",
      "body": "RVITM has better placements than PESU and not by a small margin."
    },
    {
      "id": "lmqs9dx",
      "body": "Rvitm has great placements and RVU will also have combined placements with rvce just like rvitm has, also not to mention even if you take all three intakes for cse in rvce, RVU and rvitm it's still 500 short of PES university's cse intake 💀"
    },
    {
      "id": "lmqsc2j",
      "body": "Kcet 10-12k u get rvitm🤣if it better than pesu it should have ended within 2k"
    },
    {
      "id": "lmqsd65",
      "body": "if you were in the same situation...you'd the same"
    },
    {
      "id": "lmqsf1t",
      "body": "Some random stats"
    },
    {
      "id": "lmqsok1",
      "body": "Are u a fresher joining rvu or rvitm"
    },
    {
      "id": "lmqsovo",
      "body": "No"
    },
    {
      "id": "lmqsr4n",
      "body": "World over not pesu🤣"
    },
    {
      "id": "lmqstm3",
      "body": "I'm not joining either all of what I've said is literally on the college's websites"
    },
    {
      "id": "lmqsufs",
      "body": "Wdym no 💀"
    },
    {
      "id": "lmqsz3r",
      "body": "It's not actually it's 5 lpa which is the same as pessat"
    },
    {
      "id": "lmqt06f",
      "body": "This."
    },
    {
      "id": "lmqt3oh",
      "body": "Idts he can accept that PESU actually has had horrible placements this year lmao"
    },
    {
      "id": "lmqt86k",
      "body": "Their ece placement percentage was less than 30% 😭"
    },
    {
      "id": "lmqt8vi",
      "body": "5.5lpa plus extra money they take"
    },
    {
      "id": "lmqti85",
      "body": "No it's 5 plus skill lab fees and exam fees, which every single private university takes too, Including PES university...it literally says on their website the fees is 5 lpa"
    },
    {
      "id": "lmqtvg2",
      "body": "Sooo still rvce>pesu>=msrit>=bms>>>uvce>sjce>dsce>nie>bmsit>>>rvu,rvitm,ruas"
    },
    {
      "id": "lmquak5",
      "body": "Everything about that list is wrong.\n1. SJCE has had mediocre at best placements in the last few years for non cse branches \n2. NIE management has ruined the campus, even the teachers ask students not to join NIE anymore, placement stats are blatantly misguided\n3. Msrit is not even in the same equation as pesu so idk why the = exists and \n4. Placement wise rvitm beat half the colleges you've mentioned this year \n5. Ruas is dogshit and to think you put it in the same category as rvitm makes it clear you don't know anything bout those colleges"
    },
    {
      "id": "lmqvg47",
      "body": "Like I said again, combine all three campuses for computer science for rv and it's still less than the 1.5k intake that PES university has for btech cse alone"
    },
    {
      "id": "lmqvjvc",
      "body": "😂😂😂 stop dreaming lol"
    },
    {
      "id": "lmqw7la",
      "body": "Pesu!=msrit"
    },
    {
      "id": "lmqx1dz",
      "body": "Pes>msrit or pes<msrit"
    },
    {
      "id": "lmqx2up",
      "body": "Pes>msrit ofc"
    },
    {
      "id": "lmqx5iw",
      "body": "No rvu isn't even aicte approved "
    },
    {
      "id": "lmqx96x",
      "body": "Ya the list is correct right"
    },
    {
      "id": "lmqxevi",
      "body": "Ok rvu >>>IITb"
    },
    {
      "id": "lmqxf31",
      "body": "Rest is correct."
    },
    {
      "id": "lmqxs10",
      "body": "It's a private university started by state, so it isn't required to be AICTE approved by law"
    },
    {
      "id": "lmqydwe",
      "body": "Again you're just missing the point, I'm not saying rvu is better than pes university, I'm saying every single negative thing you've said abt it is wrong"
    },
    {
      "id": "lmqyzra",
      "body": "Ok peace✌️ btw which college are u joining "
    },
    {
      "id": "lmqz6lh",
      "body": "Already joined and it's got \"brand\" 🤭"
    },
    {
      "id": "lmr02tr",
      "body": "Rvce or rvu??senior or fresher??"
    },
    {
      "id": "lmr59p6",
      "body": "Horrible placements ? What ? Pes placements r second to only rv this year lmao and that too not by much"
    },
    {
      "id": "lmr5deq",
      "body": "That's just factually incorrect lmao. Go cope somewhere else"
    },
    {
      "id": "lmr7rt3",
      "body": "Go see the spreadsheet lmao.. You're just yapping shit abt pes for no reason"
    },
    {
      "id": "lmspin6",
      "body": "Yeah rvce cs spec=pes rr cse "
    },
    {
      "id": "lmszv2f",
      "body": "Literally every college has had lower placements. \nSee this once\n\n\n2024:https://www.reddit.com/r/PESU/comments/1dxg3m8/placement_statistics_2024/\n\n\n2023:https://www.reddit.com/r/PESU/comments/xyl4cs/placement_stats_for_2023_batch_ongoing/"
    }
  ]
}