{
  "id": "1fex48v",
  "title": "I don't mean to harm anyone's feelings but I'm genuinely curious because this will be my first time living away from my family in a new city.",
  "content": "*I don't mean to harm anyone's feelings but I'm genuinely curious because this will be my first time living away from my family in a new city.*\n\nHi all! I'll be joining pes rr this year as a cse with aiml student. Although I'm thrilled to be here, I'm also kind of scared of everything that's going on in Bengaluru right now (as shown in news and other reddit posts). Is there really some sort of discrimination against people from north? Will there be something like this in the college campus by professors and other students if I can't speak kannada? \n\n",
  "metadata": {
    "author": "curious_burger",
    "url": "https://www.reddit.com/r/PESU/comments/1fex48v/i_dont_mean_to_harm_anyones_feelings_but_im/",
    "permalink": "/r/PESU/comments/1fex48v/i_dont_mean_to_harm_anyones_feelings_but_im/",
    "score": 23,
    "created_utc": 1726127574,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lmqgaja",
      "body": "Hi I am also coming for cse aiml in pes , i have been in blr for the past 2 years and I haven't seen any  discrimination as such"
    },
    {
      "id": "lmqgism",
      "body": "I can confirm 😐"
    },
    {
      "id": "lmqgk7v",
      "body": "From teachers side none at all, as far as students go i havent seen anything"
    },
    {
      "id": "lmqgzu6",
      "body": "Bro chill, idk about the locals in blr, but the students are so good.."
    },
    {
      "id": "lmqh2u4",
      "body": "There's no discrimination. Some incidents are being used for fear mongering. You'll be safe on both the campus and in the city."
    },
    {
      "id": "lmqhtxu",
      "body": "What about the professors?"
    },
    {
      "id": "lmqim7r",
      "body": "common people couldnt care less if you speak kannada or not. On internet things are exagarated. \n\nThere are many people in br who cant speak kannada , the max that can happen is you getting trolled for not knowing kannada despite being in karnataka. just like you will trolled in north if you dont know hindi."
    },
    {
      "id": "lmqj7xn",
      "body": "North Indian here, settled in Bangalore for over a decade now.  \nOn any given day, Bangalore is more safer than majority of north indian cities.\n\nLocal citizens here are polite and welcoming. There are some incidents (that you would have seen on social media) happened in recent past (especially with Autowalas), those are one off road rage cases that happens in other cities as well (however, in Bangalore it get highlighted easily - may be because of people here are more tech savvy and almost everyone you see around you will have a smartphone in hand).   \n  \nOverall people in Bangalore are down to earth (they don't believe in showoff culture)."
    },
    {
      "id": "lmqko96",
      "body": "There's different washrooms for kannada speakers and non kannada speakers. \n\nBasically there's a bouncer in front of them and you have to show atleast 30 seconds of kannada speaking. They also have a database of everything so you can't say the same thing over and over again. \n\nIf you get caught trying to cheat, you'll be instantly banned from the washrooms. This includes the washroom in the placement centre."
    },
    {
      "id": "lmqkwgc",
      "body": "I witnessed this when I went to submit my docs at the campus, quite scary :("
    },
    {
      "id": "lmqkyjx",
      "body": "Wtf??"
    },
    {
      "id": "lmql4z9",
      "body": "It's especially bad for people with nervous bladders. Just yesterday I saw a 4th year guy about to give an interview for openai. But he needed to use the washroom. \n\nUnfortunately he's been banned cause of cheating in 2nd sem, and he ended up tanking the interview just so he could pee.\n\nGuys, never cheat in tests."
    },
    {
      "id": "lmqlhug",
      "body": "chill dude media just highlights it too much, even i am not a Kannadiga, most of my friends cant speak kannada, no problem at all, Bangalore people are very welcoming dw.   \nAlso i think most of the staff in the college are also people from other states."
    },
    {
      "id": "lmqpnll",
      "body": "This sounds so fuckall"
    },
    {
      "id": "lmqpoyd",
      "body": "All communications in English. There are many North Indian profs as well, dw"
    },
    {
      "id": "lmqthi9",
      "body": "Common friend, why should someone offend you for not knowing kannada? PPL would be waiting for northies to arrive just to teach them kannada bad words. If u r a boy you'll soon be seen saying suleg huttu sule magane Amman jalagara......"
    },
    {
      "id": "lmqwkgz",
      "body": "You don't have to worry about all that. Bangalore has a population over 1 Crore , the chances of that happening to you is almost none"
    },
    {
      "id": "lmr1z2v",
      "body": "Your concern is valid. This won’t happen to you in college that is guaranteed, but don’t try to offend any locals outside. It might cause a problem."
    },
    {
      "id": "lmr3fol",
      "body": "how yall so gullible"
    },
    {
      "id": "lmr4iaj",
      "body": "Medias show one in a million cases (which happens everywhere in India not just here) as if they are common incidents occurring to everyone. Ur as safe here as in any other metropolitan city in India if not safer. Knowing kannada would be helpful for sure as it makes it easier to talk to the locals but it isn't mandatory and as long as u don't yell at auto drivers and such, they won't bother you"
    },
    {
      "id": "lmrw7da",
      "body": "Make sure people don’t use you for your body and sex"
    },
    {
      "id": "lmrx66y",
      "body": "Bro literally you are overthinking it's all chill here even if you don't know kannada , but please try to understand some basic sentences so that it will be helpful for you"
    },
    {
      "id": "lmrz3fs",
      "body": "Bro inside college 100% guaranteed nobody will give a shit, outside also 99.99% don't give a shit at all, blr people are quite nice only. "
    },
    {
      "id": "lmtc7ub",
      "body": "the other day, i accidently spoke english instead of kannada in one of the buses and everyone gave me a death stare\n\ni jumped out of the bus midway, hurt myself on the road but im lucky to have gotten away with my life"
    },
    {
      "id": "ln17lac",
      "body": "Guys don't be this dim, get the sarcasm 💀"
    },
    {
      "id": "ln17o3a",
      "body": "Guys don't be this dim lmao get the sarcasm 💀"
    },
    {
      "id": "lwopjzr",
      "body": "Ohh really? Come to your 2nd pu college and we are gonna show you what discrimination is 🤣😈"
    }
  ]
}