{
  "id": "1fggt8c",
  "title": "Bro the claims😭😭",
  "content": "",
  "metadata": {
    "author": "Unfair-Strength272",
    "url": "https://v.redd.it/zca7tyqz9qod1",
    "permalink": "/r/PESU/comments/1fggt8c/bro_the_claims/",
    "score": 59,
    "created_utc": 1726299256,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ln232q5",
      "body": "A mascot that contradicts the college values. Now that's PESU for you 😎😎✨✨."
    },
    {
      "id": "ln25rgl",
      "body": "Eh, claim makes sense. Last year's, placement stats do support this.\n\nAs a current fourth year, I get a mail almost every other day from pesu placements, with mostly tier one companies."
    },
    {
      "id": "ln260en",
      "body": "W pesu.. \n\nThis was actually an appreciation post.. The title looks like it's some defamation post or something xd"
    },
    {
      "id": "ln29i7k",
      "body": "Also most of my friends with less than 8.5 cgpa got placed with more than 12 lpa jobs"
    },
    {
      "id": "ln2aw8l",
      "body": "Umm not completely true lmao.. I remember seeing last year's placements stats in orientation last month, in that the category with >8.75gpa had some 70 odd unplaced students💀"
    },
    {
      "id": "ln2baiw",
      "body": "How's the placement policy there ? If we get a job above 15lpa will they allow to sit for better opportunities?"
    },
    {
      "id": "ln2bvn6",
      "body": "Idk if it's true or not, but i remember him saying that almost 25 percent of the students go for higher studies right after their bachelor's.. And pes doesn't even maintain the data of registered students , pes only shows the total number of eligible students and placed.."
    },
    {
      "id": "ln2y2yz",
      "body": "Yeah that's true. I think in my mind I assumed those guys went unplaced at that time💀"
    },
    {
      "id": "ln35xtk",
      "body": "No, if u get a tier 1 job, then that's it, you're out of placements.."
    },
    {
      "id": "ln35zb5",
      "body": "No, if u get a tier 1 job, then that's it, you're out of placements.."
    },
    {
      "id": "ln4h7qa",
      "body": "*Except for dream companies"
    },
    {
      "id": "ln4hkk6",
      "body": "Ohh dream tier is altogether a different tier? I thought it comes under tier 1 itself.."
    },
    {
      "id": "ln4jcy1",
      "body": "It's above T1"
    }
  ]
}