{
  "id": "1fggpsp",
  "title": "100% refund for RR Campus\"faint hearted students\" today 💀🙏",
  "content": "Title",
  "metadata": {
    "author": "samrth_1991",
    "url": "https://www.reddit.com/r/PESU/comments/1fggpsp/100_refund_for_rr_campusfaint_hearted_students/",
    "permalink": "/r/PESU/comments/1fggpsp/100_refund_for_rr_campusfaint_hearted_students/",
    "score": 50,
    "created_utc": 1726298749,
    "flair": "PESSAT/Admission",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ln1wr16",
      "body": "?"
    },
    {
      "id": "ln1wxkt",
      "body": "Jawahar told that in orientation today"
    },
    {
      "id": "ln1x920",
      "body": "Jawahar told that in orientation today"
    },
    {
      "id": "ln1xca8",
      "body": "Lol now we can't say we did not get warned"
    },
    {
      "id": "ln1xf17",
      "body": "me watching first-year students getting f\\*ked"
    },
    {
      "id": "ln1xr5g",
      "body": "I seriously hate the management here. They talk in a fake \"perfect English\". And that random guy who can't stop saying \"so on and so forth\". The way they act like a bachelor's at pes is some world renowned feat. And the fact that there's literal bouncers everywhere. \n\nBro makes it look like a politician's backyard"
    },
    {
      "id": "ln1xr7j",
      "body": "Context?"
    },
    {
      "id": "ln1y5r9",
      "body": "Jawahar acknowledged that PESU is academically more stressful than every other college in Karnataka.\nHe said that it isn't for the \"faint hearted students, you can't say you weren't informed before\" therefore they are allowing you to get 100% refund on fees if you go to the admission office today."
    },
    {
      "id": "ln1ykg9",
      "body": "Dude confidently implied that PES is on par with IITs when he was addressing 2nd and 3rd year students a few weeks ago."
    },
    {
      "id": "ln1zvu7",
      "body": "Is this really true?"
    },
    {
      "id": "ln21lzb",
      "body": "[ from 1:49:00](https://www.youtube.com/live/wNMB3MqPZBI?feature=shared)"
    },
    {
      "id": "ln22760",
      "body": "First official warning that \"why you shouldnt join PESU\" guy gave the unofficial one"
    },
    {
      "id": "ln22y9i",
      "body": "Don't you know? By 2069 pes will overtake iitb. Not only that it will compete with universities across the globe. \n\nYou might not see it now, but the updated syllabus is leaps and bounds ahead of the competition. Students are taught quantum physics in the first year, imagine what they'll be able to do in 4"
    },
    {
      "id": "ln236sq",
      "body": "Dude fr mentioned in the orientation (2nd year's) that in some years pesu is gonna be the most technically advanced university globally"
    },
    {
      "id": "ln250kb",
      "body": "You jest, but this is something I can definitely imagine Jawahar saying."
    },
    {
      "id": "ln2b21e",
      "body": "Bro iiitb exists--"
    },
    {
      "id": "ln2bskm",
      "body": "He is speaking wrt the other private colleges in bangalore for example rvce bms msrit"
    },
    {
      "id": "ln2cjwc",
      "body": "ahh fair enough"
    },
    {
      "id": "ln2cqy0",
      "body": "Kind of far fetched claims. In karnataka itself they have tough competition to catch up with like iiitb who also have updated syllabus and dream packages."
    },
    {
      "id": "ln2fs3l",
      "body": "Call me when those people are leaving advanced quantum physics in their first year"
    },
    {
      "id": "ln2iiv9",
      "body": "Yeah get refund and then go where, it's like we basically don't have a choice lol"
    },
    {
      "id": "ln2mhbj",
      "body": "i was wondering about NITK, iiitb intake is prolly less right."
    },
    {
      "id": "ln2u6xh",
      "body": "Kcet counselling is still going on dawg"
    },
    {
      "id": "ln3bmer",
      "body": "What is the context? Can someone please tell."
    },
    {
      "id": "ln3kqvj",
      "body": "ive written it check the other comments"
    },
    {
      "id": "ln48c3i",
      "body": "it's govt institution and afaik iiitb is public cum private"
    },
    {
      "id": "ln4mygm",
      "body": "Their tagline should be “A source for life-long trauma”"
    },
    {
      "id": "lngug3g",
      "body": "sometimes life-ending trauma."
    }
  ]
}