{
  "id": "1fgj2lk",
  "title": "what will be the timings for bootstrap? Do we need to get laptop and notebooks as well from 17th-21st?",
  "content": "?",
  "metadata": {
    "author": "DistributionDizzy297",
    "url": "https://www.reddit.com/r/PESU/comments/1fgj2lk/what_will_be_the_timings_for_bootstrap_do_we_need/",
    "permalink": "/r/PESU/comments/1fgj2lk/what_will_be_the_timings_for_bootstrap_do_we_need/",
    "score": 16,
    "created_utc": 1726309571,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ln2dfuo",
      "body": "nope nothing"
    },
    {
      "id": "ln2gkaa",
      "body": "Nothing bro just chill out and come"
    },
    {
      "id": "ln2jk2z",
      "body": "Just get your ID card, nothing else is necessary"
    },
    {
      "id": "ln2vxfv",
      "body": "ok and what will be timings? 8 till 4pm for even bootstrap?"
    },
    {
      "id": "ln2wsa7",
      "body": "Hey did everyone already get their ID cards, when I was at the orientation I asked and they said it will be given later. I only recieved the SRN number which i used to log into the app"
    },
    {
      "id": "ln2xd8e",
      "body": "The ID I got has an expiry date of September 2024, which means they'll probably give a proper ID later on, maybe after Bootstrap. Not everyone has an ID card, dw"
    },
    {
      "id": "ln2xemt",
      "body": "No idea lol they'll probably send a mail about that"
    },
    {
      "id": "ln2ysqr",
      "body": "Ayyo when did they give the srn, also, are srn and prn the same?"
    },
    {
      "id": "ln30vht",
      "body": "Oh ok thanks"
    },
    {
      "id": "ln30y61",
      "body": "Oh ok thank you!"
    },
    {
      "id": "ln310i5",
      "body": "Oh ok thanks"
    },
    {
      "id": "ln316bb",
      "body": "Sorry I only got the PRN but I was told the SRN number is just the email Id registered"
    },
    {
      "id": "ln31f3h",
      "body": "Check the FAQs or search this subreddit"
    },
    {
      "id": "ln36ob5",
      "body": "Ahh I see, thanks!"
    },
    {
      "id": "ln37145",
      "body": "Will do"
    },
    {
      "id": "ln3bgj6",
      "body": "Bro dont even bring a bag da just get some cash get you phone and most importantly get your I'd card and ull be fine focus on chilling"
    },
    {
      "id": "ln3rmq0",
      "body": "Am I the only one who got confused on comment on bootsrap, whether it will be there or not?  \n  \nInitially he said there won't be bootstrap this year. Then he started explain what will happen during bootstrap. I am confused, there there will be bootstrap or there won't be."
    },
    {
      "id": "ln47ib2",
      "body": "When did they give PRN?"
    },
    {
      "id": "ln47r5n",
      "body": "I got it when I submitted all my documents"
    },
    {
      "id": "ln6mrpe",
      "body": "Are you a pessat student? How did they give it to you? By main or they gave it to you"
    },
    {
      "id": "ln7cwwi",
      "body": "I got in through management they had given it to me the day they called me to submit my documents"
    }
  ]
}