{
  "id": "1fh9wzc",
  "title": "Can Someone Explain The Sliding Rounds/Transfers That Jawahar Mentioned today in Orientation ",
  "content": "he was saying something about kcet vacancies and something can someone explain it in detail thanks",
  "metadata": {
    "author": "samrth_1991",
    "url": "https://www.reddit.com/r/PESU/comments/1fh9wzc/can_someone_explain_the_sliding_roundstransfers/",
    "permalink": "/r/PESU/comments/1fh9wzc/can_someone_explain_the_sliding_roundstransfers/",
    "score": 11,
    "created_utc": 1726397990,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ln889bx",
      "body": "Same question. He said that after CET 2nd round they will not open the seats to CET. What does this mean?"
    },
    {
      "id": "ln8q7hf",
      "body": "Basically after a specific deadline (I think after the first sem), if your CGPA is high enough, you may get the chance to change \"Upgrade\" your branch or campus. For instance, if you get Mechanical at first and keep your CGPA above like 9.5 or some really high margin, after that deadline comes you may be shifted to a higher branch like AIML depending on your choice and on the number of seats vacant in given branch.  \nUnless you are a really high performing student, I'd suggest you not to worry about it."
    },
    {
      "id": "ln8qtb1",
      "body": "he said it will be after kcet 2nd round not first sem"
    },
    {
      "id": "ln8se66",
      "body": "Makes more sense because a few people will shift from PESSAT quota to KCET quota, leaving vacant seats"
    },
    {
      "id": "ln93py1",
      "body": "makes sense for vacant pessat seats but vacant kcet seats after second round isnt allowed by kea either"
    },
    {
      "id": "ln94s2e",
      "body": "when you say second round you mean second extended round right?"
    },
    {
      "id": "ln9a1rv",
      "body": "he specifically mentioned second round"
    },
    {
      "id": "ln9jt1n",
      "body": "Link and timestamp please"
    },
    {
      "id": "ln9l8ke",
      "body": "[EC from 2:46:45](https://www.youtube.com/watch?v=NtW0VRkNp2Y) [RR from 2:50:32](https://www.youtube.com/watch?v=wNMB3MqPZBI)"
    },
    {
      "id": "ln9wk2x",
      "body": "vacant seats after second round is allowed by kea but vacant seats after second extended round is not allowed right?"
    },
    {
      "id": "ln9x1pb",
      "body": "no its the other way round   \nvacant seats after second round have to be given to students through kcet only   \nthe 1-2 seats that are rarely vacant after second extended round can be given ig since you have to pay 5x times fees if you dont report to college"
    },
    {
      "id": "lna0zcx",
      "body": "Ig he meant second extended round??"
    },
    {
      "id": "lna12g2",
      "body": "Does this mean you can't try for other colleges during second extended round "
    },
    {
      "id": "lna4wjx",
      "body": "If he meant that then its actually a good thing"
    },
    {
      "id": "lncjyus",
      "body": "Yes true... so ig he meant second extended round instead of second round."
    }
  ]
}