{
  "id": "1fib2g8",
  "title": "SEM3 ISA CSE",
  "content": "Could someone provide insights on the difficulty level of the ISA 1 exam and the sources from which questions will be asked across all subjects? Also, any information about the order of subjects scheduled for the upcoming days would be greatly appreciated. Your input is highly valued.",
  "metadata": {
    "author": "ElonMosquitoX",
    "url": "https://www.reddit.com/r/PESU/comments/1fib2g8/sem3_isa_cse/",
    "permalink": "/r/PESU/comments/1fib2g8/sem3_isa_cse/",
    "score": 25,
    "created_utc": 1726508950,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lnk70kw",
      "body": "dsa and afl are gonna be relatively easy.  \nsds will be easy for you, if youre good at math.   \nwt on the other hand might be tough for you only if you havent prepared it before hand.   \nDDCO will by far be the toughest of them all."
    },
    {
      "id": "lnk93f7",
      "body": "Sds is shit filled with theory and it's like hundreds of pages, any advice for that?"
    },
    {
      "id": "lnkqkne",
      "body": "The theory from first unit regarding sampling methods isnt as important as the numericals. most of the qeustions they'll ask you will be numerical based. even if you do leave the initial theory about sampling methods, it shouldnt really be that big of a deal, you may lose some marks. My advice is just to go over the sampling methods and other bits of theory once just read through it.\n\nfor us, vast majority of the questions were from the numerical side of things. So, I'd recommend you to prioritize numericals. I personally didnt put that much effort into, just read it a couple of times and it worked out for me. Again, with that being said, you might run the risk of forgetting stuff and losing a couple of marks here and there if you just simply go through it a couple of times. But losing one or two marks in theory doesnt compare to the amount of marks youd lose if youre not good at the numericals."
    },
    {
      "id": "lnldz3g",
      "body": "Blud hasn't experienced CN and Os yet. We got only   mcqs from theory in our sds isa 1 though"
    },
    {
      "id": "lnleg5f",
      "body": "Yeah not yet,tysm."
    },
    {
      "id": "lnosnu4",
      "body": "Where can we see previous year isa question paper? Or reference to isa question what kinda questions will be asked"
    }
  ]
}