{
  "id": "1flcy7h",
  "title": "Tiffin/Monthly Meal service near PES (RR)",
  "content": "Asking this once again since nobody gave any answer last time 🥲, Please let me know if you have any leads for Monthly tiffin service near Pes rr campus, this is for people who are living in flats near campus.",
  "metadata": {
    "author": "Future_Net2117",
    "url": "https://www.reddit.com/r/PESU/comments/1flcy7h/tiffinmonthly_meal_service_near_pes_rr/",
    "permalink": "/r/PESU/comments/1flcy7h/tiffinmonthly_meal_service_near_pes_rr/",
    "score": 6,
    "created_utc": 1726841422,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lo1y04l",
      "body": "Let me know (commenting here for better reach)"
    },
    {
      "id": "lo1zskb",
      "body": "How much are you willing to spend per meal??"
    },
    {
      "id": "lo2075s",
      "body": "2 time meal i.e Lunch and dinner and monthly around 5 or 6 max"
    },
    {
      "id": "lo20t3p",
      "body": "Hmm,It’s really tough to find an established meal service in the range of 80-100 per meal,I would recommend asking around in your apartment group chat,more often than not there’s always a sweet aunty that would make food and put it into a dabba that you give her but I don’t think it’ll fit your budget.Your best and safest bet is probably learning to cook and meal prep,the best for your health and peace of mind."
    },
    {
      "id": "lo21gml",
      "body": "Brahmashree Tiffin center is good and excellent"
    },
    {
      "id": "lo26z7a",
      "body": "you can just opt for the hostel mess (i have a friend who lives in a flat but eats food in the mess) , i reckon its 5k per month , just enquire there once"
    },
    {
      "id": "lo27430",
      "body": "Let’s see, this is definitely the last option"
    },
    {
      "id": "lo277q0",
      "body": "How much for a month and do they deliver to home or we need to pickup ourself?"
    },
    {
      "id": "lo27r3r",
      "body": "Thank you!"
    },
    {
      "id": "lo2vbni",
      "body": "That I am not sure, enquire there once"
    }
  ]
}