{
  "id": "1fm0it5",
  "title": "Clg bus or BMTC",
  "content": "I live near majestic so I have option of taking bmtc to electoric city campus. But I don't know how crowded it gets especially in the afternoons while coming back. \n\n\nIs taking the clg bus better as even that passes through pretty near to my home or is BMTC viable option or not worth it. It'll take me 1½ hrs to reach EC campus with BMTC. \n\nThoughts?",
  "metadata": {
    "author": "Hot-Green-4597",
    "url": "https://www.reddit.com/r/PESU/comments/1fm0it5/clg_bus_or_bmtc/",
    "permalink": "/r/PESU/comments/1fm0it5/clg_bus_or_bmtc/",
    "score": 4,
    "created_utc": 1726916715,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lo6wsaq",
      "body": "Metro will start very soon and that will be the ideal way to commute.  /s"
    },
    {
      "id": "lo7ce9a",
      "body": "i have seen daily the college bus leaves at 5 the bus will be crowded like bmtc itself so good to take bmtc as you have flexibility of travelling"
    },
    {
      "id": "lo7toh5",
      "body": "I think I am qualified to talk about this - I have been travelling 30 kms one way via bmtc for the past week. The best bus rn is the KIA bmtc buses ( volvo brand) . They go much faster and take you direct, you dont even have to switch stops. I have unfornuately opted for the clg bus, not knowing the devlish ecity traffic after 5pm. You dont do this mistake. Leave before 4:30 and you will save a lot of time."
    },
    {
      "id": "lo7tz9u",
      "body": "Also there is nice flexibilitty in BMTC as the 500 series bus frequency is crazy high, even the ac ones come through a lot. AC buses generally cost a little more than the non ac ones. But if you are willing to pay for the clg bus then might aswell pay here cuz freedom is a great factor."
    },
    {
      "id": "lo8a1al",
      "body": "Do KIA buses stop at every stop? I thought non-airport passengers cant get in"
    },
    {
      "id": "lo8p2hy",
      "body": "Thanks alot man. I was told to get clg bus exactly because it wouldn't be crowded like BMTC. If it's gonna be crowded either way, I'd rather save money and take the BMTC and have flexibility of leaving campus. \n\nSo am I safe in just trying to get bus pass?. How's the traffic from EC towards Bengaluru."
    },
    {
      "id": "lo8p9kq",
      "body": "Damn, so even clg busses are crowded like hell. Didn't expect that."
    },
    {
      "id": "lobtbcn",
      "body": "Non - airport passengers can get it, it doesnt really matter. The kia-8 bus is just costs a little more. Futhermore the KIA bus doesnt stop at every other stop but it does for the major ones, and if you tell the conductor/driver to stop for a second at a particular point he might just do it. What i have noticed in the past week is that 2 Kia busses are near the ECITY bus stop (the where you have to cross the bridge), these 2 KIA buses fluctuate between 3:55 pm -> 4:31 pm \n\nIt is safer to take them and save your time...Anyhow you can meet others on campus and coordinate with them too to find the suitable bus.\n\ncheers!"
    },
    {
      "id": "lobtgw1",
      "body": "( Replied in dms )"
    },
    {
      "id": "loc3v30",
      "body": "I am okay with the cost... the problem is that the only frequent bus which goes to ecity from marathahlli side are the airport buses.."
    },
    {
      "id": "lojhc2c",
      "body": "Yes, take the airport buses, be on time for it. They are worth it. No problem !"
    }
  ]
}