{
  "id": "1fm95w4",
  "title": "i hate college",
  "content": "fuck what am i supposed to do with my life , I'm an introvert , zero friends & shit at everything except maths\n\nI'm in second year and I'm like invisible to everyone around me. I have really bad anxiety and can't talk to anyone without going into a full blown panic attack\n\n  \nmy cgpa is  @ 7.00 , I don't fit in with anyone , I can't even make eye contact with anyone without getting stressed. my life so cooked - what am i gonna do after college ",
  "metadata": {
    "author": "Wise-Noise-1395",
    "url": "https://www.reddit.com/r/PESU/comments/1fm95w4/i_hate_college/",
    "permalink": "/r/PESU/comments/1fm95w4/i_hate_college/",
    "score": 91,
    "created_utc": 1726942304,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lo8tk7f",
      "body": "I used to be like you, still am to am extent but much better. Try to actively start convos instead of waiting for ppl to interact with you That helped me a lot"
    },
    {
      "id": "lo8vh5i",
      "body": "Gym"
    },
    {
      "id": "lo907ry",
      "body": "Try to initiate convos atleast through reddit and then irl"
    },
    {
      "id": "lo918cg",
      "body": "Uhh\nTf we supposed to do , get some friends genius \nPfft , 7 cgpa ain't getting u nowhere btw"
    },
    {
      "id": "lo92rqg",
      "body": "thanks for stating the obvious"
    },
    {
      "id": "lo92zho",
      "body": "I'm not sure how to say it but i have no social skills , like how do i talk to people? like do i just randomly ask them something?"
    },
    {
      "id": "lo93czo",
      "body": "Start with who sits beside u"
    },
    {
      "id": "lo94k3n",
      "body": "Hey we can be friends tho 😃"
    },
    {
      "id": "lo9957t",
      "body": "Look, I made my closest friends in college in 2 year, so you'll be fine. \n\nJust start talking about anything. Whenever they respond back, there's always something in their response that you frame as a question and ask.\n\nHonestly faking confidence until you get some is a pretty nifty way lol, try it out.\n\nIf you have some interest, join a club, you'll have people with similar interests.\n\nI feel like a baba now, but try to grow, the uncomfortable shit you do now makes your life better later."
    },
    {
      "id": "lo9so5e",
      "body": "Is someone making friends here 👀👀"
    },
    {
      "id": "lo9y79p",
      "body": "One word: Confidence. Hey I don’t know if this is going to work but it did work for me. I started befriending extroverts by just talking to them building my confidence brick by brick. I started hanging around with them a lot and I slowly started weighing in their conversations. I don’t know if it works for everyone but now I have the confidence even have a debate on a stage."
    },
    {
      "id": "loa0h3a",
      "body": "Try joining a club"
    },
    {
      "id": "loa5ngy",
      "body": "If u are a female, Just go talk to people slowly, Maybe those in same classes or clubs. \nIf u are a male, You're just cooked bro, Give up."
    },
    {
      "id": "lobcvts",
      "body": "Behave as if everyone around you is a fool"
    },
    {
      "id": "lobe2w6",
      "body": "Mansplaining isn't gonna get you any friends"
    },
    {
      "id": "lobfi8r",
      "body": "Try participating in something that interests you, there you would meet other people and talk to them."
    },
    {
      "id": "lobhbau",
      "body": "Nope you start by having a reputation of being of some use to others(projects homework etc) (P.S; Don't even need to be good at it) and also having a distinct reputation/personality (like I have mine being absurd history facts) imparting your info in an interesting/interactive way is also a good skill........ \n\nIg that's it, more than enough. I don't go to clubs, weekend parties or any meet ups either.... But I am invited at least twice a month."
    },
    {
      "id": "lobhqjv",
      "body": "Correction: It isn't going to get you \"true\" friends..... Useful classmates and a helpful groups on the other hand 👀"
    },
    {
      "id": "lobiw08",
      "body": "Skill issue"
    },
    {
      "id": "lobms68",
      "body": "One way to get friends or to meet people is to engage in group activities like clubs, hackathons, sports etc.. Believe me you will be fine. You can't even guess how many people you will meet if you join a very good and active club. You will learn so much and team work if your club is actively hosting any events  or so."
    },
    {
      "id": "lobp4pq",
      "body": "Go sit in the back bench of your class. Everything will be sorted"
    },
    {
      "id": "lobxb3m",
      "body": "Yeah. That's like the only that can fix you now(talking to the OP) .... Start with a time when the gym is relatively empty."
    },
    {
      "id": "locaon9",
      "body": "Try borrowing a pen even if you have one . That should get the conversation going. \n\nOther times ,Just sit next to someone , eavesdrop on their conversation, and if you know anything minutely related to the topic chime in."
    },
    {
      "id": "lock8c3",
      "body": "Gym+bike = heaven"
    },
    {
      "id": "lococ0p",
      "body": "Me too"
    },
    {
      "id": "loh0qw3",
      "body": "grow up. maybe ur just scared of how ppl will judge u. maybe you consider yourself not good enough. The day you accept yourself, the way you look or are, things will get better. I used to be superrr superr introvert, but things get better ."
    },
    {
      "id": "loi1kqh",
      "body": "Please get the necessary help for your anxiety, OP. I was in your position and I ended up dropping out (2016 batch). I'm just completing my degree now. Please talk to any professors you trust. Not all of them think negatively. They can be genuinely empathetic too"
    },
    {
      "id": "loin6hf",
      "body": "Man u just explained my life too, even the cgpa lol 😂😂."
    },
    {
      "id": "lojfz9g",
      "body": "buddy u come meet us at college  \nwe're literally in the same college and year  \njust gimme a message and imma be there:"
    },
    {
      "id": "lojorms",
      "body": "Honeslty I'm a horrible conversation starter. I got no idea what to ask or keep the conversation going. But I smile at people and answer what other people ask me. Slowly you will feel more comfortable with them. \n Basically \nYou need to seem APPROACHABLE \nIf people feel like you won't respond to them they won't talk to you. \nSince you don't like talking, be a good LISTENER. Trust me a lot of people like those who can listen to their endless rants about life. \nI hope it helps. I know it's hard unless it happens naturally. \nAlso yeah I agree : working on your self whether it is going to thr gym or learning a sport can boost your confidence and you will feel like your worthy of having friends."
    },
    {
      "id": "loks7qj",
      "body": "See…I can relate to u. I had same issues even more to be frank. But it’s all about taking that one dare step n it’s always tough in the beginning. Start talking with people in ur class with whom u never spoke. Like start small convo eventually ull come out of anxiety and nervousness. Join clubs socialise connect with people. Ik it is not easy as it sounds. Just throw yourself outta comfort zone."
    },
    {
      "id": "lomnnk4",
      "body": "I empathise with you and I am glad that you are openly talking about your feelings (as this is the first step for you to come out of this phase - so congratulations, you have taken the first step towards the recovery and you should feel happy about it).\n\n**Here is what I would suggest you to try:**\n\n1) Talk to your mentor about this. Share what you are going through with him/her (**mentor should be able guide you**)  \n2) **Meditate everyday** (if possible in the morning)  \n3) Start penning your thoughts in a personal diary (just let your feelings come out on the paper) - **This can be a game changer for introverts**.  \n4) Try to help others - doesn't matter how small it is (lending a pen, donating few bucks to poor kids, visiting an orphanage and donating old clothes or food, just do it. **When you help someone, it boosts your self-confidence - this is tried and tested infinite times.**"
    },
    {
      "id": "lopi88a",
      "body": "aye idk if you are a guy or a girl i am just gonna say this bro if you need a how to start start with someone who loves to talk to people ukw better you see my username search it up anywhere I am from ec campus you will find me on discord too and for WhatsApp just put up WHO IS BLOODSLAYER007 in any ec campus group ill find you i mean if you want a start point I don't mind helping"
    }
  ]
}