{
  "id": "1fmn37f",
  "title": "Am i doing the right thing?",
  "content": "currently im in pes rr cse through pessat and im sure to get pes ecity cs through cet.\n\nMy dad is insisting that i continue in rr campus due to better peer group and we have no money constraints.\n\nBut deep down i feel really guilty about spending 12 lakhs more...\n\nAt the same time seeing the ecity cutoffs this year im worried that the peer group over there isnt going to be great.. \n\nI definitely want to have a 70:30 studies to enjoyment ratio but i feel like in RR it'll be only studies and in ecity it will be only enjoyment.\n\ngive your thoughts and suggestions please",
  "metadata": {
    "author": "4dxrsh",
    "url": "https://www.reddit.com/r/PESU/comments/1fmn37f/am_i_doing_the_right_thing/",
    "permalink": "/r/PESU/comments/1fmn37f/am_i_doing_the_right_thing/",
    "score": 20,
    "created_utc": 1726987527,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lobte4e",
      "body": "Stick to rr if u have got no monetary constraints man"
    },
    {
      "id": "lobttkm",
      "body": "I switched from ec campus cse to rr campus aiml through branch change in my second year.All the teachers in ecc only told me to go to rr campus"
    },
    {
      "id": "lobub5s",
      "body": "as you were in both the campus can you tell the major difference between the two i am kinda stuck i am similar situation"
    },
    {
      "id": "lobw1uz",
      "body": "Bro read the faqs"
    },
    {
      "id": "lobwc6x",
      "body": "You may be looking at a smaller sample size to conclude that peer group in ecity won't be good. While I assure u its not entirely true, you will find a mixed peer group (as in every college). Speaking about myself I got 2.7k in comedk, 98%tile in JEE and left NITK mining, civil & CSE in IIIT Nagpur, Sri City, etc for PES EC CSE (through kcet) and Ik many such people."
    },
    {
      "id": "lobwwqu",
      "body": "go for ecity   \nworry about yourself not your peer group   \n20 lakhs for undergrad aint worth it man  \nidk about you but my parents are gonna retire soon and paying back the loans will get stressful unless you rich enough to take that out of your savings every year  \n\n\n>in ecity it will be only enjoyment.       💀"
    },
    {
      "id": "lobxwz7",
      "body": "You should choose any other clg for 70:30 ratio pes rr campus has 100:0 ratio"
    },
    {
      "id": "lobzenv",
      "body": "Im not denying rr cse is the best  \nIn my opinion and as mentioned by the many posts/FAQ's  \nJoining through pessat isnt worth it when you have ec cse as an option through cet  \nThe cutoff worries me too, but im still choosing ec cse over rr aiml in cet itself mostly  \nThe peer group is a factor but probably not as much as we think (according to seniors) cus we find all types of people everywhere.  \nAbout studies enjoyment I think it will be opposite of what you said lmao, anyway its what you make of it"
    },
    {
      "id": "lobzkyz",
      "body": "How so?"
    },
    {
      "id": "loc2spm",
      "body": "If you are day scholar choose the one close to home. Very important."
    },
    {
      "id": "loc3ndm",
      "body": "Take bms cse through kcet "
    },
    {
      "id": "loc3xaj",
      "body": "Haha"
    },
    {
      "id": "loc5kee",
      "body": "Bro flexing his achievements 🗣️"
    },
    {
      "id": "loca9pw",
      "body": "Brudda you think people only enjoy in ecity or what 😭?"
    },
    {
      "id": "locboap",
      "body": "Thats the best option way better peer group than ec campus"
    },
    {
      "id": "lockdpn",
      "body": "wow! how much in met/bitsat if u don't mind?"
    },
    {
      "id": "locoq60",
      "body": "Kcet rank"
    },
    {
      "id": "locps1j",
      "body": "There's been like 4 suicides in ecc so choose wisely ;')"
    },
    {
      "id": "locpwns",
      "body": "Revealing two ranks wasn't enough ? 😭 Come dm"
    },
    {
      "id": "locpxp6",
      "body": "Dm"
    },
    {
      "id": "locso5e",
      "body": "🗣️🗣️"
    },
    {
      "id": "locvcpm",
      "body": "Which is nearer to your house"
    },
    {
      "id": "locym6u",
      "body": "Others have already posted their views and there are good points. \n\nI just want to highlight that there's no difference between the campuses objectively - placements and profs are same/equivalent. You cannot quantitatively say \"RR is only studies\" since both campuses get to enjoy the benefits of all fests and roughly a similar number of events are organised at both campuses. Yes the scale of the fest depends on the campus but it's honestly not a groundbreaking difference. \n\nRegarding peer group - remember that you're currently judging people based on who scored better at PCM questions, not engineering. Once college begins and you actually enter your branch, you'll often see that the low PESSAT rankers doing significantly better than the so called PESSAT toppers. Your PCM score has nothing to do with how you do as an engineer. EC campus has an extremely strong tech community, even better than RR and some of the best tech kids have graduated from that campus. Also, everyone at PES is very well connected over groups, discord servers, etc. you can always interact with anyone from any campus very easily through these platforms. I was in RR and I've got a bunch of close friends from EC. Everyone has a similar story. \n\nI'd suggest choosing the cheaper alternative here. It doesn't make sense to let go of a CET seat at PES."
    },
    {
      "id": "lodsfof",
      "body": "Ok"
    },
    {
      "id": "lohavjp",
      "body": "Bro, there's a very slight difference between EC and RR campus.  Faculty doesn't really matter as 90% ppl study on their own a few weeks before finals using ppts. \n\nIn placements,  there is absolutely no difference.  It's all based on your skill and luck. Companies don't know which campus you are from. \n\nTake the campus which is close to your home of you're a day scholar. Else,  go for EC campus in your case. But as you said,  you have no money constraints. If you really want RR, them go for it"
    },
    {
      "id": "louynkb",
      "body": "both same distance same time to travel"
    },
    {
      "id": "louzj7g",
      "body": "I guess time for 2nd round choice entry has ended , so which did you choose"
    }
  ]
}