{
  "id": "1fnjmje",
  "title": "PESU I/O",
  "content": "When's PESU IO courses dropping (fall semester- 24)?\n\nLike usually when does they start ??",
  "metadata": {
    "author": "SmoothSeesaw6189",
    "url": "https://www.reddit.com/r/PESU/comments/1fnjmje/pesu_io/",
    "permalink": "/r/PESU/comments/1fnjmje/pesu_io/",
    "score": 0,
    "created_utc": 1727095775,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lok3nfd",
      "body": "https://www.instagram.com/reel/DAQnygPqk2H/?igsh=cHJycDNqdDVpNWRn\n\nComing up real soon!"
    },
    {
      "id": "lok3xnu",
      "body": "Bro are one of the sme's ?"
    },
    {
      "id": "lollmdq",
      "body": "Honestly,  I wouldn't be too excited. \n\nWatch the promo videos for west the sme will teach, the learn of yourself (atleast for the more tech oriented stuff)\n\nAnd if you want to be an sme, if sucks. Been there, done that,  got the mug."
    },
    {
      "id": "lomchw1",
      "body": "i/o team, asli id se aao"
    },
    {
      "id": "lomfu5e",
      "body": "This place doesn't have the charm anymore. The credits to this can be wholeheartedly given to the SHITTY and EGOISTIC team behind this place. Neither the students nor the SMEs are treated well. The SMEs are treated like slaves, by forcing them to come for shoots multiple times, and irritating them for no reasons etc. \n\nThe courses are too overpriced, and a student can learn way more on their own from the internet themselves. The SMEs are not up to the mark too. The process to select them hasn't been fair too, too many discrepancies. \n\nThey don't treat their management team like humans. They are abused and made to slog for their petty work. The hard-working people who worked for them were abused and made to leave (later labelled that they were \"kicked\"), so that their friends can take over and join the team, and do whatever they wish! \n\nA good initiative ruined by cheap-minded students!"
    },
    {
      "id": "lon7x2m",
      "body": "The IO thing is absolute bullshit, like i would rather spend that money on KFC than enrolling for a course in pesuIO"
    },
    {
      "id": "lonsiir",
      "body": "Can you describe your experience? I'm in 3rd sem tho, wanna get some experience as sme."
    },
    {
      "id": "lonsju9",
      "body": "😭"
    },
    {
      "id": "lopnopa",
      "body": "Well, the thing is the time of \"education\" work vs \"paper\" work is roughly 1:1. They treated us like shit, were poorly organized and in general, not worth the headache.\n\nI also found the pay *insulting*. Like pay me \"properly\" in line with a professional, or dont pay me at all. My normal rate as a freelancer in what I taught was roughly 15 an hour (2 years ago).\n\nSo, pay is bad, treatment is bad, students are mostly first years. (nothing against them, but a lot of the more interesting things to *teach* are not really possible for them to learn.\n\nThe pace at which you can go is annoyingly slow, the time it takes to get a fairly *simple* idea across is just **sad**"
    },
    {
      "id": "lov9wqq",
      "body": "dont bother going\nits a waste if money\nthe standard is very low\nhorrible management\nnot worth the extra course\nliterally youtube is 1000 times better"
    }
  ]
}