{
  "id": "1fofmzj",
  "title": "This shit sucks",
  "content": "Why is lab compulsory 100 % attendence  also I've seen bms and other colleges schedule and compared to pes it's soo chill I kinda regret choosing pes now,mandatory attendence even though everything is online, I've already finished sem 1 maths and a bit of other subjects on my own, it's not hard at all I don't feel the need to come and attend the classes, is it I  any way possible to bend the attendence policy in future like vit does where 9+ cgpa don't have to come to classes? If not how do I cope with this?",
  "metadata": {
    "author": "Simple-Antelope5228",
    "url": "https://www.reddit.com/r/PESU/comments/1fofmzj/this_shit_sucks/",
    "permalink": "/r/PESU/comments/1fofmzj/this_shit_sucks/",
    "score": 11,
    "created_utc": 1727192647,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lopi65h",
      "body": "😑"
    },
    {
      "id": "lopj9g4",
      "body": ">how do I cope with this?\n\nAttend classes period\n\nAnd the lab doesn't have 100 percent attendance criteria"
    },
    {
      "id": "lopma23",
      "body": "bro is the lab thing real?? i am freaking out as i cannot attend due to unavoidable circumstances :("
    },
    {
      "id": "lopmqzd",
      "body": "If you try to bend PES, PES will bend you in ways you wouldn't have imagined. That's a rookie mistake right there 👍🏼👍🏼"
    },
    {
      "id": "lopnax2",
      "body": "Yeah, just keep everything above 75 and u'll be fine"
    },
    {
      "id": "lopnnfi",
      "body": "For our physics lab we had like 3 marks for attendance, as long as you haven’t missed more than 2 classes you should be fine"
    },
    {
      "id": "lopsz11",
      "body": "There have been enough posts here about pes being hectic.... Suck it up is all i can say"
    },
    {
      "id": "loshujd",
      "body": "What's the total number of physics lab classes?"
    },
    {
      "id": "losxgx0",
      "body": "Reading this post makes me nostalgic about my jee prep period"
    },
    {
      "id": "lot1ssz",
      "body": "it all depends on the lab head\na friend of mine attend the first week phy lab and bunked the rest\nnobody said nothing\nhe prolly got lucky but you’ve only got to need 75%"
    },
    {
      "id": "lotlm6d",
      "body": "Around 11 to 12 classes of 3 slots each but varies as each section have lab on a different day and some of those days will be holidays. Check Callander of events and count the days your section has lab"
    },
    {
      "id": "loto40m",
      "body": "Ok tysm"
    },
    {
      "id": "lovujbu",
      "body": "You can miss max 3 labs afaik. Don't miss more than that or ull be in trouble."
    },
    {
      "id": "lp1gfvw",
      "body": "Exactly lol"
    },
    {
      "id": "lp1i8ow",
      "body": "As if u didn't know what pes is gonna be like when joining, simply don't complain "
    }
  ]
}