{
  "id": "1fpaeo2",
  "title": "Should I go for RR AIML over EC CSE through KCET after the most recent AIML changes?",
  "content": "should i go for aiml in rr i put rr cse and then ec cse when the option entry for kcet started (was way before the aiml changes that changed they way you pick electives and the **recent change that if you pick cyber security electives you will get cse core degree certificate itself**) and the option got deleted after round 1 since it was lower than ec cse.   \ni clear the second round cutoffs  for rr aiml already and kcet is mostly gonna allow to add options for the second extended round  according to the recent choice brochure   \nround both ec and rr are equal distances (\\~11-13km) from my house but rr i can travel via metro so faster+ dont need to bother  going through silk board every evening.  \n  \nthe main hesitation i had for picking EC CSE above RR AIML before was that i dont know whether i want to appear for placements or pursue masters so already limiting my domain was a red flag for me and dont want any unis to reject me if i decide to do masters due to \"AIML\" being in the degree certificate.\n\nNow do i take my chances and go for aiml and taking cyber security electives and hoping they give me a cse core degree or should i just stick with EC CSE(i also have a slight chance of RR CSE through kcet but that completely depends on seat availability)\n\nalso Can someone confirm as well if the text i highlighted is 100% true  ive read it on the discord group and some other dude commented it on a recent post too. \n\nI have already joined EC CSE through pessat   \none thing i have noticed is the peer group aint bad at all atleast in my class there are many people(4-5 in my class alone) who left bits hyd  lower branches because they wanted CS ",
  "metadata": {
    "author": "Murky_Hunt_321",
    "url": "https://www.reddit.com/r/PESU/comments/1fpaeo2/should_i_go_for_rr_aiml_over_ec_cse_through_kcet/",
    "permalink": "/r/PESU/comments/1fpaeo2/should_i_go_for_rr_aiml_over_ec_cse_through_kcet/",
    "score": 7,
    "created_utc": 1727285923,
    "flair": "PESSAT/Admission",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "low3iw0",
      "body": "you'll still get CSE(AIML) certificate,not CSE core even if u select CY elective"
    },
    {
      "id": "lowrpjv",
      "body": "Yoo can we add any clg / any branch which wasn't in the option entry at all ? ( The fresh ones )"
    },
    {
      "id": "loy22wb",
      "body": "Just go through my posts and replies you should get an idea"
    },
    {
      "id": "loygiaj",
      "body": "Yeah ig \nThey have written it in the pdf you get when you print your choice( i have picked choice 2)"
    },
    {
      "id": "loyh395",
      "body": "The others posts dont consider the new change Thats why i asked"
    }
  ]
}