{
  "id": "1fpnlsp",
  "title": "Regarding textbook for first year maths.",
  "content": "Can anybody tell me which refrence book/textbook is necessary to buy for first year mathematics. (My maths is hella weak)",
  "metadata": {
    "author": "dumbguy044",
    "url": "https://www.reddit.com/r/PESU/comments/1fpnlsp/regarding_textbook_for_first_year_maths/",
    "permalink": "/r/PESU/comments/1fpnlsp/regarding_textbook_for_first_year_maths/",
    "score": 6,
    "created_utc": 1727323321,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "loz2prn",
      "body": "Your teachers will probably send you a pdf of the textbook, it’s easy enough to find if they don’t and you can xerox that if you want or just use it as a pdf"
    },
    {
      "id": "loz7clb",
      "body": "Don't buy any book, it's pointless. Focusing in the class is all you need."
    },
    {
      "id": "lozz2uc",
      "body": "srk iyengar is good imo for 1st sem.. but don't buy it, just borrow it from the lib"
    },
    {
      "id": "lp09lx8",
      "body": "I went to the library today to borrow books... apparently u can't borrow till we get new id cards"
    },
    {
      "id": "lp0hsxg",
      "body": "honestly for the first year....you dont need any textbooks just refer to the slides provided and assignments in the pesuacademy website....they are more than enough"
    },
    {
      "id": "lp155lm",
      "body": "Practice CW problems diligently which teacher would do in class and Question bank uploaded in pesuacademy and could use Higher Engineering mathematics by BS Grewal . You would hardly need to solve  textbook . CW problems are more than enough"
    },
    {
      "id": "lp1mck3",
      "body": "I have locked the seat and am waiting for the second round extended results to be out. I don't have login access to pesuacademy. I thought I would sit at home and practice some meth cuz I am hella weak."
    },
    {
      "id": "lp1twvj",
      "body": "https://better-pes-v1.vercel.app/\nUse this then."
    },
    {
      "id": "lp52a9i",
      "body": "They'll be giving them out next week according to what I heard"
    },
    {
      "id": "lpdva7j",
      "body": "Just download bs Grewal textbook for maths and rest all subjects pesu Academy slides."
    }
  ]
}