{
  "id": "1fpq5nc",
  "title": "No update?",
  "content": "Saw a post on the /r bengaluru, why is no one talking about the suicide like it’s a normal thing? She literally lost her life and we’re doing nothing.",
  "metadata": {
    "author": "Potential_Diamond562",
    "url": "https://www.reddit.com/r/PESU/comments/1fpq5nc/no_update/",
    "permalink": "/r/PESU/comments/1fpq5nc/no_update/",
    "score": 49,
    "created_utc": 1727333695,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lozg1h2",
      "body": "Welcome to pes 🤷‍♀️🤷‍♀️"
    },
    {
      "id": "lozg20k",
      "body": "Man I felt the same, we're just doing ntg, i just saw my insta gc of pes, people are joking about the suicide, like guys tf.. Don't they have some empathy or smtg"
    },
    {
      "id": "lozg2z5",
      "body": "Kisi bhi suicide se pes ko koi effect nahin padta sadly"
    },
    {
      "id": "lozga5v",
      "body": "Saw the same thing, we should learn from IIT where they held protests"
    },
    {
      "id": "lozlrrh",
      "body": "insta audience is dumb or what mannnnn"
    },
    {
      "id": "lozlwt8",
      "body": "Literally they were joking like, \"looks like she fucked her isa and she pulled out an other aditya prabhu\""
    },
    {
      "id": "lozm22n",
      "body": "just for being \"dank\" and \"cool\" these ppl are shedding all their manners and self respect"
    },
    {
      "id": "lozm6uc",
      "body": "Protest what exactly? We don't know what the reason was, we don't know it's even related to the college.\n\nAnd even if it was related to the college, you have to know it's their fault to protest. Like if it was exam stress, will you protest that pes remove exams?\n\nPlease i just want to know that you have any reason at all. Any  reason other than blind hatred and a will to cause outrage"
    },
    {
      "id": "lozmxo0",
      "body": "It happened in rr hostel and she did it because she was held a year back"
    },
    {
      "id": "lozn74s",
      "body": "https://www.reddit.com/r/bangalore/s/kny4nMA3MT"
    },
    {
      "id": "loznay3",
      "body": "So we should protest the fact that the college has a passing grade?\n\nAlso, afaik the person wasn't a hostelite. I heard it was in a pg. But I'm not sure"
    },
    {
      "id": "loznnhz",
      "body": "So it's the college's fault for having a cutoff to pass courses?\n\nYou're protesting the idea of failing?\n\nLook I'm not for whatever the college administration does. But I am against blaming them for something that might not have anything to do with them. \n\nAnd in this case it doesn't look like the college is to blame."
    },
    {
      "id": "lozo7s7",
      "body": "We dont even have a proper student council elected by us to place forward our demands"
    },
    {
      "id": "lozokzf",
      "body": "Bruh you do realise we still don't know the reason for it right? Can't blame every single suicide on pes."
    },
    {
      "id": "lozori8",
      "body": "Yeah, even you are correct, but we should ask the management to reduce the stress that these guys give to students.."
    },
    {
      "id": "lozowjc",
      "body": "OP didn't blame PES anywhere in their post. They just asked why no one's speaking up."
    },
    {
      "id": "lozw2m1",
      "body": "Instagram users are the lowest scum of society along with twitter users"
    },
    {
      "id": "lozy9bd",
      "body": "that is why me left them those apps ages ago\n\nreddit audience is wayyy better"
    },
    {
      "id": "lp04j88",
      "body": "What do you expect us to do? She made a stupid decision , maybe a smart one owing to her personal problems. Why does the universitys name get dragged into this? Are you implying the university should give 20lpa and 10cgpa to all students to prevent suicides?"
    },
    {
      "id": "lp06b0c",
      "body": "Bro's asking why nobody doing nothing as if he will bring her back to life 💀"
    },
    {
      "id": "lp0el9q",
      "body": "Protest what? The college didn't kill her."
    },
    {
      "id": "lp0nmc0",
      "body": "how is it the college's fault? exams are hard and they've been hard, didn't y'all know that before joining? Just because one out of a thousand can't take it y'all blame the college?\nI don't see the damn point. Quit if you can't handle the pressure go join a tier 3 college no one's gonna bother you there.\nActing like a damn protest is gonna solve anything."
    },
    {
      "id": "lp0nzr6",
      "body": "why would they care Bhai, numbers hi dekh lo tum.\nOut of whatever thousands that study there, 2 or 3 end up doing this stupid shit, which is btw, never a solution.\nAbhi tak kota walo ka sunte the pressure nahi handle ho rha toh kar liya whatever, shouldn't be a thing in pes man."
    },
    {
      "id": "lp0ojlp",
      "body": "\"She literally lost her life and we're doing nothing?\"\nWhat does OP think we should do?\nProtest against the college? Abolish the grading system, which is literally the same for every other student?\nAsk the institution to change their syllabus because 1% of the students can't handle it?\nDoesn't work like that man. I don't care how big your issue in life is, suicide shouldn't never be an option, and nowadays pes students are literally turning to it the second something goes wrong.\nIf you really want to make a change ask the college to get counsellor who atleast try to fix these people's heads.\nOr let them quit and go somewhere else, if they can't handle the pressure that's what is to be done."
    },
    {
      "id": "lp16r31",
      "body": "Not just pes students,I'm pretty sure many students suicide in blr engineering colleges but the colleges will continue doing their stuff and robbing our money. I hope if all engineering students in bangalore protest but the media is just gonna ignore it and police will lathi charge."
    },
    {
      "id": "lp1emkd",
      "body": "To all the people saying its her fault for joining the college which is known to be stressful, maybe learn to be an actual empathetic human being? you all are jawahar alt accounts istg. The main point is she was from PES in third year and that she was held back. What can we do? spread awareness. I beg you to think of the value of a human life which was lost. These are people that havent even lived a third of their lives doing suicide due to college based stress. Think twice before you defend a corrupt institution"
    },
    {
      "id": "lp1j3hu",
      "body": "Bruh protest what? All we can do is be kind to the people around us and help them thru tough times, iits still have horrible suicide rates, unless there is a specific problem that can be fixed, like ragging etc we can't protest anything."
    },
    {
      "id": "lp1jc2v",
      "body": "There is not much known to speak up about it"
    },
    {
      "id": "lp1vls9",
      "body": "exactly this! it’s shocking to see the comments, the  main thing I asked was for spreading awareness and talk about it, but people just wanna say i’m ruining the name of PES, the least we can do is spread more awareness, all these people care about it “the suicide didn’t happen on campus so it’s not colleges problem it’s her, like get a life and be more sympathetic y’all."
    },
    {
      "id": "lp2jugd",
      "body": "Held back? Do you mean Year Back? When did we start doing that?"
    },
    {
      "id": "lp4mlga",
      "body": "This🙌"
    },
    {
      "id": "lp4o2o5",
      "body": "This is not normal statistically speaking, the suicide rates are much lower in other colleges, maybe consider using your brain a little bit instead of licking Jawahar's a-hole?"
    },
    {
      "id": "lp4r113",
      "body": "Agree but in colleges like bmsce where academics are considered to be less hectic,and have a better college life also have these incidents(in a span of a week 2 of them happened) and it was hardly even known,many more would not even be out.The same applies to every other blr college."
    },
    {
      "id": "lpiwifl",
      "body": "everyone out here saying “it’s not the college’s fault she got bad grades” or “what do we do if she made a bad decision”, you can’t really blame the student here, one of my friends started their first year in pes and so far I’ve heard a lot of rant about how much work is given or how unreasonable some teachers are, thank fuck my guy has someone to talk to about all this but some people dont, some people just keep everything to themselves and eventually it gets too much to keep going. I’m not saying its completely the college’s fault or the student’s fault here but as far as I’ve heard about students killing themselves its mostly been about PES, forgive my unawareness if I’m wrong but that says something"
    },
    {
      "id": "mpn6rxb",
      "body": "This cunt man, get your pussy ass outta there if you can’t handle the pressure"
    }
  ]
}