{
  "id": "1fqfiyp",
  "title": "Is there any more info on the suicide?",
  "content": "It’s been about 2-3 days since it happened but there is no credible information at all. Some say that it happened off campus. Some say that it happened in a PG. Some say that it happened in girls’ hostel. Some say that she took poison. Some say that she hung herself. Some say that she was held back for a year. Some say that it was personal issues. \n\nWhatever it is, I believe that there should be some clarity among everyone on the situation. It’s really unfortunate that she had to take such a step, whatever may be her motive, college or personal. It’s also sad that there have been 5 suicides here in such a short span. \n\nIf anyone has any credible information, please share it. ",
  "metadata": {
    "author": "esinpe",
    "url": "https://www.reddit.com/r/PESU/comments/1fqfiyp/is_there_any_more_info_on_the_suicide/",
    "permalink": "/r/PESU/comments/1fqfiyp/is_there_any_more_info_on_the_suicide/",
    "score": 81,
    "created_utc": 1727410797,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lp5lpco",
      "body": "It's the victims family's right to release the news about the truth. If they don't want it they won't release ."
    },
    {
      "id": "lp5sd6v",
      "body": "It happened in her house, for personal reasons. She was held back a year but there are other  reasons that came up that might've caused it. Doesn't seem to be college related"
    },
    {
      "id": "lp5tzny",
      "body": "Since when did PESU start holding people back? Has there been a change in rules?"
    },
    {
      "id": "lp5vder",
      "body": "Well, PESU could acknowledge that one of their students has lost their lives too and give their condolences. Doesn't matter whether it was a suicide caused by college pressure or by due to personal reasons or even a death due to any other ways. \n\nIn my high school, someone died due to an accident. My school acknowledged it and even had a couple of pages dedicated to him in the yearbook. I personally don't think that being silent is the right thing to do."
    },
    {
      "id": "lp5wfrl",
      "body": "Not in house, its girls hostel."
    },
    {
      "id": "lp6c0va",
      "body": "She's a friend of a friend, your information is wrong. It was at home"
    },
    {
      "id": "lp6ceb8",
      "body": "They hold back if you have backlogs over 24 credits. I'm pretty sure this has been in place for a long time"
    },
    {
      "id": "lp6tkr3",
      "body": "Seems like I became a target of misinformation.. thanks for enlightening me."
    },
    {
      "id": "lp6ujj0",
      "body": " Nope. I actually know a few people with more than 24 credits as backlogs and are in their final year. PESU doesn’t have year back system. They give you the degree certificate when you finish off 160 credits. That’s it. Doesn’t matter when you finish it."
    },
    {
      "id": "lp6vxvc",
      "body": "Our 1st year teachers told us if we have more than 24 credits backlog we will have to repeat the year."
    },
    {
      "id": "lp6wfqs",
      "body": "Dude, in my year, there was a person in mechanical who failed all courses except constitution in first year. They were allowed to be in 3rd sem. No issues. \n\nI’m in my 4th year now. If this rule is actually true, it must be new. When did your profs tell you about it?"
    },
    {
      "id": "lp6x8hf",
      "body": "Last year in sem 1."
    },
    {
      "id": "lp6yj22",
      "body": "Never mind. Found the circular. It's called Vertical Mobility Circular. It's on PESU App. Not applicable to my batch, but applicable to the current 1st to 3rd year students. It's a new rule."
    },
    {
      "id": "lpdkg9l",
      "body": "This Rule is Called as Vertical Mobility this was Introduced from 2022 Entry Batch (2026 Graduating Batch)"
    },
    {
      "id": "lpdkkpy",
      "body": "Yeah, but it was announced 6 months ago. The rule is new."
    },
    {
      "id": "lpdmllf",
      "body": "No it happened like even after the 2023 esa for the 2022 entry Batch "
    },
    {
      "id": "lpdp6yb",
      "body": "Bro a Request from my Side like Could we Just Keep this Reddit a Bit Less Toxic so Let's DELETE this Post of Suicide Just my Point of View and my request totally up to you"
    }
  ]
}