{
  "id": "1fqkzcx",
  "title": "How open minded is pesu management and students",
  "content": "Are girls and boys allowed to sit next to each other and interact? How strict is the dress code? Is there an uniform? ",
  "metadata": {
    "author": "rainbow_throwup",
    "url": "https://www.reddit.com/r/PESU/comments/1fqkzcx/how_open_minded_is_pesu_management_and_students/",
    "permalink": "/r/PESU/comments/1fqkzcx/how_open_minded_is_pesu_management_and_students/",
    "score": 6,
    "created_utc": 1727434640,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lp60dgd",
      "body": "Bro thinks this is a school ☠️"
    },
    {
      "id": "lp60yvd",
      "body": "Well it does behave like one. But not as strict as what OP thinks."
    },
    {
      "id": "lp62198",
      "body": "Lol a boy was made to sit next to a girl in first bench in my class as he came late"
    },
    {
      "id": "lp63mnc",
      "body": "What do you mean by open mindedness you mean hookups"
    },
    {
      "id": "lp648dq",
      "body": "Have you come from prison?"
    },
    {
      "id": "lp69reo",
      "body": "Bro read the posts on this sub ☠️ \nNah but fr chill it ain't that bad duh"
    },
    {
      "id": "lp6ban3",
      "body": "Girls go to seperate block entirely. There is zero female interaction on campus. If you are seen talking to a woman on terms other than academic you will be fined. Leave all hopes of getting a romantic partner from the other gender the moment you step inside campus. If you are seen dressed in anything other than the prescribed clothing then you will be fined.   \n(jk btw real answer: there is no strict dress code as long as you dress decently and no barrier to interaction with the other gender)"
    },
    {
      "id": "lp6detz",
      "body": "Bs nothing like that"
    },
    {
      "id": "lp6spav",
      "body": "lol this shit still taboo in college in 2024. I graduated 10 years ago and nobody would tease then"
    },
    {
      "id": "lp74634",
      "body": "FYI, PESU S&H in 2023 did float out a guidline saying Girls and Boys shouldn't sit in the same bench. But it was​nt enforced. His Question is fair"
    }
  ]
}