{
  "id": "1fqlphq",
  "title": "Some questions to 4th years/ seniors who have passed out regarding placements",
  "content": "1. Is there a comprehensive list of rules regarding placements I can find somewhere?\nMy specific question - If someone has a tier 2 FTE offer(no internship), can they attend the recruitment drives for spring internships which might convert into a Tier 2 / Tier 3 FTE? \n\n2. Is there another cycle of tier 1 companies which come for recruitment later this year / next year ?(as I think I pretty much messed up all the opportunities I had this time) or will Tier 1 opportunities pretty much continue to wane over the months? \n\n3.When looking for internship opportunities offcampus, should I still keep the potential tier conversation rules in mind ? Or do they agree with any internship as long as it satisfies the 5k 3 months criteria? \n\n4. Do they blacklist you if you get another offer from the same tier offcampus ( even though there's around 5 lpa difference) ? \n\n\n\n\n",
  "metadata": {
    "author": "consuded",
    "url": "https://www.reddit.com/r/PESU/comments/1fqlphq/some_questions_to_4th_years_seniors_who_have/",
    "permalink": "/r/PESU/comments/1fqlphq/some_questions_to_4th_years_seniors_who_have/",
    "score": 12,
    "created_utc": 1727437363,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lp6qy2a",
      "body": "Is sitting for placements mandatory if my immediate goal is to start preparing for my masters."
    },
    {
      "id": "lp8504z",
      "body": "I want to add another question:\n\nif we get a T2 offer now can we attend T1 offers which have both internships+FTE or only T1 companies which offer FTE? because some people were saying if we get a T2 offer which has internship mandatory then we can only attend T1 companies which offer only FTE."
    },
    {
      "id": "lp852b9",
      "body": "No it is not mandatory"
    },
    {
      "id": "lpav6mi",
      "body": "Answering too all questions at once (including the one asked in the comments) - \n\n1. You've got the best upgrade path in terms of placement. Since it's only T2 FTE with no internship, you are allowed to sit for T1- FTE, internship + FTE, internship only. One hidden problem in the pesu placement rules is that if you get T2 internship + FTE, you are not allowed to sit for companies that come for T1 internship + FTE. It is because according to the rules, you're allowed only 1 internship offer from on campus.\n\n2. T1 companies will definitely wane. But, there are a few that do come late.\n\n3. 5k 3month rule is sufficient for off campus internship. But please mention that to the company while joining that you have to send offer letter to college as well as any formalities that need to be done.\n\n4. Off campus whatever you get doesn't affect on campus. But, it's better to not let the college know about anything. (Your friends can know, and probably a few profs you trust)\n\n5. Explained in point 1"
    },
    {
      "id": "lpmolig",
      "body": "'you are allowed to sit for T1- FTE, internship + FTE, internship only. ' - Okay so the internship should also be a tier 1 internship ( ie should convert to >12lpa FTE )?"
    },
    {
      "id": "lpngoax",
      "body": "Not necessarily\n\nIf they come for only internship/performance based conversion, you can sit for any ig"
    }
  ]
}