{
  "id": "1fr88nh",
  "title": "Yall need to stop ranting about su*cides",
  "content": "Before I explain what I mean -  Rest In Peace to anyone who took the decision to give up and end their life. A lot of personal reasons are involved and nobody except the victim knows about it , and hence nobody except the victim is in any spot to judge the decision or blame the university/anyone else  \n  \nIt's amusing to see 18 year olds crying about a suicide and how they should 'take down' the college and its 'abusive environment' because a student who didn't pass their exams was given backlog ! ( who would've thought !?!! ) .\n\nI think what you guys want is for the college to conduct 1 hour classes a day and give 9.5 cgpa to everyone and a 20lpa package so that students are satisfied and don't kill themselves over the 'stressful environment' when they don't study.\n\nPES is known for it's academics and it was clearly told on the counselling that if you are not interested , they offer a 100 % refund on the spot ( Said by Jawahar on 16th after explaining the grading and exam system ).  Similarly , hard-working students are definitely rewarded by scholarships and actually great placements and research opportunities . So all of yall need to grow up and stop bitching about the management and college just because emotionally weak kids jump off a building because things didn't go their way.\n\n\n\n",
  "metadata": {
    "author": "AromaticAd7580",
    "url": "https://www.reddit.com/r/PESU/comments/1fr88nh/yall_need_to_stop_ranting_about_sucides/",
    "permalink": "/r/PESU/comments/1fr88nh/yall_need_to_stop_ranting_about_sucides/",
    "score": 89,
    "created_utc": 1727505202,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lpb11xw",
      "body": "Dickriding PES is crazy"
    },
    {
      "id": "lpb1d9c",
      "body": "This! This is what I've been telling people."
    },
    {
      "id": "lpb29xf",
      "body": "Mayb the college is putting to much pressure on the students that's why it has affected in some way the college may have caused why are you defending them"
    },
    {
      "id": "lpb2cm4",
      "body": "Same here \nMany Wil disagree to this"
    },
    {
      "id": "lpb2n94",
      "body": "Accurate.\nTired of seeing people spread hate and trolling without any reason."
    },
    {
      "id": "lpb35hq",
      "body": "These people would post rants even if they are in a class of some Harvard. It's just how humans work. It's called underdog bias."
    },
    {
      "id": "lpb4kk0",
      "body": "Isnt valid, one has a ‘independent decision’ making power. It’s upto us, fck up by dying or live with the reality. Thats what life is.\nWhat’s life without hardships, hurdles? \nAgain not criticising anyone’s decision \n\nBut ranting is not at all necessary"
    },
    {
      "id": "lpb99ev",
      "body": "There’s pressure no matter where you go. \nNo matter what you do, who you are. If you’re not a freeloader there’s going to be the pressure to do something in life. Even if your goal isn’t to become something big in life, just living an avg happy human life, you will occasionally obviously have pressure on you to pass your exams, do good enough, pressure to find a decent job so you can live that chill life you dreamed, pressure to do enough in the job so you don’t get laid off, that’s life. \nYes some paths have less pressure than the others, but at some level it was your decision to take that path."
    },
    {
      "id": "lpbiv81",
      "body": "I've passed out from pesu a few years ago, there was a suicide case in my batch (from my class to be specific)\n\nThe guy wrote a note \"mom, dad, I cannot take this college pressure anymore\". This was in the 2nd month of 1st sem. Absolutely it makes no sense that this guy was not able to cope up.\n\nBut what made me angry about that or any other case in pesu is the lack of humanity. A lecturer of our dept comes up to the chalkboard and goes \"that's all okay and fine, if any of you wants to go and meet his parents, go and meet them, we'll have a holiday today and the classes will follow the same schedule tomorrow\" \n\nSomeone has just died and she's saying this so lightly and being blunt? Is this a routine for her?"
    },
    {
      "id": "lpbjkti",
      "body": "Two things :-\n\nTell me why the pressure made him kill himself but not the 1200 other students in his batch ? Everyone faces pressure , its just about how you are taught to deal with it, how you are raiesd and other personal reasons which he would've obviously also be dealing with.\n\n  \nAs for lack of humanity, I'm not sure what you expect the teacher to do in front of other students ,  with regard to a student who thought jumping off a building would be the correct way to approach his academic stress . Think about how selfish the dude was from his parents perspective. Think about how stupid that decision was,  and now his parents will suffer for the rest of their life because of him. No empathy for a person like that. If he was any smarter , he would've either studied , or taken a drop year and joined another college. Anything is better and will work our rather than ending ur life."
    },
    {
      "id": "lpbm5cj",
      "body": "Not sure why you're trying to prove a point I already agree with? \n\nI agreed that it makes absolutely no sense to commit suicide in 2nd month of first sem.\n\nTo give you some context, I was in MCA \nWe only have 200 students per batch of which 60 of us joined 5 months late due to CET procedure so the 60 of us were asked to do everything in 1 and half month which others did in 5. \n\nCBTs since week 2 of joining which was without any breaks. We have a CBTs in the morning (including Saturday) and then classes till 6.30 and then CBTs for the learnt material the very next week.\n\nAlso, The staff in question was an absolute asshole. To everyone, not just the scenario I mentioned\n\nOne of the lecturers left the college after 6 months since joining (teaching just for 1 sem) because she was made to work overtime and on weekends as well regardless of what she was doing and yes, she told us how the other staff also had the same complaints but not the spine to leave with dignity. This was also confirmed by another lecturer who still works there. \n\nDeath is not a pass-time activity that you so easily talk about in a crowd. A person should at least mourn the dead and have some respect. He was not a criminal/terrorist."
    },
    {
      "id": "lpbmmjt",
      "body": "People are protesting against Nirmala Sitharaman for her \"shameless\" remarks on the pressure in toxic work culture (related to the EY employee death from work pressure case)\n\nSo your take would be that a person has to suck it up and take the pressure and overwork to death just because the person has to earn for family? Switching for a job is really hard in the current market, leaving the job and doing something else requires money. What do you expect that person to do? \n\nAs a minister saying you have to grow a pair and start adjusting yourself to the company's toxic work culture as just equally bad as the said staff in my previous comment"
    },
    {
      "id": "lpboylg",
      "body": "Can't agree more !!"
    },
    {
      "id": "lpbp0et",
      "body": "Bro ,if feeling empathetic for a person who has lost his or her life is rant ..so be it …it might be your personal opinion..good for you..no one decides to take that step for fun of it ..imagine extreme feeling in that situation.. I have always been a advocate of spreading positive hope for anyone and everyone ,so that even if anyone or any situation is now worse.it will turn around for better…but,please don’t say it as rant…please visit each of the victims parents and kindly tell them,with proper eye contact,that you have asked the ppl emphathetic to their child,to stop ranting..if they say so ,we will oblige..we are general public,we will definitely respect their opinions.."
    },
    {
      "id": "lpbpap0",
      "body": "Exactly what I have been, saying others too, and they all blame the college for suicide. The reasons why the students have suicided are also so bad man. One gets caught for phone in exam and another is late to exam and denied entry, One can’t handle pressure top of all this blame the college.\n\nMany concepts they teach are super hard I barely even score marks and my CGPA is messed up after joining this college. Also lot of teachers talk shit to students directly to their face and they all get super depressed about it sometimes, it is what it is you have to be mentally strong and can’t let such silly things affect your mind."
    },
    {
      "id": "lpc07g0",
      "body": "OP , it is very clear you don't know what people go through. Maybe you do , and probably you are just deflecting or projecting your stupid opinions and creating a circlejerk for other people who think just like you do.\n\nThe fact that the first thing people like you say after a person kills themself is \"oh gpa oh placement\" is probably one of the worst examples of why kids go on to kill themself after facing even \"negligible\" pressure. \n\nI agree with the part that many people use this opportunity to take cheap jabs at the college and don't care about the death but effectively you are literally doing the same thing on the opposite spectrum\n\nInfact you agreed with the point , that it's not just the college but it's the whole system that creates short sighted people like you who cant see beyond gpa , placements and forget that there is life that a person lives, beyond academic reasons. \n\nMaybe life is simple for people like you and its only a game and metric of \"hardship\" and \"grind\" and \"working hard and getting grades\" but for some people it's difficult to even wake up in the morning and find a reason to go on with their day because of actual abnormalities in the brain. You wouldn't understand because you've probably wantched too much David goggins or Jordan Peterson and come to the conclusion that depression is made up and only thing that can fix you is a morning run and working hard.\n\nRespectfully OP , fuck you , and fuck all of the people at pes who think just like you do , the college was never the problem , the curriculum was never the problem, the bad grades was never the problem.\n\nIt's people like you and the management at pes which reduce people to numbers , gpa and placements , and even laugh after the person is dead, calling the person weak willed and whatnot.\n\nSee beyond just these things and maybe you'll realise there is more to life than just getting into a college and getting a fucking job. It's called having emotions."
    },
    {
      "id": "lpc0jnf",
      "body": "And it's HILLARIOUS that you are willing to defend a place so much that wont give two shits once you drop dead on your grave. Maybe they'll even piss on the grave for ya"
    },
    {
      "id": "lpc1met",
      "body": "You've missed the point of the post. It's not about not being able to express feelings and comments over someone's loss. It's about not blaming a college or university and ranting about that just because someone chose to end their life for whatever reason and happened to be a student of the university"
    },
    {
      "id": "lpc4ff9",
      "body": "That's a weird comparison . What about PES is similar to EY(which does actually have a problem in the way they treat employees) .  If we take PES specifically then let me tell you there are counsellors everywhere, help available for anyone who needs it. The attendance and exam policies are just like how it is in any other colleges. The syllabus is at par with almost any reputed college. Now if ur telling me that a student is dying because faculty are scolding him then all im going to say is that u need to grow up and learn to not be sensitive and take \"scoldings\" and advices from others personally and blame the University for that reason."
    },
    {
      "id": "lpc5f05",
      "body": "You're going to be downvoted, but you honestly seem to be the only one here that isn't completely ignorant."
    },
    {
      "id": "lpcczoi",
      "body": "What is it in my post that leads you to think I \"don't know about what humans face\" ? I understand what you mean partly and I can relate - I'm a 2nd year student and I was paralysed for a year in my grade 11 due to a skating injury. I woke up everyday thinking I'd live like that for the rest of my life so don't bullshit me with people killing themselves because they have physical or mental problems. What I've implied is that if a student dies there's absolutely no reason for 100s of you to make posts dissing the University when there's nothing wrong in the way they do things.  \n  \n  \n(copying this paragraph from another dude's comment ) :-   \n If we take PES specifically then let me tell you there are counsellors everywhere, help available for anyone who needs it. The attendance and exam policies are just like how it is in any other colleges. The syllabus is at par with almost any reputed college. Now if ur telling me that a student is dying because faculty are scolding him then all im going to say is that u need to grow up and learn to not be sensitive and take \"scoldings\" and advices from others personally and blame the University for that reason. \n\nThe posts u should be making is \"Rest In Peace to xxx  he/she was a good friend \" and not \"OMG Ban PESU they are the reason with 0 context whatsoever.\n\nOne of the suicides was because a dude was caught for a phone during exam and before action was taken he jumped out the window. That's like saying if a police officer caught a guy with a gun ( irrespective of whether he has a license for it or not ) , and the guy just kills himself cuz he was detained for it."
    },
    {
      "id": "lpck7zx",
      "body": "Pes has counselling faculty. Yay.\nEY has HRs, what's your point?\n\nYou think they care?\n\nI know how our MCA faculty was. \n\nAnd again, I'm already agreeing to suicide being a coward's action here but to make the mass desensitised about a death by a faculty is what I have a problem with"
    },
    {
      "id": "lpcsjpd",
      "body": "Doreswamy garu, use real account :)"
    },
    {
      "id": "lpcxdp1",
      "body": "Why should I think from his parents perspective? They are full grown adults and should be capable of taking care of themselves. How about you think from his perspective huh? God knows what was going on in his life. Actions like these aren't spontaneous. The thoughts are usually brewing for a long time."
    },
    {
      "id": "lpcxt2w",
      "body": "Oh boy .. don’t be so insensitive…listen to what that boys mother has to say ..he was humiliated,his mother was humiliated.. middle class kids don’t have guts to look beyond cgpa  and placement…he too had dreams..his parents had dreams for him …this realisation makes ppl cringe at the organisation’ and ppl who drove him to such an act … and dear friend, it is not easy to take one’s life …cool..I agree he should have known a saying-every sinner has future and every saint has a past-yes ,that boy was emotional fool,he paid with his life..But,always I repeat,dear friends…life is precious..life will give you a jhatka but will always turn for better,please take care of yourself..be strong and be happy and live a long life"
    },
    {
      "id": "lpczamg",
      "body": "Dude,don’t be so insensitive..please remember,if his mother or father happens to read such things about their son ..what would go through their mind and soul..please be sensitive..you will understand this when a near or dear one goes through this..you have long way in life to understand…please before commenting on a person ,sit and think twice,thrice,…I would end only by saying-advertently or inadvertently please don’t end up hurting a already wounded soul of the parents of such kids ..please stop.."
    },
    {
      "id": "lpd4742",
      "body": "Someone ban this motherfucker"
    },
    {
      "id": "lpd69gy",
      "body": "No point debating a topic which is sensitive…dear fellow students,take care..life is beautiful…my heart goes out to the victims and their parents…pray to god for their peace of mind…"
    },
    {
      "id": "lpdll9e",
      "body": "No not Too much pressure it's fine according to me like you're pursuing a Professional Degree Course and not a 5th Standard Kid so you Should have the maturity "
    },
    {
      "id": "lpdq9cc",
      "body": "Nice try Diddy…."
    },
    {
      "id": "lpfv819",
      "body": "If a person isn't able to wake up to come to class and isn't able to function to do normal activies, then he/she is most likely dealing with some kind of childhood trauma. It's important to go to a therapist to evaluate and heal.\n\nI think it's important to understand one's purpose. If one is going to school/college then the purpose is only for academics. Every educational institution provides an environment for academic development and provides opportunities to be able to get placed based on one's academic performance. Honestly, I don't think any college is responsible for healing one's childhood trauma. It's beyond its scope and purpose. \n\nChildhood trauma can be a result of bad parenting or the environment the person grew up in. The person affected must work with a counselor/therapist and his/her parents to heal himself."
    },
    {
      "id": "lpgkxpw",
      "body": "Absolutely agree man , if he/she jumped her it was her decision , respect her decision and move literally no point on blaming the college for having a specific time to enter the exam or having a specific mark to pass the exam"
    },
    {
      "id": "lphd0dr",
      "body": "beautifully said. once again, respectfully, fuck you OP ❤️"
    },
    {
      "id": "lpiy9h5",
      "body": "I’m not from PES but I keep hearing about people killing themselves and it’s somehow most of the time from this college, I have a friend who goes here and I get a lot of rants about how much work he has to do and how unreasonable some teachers are, some people don’t have a friend to talk to or just don’t talk about these things. “pes is known for its academics” is not an excuse to have a lot of suicides in your college, good education or showing your college produces the most toppers shouldn’t cost someone else their life"
    },
    {
      "id": "lplsaiy",
      "body": "100% agree with your post, but you don't have to be macho in the comments.\n\nStrongest are the most humble."
    },
    {
      "id": "lpm6fi5",
      "body": "PES is a great school, known for its talented and hardworking students. However, I understand that not everyone can thrive in such a competitive environment. That being said, based on this post, it seems there's a significant lack of empathy and humanity among some PES students. Even when someone accused in a serious crime like m\\*\\*der passes away, the court drops all charges. Yet, the OP and a few people in comments seem to be attacking even in death. Please, let the deceased rest in peace.\n\nNo matter how much you and your friends believe the OP is justified, I personally do not want to be around people like this—whether as friends, colleagues, or family. Since you are all still kids, do try reading this post after 10-years and see how wrong this post looks like. People don't deserve to die just because they don't get high CGPA. \n\nManagement should plan something like transfer to some other university for people who cannot cope up with PES  instead of failing them."
    },
    {
      "id": "lprsohs",
      "body": "Completely agree to your point of view…"
    },
    {
      "id": "lps7ce6",
      "body": "Why is that some people start suffering from cancer and many others don't! Maybe you are not properly aware of chronic and mental illness! And pressure, trauma, stress, and everything else that's negetive cause these illness."
    }
  ]
}