{
  "id": "1fra6s7",
  "title": "Hey guys don't ignore this silly doubt for God's sake plz reply",
  "content": "How many note books should I bring to the college ? Is one note book enough ?",
  "metadata": {
    "author": "IdalySambar",
    "url": "https://www.reddit.com/r/PESU/comments/1fra6s7/hey_guys_dont_ignore_this_silly_doubt_for_gods/",
    "permalink": "/r/PESU/comments/1fra6s7/hey_guys_dont_ignore_this_silly_doubt_for_gods/",
    "score": 0,
    "created_utc": 1727513975,
    "flair": "Study Help :table:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lpbcyry",
      "body": "if you Seriously take notes then bring at least 4 books."
    },
    {
      "id": "lpbd7ia",
      "body": "Don't yall study through slides which pes gives? Is it compulsory to make notes?"
    },
    {
      "id": "lpbdc6e",
      "body": "get a 6 subjects notebook, that should be enough"
    },
    {
      "id": "lpbddr3",
      "body": "Is only one enough?"
    },
    {
      "id": "lpbdhin",
      "body": "Carry 2. One for 4/5 subjects and a separate one for maths."
    },
    {
      "id": "lpbdo19",
      "body": "But is it compulsory to make notes?"
    },
    {
      "id": "lpbduxx",
      "body": "Not really, with the exception of my maths professor."
    },
    {
      "id": "lpbdx4n",
      "body": "Tqsm brother.."
    },
    {
      "id": "lpbeaeo",
      "body": "you will get classmate 6 sub in one book get that"
    },
    {
      "id": "lpbebff",
      "body": "yep"
    },
    {
      "id": "lpbedve",
      "body": "How many of these should I take with me?"
    },
    {
      "id": "lpbekoz",
      "body": "one is enough   \nyou will have 6 or 5 section in single spiral bind book"
    },
    {
      "id": "lpbemzz",
      "body": "For the whole year?"
    },
    {
      "id": "lpbfk1u",
      "body": "Depends on ur studies"
    },
    {
      "id": "lpbfmf3",
      "body": "I will be studying only through the slides, as I am getting notebooks for a formality."
    },
    {
      "id": "lpbfnzx",
      "body": "Then u can maintain for year"
    },
    {
      "id": "lpbfq3b",
      "body": "Thank you so much man!!"
    },
    {
      "id": "lpbqoz1",
      "body": "0, borrow a page from someone, if the teacher is strict about taking notes"
    },
    {
      "id": "lpbrfgj",
      "body": "Woah are you serious? I don't have any interest in making notes actually just getting it as a formality so is just a normal notebook enough and what all do you all carry to college? Only the laptop?"
    },
    {
      "id": "lpbrp4m",
      "body": "yea"
    },
    {
      "id": "lpbtiug",
      "body": "You shouldn't depend only on the slides but it's upto you. The slides are only a summary of the source textbook."
    },
    {
      "id": "lpbvd48",
      "body": "For real? I was just checking out these posts on how to study, and everyone's like, \"Read your slides and class notes, and you'll get a 9 CGPA.\" Is that not the truth?"
    },
    {
      "id": "lpbx43j",
      "body": "Lmao, I'll let you experience it first hand. Scoring in tests isn't easy here, it takes effort. Reading just the slides is the bare minimum you should do. It will definitely get you an 8+ though, 9+ is not possible. \n\nGo back and read comments on how people complain after each ESA and that things were asked from beyond the slides (but from the book). You'll understand what I mean."
    },
    {
      "id": "lpc27qb",
      "body": "Maybe get one for maths,"
    },
    {
      "id": "lpc2bam",
      "body": "The guy who said me this was having a cgpa of 9.64 iirc, is he faking his cgpa with me then?"
    },
    {
      "id": "lpc2cqr",
      "body": "It's not, most teachers don't seem to care, only one extreme proff asked for notes. "
    },
    {
      "id": "lpc2gbl",
      "body": "For 1 sem it will be enough, excluding math ig, "
    },
    {
      "id": "lpc2ifp",
      "body": "Will the professor check my notes? If my notes are incomplete, will I face any issues or something like that?"
    },
    {
      "id": "lpc33pe",
      "body": "That one extreme proff did threaten us that he will check, idk if he will, it completely depends on proff, there are no official rules regarding this from college.\nSo atb for the lottery of which proff u will get."
    },
    {
      "id": "lpc3dbl",
      "body": "OK I mean this is actually scary ngl,but I'll manage thanks for helping out brother.."
    },
    {
      "id": "lpc435o",
      "body": "Just come to college with a blank slate opinion, don't keep any positive or negative expectations, u expect positive, u will be disappointed. u expect negative, u will actively looking for bad things to cry about "
    },
    {
      "id": "lpca0j2",
      "body": "Not questioning their GPA, but it depends on the person as well. Also, in higher semesters, doing the textbook is pretty much a requirement if you want a 9+. The slides aren't meant to replace the source text."
    },
    {
      "id": "lpcdguj",
      "body": "I'm asking about my first year. The guy whom I asked is in the third semester right now."
    },
    {
      "id": "lpcfi2o",
      "body": "What other things do we need to do then in order to score 9+gpa?"
    }
  ]
}