{
  "id": "1frwjro",
  "title": "Doubt ",
  "content": "I'm joining pes electronic city campus through kcet round 2 and my classes starts from Monday but I didnt carry my laptop from my native... Will the teachers ask students to bring their personal laptop to college from day 1 itself ? If not then any idea when ?\n",
  "metadata": {
    "author": "KaleCandid6921",
    "url": "https://www.reddit.com/r/PESU/comments/1frwjro/doubt/",
    "permalink": "/r/PESU/comments/1frwjro/doubt/",
    "score": 7,
    "created_utc": 1727584850,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lpg5sc9",
      "body": "My friend finished 1st year few months ago he told he didn't require laptop most of the times"
    },
    {
      "id": "lpg5tmi",
      "body": "They'll inform u when to bring\nUsually its only needed for coding classes"
    },
    {
      "id": "lpg5y6r",
      "body": "After how many days any idea ?"
    },
    {
      "id": "lpg6cvs",
      "body": "In the first year, you don't need a laptop frequently. Even during coding classes, you can request the faculty to use the lab systems."
    },
    {
      "id": "lpg6ty0",
      "body": "how many days after the classes start would they ask us to bring it? any idea ?"
    },
    {
      "id": "lpg7pi3",
      "body": "Not usually until 2 weeks of classes. Maybe after which they start with the labs."
    },
    {
      "id": "lpg7trq",
      "body": "Oh OK thanks a lot"
    },
    {
      "id": "lpg970b",
      "body": "See the first few coding classes will be simple input output statements and stuff so if you’ve had Cs in school or in 11th-12th you can just make submissions from a friends laptop if needed. Shouldn’t be a problem managing without laptop for at least the first 1 or 2 weeks"
    },
    {
      "id": "lphgey9",
      "body": "you dont need a laptop per se, it will be better for you to have one as it would allow you to code stuff during your python/c classes. You dont really need it. If youre in the chem cycle, you need to draw graphs using digital tool but you could just ask one of your friends to provide you with the graphs (theyre usually the same for the entire class)"
    },
    {
      "id": "lphnwza",
      "body": "My friend completed 1st year successfully without laptop 😂"
    },
    {
      "id": "lpjar4q",
      "body": "My class has been asked to bring from tmrw onwards, so ig u will also have to bring from 2nd week "
    }
  ]
}