{
  "id": "1ftorj1",
  "title": "Mca folks please share ur opinion ",
  "content": "Msrit vs pesu vs bmsce \nWhich is better for mca and share ur thoughts please ",
  "metadata": {
    "author": "sudhi-123",
    "url": "https://www.reddit.com/r/PESU/comments/1ftorj1/mca_folks_please_share_ur_opinion/",
    "permalink": "/r/PESU/comments/1ftorj1/mca_folks_please_share_ur_opinion/",
    "score": 3,
    "created_utc": 1727791116,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lpugyvu",
      "body": "I’d say PESU but again, I am a PESU student."
    },
    {
      "id": "lq3jlgr",
      "body": "R u doing mca?"
    },
    {
      "id": "lq3q1h6",
      "body": "Yes"
    },
    {
      "id": "lq3q5ng",
      "body": "Bro how many from ur batch got placed and what is the ttl strength"
    },
    {
      "id": "lq3ql72",
      "body": "I am a fresher. My classes start on Monday. As far as I know PES has OKish placements for MCA. Nothing like Btech. We will get opportunities but not anything compared to Btech. Also if you want great placements NITs are the only option or else in every college you will have to give your everything to get good placements and by good placements I mean 6-10 lpa. But again you have the option of going off campus."
    },
    {
      "id": "lq3rozy",
      "body": "Bro u joined through pessat?"
    },
    {
      "id": "lq3rqu9",
      "body": "yes"
    },
    {
      "id": "lq3s6q3",
      "body": "Bro before u joined u definitely did research abt placements right like whats the batch how many got placed last year if u have given me some info"
    },
    {
      "id": "lq3sfdg",
      "body": "Bro this sub reddit is not very responsive to the MCA folks (not blaming anyone). Also the placement sheet shared is for Btech students not for us. As much as I have heard median is of 6lpa and highest was 12 or 16 (I forgot)."
    },
    {
      "id": "m1czzgr",
      "body": "Hey, how's your experience in PES.. I'm planning to take admission in MCA next year. Can you suggest me good colleges."
    },
    {
      "id": "m1dol1e",
      "body": "Can be better but which college doesn’t have problems. If you can try getting RVCE if not PES is your best option. Best of luck."
    },
    {
      "id": "m6d2hnr",
      "body": "Go for Rv"
    },
    {
      "id": "m6wstqx",
      "body": "fees are way to high, specially for mq students"
    },
    {
      "id": "m79twz0",
      "body": "PES is great for knowledge but too crowded for placement, Has a better Placement for be cse but average in MCA. From my experience, you should try for RV, Ramaiah then Keep pes as your next option"
    },
    {
      "id": "mvud2bh",
      "body": "Good for knowledgeable? What do they teach and in what sense you are saying it's good for knowledgeable. And do the mca students are allowed to sit in placement for fang companies visit pes. And is it true that highest package for mca is only 12 lpa while for btech is 50 to 60 lpa?"
    },
    {
      "id": "mvyg9el",
      "body": "Do the mca students get chance to sit in the top companies or not.. i want to know whether the mca students in pesu is not getting high paying jobs because of their skills or because of company don't allow them to sit in placements? Would you consider someone doing mca from pesu?"
    }
  ]
}