{
  "id": "1fy1imz",
  "title": "did it happen again? please dont do this guys i beg yall",
  "content": "someone from 2nd year mechanical sucided it seems in hostel/pg can anyone please confirm? we saw a ambulance at back gate i am very scared in this college now",
  "metadata": {
    "author": "oejdidjdjsj",
    "url": "https://www.reddit.com/r/PESU/comments/1fy1imz/did_it_happen_again_please_dont_do_this_guys_i/",
    "permalink": "/r/PESU/comments/1fy1imz/did_it_happen_again_please_dont_do_this_guys_i/",
    "score": 52,
    "created_utc": 1728283782,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lqqqwh2",
      "body": "Today?"
    },
    {
      "id": "lqqqx96",
      "body": "Which one RR or EC?"
    },
    {
      "id": "lqqsloo",
      "body": "Mech means it's rr not ec"
    },
    {
      "id": "lqqsouu",
      "body": "Why is this even happening?"
    },
    {
      "id": "lqqt8at",
      "body": "You can only confirm that it was if there was police as well"
    },
    {
      "id": "lqqvvdt",
      "body": "any update?"
    },
    {
      "id": "lqqwbev",
      "body": "Don’t get to the conclusion just by seeing an ambulance."
    },
    {
      "id": "lqqwthb",
      "body": "Isn’t an ambulance always on the campus? \nI see one parked in front of mrd block or GJB or backgate"
    },
    {
      "id": "lqqxcgy",
      "body": "Yes"
    },
    {
      "id": "lqqxhys",
      "body": "Two, actually. A normal sized ambulance and an Omni sized ambulance. I have spotted them around BE Block and MRD block, backside where the buses park."
    },
    {
      "id": "lqqxq09",
      "body": "OP is it true? It's been 90 minutes since you posted."
    },
    {
      "id": "lqqyqxb",
      "body": "Any updates guys?"
    },
    {
      "id": "lqr4bmv",
      "body": "I am in 2nd Year mech nothing has Happened"
    },
    {
      "id": "lqr4cgc",
      "body": "Please Delete the post."
    },
    {
      "id": "lqr4e2n",
      "body": "Don't put False messages."
    },
    {
      "id": "lqr4kxe",
      "body": "It's a Lie it's False I am In 2nd Year Mechanical."
    },
    {
      "id": "lqr5b7v",
      "body": "It's false please stop spreading wrong messages please stop it"
    },
    {
      "id": "lqr90s0",
      "body": "No one is responsible for the death by suicide if someone is being foolish with relationship or cheating. Suicide is never a solution but cowardice. The worst matter about our students is spreading rumours.,"
    },
    {
      "id": "lqrge8z",
      "body": "Don't fear monger here if you're not sure about it."
    },
    {
      "id": "lqrto6w",
      "body": "My Sources telling me it's a girl who suicided, and no I'm not talking about that SAMS pg girl who suicided.\nAlso not sure where she suicided.\nI can confirm she's a 2nd year student (don't know the branch but probably from RR campus).\n\nNot in the college.\nBut the news is true guys 👍🏻"
    },
    {
      "id": "lqrz6gb",
      "body": "I saw a suicide post in this sub on Saturday morning that was quickly deleted in 30 minutes. They mentioned that it was a girl and even mentioned her name. Apparently, she went home on Friday after college and took her life. Is today's and Friday's incident the same or are they two separate incidents?"
    },
    {
      "id": "lqs03f0",
      "body": "Not sure about today's incident.\n\nBut the Friday incident was true, even i know the name. \n\nMy sources never lie"
    },
    {
      "id": "lqs0jrl",
      "body": "Can I DM you?"
    },
    {
      "id": "lqs0vmr",
      "body": "Sure"
    },
    {
      "id": "lqs1inf",
      "body": "Unable to DM you for some reason. Prolly because I'm using an alt account which is not even an hour old. I just wanted to confirm the name. Can you DM me instead? The name I've got starts with M and ends with A."
    },
    {
      "id": "lqs21uc",
      "body": "No please delete this it's a False message."
    },
    {
      "id": "lqs2762",
      "body": "Please ask the person who put this Post to delete it it has Not happened please don't create Chaios."
    },
    {
      "id": "lqs30bd",
      "body": "WHY ARE YOU GUYS SO DESPERATE TO SUPPRESS IT ?you from pes undercover or wot ?\nI know the truth man, and you cannot simply change the truth 🙏🏻"
    },
    {
      "id": "lqs5fz1",
      "body": "Iam not against anyone, but this guy's whole personality on reddit is just supporting pesu no matter what"
    },
    {
      "id": "lqs5osg",
      "body": "Fake IDs by PESU , I can guarantee that"
    },
    {
      "id": "lqs858i",
      "body": "Ya there was another guy with a south actor pfp who was meat riding pes all the time in every related post he deleted his acc this is his new acc ig"
    },
    {
      "id": "lqt2l8c",
      "body": "Give more info"
    },
    {
      "id": "lqu1iie",
      "body": "Why tho?"
    },
    {
      "id": "lqu1pn3",
      "body": "Why are you so invested in this story not getting out though?"
    },
    {
      "id": "lqvp9bn",
      "body": "ah yes, an ambulance, a gaurenteed sign of suicide"
    },
    {
      "id": "lqx0863",
      "body": "Report this mf"
    },
    {
      "id": "lqy3d7r",
      "body": "Again"
    },
    {
      "id": "lqy3eo4",
      "body": "Again"
    },
    {
      "id": "lqyxhoy",
      "body": "No ambulance is always there in PES"
    }
  ]
}