{
  "id": "1fywav1",
  "title": "How are the MCA placements in PES?",
  "content": "I'm thinking of joining next year and i'm making a list of colleges and PES is one of the closest ones so please lmk",
  "metadata": {
    "author": "Financial_Seesaw6427",
    "url": "https://www.reddit.com/r/PESU/comments/1fywav1/how_are_the_mca_placements_in_pes/",
    "permalink": "/r/PESU/comments/1fywav1/how_are_the_mca_placements_in_pes/",
    "score": 4,
    "created_utc": 1728382330,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lqyamn5",
      "body": "Terrible also stay away from this college, currently doing MCA here and it’s a shitshow"
    },
    {
      "id": "lqybron",
      "body": "On a scale of 1-10 how bad is it? I did BCA in jain and I don't think anything can be worse than that \nThe main reason I want to do MCA cause my whole uni experience was terrible 😞"
    },
    {
      "id": "lqyckbi",
      "body": "I did my BCA in Reva university it was very chill there had loads of fun. But here the college is all about studies the whole time, no competitions and not much opportunities for MCA students, placements currently are very bad as mostly engineering students are being selected, also currently there are 360 students in Mca that’s 6 sections in total so the competition is very high and top of that full day college till 4:45pm and coming to the worst part the exams are super difficult you need to work on it very hard as the questions aren’t straight forward like other colleges and needs a deep understanding of topics. Also the crowd in MCA is terrible barely anyone goes out or does anything"
    },
    {
      "id": "lqycwn8",
      "body": "360 people is a lot and when does college start?"
    },
    {
      "id": "lqyetfd",
      "body": "October"
    },
    {
      "id": "lqyevln",
      "body": "What’s made your experience bad at Jain?"
    },
    {
      "id": "lqyhbp0",
      "body": "I actually meant time does college starts but what about pgcet students?"
    },
    {
      "id": "ltzb2d9",
      "body": "Check ur dm"
    },
    {
      "id": "lzk0j8i",
      "body": "Hi can you send it again?"
    },
    {
      "id": "m0hhp21",
      "body": "please don't think to ruin your mental health"
    },
    {
      "id": "m4oww6o",
      "body": "Why was jain bad?"
    },
    {
      "id": "mtzdgy6",
      "body": "why do you say so? are companies not coming or there is some other reason"
    },
    {
      "id": "my83a1d",
      "body": "why everywhere it showing avg placement of 8-9LPA .Where should i take then? i Dint gave any competetive exam"
    },
    {
      "id": "my83bln",
      "body": "where r u taking admison?for mca"
    }
  ]
}