{
  "id": "1fzquhg",
  "title": "Saw a really hot senior in pes EC, he was even there for mech bootstrap teaching us bike, quite brown , less beard but good mouchtach , also he was stammering a little while explaining ",
  "content": "",
  "metadata": {
    "author": "Slight-Buddy7709",
    "url": "https://www.reddit.com/r/PESU/comments/1fzquhg/saw_a_really_hot_senior_in_pes_ec_he_was_even/",
    "permalink": "/r/PESU/comments/1fzquhg/saw_a_really_hot_senior_in_pes_ec_he_was_even/",
    "score": 0,
    "created_utc": 1728478882,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lr33krm",
      "body": "Please dont make this into a confession sub\nThere are enough instagram pages for these already"
    },
    {
      "id": "lr34iut",
      "body": "copypasta where?"
    },
    {
      "id": "lr34xi7",
      "body": "Y'all kids need to stop diluting the quality of this subreddit"
    },
    {
      "id": "lr3509d",
      "body": "i agree even as a fresher"
    },
    {
      "id": "lr39ud7",
      "body": "One of the few cons of reddit becoming mainstream and this sub being active\nI am a fresher and almost every person in my class lurks on this sub \nThe other day the false alarm spread like wild fire in EC Campus whole class got to know that there mightve been another incident like 5-10 minutes of the post being uploaded on reddit"
    },
    {
      "id": "lr3gc4l",
      "body": "Man i donr care if u saw a hot or cold senior , this is not the place for that, if u want to speak to them u should have approached them instead of making this a \"father I have sinned\" corner, good luck to u in the real life"
    },
    {
      "id": "lr3rg8s",
      "body": "![gif](giphy|c3XhrmfoN5fOpjcl3z|downsized)\n\nOkay now what do you want us to do?"
    },
    {
      "id": "lr3rkwk",
      "body": "![gif](giphy|wkKRo7N0T1ONO)"
    },
    {
      "id": "lr3sdxr",
      "body": "Learn to write \"moustache\"(looks like your autocorrect gave up on you too)next time before making your next reddit post."
    },
    {
      "id": "lr4a03a",
      "body": "okay, so?? what are we supposed to do with it?"
    },
    {
      "id": "lr4fxtq",
      "body": "Bruh ngl the incoming juniors are turning this sub into a confession page,from dms asking such questions in the name of \"guidance\" to posting such confessions."
    },
    {
      "id": "lr7mf0u",
      "body": "this is very wholesome to hear from a growth of Sub POV and very weird to hear from a content POV"
    },
    {
      "id": "lr8d6v0",
      "body": "Ahh that guy, his name is Anirudh Sai Lanka, bro's traumatized by the amount of female attention he gets."
    },
    {
      "id": "lr9f4c0",
      "body": "Why would you bring out a name like that buddy? Kindly delete it."
    }
  ]
}