{
  "id": "1fzs4qz",
  "title": "Welp, kcet allotment happened, need help.",
  "content": "I got aiml at the electronic City campus, what should I expect? How's the crowd and stuff😭 I'm a little scared about the whole thing.\n\nAlso, I'm gonna be traveling from Girinagar area everyday, what would u guys recommend I do for travel? Should I come in bike or public transport? What would be the better option in the long run for flexibility?",
  "metadata": {
    "author": "Fury_122333",
    "url": "https://www.reddit.com/r/PESU/comments/1fzs4qz/welp_kcet_allotment_happened_need_help/",
    "permalink": "/r/PESU/comments/1fzs4qz/welp_kcet_allotment_happened_need_help/",
    "score": 16,
    "created_utc": 1728482512,
    "flair": "PESSAT/Admission",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lr3drao",
      "body": "dont worry about crowd man  \ni was honestly expecting a much worse crowd/peer group \n\nthere are so many people (95%+ilers )who got fucked by jossaa and bits counselling and other counsellings got over by that time so they joined through pessat"
    },
    {
      "id": "lr3ega9",
      "body": "Thanks for the reply!\nYep okay that makes me genuinely feel better. I was worried about making friends and stuff(still am), but this is a silver lining I guess."
    },
    {
      "id": "lr3emwr",
      "body": "Yeah same even in rr."
    },
    {
      "id": "lr3jdn0",
      "body": "PLEASE stay in hostel. For your sanity. That long journey is going to take a toll on you on a daily basis.\n\n\nCrowd wise I've heard a lot of people just leave as soon as class gets over, not a lot of people stay for clubs and stuff. But some of the smartest people I know are in EC campus, try to find those smart guys in your batch and mingle. "
    },
    {
      "id": "lr3n5vn",
      "body": "Sadly, due to multiple personal reasons at home, I can't be staying at a hostel :(, hence I'm stuck having to travel everyday for this long.\n\nI see, I'll mingle with them and just hope I can make good friends. Thank you for the reply, I appreciate it."
    },
    {
      "id": "lr3tiv6",
      "body": "Huh?\n\nHow did they have 95%tile and fuck up pessat???\n\nSus"
    },
    {
      "id": "lr3wpp4",
      "body": "not fk up pessat, they did good in pessat so only they joined through it"
    },
    {
      "id": "lr3wvcv",
      "body": "Ec campus obviously they fucked up\n\nIf they didnt they would have joined rr campus"
    },
    {
      "id": "lr3x3wo",
      "body": "you think getting ec campus is easy?"
    },
    {
      "id": "lr3xp50",
      "body": "pessat is sus"
    },
    {
      "id": "lr3xv7g",
      "body": "My friends with 70-80 %tile(jee) \n\nHv got rr campus cse, cse spec through pessat\n\nThe same ppl have a rank 15k+ in kcet\n\n10k+ in comedk\n\nPessat had insane rank inflation aswell this year\n\nGetting ec campus is definitely easy for someone who had 95%tile+"
    },
    {
      "id": "lr3yni5",
      "body": "the thing with these exams which have many shifts is they look kinda scammy and unfair to students"
    },
    {
      "id": "lr40wv6",
      "body": "Good that they removed it "
    },
    {
      "id": "lr44i6k",
      "body": "Yeah it is but the peer group is actually good atleast in rr and ig won't be much different in ec"
    },
    {
      "id": "lr44nqy",
      "body": "true"
    },
    {
      "id": "lr47b6c",
      "body": "The reason for this is Many Colleges Like BMS,MS Ramaiah and Many other colleges inflated The CS Seats and so people didn't prefer to Take the CS Seats of PESSAT and went through Comedk , Kcet."
    },
    {
      "id": "lr47f7c",
      "body": "They might be in CBSE"
    },
    {
      "id": "lr47i8x",
      "body": "Comedk also Normalisation and the way it's conducted is not that True."
    },
    {
      "id": "lr4q6ax",
      "body": "Like see first I thought that Introduction of Negative Marking is a Positive thing but Now it Looks Opposite"
    },
    {
      "id": "lr4q8y7",
      "body": "Even after PESSAT introduced Negative Marking."
    },
    {
      "id": "lr6u5jg",
      "body": "95%ilers would have joined thru kcet"
    },
    {
      "id": "lr6z7cr",
      "body": "since when are you gonna attend classes?"
    },
    {
      "id": "lr7cn1e",
      "body": "15th October"
    },
    {
      "id": "lr8dqnh",
      "body": "its honestly been pretty fun, ig u guys will also be here in time for maya at least."
    },
    {
      "id": "lre14vh",
      "body": "did you report to college?"
    },
    {
      "id": "lrebshc",
      "body": "Will be doing so on 14th"
    }
  ]
}