{
  "id": "1g0hnik",
  "title": "Seniors, how do you guys manage to study at home after travelling for more than an hour from college.",
  "content": "It's just so exhausting.",
  "metadata": {
    "author": "Potato_Vortex",
    "url": "https://www.reddit.com/r/PESU/comments/1g0hnik/seniors_how_do_you_guys_manage_to_study_at_home/",
    "permalink": "/r/PESU/comments/1g0hnik/seniors_how_do_you_guys_manage_to_study_at_home/",
    "score": 23,
    "created_utc": 1728563357,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lr8rqsq",
      "body": "You got to learn to manage time on your time, try to finish a few assignments in class during breaks and free periods, if you are travelling by bus/metro you can start studying there. I’ve seen people travelling 2hrs one way and ending up with MRD scholarship."
    },
    {
      "id": "lr91w8f",
      "body": "If you feel that you're losing more time travelling, shift to a pg or hostel."
    },
    {
      "id": "lr97f2o",
      "body": "If it's the Amaatra hostel or PG somewhere in Neeladri, it'll still take an hour 🙃😂"
    },
    {
      "id": "lr986tp",
      "body": "An hour? Are you sure about that? Afaik it doesn't take any more than 20 min to reach."
    },
    {
      "id": "lr99ph3",
      "body": "During peak hours, traffic gets quite bad. It can easily take an hour or more. But yeah, generally shouldn't be more than 30 mins."
    },
    {
      "id": "lr9n4zo",
      "body": "They're on the grind 💯  \nBeing a day scholar tbf doesn't make sense if you live more than 2hrs away from campus. I mean you spend most of the day travelling and the rest in college? Literally no free time"
    },
    {
      "id": "lrcfd2n",
      "body": "Thanks for the advice!"
    },
    {
      "id": "lrcfld7",
      "body": "Agreed, although it takes 45 mins to reach ideally. Bmtc+traffic makes it worse."
    },
    {
      "id": "lrd10wr",
      "body": "Cope LMAO"
    },
    {
      "id": "lrd9kdi",
      "body": "Try to understand most of the concepts in class itself so that way you only have to revise at your house"
    },
    {
      "id": "lrdagyp",
      "body": "Who studies everyday?"
    }
  ]
}