{
  "id": "1g135qc",
  "title": "Dreading ",
  "content": "Everyone's going for garba, going out with friends on trips, and having fun outside and I'm stuck with this shit 6:30pm curfew. Parents don't get me back home on weekends or holidays, every holiday goes in this place, they don't let me go overnight to friends or relatives here either, same monotonous life forcing myself to come back by 6:30 to hostel, sigh",
  "metadata": {
    "author": "caramel_drizzl",
    "url": "https://www.reddit.com/r/PESU/comments/1g135qc/dreading/",
    "permalink": "/r/PESU/comments/1g135qc/dreading/",
    "score": 65,
    "created_utc": 1728626671,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lrdhy61",
      "body": "And here I am, sad about missing hostel life.\nThe grass is always greener on the other side bro, make the most of what you have. I bet you can have just as much or even better experiences in hostel with your roommates and tons of other things!"
    },
    {
      "id": "lrdi2pr",
      "body": "Oh trust me, girls hostel is not even a fraction as fun as boys hostel// subjective but that's what I confer from what I've heard haha"
    },
    {
      "id": "lrdifwk",
      "body": "I mean it's \"subjective\" for a reason"
    },
    {
      "id": "lrdk6sv",
      "body": "Girls hostel could be fun if you wanted, you could have garba in your room with friends lmao"
    },
    {
      "id": "lrdkgnk",
      "body": "The problem is Indian Parents. Hostel is just an enforcing function of what parents ask for from Universities."
    },
    {
      "id": "lrdnlxh",
      "body": "True can feel that pain"
    },
    {
      "id": "lrdnwdy",
      "body": "Make up some bs reason, get a pg"
    },
    {
      "id": "lrdqjrs",
      "body": "Wait, the curfew is 6:30 now? 2020 grad here. It used to be 9:30 for us IIRC"
    },
    {
      "id": "lrdvv1l",
      "body": "Make good friends in hostel and you’re sorted"
    },
    {
      "id": "lre7633",
      "body": "ey u good lil bro ? , just try out new things which dont make u feel like uve been living the same \"monotonous\" life. hope u find good ppl around u and have fun w them 🙏"
    },
    {
      "id": "lreftdh",
      "body": "Bro i have great friends here but most of these girls are just not going out type 😭 the one's that are going out type are just too stuck up 😭"
    },
    {
      "id": "lrej9nj",
      "body": "Girl trust me shift to a pg life will be more peaceful"
    },
    {
      "id": "lrelr88",
      "body": "😩"
    },
    {
      "id": "lrev0pc",
      "body": "Hopefully next year since it's final"
    },
    {
      "id": "lrev8ro",
      "body": "I'm good,  I've dayboarding friends who are amazing, but of course they're busy at times too, i will find ways to entertain myself outside alone"
    },
    {
      "id": "lrevbvn",
      "body": "It's always been 6:30 for girls 😭"
    },
    {
      "id": "lrf45f8",
      "body": "Exactly, if the hostel would let kids be free parents wouldn't like it and not send their kids, plus the college doesn't want to risk shit"
    },
    {
      "id": "lrha9ds",
      "body": "It used to be 7 for the 2018 batch"
    },
    {
      "id": "lrj5nf1",
      "body": "Damnnnn yeah this hostel just sucks"
    },
    {
      "id": "lru3f16",
      "body": "Ur in ur 3rd year rn?"
    },
    {
      "id": "ls0n5zp",
      "body": "2nd"
    }
  ]
}