{
  "id": "1g24sr4",
  "title": "How's Law at PES?",
  "content": "Asking for a friend who's thinking about joining here, she's currently in her 2nd puc",
  "metadata": {
    "author": "Sensitive_Ladder5259",
    "url": "https://www.reddit.com/r/PESU/comments/1g24sr4/hows_law_at_pes/",
    "permalink": "/r/PESU/comments/1g24sr4/hows_law_at_pes/",
    "score": 2,
    "created_utc": 1728752990,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lrlhvxw",
      "body": "PES is known for its engineering program, and CSE to be specific, except that everything is shit here."
    },
    {
      "id": "lrox2ch",
      "body": "I have friends in law it's actually decent u have an entire dept and separate library for law as well"
    },
    {
      "id": "lrpi08y",
      "body": "It depends on one how they want to take studies in law department of PES as you’ll have to understand the concept in class itself coz later it becomes difficult to understand the concept, but you can expect a lot of zero hour seminars which is ofc beneficial. They have a dedicated hour every week for one seminar. They even have a thing called as legal eagle which is mostly for 1st yr and only for know second years student, which I feel is just waste of time.\n\nLaw department has a separate law library.\n\nThey even have a moot court hall.\n\nBut the con in law department is you can’t expect classes only till 1-1.45 like few other departments has, classes here are till 4-4.45"
    },
    {
      "id": "ltmqmau",
      "body": "PES Law is now growing as a department. The faculty is great, seniors are helpful, and you have around 25 Departmental clubs. You're free to join the other college clubs as well. Classes start at 8 a.m. and last until 4 p.m. You have research papers, MCQ tests and a written exam at the end of a semester. They prepare you in all the ways possible."
    },
    {
      "id": "n01n6f2",
      "body": "Are you currently studying in pes law?"
    },
    {
      "id": "n01n7pn",
      "body": "Are you currently studying in pes law?  I have a couple of questions. Can I dm?"
    }
  ]
}