{
  "id": "1g44by5",
  "title": "Sports",
  "content": "Are there any sports teams here at EC Campus??\nI have joined through Kcet 3rd round and at first glance I didn't feel like anyone here gives a damn about sports.",
  "metadata": {
    "author": "TheCosmicBlizzard",
    "url": "https://www.reddit.com/r/PESU/comments/1g44by5/sports/",
    "permalink": "/r/PESU/comments/1g44by5/sports/",
    "score": 6,
    "created_utc": 1728987442,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ls0s3su",
      "body": "The selections for first year students are already done. Wait for the next selections ig."
    },
    {
      "id": "ls0sd3h",
      "body": "I see. Are the basketball and badminton teams pretty good?"
    },
    {
      "id": "ls0u223",
      "body": "No idea but from what I've seen only 3-4 first years got selected in many sports out of around 30-40, so i expect the teams to be good."
    },
    {
      "id": "ls0w6k1",
      "body": "Bro pls tell me whatever u know about the basketball team. How often do they practice? How often do they go to tournaments? Etc"
    },
    {
      "id": "ls15wwa",
      "body": "I'm not in the basketball team so idk about their schedule. Pretty sure they practice almost everyday after college like other teams. Just head towards the basketball court around 4. You might find some in the team, talk to them."
    },
    {
      "id": "ls16kvl",
      "body": "Okay"
    },
    {
      "id": "ls2nflj",
      "body": "they play so srsly bro what u talking, it seems the cricket coach is damn nice here, go to mrd u will see badminton sweats over there.  \nTeams do exist but their selections are over."
    },
    {
      "id": "ls2nk55",
      "body": "my friend is in bb team and they practice quite  bit, often enough that he is already tired of it lol"
    },
    {
      "id": "ls36e68",
      "body": "lol if your at EC campus even if your Sachin Tendulkar you wont make it to the PES team"
    },
    {
      "id": "ls4eti7",
      "body": "Ah, good to hear"
    },
    {
      "id": "ls4f1gi",
      "body": "I don't play cricket but why is it so? Is the team too good?"
    },
    {
      "id": "ls4tjwq",
      "body": "Is he a 3rd year? Or 4th?"
    },
    {
      "id": "ls5s4ho",
      "body": "politics they give preference to rr campus students"
    },
    {
      "id": "ls61voe",
      "body": "Wtf! I thought both campuses had their own teams!"
    },
    {
      "id": "ls8hgo8",
      "body": "1st bro, he got selected a week ago or smth"
    },
    {
      "id": "lsazt1e",
      "body": "Ohh I see\nWhen did u guys join the college tho?"
    },
    {
      "id": "lse7j46",
      "body": "exactly a month ago,"
    },
    {
      "id": "lse7onp",
      "body": "Ohh I see\nThanks for the info about basketball tho"
    },
    {
      "id": "lse8fua",
      "body": "today he went for some contest called infini"
    },
    {
      "id": "lse8p9j",
      "body": "Is that a basketball tournament? Or some other club stuff?"
    },
    {
      "id": "lse94bl",
      "body": "nah some national level event it seems, all sports are there."
    },
    {
      "id": "lse9lxd",
      "body": "Ohh damn\nDidn't expect pes ecc to allow this much participation in sports.\nBtw whats your friend's approx height?"
    },
    {
      "id": "lse9xe8",
      "body": "185+ ig"
    },
    {
      "id": "lsea8rg",
      "body": "if ur so obsessed with sports why would u choose pes and u should do this research before joining, eod this is still a nerdy college"
    },
    {
      "id": "lsed8po",
      "body": "Yea yea ik it's a nerdy college \nMy parents put me here to cut down my obsession with sports and focus more towards studies."
    }
  ]
}