{
  "id": "1g4zu47",
  "title": "LANGUAGE BARRIER",
  "content": "I have joined pes ec campus through cet r3 one but my kannada isnt good enough to properly communicate with others comfortably....but since ive joined in cet r3, all my classmates are kannadigas and mostly everyone speaks kannada..I feel kind of trapped now\n\n  \nwhat do i do? Is there any other way to find more english/hindi speaking students ?",
  "metadata": {
    "author": "CareEuphoric562",
    "url": "https://www.reddit.com/r/PESU/comments/1g4zu47/language_barrier/",
    "permalink": "/r/PESU/comments/1g4zu47/language_barrier/",
    "score": 8,
    "created_utc": 1729086570,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ls791up",
      "body": "try to push 1st sem, 2nd sem you will be shuffled"
    },
    {
      "id": "ls79aig",
      "body": "Speak in English/Hindi with them and they'll reply u back in the same language (Maybe not Hindi but English works everytime).Just cause they speak kannada doesn't mean they don't know English/Hindi,chill out and speak out to them."
    },
    {
      "id": "ls79dg2",
      "body": "rip.\n\nThats why you should go out on your own as a kid, and try to speak the local language..."
    },
    {
      "id": "ls79ehm",
      "body": "which section are you in?"
    },
    {
      "id": "ls7a4f6",
      "body": "Which section op?"
    },
    {
      "id": "ls7b0q0",
      "body": "still doesnt make much difference ig..."
    },
    {
      "id": "ls7b5rk",
      "body": "skill issue"
    },
    {
      "id": "ls7ceni",
      "body": "which section dude ? \n\ni am north indian too, girls talked to me in english itself\n\nif same section as me (Q) , then we will talk , if that helps"
    },
    {
      "id": "ls7cwyf",
      "body": "Try speaking in english, I too faced the same issue, but the people around me are so friendly."
    },
    {
      "id": "ls7d4es",
      "body": "Get ready for \"how u got in through kcet da?\""
    },
    {
      "id": "ls7fire",
      "body": "lmao p13?"
    },
    {
      "id": "ls7imjc",
      "body": "Don't listen to ppl saying wait till you get shuffled. Make an attempt to learn kannada and speak as much as you can. Trust me, kannadigas love people who try their level best to learn the language and they themselves will start to hangout with you."
    },
    {
      "id": "ls7ipfd",
      "body": "In my experience some of the workers knew more hindi than english NGL.. \nWhen I asked some questions to aunties in english they gave me a confused look and just kept speaking in kannada. One of them even asked if I knew hindi rather than english"
    },
    {
      "id": "ls7jo7x",
      "body": "Well this is not abt rr/ec it is the same in entire Bangalore,if uk English and Hindi u will mostly have no obstacles. (except auto drivers and some small shops)"
    },
    {
      "id": "ls7jxjq",
      "body": "hein really? \n\nluckily nobody asked me that \n\n( i am a girl , in girls row nobody asked me this lol )"
    },
    {
      "id": "ls7mglj",
      "body": "Just talk in English da"
    },
    {
      "id": "ls7mm9b",
      "body": "Yes\n\nas soon as u say, ur from \"idk\", be ready for the questions.\n\n( i am a boy, in boys row most of the people asked me this lol )"
    },
    {
      "id": "ls7mmvf",
      "body": "Yes\n\nas soon as u say, ur from \"idk\", be ready for the questions.\n\n( i am a boy, in boys row most of the people asked me this lol )"
    },
    {
      "id": "ls7nvms",
      "body": "Bruh are you from section Q?"
    },
    {
      "id": "ls7pnnr",
      "body": ">all my classmates are kannadigas and mostly everyone speaks kannada..\n\nI have been in Bengaluru all my life and I have always had the opposite of this in all my class 😭"
    },
    {
      "id": "ls7vbd8",
      "body": "the pessat and jee quota kids are much more diverse, u can find people who speak ur language there easily, honestly in my class everyone speaks English only, ig its just a kcet thing."
    },
    {
      "id": "ls7vuvs",
      "body": "facs lol, i had more Telegu and north Indian friends then kannada friends my whole life, some of those kannada kids speak English at home 😂"
    },
    {
      "id": "ls80tkc",
      "body": "Just talk in English everyone here knows english but if u feel left out cuz most of them will talk in kannada with eachother just come out in break there are lots of other PPL out there and also after 1st year ur gonna get shuffled anyways.🙃"
    },
    {
      "id": "lsbe6wn",
      "body": "Same, I could hardly 4-5 Kannada people in my class"
    },
    {
      "id": "lscggaq",
      "body": "Just give it time! Stay calm and speak in English to who you can. Eventually, it will work out."
    }
  ]
}