{
  "id": "1g50ie1",
  "title": "Fomo ",
  "content": "I've joined through kcet round 3 and it feels like pessat classes have more chill peer group. I don't really like my class people and ik I might just be overthinking but I feel so out of place while all of my other friends have so much fun.😭\n\nWhat can I do to cope🤧",
  "metadata": {
    "author": "Criesinpesu",
    "url": "https://www.reddit.com/r/PESU/comments/1g50ie1/fomo/",
    "permalink": "/r/PESU/comments/1g50ie1/fomo/",
    "score": 12,
    "created_utc": 1729088381,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ls7eis8",
      "body": "With time, it shall pass"
    },
    {
      "id": "ls7fn0j",
      "body": "what section dude"
    },
    {
      "id": "ls7fz6a",
      "body": "Is there anything I can do🥲"
    },
    {
      "id": "ls7g1zt",
      "body": "c14"
    },
    {
      "id": "ls7htoa",
      "body": "Join PES 28 Discord.\nYou'll feel better."
    },
    {
      "id": "ls7i7g9",
      "body": "Its placebo,\nC14 is a pessat class, ask around(I might be wrong)\nIf you don't like your classmates wait for Sem2 shuffle and hope you'll get better ones"
    },
    {
      "id": "ls7ie6w",
      "body": "I can shuffle in sem2? or year 2?"
    },
    {
      "id": "ls7ir3q",
      "body": "Send link"
    },
    {
      "id": "ls7it40",
      "body": "Pretty sure that after the cet kids catch up, everyone is shuffled in Sem2. (don't take my word for it but there's a shuffle eventually)"
    },
    {
      "id": "ls7kbrl",
      "body": "https://discord.gg/VHRYaQAe"
    },
    {
      "id": "ls7mtm4",
      "body": "how's this gonna help🤧"
    },
    {
      "id": "ls7n511",
      "body": "pessat class? they have mixed kcet 3rd round with pessat class?"
    },
    {
      "id": "ls7n5tv",
      "body": "Bro really?\nYou'll get to meet people who are willing to talk to you including myself. \nPeople on discord are chill.\nWho knows you might even get your peer group there like I did."
    },
    {
      "id": "ls7nbuq",
      "body": "oh thank u, hopefully I get along"
    },
    {
      "id": "ls7ngsi",
      "body": "I realised I just made a mistake \nThere are 14 classes in each cycle , total 28\nOf which I believe c12 and p12 are 2nd round\n13,14 are 3rd round"
    },
    {
      "id": "ls7yk91",
      "body": "Chill and chin up bro!\nHappens initially, you'll eventually get along with your classmates and eventually your batchmates.\nThat's just a common perception which u'd have looking at cold response of ur peers to the conversations u initiate but as and when u get to interact with them it'll get better...maybe during labs or a boring class( lol ) interact with them"
    },
    {
      "id": "ls7ytoq",
      "body": "it's just that I'm quite bad at making friends"
    },
    {
      "id": "ls7zw7x",
      "body": "i can be ur pessat friend 🤷‍♂️"
    },
    {
      "id": "ls80gu3",
      "body": "Which class are you from you wanna talk"
    },
    {
      "id": "ls80w3q",
      "body": "You can wait, as with time it shall pass"
    },
    {
      "id": "ls82rwf",
      "body": "my classmates were giving dry replies whenever I tried to make a convo🤧"
    },
    {
      "id": "ls841p7",
      "body": "Which sec are you in there brother"
    },
    {
      "id": "ls85hcl",
      "body": "Okay cool..if it's some low self esteem type issue...maybe bcz of ur looks then consider working out, gym is a good place to make friends.\nIf it's some sorta language barrier then don't care much abt it  just step up and start talking.\nIf u have a feeling of embarrassment that's totally fine bcz once u get gelled with some1 u both will just laugh and make jokes abt your first convo.\nDon't overthink much abt what the opposite person thinks bout u, be kind, be respectful and straightforward, that'll fetch u \"like minded\" friends!!"
    },
    {
      "id": "ls885sq",
      "body": "Even i am from cet bro u can approach me for a talk , my section is p7"
    },
    {
      "id": "ls8adp4",
      "body": "It shuffles once after 1st sem and for a final time after 2nd sem."
    },
    {
      "id": "ls8an0q",
      "body": "And occasionally bleach my eyes every time I open that server"
    },
    {
      "id": "ls8b6mh",
      "body": "That's true tho,\nI don't know how but you always come during the wrong time lmao"
    }
  ]
}