{
  "id": "1g78ygz",
  "title": "Just to vent/rant",
  "content": "I am a third year in hostel, and it is so weird how I still don't have any friends in this place, I do have friends in my class, or even outside my class, but when I just go back to my hostel? It sucks, no one asks me or takes me seriously, I have tried so many times and I am in a group in hostel, but I can always feel like I am just there because I got myself there, instead of anyone wanting me there, I could just focus in my studies and not care, but how am I supposed to when I see everyone else enjoying themselves in the group while I am always the outcast?\nIt is either kannadigas or north indians, and I am neither, I do not know what I should do to be liked or so that they even consider me as someone part of the group, I feel like I just tag along, they do not even listen half the time when I talk, while all my other friends in college go back home and have their groups too in their apartment.\nWill I always be a loner, or am I just a cry baby?",
  "metadata": {
    "author": "SubjectAd6579",
    "url": "https://www.reddit.com/r/PESU/comments/1g78ygz/just_to_ventrant/",
    "permalink": "/r/PESU/comments/1g78ygz/just_to_ventrant/",
    "score": 45,
    "created_utc": 1729344597,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lsp3bwm",
      "body": "+1 but i'am in 1st year"
    },
    {
      "id": "lsp6sx3",
      "body": "At this point, I am in a similar situation and the only thing that consoles me is that we have just an year left"
    },
    {
      "id": "lsp9gxl",
      "body": "Man I feel this. Most of my friends are telugus, kannadigas and a few north indians that hang out with people who speak their own languages and I'm often left to myself."
    },
    {
      "id": "lspcuwg",
      "body": "+1 man I'm in second year ik ppl have a laugh but no one really I can call my friend it wasn't always like this I was fine in school. I see people going out on weekends making plans it makes me slightly upset. I hope this changes."
    },
    {
      "id": "lspql73",
      "body": "Text me whoever is in hostel and wants to talk or open up....or facing similar situation... Its okay to feel lonely but its more important to open up. Am here so anyone who thinks he needs help, do reach me"
    },
    {
      "id": "lspzzhe",
      "body": "+1 and I've graduated from pes so it's becoming worse"
    },
    {
      "id": "lsq4phh",
      "body": "Im curious.... pes has such a large intake and such mega buildings. How does it accomodate all bois considering 30% r hostelites? Day scholar here."
    },
    {
      "id": "lsrwyfz",
      "body": "Even iam finding it hard to make friends 😢"
    },
    {
      "id": "lssmiq0",
      "body": "Go to Joshua's room and tell your issue! He will fix it!!!"
    },
    {
      "id": "lssml75",
      "body": "In amaatra?"
    },
    {
      "id": "lssw02y",
      "body": "+1 \nThird year \nExcept I am a day scholar"
    },
    {
      "id": "lsswlb0",
      "body": "from what i have seen as a first year living in hostel, people have made groups in accordance to their language where they are comfortable, but its not like u can't enter those groups. Sure, some people from south talk more in their mother tongue and its difficult to make them revert back to english again and again. But u may enter north indian groups(if u know english or understand a little bit of hindi) coz ig they are more open to others. Like I being a part of 3-4 groups myself and 2 groups being like chuddy buddy friends, they are many people in our group who are from different places. Ig u just have to make that one gud friend who can introduce u to others but for that u need to open up and talk to lot of people randomnly. dm me, if any fresher wants to open up and make friends, as the friends u make in college will be the ones that last forever(my father used to say that). btw i m in rr campus hostel IT block."
    },
    {
      "id": "lst95yr",
      "body": "If you want to make new friends you can DM me...I live in a pg near back gate"
    },
    {
      "id": "lwpuhxi",
      "body": "Its better to be alone that be with those who doesn't respect you. Talk to your classmates...the most unlikely person may end up your friends. I was in the same boat but somewhere in my third year I found someone to talk to among my classmates."
    }
  ]
}