{
  "id": "1g8v5hn",
  "title": "My friend got into a club, but not me? How?",
  "content": "It was a tech club. Although I know programming and had better answers than him for the questions, i did not get in and he did. He does not know any programming and copy pasted answers from chatgpt. I have nothing against him but I feel bad because I thought I had the potential. \n\nAs there are less clubs recruiting now, I'm scared I won't get into a tech club. I really want to.",
  "metadata": {
    "author": "curious_burger",
    "url": "https://www.reddit.com/r/PESU/comments/1g8v5hn/my_friend_got_into_a_club_but_not_me_how/",
    "permalink": "/r/PESU/comments/1g8v5hn/my_friend_got_into_a_club_but_not_me_how/",
    "score": 34,
    "created_utc": 1729531060,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lt1gqpf",
      "body": "Which year you are in?"
    },
    {
      "id": "lt1i86x",
      "body": "\nYes, I do agree that the selection process is pretty stupid.\nThe entire point of the clubs is to meet like-minded people and make good friends along the way but by not having a good selection criteria and process, you are demotivating who are definitely qualified for the clubs. The fact that a club even needs a selection process in the first place sounds dumb. What if I'm really passionate about films and am a film geek but I can't apply for the club just because I haven't actually made any short films by myself?"
    },
    {
      "id": "lt1jh8q",
      "body": "I'm very frustrated with the clubs right now too. I decided to apply for the cinematography post in the filmmaking club. Considering that I had already directed two short films I assumed that it would be easy but turns out you have to direct a one minute long campaign/advertisement. The campaign does sound relevant but if you asked me what would be a more relevant selection criteria, I would say that it is short films. Even if I decide to upload my short film in place of the campaign, I have to ensure that the file is under 10 mb, which is impossible.\n\nThe entire point of the clubs is to meet like-minded people and make good friends along the way but by not having a good selection criteria and process, you are demotivating who are definitely qualified for the clubs."
    },
    {
      "id": "lt1np6f",
      "body": "1st"
    },
    {
      "id": "lt1pcyp",
      "body": "Which year do you think students are excited/worried about getting into clubs?"
    },
    {
      "id": "lt4d08m",
      "body": "This is a trailer of things to come. Later it won't be a club, it will happen during placements as well. Life is unfair,luck plays a role, suck it up, move on, grow. \nOne advice to juniors is attend as many club interviews as possible. It will help you sell yourself and take rejections better if things go bad."
    },
    {
      "id": "lt4ezyp",
      "body": "L"
    },
    {
      "id": "lt4o83m",
      "body": "Bro, I'll tell you something, PESU tech clubs are shitt. You're better off without them. Prolly better to join some cultural clubs and have a good time"
    },
    {
      "id": "lt4tb3g",
      "body": "If you're pissed for this, wait for placements"
    },
    {
      "id": "lt4x2ua",
      "body": "sometimes some people luck out into clubs undeservingly, when that happens, typically they get kicked out within their first month in the club.\n\nbut i know some clubs do recruit people even mid-sem\n\nlike alcoding does weekly coding contests from which they regularly recruit the winners"
    },
    {
      "id": "lt4x6c3",
      "body": "agree, most of them are inactive af or do like one event per year\n\na lot of the time the heads of these clubs just flex their rank on a resume and never end up doing anything"
    },
    {
      "id": "lt4y2ni",
      "body": "join nexus, they're having an orientation tomorrow \nat 1.45 in BE Block at 3rd Floor Seminar Hall"
    },
    {
      "id": "lt4zwrz",
      "body": "Youre better off without a club."
    },
    {
      "id": "lt53x2x",
      "body": "I have classes till 4 tomorrow 😭. Any other way I can apply for nexus?"
    },
    {
      "id": "lt5cj9o",
      "body": "Yeah, only the orientation is tomorrow, recruitments will happen thru forms anyway"
    },
    {
      "id": "lt5do4u",
      "body": "Alcoding is dogshit stop marketing all that bs on reddit"
    },
    {
      "id": "lt5ms6w",
      "body": "why? whats wrong with them"
    },
    {
      "id": "lt5qd28",
      "body": "we'll have online recruitments too :)"
    },
    {
      "id": "lt5sq82",
      "body": "Don't be disheartened,it's fine and be ready to face similar situations now on"
    },
    {
      "id": "lt6d71k",
      "body": "Cool then I'll try!"
    },
    {
      "id": "ltgsdt1",
      "body": "i guess they're racist and you're black"
    },
    {
      "id": "ltnhogz",
      "body": "Depends on the recruiters. You can mail said person and ask why. Try again in some other."
    },
    {
      "id": "ltofmrm",
      "body": "Chill dude. I applied for the ML domain in a CS club. Ik some ML despite being non-cs, I even answered their questions correctly. They even took my Github ID to see projects, I had one project in ML. And I still got rejected, simply because my knowledge wasn't as extensive and they felt that learning ML will be 'hard for me', In the group they said they didn't want technical answers and proceeded to ask technical questions where I gave partially technical answers almost to the point. Idk what their agenda was, but I did not get in. Don't break your head, focus on your own projects, they carry more value, and trust me, once u join a club u will be tasked to do all kinds of odd jobs u won't like. Take part in club events, and let them serve you instead of you serving them."
    }
  ]
}