{
  "id": "1g9ez51",
  "title": "The incompetence of professors in this college is astounding.",
  "content": "I've never had a set of professors or teachers who were so carefree. The college's faculty is full of slackers and it's saddening. Neither does this set of people have any dedication to research, nor any towards teaching. For the exorbitant fees PES charges, the faculty is abysmal. It is daylight robbery.\n\nIf you ever loved a field and opted to take a course on it, they will make sure that you hate it. If you, by divine grace, happened to like a course and get a chance to be the TA for it, they will make your lives miserable by overworking you.\n\nThey make changes to the syllabus and add new content, without a clue or without having a single faculty member knowing those concepts. They magically expect the TAs to make slides on it, without them knowing anything. The TAs are not provided any material or resources, for, the professors themselves do not know anything. Not even a useful textbook is provided. Just a bunch of open-ended bullet points that are so vast that they could be a separate field in STEM.\n\nIf the TAs ask for guidance or explanation, the said professors provide nothing. If the TAs ask if they could receive information on what to choose subtopics to choose from each of the vast, open-ended bullet points, they are told that it is their job as TAs to figure it out. So, basically, the syllabus of the courses are not decided by faculty members with decades of experience in their domains, but instead by TAs who know nothing. \n\nThese TAs aren't even Master's or PhD students. They would have just finished the said course in the previous year or two. So, the added syllabus of many courses are being decided upon by a bunch of 20-21 year old's, while the professors, whose jobs are to literally decide upon the syllabus, cannot care any less. \n\nWhy stop there? Why not let them teach, and grade the ISAs and ESAs? Why shouldn't we let those 20-21 year old's do everything? Who needs professors? Let PES University become a Peer-Learning University. /s\n\nAs expected, the syllabus decided by novices will obviously turn out to be mediocre, at best. If the said TAs beg for feedback multiple times, they receive nothing, or surprisingly, positive remarks. Then, months later and when they are about to teach, they realise that the quality is not up to the mark, or they do not have time to teach everything that's on the slides, and decide that things need to change.\n\nThey magically expect the TAs to drop everything going on in their lives, and start all over again. Back to the square one, but no time either. Are the TAs provided guidance now? Nope! If they did, this wouldn't turn out to be PES University, would it? They are provided instructions, evidently from a Generative AI tool, and the professors who try explaining it are very confused too. They do not even know what they want. \n\nThis is nothing short of harassment of TAs, who are suddenly expected to complete a month's load of work in less than a week. This has been the case in many of the courses in PES University. Do not fall for the 'updated syllabus' trap, because honestly, nobody knows what they are doing, and they are not doing a good job either. Never become a TA. You will be nothing but a slave to these nincompoops.\n\nI'm using the flair, \"Pride of PESU\" because we all should be really proud of what is going on in our college.",
  "metadata": {
    "author": "AdventurousTie6777",
    "url": "https://www.reddit.com/r/PESU/comments/1g9ez51/the_incompetence_of_professors_in_this_college_is/",
    "permalink": "/r/PESU/comments/1g9ez51/the_incompetence_of_professors_in_this_college_is/",
    "score": 37,
    "created_utc": 1729593255,
    "flair": "Pride Of PESU",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lt5jfti",
      "body": "fresher here my faculty pretty good"
    },
    {
      "id": "lt5keod",
      "body": "That's the most stable year. Get ready for the rollercoaster."
    },
    {
      "id": "lt5rnlk",
      "body": "Someone is having a bad experience as a TA. Which subject is this btw."
    },
    {
      "id": "lt5saqp",
      "body": "Calling it bad would be an understatement. It's been this way all the time for anything else too. Be it internship credits, research projects, Capstone Project, etc. PESU management is worse than a government office. I can't reveal the course. It's for 3rd Semester students. If you think that I am being absurd in any possible way, I am not. Every single line of the post is true. That's the funniest thing. Even the truth sounds so absurd."
    },
    {
      "id": "lt5tka1",
      "body": "I think I have figured which course it is. \n\nMy TA journey has been chill, I was never asked to make any course content. Just go to lab sessions and clear doubts and evaluate the labs. Thought everyone had it as simple as me."
    },
    {
      "id": "lt5tma9",
      "body": "Wait what the fuck? TAs decide the syllabus ?? \nI was told they had a committee for this stuff of all teachers\nIs this rr or ec"
    },
    {
      "id": "lt5tmxy",
      "body": "Expecting TAs to make course content is honestly criminal."
    },
    {
      "id": "lt5u31f",
      "body": "Well, good for you, I guess."
    },
    {
      "id": "lt5uc5d",
      "body": "Making course content? Fine. Giving them free reign to do whatever the heck they wanted? Horrible. I've spent many nights worrying about the junk I had been putting on the slides. I am pretty sure none of the professors worried even 10% of how much I worried."
    },
    {
      "id": "lt5v22m",
      "body": "25% of an existing course was changed and new content was added. The committee or whatever it is, gave me six bullet points, and they were the chapter titles of a textbook for civil and mechanical engineering. The course was not for mechanical and civil engineering students, and for our department, none of it made any sense. So, I just received six bullet points and nothing else. When I requested the professors for help and guidance, I received nothing. If there really exists a committee of professors, I would really love to have a word with them all."
    },
    {
      "id": "lt5zg5i",
      "body": "Mcse unit 4"
    },
    {
      "id": "lt5zimc",
      "body": "Mcse unit 4"
    },
    {
      "id": "lt5zmed",
      "body": "Nah. Not CS dept."
    },
    {
      "id": "lt601dq",
      "body": "Why was this deleted?"
    },
    {
      "id": "lt6rf6a",
      "body": "bro forgot to thank Beyonce"
    },
    {
      "id": "lt6t1c4",
      "body": "Lmao"
    },
    {
      "id": "lt9s3wy",
      "body": "Why do you think I left? After 4 years, I just couldn't take it anymore."
    }
  ]
}