{
  "id": "1ga1mo0",
  "title": "Is Textbook really required for sem1 9+gpa? Or classnotes & ppt enough?",
  "content": "",
  "metadata": {
    "author": "TheKingBond",
    "url": "https://www.reddit.com/r/PESU/comments/1ga1mo0/is_textbook_really_required_for_sem1_9gpa_or/",
    "permalink": "/r/PESU/comments/1ga1mo0/is_textbook_really_required_for_sem1_9gpa_or/",
    "score": 15,
    "created_utc": 1729656166,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ltah7r2",
      "body": "You require only mechanics text book, if you are in chem cycle"
    },
    {
      "id": "ltaha9q",
      "body": "Yeah Iam in chem"
    },
    {
      "id": "ltatpc2",
      "body": "only ppt is enough for all subject + PESU Notes (9.8 cgpa I have using only this)"
    },
    {
      "id": "ltb5ymr",
      "body": "Wow😲"
    },
    {
      "id": "ltbcgbg",
      "body": "Damm"
    },
    {
      "id": "ltbu2yh",
      "body": "Hey, was wondering what you used to do on a daily basis after college and what you did like a week before tests (ISA and ESA's)\nWhat material did you prioritise/refer?"
    },
    {
      "id": "ltcct8v",
      "body": "Hey, see I will be real with you. Listen to class proper and chill after college everyday! No need to make notes etc, just listen and understand what they are teaching. 1 week before ISA/ESA start the prep and my priority was always Slides. Be really really good with slides, like go through each page in the slides properly and in depth that's it. I have gotten 10 SGPA only using slides!! One more tip - Study for ISA same as ESA. For example for ISA 1 you will have unit 1 and 2 (Study for ISA like ESA like you are preparing for subjective exam). This makes ESA very easy as you have already covered all 4 units and you have to just revise again. Also i like to keep writing notes/Scribbling my notebook when i read slides (like important points helps me to remember things properly)"
    },
    {
      "id": "ltcjk1n",
      "body": "I'll definitely keep that in mind. Thanks for the advice!"
    },
    {
      "id": "ltd2u74",
      "body": "Wow,may I ask what and all related to cs/programming did you learn in your first year?"
    },
    {
      "id": "ltd62w4",
      "body": "so yeah i concentrated more on c and python like mastered these two languages. Other subject just for marks/gpa i studied. I did some web development at home free time (Helped me little)"
    },
    {
      "id": "ltd8upn",
      "body": "Don't forget anything from classnotes and ppt. You can borrow the TB from the library if you need it. Just don't get any grade lower than C and You're fine."
    },
    {
      "id": "ltj6175",
      "body": "What about numericals? What material do we use for them?"
    },
    {
      "id": "ltvq6l7",
      "body": "slides was enough + pesu notes sometimes"
    }
  ]
}