{
  "id": "1gafw2w",
  "title": "PESU rain situation",
  "content": "How bad should rain be for PES to give holiday. Past week I had to swim to college 2 times. I almost drowned on the road and I had to fight against 2 sea serpents to get to college. I felt like Hercules doing the 12 labours with how hard it was to get to college. Only reason I got to college is because I heard someone play KSI's new song and I got the willpower to go and turn that off",
  "metadata": {
    "author": "IITBanglorian69420",
    "url": "https://www.reddit.com/r/PESU/comments/1gafw2w/pesu_rain_situation/",
    "permalink": "/r/PESU/comments/1gafw2w/pesu_rain_situation/",
    "score": 153,
    "created_utc": 1729703549,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ltdicqf",
      "body": "KSI’s new song reminded me there are worse things than drowning."
    },
    {
      "id": "ltdihqh",
      "body": "> How bad should rain be for PES to give holiday\n\nGiven that a pandemic couldn't stop PES from holding offline ISA/ESA in person at campus, I don't think water poses a big enough threat to declare a holiday"
    },
    {
      "id": "ltdkcb4",
      "body": "Finally I can say to my kids that I used to cross river to reach my clg"
    },
    {
      "id": "ltdl8oh",
      "body": "![gif](giphy|jbYGkxopDVdCdgb3A6|downsized)\n\nPain. Will bombs falling from sky make them declare holiday"
    },
    {
      "id": "ltdm4vg",
      "body": "Maybe add napalm just in case they still don't budge"
    },
    {
      "id": "ltdz6wh",
      "body": "they wont give you a holiday even if your fighting for your last breath my son. they MIGHT give a day off if you died or smtg and maybe give you a heroic goodbye for battling the odds to attend classes."
    },
    {
      "id": "lte1dwn",
      "body": "This the shit ima tell my kids wen i grow up"
    },
    {
      "id": "ltghzqk",
      "body": "Forget water.. there are literally people falling from the sky n We wrote exams in the same building the next day"
    },
    {
      "id": "ltgqwzq",
      "body": "W post. made me crack up about this god awful college for once."
    },
    {
      "id": "lthbenh",
      "body": "Apocalypse that wipes out the world. Otherwise you're gonna lose that attendance 🚫😔"
    },
    {
      "id": "lthf585",
      "body": "Lol those days.. \n\nOur batch thought of calling some student union n all, LOL\nDore n his son didn't give a Fk, they didn't even conduct one single exam online..."
    },
    {
      "id": "lthkseg",
      "body": "they don't care if you drown in college bro"
    },
    {
      "id": "lti0rwm",
      "body": "Someone cooked here"
    },
    {
      "id": "ltk6p4x",
      "body": "None."
    },
    {
      "id": "ltochun",
      "body": "Dore’s in the thick of it and everybody knows 🫡"
    },
    {
      "id": "ltocszd",
      "body": "From the\n\n![gif](giphy|l41lOKyKOS89YyJfq)"
    },
    {
      "id": "ltocvj9",
      "body": "To the\n\n![gif](giphy|YnMA26DHTiOw6J168n|downsized)"
    },
    {
      "id": "ltocwvt",
      "body": "To the\n\n![gif](giphy|3itqigp67lGZdhaBmR|downsized)"
    },
    {
      "id": "ltocy5q",
      "body": "To the\n\n![gif](giphy|3o7btXkbsV26U95Uly|downsized)"
    },
    {
      "id": "lwptqnk",
      "body": "Rain won't cut it for PES. I guess some natural disaster that affects the building itself, but I bet they'll move everything online if so anyway"
    }
  ]
}