{
  "id": "1gg97ye",
  "title": "laptop vs desktop",
  "content": "The new m4 mac mini costs 50k and around 65k with montior and other peripherals......  \nI already have a laptop with i3 which i bought 3 years ago, it runs smoothly, can handle all the apps i throw at it...  \n  \nShould i look to get a new laptop with core ultra 5 which would also cost around 65-70k or get a mac mini setup(which should perform way better than any laptop in the same price range) at home and get the laptop to college for classes and other requirements?  \nI am in first sem cse btw, so i have very little idea about the softwares that we are gonna use.",
  "metadata": {
    "author": "Bitter_Front226",
    "url": "https://www.reddit.com/r/PESU/comments/1gg97ye/laptop_vs_desktop/",
    "permalink": "/r/PESU/comments/1gg97ye/laptop_vs_desktop/",
    "score": 11,
    "created_utc": 1730361130,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lunx5ng",
      "body": "As a student, I don’t think you should lock yourself to a desktop just yet. \nAlso if your current laptop is working just fine for your use cases, hold on to it.\nAs the year progresses and you get more of an idea of what you’ll be doing and needing, you could revisit this discussion."
    },
    {
      "id": "luo021l",
      "body": "Until 2nd year you would just do basic programming. So your old laptop should do good.\n\nPro tip- have an old hardware? Add Linux dual boot."
    },
    {
      "id": "luorfmy",
      "body": "The new Mac mini is a great investment, you should definitely consider picking it up if you need a new system, your current laptop should be fine for whatever first and second year throw at you."
    },
    {
      "id": "luoru5r",
      "body": "Okay thankss"
    },
    {
      "id": "luos5j2",
      "body": "righttt...thankss...since ur in 4th year, I wanna ask u this...\n1)is there any heavy software that is to be used in college during classes which demands high specs.\n2)and abt the capstone, does it have to be dealt with in the college itself? Just to get an idea of the process."
    },
    {
      "id": "luos6wa",
      "body": "Okayy, thankss"
    },
    {
      "id": "luospba",
      "body": "1) as of 1st year nothing is required. Maybe in higher sems there might be software that demands performance.\n\n2) yes within college itself, will fetch you marks and credits."
    },
    {
      "id": "lup5v9j",
      "body": "alrightt....thankss"
    },
    {
      "id": "lupol5h",
      "body": "I'd suggest you to get a better laptop mate cuz in Computer Networks labs (4th sem) you will be asked to do assignments in class manier times where the assignment involves working with a VM or multiple VMs.. For that you will atleast need a i5 system with 8gb ram or 16gb ram (recommended).\nIt will help you with your ML assignments too which sometimes you have to submit during lab hours.\nBetter to go with a laptop with better specs imho."
    },
    {
      "id": "luqkb6j",
      "body": "Ohhhh ...okayyy...thanks mann"
    },
    {
      "id": "luwmo3z",
      "body": "No problem"
    },
    {
      "id": "luwmvr4",
      "body": "No problem"
    }
  ]
}