{
  "id": "1gh5apc",
  "title": "Study help",
  "content": "Sorry that I am asking this question again \nBut can someone give a roadmap of all subjects to do so that I feel confident attending isa1",
  "metadata": {
    "author": "CalmManager9070",
    "url": "https://www.reddit.com/r/PESU/comments/1gh5apc/study_help/",
    "permalink": "/r/PESU/comments/1gh5apc/study_help/",
    "score": 8,
    "created_utc": 1730467449,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "luusy5p",
      "body": "Are you in physics or chemistry cycle"
    },
    {
      "id": "luuutwc",
      "body": "Chem"
    },
    {
      "id": "luuwoa8",
      "body": "honestly for everything slides are more than enough.. for math make sure you do the classwork problems as questions came from there for us"
    },
    {
      "id": "luuwtoo",
      "body": "Math- practice classwork questions. When you're thorough with those, move on to assignments/qb. You need to be quick at solving because they always make the paper long and many people struggle to finish it.\n\nPython- 4 markers will generally be writing codes. Read slides and notes for theory.\n\nChem- everything comes directly fron slides. Just read those and go. You'll definitely get at least 2 numerical problems.\n\nMechanics- 4 markers come copy pasted from the textbook. They don't even change values. Mcqs is fully theory.\n\nEpd- I don't remember sorry💀. Everything was from slides only i think."
    },
    {
      "id": "luv0ju5",
      "body": "Epd they have not given us slides \nWt to do \nAnd for mech \nDo I need to solve every q from the tb"
    },
    {
      "id": "luv0zy4",
      "body": ">Epd they have not given us slides\n\nClassic pes\n\n>mech Do I need to solve every q from the tb\n\nNo. I think you can do the ones that are in the slides (if they've given any). But if you want just look at the textbook and solve the questions that look easy. They usually ask easy numericals in isa and the harder ones in esa."
    },
    {
      "id": "luv1a1b",
      "body": "Wt can I do for epd"
    },
    {
      "id": "luv1gjd",
      "body": "What textbook?"
    },
    {
      "id": "luv1lac",
      "body": "Read your class notes. Apparently they’re more than enough"
    },
    {
      "id": "luvfv9c",
      "body": "Can you help me with phy cycle?🫠"
    },
    {
      "id": "luvh4xz",
      "body": "i dont remember the name. you can ask in your whatsapp groups."
    },
    {
      "id": "luvhnqd",
      "body": "mechanical-mug up everything from slides. numericals will come.\n\n  \nelectrical- classwork problems is enough\n\n  \nphysics-read faisal sir's slides. learn all the formulas for numericals and try to understand concepts because they often ask conceputal questions in theory"
    },
    {
      "id": "luvi257",
      "body": "Okayy tqsm sirr🙇"
    },
    {
      "id": "luwb5pn",
      "body": "I'm not a sir but you're welcome 😂"
    },
    {
      "id": "lvcqs1p",
      "body": "4th year here - my year had a lot of help by doing a seniors ppt and notes and exam papers.\n\nhere is the link we used -https://www.google.com/url?sa=t&source=web&rct=j&opi=89978449&url=https://vibhamasti.github.io/notes.html&ved=2ahUKEwjd29jo9MKJAxV\\_yzgGHagpI78QFnoECAoQAQ&sqi=2&usg=AOvVaw3qM\\_9xs\\_I649jpXwpKZhfH"
    },
    {
      "id": "lxfaok0",
      "body": "Can you share the link of the groups?"
    }
  ]
}