{
  "id": "1ghvekl",
  "title": "I made an tool that helps you practice interviews and customize resume for any job in just 1 click - Does this help? 🎓",
  "content": "I'm building something for College Students and really need your honest feedback - am I actually solving real problems we face?\n\nSo here's what's keeping me up at night - when I was hunting for my first job, I kept hitting these walls:\n\nKnew my tech stuff but struggled badly to express it in interviews (the nervousness is real!)\n\nHad to rebuild my resume again and again for different roles (took 1-2 hours each time!)\n\nWasted hours on job sites showing \"fresher friendly\" jobs that actually needed 2+ years experience\n\nI'm trying to fix these headaches with [CareerGenie ](https://www.careergenie.in/)where:\n\n**Conversational Interviewer:**\n\n* There's a voice-based AI interviewer you can practice with 24/7 - it's like talking to a real person who:\n* Makes you comfortable first (no robot vibes!)\n* Gives feedback on your confidence and tone\n* Analyzes your technical answers\n* Shows exactly where to improve\n\n**For resumes:**\n\n* Build ATS-friendly resumes easily (just fill in your info, we handle the formatting)\n* Best part? If you apply somewhere, we can align your general resume to that specific job in just 30 seconds!\n* And yes, you tell us your preferences, and our AI shows jobs you ACTUALLY qualify for (no more fake \"fresher\" listings!)\n\nBut here's what keeps bothering me:\n\nWould you actually use an AI interviewer to practice? (I made it voice-based because who likes typing during interviews!)\n\nIs instant resume customization something you need?\n\nWhat else makes you nervous about job hunting?\n\nWe've got about 4,200 jobs listed already, but I really want to know - am I missing something that would help you nail those interviews?\n\nWould mean a lot to hear your thoughts! 🎓\n\n(P.S. If you want to check it out, it's at [CareerGenie](https://www.careergenie.in/) \\- but more than that, I want to know if I'm building something truly useful for us students)",
  "metadata": {
    "author": "Forward-Moment-9251",
    "url": "https://www.reddit.com/r/PESU/comments/1ghvekl/i_made_an_tool_that_helps_you_practice_interviews/",
    "permalink": "/r/PESU/comments/1ghvekl/i_made_an_tool_that_helps_you_practice_interviews/",
    "score": 9,
    "created_utc": 1730550831,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lv0da66",
      "body": "Sounds interesting. Will try this."
    },
    {
      "id": "lv0f9mw",
      "body": "Sure thnx and if possible please share feedback so that i can improve it :)"
    },
    {
      "id": "lv0fgjp",
      "body": "Sure👍🏼"
    },
    {
      "id": "lv0kkij",
      "body": "This is amazing !! Really good \nYou surely can pitch this as a top quality product \n\nAlso which sem are u in ...RR or EC ?"
    }
  ]
}