{
  "id": "1gjdcjx",
  "title": "Thoughts on cancellation of PESSAT and PES using JEEM instead?",
  "content": "",
  "metadata": {
    "author": "Candidate_Financial",
    "url": "https://www.reddit.com/r/PESU/comments/1gjdcjx/thoughts_on_cancellation_of_pessat_and_pes_using/",
    "permalink": "/r/PESU/comments/1gjdcjx/thoughts_on_cancellation_of_pessat_and_pes_using/",
    "score": 18,
    "created_utc": 1730724296,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lvc9laz",
      "body": "Considering the deplorable quality of PESSAT, admissions through JEE MAINS is a good decision only"
    },
    {
      "id": "lvccjwb",
      "body": "Actual op decision by pes tbh , the quality of students who now come to pes would be wayy better atleast ."
    },
    {
      "id": "lvccrnm",
      "body": "Best decision"
    },
    {
      "id": "lvcdpir",
      "body": "It's not a decision by pes btw government has ordered to terminate all uni level exams iirc. Why will pes kill their cashcow xD"
    },
    {
      "id": "lvce3am",
      "body": "I'd like to know more about this but idk what exactly to google (I heard about the same from a friend). When I try searching I get some ridiculous results. Can you lmk when exactly this was passed / details about it?"
    },
    {
      "id": "lvcfjw4",
      "body": "https://www.google.com/amp/s/www.deccanherald.com/amp/story/india%252Fkarnataka%252Fno-separate-entrance-exams-at-pvt-universities-from-next-year-3198641\n\nNote that it says it's an advisory but basically every Karnataka uni has decided to scrap their entrance exams in favour of comedk , jee and kcet."
    },
    {
      "id": "lvcfl6g",
      "body": "It looks like you shared an AMP link. These should load faster, but AMP is controversial because of [concerns over privacy and the Open Web](https://www.reddit.com/r/AmputatorBot/comments/ehrq3z/why_did_i_build_amputatorbot). Fully cached AMP pages (like the one you shared), are [especially problematic](https://www.reddit.com/r/AmputatorBot/comments/ehrq3z/why_did_i_build_amputatorbot).\n\nMaybe check out **the canonical page** instead: **[https://www.deccanherald.com//india/karnataka/no-separate-entrance-exams-at-pvt-universities-from-next-year-3198641](https://www.deccanherald.com//india/karnataka/no-separate-entrance-exams-at-pvt-universities-from-next-year-3198641)**\n\n*****\n\n ^(I'm a bot | )[^(Why & About)](https://www.reddit.com/r/AmputatorBot/comments/ehrq3z/why_did_i_build_amputatorbot)^( | )[^(Summon: u/AmputatorBot)](https://www.reddit.com/r/AmputatorBot/comments/cchly3/you_can_now_summon_amputatorbot/)"
    },
    {
      "id": "lvcgw4c",
      "body": "I don't necessarily think the quality of students will change\n\nPESU will maintain its current position of being among the top 3 in Blr, with low recognition in North India / most states outside KA. So the students going into PES will be (mainly) those from Karnataka with JEE scores too low to go to IIT/IIIT/NIT, BITSAT scores too low for BITS.\n\nAdditionally given the fee difference, these students will have second thoughts joining PES through JEE unless their CET/COMEDK's are low and they cannot get RV/PES/BMS through this.\n\nSo the students who'll end up joining PES through JEEM (acc to me) will be the exact same as those joining through PESSAT. ie the kids whose options are Karnataka Unis only + have lower CET scores"
    },
    {
      "id": "lvcgx84",
      "body": "Thanks"
    },
    {
      "id": "lvchl4p",
      "body": "I won't get political but the minister in question is not who you'd call the most honest of men. I highly doubt the sole reason for PESSAT's cancellation is this bc as you said - PESSAT was their cashcow in more ways than just the fees. If they wanted to keep the exam, a little money in the right direction I feel would've done the trick."
    },
    {
      "id": "lvci5jc",
      "body": "My logic is since they are starting to take jee kids they might so by goin on a advertisement sphree like how VIT Nad LPU foes to attract north kids ."
    },
    {
      "id": "lvcj9d0",
      "body": "deffo got to do something with the fact that everyone who jumped was mostly pessat too"
    },
    {
      "id": "lvck38o",
      "body": "W decesion. They should trash Comedk and use jee mains for other colleges as well."
    },
    {
      "id": "lvck52s",
      "body": "Perhaps in the long run this would work. But blatant advertisements won't work. VIT is quickly losing popularity due to increased population, decreased placements and increase in suixxides. PES has also been falling off the wagon in all of these 3 aspects and the prof quality has significantly reduced. Unless they pickup on these aspects + more (curriculum design, evaluation structuring etc) they'll looked over anywhere. They'll have nothing to offer"
    },
    {
      "id": "lvcvmle",
      "body": "Imo Comedk intake would increase its reputation in north "
    },
    {
      "id": "lvdktp1",
      "body": "This year, the gap between first and second round counseling was big because of kcet counseling, many people had left their seats in this gap. So that can also be the reason why they stopped pessat\n\nAlso this year 26k ppl wrote pessat (as said on counseling day). There are lakhs of people writing jee, so there is more chance of non kcet/comedk seats filling up."
    },
    {
      "id": "lve65tm",
      "body": "Bro 😭"
    },
    {
      "id": "lvg9nt4",
      "body": "PES Is not accepting ComedK for the next year it's only kcet or jee"
    },
    {
      "id": "lvhvh8v",
      "body": "They are still charging the same fees for jee so how does it matter, it's not like they are gonna be part of jossa, they just take ppls percentile"
    },
    {
      "id": "lyjnxlm",
      "body": "But pes university will also accept comedk marks in 2025?"
    },
    {
      "id": "lypee2n",
      "body": "But in Google it is showing they will accept comedk marks"
    },
    {
      "id": "lypmji7",
      "body": "They changed it this year . I applied to pes for the next year 25-26 in the beginning they took money for consideration of ComedK but later refunded it so they only accept jee mains or kcet marks "
    },
    {
      "id": "lyqc1zr",
      "body": "No"
    }
  ]
}