{
  "id": "1gkrfvr",
  "title": "A Thread of worst professors to get LoR from.",
  "content": " The goal is to help you identify professors who may be challenging to approach when requesting a LoR, so you can avoid potential red flags while choosing for capstone project.\nThis post is for those who are seeking Letters of Recommendation (LoRs) from professors.\n\nI start with mine .\n\nUse same format as below and comment your experience and add to the thread \n\nDr Jayashree R \nCSE AIML chairperson \nDate of LoR request: Oct-Nov 2023\nTotal LoRs given : 2 college applications only \nMy comment : 1.5year of capstone for just 2 college applications is utterly unprofessional ",
  "metadata": {
    "author": "mahim_dashora",
    "url": "https://www.reddit.com/r/PESU/comments/1gkrfvr/a_thread_of_worst_professors_to_get_lor_from/",
    "permalink": "/r/PESU/comments/1gkrfvr/a_thread_of_worst_professors_to_get_lor_from/",
    "score": 89,
    "created_utc": 1730871972,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lvo5p3c",
      "body": "Did she outright say that she will not give more LoRs?"
    },
    {
      "id": "lvogozu",
      "body": "Dr Sandesh Jayanth, HOD, EC Campus, was my capstone mentor. He is very busy and will take time to submit LOR. Approach at least 1 month earlier than deadline. Get everything pre-printed, do not wait for them to read it, they wont. Just type the LOR (max 500 words, TNR with 12 font, otherwise wont fit in letterhead), get the letterhead from Sandesh Sir, print it, get it signed, stamped, and scanned, at least 1-1.5 months prior. And very limited number of LORs (I barely got 2 or 3)\n\n  \nAlso letterhead in EC Campus IS A MUST. none of the teachers (mine were Arti Maam and Sandesh Sir) will sign any random paper. I got heavily reprimanded for the same. So please make sure to get letterheads from Sandesh Sir and print it."
    },
    {
      "id": "lvogs2k",
      "body": "I believe theres instances where she has bailed out. I know a person who promised would get 4 but ended up getting only 2. So have backup teachers in that case, and get them all scanned at least before October"
    },
    {
      "id": "lvp55fi",
      "body": "Yes , strictly"
    },
    {
      "id": "lvq0kjm",
      "body": "I love how theres a useful post made after a series of brainrot from juniors"
    }
  ]
}