{
  "id": "1glhq2u",
  "title": "Can I get the degree any sooner than 4yrs? Just wanna get out of this shit.",
  "content": "",
  "metadata": {
    "author": "TheKingBond",
    "url": "https://www.reddit.com/r/PESU/comments/1glhq2u/can_i_get_the_degree_any_sooner_than_4yrs_just/",
    "permalink": "/r/PESU/comments/1glhq2u/can_i_get_the_degree_any_sooner_than_4yrs_just/",
    "score": 57,
    "created_utc": 1730951696,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lvudg20",
      "body": "When you find a way, tell us."
    },
    {
      "id": "lvudgso",
      "body": "Jump off"
    },
    {
      "id": "lvue1io",
      "body": "There's no concept of early graduation at PES. There is a fixed number of credits you must take up every semester, including your final semester."
    },
    {
      "id": "lvug4it",
      "body": "spoken like a true Pesticide. I'm proud of you."
    },
    {
      "id": "lvuhxhs",
      "body": "You can't"
    },
    {
      "id": "lvui5g8",
      "body": "Bro's single handedly representing everyone of us"
    },
    {
      "id": "lvukz4r",
      "body": "Why buddy what's the issue with PES now? I keep hearing this from multiple people. I graduated four years back and things were not as bad as this."
    },
    {
      "id": "lvulv38",
      "body": "Okay I'll be honest.See the thing is our generation has a really poor mental health compared to our seniors of 4-5 years and everything which u thought moderate is too hectic  to us,we r not that mentally strong as u guys were, reason? I honestly don't know.\n\nBut I'm just generalizing,not everyone is the same. And yeah it did get a lil hectic too, changing syllabus,shitty prof, difficult papers(idk how it was during ur time,but in some subs 300+ ppl are failing), rigorous evaluation policies i.e too much breaking down and distribution of marks to do many projects,case studies etc etc.\n\nCapstone is now from 5th sem itself,and job market uk better than me,I'm just a sophomore.\n\nJust wrote this after listening to a shitty class,ig peeps will add more points below this"
    },
    {
      "id": "lvunehf",
      "body": "Ah okay, I can understand. The syllabus gets too hectic sometimes. I remember I had been wanting to join quite a few clubs to explore my passions but then ended up not joining any one of them because you know the syllabus.\n\nWhich branch are you in?"
    },
    {
      "id": "lvunz7a",
      "body": "The one with more sheeps"
    },
    {
      "id": "lvup0en",
      "body": "Welcome to PES"
    },
    {
      "id": "lvur57j",
      "body": "Just remove 75% clause and I'm good."
    },
    {
      "id": "lvuxoo8",
      "body": "man you;ve been here barely 2 months and you're already crying. it gets progressively worse so be prepared."
    },
    {
      "id": "lvuxq8x",
      "body": "Okay, even I was from same branch only thing is it had less sheeps than it is now lol. \n\nYou know I used to be topper of my class till class 12. Aced CET as well. Got into PES. And few semesters in, I am not even top 100 of my batch in cgpa 😂 never managed to get one mrd/cnr scholarship as well. Lot of competition everywhere. I really felt lost and started doubting myself. \n\nThankfully I had few really really good seniors who gave me right suggestions and inputs. I will be really grateful for them. That came really handy for me throughout engineering.\n\nAt the end, had a decent GPA and got into a great T1 company. Now when I look back, definitely I can say that things are bit stressful sometimes in PES compared to other colleges but it is all WORTH it. Trust me, you are going to resonate to this after few years :)"
    },
    {
      "id": "lvuxua0",
      "body": "Lmao, consider yourself lucky. It used to be 85."
    },
    {
      "id": "lvuy9uh",
      "body": "😭"
    },
    {
      "id": "lvuyr3q",
      "body": "Hmm, what do you mean by \"poor mental health\"? It's the first time I'm reading about this argument and I genuinely want to know on what basis you're claiming this, especially given the fact that the age gap isn't much (as you mentioned - at most 4 years) so everyone went through the same COVID phase. \n\nWe had similar (if not higher - although I'd argue that you guys definitely have quite a few quality of life benefits such as reduced attendance criteria and prep resources) workloads and yes we complained as well but it honestly feels like with each incoming batch there's just an exponential increase in hate for the profs and uni, complaints about life, workload and stress, and ofc the general brainrot that fills the batch - but overall, there's just a pretty big rise in how much people dislike everything about this place and the constant complaints about everything. I've seen 5 batches of juniors join college since my first year and I've never felt so strongly against a batch. Is your generation really getting dumber or is PES' intake really going down in quality?"
    },
    {
      "id": "lvuyt6l",
      "body": "The 1st two paragraphs- I'm literally You rn"
    },
    {
      "id": "lvuzpk0",
      "body": "steal the template and pull catch me if you can like dicaprio did in the movie"
    },
    {
      "id": "lvv12xq",
      "body": "> Hmm, what do you mean by \"poor mental health\"? It's the first time I'm reading about this argument and I genuinely want to know on what basis you're claiming this, especially given the fact that the age gap isn't much (as you mentioned - at most 4 years) so everyone went through the same COVID phase. \n\nUmm so Ik so many ppl who are 4+ years older than me and they r going through dog shit and still ain't that worried,I mean they are but still they stand strong,here we r ranting about some shitty assignments while they are battling through so many things/responsibilities.Like yeah as u told we have a problem with everything,we do some bare minimum shit and tag it as 'efforts I put to do this all is insane'.\n\n>We had similar (if not higher - although I'd argue that you guys definitely have quite a few quality of life benefits such as reduced attendance criteria and prep resources)\n\nAgree,the reason why we feel 75 percent as hectic too is cause classes mean nothing to most of us anymore,we r just attending for attendance,no good teaching prof,no prof is interested in having a funny-interactive sessions.They just come with a lame face with lack of interest, complete their things and just go(Not everyone,but most)\n\n>I've seen 5 batches of juniors join college since my first year and I've never felt so strongly against a batch\n\nI agree.I thought my batch was the worst but after seeing juniors I feel proud abt my batch ('27)\n\n>Is your generation really getting dumber or is PES' intake really going down in quality?\n\nPpl are actually getting dumber and the lack of immaturity is insane,i literally sometimes feel I'm in a high school.\nI hope we get some decent juniors thru mains from next year"
    },
    {
      "id": "lvv1u9g",
      "body": "Then time to get 3rd para done. Go search for nice seniors XD"
    },
    {
      "id": "lvv1zsh",
      "body": "Ig I found one,tho graduate, atleast I'll get some good advice from you. Can I dm?"
    },
    {
      "id": "lvv2hep",
      "body": "Sure."
    },
    {
      "id": "lvv6o6d",
      "body": "Us NGL"
    },
    {
      "id": "lvvow6l",
      "body": "Shoulda taken bcom or smthng, they have 3 year exit option. "
    },
    {
      "id": "lvvrsn6",
      "body": "Bruh"
    },
    {
      "id": "lvvusmf",
      "body": "Another reason why this sub is turning bad"
    },
    {
      "id": "lvvyux8",
      "body": "Your absolutely right, coming from an average student (13k cet rank) I got 8.5cgpa in first year, the subjects especially in first year aren’t all that hard provided you put in consistent effort, not even 3-4 hours a day but even just an hour a day and more during the weekend and your good. You cannot expect to get 12+lpa packages just because you joined this college, no shit its going to be hard. it’s kinda shocking how bad the new batch is, I’ve stopped coming to this subReddit to save myself the brain cells from reading the shit they keep posting"
    },
    {
      "id": "lvw4r0r",
      "body": "Congratulations you are matured"
    },
    {
      "id": "lvw57ef",
      "body": "F U CK YOU FOR SAYING THAT AND FUCK EVERYONE WHO LIKED YOU COMMENT."
    },
    {
      "id": "lvwaa4a",
      "body": "85% minimum attendance, five ISAs back-to-back, and a 1.5-week ESA sprint to top it off 💀. That torture grew a thick skin."
    },
    {
      "id": "lvwdqgx",
      "body": "I would literally pay to see this current batch of freshmen go through that time"
    },
    {
      "id": "lvweozm",
      "body": "I guess procrastination is at an all time high for your generation? I'd also say there's also a lot of distraction with the digital takeover in recent years which adds to it. For my batch at least, we all graduated both 10th and 12th grade without depending on digital notes/slides etc so our first instinct was still the book when we joined college as well - also we didn't have anything else so we didn't have a choice. IMO while digital media is great, always having to depend on a smart device also makes you more prone to distractions especially if all those apps are a tap away.\n\nI agree with the rest of your points - profs aren't that great anymore and the current batches are just iPad kids who don't know how to read a textbook and only survive on YouTube to learn."
    },
    {
      "id": "lvww1gv",
      "body": "The issue is that people don't want to put in efforts to study and do well and think college will just hand them a job at the end of 4 years - they think they're still in school"
    },
    {
      "id": "lvxuvo0",
      "body": "Pesticide 🤣🤣"
    },
    {
      "id": "lvy11g7",
      "body": "tell ur not from pes without telling ur not from pes"
    },
    {
      "id": "lvy13wo",
      "body": "Lets be honest, 9th and 10th was online for us. We started of with online classes just at the bleak age of 14, and due to which when we entered 11th grade, attending offline classes was taking time to get used to. The EdTech wave hit us hard and most of use resorted to shri shri alakh pandey. And using online platforms meant spoon feeeding and we could pause, rewind and watch at our comfort."
    },
    {
      "id": "lvybvts",
      "body": "Go sleep da aayush"
    },
    {
      "id": "ly4q9p9",
      "body": "No but I wish :("
    }
  ]
}