{
  "id": "1gly36i",
  "title": "Mentoring",
  "content": "ok so my friend had her \"mentoring\" session today.During that her mentoring,her mentor goes on to ask her about her previous sems gpa.\n\nHere the thing is my friend had a low cgpa of 7.5 in first three sems..4th sem she studied very hard and was able to level it up considerably high.4th sem she ended up getting 9.3 ish. Now ,this mentor gets pretty shocked and the next thing she asks is did she use any \"unethical\" methods.....like srsly wtf....how is she able to straight away come to THIS conclusion of all instead of encouraging her. Ik this friend of mine personally from school...she used to study very well but after coming to pes she couldn't cope up with the difficulty and hectic schedules...I mean this is basically the experience of an average pes student. My friend tells her she studied very hard and attended all the classes but still the teacher continued to look at her suspiciously. \n\nWhy are the teachers here like this isnt this the self proclaimed one of best colleges in the state?",
  "metadata": {
    "author": "AlternativeGood9237",
    "url": "https://www.reddit.com/r/PESU/comments/1gly36i/mentoring/",
    "permalink": "/r/PESU/comments/1gly36i/mentoring/",
    "score": 67,
    "created_utc": 1731005917,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lw0e2nk",
      "body": "I don't think your friend needs to really bother much about this. Let anyone look at her with suspicion or doubt, if she has really worked hard, all these opinions don't matter. Not only pes its a part of life."
    },
    {
      "id": "lw0vxgd",
      "body": "\"Self proclaimed top college of the state \" Is itself the answer"
    },
    {
      "id": "lw0ze7c",
      "body": "Yea she knows that...but the irony here is these teachers themselves read from the slides and teach but judge others of cheating without solid proof"
    },
    {
      "id": "lw1987u",
      "body": "She's doing so well that teachers think she's cheating lol. That should be something to be proud of imo. Tell her to score really high this sem too as a nice fuck you to the professor"
    },
    {
      "id": "lw24h0x",
      "body": "Best compliment in online fps games too, being called a hacker for your raw skill and gamesense"
    },
    {
      "id": "lw24h8q",
      "body": "Best compliment in online fps games too, being called a hacker for your raw skill and gamesense"
    },
    {
      "id": "lw2s1h0",
      "body": "IIT Bangalore for a reason"
    },
    {
      "id": "lw3cgzk",
      "body": "bangalore doesn't have IIT becoz of PES university"
    }
  ]
}