{
  "id": "1gmogcs",
  "title": "CIE attendance(again)",
  "content": "Ik someone has already posted about this before but no one has answered whether we will be able to write ESA if attendance is below 75%, its a 2 credit special topic course\n",
  "metadata": {
    "author": "Icespixbot",
    "url": "https://www.reddit.com/r/PESU/comments/1gmogcs/cie_attendanceagain/",
    "permalink": "/r/PESU/comments/1gmogcs/cie_attendanceagain/",
    "score": 9,
    "created_utc": 1731088043,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lw4hwhd",
      "body": "Attendance policy is the same for every course - the number of credits is irrelevant. \n\nIf you don't have enough attendance by the end of the semester, either they'll make you attend extra classes to compensate (note this only applies if your attendance *can* be brought up to ~75%), or they'll basically not let you write the ESA and it'll be a backlog. Sometimes a bit of convincing and pleading *might* get them to be a little less rigid and let you write the ESA but usually it's a backlog."
    },
    {
      "id": "lw4iv2j",
      "body": "I have 70% (7/10), will it be extra classes?"
    },
    {
      "id": "lw4jc3g",
      "body": "This is true for other subjects, but for special topic as observed in 1st year many people who had less than 75% attendance were able to write the exam(constitution and evs)"
    },
    {
      "id": "lw4kk3r",
      "body": "As I said - that's what usually happens. There are always exceptions."
    },
    {
      "id": "lw7p0h7",
      "body": "The law department students were not able to attend even one class due to some technical error , even our dean was aware about it and none of us have attended even one class out of the 4 taken."
    },
    {
      "id": "lw9f1tj",
      "body": "Last year, those who had <60% in special topics (cie wasn't compulsory then) had to submit an affidavit afaik"
    }
  ]
}