{
  "id": "1gnzjkx",
  "title": "Just how cooked am I?",
  "content": "ISA's begin in a week and I've barely started studying 💀 , am i cooked?",
  "metadata": {
    "author": "Due-Reading-5198",
    "url": "https://www.reddit.com/r/PESU/comments/1gnzjkx/just_how_cooked_am_i/",
    "permalink": "/r/PESU/comments/1gnzjkx/just_how_cooked_am_i/",
    "score": 7,
    "created_utc": 1731241538,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lwehxtt",
      "body": "I didn’t even start"
    },
    {
      "id": "lwei733",
      "body": "Why can't you kids just sit down and start studying instead of repeatedly flooding this subreddit with the same question every few hours?"
    },
    {
      "id": "lwei7u5",
      "body": "dw , lets start studying from now , like start grinding and get like an 8.5 🙏"
    },
    {
      "id": "lweilry",
      "body": "Your \nbaked.\nbroiled.\nburnt.\nfired.\nRoasted.\nSteamed.\nSmoked.\nDehydrated.\nRehydrated.\nSalt-baked.\nSkewered.\nBlended.\nBut on a serious note, what do you think will happen? Might be the stupidest question I’ve seen asked on this sub Reddit, put the phone down and start studying, first two sem are crucial and easiest to get a good cgpa in"
    },
    {
      "id": "lwelvp7",
      "body": "*you’re"
    },
    {
      "id": "lwepq4l",
      "body": "Aah good ol' days"
    },
    {
      "id": "lweqhet",
      "body": "Stfu and start studying"
    },
    {
      "id": "lwetmg3",
      "body": "Genuinely feels like this generation has forgotten how to study for a test"
    },
    {
      "id": "lwey5pr",
      "body": "Maybe instead of crying and spamming this sub every 30 seconds with the same question, you guys should better focus on what needs to be done."
    },
    {
      "id": "lweyz39",
      "body": "bruh instead of bitching here in reddit , you know you can do a thing right..... start studying & stop spamming the same shit on reddit , i swear this sub is going downhill with these shitty repetitive questions , there needs to be better moderation man , ask some genuine questions ffs."
    },
    {
      "id": "lwf2rkb",
      "body": "Just bunk ISAs at this point you're soo cooked (/j you still have a fair chance but START STUDYING)"
    },
    {
      "id": "lwf3dux",
      "body": "i still remember i would not have opened the book till prev night but still we never complained like this lol"
    },
    {
      "id": "lwf3w10",
      "body": "Exactly, I'll admit I don't study as much as I'm supposed to but at least I don't come here crying for validation."
    },
    {
      "id": "lwjir2g",
      "body": "*thou art"
    },
    {
      "id": "lwouh4h",
      "body": "Skill Issue, most people do it 1 day before and get good marks"
    },
    {
      "id": "lx2lpxf",
      "body": "Nah there are worse this isn't the stupidest"
    }
  ]
}