{
  "id": "1goequo",
  "title": "RR campus kannada koota concert ",
  "content": "Possibly a good event ruined by shitty management.. spent more time standing in line (4+ hours)than the actual event and once entered all they did was soundcheck and dragging anchoring.. concert had the almost a dead beat audience for the most part initially cause everyone had almost lost interest due to delay.. most including me left cause we travelled from so far (EC) .. Concert felt like a single along than a fun show.. honestly 50Rs event felt more entertaining than this (EC campus)..",
  "metadata": {
    "author": "Confident-Raisin7077",
    "url": "https://i.redd.it/fc0bt6c9x50e1.png",
    "permalink": "/r/PESU/comments/1goequo/rr_campus_kannada_koota_concert/",
    "score": 81,
    "created_utc": 1731283012,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lwjn7sp",
      "body": "Can confirm,\nevery bit of information in this thread is true.\nShitty management plus that irritating anchor 🤢 cringe she was."
    },
    {
      "id": "lwk394v",
      "body": "Was the same for at, we stood from like 4 pm till 7 pm and most guys left before shaan got to his good bits"
    },
    {
      "id": "lwkkcb8",
      "body": "In that case those mfs closed hostel entry and exit from 2-7 .like what!! It's the damn Sunday and you expect us to be in the room. And the warden be like we noticed you a day before , but in reality they posted on the same  and day."
    },
    {
      "id": "lwkw6iu",
      "body": "Very true ! Experienced the same thing, and worst part is management were clueless for most of the part of the event. \nAnd inspite being 7 they kept on showing the last year’s Kannada koota videos, Its like bro we know last year was awesome, this year’s achievements were just making edits if last year’s program."
    },
    {
      "id": "lwlfrch",
      "body": "Doxx"
    },
    {
      "id": "lwlggyi",
      "body": "They breathalysed me for no reason :((\nI felt like one kudka kirik boli maga👎👎👎"
    },
    {
      "id": "lwmse7r",
      "body": "Vasuki came late, organise a show next time and feel the struggle rather than shit talking here, the concert went smooth itself but the croud was not co-operative"
    },
    {
      "id": "lwpkczf",
      "body": "Haha! Blame game! As if u are the only to organise any event!"
    },
    {
      "id": "lwqznf2",
      "body": "No, but they are the ones who do that without college support and minimal budget unlike AT"
    }
  ]
}