{
  "id": "1gpdr7b",
  "title": "Attendance is waaay below 75.",
  "content": "my attendance is very low like in 60s and one subject in 50s and even if i attend every class it wont make it 75.   \nis attendance policy very strict for III SEM and should i be worried?",
  "metadata": {
    "author": "BarracudaInside2755",
    "url": "https://www.reddit.com/r/PESU/comments/1gpdr7b/attendance_is_waaay_below_75/",
    "permalink": "/r/PESU/comments/1gpdr7b/attendance_is_waaay_below_75/",
    "score": 12,
    "created_utc": 1731389704,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lwpizm9",
      "body": "Yes they will give you a backlog on the subject if you have less than 75% (if it is cie idk what is gonna happen)"
    },
    {
      "id": "lwpjajy",
      "body": "If it's less than 75% you will not be able to write ESAs. Try and get a medical certificate if possible."
    },
    {
      "id": "lwptbdx",
      "body": "Is attendance needed for isa? "
    },
    {
      "id": "lwpv0wc",
      "body": "Yup"
    },
    {
      "id": "lwpv6ux",
      "body": "Nope only esa"
    },
    {
      "id": "lwq61c4",
      "body": "Brother, you are cooked"
    },
    {
      "id": "lwr7l60",
      "body": "If your parents know , make up some medical reason and submit a letter."
    },
    {
      "id": "lwvro9b",
      "body": "I don't want to get your hopes up but it depends on your HoD. I was in ECE ECC and I had 51%, 60% and all in my attendancen in sem 3. They didn't really care and I just wrote the ESA normally. At the same time, my frnds in CS got cooked for having 65%"
    },
    {
      "id": "lwvupto",
      "body": "What did ur friends do then?"
    },
    {
      "id": "lwwdo2y",
      "body": "They gave some affidavit and like 10 medical certificates to their hod. They got admit card after that"
    },
    {
      "id": "lx1fm3q",
      "body": "Bro make some medical certificate and submit to HOD .\n\nThey will make you write some letter which says “you will maintain above 75% attendance in coming semesters,failed to do so you won’t be eligible for ESA” \n\n🤞"
    },
    {
      "id": "lx3pf3x",
      "body": "If you're in cse it'll be managed, rest will make you cry but will let you go through if you cry"
    },
    {
      "id": "lx7f5jx",
      "body": "Hey I was gonna plan to miss 8 days of clg so my attendance ll go below 75% then if I give some medical certificate with my parents knowledge ll I be allowed to write esa ?"
    },
    {
      "id": "lx8pgzv",
      "body": "Don’t risk it, \nI had a valid reason for my absence.\nToday my mentor talked with Chairperson about my situation, and she said that I have to stay after classes and attend the attendance recovery sessions.\n\nApparently they are strict with the attendance."
    },
    {
      "id": "lx98x5u",
      "body": "If you know the professor well, try to talk to them and give them a believable reason as to why you were absent. Attend the rest of the classes completely. Tell them you will be punctual in the future (of course follow it) and pretty much beg until they say yes. If that doesn't work, go to HoD. As someone suggested, medical reasons are the best with a certificate to back it up!"
    },
    {
      "id": "lx9orzn",
      "body": "Ll it workout ( medical certificate )"
    },
    {
      "id": "lxfigz4",
      "body": "You got this. You can make it work! Try your best."
    },
    {
      "id": "m99mg9l",
      "body": "If you’re at PES University, make sure to check out the PESU Attendance Chrome extension I built! It helps you track how many classes you need to attend to stay on track and, even better, lets you see how many classes you can afford to bunk.\n\n[PESU Attendance](https://chromewebstore.google.com/detail/pesu-attendance/aoblnnmlkcadhkdkocbanbcjndjlgiib?hl=en)"
    },
    {
      "id": "mb31xyr",
      "body": "is there any safari extension\n\n?"
    },
    {
      "id": "mct2fmx",
      "body": "Nope it will work on chrome or brave browser"
    }
  ]
}