{
  "id": "1gqvf9j",
  "title": "assignment marks",
  "content": "im henuinely so cooked, i have a 101 fever rn and im basically on the verge on dying atp. I have a open book test in epd today but i cannot attend it. I know im going to be losing 10marks in my grade. How cooked will i be",
  "metadata": {
    "author": "thefallenpeepoo",
    "url": "https://www.reddit.com/r/PESU/comments/1gqvf9j/assignment_marks/",
    "permalink": "/r/PESU/comments/1gqvf9j/assignment_marks/",
    "score": 26,
    "created_utc": 1731554012,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lx16ko9",
      "body": "Just talk to the teacher afterwards, he will give you a retest or something"
    },
    {
      "id": "lx18iyc",
      "body": "Are you in H section by any chance?"
    },
    {
      "id": "lx1c6av",
      "body": "You are better off with talking to your teacher for a retest"
    },
    {
      "id": "lx24jnn",
      "body": "our teacher told us that no retests will be allowed"
    },
    {
      "id": "lx25vdg",
      "body": "Try to get a medical certificate and request your teacher to give a re-test. They'll mostly give one and if they don't, just ask your hod if you can get another chance. Don't worry, you're still in first year and usually the teachers are pretty chill, even if they don't appear to be. Ask your teacher and hope for the best, you should be fine. Worst case, u get a 6 or 7"
    },
    {
      "id": "lx2cnbp",
      "body": "Did anyone have a 101⁰ fever when the teacher told?"
    },
    {
      "id": "lx33vwq",
      "body": "bruh i fractured my left hand when I was in 2nd sem, I came on assignment period, wrote the test and left 💀, you got no choice, its difficult to score in isa and esa, why to loose this free marks"
    },
    {
      "id": "lx8hoov",
      "body": "L"
    },
    {
      "id": "lxmc9w3",
      "body": "Teachers will be understanding incase your sick tbf"
    }
  ]
}