{
  "id": "1gsmh3v",
  "title": "Are we'all getting a way out??",
  "content": "https://x.com/IndianTechGuide/status/1857634703781802310?t=ikW6mFKwP6Gl3pTpxVB_eA&s=19",
  "metadata": {
    "author": "RamanaGad",
    "url": "https://i.redd.it/epnlz6see91e1.png",
    "permalink": "/r/PESU/comments/1gsmh3v/are_weall_getting_a_way_out/",
    "score": 54,
    "created_utc": 1731760949,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lxfbtj2",
      "body": "would be nice if we had this option ngl. Id grind my ass out to save some money and exit in third year itself. But then the whole system would change in the college. Itd be mad tho"
    },
    {
      "id": "lxfbyhb",
      "body": "Same Man, i am soo happy to hear this, if this really happens id just grind like day in day out and get off in my third year.."
    },
    {
      "id": "lxfcgxf",
      "body": "its pes bro they make their own rules 💀"
    },
    {
      "id": "lxfe6dg",
      "body": "They have to listen to UGC or else they're gonna risk losing their deemed to be university status."
    },
    {
      "id": "lxfeamh",
      "body": "don't be too happy. like all other government agencies in this country, ugc loves to announce bold 'plans' but they dont implement shit."
    },
    {
      "id": "lxfeiks",
      "body": "Idts it would be applicable for the current batches \n\nNo way they're gonna merge syllabus halfway our degree and grind our heads"
    },
    {
      "id": "lxff3y7",
      "body": "PES is not a \"deemed to be University\". It is a state private university which derives its powers from Karnataka Act no 16 of 2013 (PES University Act)"
    },
    {
      "id": "lxffn1b",
      "body": "Isn't it deemed to be university since 2018?"
    },
    {
      "id": "lxfgst4",
      "body": "Nope, PES hasn't gotten uni status from UGC, so not deemed"
    },
    {
      "id": "lxfh9gc",
      "body": "Either of us is living under a rock is what i feel."
    },
    {
      "id": "lxfhjba",
      "body": "@u/rowlet-owl pls clarify."
    },
    {
      "id": "lxfhlfp",
      "body": "You're too young to remember how PES went out of its way to not listen to UGC during COVID"
    },
    {
      "id": "lxfhuf1",
      "body": "I remember this incident, but this gentleman/woman is making me lose my brain fog down so wanted some clarity."
    },
    {
      "id": "lxfif3j",
      "body": "A lot of jargon is being thrown around here but basically, PES is accredited as a University by UGC, which means that it has to follow whatever policies are being enforced by UGC. The key word here being \"enforced\", which means that UGC may choose to have guidelines and suggestions but PES is free to do as they choose (which is what happened during COVID) as long as it isn't a strict mandate. \n\n\"Deemed to be uni\" essentially means to be granted autonomy over it's functions. Which is what PES has. It became one in 2014. What you and the other commenter are referring to are the same."
    },
    {
      "id": "lxfihjo",
      "body": "why would this be good?"
    },
    {
      "id": "lxfjjl6",
      "body": "How would it save money though? The tuition fee isn't a fixed amount per year and is a function of the credits you take up in a semester. The moment you add more credits, the tuition fee is guaranteed to increase. And it's PES, they will definitely bump up the fees by a bit.\n\nOf course you'll save money if you don't stay in hostel, but I don't think that's the main outcome here."
    },
    {
      "id": "lxfv4y1",
      "body": "oh, well now that you mention more credits, the fees would increase. My bad bro🫡"
    },
    {
      "id": "lxfz7qo",
      "body": "private colleges will probably take some time adopting that, so i wouldnt get my hopes up if i were you"
    },
    {
      "id": "lxh7f5u",
      "body": "Do you really ever get a way out with PES?"
    },
    {
      "id": "lxjg88w",
      "body": "I did my 2 yr MBA in just 1 yr"
    }
  ]
}