{
  "id": "1gsov0u",
  "title": "Web Tech Project Submission Next Week 😭",
  "content": "My Web Tech project submission is due next week, and I just can’t make one on my own right now. Could anyone please share their old Web Tech projects or guide me with something I can use? I promise I’ll customize it if needed\n\nPlsssss 🙏😭\n\n",
  "metadata": {
    "author": "Publisher_Of_Quran",
    "url": "https://www.reddit.com/r/PESU/comments/1gsov0u/web_tech_project_submission_next_week/",
    "permalink": "/r/PESU/comments/1gsov0u/web_tech_project_submission_next_week/",
    "score": 16,
    "created_utc": 1731768701,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lxftiow",
      "body": "Lol with freeloader teammates its even harder   \nBut seriously: Why should everything be team based in this damned Univ smh"
    },
    {
      "id": "lxfv9jf",
      "body": "Learn to use GitHub"
    },
    {
      "id": "lxfw0i8",
      "body": "The frustration is understandable but honestly it would be extremely time consuming and tedious to make a project at the scale they expect all alone"
    },
    {
      "id": "lxfzo9z",
      "body": "ngl the minimum 10-11 page requirement is so stupid;\nthe assumption that all pages are made the same is just plain wrong and it encourages people to make shitty bloated apps with pointless pages, rather than innovating or trying something new"
    },
    {
      "id": "lxg40r4",
      "body": "You can download the complete Web Tech project from the link below:🔗 \n\n[Download Web Tech Project](sandbox:/mnt/data/WebTechProject.zip)"
    },
    {
      "id": "lxg9vcw",
      "body": "Check for projects on GitHub. You'll find many of them."
    },
    {
      "id": "lxgbyvw",
      "body": "Bro same, in my team 1 guy is doing nothing , we 2 are struggling to make something 😭"
    },
    {
      "id": "lxgj0bt",
      "body": "Bro for us only 1 person is doing something"
    },
    {
      "id": "lxgj89a",
      "body": "Man I swear the wt project combined with the thousand assignments, class test, projects and hackathons they're giving us is making me wanna kill myself. Fuck this college burn it to the ground."
    },
    {
      "id": "lxgm6s8",
      "body": "True😭"
    },
    {
      "id": "lxgno75",
      "body": "teams of 3? your wish or its fix number?"
    },
    {
      "id": "lxgqji9",
      "body": "It was fixed , but some people were left out so there were 2 teams with 4"
    },
    {
      "id": "lxj9gy7",
      "body": "Yeah that's valid too...."
    },
    {
      "id": "lxjws4k",
      "body": "There are plenty of repos in GitHub to search"
    },
    {
      "id": "lxk4q6r",
      "body": "onces code is downloaded from github how do you connect to our own MongoDB database?"
    },
    {
      "id": "lxk6m5v",
      "body": "Spawn an instance of Mongo wherever you want to and connect using the DB's credentials (username/password or URL)."
    },
    {
      "id": "lxmzzfs",
      "body": "Either you can clone a project from github OR just follow along a tutorial for a MERN stack project similar to yours.. You can make changes to it along the way and you can add more components at the end easily as you would be knowing how the project works :-)"
    }
  ]
}