{
  "id": "1gso7sx",
  "title": "How do you takecare of your eyes after studying from a screen all day",
  "content": "I feel my eyes burning after studying, since notes and slides  everything is on screen. can't even get those many slides and notes printed. And being a cs student also I have to sit in front of my laptop all day.",
  "metadata": {
    "author": "Ill_Tomatillo3482",
    "url": "https://www.reddit.com/r/PESU/comments/1gso7sx/how_do_you_takecare_of_your_eyes_after_studying/",
    "permalink": "/r/PESU/comments/1gso7sx/how_do_you_takecare_of_your_eyes_after_studying/",
    "score": 28,
    "created_utc": 1731766710,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lxfoin9",
      "body": "I use eye drops to prevent dryness and itching, use them twice a day atleast (or whenever required). Also take regular and timely breaks from studying, and make sure when you're on a break from your laptop, you aren't on your phone. (A challenge for your generation, but I know). Taking a break from one screen to be on another screen doesn't solve the problem."
    },
    {
      "id": "lxfoufj",
      "body": "it feels like your spying on us. also, when are you going to evolve ?"
    },
    {
      "id": "lxfp7hz",
      "body": "No reason to evolve when all the incoming PESts are mentally devolving backwards"
    },
    {
      "id": "lxfq7kg",
      "body": "Wait till you get added to the most brainrot chat groups of the incoming pests. There is no escaping that"
    },
    {
      "id": "lxfqcp2",
      "body": "Take a break from the screen every 20-30 min. Stroll around. DO NOT rub your eyes."
    },
    {
      "id": "lxfv8cr",
      "body": "I'm thinking of buying lenskart blu for the same reason, but I'm not sure it'll actually help"
    },
    {
      "id": "lxfw4w6",
      "body": "There is limited research to prove the effectiveness of blue light filters. Just use dark mode on low brightness, that's what I do."
    },
    {
      "id": "lxfzdci",
      "body": "get your eyes checked, if they burn too quickly its probably a sign of something much worse brewing"
    },
    {
      "id": "lxg31aq",
      "body": "That would strain eyes in other ways"
    },
    {
      "id": "lxh05qm",
      "body": "My eyes are used to my screentime atp. Guess I'll be having problems when I grow older"
    },
    {
      "id": "lxh92g7",
      "body": "It doesn’t"
    },
    {
      "id": "lxjayq1",
      "body": "none of those \"screen glasses\" help."
    },
    {
      "id": "lxkei6w",
      "body": "U are the same gen as us 😭"
    },
    {
      "id": "lxrc69t",
      "body": "Hey, currently using those. It helps to a certain extent but it doesn't protect your eyes from strain etc. it does help in reducing the harshness of light and it helps with sunlight glare in classrooms."
    },
    {
      "id": "ly39f90",
      "body": "Take regular breaks"
    },
    {
      "id": "ly4jrlf",
      "body": "Just take regular breaks if you feel soreness. Breaks as in going downstairs for a walk or something."
    }
  ]
}