{
  "id": "1gti8rl",
  "title": "DBMS hackathon is such a pain",
  "content": "Wanna know if the senior batches had a \"hackathon\" for DBMS, if yes then what was the complexity like?\n\n\n",
  "metadata": {
    "author": "Yagnikanna_123",
    "url": "https://www.reddit.com/r/PESU/comments/1gti8rl/dbms_hackathon_is_such_a_pain/",
    "permalink": "/r/PESU/comments/1gti8rl/dbms_hackathon_is_such_a_pain/",
    "score": 24,
    "created_utc": 1731863344,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lxmceoj",
      "body": "We didn't have a hackathon for DBMS. Why PES be keeping a hackathon for every single course"
    },
    {
      "id": "lxmdzye",
      "body": "Us 2nd years have a hackathon for ddco. Don't knw why even verilog requires a fucking hackathon."
    },
    {
      "id": "lxmeazr",
      "body": "Even ddco bruh why. Thank God i don't have to deal with this. I probably can't write a single line of verilog code."
    },
    {
      "id": "lxmehdr",
      "body": "Neither can most of us lol"
    },
    {
      "id": "lxmezmo",
      "body": "There is no point in this; we have been working on a project for a month, and now we have to do the same thing in just one day."
    },
    {
      "id": "lxmftit",
      "body": "Can't u just use ur hotspot"
    },
    {
      "id": "lxmgnox",
      "body": "In my class , mobile data doesnt come , have to really on pesu wifi . But we use vpn"
    },
    {
      "id": "lxmiwil",
      "body": " Yeah have to use Perplexity, Claude and Copilot now bro 😭"
    },
    {
      "id": "lxmk5q2",
      "body": "Exactlyyyyy!"
    },
    {
      "id": "lxmk8b5",
      "body": "Damnnn\nSo this is smtg new introduced this year!"
    },
    {
      "id": "lxmk9dx",
      "body": "gg bois"
    },
    {
      "id": "lxml5dl",
      "body": "It's fucking useless....we are just learning ways of using chatgpt efficiently....as if lab assignment mini project wasn't already enuf."
    },
    {
      "id": "lxmlqay",
      "body": "Lol so true🌚"
    },
    {
      "id": "lxmm3uq",
      "body": "I cannot think of a single reason why they'd keep these \"hackathons\" other than to torment us. Hell is better."
    },
    {
      "id": "lxmmzou",
      "body": "This JOB (Jackfruit,Orange,Banana) problems were a sneak way fitting hackathon along with project and labs lmao. It seems like they couldn't come to a conclusion as to which two of these three they can put in course so considering they don't give a flying f\\*ck about us they have put all the three 💀"
    },
    {
      "id": "lxmn05f",
      "body": "Fr"
    },
    {
      "id": "lxmnqjn",
      "body": "gg"
    },
    {
      "id": "lxmnv40",
      "body": "Trust me when I say this,\nBy the time I figured out what exactly these 3 effin fruits mean, half of the sem got over😭"
    },
    {
      "id": "lxmph6k",
      "body": "Hackathon using Verilog is mad lmaoo💀💀"
    },
    {
      "id": "lxmps3u",
      "body": "I graduated at the right fucking time lol"
    },
    {
      "id": "lxmq2ga",
      "body": "Anna 😭🙏🏼"
    },
    {
      "id": "lxmr6q5",
      "body": "If there's anything I've learnt this semester, it's how to exploit ChatGPT to its fullest."
    },
    {
      "id": "lxmru54",
      "body": "We had 8 assignment submissions + a project presentation + lab quiz and now a hackathon. All of this apparently adds to 20 marks, but I feel like for the amount of donkey work they're giving us it should be for 50 marks."
    },
    {
      "id": "lxmufgo",
      "body": "You have a hackathon for that!?!? RIP brotha I can’t even imagine"
    },
    {
      "id": "lxmuzto",
      "body": "More like 5 hours...."
    },
    {
      "id": "lxmvdrm",
      "body": "We have DBMS project and as if that wasn't enough, now we have to basically do the same thing in 5 hrs"
    },
    {
      "id": "lxmwkwt",
      "body": "It's just a joke now like I just saw the guidelines and the crap they expect us to do within the given time limit and to the extent that they do all these just to showcase and experiment with this whatever JOB model they're pushing now on us"
    },
    {
      "id": "lxmx9im",
      "body": "Omfg bro how are they so stupid bro. So you have to assignments + project + “hackathon” for what 15-20 marks. I can’t bro it’s too much for me."
    },
    {
      "id": "lxmz51k",
      "body": "🥲"
    },
    {
      "id": "lxmz8de",
      "body": "It's for 30 Marks in total"
    },
    {
      "id": "lxmzf50",
      "body": "It's some FDBMS thing not the same as what we made in DBMS project. But yeah frontend n all bs again they want with two systems connected."
    },
    {
      "id": "lxn0a5a",
      "body": "Yeah even we had all of that except for the Hackathon. We didn't know shit about our DDCO project thankfully that teacher we had was chill af"
    },
    {
      "id": "lxnyxvb",
      "body": "Hackathons are ok..it gives us an opportunity to see how we all work as a team in high pressure and limited time..but these hackathons are held at the wrong time..this time is crucial for preparing for exams. To add to this, the TAs are giving a really hard time.\n\nI hope this isa, they won't use AI for correction. The review of the isa1 papers showed a lot of mistakes in correction and until now revised marks are not updated.\n\nLast sem's scholarships  is not yet announced..\n\nIn this sem, nothing  was planned and managed properly. This sem just went off under tremendous pressure and senseless hackathons with little time to study. \n\nI really hope the corrections will be crucial"
    },
    {
      "id": "lxq4zr1",
      "body": "PES and its obsession with hackathon and research papers xD"
    },
    {
      "id": "lxq9l8p",
      "body": "So true"
    },
    {
      "id": "lxqsdpy",
      "body": "Hackathons and research papers(irrelevant of industrial trends). Absolute museum grade trash.\n\nIsse \"trauma filled assignment\" ghoshit kyu nhi kar dete."
    },
    {
      "id": "lxr1bnm",
      "body": "it's even worse when you have to carry two unserious deadweights in your team"
    },
    {
      "id": "lxr233f",
      "body": "Actually \nLuckily I had only such guy, other two were peace"
    },
    {
      "id": "lxr3zth",
      "body": "I don't get some of these people. Like sure, life doesn't have to be that serious all the time. There's a week to go before ISA 2, the least those two clowns can do is lock the fuck in."
    },
    {
      "id": "lxr45rr",
      "body": "And I hate it when they pretend to be contributing but in reality just make you loose on your time"
    },
    {
      "id": "lxrj16d",
      "body": "…what hackathon lmaoooo we were just given simple simple tasks and a mini project"
    },
    {
      "id": "lxsvprb",
      "body": "Yeah I've lost about a week's time because no one wants to pick up their slack. Why even bother making a team at that point..."
    },
    {
      "id": "lxw0n2u",
      "body": "🫠🫠"
    },
    {
      "id": "lxxv8td",
      "body": "We dint have one\nIm from 25’ batch, 7th sem rn"
    }
  ]
}