{
  "id": "1gx4qok",
  "title": "Guys....i got caught forging signatures of the professor on my lab record! They professors told me to withdraw from the lab assessment. She also told me to speak to the dean and write an apology letter. But will they let me write the exam, what are the consequences????? How screwed am i??????😭 ",
  "content": "",
  "metadata": {
    "author": "Far_Badger1318",
    "url": "https://www.reddit.com/r/PESU/comments/1gx4qok/guysi_got_caught_forging_signatures_of_the/",
    "permalink": "/r/PESU/comments/1gx4qok/guysi_got_caught_forging_signatures_of_the/",
    "score": 36,
    "created_utc": 1732270955,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lye8dgx",
      "body": "Bro that's dumb asf but okay"
    },
    {
      "id": "lye9avq",
      "body": "Which subject lab"
    },
    {
      "id": "lyeaoey",
      "body": "Why would you do that ? In the first place you could have just gone and asked for their signature on your lab record and they would have signed"
    },
    {
      "id": "lyeavtl",
      "body": "Why did u do that in first place :)\n\n\nI think its gonna be fine if you request your prof. somehow.. hopefully 🤞"
    },
    {
      "id": "lyeb2z2",
      "body": "What's happened is happened. Lesson learnt. Don't repeat next time. Since you know it's incorrect, seek a sincere apology and plead to them to allow you to write the exam. \n\nNever take the unlawful ways. Honesty is the best policy."
    },
    {
      "id": "lyeivnz",
      "body": "Please take a deep breath; it’s done. Next time, consider the consequences of your actions before you act.\n\nThe professors will likely expect you to apologize sincerely. Just show that you understand what you did wrong and express your regret. They will allow you to write exams. So relax."
    },
    {
      "id": "lyejj57",
      "body": "BE BETTER - GIT GOOD"
    },
    {
      "id": "lyemf1r",
      "body": "# play stupid games, win stupid prizes"
    },
    {
      "id": "lyexll3",
      "body": "I had a full blown  panic attack the night before i did it. Idk wt ws wrong with me......honestly i never did that before. I screwed up badd....bt i really  really hope she doesn't take off my exam. My reputation,  everything is ruined....for a dumb mistake.  I wont get into any good clg for masters....my life is over and everything with it. I dont wanna live"
    },
    {
      "id": "lyexvq0",
      "body": "My life is over after that....just for a dumb mistake it all over, my career,  future, everything at once got over. I dont hv any hopes for the future....infact i dont wanna stay alive 😔"
    },
    {
      "id": "lyfa6n2",
      "body": "Bruh\nThat ok! Chill !!!!\nNtg is gonna happen \nEverything will be alright!\n\nJust face it, dont just give up already!!"
    },
    {
      "id": "lyfakio",
      "body": "Bruh srsly\n\nWhats wrong!!\nNtg is over!\nDon’t overthink.   Just do whatever it takes apologise prof!"
    },
    {
      "id": "lyfg8g0",
      "body": "Stop being dramatic and face the consequences nobody will give you sympathy or attention. You get wt you deserve for your actions now go face it"
    },
    {
      "id": "lyfgpqp",
      "body": "Ryt"
    },
    {
      "id": "lyfha14",
      "body": "Also it won't be as bad as you think it would honestly. But your a grown adult so you will be scrutinized for your actions"
    },
    {
      "id": "lyfhhof",
      "body": "Hey brother. Relax. We are all humans and bound to make mistakes.  About the reputation, to be honest, each has their own problems. No one really cares about anyone's reputation. Nothing is lost. it's just a matter of writing an apology letter, talking to the dean and apologizing. That's it. Everything will be just fine. Making mistakes and learning from it is what makes one mature. We are all learning. We are all growing. Relax. Inhale and exhale deeply. This too shall pass."
    },
    {
      "id": "lyizfuu",
      "body": "Worst case, you'll have a backlog, just clear it later and move on. Don't repeat the mistake."
    },
    {
      "id": "lyj529c",
      "body": "Even I did that, lol."
    },
    {
      "id": "lyj5glj",
      "body": "In my clg, the teacher did not sign my record eventough I asked her 5-6 times, at the end I was like fk I'm not getting placed due to my cgpa anyway, forged got caught (4 ppl aling with me) . this ruined my mental health for good 2 months. Teacher made me fail in other subject in 7th sem lol. Removing off placements."
    },
    {
      "id": "lyjfpgj",
      "body": "Well deserved"
    },
    {
      "id": "lyjhson",
      "body": "Nothing like that bruh don't worry. It is never that deep and you'll manage. Noone will even remember in a week or two so don't worry about reputation or anything like that. Whatever comes your way, make sure you try your hardest and you'll be ok. Your life is far from over, it's barely even started! Take care my friend"
    },
    {
      "id": "lyjipwb",
      "body": "Thats must be so hard on u! I am so sorry"
    },
    {
      "id": "lyk2w3f",
      "body": "Demn your some sick human"
    },
    {
      "id": "lyk8o7g",
      "body": "Not supporting the teacher. But what he/she did was wrong too. Don't have the patience to wait and get it signed? \nNot saying what the teacher did was right but usually teachers don't do it. They won't fail you like that. That's delulu"
    },
    {
      "id": "lykehap",
      "body": "Nah I was just frustrated with 3rd world country practises, non sense knowledge, which I am going to use no where in life., for that I taught the suffering ain't worth it."
    },
    {
      "id": "lykgxss",
      "body": "Valid bro"
    },
    {
      "id": "lyknnm9",
      "body": "I will go and  let the teachers know my pov after I'm successful."
    },
    {
      "id": "lykp63s",
      "body": "They'll only be happy for you"
    },
    {
      "id": "lyky0ds",
      "body": "They are classic blood-suckers."
    },
    {
      "id": "lyxquyo",
      "body": "skill issue tbh"
    }
  ]
}