{
  "id": "1gzay0z",
  "title": "Consequences of Fucking up ISA1 (sem1)?? Should I attend ptm??",
  "content": "",
  "metadata": {
    "author": "TheShockSensor",
    "url": "https://www.reddit.com/r/PESU/comments/1gzay0z/consequences_of_fucking_up_isa1_sem1_should_i/",
    "permalink": "/r/PESU/comments/1gzay0z/consequences_of_fucking_up_isa1_sem1_should_i/",
    "score": 21,
    "created_utc": 1732510035,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lyv14vd",
      "body": "The consequences are dire. I feel sorry for you. Jawahar will sue your parents, and worst of all: your verdict will be pronounced by the pesu court and you'll likely be sentenced to death or if you get lucky, life imprisonment. I suggest you get a good lawyer to atleast try to decrease your sentence. "
    },
    {
      "id": "lyv6g2p",
      "body": "Lol chill,\nThat’s your wish"
    },
    {
      "id": "lyv7t1s",
      "body": "If I'm a law student and I fuck up my isa 1 can I represent myself in court ?"
    },
    {
      "id": "lyvdirs",
      "body": "PTM is not a mandatory thing"
    },
    {
      "id": "lyvdplp",
      "body": "Better call Saul"
    },
    {
      "id": "lyvfdvz",
      "body": "Bruh u are in fkn college, take accountability for yourself. Why TF should your parents have to run behind you ? Trust me none of those profs will give you positive feedback basur they wouldn't even know you well enough. Our department doesn't have PTMs cause we are literally adults who can take responsibilities. Attend or not attending will not make any difference, ull fef not get the feedback u want, they just say study better next time and sen you home. Every faculty will hardly .be there for half an hour ."
    },
    {
      "id": "lyvuqf1",
      "body": "In PTM they won't increase marks... I don't think u want to meet teachers simply with parents.. So no need"
    },
    {
      "id": "lyx73p7",
      "body": "nah im calling harvey and maybe litt for backup"
    },
    {
      "id": "lz0dow9",
      "body": "No use. Op will be dead meat soon"
    },
    {
      "id": "lz0r7eh",
      "body": "then ross gonna save the day"
    }
  ]
}