{
  "id": "1h05la2",
  "title": "It’s happening ….PESU 2024 Convocation",
  "content": "",
  "metadata": {
    "author": "Suspicious_Code1493",
    "url": "https://i.redd.it/tch9a0a4y63e1.jpeg",
    "permalink": "/r/PESU/comments/1h05la2/its_happening_pesu_2024_convocation/",
    "score": 55,
    "created_utc": 1732602951,
    "flair": "ANNOUNCEMENT :snoo:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lz1e99y",
      "body": "Is that convocation fee fair enough? Need clarification."
    },
    {
      "id": "lz1ecsh",
      "body": "First of all asking us to pay for convocation is not fair"
    },
    {
      "id": "lz1ehyr",
      "body": "This is the first time they have a fee. They never charged anything before this. \n\nCharging people to give them their degree is fucking wild. So glad I'm out of here."
    },
    {
      "id": "lz1eju6",
      "body": "Yeah exactly my point. Even if we buy the convocation gown and other items, they just have to organise the dinner and the auditorium on their expenses."
    },
    {
      "id": "lz1enmo",
      "body": "I would rather just collect the degree, take a few pics with friends and professors and move out lol. Ungrateful college it is."
    },
    {
      "id": "lz1f28b",
      "body": "Maybe it's to control the huge number of people who would turn up. They can just have convocation in parts instead of having everything in the same day. Let Cs ppl have it on one day, other departments on another, bba on another, etc. Plus guess they've run out of good guests to invite and may need the bucks to get someone decent. They wanna cut costs by asking us for money. "
    },
    {
      "id": "lz1f6nm",
      "body": "Reminds me of DU , they didn't have convocation, u just went, submitted some info and got your degree certificate and it was done lol. "
    },
    {
      "id": "lz1fclx",
      "body": "And why can't they, atleast for the graduating class ? What do they do with the big bucks they get from mqt ? "
    },
    {
      "id": "lz1feqx",
      "body": "Then y only our batch !!!"
    },
    {
      "id": "lz1ffmx",
      "body": "This is really bad. Fee for convocation? This is the milestone and must be celebrated without fee."
    },
    {
      "id": "lz1ffzm",
      "body": "Yes exactly 🥹"
    },
    {
      "id": "lz1fgj7",
      "body": "is this for which department"
    },
    {
      "id": "lz1fkpa",
      "body": "Asking us money for our graduation is not correct :("
    },
    {
      "id": "lz1fn8d",
      "body": "All departments maybe"
    },
    {
      "id": "lz1fqqb",
      "body": "Yes exactly \nSo sad for our batch"
    },
    {
      "id": "lz1fufw",
      "body": "This is business \n\n![gif](giphy|LdOyjZ7io5Msw)"
    },
    {
      "id": "lz1fw4g",
      "body": "Suggest to bring it up with the management"
    },
    {
      "id": "lz1fxnx",
      "body": "Management course are still in 5th sem"
    },
    {
      "id": "lz1fzmk",
      "body": "All they want is money"
    },
    {
      "id": "lz1fzsg",
      "body": "You're a special batch ✨"
    },
    {
      "id": "lz1g21a",
      "body": "Better not to attend"
    },
    {
      "id": "lz1g41p",
      "body": "They charged 500 for the provisional degree certificate which everyone needed for either their job or higher studies, and now 1200 for receiving the degree certificate on stage and some food? They’ve stooped too low."
    },
    {
      "id": "lz1h399",
      "body": "No , we finished our course in April (2021 Batch)"
    },
    {
      "id": "lz1h6um",
      "body": "But they will do convocation after all the Sem ESA RYT ?"
    },
    {
      "id": "lz1hb57",
      "body": "Yes we completed everything it's been months since i went to college, I'm working now 🙂"
    },
    {
      "id": "lz1hpfr",
      "body": "they are building medical college in hosur road   \nWE HAVE TO HELP THEM"
    },
    {
      "id": "lz1hs4u",
      "body": "If this is for all the departments , does the convocation be held on their respective campus or all in one campus? Btw I'm from ec campus management we finished our clg around April and have been waiting for it for months now and suddenly they are charging for it ? Tf"
    },
    {
      "id": "lz1kour",
      "body": "Love how we have to pay for our own grad"
    },
    {
      "id": "lz1r8o8",
      "body": "Pay to win is crazy"
    },
    {
      "id": "lz1wcb4",
      "body": "Honestly just gonna collect the degree some other day and move on 🤡 they ain't getting my 2k"
    },
    {
      "id": "lz1wgeo",
      "body": "Not even on their expense, real the annual report of Krishna institute of medical sciences, they are sponsoring most of the work these Bros just gave land and stole the name, it's not even their infra"
    },
    {
      "id": "lz22ko8",
      "body": "Exactlyy, and idek if the gowns will be for us to keep :("
    },
    {
      "id": "lz26bgu",
      "body": "And is this happening at the same time and day for RR and EC campus?"
    },
    {
      "id": "lz2hfjr",
      "body": "This is the fund for the large buildings"
    },
    {
      "id": "lz2hjfv",
      "body": "No clue"
    },
    {
      "id": "lz2hk0w",
      "body": "Mostly yes"
    },
    {
      "id": "lz2hm6z",
      "body": "Probably:)"
    },
    {
      "id": "lz2kp8a",
      "body": "All half information they give"
    },
    {
      "id": "lz2lwzn",
      "body": "Is this for 2024 pass outs?? Isn't it little late?"
    },
    {
      "id": "lz2rlc4",
      "body": "Yepp it's very late"
    },
    {
      "id": "lz2s4v7",
      "body": "Respective campus."
    },
    {
      "id": "lz2sby9",
      "body": "Usually happens on the same day at the respective campus"
    },
    {
      "id": "lz4hxc5",
      "body": "Disgraceful - you lot need to just boycott it and collect your degree cert at your convenience later."
    },
    {
      "id": "lz6hsap",
      "body": "Dinner? will they conduct it at night??"
    },
    {
      "id": "lz7itdb",
      "body": "Yep :) evening"
    },
    {
      "id": "lz7l7gr",
      "body": "Are u sure? Coz i have to travel from far away town, if it is morning i can attend and go back evening. Night it will be problem for bus🤦🏻‍♂️"
    },
    {
      "id": "lz7mfo5",
      "body": "Yes its gonna start in the evening !!"
    },
    {
      "id": "lzdtr60",
      "body": "They should start in the morning .. coz there are thousands of students ... They have informed just 10 days before ... That too without proper information... Actually we waited for the convocation and just last week booked flight on 7th night ... Now really don't know .. how long it takes .. they should conduct in both the campus in the morning "
    },
    {
      "id": "lzegz2s",
      "body": "They r conducting in both campus but not in the mrng :)"
    },
    {
      "id": "lzjg1sj",
      "body": "Even I was surprised by that. Paying for our own graduation..."
    },
    {
      "id": "lzjg3si",
      "body": "Like they didn't extract tons as fees for four years."
    },
    {
      "id": "lzjg8l6",
      "body": "When has our collage ever informed anything in advance"
    },
    {
      "id": "lzjgafz",
      "body": "They kept postponing it because they couldn't find a chief guest."
    },
    {
      "id": "lzjgd45",
      "body": "Paying for our own graduation is wild, that too after postponing it."
    },
    {
      "id": "lzjjy87",
      "body": "Cant change it now , just be done with it for one Last time :)"
    },
    {
      "id": "m009ytz",
      "body": "Hey, any idea about actual timings? I have some work on that day till about 3PM, need to see if I have to reschedule it. How have they not given timings when it's just 5 days away smh"
    },
    {
      "id": "m0hdzcy",
      "body": "Does Anyone know the exact time to report and exact schedule of the event? Still they haven't released any circular regarding it🤦🏻‍♂️"
    },
    {
      "id": "m0hihzq",
      "body": "Bruh the even is in two days but still they haven’t released anything lmao"
    },
    {
      "id": "m0jnutg",
      "body": "Who is the chief guest anyway??"
    },
    {
      "id": "m0ko1by",
      "body": "Idk. But its not going to be anyone special if you know what I mean."
    },
    {
      "id": "m0ko7mb",
      "body": "Have to be at the venue by 3:30"
    },
    {
      "id": "m0koc4r",
      "body": "There shouldn't be a fee for convo. Its our degree...that we slogged for 4 years. Taking the fees should be enough to cover but no"
    },
    {
      "id": "m0kqb7w",
      "body": "I agree with you, I feel disgusted looking at their atrocities."
    }
  ]
}