{
  "id": "1h0g98i",
  "title": "Struggling with math....",
  "content": "I'm not able to do math😭 so I really need to join a course or something for this subject so can anyone suggest anything🙂",
  "metadata": {
    "author": "Constant_Ant_6389",
    "url": "https://www.reddit.com/r/PESU/comments/1h0g98i/struggling_with_math/",
    "permalink": "/r/PESU/comments/1h0g98i/struggling_with_math/",
    "score": 17,
    "created_utc": 1732639326,
    "flair": "Study Help :table:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lz3mdo5",
      "body": "We are in for a ride for Engineering Mathematics-2😭😭😭"
    },
    {
      "id": "lz3tt7u",
      "body": "You'll have math in 3rd and 4th sem too. After that, depending on the courses you have (and opt to take up), you'll have math again"
    },
    {
      "id": "lz3w1ft",
      "body": "Nah nah in 3 rd sem we didn’t had math\nIn 4 th we had..\n\n\nAnd that will be last if we are not opting math in any electives!"
    },
    {
      "id": "lz3wg0j",
      "body": ">Nah nah in 3 rd sem we didn’t had math\n\nNot a MA course, but you definitely do have statistics, probability and counting as part of SDS (or currently the rebranded MCSE - Math for CS) course."
    },
    {
      "id": "lz3wpyg",
      "body": "Yeah if we consider that then yes"
    },
    {
      "id": "lz44w3k",
      "body": "Bruh I'm not able to survive in Engineering mathematics -1 😭😭"
    },
    {
      "id": "lz478fk",
      "body": "Engineering mathematics -2 was much easier than engineering mathematics-1"
    },
    {
      "id": "lz47ugk",
      "body": "tf didnt like 450 people fail last year in engineering math -2   \ni didnt think math-1 could beat that"
    },
    {
      "id": "lz4bpuc",
      "body": "M1 aint that tough tbh just learn the diff eqn formulas, M2 on the other hand better pray on it."
    },
    {
      "id": "lz6ycuy",
      "body": "In 3rd sem we have MCSE which is related to math"
    },
    {
      "id": "lz73bt1",
      "body": "It is tough for me send help 😭😭 "
    },
    {
      "id": "lzjfvsw",
      "body": "I too had problems with it. And just studying formulas don't help."
    },
    {
      "id": "lzji197",
      "body": "Ya i understood that but wt to do..."
    },
    {
      "id": "lzjkllw",
      "body": "Go for tuitions either within or outside collage."
    },
    {
      "id": "lzkdise",
      "body": "Wt u mean within CLG ?I don't get it like wt I HV to do  nvm I'm dumb asf ... Plz clarify "
    },
    {
      "id": "m1plmb6",
      "body": "Ask ur teachers for help. They will be willing to explain or talk to HOD they'll arrange"
    },
    {
      "id": "m24z06o",
      "body": "Sure I HV to do that "
    }
  ]
}