{
  "id": "1h20s3a",
  "title": "Io distinction certificates ",
  "content": "Are they worth anything?\n",
  "metadata": {
    "author": "Elegant_Queen14",
    "url": "https://www.reddit.com/r/PESU/comments/1h20s3a/io_distinction_certificates/",
    "permalink": "/r/PESU/comments/1h20s3a/io_distinction_certificates/",
    "score": 4,
    "created_utc": 1732814139,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lzfmxhi",
      "body": "Is a certificate made by a random org functioning within a relatively unknown college worth something? You tell me lmao. \n\nIO was a really great initiative unfortunately ruined by money. It was never about the certifications or paychecks until 2020 or so when they started making it paid."
    },
    {
      "id": "lzfp7d6",
      "body": "Kinda figured the same, but someone told me otherwise. So I wanted to confirm. \nAnyway gotcha, thank you!!"
    },
    {
      "id": "lzfysnv",
      "body": "My friends never received their distinction certificates for the previous slot (slot 17)... Ig we can see the team efficiency 😒"
    },
    {
      "id": "lzg10uz",
      "body": "Lol nope not at all\nI have one,I had forgotten abt it till I re-read ur post to check if u were referring to DAC scholarship certificate, took me a second to realise there's a distinction in PESU IO."
    },
    {
      "id": "lzi847i",
      "body": "Sheesh\nThey asked us to come today to collect them for slot 18"
    },
    {
      "id": "lzi88lr",
      "body": "Oh lol\nOkay thank you!!"
    },
    {
      "id": "lziccut",
      "body": "Ahh damm 😖"
    },
    {
      "id": "lzimtdc",
      "body": "Lmaooo so apparently we're not getting them today bcos there's a \"small typo\" and they need to be reprinted 💀"
    },
    {
      "id": "lzipwx2",
      "body": "Such a good imitative, ruined by dumb priorities and management team"
    },
    {
      "id": "lzqunfw",
      "body": "What else can you expect from an organisation whose head is a complete puppet clown and the people working under him are all newcomers? 💀"
    },
    {
      "id": "lzqwjey",
      "body": "Fair"
    }
  ]
}