{
  "id": "1h2l2k3",
  "title": "CSE final year Life",
  "content": "How does classes happen and how different is it from 3rd year?",
  "metadata": {
    "author": "BarracudaInside2755",
    "url": "https://www.reddit.com/r/PESU/comments/1h2l2k3/cse_final_year_life/",
    "permalink": "/r/PESU/comments/1h2l2k3/cse_final_year_life/",
    "score": 4,
    "created_utc": 1732884504,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lzk1lu3",
      "body": "Special topics are online. Capstone retains the same review structure. You don't have to show up to college apart from reviews, special topics ISA/ESA and placement tests/interviews (some of these can be online too)"
    },
    {
      "id": "lzkads4",
      "body": "How make credits do you have to take?\n\nIf you do those 1 week courses in the summer can you take less courses in 4th?"
    },
    {
      "id": "lzkasbd",
      "body": "You need totally 160 credits to graduate. So the number of credits you need is 160 minus whatever you've earned so far. For us, it was 20 (idk what is the current situation with PES making STs optional in 2nd and 3rd year). And yeah, any courses/internships through which you earned credits will add to your total credits, reducing the number of courses you need to take up in final year, which is why I always suggest taking up STs even though they're optional"
    },
    {
      "id": "lzkk0xp",
      "body": "😂"
    },
    {
      "id": "lzkkc2y",
      "body": "There is no classes as such in final year(online but almost no one attends), people just try to remember when their exam is.\n\nMostly the struggle is going to be placements and capstone. If you get placed early it’s pretty chill."
    },
    {
      "id": "lzlmf7l",
      "body": "Bro, ECE ppl also have a life man, final year is common to all branches. All branches have same Life."
    },
    {
      "id": "lzqilc1",
      "body": "So after third year no college life 😞 but u still have exam tension 😭. Whatever I will worry about this later, I have time"
    }
  ]
}