{
  "id": "1h4m5q4",
  "title": "Procedure to become a TA",
  "content": "",
  "metadata": {
    "author": "strange_panther21",
    "url": "https://www.reddit.com/r/PESU/comments/1h4m5q4/procedure_to_become_a_ta/",
    "permalink": "/r/PESU/comments/1h4m5q4/procedure_to_become_a_ta/",
    "score": 5,
    "created_utc": 1733111730,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lzzhzen",
      "body": "If possible, have some rapport with the professors you're interested to TA for. After that it's just approaching them. There might be some other expectations like S/A grade in the subject you want to TA for, or a good resume/projects related to the subject, depending on the subject.\n\nSome popular subjects like BD might have a slightly different process(not sure) but this is how it usually is."
    },
    {
      "id": "lzzrsbb",
      "body": "Adding to this, check the FAQs. There's more details there about the forms and other guidelines."
    },
    {
      "id": "lzzuybm",
      "body": "Just approach ur professor and they will ask your GPA for that particular subject.\n\nAnd based on that they will choose you mostly .\n\nBut for a few subjects it is slightly different, just approach respective professor they will let you know"
    },
    {
      "id": "m00kk3c",
      "body": "I don’t have the grade requirement for the subject I want to be a TA for but can I approach that subject teacher who has only taught me once before if I can make good projects?"
    },
    {
      "id": "m01163i",
      "body": "I don’t have the grade requirement for the subject I want to be a TA for but can I approach that subject teacher who has only taught me once before if I can make good projects?"
    },
    {
      "id": "m015m83",
      "body": "It depends a lot on the course. I'd suggest reading the FAQ link and reaching out to the prof."
    },
    {
      "id": "m02ipbq",
      "body": "Dont become - Personal Experience. (I have been TA for 2 subjects). And its really really really not worth you time. Dont waste time here rather study (Leetcode) or build some projects etc whatever you want"
    },
    {
      "id": "m04btrn",
      "body": "You shouldn't generalise. Many students have good experiences, while many also have poor experiences. A TAship helps massively for MS admissions and help land TAships at your prospective uni too. So yes, they are useful and worth your time if you are aiming for Masters. At the end of the day, your prof, the nature of the work you are assigned and how well it aligns with your future goals will determine if is it worth it."
    },
    {
      "id": "m12ob8n",
      "body": "True actually"
    }
  ]
}