{
  "id": "1h4mnag",
  "title": "ESA",
  "content": "I have a total of 170 on my isa 1. I wish to get A grade in all subjects. Can someone please suggest time management and study(to refer extra or if cw slides and qb is enough) tips? And also tips to learn python and free resources? Thanks a lot.",
  "metadata": {
    "author": "DurianFriendly6901",
    "url": "https://www.reddit.com/r/PESU/comments/1h4mnag/esa/",
    "permalink": "/r/PESU/comments/1h4mnag/esa/",
    "score": 2,
    "created_utc": 1733113300,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "lzzlgcm",
      "body": "You can mostly aim for S in most subjects if you’re getting 170/200 in ISA. Just continue to do what you’re doing consistently, it’s a good score. For ESA make sure you revise thoroughly and do PYQs, you’ll have a good shot at 9.5+ then."
    },
    {
      "id": "lzzojb8",
      "body": "They probably meant 170/230"
    },
    {
      "id": "lzzoqzs",
      "body": "How out of 230?"
    },
    {
      "id": "lzzrwke",
      "body": "5 subjects out of 40 and 2 credit course out of 30"
    },
    {
      "id": "m00y2u5",
      "body": "It's 170/230 actually 😅 do I still have a shot at 9+? Also tysm for the reply"
    },
    {
      "id": "m011gu3",
      "body": "If u ace isa2 and esa u still have a shot. Maybe pray relative grade in math pushes ur grade up to S"
    },
    {
      "id": "m01g16m",
      "body": "Usually, it's easier if you mention your average/median score. Anyway, a 170 means you're comfortably crossing 25 in each course. \n\nYou still have a good shot at 9+. If you get the same score in ISA2 and a full 10 in assignments, that scales to 25/2 + 25/2 + 10 = 35/100. A 9+ means you need at the minimum, A grade in all courses. An A grade is mapped to 80-89. So you need atleast 80 out of 100. Since ESA is scaled to 50% you get this equation: 35 + ESA/2 > 80, so ESA > 90. \n\nThis is if you continue your current performance in the next ISA 2 as well. If you do better, the requirement for A grade also decreases from 90 to probably around 85. \n\nNote: all of this is in the FAQs. We understand you're anxious about whether you can get a certain GPA, but these questions aren't new and are posted every year, which is why there's a detailed FAQ section about how to compute your GPA and how to find what scores you need for the certain GPA. In fact, you wouldn't have even needed to make this post because there's a calculator linked in the post that does all this for you."
    },
    {
      "id": "m01qgvw",
      "body": "Thanks a lot! I struggled to use the cgpa calc hence the post. So sorry!"
    },
    {
      "id": "m01rw67",
      "body": "No problem. If you need help with the calculator, you can DM me. I'm the one who created it."
    },
    {
      "id": "m01sopb",
      "body": "My average is 28.5 on 40. Thanks for the reply."
    }
  ]
}