{
  "id": "1h6dz5f",
  "title": "Modern Infrastructure of PES University..!",
  "content": "",
  "metadata": {
    "author": "Gracious_Heart_",
    "url": "https://v.redd.it/k8vjrg0wit4e1",
    "permalink": "/r/PESU/comments/1h6dz5f/modern_infrastructure_of_pes_university/",
    "score": 99,
    "created_utc": 1733312139,
    "flair": "Pride Of PESU",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "m0cs09w",
      "body": "jawahar hired bots, now thats a new low."
    },
    {
      "id": "m0ct0hz",
      "body": "Nice try doredaddy"
    },
    {
      "id": "m0ct3tv",
      "body": "but you do have to admit, it does look really good."
    },
    {
      "id": "m0cteux",
      "body": "Plz Come from your Original account"
    },
    {
      "id": "m0ctx9v",
      "body": "PR game in Reddit now after newspaper ads and google ads"
    },
    {
      "id": "m0cvk30",
      "body": "Did I just see the iron throne ? 💀\n\n I'm all in for Dore Dargaryen"
    },
    {
      "id": "m0cwq0h",
      "body": "We got PES Propoganda before GTA VI"
    },
    {
      "id": "m0czmr4",
      "body": "do one thing : add some infrastructure clips of pesu ecc campus and then make a even better vid by hiring a guy who can edit insane. Gotta mislead those 12th grade naive innocent jee kcet bots"
    },
    {
      "id": "m0d3n3x",
      "body": "PES EC students crying in the corner..😂"
    },
    {
      "id": "m0d4oum",
      "body": "😅😅😅😅"
    },
    {
      "id": "m0d6u7n",
      "body": "You could've also written about the \"updated syllabus\" and how we're going to pass iitb by 2069"
    },
    {
      "id": "m0d9nmv",
      "body": "We will get pesu hookah bar edits before gta 6 at this rate🥶"
    },
    {
      "id": "m0dbbe1",
      "body": "\\*PES University, RR campus, yes"
    },
    {
      "id": "m0dffjn",
      "body": "I know it’s popular to troll on PESU but the facilities in the new building are actually top notch.\n\nI had a chance to properly tour the new building before I left for higher studies in the states. The PESU RR campus is way better than my campus here."
    },
    {
      "id": "m0djmy7",
      "body": "Lol🤣🤣"
    },
    {
      "id": "m0dmo36",
      "body": "i am so used to negativity on this sub that i thought this was a troll , positivity once in a while is nice."
    },
    {
      "id": "m0doiy9",
      "body": "Dorediddy"
    },
    {
      "id": "m0ds7eb",
      "body": "Meanwhile us at rv hving cs lab in shed🤡🤡and washrooms with water=0"
    },
    {
      "id": "m0ee83r",
      "body": "The infra is good but The sheer number of people on campus bottlenecks our ability to utilize most of it\n\nThere are crowds equivalent of whole rvce batches in gjbc canteen in lunch hours\n\nThis was the crowd in front of the exam hall 25 minutes before the exam the crowd continues up the stairs as well\n\nhttps://preview.redd.it/wik8ekqdbv4e1.jpeg?width=3072&format=pjpg&auto=webp&s=6245f68319661c9dac24de8e78cea2dfcd91e825"
    },
    {
      "id": "m0es19o",
      "body": "The PR is working day-night these days"
    },
    {
      "id": "m0eukp7",
      "body": "How do you think they’re financing all this construction :)"
    },
    {
      "id": "m0f8y2i",
      "body": "bad pstd bro, since i joined this collage I lost my happiness"
    },
    {
      "id": "m0hxmxa",
      "body": "Aint no Party like a Dore Party"
    },
    {
      "id": "m0kbp5y",
      "body": "nothing can beat manipal."
    },
    {
      "id": "m0nmc2i",
      "body": "The iron throne is in Doredaddy's landing"
    },
    {
      "id": "m0uk56u",
      "body": "I'm in pesu EC campus. The whole campus is like egypt themed for sure"
    },
    {
      "id": "m4tudr6",
      "body": "This is a scam don’t fall for the infrastructure or later you’ll get pegged by the management in all possible ways"
    }
  ]
}