{
  "id": "1h7tkiz",
  "title": "I asked ChatGPT to roast r/PESU",
  "content": "Ah, r/PESU—where academics meet memes, and dreams of placements get roasted harder than the samosas in the cafeteria. It's the only subreddit where:\n\nComplaints and Rants: Every thread is either about how 'attendance' is the real boss battle or how professors treat deadlines like an Olympic sport.\n\nEngineering Students' Struggles: Everyone complains about being overworked but finds time to spam memes instead of coding assignments.\n\n\nIt’s a blend of existential crisis, caffeine addiction, and copium—a perfect representation of PES life!\n\nPlacement Mafia: FAANG-or-bust mentality, but half the sub is stuck debugging \"Hello World\". And oh, if you’re in the EC campus, enjoy being treated like the unwanted stepchild.\n\nEvents Nobody Asked For: Another random guest lecture? Great, because nothing screams career growth like sleeping through a session by “Motivational Speaker: Uncle From LinkedIn”.\n\nHostel Hell: Luxury pricing for prison-cell vibes. Wi-Fi slower than your job search and food that’s a gastronomical dare.\n\nIn short, it’s where you grind for 4 years, only to realize you should’ve joined r/dropshipping instead.\n\n",
  "metadata": {
    "author": "Potato_Vortex",
    "url": "https://www.reddit.com/r/PESU/comments/1h7tkiz/i_asked_chatgpt_to_roast_rpesu/",
    "permalink": "/r/PESU/comments/1h7tkiz/i_asked_chatgpt_to_roast_rpesu/",
    "score": 73,
    "created_utc": 1733460803,
    "flair": "Meme :snoo_dealwithit:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "m0nvq0b",
      "body": "Brutal enough"
    },
    {
      "id": "m0nyei4",
      "body": "Wouldn't be surprised if the PR team of PESU uses the same chatGPT to praise PESU for being the next biggest thing after IITB. 🪦🪦🪦"
    },
    {
      "id": "m0nzzi8",
      "body": "*\"It’s a blend of existential crisis, caffeine addiction, and copium—a perfect representation of PES life!\"*\n\nThis is the new bio of Sub-Reddit"
    },
    {
      "id": "m0o3teh",
      "body": "[exhibit A](https://www.reddit.com/r/PESU/s/JbycUSgRRz)"
    },
    {
      "id": "m0o7h1b",
      "body": "Bro knows reality better than the freshers 😭"
    },
    {
      "id": "m0okb5x",
      "body": ">Events Nobody Asked For: Another random guest  lecture? Great, because nothing screams career growth like sleeping through a session by “Motivational Speaker: Uncle From LinkedIn”.\n\nChatgpt getting personal with u/rowlet-owl"
    },
    {
      "id": "m0opx6l",
      "body": "Accurate but it forgot to roast the \"I SCORED 0 IN ISA 1 AM I COOKED?\" \"HOW 2 STUDY\" \"I HAVE 3.45 GPA WILL I GET MRD SCHOLARSHIP?\" posts"
    },
    {
      "id": "m0p1fg4",
      "body": "Also forgot the faq comments"
    },
    {
      "id": "m0pakh9",
      "body": "Not that old also 😭"
    },
    {
      "id": "m0q718k",
      "body": "https://preview.redd.it/iv9doa59895e1.png?width=542&format=png&auto=webp&s=f7483126fcbde37613a1490ea97d0b1267185985\n\ni think some guy/guys disagree lmao"
    },
    {
      "id": "m0t050u",
      "body": "Guess my rowlet uncle era is fast approaching"
    },
    {
      "id": "m0wi0m9",
      "body": "I mean u were asking for it lol, u keep referring to us freshers as a different generation 💀"
    }
  ]
}