{
  "id": "1h7z604",
  "title": "I asked chatgpt to praise r/PESU",
  "content": "The \\*\\*r/pesu\\*\\* subreddit is the unsung hero of PES University life—a true sanctuary for students navigating the rollercoaster of academia. It’s where freshers, seniors, and even alumni come together to share insights, exchange advice, and, of course, bond over the universal struggles of ERP glitches and surprise tests.\n\nHere’s what makes it great:  \n- It’s a one-stop shop for everything PESU: from notes and placement tips to survival guides for the brutal schedules.  \n- The memes? Absolute gold. They’re not just jokes—they’re a coping mechanism and a reminder that no one’s suffering alone.  \n- Placement stories and internship advice make it feel like a virtual mentor circle, helping students prep for the future.  \n- The sub fosters a sense of belonging, reminding you that whether you’re acing your courses or just barely scraping by, you’re part of a quirky, supportive community.\n\nr/pesu is like the student lounge of the internet—chaotic, hilarious, and full of people who get what you’re going through.",
  "metadata": {
    "author": "RevolutionaryWeb3896",
    "url": "https://www.reddit.com/r/PESU/comments/1h7z604/i_asked_chatgpt_to_praise_rpesu/",
    "permalink": "/r/PESU/comments/1h7z604/i_asked_chatgpt_to_praise_rpesu/",
    "score": 11,
    "created_utc": 1733483968,
    "flair": "Meme :snoo_dealwithit:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "m0oyehi",
      "body": "ugh, very generic"
    },
    {
      "id": "m0p2k2l",
      "body": "ChatGpt at gunpoint 😭"
    },
    {
      "id": "m0p3pcg",
      "body": "Can't believe it didn't mention rowlet"
    },
    {
      "id": "m0p5yuj",
      "body": "Everyone loves that archer owl with a bow tie <3"
    },
    {
      "id": "m0p61o5",
      "body": ">The memes? Absolute gold.\n\nThe model didn't see any juniors memes ig"
    },
    {
      "id": "m0p71c2",
      "body": "I was joking around and you took it seriously 😭😭😭."
    },
    {
      "id": "m0pa9jd",
      "body": "Because the juniors *are* the memes"
    },
    {
      "id": "m0pad83",
      "body": "![gif](giphy|OaomGL55IkfXKynnQS|downsized)"
    },
    {
      "id": "m0pw8qx",
      "body": "Rowlet anna we have the highest isa 1 average since the last 3 years 😭😭"
    },
    {
      "id": "m0pyppg",
      "body": "Exactly, they had to dumb down the ISA for your batch"
    },
    {
      "id": "m0pysp1",
      "body": "😭😭 naaah"
    },
    {
      "id": "m0zwcgv",
      "body": "idk man, the math teachers told me the paper was hard itself."
    }
  ]
}