{
  "id": "1h81w0s",
  "title": "Did any of you get the Spotify student discount?",
  "content": "Do we have to enter our '.pes.edu' mail id or to upload our ID or something?",
  "metadata": {
    "author": "PYUchiha7",
    "url": "https://www.reddit.com/r/PESU/comments/1h81w0s/did_any_of_you_get_the_spotify_student_discount/",
    "permalink": "/r/PESU/comments/1h81w0s/did_any_of_you_get_the_spotify_student_discount/",
    "score": 23,
    "created_utc": 1733493380,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "m0phgm1",
      "body": "I tried a hundred times and stupid shit didn't work for some reason. Worked for some friends though.\n\nI got the family plan though (180 per month for 6 accounts) and split with my friends, so I pay 30 now."
    },
    {
      "id": "m0phxnc",
      "body": "U have to verify thru sheerID, use ur \".pes.edu\" mail. Afaik that's it."
    },
    {
      "id": "m0pi3my",
      "body": "So how did they do?\n\nThru mail?"
    },
    {
      "id": "m0pigwz",
      "body": "One of them uploaded a pic of their ID card I think. They did it even before pesu mail IDs were given out for our batch last year."
    },
    {
      "id": "m0pihr5",
      "body": "Yes enter ur pesu mailId and submit a photo of ur ID card"
    },
    {
      "id": "m0pjkd8",
      "body": "Use your library login creds. That’s what worked for me"
    },
    {
      "id": "m0pmrcn",
      "body": "I've been using Spotify student ever since I joined PES in 2021. You have to use your [prn@pesu.pes.edu](mailto:prn@pesu.pes.edu) to login to SheerID. There it will prompt you to some weird website from PES itself where you'll have to enter your PRN and the password (given to you from your librarian). If not then you can send a photo of your ID card or something."
    },
    {
      "id": "m0pvpu2",
      "body": "I used it through my entire engineering, I forgot exactly but that one part where you have to log in to sheer and it asks college id, I think you have to give the PRN found in the back of your id card"
    },
    {
      "id": "m0qbw5d",
      "body": "I did it last week and all you need is your email."
    },
    {
      "id": "m0qgias",
      "body": "which plan if you don't me asking? 30rs is mad cheap"
    },
    {
      "id": "m0qjc3x",
      "body": "Family plan (6 premium accounts for 180 a month). I split with 5 others, so it's 30 per person."
    },
    {
      "id": "m0qm4qr",
      "body": "i just uploaded a pic of my id card using that sheer id thingy.... didnt need pesu email"
    },
    {
      "id": "m0r1t6p",
      "body": "I got it a year back lol. With your student id card verified you get to pay only 59 rs. a month. It's a little buggy process tho."
    },
    {
      "id": "m0rm66u",
      "body": "ahh okay, makes sense"
    },
    {
      "id": "m0txax9",
      "body": "where do i see my 'pes.edu' email id?"
    },
    {
      "id": "m0u1lff",
      "body": "I am not getting scholarship from past 1 year and u r worried about student discount🙃🎀"
    },
    {
      "id": "m0u8a0c",
      "body": "There's a better option. Just find 4 more friends who want premium and get the spotify family thing. It's less than 1 rupee per day and it lasts for the whole year. That's what almost everyone ik did"
    },
    {
      "id": "m0uw84m",
      "body": "It worked for me i just sent them a picture of my fee receipt by blurring out bank details. Sheer id js something to trust so shoot ur shot. Dm if u have doubts 🫂"
    }
  ]
}