{
  "id": "1h9gi34",
  "title": "AITH to ask my 21M boyfriend to cut off his 28F sister",
  "content": "I'm 21F and my boyfriend is 21M. We have been dating for 2 years now. From the beginning he used to share every tiny detail about his life to his sister and so did she. He used to take her advice on how to react when we had fights and used to buy what she tells l'd like for my birthday. This was fine until her involvement started being negative. She started saying that girls usually get bored after a certain point, when he used to ask her opinion when we fought. This slowly started pissing me off so much. I addressed this issue with him. I told him that I don't like his sister and her involvement in his life bothers me. He got extremely defensive and started saying stuff like \"she's my sister obviously I can ask her her opinions\". I lost my patience and said rude stuff like she's a slut and all. There is where I think I could have been the asshole. He started shitting on my family too and this became a huge fight. After a month when things were cooled off I found a video on his phone where his sister called me a \"kaali chudail\". I checked the date of this video and I realised it was before I had addressed that her involvement in his decisions irritated me. I got very mad that he supported his sister knowing very well what she's been saying behind my back. Am I the asshole to ask him to cut her off completely after I found the video?",
  "metadata": {
    "author": "Quiet-Ad6740",
    "url": "https://www.reddit.com/r/PESU/comments/1h9gi34/aith_to_ask_my_21m_boyfriend_to_cut_off_his_28f/",
    "permalink": "/r/PESU/comments/1h9gi34/aith_to_ask_my_21m_boyfriend_to_cut_off_his_28f/",
    "score": 0,
    "created_utc": 1733655578,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "m10k124",
      "body": "girl what does this have to do with this subreddit 😭"
    },
    {
      "id": "m10k5ku",
      "body": "https://preview.redd.it/izh31q4mwl5e1.jpeg?width=487&format=pjpg&auto=webp&s=50f459ea137dafad5b634a4bfa00ab446e43b6ad"
    },
    {
      "id": "m10kneo",
      "body": "Get this crap off of here"
    },
    {
      "id": "m10kpcz",
      "body": "r/lostredditors"
    },
    {
      "id": "m10kqqg",
      "body": "When did this subreddit become this😭"
    },
    {
      "id": "m10l0b0",
      "body": "Yes you are the asshole, get off this sub asap"
    },
    {
      "id": "m10l0bu",
      "body": "WOMP WOMP 🤡🤡"
    },
    {
      "id": "m10l90r",
      "body": "This is insult to all pesticles who genuinely rant here about the college go take your fight elsewhere"
    },
    {
      "id": "m10wsp7",
      "body": "I thought I opened r/Amitheasshole"
    }
  ]
}