{
  "id": "1hb1b4h",
  "title": "How was ML esa",
  "content": "\n\n[View Poll](https://www.reddit.com/poll/1hb1b4h)",
  "metadata": {
    "author": "Strange-Slide-5300",
    "url": "https://www.reddit.com/r/PESU/comments/1hb1b4h/how_was_ml_esa/",
    "permalink": "/r/PESU/comments/1hb1b4h/how_was_ml_esa/",
    "score": 8,
    "created_utc": 1733835931,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "m1cxwke",
      "body": "Always add a results option"
    },
    {
      "id": "m1d437s",
      "body": "by far the worst paper till now in PESU ... bitches had so many topics to ask from HMM , ANN , Naive Bayes , RNN dimensions etc but guess what they asked from fuckin gradient descent,EM and GMM(which was told to us its self learning and isnt even coming (It wasnt there in some profs. ML drive too .  \nGone ML grade I hope its relative"
    },
    {
      "id": "m1dsa8f",
      "body": "Wait that's weird, they said a self-learning component *wouldn't* be there in the exam? For us (at least back then), a self-learning component was always considered part of the syllabus, so there was always a chance of it appearing in the exam."
    },
    {
      "id": "m1du8yj",
      "body": "we got a mail from the anchor that said no self learning topics would be asked and 10% of the marks would be from lab, neither of which they ended up following and threw us all off track."
    },
    {
      "id": "m1duinj",
      "body": "Ah okay that sucks. PES can throw a curveball sometimes, or most of the time. \n\nAlso weirdly your usernames are related lmao"
    },
    {
      "id": "m1dw2od",
      "body": "https://preview.redd.it/6gvmgwap026e1.jpeg?width=259&format=pjpg&auto=webp&s=c2f3a609632b9bfc79a5277980cfbb90ce2ca348"
    },
    {
      "id": "m1e5dll",
      "body": "I backpropagated the shit out of slides whole fucking night and this mfs didn't even mention it ."
    },
    {
      "id": "m1eigcp",
      "body": "Nange yeshtu cheap agi ansbidtu Andre, tho ee Tara nu irtara Jana antha😭😭😭\n\nI mean what's the whole point of a self learning component if u don't wanna ask that / evaluate it at some effin point.None of the so called important concepts showed up"
    },
    {
      "id": "m1eocl3",
      "body": "It might be because you did not update the weights in your brain /j"
    },
    {
      "id": "m1gpx8o",
      "body": "https://preview.redd.it/50j8tq2ts46e1.png?width=2002&format=png&auto=webp&s=1d32978369c2112c0bb15e8f15aceadd0ad3c5ae\n\nThat ALL THE BEST was a warning :skull"
    },
    {
      "id": "m1nptxh",
      "body": "Sad, our batch paper was good though"
    }
  ]
}