{
  "id": "1hb1pc7",
  "title": "We are very sad that former CM passed away 🥺🥺🥺So we would like to remind you guys to come to clg tmr 😀😀😀",
  "content": "",
  "metadata": {
    "author": "SecondFade",
    "url": "https://i.redd.it/aoc1te6lv06e1.png",
    "permalink": "/r/PESU/comments/1hb1pc7/we_are_very_sad_that_former_cm_passed_away_so_we/",
    "score": 169,
    "created_utc": 1733837215,
    "flair": "ANNOUNCEMENT :snoo:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "m1ctxl7",
      "body": "https://preview.redd.it/zpgyxtlpx06e1.png?width=361&format=png&auto=webp&s=a369543519b6372f2e62cfbe4de7ec602148ddfa"
    },
    {
      "id": "m1cvx0t",
      "body": "Bhai hadd hai, ek din chutti de diya to kya chala jayega. (Wo bhi half day!!!)"
    },
    {
      "id": "m1cz1sn",
      "body": "I think by now all of us know how pes is, idts its worth to even make a post about this!"
    },
    {
      "id": "m1d5ymo",
      "body": "Take it from a grad: PES doesn't give holidays unless they absolutely *have* to. There are both pros and cons to this."
    },
    {
      "id": "m1db19x",
      "body": "What's the pros"
    },
    {
      "id": "m1dbyvq",
      "body": "They don't ask us to come on odd days just to compensate for the lost classes. Even some teachers can't afford to have missed a few classes cuz of their subject's syllabus."
    },
    {
      "id": "m1dbyzr",
      "body": "Multiple, all in our favour:\n\n1. Since there are few holidays during the year, you get a large contiguous 2.5 month summer break. No other college gives such a long break during summer. People travel, pursue internships or even take time off during this long break. You can do a LOT with 2.5 months.\n\n2. Back during COVID, PES was the only college to not be affected by delays or changes to its schedule because it kept offline exams. We started our placement cycle on time and everyone got placed as per usual timelines. Other colleges weren't as fortunate, some lagged by an entire semester behind us and their placements got delayed. Additionally, because we were able to finish 3rd year on time, it gave people those few weeks before final year (and placement season began) to actually prepare (albeit last minute) for placements. \n\n3. You'll never have classes on Saturdays (unless in exceptional cases) and the syllabus will for the most part always be completed before the ESAs. You'll never need any compensatory classes on weekends or otherwise to finish portions."
    },
    {
      "id": "m1del9b",
      "body": "> you get a large contiguous 2.5 month summer break.\n\nhein really? but our 2nd sem begins from 10th Feb."
    },
    {
      "id": "m1devgx",
      "body": "bro he is talking about even sem breaks"
    },
    {
      "id": "m1dfi8y",
      "body": "ah right.. mb. So after 1st year end, a break of atleast 1 month can be expected?"
    },
    {
      "id": "m1dgfgx",
      "body": "More than that ours was almost 3 months at the very least you guys will get 2 months"
    },
    {
      "id": "m1dgrwf",
      "body": "apparantly its standard for an even semester to start the first or second week of august, and we're already lagging this year cause of kcet fuck up so the only way we can get back up to speed from next sem is by cutting short our 2.5 month vacation:   \nit'll start feb 10th, possibly march last week or april first week we'll have ISA-1, then may last week or june first week we'll have ISA-2 and our second sem will be over by june end or july first week, so we'll get 3-5 weeks of holidays after first year."
    },
    {
      "id": "m1duttx",
      "body": "IIT madras gives may 10th - July 28th, around 2 months 20 days"
    },
    {
      "id": "m1dvbo4",
      "body": "What? 2027 students had a break from late June to the start of August, ie around one and a half months. I doubt these juniors will even get a month with how late they started. The 2.5 month break can be reliably expected from 4th sem."
    },
    {
      "id": "m1gopwm",
      "body": "Retarded clg, man who does this. "
    },
    {
      "id": "m1klthu",
      "body": "Did they not think once before clicking send"
    },
    {
      "id": "m1n20hf",
      "body": "Many people had exams so it would fuck up everyone's schedules. I have a friend who is travelling to visit family abroad and if they rescheduled he'd half to pay 3 lakhs to get a new ticket"
    }
  ]
}