{
  "id": "1hcktp4",
  "title": "Is there relative grading for AIML ",
  "content": "I am in 3rd sem rn. Was there relative or did you get higher grade than what you were supposed to for any subject.",
  "metadata": {
    "author": "CarpenterMysterious6",
    "url": "https://www.reddit.com/r/PESU/comments/1hcktp4/is_there_relative_grading_for_aiml/",
    "permalink": "/r/PESU/comments/1hcktp4/is_there_relative_grading_for_aiml/",
    "score": 21,
    "created_utc": 1734009231,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "m1oribp",
      "body": "I really do hope we have relative grading. My isa 2 marks are really bad"
    },
    {
      "id": "m1otyv6",
      "body": "Exactly, apparently aiml and ece might not have cuz our  branch strength is only 380 something"
    },
    {
      "id": "m1oxpvs",
      "body": "It depends on the course and how the batch performs in it. Relative grading is applied on a per-course basis."
    },
    {
      "id": "m1oyr0r",
      "body": "As long as it depends on the marks its fine, cuz pretty much no one got above 33 in isa"
    },
    {
      "id": "m1oyx38",
      "body": "It depends on the overall score that's obtained. Can't predict with just ISA marks. Plus, PES isn't transparent about these things either."
    },
    {
      "id": "m1p13di",
      "body": "Yeah, only if they could display everything properly"
    },
    {
      "id": "m1p69ta",
      "body": "I don't think it is dependent on the strength of the batch"
    },
    {
      "id": "m1p6jof",
      "body": "I dont know. A senior told that their ece didnt have relative grading cuz of strength"
    },
    {
      "id": "m1p7ff6",
      "body": "Oh but isn't that very stupid? Doesn't average matter the most? But then again we can never know."
    },
    {
      "id": "m1pcmir",
      "body": "Bruh when are CSE results coming? I just wanna get it over with lol"
    },
    {
      "id": "m1pvpl1",
      "body": "If the highest total score in the entire batch is below 95/100 (including both ISAs and ESA) there’s likely to be some form of relative grading—at least, that’s what Jawahar said. However, they’re highly unpredictable, so take it with a grain of salt."
    },
    {
      "id": "m1pwzuo",
      "body": "i have a feeling that these fools will release results 12 hours before webtech exam to mess with us."
    },
    {
      "id": "m1q8z5t",
      "body": "Yeah totally can happen lol  \nour WT teacher told me they have all finished correcting 2 days before itself"
    },
    {
      "id": "m1tr9b0",
      "body": "Ohh I am honestly not expecting much from them. But if what the chancellor said is true then we'll get relative grading unless someone ends up scoring 100/100 in the esa, because barely any people got 35 plus in both the isas"
    }
  ]
}