{
  "id": "1hcmhhg",
  "title": "Regarding PES Specialization certification",
  "content": "I am a currently a 3rd year. I was wondering how valuable is the specialization cert offered by PES after completions of said specialization courses.\nAlso, my CGPA is also around 8.07.Should I focus on scoring marks by taking some easy course or try getting the cert?\nAlso with this CGPA will I have hope for placements?",
  "metadata": {
    "author": "Frozen_chips1804",
    "url": "https://www.reddit.com/r/PESU/comments/1hcmhhg/regarding_pes_specialization_certification/",
    "permalink": "/r/PESU/comments/1hcmhhg/regarding_pes_specialization_certification/",
    "score": 7,
    "created_utc": 1734014349,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "m1p5geu",
      "body": "1. There's no evidence to show that it helps. Whether you're applying for Masters or for a job right after BTech, you'll not be able to submit it as part of your application since the certificate won't be available. Since it's as good as not being there, it doesn't help in any way. Even if you apply for Masters a few years later, that certificate will never be asked as part of your application. You can submit it as an \"extra\" document, but no evidence to show it helps. \n\nPick courses that you're interested in and want to study and learn, or courses that will help you from an industry point of view to get into specific job roles. Passion triumphs over everything else, and genuine interest in a course can often make the hardest of courses easier. I've said this before and I'll repeat it: most people including me tend to perform better at harder courses they're interested in compared to easier courses they dislike. To summarise, picking courses you like will not only allow you to follow your interests but also score higher."
    },
    {
      "id": "m1pkb20",
      "body": "Thank you for bringing clarity on the specialization topic.\nAnyway I'm trying to push my CGPA to 8.5 + , wish me luck 🍀"
    },
    {
      "id": "m1pkevb",
      "body": "Thank you for bringing clarity on the specialization topic.\nAnyway I'm trying to push my CGPA to 8.5 + , wish me luck 🍀"
    },
    {
      "id": "m1pncbn",
      "body": "No problem. All the best! This is the last time you can lift your GPA before your efforts stop mattering. Put in one last shove, you will thank yourself later :)"
    }
  ]
}