{
  "id": "1hdbzn3",
  "title": "Marks(imp pls)",
  "content": "u/rowlet-owl or someone please help.\n\n\nI got very bad in signals lower than what I thought my worst paper was which is ACD the thing is this was my second best paper or atleast I thought so but I have gotten way less lesser than average even my friends have gotten more than me by 8-9 marks is this some sort of ai grading or have they normalised the score because I am pretty sure I did enough to get 25 atleast.\n\n\nIs there anyway to contact about this discrepancy or should I have to wait till revaluation if there is a way to check my marks please let me know as I feel like there has been a huge mistake in grading my paper",
  "metadata": {
    "author": "robot8787",
    "url": "https://www.reddit.com/r/PESU/comments/1hdbzn3/marksimp_pls/",
    "permalink": "/r/PESU/comments/1hdbzn3/marksimp_pls/",
    "score": 16,
    "created_utc": 1734095846,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "m1v5ac1",
      "body": "They won't normalise just the ISA scores. You can go and review your ISA marks right? Just attend the review. That should give you a better idea."
    },
    {
      "id": "m1v6ur3",
      "body": "Ok after reviewing is there anything I must keep in mind"
    },
    {
      "id": "m1v87ol",
      "body": "Honestly, nothing really. If your marks don't increase even after review, you can try approaching the HOD/COE. Although I've never heard of anyone reviewing a review before lol. Good luck though."
    },
    {
      "id": "m1vab36",
      "body": "Ahh ok thanks"
    },
    {
      "id": "m1w2zym",
      "body": "I did not get the desired output in ACD lab exam. So will they give me zero marks??"
    },
    {
      "id": "m1wm61b",
      "body": "Not something I can answer, depends on their leniency while evaluating."
    },
    {
      "id": "m1wnbq4",
      "body": "Did someone get zero marks in ACD lab exams?"
    },
    {
      "id": "m1wnutz",
      "body": "Bossman you need to stop asking me questions which I have no way to answer. You should know that in general, it *is* possible to get 0 in lab marks. Now has someone got it in that specific course? No clue. I don't go around and keep a record of everyone's ACD lab marks."
    },
    {
      "id": "m1zosth",
      "body": "What is the max grade you can score in backlog?\nOr the max grade offered in backlog is B?"
    },
    {
      "id": "m20b42a",
      "body": "U can score even a S but the thing is if u failed with internal marks no ways in hell will u get a S with just esa lmao"
    },
    {
      "id": "m20yizj",
      "body": "Thanks"
    },
    {
      "id": "m2barv8",
      "body": "Only in revaluation can you see papers. Most don't because there seems no point to pay n see it."
    },
    {
      "id": "m2batvw",
      "body": "S...but thats low."
    }
  ]
}