{
  "id": "1hddyy6",
  "title": "PESU and Couples ",
  "content": "What is up with pesu and couples on the campus. The bouncers and the watchmen just keep walking around and staring at a girl and a boy sitting like the bajrang dal on valentine's day. I noticed this today at the GJBC canteen. A guy was putting his arms around a girl's should and sitting and then a watchman walked in, scolded them in front of everyone with hand gestures and all. Soon after a bouncer and another watchman came in. All three scolded them, made a few calls, took their id cards and escorted them. Ig they were from the UG. I've seen Watchmen and bouncers walk around everywhere suspiciously so I just wanted to know wtf is up with that and why is pesu soo against couples \n",
  "metadata": {
    "author": "SuperConference9632",
    "url": "https://www.reddit.com/r/PESU/comments/1hddyy6/pesu_and_couples/",
    "permalink": "/r/PESU/comments/1hddyy6/pesu_and_couples/",
    "score": 75,
    "created_utc": 1734101790,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "m1v8ihy",
      "body": "They're jealous of you OP. Next time put an arm around the bouncer/watchman so they don't feel left out /s"
    },
    {
      "id": "m1vbq6y",
      "body": "Rightly done. College is not the place you should be making relationships. You come here for a job. You can't do these shit and then say \"Why am I not getting placed\". Plus doing arrange marriages are far better since you get dahej money and you can invest the earnings into other ventures and you'll easily make more money. PESU people think so much about you. Truly IIT Bangalore for a reason🥲"
    },
    {
      "id": "m1vex70",
      "body": "I hv seen ppl making out in the 4th floor canteen (ec) and don't get caught"
    },
    {
      "id": "m1vkspk",
      "body": "That's so true, bro people fuckin make out in the class and no one cares,"
    },
    {
      "id": "m1vl3pm",
      "body": "Were u the guy who put arms on some girl? /s"
    },
    {
      "id": "m1vl4p2",
      "body": "Many times couples cross limits while sitting in canteens, open places even in 13th floor library also... So they might be trying to stop the initial stages..."
    },
    {
      "id": "m1vl5tw",
      "body": "there's one couple in my section who r always smooching or some shit bruh no one wants to see 🤮🤮🤮"
    },
    {
      "id": "m1vn2q6",
      "body": "Go to oyo bro uve come here to study"
    },
    {
      "id": "m1vr779",
      "body": "Bruh are you fr"
    },
    {
      "id": "m1vrviz",
      "body": "Brother I've seen ppl making out on BE block 2nd floor staircase.\n\nWhat's even worse is me and that guy have mutual friends and I'm pretty sure he knows me."
    },
    {
      "id": "m1w5zg7",
      "body": "Who hurt you lil bro"
    },
    {
      "id": "m1w65pq",
      "body": "The last line of their comment implies the obvious sarcasm."
    },
    {
      "id": "m1w8rtd",
      "body": "I read the first few lines and was like bruh . Mb broski"
    },
    {
      "id": "m1w9ivh",
      "body": "u/Relative-Strike340"
    },
    {
      "id": "m1xmlsv",
      "body": "Dahej it seems 🤡. I'd rather see couples smooching than have people like you in the society"
    },
    {
      "id": "m1zurcv",
      "body": "Mahn idk what you're on about I've literally seen couples full on making out in public and the securities or bouncers say nothing..."
    },
    {
      "id": "m1zv019",
      "body": "bruh put /s at the end atleast.People wont understand sarcasm here and they will call u bhikari"
    },
    {
      "id": "m20drp3",
      "body": "PDA increased too much this year , i've seen couples smooching during garbha night fml 😭😭"
    },
    {
      "id": "m27bm4d",
      "body": "Pesu expects only ur girlfriend/boyfriend to be ur textbooks, go keep ur shoulder around books smh 🤦‍♂🤦‍♂"
    },
    {
      "id": "m2baotj",
      "body": "Because its not common here. This isn't America. But time at PES should be more on maintaining grades than all that. Don't except good grades if you don't put in the effort."
    },
    {
      "id": "m2tgb73",
      "body": "In EC they don't seem to care couples aren't everywhere or anything but i have not heard of managment getting involved abt these matters"
    },
    {
      "id": "mbocvpl",
      "body": "They are going to hell my brother "
    }
  ]
}