{
  "id": "1hdhiez",
  "title": "Wholesome moment",
  "content": "A guy in my class ( im in first year) is from a village in karnataka. He is real brainy. Spoke to him and got to know a few things - 1. he is in pes because this is the best college kcet was giving him via rural quota, 2. His father works in railways - for him coming to this college is fun because \"he gets to ride in the train from his village to bangalore junction for free\" , he lives in the hostel and says - the food here is not very nice because his mother cooks better, but the beds are soft and it has good electricity supply\". His goal is literally to earn enough every month after 4 years so that he can take his family to a 5 star cuisine every weekend. \n\nLife changes when you hear the views of everyone ! For us something out of our comfort zone and substandard might be someones luxury! Our basic \"enjoyment\" would be someones dreams! \n\nAlso to the retarded motherduckers - stop teasing folks from different backgrounds and quotas - cause bitch you aint anything better ! Learn to show respect and value someones opinion and not laugh on everything like a brain-rot drunkard. \n\nthis is through a anonymous throughaway account, you will not find me again here on r/PESU from this account or messaging anything further.",
  "metadata": {
    "author": "Alternative_Try867",
    "url": "https://www.reddit.com/r/PESU/comments/1hdhiez/wholesome_moment/",
    "permalink": "/r/PESU/comments/1hdhiez/wholesome_moment/",
    "score": 330,
    "created_utc": 1734111217,
    "flair": "Pride Of PESU",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "m1w0q4j",
      "body": "also by reading my post if you wouldve figured who i am - then dont hesitate to ask me on my socials - left a easter egg in the format of a word that only some folks know that i use ! \n\ncheers !!"
    },
    {
      "id": "m1w117m",
      "body": "Cute post"
    },
    {
      "id": "m1w1bqg",
      "body": "Damnn so cute!! ❤️❤️"
    },
    {
      "id": "m1w1yll",
      "body": "That's a wholesome story op. I wish him nothing but the best in the world. But you kind of ruined it when you mentioned about quotas. Of course you shouldn't discriminate anyone based on their ethnicity but then, what if another equally bright guy from his village, in general quota, missed out on PES because he didn’t have reservation? How would you feel about that?"
    },
    {
      "id": "m1w205b",
      "body": "Cute post fr🩵!!\n\nDefinitely something good to hear from the first years after a series of brainrot confessions"
    },
    {
      "id": "m1w31sp",
      "body": "bruh don't have to be a party pooper right now"
    },
    {
      "id": "m1w3db2",
      "body": "Bms"
    },
    {
      "id": "m1w3y2e",
      "body": "I think u misunderstood wt he said. Wt he said was to not discriminate people coming thru reservation or wteva, he didn't support reservation.."
    },
    {
      "id": "m1w5ays",
      "body": "its not hard to see that the word is motherduckers"
    },
    {
      "id": "m1w9lsu",
      "body": "We do have some good juniors here now . Thanks for restoring my faith op , this redemption was need after the series of brain rot stuff"
    },
    {
      "id": "m1wbn1p",
      "body": "This subreddit is healing. Love to read stories like this <3"
    },
    {
      "id": "m1wd5q9",
      "body": "That's not how rural reservation works for kcet anyone who studied 7 years or more in an educational institution in a rural area will get it. So if an equally good student from the same village studies in the same institute even he will get it."
    },
    {
      "id": "m1werr4",
      "body": "Finally something refreshing to hear. A breathe of hope for this subreddit 🙏🏼🙏🏼🙏🏼."
    },
    {
      "id": "m1weszn",
      "body": ">Also to the retarded motherduckers - stop teasing folks from different backgrounds and quotas - cause bitch you aint anything better ! Learn to show respect and value someones opinion and not laugh on everything like a brain-rot drunkard.\n\nThank You for saying this. people really don't realize how privileged they are."
    },
    {
      "id": "m1wfma6",
      "body": "really wholesome :))"
    },
    {
      "id": "m1wsazn",
      "body": "I hope he achieves his dream, such a down to earth wholesome guy"
    },
    {
      "id": "m1ymyli",
      "body": "Niceeee"
    },
    {
      "id": "m1yvoco",
      "body": "Aw, that's so niceee. I really hope he gets whatever he's wishing for :)"
    },
    {
      "id": "m1z6h8f",
      "body": "this is so wholesome honestly,im happy to know that atleast some of my batchmates are mature enough to understand this"
    },
    {
      "id": "m1z7rwg",
      "body": "This is so cute😭"
    },
    {
      "id": "m1z96zn",
      "body": "As a senior from PESU, it's really good to hear such stories. Hopefully the glitz and glamour of the city and its people does not distract this person. As someone who has been in a similar boat a few years ago, i can assure that things can go either way. I hope his guiding angels keep him on track."
    },
    {
      "id": "m1zaib2",
      "body": "Finally a good post after a very long time. Awww so cute post"
    },
    {
      "id": "m1zf070",
      "body": "🙂‍↕️finally someone"
    },
    {
      "id": "m1zhr1g",
      "body": "Bro this is really a wholesome moment reading this story!!\n\nHope all his dreams do come true one day 🤞"
    },
    {
      "id": "m1zldso",
      "body": "This is so wholesome <3 🥹"
    },
    {
      "id": "m20iw9p",
      "body": "\"Our sub standards might be someone's luxury\"\nVery well said"
    },
    {
      "id": "m20k4om",
      "body": "I love to hear stories like this. So many people in PESU are richf\\*\\*ks with absolutely no idea that so many people come to college from backgrounds like this. Me being a KCET student, I got to see many students like these in first sem when it was all KCET and there were some people who were totally oblivious to things like these in second sem. I lie somewhere in between both of them, but I feel grateful for everything that I have and I feel so guilty that I am not trying hard enough when I look at them studying so hard to make their parents happy :\\_ ) ."
    },
    {
      "id": "m20lprq",
      "body": "You and that guy are the type of people I strive to meet more in PESU, not those motherduckers, cuz it really gets disappointing in here with them around and domineering such sweet folks around. Thank you for writing this post :)"
    },
    {
      "id": "m24vp7e",
      "body": "Good to see this post .,"
    },
    {
      "id": "m2b7q6g",
      "body": "Damn, well said man"
    },
    {
      "id": "m3vecxz",
      "body": "corny ass username checks out"
    }
  ]
}