{
  "id": "1hdh7b1",
  "title": "HELP YOUR BOY OUT",
  "content": "As a JEE double dropper with a previous JEE score of 99.2% and a JEE Advanced rank of 5000, my primary aspiration has always been to secure admission to IIIT Hyderabad for their  Computer Science degree However, achieving the necessary percentile (99.94%)  is very hard as I always fall short. ( I hate chemistry)\n\nI can get into IIIT HYDERABAD through ugee exam which is for dual degree  5 year program\n(btech in cse and ms in cse )which will set me back 16 lakhs and it's hectic as hell( I have few friends there)\n\nThe problem is  I have always wanted to do my masters from abroad . It's part of my bucket list.\n\nI have seen many people on LinkedIn who have studied in NIT suratkal, pes are currently doing masters in ivy league college in usa\n\nShould I simply forget about IIIT HYDERABAD and save 16l and do my bachelor's from nits or pes or rv  for much cheaper price and do my master's abroad in ivy league and invest my money there\n\nI reside in Bangalore and pes ec campus is very close by\n\nI am particularly interested in understanding the success rates of students from these colleges in securing admission to top-tier universities abroad, such as Ivy League institutions. I would appreciate insights into the level of academic rigor and the necessary steps involved in achieving this goal, including research experience.",
  "metadata": {
    "author": "averagehuman545",
    "url": "https://www.reddit.com/r/PESU/comments/1hdh7b1/help_your_boy_out/",
    "permalink": "/r/PESU/comments/1hdh7b1/help_your_boy_out/",
    "score": 15,
    "created_utc": 1734110403,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "m1vyc9h",
      "body": "Why are  you considering pes if you have a 99.2 percentile?"
    },
    {
      "id": "m1vysfy",
      "body": "Nit suratkal is my first priority. Pes ec campus is very close to my home and it's very cheap if I get through kcet. 80k/year ig..I have seen many pes passouts in LinkedIn doing masters in top ivy league universities. So I want to know  how realistic it is???"
    },
    {
      "id": "m1vzdyx",
      "body": "The crowd in pes nowadays 🤐"
    },
    {
      "id": "m1vzz9h",
      "body": "Can you give elaborate please!!! How many people actually get into the Ivy League from pes?? I have seen many people say placements at pes is amazing and also find that average is around 8lpa( don't quote me on this)"
    },
    {
      "id": "m1w097o",
      "body": "I have no idea abt masters or wt ever ivy league shit, but placements are quite good and the avg is twice of the number you mentioned, hope this helps"
    },
    {
      "id": "m1w0bs6",
      "body": "It’s 103k + optional 10k for the scholarship"
    },
    {
      "id": "m1w0tyx",
      "body": "Ohh thanks .. I stand corrected"
    },
    {
      "id": "m1w4a3k",
      "body": "May I ask why you dropped despite having such a high percentile? I'm just curious, don't mean any harm."
    },
    {
      "id": "m1w51yd",
      "body": "Sure no problem. Most of my friends got into IITs . That's too many of them cse and ece. So I decided I will either get into IIT or IIIT HYDERABAD. I want to study in a tier 1 college as I plan on getting into research later. Tier 2 collegs  usually have less to no research culture."
    },
    {
      "id": "m1w9lq5",
      "body": "I can’t help you regarding IIIT vs PES, but I graduated in 2021 and I saw so many of my batchmates pursue masters in the USA, several attending top schools. \n\nIn terms of what they did, the ones who went to the top schools had great CGPAs, did good research in clubs and under good professors to get great LORs and did good summer internships.\n\nAs for me, I’m pursuing my MBA from a top B school in the states. For MBA, it’s more about the work experience you have after UG and PESU is quite good for placements. I didn’t really do any of those previously mentioned things at PES but did other stuff after graduating.\n\nSo all in all, going with PES is not a bad choice. Its definitely a great university and can be a great platform to leverage to go for a prestigious masters in the States"
    },
    {
      "id": "m1wbknn",
      "body": "Thanks so much for the reply. I made a mistake of repeating one more year. Since most of my batchmates are in iits I thought tier 1 or nothing. I stand corrected. I'm really excited to join college and i wish you all the very best for your mba program. Could you explain why you made the switch?? From tech to finance. I have seen a lot of my seniors do this and I fail to understand why. Thanks again💗"
    },
    {
      "id": "m1wcm6l",
      "body": "You are better of in a nit or iiit pes ain’t worth the hassle neither are students of the quality you fine in nit’s."
    },
    {
      "id": "m1wcqnt",
      "body": "Can I pm"
    },
    {
      "id": "m1wmire",
      "body": "Get into NIT surathkal bro trust you don't wanna come here"
    },
    {
      "id": "m1wr7xy",
      "body": "My brother trust me you gonna feel mad fomo if u come here with that kinda jee score. I'm guessing at that score ud easily get at least a core branch in a good nit. \n\n\nGo with that, ONLY consider pes as a last option"
    },
    {
      "id": "m1wt6fm",
      "body": "Yea pesu definitely doesn't fit the bill of 'research oriented'.\nI'm a first year ec campus , 1st sem at ending next month.\nIt isn't all bad and gloom but definitely isn't anything close to what ur thinking.\n\n\nPes as a whole is academics oriented, few fests.\n\n\nI'm sure somebody like rowlett owl had posted more info about research situation on the faqs. Not sure , check the faqs out anyway they're quite good.\n\n\nEc campus sometimes feels like it's getting the unwanted child treatment.\nYk with rr or the 'main' campus getting something or the other rebuilt.\nInfra at ec is very new and isn't much compared to rr.\n\n\nIon abt the ivy league part , dk where u heard that part from.\nAnyway if u really want to come to pes, try for rr branch."
    },
    {
      "id": "m1xdkrv",
      "body": "Don’t cheap out on your college man. You have some great options on your hand. Select the college that offers the branch of your choice. Doing your masters abroad depends on your research publications, projects, GRADES, and a fuck ton of luck. It does not matter where you graduate from (given the choices you have). Pick the right college for you and work hard."
    },
    {
      "id": "m1xwl8h",
      "body": "Could you elaborate on why. The only reason I am considering pes is it's cheap through kcet and very close to where I live."
    },
    {
      "id": "m1xxd10",
      "body": "Thanks bro. The only reason I considered pes is it's cheap and the ec branch is close by. I only have pes as my backup. If I get IIIT HYDERABAD then I will go with that or else suratkal. Thanks for replying 💝💝"
    },
    {
      "id": "m1yhvq6",
      "body": "It was a personal choice for me. I, probably like many others, didn’t know what I wanted to do when I first joined PES. I was always trying to find out the right path for me by researching online, speaking to people in different fields, etc. Eventually I decided that I want to do finance. \n\nI had a good 4 years in my UG and began my career as a software engineer. By that time, I had figured out the things I needed to do to pivot to finance. Once I graduated, I did those things and built up work experience. Finally after 3 years, I applied for MBA programs and here we are"
    },
    {
      "id": "m1yjxg3",
      "body": "That's such an amazing journey!! I hope I have a blast at my undergrad too!!. Thanks for sharing your journey"
    },
    {
      "id": "m1ym5p4",
      "body": "Fair. All the best!\nDo dm me if u have any more qs"
    },
    {
      "id": "m1zaogl",
      "body": "many people with a good cgpa are in top ivy leagues.. and average package is around 18lpa this year"
    },
    {
      "id": "m1zatzi",
      "body": "better college life, pes is a bit stressful. not saying nit isn't, but i have a few friends there who seem to be having a pretty decent college life."
    },
    {
      "id": "m1zdcru",
      "body": "Better college life a better college itself in terms of almost everything,you'd probably have better chances at LORs and  recommendations through the teachers there . Seriously bro don't chicken out on NIT-S for PES"
    },
    {
      "id": "m1zlabb",
      "body": "Op, PES fees:\n1. CET 1.7LPA\n2. JEE 5LPA\n3. Management 12LPA\n\nSo via JEE it costs 20L for the degree. So I’m confused here, is IIIT Hyd 16LPA or for the degree?"
    }
  ]
}