{
  "id": "1hffwu6",
  "title": "What’s the most exciting or challenging subject you’ve encountered at PES University, and how has it shaped your academic journey so far?",
  "content": "",
  "metadata": {
    "author": "TheDoodleBug_",
    "url": "https://www.reddit.com/r/PESU/comments/1hffwu6/whats_the_most_exciting_or_challenging_subject/",
    "permalink": "/r/PESU/comments/1hffwu6/whats_the_most_exciting_or_challenging_subject/",
    "score": 23,
    "created_utc": 1734343461,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "m2b5e3c",
      "body": "Wrote webtech today (CSE paper) it has de-shaped the complete me"
    },
    {
      "id": "m2b5gas",
      "body": "True 😭"
    },
    {
      "id": "m2b7cn8",
      "body": "Big Data Elective"
    },
    {
      "id": "m2b7itt",
      "body": "same man just glad it's over"
    },
    {
      "id": "m2b7n03",
      "body": "Fr"
    },
    {
      "id": "m2b888e",
      "body": "Ddco. So good it annihilated my will to live."
    },
    {
      "id": "m2b9nv2",
      "body": "The most challenging - Math 1 and Math 2As I progress in the degree, I realize how mind blowing the topics were in that subject. \n\nThe most exciting - DDCO & MPCA  \nThe subject was spoiled due to constantly switching and/or bad teachers but when I studied for ESA from the textbook, the tricks humans have invented to make physics and electrons dance to our will is amazing. \n\nBoth of these ended up ruining my GPA though-"
    },
    {
      "id": "m2bdewj",
      "body": "Idk about shape but DDCO and CD will make you go out of shape for sure 🙏🏼🙏🏼."
    },
    {
      "id": "m2bftox",
      "body": "Engineering Physics and Linear Algebra by far the hardest subject, I just passed. Apart from that Biochem II, Molecular biology and Genetic engineering were the hardest of core subjects I have till now which have affected my grades. Maybe even Computational drug design."
    },
    {
      "id": "m2bgjxi",
      "body": "I'm going to 6th sem and literally every single senior is warning me about CD 😔"
    },
    {
      "id": "m2bglsj",
      "body": "CD is the final boss 🙃🙃."
    },
    {
      "id": "m2bnpmg",
      "body": "Compiler Design broke me so bad, I still get nightmares about it almost 4 years later"
    },
    {
      "id": "m2bpy1d",
      "body": "Amazing question; i had taken an elective in Mech; Product Design and Development and in the same sem, we had the hardest Thermodynamics subject.\n\nThat one sem and these 2 courses made me leave Mech (it is too theoretical for me)  and stated my journey into Product Management (currently a PM)"
    },
    {
      "id": "m2bqwfn",
      "body": "Elements of Electrical Engineering (Sem I) and Network Analysis and Synthesis (Sem 3)"
    },
    {
      "id": "m2buldq",
      "body": "Oh trust me, CD is usually far, far worse than expected. So if you think you're going to suffer, you're actually in for something even worse."
    },
    {
      "id": "m2bwcg0",
      "body": "Not helping man 😭"
    },
    {
      "id": "m2bwloo",
      "body": "In one way, it's good that you're going in well informed (about your destruction). Think of it as psychological preparation. Then when something bad does happen, you can simply shrug it off and say \"it is what it is\"."
    },
    {
      "id": "m2bwtk9",
      "body": "Damn, goes to show how subjective something like this can be. Elements of electrical engineering was the easiest course for me. Never really studied for it but still managed to score very well, while I've continuously bombed maths in 3 semesters."
    },
    {
      "id": "m2c21rl",
      "body": "Ddco is the worst nightmare ever for me :)"
    },
    {
      "id": "m2c32o7",
      "body": "Don't traumatise thy child. He's already got a reality check."
    },
    {
      "id": "m2c48lh",
      "body": "My whole purpose of living was to do this elective.\nIt's so good that it broke my soul and made me jump off the 5th floor instantly when I saw my assessment scores.\nHighly recommend 💯"
    },
    {
      "id": "m2cnq54",
      "body": "most exciting AFLL (automata and formal logic) and Physics   \nGot a great professor for physics and ended up scoring S : )) makes the effort worthy\n\nMost Challenging - nothing as of now : )  but pretty sure the courses will be more challenging in later semesters"
    },
    {
      "id": "m2coo0b",
      "body": "If you liked AFLL you'll love CD( Compiler Design)!"
    },
    {
      "id": "m2cvymi",
      "body": "CN, OS, MPCA, Cloud Computing definitely shaped me because I applied the fundamentals at my old work all the time (22 grad)\n\nWeb tech was my most challenging course because I’ve never understood front end web dev and hate Javascript with a passion (one day we will be writing web apps in Rust and compiling them to WASM directly, and I will throw 50 paise coins to all the starving Node.js devs on the street)"
    },
    {
      "id": "m2cw8vd",
      "body": "This MF will doom post about Compiler Design, then you see his transcripts and one shiny A is sitting there like wtf bruh"
    },
    {
      "id": "m2cxa97",
      "body": "Excus moi, I got a B in CD"
    },
    {
      "id": "m2dkn6v",
      "body": "Big Data and Topics in Deep Learning - Both very tough and challenging electives but changed my whole life. I was a web dev/app dev guy before these subject.\n\nNow i work full time in ML/LLM/NLP role so yeah these subjects had the most impact on me and shaped my future. Also i use the topics i learnt in these classes everyday and love it!!\n\nThinking of pursuing PHD also in AI/ML in future (Not sure about it). But yeah these were the most challenging and exciting subjects for me and changed my whole life literally!!!!"
    },
    {
      "id": "m2f7ssl",
      "body": "Yes i explored a bit of it since i was building a C program validator using lex and yacc.... The thing about courses in PESU are , they are decent and few are interesting . But the weird papers and grading make half the batch hate a subject 😂  \nSo hopefully CD does not become mini WT / DDCO"
    },
    {
      "id": "m2ff8hu",
      "body": "Software engineering for sure"
    },
    {
      "id": "m2h9lgs",
      "body": "Same I am currently struggling with it 😭"
    },
    {
      "id": "m2hh3t2",
      "body": "AFLL and DDCO are sexyyyyyyyyyyyy\n\nI also loved dsa/c, and liked math(1-3)/eee/py"
    },
    {
      "id": "m2jpqcl",
      "body": "maths this sem was pretty chill tbf, nas grilled me"
    }
  ]
}