{
  "id": "1hg9g7p",
  "title": "What’s the most memorable experience you've had at PES that shaped your college life?",
  "content": "Share you best memories which you can't forget in your whole life.. ",
  "metadata": {
    "author": "TheDoodleBug_",
    "url": "https://www.reddit.com/r/PESU/comments/1hg9g7p/whats_the_most_memorable_experience_youve_had_at/",
    "permalink": "/r/PESU/comments/1hg9g7p/whats_the_most_memorable_experience_youve_had_at/",
    "score": 31,
    "created_utc": 1734438108,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "m2hh8l3",
      "body": "Web tech"
    },
    {
      "id": "m2hhdgj",
      "body": "When it rains heavily in Bangalore and PES has its own backwaters."
    },
    {
      "id": "m2hhgbr",
      "body": "Only thing memorable is when I get to go home att the end of each day"
    },
    {
      "id": "m2hjmp7",
      "body": "Backwaters? It’s a goddamn ocean I am sure + the island too.. Wouldn’t be bad hiring a ship to sail across the water to reach Mrd!"
    },
    {
      "id": "m2hjque",
      "body": "In EC campus, it only floods near the parking area not entirely, so backwaters is a suitable term."
    },
    {
      "id": "m2hjxa5",
      "body": "Huh!? You haven’t seeen the ocean it used to create in pixel block and the area infront of the waterfalls? Strange!"
    },
    {
      "id": "m2hk0gu",
      "body": "Nevermind. 👍🏼"
    },
    {
      "id": "m2hkmeb",
      "body": "The cricket ground floods almost completely, and I know because every morning I walk from the gate to the engineering block, my shoes are soaked through. Literally have to try and hop around the river like I'm in Takeshi's castle."
    },
    {
      "id": "m2hkzzo",
      "body": "Man is so done 💀"
    },
    {
      "id": "m2hn7bk",
      "body": "ddco"
    },
    {
      "id": "m2hy4vi",
      "body": "Returning alive ☠️"
    },
    {
      "id": "m2hzmoc",
      "body": "making great friends"
    },
    {
      "id": "m2i46w5",
      "body": "Shaving my ddco sir"
    },
    {
      "id": "m2i4ieo",
      "body": "Excuse me, WHAT"
    },
    {
      "id": "m2i50vr",
      "body": "Contrary to popular belief, PES used to be really fun (until 2nd year when who-must-not-br-named took over). My first year was filled with fests (plenty of which I was a core lead), competitions (represented PES at NIT!) and other stuff, made great friends whom I'm still in touch with (some of whom are pursuing Masters with me right now in the same uni), interacted with great profs and published good research. \n\nPES (and most colleges in our country) are what you make of it."
    },
    {
      "id": "m2i8gf4",
      "body": "Have to walk on the fucking wall smh"
    },
    {
      "id": "m2ik9gj",
      "body": "with consent?"
    },
    {
      "id": "m2im1cq",
      "body": "The ability to make back the way I came"
    },
    {
      "id": "m2mmgqt",
      "body": "The holidays"
    },
    {
      "id": "m2moajh",
      "body": "Then think about hostelers"
    },
    {
      "id": "m2spfcv",
      "body": "It feels like fate played its hand when I met Amit Prakash, though I never could have imagined it at the time. Our paths crossed in the most unexpected of ways, a brief encounter at a mutual friend’s gathering, where I noticed him almost immediately. There was something magnetic about the way he smiled, with an effortless warmth that drew people in. We started talking, and within minutes, it felt as though we had known each other for years. His words were gentle yet full of meaning, and I found myself drawn to the depth in his eyes, like there was an unspoken understanding between us. That first conversation was a spark, one that would eventually light up everything. It was a connection so natural, so easy, that I couldn’t help but wonder how I’d ever lived without knowing him. What started as a simple meeting blossomed into something so much more—something I never saw coming but couldn’t imagine living without now."
    }
  ]
}