{
  "id": "1hgycx1",
  "title": "Stressed about cgpa. How should I score more ?",
  "content": "I got 6.55 in my first sem and 5.59 in my second sem. I am expecting to cross 7 spga this sem. \n\nBy end of 6th sem i want to reach atleast 7.5 gpa. How do I do it? How difficult is it to score 8+ in every sem from now on . By seeing my gpa u should know that i am not so smart guy so give tips according to that.\n\nPlease leave some tips. 🙏🏻\n\n  \nI have decent skills and I am sure I will improve by 6th sem. All I need is just elegibility to attend Tier 1 placements round 1. How much % of companies will I be able to sit in ?",
  "metadata": {
    "author": "Street_Slice3441",
    "url": "https://www.reddit.com/r/PESU/comments/1hgycx1/stressed_about_cgpa_how_should_i_score_more/",
    "permalink": "/r/PESU/comments/1hgycx1/stressed_about_cgpa_how_should_i_score_more/",
    "score": 32,
    "created_utc": 1734515705,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "m2n3t77",
      "body": "cooked"
    },
    {
      "id": "m2n5pc9",
      "body": "It's over... No false hopes"
    },
    {
      "id": "m2n6y9j",
      "body": "Which department do you belong to?"
    },
    {
      "id": "m2n8svx",
      "body": "Ai-Ml"
    },
    {
      "id": "m2n97od",
      "body": "ur cooked broski , tier one will be next to impossible , iirc u need 8.5+ for tier one"
    },
    {
      "id": "m2nb5nh",
      "body": "Are scenes really this bad for low gpa ppl?\n\nWhat about those who have 8+?"
    },
    {
      "id": "m2ntmf4",
      "body": "Time to pull up your socks OP. It's going to be really difficult with that GPA. Shut everything else, grind academics the next few semesters and pray to lady luck. A poor GPA cannot be compensated with DSA skills and a good profile."
    },
    {
      "id": "m2ny9qv",
      "body": "Don't seek validation or hopes OP. Grind your ass off you can't do anything else"
    },
    {
      "id": "m2obq0p",
      "body": "Bhai freshers ye sab kyu answer krrhe hein 😭😭"
    },
    {
      "id": "m2oln7j",
      "body": "That is true as far is I know tiers are given based on CTC offered and not cgpa cut off"
    },
    {
      "id": "m2qromm",
      "body": "CSE"
    },
    {
      "id": "m2szac2",
      "body": "brother sit and grind stop going pubs every Friday"
    },
    {
      "id": "m2v7q0k",
      "body": "Don't get below C in any subject and your gpa won't dip below 7."
    },
    {
      "id": "m2xqran",
      "body": "Hey, don't think too much about the end result of placements, ace ur isa, and as cliche as it sounds take it one step at a time. Also don't think too much about tier 1,2,3. First focus on getting that gpa above 7. You'll be eligible for 75% of the companies. \nDon't waste time at the start of your next semester, because once isa1 gets over, there is no coming back or \" I will shut up and study\" because you'll have assignments and isa 2 in no time. So be proactive, study hard, make notes at home. If you get above 85% in ur isas it would give you enough momentum and you'll be technically good enough to do well in the ESA. Don't learn for the sake of marks and study to become a good engineer as all 4th sem subjects are important fundamentals."
    }
  ]
}