{
  "id": "1hhutdr",
  "title": "Planning an academic comeback",
  "content": "As Trump is set to come back to the Whitehouse I thought it it is maybe time for my academics to come back too. Ever since Joe biden ascended to The presidency my academics have been complete garbage. Now after an abysmal sem 3 I have decided to make the greatest comeback of all time and become the most incredible cs student this eorld has ever seen. Any advice for sem 4 guys?",
  "metadata": {
    "author": "_Academic_Comeback_",
    "url": "https://www.reddit.com/r/PESU/comments/1hhutdr/planning_an_academic_comeback/",
    "permalink": "/r/PESU/comments/1hhutdr/planning_an_academic_comeback/",
    "score": 80,
    "created_utc": 1734620619,
    "flair": "Study Help :table:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "m2ty3dn",
      "body": "Quit the bs and start studying or putin will throw you in the gulag."
    },
    {
      "id": "m2ty9br",
      "body": "Study hard for sem 4. Third year is usually pretty tough and most people suffer a dip in GPA. If you can increase your CGPA by a large margin next semester, it'll even out the damage from next year."
    },
    {
      "id": "m2tyem4",
      "body": "If OP falls from a balcony anytime soon and dies I will not be surprised."
    },
    {
      "id": "m2tyi4j",
      "body": "screw the slides. screw the teachers. worship the textbook"
    },
    {
      "id": "m2tyouj",
      "body": "That's not funny bro come on. It's my motivation for OP to study hard."
    },
    {
      "id": "m2tyqix",
      "body": "I was joking bruh"
    },
    {
      "id": "m2tz9x5",
      "body": "Nice to see you have concepts of a plan, just like trump for his presidency"
    },
    {
      "id": "m2tzcif",
      "body": "little does this guy know, mudizi is the reason for his academic downfall."
    },
    {
      "id": "m2tzuib",
      "body": "Thanks bro, couldn't have studied webtech without your notes. I loved how you distilled so much excess data from the slides into such concise points. I hope to gain that ability one day."
    },
    {
      "id": "m2u0uuu",
      "body": "Lol bro was elected long before my downfall"
    },
    {
      "id": "m2u267p",
      "body": "I mean I fear the damage to my gpa has already been done lol. I want to focus more on extracurriculars, don't want to end up in front of an interviewer and have \"getting a job\" be the #1 reason I'm applying for the company. Though I'm completely lost on how to \"find my craft\" so late in the game."
    },
    {
      "id": "m2u3djv",
      "body": "don't set your benchmark to be your peers. your aim should be higher, to master the subject. learn by the textbook. guarantee you'll get at least a 9.5"
    },
    {
      "id": "m2u87wk",
      "body": "Prolly ending up with a Webtech s just because of your notes"
    },
    {
      "id": "m2xrzgq",
      "body": "On every web tech exam I see so many people studying from your notes near the assessment center , goat 🥰"
    },
    {
      "id": "m2xx93w",
      "body": "Love the spirit bro"
    },
    {
      "id": "m3gjlyt",
      "body": "Read the unabombers manifesto and kill the pes owner"
    },
    {
      "id": "m57f2ln",
      "body": "Make sure you don't have a brother before doing all this"
    }
  ]
}