{
  "id": "1hhzisk",
  "title": "35 or 40?",
  "content": "Passing marks?",
  "metadata": {
    "author": "Best_Entertainer6565",
    "url": "https://www.reddit.com/r/PESU/comments/1hhzisk/35_or_40/",
    "permalink": "/r/PESU/comments/1hhzisk/35_or_40/",
    "score": 15,
    "created_utc": 1734632928,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "m2uy9n0",
      "body": "Now that's something I don't know even after 4 years 😂"
    },
    {
      "id": "m2uya6k",
      "body": "Anyone who comments the answer , please provide source as well because I've been seeing this question since a month and there is no clarity at all 😭"
    },
    {
      "id": "m2v6mfw",
      "body": "Some claim it's 40, including teachers and coe\nBut there's times when people who could have never scored 40 pass as well so I think it's somewhat in the middle"
    },
    {
      "id": "m2v7ga6",
      "body": "Always thought it was 35/100."
    },
    {
      "id": "m2v9l8d",
      "body": "It used to be 40 as far as I remember"
    },
    {
      "id": "m2vayvd",
      "body": "Oh boy. Pes and it's mysteries man"
    },
    {
      "id": "m2vb3e8",
      "body": "In ece orientation apparently they said 35-49 has been made E grade and below 35 is F.\nBut I have not found any credible source about it"
    },
    {
      "id": "m2vb7um",
      "body": "Na it is what they claim it is but there's times when there's no ways in hell to get 40 and yet pass. Their grading system is funny asf"
    },
    {
      "id": "m2wjyc7",
      "body": "I am referring to the pass mark when no modification is made to the grade mapping. Of course, there will be changes if they push it around. I am sure you will find the same grade mapping on the back of your grade sheet or transcript."
    },
    {
      "id": "m2x0x4a",
      "body": "I thought you were talking about ISAs for a second there"
    },
    {
      "id": "m2x7ncr",
      "body": "Oh yes u are right"
    },
    {
      "id": "m2xc3sj",
      "body": "3rd sem ? Who told ?"
    },
    {
      "id": "m2xpq5g",
      "body": "Back in the day the F was a movable point which they change based on their convenience and keeping the number of failed folks as low as possible. \n\n\nCheck difficult subjects in EE like Electromagnetic theory, that should give you an idea on how flexible it is."
    },
    {
      "id": "m2xwugv",
      "body": "ISA don't have passing marks"
    },
    {
      "id": "m2y7kix",
      "body": "I scored overall 22.xx in one subject and got E\n\nSo that’s that"
    },
    {
      "id": "m2y926s",
      "body": "1) I heard jawahar himself said in orientation that they are reducing the pass marks\n2) many of friends said in ece orientation they've shown that 35 is passing marks\n \nBut I can't confirm both of these because I didn't see it myself"
    },
    {
      "id": "m2ycv9o",
      "body": "Maybe 35"
    },
    {
      "id": "m39ymiq",
      "body": "For 100 marks, passing is 40 marks"
    }
  ]
}