{
  "id": "1hlenc1",
  "title": "Help with Faculty Preference for DBT 6th SEM",
  "content": "Vinay Joshi or Raghu BA?\n\nI don’t really focus much in class, so I need a teacher who’s relaxed and easygoing.\n\nI’m not familiar with either of these teachers, though.",
  "metadata": {
    "author": "Hamhunter23",
    "url": "https://www.reddit.com/r/PESU/comments/1hlenc1/help_with_faculty_preference_for_dbt_6th_sem/",
    "permalink": "/r/PESU/comments/1hlenc1/help_with_faculty_preference_for_dbt_6th_sem/",
    "score": 7,
    "created_utc": 1735050534,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "m3losni",
      "body": "Unrelated but can you actually select teachers in pes?"
    },
    {
      "id": "m3lqgmq",
      "body": "for some electives, yes."
    },
    {
      "id": "m3n3i4r",
      "body": "For some electives that offer multiple prof options, you can choose. However, the selection is not based on FCFS but rather on CGPA."
    },
    {
      "id": "m3pe6if",
      "body": "So only students with high CGPA can choose profs for elective courses? Or everyone can choose but preference is for ones with higher CGPA?"
    },
    {
      "id": "m3pfzws",
      "body": "The latter. \n\nEveryone *has* to choose while enrolling for electives which have multiple profs taking them. They usually ask you to rank your choices. Once everyone has filled the form, allotment is done based on GPA."
    },
    {
      "id": "m3po1tr",
      "body": "I'm going to 4th sem now. When will we get the chance to choose? Will it be before the end of 4th sem or after ESA results and all come out for 4th? \n\nAlso, usually around how much GPA is required to get the 'good' profs? Especially if it's for a commonly chosen elective like say DA or BD?"
    },
    {
      "id": "m3qxuup",
      "body": "1. Usually 1-2 weeks before the respective semester begins for sem 5 or 6 electives.\n\n2. A 9+ is a safe bet usually. There are many factors at play here like the overall performance of your batch, the number of people interested in a specific elective and the performance of people interested in that elective."
    },
    {
      "id": "m4ck60f",
      "body": "Your best bet is Vinay Joshi, when he was our DBT professor, he just sat in class and didn't teach for so many days."
    }
  ]
}