{
  "id": "1hmt5bd",
  "title": "Minor courses! ",
  "content": "1st sem student here, recently got this on my mail, not sure if it is for us but wanted to confirm it.\nIf it's true then can seniors please provide some more information about this. Couldnt find information about this in FAQ's nor in older posts. \nAlso some questions: \n1. Does it get super hectic \n2. Backlog scene \n3. How long does it last \n4. Which one do yall think is the most useful\n5. Which one do yall think is the most easiest\n6. Is there some extra fees for it\n7. Is it worth it ",
  "metadata": {
    "author": "AimWTF",
    "url": "https://www.reddit.com/gallery/1hmt5bd",
    "permalink": "/r/PESU/comments/1hmt5bd/minor_courses/",
    "score": 8,
    "created_utc": 1735233928,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "m3wgc1b",
      "body": "The credits we receive from these are added to our major degree, or will they be separate? Is there a chance of increasing our GPA from the minor course?\n\nAny seniors help would be appreciated.."
    },
    {
      "id": "m3wgvpb",
      "body": "Scam, next"
    },
    {
      "id": "m3wizps",
      "body": "which stream do you belong to?"
    },
    {
      "id": "m3wjhoq",
      "body": "Minor degree GPA and major degree GPA are computed independently"
    },
    {
      "id": "m3wjrk6",
      "body": "CSE"
    },
    {
      "id": "m3wl8uz",
      "body": "Minors are not for 1st years , don't overthink u ppl haven't completed a sem yet \nComplete 1st sem first"
    },
    {
      "id": "m3wlqln",
      "body": "Ooh, okay.\n\nIs there any use of this minor course, then? Would you recommend this as a senior, keeping in mind the already hectic PESU curriculum?"
    },
    {
      "id": "m3ywlbi",
      "body": "The \"use\" depends on you. It was not relevant to my interests and future career goals, so it was useless to me. Might not be the case for you."
    },
    {
      "id": "m3zjqi2",
      "body": "Is there any fees to take this course"
    },
    {
      "id": "m44xoiu",
      "body": "If you are from EC, DO NOT OPT FOR THEM. The teachers are shit and it’s not worth it. If you have any issues with the teachers then the HOD is their baap. She is horrible. Do not opt for them. Do some legit courses outside and it’ll actually add value."
    },
    {
      "id": "m4559ge",
      "body": "Minor courses might be worth it in some cases - \n\n1. You legit like another branch, and want to showcase your skills/interests in it. Let's say I like management for some reason and I am in the ECE branch. Then sure, if you think you want to explore more in management, then sign up for it. I know people who did a minor just because they liked it so much (rare but yeah).\n\n2. Lets say you are in ECE and you want to do some minors in CS to make your profile stand out in some way to land a job. It will also give you a chance to explore some core CS courses.\n\nYou can use your minors to bridge a gap between two fields. Who knows, it might even help you write your SOP while applying for a master's or get a job in the future.\n\n  \nIIRC taking up a minor course does cost additional tuition money in PES. Take it only if you see it helping you in the future.\n\n  \nI have had people give different opinions on these courses. Some completely regret it and say it didn't serve them any purpose, while a few used it to switch careers altogether!"
    },
    {
      "id": "m455jmw",
      "body": "I see, any rough idea to what could be the tuition fee for it? Thanks a lot for the reply."
    },
    {
      "id": "m456ics",
      "body": "Went through my email. Couldn't find an exact number but I had different results. Looks like its department wise\n\nRs. 2500/- Per Credit, management department.\n\nRs. 12500/- for the entire course, ECE department, summer term\n\nThese are from 2021-2022. It might have shot up now"
    },
    {
      "id": "m456lla",
      "body": "Yup got it, thanks alot"
    }
  ]
}