{
  "id": "1hskfh2",
  "title": "Just curious question",
  "content": "are people here actually interested in studies or is there someone who studies just for sake of parents and to get salary every month as an engineering gets it easily",
  "metadata": {
    "author": "Sufficient_Sir3953",
    "url": "https://www.reddit.com/r/PESU/comments/1hskfh2/just_curious_question/",
    "permalink": "/r/PESU/comments/1hskfh2/just_curious_question/",
    "score": 27,
    "created_utc": 1735903648,
    "flair": "Club Post :upvote:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "m564tbm",
      "body": "I'm the 2nd type"
    },
    {
      "id": "m56bdxj",
      "body": "I'm the 2nd type.\nI wish to own a cafe and be a barista. Seems like a fun job."
    },
    {
      "id": "m56cxor",
      "body": "I was actually interested at first but now farming seems like a better option."
    },
    {
      "id": "m56f0xe",
      "body": "I want to be a bus driver(riyal) at this point."
    },
    {
      "id": "m56gqm9",
      "body": "Conductor>>"
    },
    {
      "id": "m56h61c",
      "body": "Bus driver has more at stake tbh."
    },
    {
      "id": "m56hl5b",
      "body": "Yea but can u imagine having the power to kick someone Outta the bus ,yelling RAIYYA RAIYYYA , all while holding all that money in your hand?"
    },
    {
      "id": "m56i3yo",
      "body": "Oh please , driving a huge metallic box in Bangalore traffic with autos and bikes trying to squeeze in every inch of space available around the bus and trying not to run anyone under the bus due to the blind spots, is a herculean task. Conductors are gonna get scammed by the free ticket people lmao."
    },
    {
      "id": "m56jynd",
      "body": "Unfortunately most people here (and other Indian colleges) are simply here because of placements. The average Indian does not come from a family with enough financial privilege and power to pursue what they want to, and the only means to a better standard of living is a bigger paycheck. That's why you see most choosing CS (or a derivative) so they can fast-track that process. If something like EEE had been the highest paying branch, everyone would have flocked to that instead."
    },
    {
      "id": "m56mfh6",
      "body": "I was a competitive swimmer throughout school and genuinely enjoyed it, but in India it's simply not a viable path. I also have a love literature, but that isn't exactly a practical choice.\n\n\nI come from a fairly privileged background, and my parents never pressured me into pursuing science; it was my own choice. I enjoy cse so far and perform well in college. Aaand since im female, I may not face the same pressures to earn, but yeah I want to make enough money to be self-sufficient and pursue some of my hobbies."
    },
    {
      "id": "m56xu25",
      "body": "You might find my answer vague but still let me share my opinion. I was a bright student till 10th and passed out from an ICSE school.Had slightly given up after enduring the pressure in High School. Did pretty well in my 12th boards but couldn't get a branch of my choice in Engineering. I'm right now pursuing EEE at PES and not just the branch but the college itself gives me  back to school vibes. Envying my peers who are having a much more relaxed student life at BMS/MSRIT or even RVCE. And yes I was being pressured since school and felt I'm just studying for their sake."
    },
    {
      "id": "m574qvs",
      "body": "I was type 2 when i came in then transitioned to type 1 now back to type 2 after applying for internships."
    },
    {
      "id": "m57h7dc",
      "body": "I'm in the second category when I'm feeling lazy or lack motivation to do typical coding stuff, and in the first category when I'm ideating or anything I try building works out, even if it's only partially functional.😶‍🌫️"
    },
    {
      "id": "m57j8pz",
      "body": " KSRTC driver Highly skilled and daring bus driver with over 15 years of experience in navigating the curvy roads of the Western Ghats, dodging cows, and mastering the art of honking symphonies. entertaining passengers with occasional high-speed overtakes, and expertly handling everything from Airavat Gold Class to Karnataka Sarige."
    },
    {
      "id": "m57qopz",
      "body": "dealing with ppl is worse"
    },
    {
      "id": "m57qr0m",
      "body": "Interested but work effort doesn't always get results"
    },
    {
      "id": "m58xx8u",
      "body": "My interest is going home after college, interest is bunking as much as I can, my interest is wanting to skip life till I graduate 🗿"
    },
    {
      "id": "m5ambwc",
      "body": "There are also people without career plans who default to cs"
    },
    {
      "id": "m5brcfb",
      "body": "Man, I really want to be a farmer."
    },
    {
      "id": "m5bzkmv",
      "body": "You would go to type 1 if you do an internship in a SAAS based startup, I can bet on it."
    },
    {
      "id": "m5c33qj",
      "body": "This is very common when it comes to Software Engineers. Many want to consider farming as an alternative career. But you're not even a software engineer yet and have already decided to do this 😂 maybe you're on the right track to become a software engineer then"
    },
    {
      "id": "m5ckbtb",
      "body": "I think they would also default to the first category of people. If someone does not have explicit career plans, the best career plan to choose would be the highest paying one."
    },
    {
      "id": "m5clcfs",
      "body": "Bro I'm not Even kidding farming seems like a legit option now"
    },
    {
      "id": "m5ddr1n",
      "body": "ISA?"
    },
    {
      "id": "m5dqgv7",
      "body": "And telling random people \"change illa\" even while there's like a million coins in your pocket"
    },
    {
      "id": "m5hyxar",
      "body": "I wanted to do that when I came to pu 😭"
    },
    {
      "id": "m6jmhet",
      "body": "same bro i dont have interest in the science these institutions portray i love plants too i love farming too but dont have enough money to invest in it"
    },
    {
      "id": "m6jms39",
      "body": "what do u mean by want to skip life till i graduate"
    },
    {
      "id": "m6jmz99",
      "body": "like me"
    },
    {
      "id": "m6jn979",
      "body": "no its not vague i can relate to u exactly i am in 12th now and scared of not getting good college and good job i somehow want to be financially independent n not be burden to my parents i too feel a lot pressure coz my 12th exams r nearing, yes i relate to u my parents too pressurise me when i look depressed they tell its ok u can score how much ever u can efforts r important and on the result day they make me feel useless i dont trust them\n\ni hope u heal and dget to do  what ur heart really likes to for the sake of urself"
    },
    {
      "id": "m6jngla",
      "body": "🤜🤛"
    },
    {
      "id": "m6kmhmm",
      "body": "if im speaking in terms of games, i just want these 4 years to be a cutscene which i can skip"
    }
  ]
}