{
  "id": "1hsmpjn",
  "title": "5th sem ESA results ",
  "content": "What in the world happened to the 5th sem esa results. So so many people got above 9\nWhat kinda relative grading is this ",
  "metadata": {
    "author": "Strange-Slide-5300",
    "url": "https://www.reddit.com/r/PESU/comments/1hsmpjn/5th_sem_esa_results/",
    "permalink": "/r/PESU/comments/1hsmpjn/5th_sem_esa_results/",
    "score": 39,
    "created_utc": 1735911691,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "m56iqhe",
      "body": "Pes either does this or no relative at all💀"
    },
    {
      "id": "m56jbvi",
      "body": "Imagine if this is the calm before the storm and a major fuck-you from PES is on its way"
    },
    {
      "id": "m56ldfa",
      "body": "I was expecting 7.5 and easily got 8 lol. It's the new grading scheme, the minimum marks have been reduced to 35 and there is an 11-mark difference. So people who got 75+ easily got A grade which would have harder under the older grading scheme where u got a B."
    },
    {
      "id": "m56mmni",
      "body": "Hahaha anything is possible at this point"
    },
    {
      "id": "m56svru",
      "body": "What do you guys think about the cnr cutoffs this time is a 8.95 possible"
    },
    {
      "id": "m56wblh",
      "body": "11 marks difference?"
    },
    {
      "id": "m56xg2w",
      "body": "Bro ppl here have a problem if they get good results also, last sem literally people were complaining about bad results, plz pick a side 🙆"
    },
    {
      "id": "m56yn13",
      "body": "what could be the cutoffs for cnr and mrd"
    },
    {
      "id": "m56z02j",
      "body": "Why tf do u care abt others results. Just be happy if u have scored well if u are not obsessed with scholarship "
    },
    {
      "id": "m56zn1h",
      "body": "Yep. You just need above 9 and you can sit for all companies placement."
    },
    {
      "id": "m572orh",
      "body": "Juking the stats for the placements "
    },
    {
      "id": "m574ace",
      "body": "Is this for the first semester as well?"
    },
    {
      "id": "m574anj",
      "body": "Mrd would be 9.8 and the cnr would probably be 9.5 above judging from my low iq ass scoring above 9"
    },
    {
      "id": "m574fes",
      "body": "Nooo"
    },
    {
      "id": "m576ukl",
      "body": "but that cutoff depends on how many people they want to shortlist right? so if everybody's gpa increases won't the cutoff gpa increase as well?"
    },
    {
      "id": "m577tqp",
      "body": "Man my score is between 9.2 and 9.3 . i totally understand you that is all i want at this point."
    },
    {
      "id": "m578zo1",
      "body": "But they have ruined our results too earlier , so everything balances out of if u consider cgpa "
    },
    {
      "id": "m57bwxb",
      "body": "Is this confirmed? That 35 is passing grade (E) and S is 90 and there is 11 mark diff for every grade i.e., 79 is A, 68 is B, 57 is C and 46 is D?"
    },
    {
      "id": "m57c3f7",
      "body": "okay yeah fair enough"
    },
    {
      "id": "m57k8eq",
      "body": "bell curve tuning about to happen next sem xD."
    },
    {
      "id": "m57kz0u",
      "body": "What does this mean, will they mark strictly  next sem?"
    },
    {
      "id": "m57nhep",
      "body": "Can't say for sure, but it happened to us in 4th sem. and 5th sem was 💀."
    },
    {
      "id": "m57pa5s",
      "body": "This was what was told to us during the semester orientation so if it's true. "
    },
    {
      "id": "m589ey7",
      "body": "bro why 7.5 female cse good DSA is it tough ?"
    },
    {
      "id": "m58b94y",
      "body": "I don't really think so. It depends on the company tbh. Usually they just send OA to everyone who applied. Some only want the top 100 and so on."
    },
    {
      "id": "m58catx",
      "body": "If you have good DSA skills then passing OA is peaceful. 7.5 cgpa is pretty hot or miss though. Most tier 1 companies do above 8 or 8.5 . Some do above 7 but it's pretty uncommon nowadays.\n\nCompanies will come to hire only female candidates. You can try them out for better chances although I heard that the OA's are really hard."
    },
    {
      "id": "m58cjkc",
      "body": "I quailed for an internship with PPO 31LPA with 6.6 cgpa last sem on campus"
    },
    {
      "id": "m58e9ix",
      "body": "If you already have a PPO, then you don't have to worry about placements 😭"
    },
    {
      "id": "m58ebji",
      "body": "Are you 3rd year ?"
    },
    {
      "id": "m58egyl",
      "body": "Yes, I am (see flair)"
    },
    {
      "id": "m58mgty",
      "body": "uh , i dont think you understand how cutoff works for them  \n  \nmrd is based on cgpa but cnr is based on sgpa , so even if you hit a 10 sgpa this sem but your cgpa isnt past whatever cutoff (was 9 last time) , you wont be eligible \n\nyou can actually see this happen in the previous scholarship list where a person has got considerably high sgpa ,but gets fucked on the overall cgpa en"
    },
    {
      "id": "m5amnrv",
      "body": "So you can still get cnr from sgpa alone right "
    },
    {
      "id": "m5hx523",
      "body": "I think you can check how the grading is done for the percentage on the back side of the grade card, but I think there might be some round off in play, for the grades to improve that high."
    },
    {
      "id": "m5pkqxs",
      "body": "Sometimes due to some malfunction this happens. I think the threshold is low in which you don't need to worry."
    }
  ]
}