{
  "id": "1ht7die",
  "title": "ATTENDANCE HELP",
  "content": "I attended the first two Constitution classes, but since the attendance wasn’t updated, most of us, including me, stopped bothering. Now my attendance is probably around 30%. What should I do? Are there makeup classes for this as well?",
  "metadata": {
    "author": "Cautious-Door8437",
    "url": "https://www.reddit.com/r/PESU/comments/1ht7die/attendance_help/",
    "permalink": "/r/PESU/comments/1ht7die/attendance_help/",
    "score": 14,
    "created_utc": 1735968354,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "m5bafc4",
      "body": "bros coooked. Contact your class teacher, make up some reason like medical issues or sumn."
    },
    {
      "id": "m5balqq",
      "body": "Medical issue for 6 weeks? Where I’ve attended normal classes but not online?😭"
    },
    {
      "id": "m5bf4i0",
      "body": "I think they wont consider for this subject …\n\nAlso of they consider u have to make up with medical certificates n shit"
    },
    {
      "id": "m5bhr72",
      "body": "For future info, you should know that attendance is counted for all credited courses, regardless of whether it's reflected on the app. The app has always been inconsistent with showing the correct attendance (even before my time, so it's an ages old issue), so never go by the app and always track attendance yourself as much as possible. Remember that the app might not show the right attendance but it does store it when the profs record it."
    },
    {
      "id": "m5bk37w",
      "body": "Don't worry too much,in my batch too most didn't attend still there was no issue."
    },
    {
      "id": "m5dtdta",
      "body": "Check ur attendance now they have updated it, I'm pretty sure they gave free attendance coz my friend who did not attend any week got full attendance"
    },
    {
      "id": "m5jc9h0",
      "body": "It still says NA tho "
    },
    {
      "id": "m5pikz5",
      "body": "Dw, they’ll let you write. The least they’ll do is ask all those who has less attendance to meet chairperson and you get asked why you didn’t attend. Tell them you forgot your teams password or just cook up a story and they’ll excuse you."
    },
    {
      "id": "m5ua5m3",
      "body": "Backlog"
    }
  ]
}