{
  "id": "1hv71a9",
  "title": "Help me understand course withdrawal ",
  "content": "(Sem I)\nQuestions I have: \n1) What's the difference between withdrawing and dropping?\n2) What happens if I withdraw/drop from a course right now? How is my SGPA affected? How will CNR scholarships work out in this case?\n3) Do I have to write an ESA (no ISAs) for the withdrawn course next semester (Sem II)? \n4) How will the CGPA be calculated?",
  "metadata": {
    "author": "leoxplr",
    "url": "https://www.reddit.com/r/PESU/comments/1hv71a9/help_me_understand_course_withdrawal/",
    "permalink": "/r/PESU/comments/1hv71a9/help_me_understand_course_withdrawal/",
    "score": 8,
    "created_utc": 1736190738,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "m5tglfy",
      "body": "> 1) What's the difference between withdrawing and dropping?\nWithdrawing a course means to skip giving the ESA this ESA cycle and give it during some other time (usually when the ESA for this course is held again: backlog exams time or next year). Dropping a course means to completely remove your enrollment from a course. \n\n> 2) What happens if I withdraw/drop from a course right now? How is my SGPA affected? How will CNR scholarships work out in this case?\n\nIf you drop a course, then depending on the type of course, either this will not cause any damage (optional courses like STs) or result in a backlog (mandatory courses). Your SGPA will be counted only for the courses you have enrolled for. You won't be eligible for any scholarships. \n\n> 3) Do I have to write an ESA (no ISAs) for the withdrawn course next semester (Sem II)? \n\nIf you withdraw or drop a mandatory course, you will have to clear it any time before your graduation date. Can be during backlog exams or any other time the ESA for that course is held. And yes, your ISA marks are void, your final grade will be out of the 100 marks in the ESA.\n\n4) How will the CGPA be calculated?\n\nSame as SGPA, only enrolled courses for which you've written the ESA contribute to your GPA."
    },
    {
      "id": "m5v9iqf",
      "body": "Another doubt, can we just leave it without withdrawing/dropping the course. because i did and it still asks for me to confirm my esa registration\n\nsays successfully registered, but the screen won't go away, is that supposed to happen or nah?  \nif not, what am i supposed to do"
    }
  ]
}