{
  "id": "1hvlufi",
  "title": "Seniors plz confirm if..",
  "content": "If an s grade is >=90 or >90?????",
  "metadata": {
    "author": "Normal-Bad6621",
    "url": "https://www.reddit.com/r/PESU/comments/1hvlufi/seniors_plz_confirm_if/",
    "permalink": "/r/PESU/comments/1hvlufi/seniors_plz_confirm_if/",
    "score": 4,
    "created_utc": 1736233338,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "m5u6nmi",
      "body": "It is >=90, but it rarely matters. \n\nAlmost always they do some sort of undisclosed relative grading.\n\nIt's not at all transparent, very inconsistent, and there's no point trying to understand it.\n\nJust write your exams the best you can and youll get what you get"
    },
    {
      "id": "m5u93en",
      "body": "You mean people scoring 88-89 will also get an s grade??"
    },
    {
      "id": "m5ua2yu",
      "body": "Brother I have been here for 2.5 years and no one really knows how the relative grading works. Even seniors or some of my very smart peers or peers with great relationships with teachers don't know. Honestly just write exams as well as you can and then chill."
    },
    {
      "id": "m5ub9a3",
      "body": "I'm asking for subs which doesn't have relative grading.."
    },
    {
      "id": "m5ubwco",
      "body": "Bro first of all stop relying on relative grading. They do it sometimes, and sometimes I dont. I'm from the '27 batch and first sem we had hard relative grading. Even idiots who dont study shit scored 8+. 2nd sem we had relative only for math, and everyone's sgpa dropped. So like I said, just study hard and do ur best. The only subject where you can expect relative is math because people generally mess up, but even then don't be too hopeful."
    },
    {
      "id": "m5ucc2v",
      "body": "They could. Nobody knows the cutoff. Just study"
    },
    {
      "id": "m5ud2o0",
      "body": "If there was no relative then 90 and above is S grade"
    },
    {
      "id": "m5ulfmf",
      "body": "Absolute grading, 90-100 is S, 80-89 is A and so on.\nRelative, nobody will ever know, just give your 100% in the exam and you'll get a grade based on your peers' performance"
    },
    {
      "id": "m5uzyin",
      "body": "We just wrote the exams giving our best and once we got the result, it was pretty much it what it is."
    },
    {
      "id": "m5v2m7l",
      "body": "Were the results as expected or worser than what you expected?"
    },
    {
      "id": "m5v71bp",
      "body": "My aim was to keep CGPA above 8 at all times but once after writing the exam I would just hope I don't get backlog."
    }
  ]
}