{
  "id": "1hwdcyr",
  "title": "Bmtc price hike rant",
  "content": "Tf were they fucking thinking , from where am I supposed to get exactly 7,8,13,11,14,17 fkn rupees,  and sometimes they don't even give proper change, omfg, the Shakti scheme is catching us as stray , tff",
  "metadata": {
    "author": "DhruvaSync",
    "url": "https://www.reddit.com/r/PESU/comments/1hwdcyr/bmtc_price_hike_rant/",
    "permalink": "/r/PESU/comments/1hwdcyr/bmtc_price_hike_rant/",
    "score": 109,
    "created_utc": 1736317309,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "m60g287",
      "body": "Fax"
    },
    {
      "id": "m60jbl2",
      "body": "I'm very out of the loop with this since I always relied on auto/metro, but haven't they adopted the UPI yet?"
    },
    {
      "id": "m60krj0",
      "body": "Many BMTCs still lack UPIs, and when available, conductors often prefer cash because it is convenient for them."
    },
    {
      "id": "m60l6wd",
      "body": "It is only available in ac and new blue electric buses"
    },
    {
      "id": "m60llbr",
      "body": "How is cash more convenient? Wouldn't that include carrying around money for change which is a hassle? \n\nUPI would just need them to enter a value and show a QR"
    },
    {
      "id": "m60lwol",
      "body": "I am so lucky I got my pass the day this happenend"
    },
    {
      "id": "m60m03u",
      "body": "It's convenient because they take some of the cash for themselves at the end of the day lol"
    },
    {
      "id": "m60mfkl",
      "body": "After scanning and paying, the conductor should verify the UPI transaction ID in the ETM and then issue the ticket which becomes a hassle and time-consuming, that's why many of them avoid online payments"
    },
    {
      "id": "m60pbo9",
      "body": "Being the last stop, I can't even estimate how many times conductors have refused to give me change, claiming they didn't have any."
    },
    {
      "id": "m60plse",
      "body": "fr today I had to pay 15 bucks for a 12 rupee ticket and the nigga didn't give me 3 rupees back cause he had no change. 3 rupees isn't much so losing it isn't the problem, but it can be used as change next time i need to get a ticket. now i gotta go on a coin hunt ffs what bs"
    },
    {
      "id": "m60ppei",
      "body": "True"
    },
    {
      "id": "m60puqy",
      "body": "It isn't available in 3/4 busses"
    },
    {
      "id": "m60ry8h",
      "body": "The issue is, ₹3 adds up to a larger amount. Assuming you travel everyday, that's: \n\n₹15 per week or \n₹60 per month or\n₹720 per year"
    },
    {
      "id": "m60s86h",
      "body": "Apparently they cite reasons as \"poor internet connectivity\" and the fact that it takes too much time for them to verify aadhar cards and bus passes so they don't have the time to check if the UPI payments have gone through or not. Out of curiosity what was the bus fare when you began in 2018 lol"
    },
    {
      "id": "m60siwo",
      "body": "Just act like you have already got your ticket until you have to get off, 90 percent of the time the collector doesn't notice☠️, this government doesn't deserve our money lol"
    },
    {
      "id": "m60uqfp",
      "body": "that's one way for me, so its really 1440 rupees every year... not happy"
    },
    {
      "id": "m610b4l",
      "body": "By mistake if u don't have the required change... U have to beg the  god to send the conductor back to you so that u can get back the remaining change...."
    },
    {
      "id": "m615fy2",
      "body": "think about the conductors who have to deal with this 💀"
    },
    {
      "id": "m61jgeb",
      "body": "Slowly there are pasting QR Code for payments in Buses i observed in some busses new QR code is pasted"
    },
    {
      "id": "m6214u3",
      "body": "not just this. The metro is apparently getting a price hike too. (By 40-45%)\n\nYour base minimum price jumps to 10, and the base maximum now goes from 60 to 85."
    },
    {
      "id": "m638kfe",
      "body": "imagine being so jobless and lifeless that u comment on ur old college reddit"
    },
    {
      "id": "m642j6r",
      "body": "It's so damn annoying, they pullout the most random prices from up their ass, it also seems ONLY UPI busses have prices in multiples of 10,5 which is so stupid, idc whatever scheme they introduce but they better introduce upi ASAP"
    },
    {
      "id": "m674go1",
      "body": "Oh hell no😭"
    },
    {
      "id": "m67cjty",
      "body": "its prolly cuz the buses are used by the poorer sections of society who wouldnt have UPI in their phones."
    },
    {
      "id": "m69dybh",
      "body": "for some reason even tho the normal buses have the same payment machines as the ones in malls, they refuse to use UPI.  Its not even a hardware issue."
    },
    {
      "id": "m69eeru",
      "body": "they dont give 2 shits, this just allows them to steal more."
    },
    {
      "id": "m69pdpk",
      "body": "It varies depending on how far you need to go from PES. And inflation lol. The government should pay higher to compensate for the Shakti scheme...otherwise it won't be fair."
    }
  ]
}