{
  "id": "1hx7flk",
  "title": "ISA ",
  "content": "very out of the box but theres literally no checking before ISA of pockets or anything so dont people carry chits or something to copy? whats the punishment or whatever to get caught copying using chits or phone ? i have also seen people talk or peep into others screen so if u get caught whats the deal",
  "metadata": {
    "author": "TopConnect4762",
    "url": "https://www.reddit.com/r/PESU/comments/1hx7flk/isa/",
    "permalink": "/r/PESU/comments/1hx7flk/isa/",
    "score": 11,
    "created_utc": 1736407139,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "m66vvpk",
      "body": "They'll send you out da what else?"
    },
    {
      "id": "m66vyb6",
      "body": "what about the marks or esa"
    },
    {
      "id": "m66wvbx",
      "body": "They haven't mentioned anything abt ufm in the isa instructions given to us"
    },
    {
      "id": "m66x0zw",
      "body": "Yeah that’s why asking seniors"
    },
    {
      "id": "m66xt29",
      "body": "They have an exam malpractice committee to verify cases like this. \n\nThe immediate action would be to of course stop you from writing the exam\n\nThen I presume that the exam malpractice committee would review camera footage and confirm you were caught cheating. \n\nOnce confirmed, you'd be barred from placements, it'll be marked in your academic records and you'd receive a backlog in that subject."
    },
    {
      "id": "m66y13g",
      "body": "but does the comittee keep checking cctv during the exam coz its very easy for people to peep or carry chits without the teacher noticing. ive sseen ppl talk to each other as well so"
    },
    {
      "id": "m674kob",
      "body": "Talking and peeping mostly they will ignore or the invigilator will give warnings but carrying chits and all is very risky if they catch u. In esa u would get a backlog in such a case dk abt isa"
    },
    {
      "id": "m67dfo2",
      "body": "They do have a level of trust in the students. If one of you guys manage to screw up and make it hard for others, good luck with that 👍🏼👍🏼."
    },
    {
      "id": "m67e0gn",
      "body": "Wait so this is really happening?!is this how many or few are able to score well?!"
    },
    {
      "id": "m67e9n9",
      "body": "nah this year kcet and pessat both have smart students we are cooked"
    },
    {
      "id": "m67g63u",
      "body": "Why do our batch people study so much like not only in uni but also in 10th and 12th and jee too 😭"
    },
    {
      "id": "m67g804",
      "body": "Man, I honestly haven't seen anyone carrying chits, lol."
    },
    {
      "id": "m67gd7u",
      "body": "nah chits even i didnt i was just saying its too easy to , but ig ppl are scared to get caught obv"
    },
    {
      "id": "m67ge1j",
      "body": "yeah its only gonna be worse from here 😭"
    },
    {
      "id": "m67gq6q",
      "body": "But do they really peep and talk?"
    },
    {
      "id": "m67guhr",
      "body": "A peer from my batch was caught cheating twice and both the times he got backlog in that subject though it happened in ESA"
    },
    {
      "id": "m67guhi",
      "body": "well seeing the front aint hard at all 😭... talking not much max 1-2 times ive seen"
    },
    {
      "id": "m67ipzs",
      "body": "Woah but it's really scary tho"
    },
    {
      "id": "m6dmwbq",
      "body": "Why do you need to be checked for all the tests, there is a level of trust in students.\n\nIf you are caught, you will be asked to leave the exam hall, there will be some form that needs to be filled at your department, I am not sure about that. Later after the tests you should present your case to a committee, who will provide a verdict, most probably a backlog for that paper."
    },
    {
      "id": "m6k0o07",
      "body": "Seedha go to COE and get a backlog , completely depends on the invigilator, some prof gives an excuse but some sadists don't."
    },
    {
      "id": "m6yoeap",
      "body": "Bro don't do all of that and invite some great trouble for yourself.If they catch you for sure you'll have a tough time clearing that backlog."
    }
  ]
}