{
  "id": "1hxzfim",
  "title": "Tf was that physics isa man😭😭😭😭",
  "content": "What do they think about us",
  "metadata": {
    "author": "Normal-Bad6621",
    "url": "https://www.reddit.com/r/PESU/comments/1hxzfim/tf_was_that_physics_isa_man/",
    "permalink": "/r/PESU/comments/1hxzfim/tf_was_that_physics_isa_man/",
    "score": 63,
    "created_utc": 1736495439,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "m6dcrfu",
      "body": "Just chill bro /s"
    },
    {
      "id": "m6ddrp0",
      "body": "All papers where like dat only for me 🥰"
    },
    {
      "id": "m6de0wt",
      "body": "Elec and math was fine man"
    },
    {
      "id": "m6dekp5",
      "body": "Welcome to PES child"
    },
    {
      "id": "m6dep4j",
      "body": "I'm lucky enough to escape physics ESA coz of covid first lockdown."
    },
    {
      "id": "m6dff7h",
      "body": "A lot of that shit wasn’t even in the slides they provided"
    },
    {
      "id": "m6dfi4y",
      "body": "Me af but mechanical"
    },
    {
      "id": "m6dfu0l",
      "body": "Not to be that guy but slides aren't meant to cover everything, especially in higher semesters. \n\nBut yeah it's frustrating when in first year people usually just get by with slides."
    },
    {
      "id": "m6dfz1b",
      "body": "Atleast now you know what to expect in the ESA lmao"
    },
    {
      "id": "m6dg5x3",
      "body": "Shut up bitch"
    },
    {
      "id": "m6di0gy",
      "body": "This is only a trailer betaa. ESA mein hoga tumhara band baja 🥁🥁🥁🪘🪘."
    },
    {
      "id": "m6dih3o",
      "body": "are ESA's gonna be this hard too?"
    },
    {
      "id": "m6djho4",
      "body": "Slides are sufficient to get at least an A grade imo"
    },
    {
      "id": "m6dlqxc",
      "body": "harder"
    },
    {
      "id": "m6dpddq",
      "body": "buckle up for the esa 🙂‍↕️"
    },
    {
      "id": "m6dqbfp",
      "body": "ESAs are usually harder than ISAs"
    },
    {
      "id": "m6dxm0y",
      "body": "Except for OS all other slides honestly helped me pull an A or an S till 6th sem. CD was horror story"
    },
    {
      "id": "m6dzhr5",
      "body": "ILL ACE BACKLOG EXAMS TRUST 💯"
    },
    {
      "id": "m6e2zxg",
      "body": "They really thought its iit Bangalore"
    },
    {
      "id": "m6e3y4l",
      "body": "Exactly how can they even expect to answer us?"
    },
    {
      "id": "m6e6241",
      "body": "Textbook is way too vast for physics sadly"
    },
    {
      "id": "m6ebmsy",
      "body": "Yo why was CD horror? Can you elaborate?"
    },
    {
      "id": "m6ec1gk",
      "body": "Just extremely tedious man course content and personally was not a fan of the subject so maybe theres a bias. But yea if we go bu toughness its the worst in 6th sem"
    },
    {
      "id": "m6ecmfv",
      "body": "Yeah as I said, nobody is expected to read the book in first year. I was just stating that the PPTs cannot be expected to cover the full book either, so there's always a chance of getting something beyond the slides because profs still use the book for questions."
    },
    {
      "id": "m6ecpb2",
      "body": "Was it mcq for you guys? We have been told that isa will be mcq and will be scaled down to 30."
    },
    {
      "id": "m6ecs0e",
      "body": "Without any ISA scores to boost your marks? Hmm"
    },
    {
      "id": "m6ef884",
      "body": "Anybody expecting above 35 other than me?"
    },
    {
      "id": "m6efcrf",
      "body": "Not chem cycle"
    },
    {
      "id": "m6eijbn",
      "body": "But don't most of the questions from Esa repeat from previous years??"
    },
    {
      "id": "m6ek2e1",
      "body": "Not usually. You can expect a similar pattern and difficulty but not the same."
    },
    {
      "id": "m6ew4pl",
      "body": "Bwaahaha wait for ESA"
    },
    {
      "id": "m6f6zbj",
      "body": "The ISA question was quite challenging. People are suggesting that, in addition to the slides, we should also refer to the book, which is a good idea. However, one question comes to mind: why is it that over 50% of the syllabus is covered in the first year, yet it contributes less than 5% to a career in CSE? Considering that PES University claims to be the No. 1 university in Karnataka, shouldn't they focus on a more practical, real-world-oriented syllabus? I’m not sure if my perspective is entirely correct, but it’s something to think about."
    },
    {
      "id": "m6feupc",
      "body": "Fr? Won't we have subjective 4 markers?"
    },
    {
      "id": "m6g0ebd",
      "body": "Do you guys worry about ISA ? seriously??😂😂"
    },
    {
      "id": "m6g3ynq",
      "body": "Yeah, they considered first sem marks for our batch for both semesters"
    },
    {
      "id": "m6g4w27",
      "body": "That's what our teacher told us. But not sure."
    },
    {
      "id": "m6iyiu8",
      "body": "Do you know how the grading works? I guess you don't"
    }
  ]
}