{
  "id": "1hy2ak1",
  "title": "??",
  "content": "I have dropped out of college and started preparing for KCET 2025 from today. I already know 10 chapters of chemistry, but I need to start the rest from scratch. I scored around 270 in PCM in my boards, so I don’t want to have false expectations. My goal is to get a rank under 10k, but I’m not sure if it’s realistic. I’m ready to dedicate my time and work hard. Can someone please guide me on how to prepare in the best way to achieve this?Also I am thinking to  watch oneshot lectures of pw kannada and then solve the ncert + exempler + pyq's of each chapter mainly 12th, do correct if I'm wrong somewhere!",
  "metadata": {
    "author": "Individual_Bar7107",
    "url": "https://www.reddit.com/r/PESU/comments/1hy2ak1/_/",
    "permalink": "/r/PESU/comments/1hy2ak1/_/",
    "score": 16,
    "created_utc": 1736508164,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "m6dxp0n",
      "body": "Trust me bhai, kuch bhi kar bad parhai kar mere khudke lage hue hain kahan se dun tips"
    },
    {
      "id": "m6dyccm",
      "body": "How bad was your isa 2 that made u do this"
    },
    {
      "id": "m6dyknf",
      "body": "Wait is OP dropping from PES?"
    },
    {
      "id": "m6e10pl",
      "body": "First line itself says so\nDon't know if he means to say dropped out from pes or from some other college.\nI'm guessing it's the latter since cet cutoffs for pesu ended at 5kish for general"
    },
    {
      "id": "m6e5kke",
      "body": "Nah he's posted on the sub's of other colleges too, he was in a college he hasn't named anywhere."
    },
    {
      "id": "m6e62ge",
      "body": "Inspection on point"
    },
    {
      "id": "m6e65li",
      "body": "Ig he wants to get rank under 10k and asking in top college subs how to if I am not wrong"
    },
    {
      "id": "m6fulws",
      "body": "Get a book n study"
    },
    {
      "id": "m6igvv6",
      "body": "First get out of reddit... during my prep i didnt have instagram, reddit, discord or any other social media....just whatsapp... occassional chat with friends used to ask doubts to teachers....whether it helped? Yea i was able tp direct a ton lot of time to studies...."
    },
    {
      "id": "m6k6trs",
      "body": "yes brother"
    }
  ]
}