{
  "id": "1i169td",
  "title": "Minors",
  "content": "I have one dout with minors, we can attend minors placements, other than our regular placements right?",
  "metadata": {
    "author": "Main-Dragonfly-8804",
    "url": "https://www.reddit.com/r/PESU/comments/1i169td/minors/",
    "permalink": "/r/PESU/comments/1i169td/minors/",
    "score": 8,
    "created_utc": 1736862023,
    "flair": "Study Help :table:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "m73gwnk",
      "body": "What is minor placements?  There is only one placement that happens, right?"
    },
    {
      "id": "m73j1ap",
      "body": "I have enrolled for minor course."
    },
    {
      "id": "m73ltxf",
      "body": "There are no different placements for minor courses. The only difference is that u may be eligible for more companies if the company allows even people with minors to apply."
    },
    {
      "id": "m73m50h",
      "body": "There's nothing called \"minor placements\". It's just that very few companies (which only lets CSE students apply) will let CSE minor students attend the process"
    },
    {
      "id": "m73mc6m",
      "body": "Wt about business management minor I am in cse major."
    },
    {
      "id": "m73ox74",
      "body": "I don't think so. Many non-tech roles do come for engineers so it might help you then. However, its best for you to confirm with the business department HoD"
    },
    {
      "id": "m74mkdy",
      "body": "Theres no such thing. But you do have a chance to attend the placements of those companies that require basic knowledge though keep in mind they might prefer to select those who completed the UG. You may need to showcase addtional extracurriculars or go for Masters to compete."
    },
    {
      "id": "m74sfjk",
      "body": "so? u expect separate placements ah? Bro, thats not how it works   \nOnly two companies which came till now asked for CSE minors to be mandatory."
    },
    {
      "id": "m74t9bi",
      "body": "No expectations just a dout that's all,\nBut I am from cse dept,\nI am trying some management course."
    },
    {
      "id": "m74tgt2",
      "body": "oh okay, u didnt specify this. so I got confused. I am not sure how this works tbh"
    }
  ]
}