{
  "id": "1i2mkyq",
  "title": "Assignment",
  "content": "Despite doing good in assignment and also having a good attendance I've got less marks in assignment what could be the reason..and how to improve from next sem in these assignments😭😭",
  "metadata": {
    "author": "Parking-Ad5556",
    "url": "https://www.reddit.com/r/PESU/comments/1i2mkyq/assignment/",
    "permalink": "/r/PESU/comments/1i2mkyq/assignment/",
    "score": 8,
    "created_utc": 1737025776,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "m7fnbud",
      "body": "Approach your teachers, maybe mail them about the same and be ready to submit valid proofs if required."
    },
    {
      "id": "m7fpp7r",
      "body": "What is the thing they look for in maths?I did pretty good in matlab exam but ended up scoring low I Don't even know if there exists any other factor for this"
    },
    {
      "id": "m7fxziz",
      "body": "Oh math is based on MATLAB solely,at least for us it was.\n\nMATLAB exam actually sucks and you cannot challenge the evaluation, so imo cheer up and cover it up in ESA.\n\nFor other subjects you can approach the teachers and get it resolved/negotiate"
    },
    {
      "id": "m7g15yi",
      "body": "maths depends on MAT LAB , other subjects usually teachers give full , its better if u are in good books of a teacher or have good connection with them"
    },
    {
      "id": "m7g6a0a",
      "body": "Were is matlab score displayed .I didnt know results were out"
    },
    {
      "id": "m7gheeh",
      "body": "Woah so teachers pet concept doesn't end here too😭🙏"
    },
    {
      "id": "m7ghgxj",
      "body": "In pesu academy isa result tab"
    },
    {
      "id": "m7h149a",
      "body": "Unfortunately"
    },
    {
      "id": "m7hzmci",
      "body": "I gave my 100% for all assignment and labs still got 8/10 where as my classmate who doesn’t even study didn’t do labs submission properly for 10, this is very unfair alas nothing could be done, just  accept and move on"
    },
    {
      "id": "m7kf0w8",
      "body": "Yea I've accepted my faith but also need to know how to get full like if there's any way so that from next sem it won't be a prob"
    }
  ]
}