{
  "id": "1i2nrxm",
  "title": "relative grading",
  "content": "ik pes doesnt do relative grading per se, but i wanted to know what all subject had been relatively graded(ie  marks added to every body/s or a grade cutoff brought down) or whatever u call it.  \nim asking about first sem physics cycle.",
  "metadata": {
    "author": "Background_223",
    "url": "https://www.reddit.com/r/PESU/comments/1i2nrxm/relative_grading/",
    "permalink": "/r/PESU/comments/1i2nrxm/relative_grading/",
    "score": 14,
    "created_utc": 1737030384,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "m7fv8pd",
      "body": "I asked a senior he told me this, \n\nAlmost all subjects are graded in a weird way. For example, if your ESA marks are good and ISA marks are bad, they will increase the weightage of your ESA marks, which is considered for grading. Relative grading happens in almost all subjects in your odd semesters (1st, 3rd, etc.).\n\nI want a senior to confirm this"
    },
    {
      "id": "m7fwlim",
      "body": "Is this weightage decided by induvigual persons marks or the entire batch a whole \nCuz there no way they could've done it for each person"
    },
    {
      "id": "m7fx17u",
      "body": "I don't know, but this is what the guy told me."
    },
    {
      "id": "m7g1hzn",
      "body": "for us we had relative for maths , and phy \n\n . mostly they did with python too my esa was pretty bad but ended up getting good grade (it also depends on your lab marks )"
    },
    {
      "id": "m7g1qw6",
      "body": "i can confirm the fact that they do it in odd sems   \neven sem they didnt even do anything , for us in mechanics and epd only 20 people got S out of all the students LOL"
    },
    {
      "id": "m7g429c",
      "body": "The \"relative\" grading they do here is loosening the grade maps. They do not increase ESA weightage. However the exact way they do this is not transparent and depends on the course, not on the semester. Its just coincidental that people tend to fuck up more in odd semester courses."
    },
    {
      "id": "m7gexjd",
      "body": "Oh ok thanks!"
    },
    {
      "id": "m7k2ev0",
      "body": "thanks!"
    }
  ]
}