{
  "id": "1i2ofnu",
  "title": "maths esa",
  "content": "hi guys. i am a first sem student in the physics cycle. i made a fool of myself today ig. \n\nas soon as i saw the maths esa paper, i started crying and i sort of went blank (idk why) and so i did a really poor job on the esa.\n\nnow i'm worried that i'll do the same in all other subjects and effectively ruin my gpa and essentially get myself fucked in the future sems.\n\nfor context, i was aiming for an sgpa of 9+ (lmao) but now im scared it will barely cross 8-8.5 sgpa.\n\nis there any coming back from this? also, tips to manage anxiety before exams would be massively appreciated. tysm guys. ",
  "metadata": {
    "author": "DurianFriendly6901",
    "url": "https://www.reddit.com/r/PESU/comments/1i2ofnu/maths_esa/",
    "permalink": "/r/PESU/comments/1i2ofnu/maths_esa/",
    "score": 52,
    "created_utc": 1737032657,
    "flair": "Study Help :table:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "m7g0tmh",
      "body": "dw they will do relative grading in maths , if u are isa marks are good u will get good grade. Dont think about it now , just focus on the next subject . All the best 👍"
    },
    {
      "id": "m7g0x44",
      "body": "Was it that tricky ? Didn’t feel so ig lengthy the par if you covered class notes properly it should have done the deal lol"
    },
    {
      "id": "m7g122g",
      "body": "oh ok thanks for the reply. my isa grades are okayish - 27 in isa 1 n around 31 in isa 2.. so really hoping for the best"
    },
    {
      "id": "m7g18on",
      "body": "i mentioned in the post that i went blank so yes i could recognize the questions but it was kind of hard to answer after crying"
    },
    {
      "id": "m7g2pil",
      "body": "Yea you lost it there , had same morning shift questions did seem scary UNIT 4 was straight easy unit 2 n 3 were tricky not all straight forward ( solvable though ) unit 1 was direct so if you would have spent your time in Analysing questions you could have got many of them"
    },
    {
      "id": "m7g30lu",
      "body": "The math exam is done, and you can’t change that now. What you can do is focus on your other subjects to make up for it.\n\nIf you find yourself blanking out in an exam again, don’t panic. Skip the question, find the easiest one, and start there. Eventually, you’ll get into a flow. The key is to keep moving instead of freezing.\n\nI usually don’t study an hour or so before an exam, which helps me manage my anxiety. Instead, I chill, listen to music, or watch something on YouTube. A clear mind is always better than an overloaded one."
    },
    {
      "id": "m7g3un4",
      "body": "Don't be too hard on yourself; it's only your first ESA. \n\nI went through the same thing—I'd study everything, but fear would make me go completely blank during the exam. This happened to me a lot in my first semester, which probably explains why my Semester 1 sgpa the lowest I’ve ever had. Somehow, as I got more familiar with the exam patterns here and shifted my focus away from an obsessive concern with grades, I started to do so much better."
    },
    {
      "id": "m7g4586",
      "body": "yeah but i dont want it harm my cgpa :( here's hoping i make a comeback like you did"
    },
    {
      "id": "m7g4vt5",
      "body": "My math esa was 5 yrs ago and ur replies are still managing to annoy me 🤦‍♂️"
    },
    {
      "id": "m7g4x59",
      "body": "Yo there's no reason to be this cocky. What may seem easy for you isn't easy for everyone."
    },
    {
      "id": "m7g4xcg",
      "body": "5 words. \n\nIt is what it is. \n\nTry to do better next time"
    },
    {
      "id": "m7g518a",
      "body": "Wait what?"
    },
    {
      "id": "m7g55ni",
      "body": "yeah. really hope so"
    },
    {
      "id": "m7g6mzp",
      "body": "You can. I personally hated first year subjects. mechanics, physics epd especially were a pain in the ass so i never studied them properly.\n\n\n Math 1 was terrible for me but I had a really amazing teacher for math 2, and her notes were enough for me to get an A."
    },
    {
      "id": "m7gbhml",
      "body": "Hey its alright its ur first esa that too first sem. So many more to come a  lot of them will go well and a lot may not but it ll all be okay just do what you can to the best of yr capabilities."
    },
    {
      "id": "m7gcy1n",
      "body": "Chill out its your 1st exam , shathi :)"
    },
    {
      "id": "m7geh54",
      "body": "Dw,at the end you'll always get more than expected,you will see."
    },
    {
      "id": "m7gfbbc",
      "body": "If you have a CGPA >8 then you'll be shortlisted for almost 95% companies. So don't stress it out chill"
    },
    {
      "id": "m7gii8c",
      "body": "It's alright mate. We all were there in your position at some time. Hopefully they pass you since you're in first sem. If not, you still can improve in the backlog exam. All the best👍🏼✨."
    },
    {
      "id": "m7gincw",
      "body": "Can u DM me the math 2 notes link"
    },
    {
      "id": "m7giugt",
      "body": "It's been 2 years lol I don't have them. My point is make good notes in class, it saves you time."
    },
    {
      "id": "m7gj76k",
      "body": "Cannon event"
    },
    {
      "id": "m7glje1",
      "body": "If i get a backlog in 1st sem can I clear it in 2nd sem??"
    },
    {
      "id": "m7gm7av",
      "body": "it didn't go that bad ig like ill pass deffo but a or s grade is doubtful :("
    },
    {
      "id": "m7gn15p",
      "body": "Given the subject, even a B will do good ig."
    },
    {
      "id": "m7h0jdu",
      "body": "did u inherit this much cock from ur mom or dad?"
    },
    {
      "id": "m7h702f",
      "body": "Don't loose confidence. Similar happened with me too (and most of us). ESAs for other subjects will be a lot easier than Maths-1 ESA :-)"
    },
    {
      "id": "m7h8e2b",
      "body": "bro u don't have to behave this way"
    },
    {
      "id": "m7l84jv",
      "body": "Be respectful and considerate. OP is going through a hard time and they do not need your remarks."
    },
    {
      "id": "m7mfyid",
      "body": "I did d same shit thing for my ISA1 in math but my ESA one is lyk ok ok . R they gonna judge ESA by ISA’s ? What if our ISA’s r not good but ESA r better ..?"
    },
    {
      "id": "m7ml6sh",
      "body": "+1"
    },
    {
      "id": "m7rp5du",
      "body": "I understand your situation but you can increase your cgpa by working hard in next sems you don't believe my journey my sgpa was 4.55 with 1 backlog in 1st sem but I worked hard in next sems and graduated with cgpa of 7.19 and also got placed in MNC. so it's about your mindset you can increase your cgpa even if you get less sgpa that's fine try to aim for more from next sem. All the best 👍"
    },
    {
      "id": "m7sqfjt",
      "body": "I'll ask you one very important question, did you have 8+ hrs of sleep? If not, your mind goes blank and you start panicking in the exam. Happened to me multiple times. And chill, it's just the first exam. Almost 40% failed the MA1 esa in my batch lol because of online classes and 8.5 cgpa is pretty good. Don't be too hard on yourself this is literally sem 1 lol. You'll have time to worry abt cgpa later. Just focus on having fun and making the best of your clg life in first year"
    },
    {
      "id": "m7tbdma",
      "body": "no i did not :( i see a good chunk of seniors say this is the scoring year so if i fumble my bag here then it will cause a lot of regret.."
    },
    {
      "id": "m82e2x7",
      "body": "Stop stressing too much fam. If you have 8+ cgpa, you'll be shortlisted for like 95% of companies. After that, your cgpa won't even matter. It'll matter if you want to go for masters tho but you have 8 semesters. Sem 5 and 6 are usually the scoring sems actually since the subjects get easier and you can choose the electives you want. I have frnds with <6 cgpa who have 10+ lpa jobs and people with 8+ cgpa who didn't get a single offer. Everyone stresses about cgpa in the first year but as long as you consistently study, you'll be fine. Cgpa isn't everything. And get proper sleep before the exams lol or so many days of studying will get wasted because you can't function properly. Been there."
    },
    {
      "id": "m87hmch",
      "body": "Don't mess up first year. It will affect overall GPA, if you do."
    },
    {
      "id": "m89lpgl",
      "body": "yes that is my main concern :("
    },
    {
      "id": "m8bkyxs",
      "body": "You still have time. Don't screw up second sem...and you can take your backlog (if you incurred it) some other time. A word of advice try and not get below C grade in any other subject if you want to maintain your gpa to a higher bracket."
    }
  ]
}