{
  "id": "1i38mne",
  "title": "Bubbling error ",
  "content": "I accidentally bubbled two question numbers for a question in the last minute in the esa. The invigilator asked me to just point at the correct question number and told that they'll consider it, But I am skeptical about this. Should I contact someone regarding this? Will they consider the answer?",
  "metadata": {
    "author": "Tranquil_Maybe2345",
    "url": "https://www.reddit.com/r/PESU/comments/1i38mne/bubbling_error/",
    "permalink": "/r/PESU/comments/1i38mne/bubbling_error/",
    "score": 10,
    "created_utc": 1737088967,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "m7kxdsi",
      "body": "Yeah so basically if you have pointed it correctly they might have considered just chill, you have pointed it and if the invigilator says it  it will be fine"
    },
    {
      "id": "m7kyaic",
      "body": "A similar thing happened to my friend, they didn't consider that question for evaluation, despite him giving the paper for reval."
    },
    {
      "id": "m7l61j1",
      "body": "Don't want to burst your bubble (pun absolutely intended), but usually if you make an error while bubbling the question number, the system just skips it because it cannot map it to a valid question. Remember that answer sheets are scanned and sheets are mapped to questions based on the corresponding bubbling. Re-eval doesn't usually help either because that sheet is never registered as part of your submitted answer. \n\nYou can try reaching out to COE, but since this is something that requires manual intervention, it's unlikely they will (or want to) do anything about it. The only time they go out of their way to fix bubbling errors is if you bubble your SRN/PRN (whatever you fill on the first page) or name incorrectly, because in these cases your entire answer sheet cannot be mapped to anything."
    },
    {
      "id": "m7l6ue1",
      "body": "They did evaluate unmarked questions in the first ISA's during the re-eval. That's my only hope now. I will contact the COE nevertheless"
    },
    {
      "id": "m7l7o5y",
      "body": "Yep do reach out. Them fixing bubbling errors is usually an exception and not the norm (like another commenter posted), so don't have high expectations."
    },
    {
      "id": "m7m8gaz",
      "body": "Oh no you are beyond cooked"
    },
    {
      "id": "m7rlfkp",
      "body": "Give it for reval"
    },
    {
      "id": "mswegrd",
      "body": "Any updates? \nDid you get marks for it?\nDid they consider"
    },
    {
      "id": "msww26c",
      "body": "Yes. I gave a letter to the COE right after, and they evaluated it."
    }
  ]
}