{
  "id": "1i49yt0",
  "title": "Are extra courses to complete credits instead of internship not available for 4th year students anymore?",
  "content": "So I came across a lot of people in my batch saying that courses for completing your remaining credits (6) in 8th semester instead of internships are no longer available and it is mandatory to find an internship somewhere to get those credits? Now, the problem is, they are now indirectly forcing us to intern at PES research centers to get the remaining credits, for people who couldn't secure an internship yet. The problem with me personally is that the conditions for working there are just too much for me to handle, like 8 hours of work per day for 5 days a week, from February to May, and it is going to be unpaid. If any senior is reading this, please answer, did the college management put forth such conditions for you guys too? Or you could select your special topic courses beforehand itself? Because as I earlier stated, we can't apparently select to do courses instead of an internship anymore. If anyone has more information regarding this and is willing to inform me and others here, it would be highly appreciated. Thank you very much.",
  "metadata": {
    "author": "Limp-Net8000",
    "url": "https://www.reddit.com/r/PESU/comments/1i49yt0/are_extra_courses_to_complete_credits_instead_of/",
    "permalink": "/r/PESU/comments/1i49yt0/are_extra_courses_to_complete_credits_instead_of/",
    "score": 12,
    "created_utc": 1737214325,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "m7ti2az",
      "body": "From whatever I've read on discord and reddit, it appears this is a new rule introduced from this year onwards for your batch. Previously, if you didn't secure an internship, you had to take up a minimum of 3 special topics (2*3=6 credits) to meet the remaining credit requirement for your degree. \n\nWhile I understand that doing an internship is more useful than doing a few random courses, the fact that it's an unpaid internship which requires full time working hours isn't justified."
    },
    {
      "id": "m7tiddc",
      "body": "Alongside internship we got to choose only one special topic. So i don't think so there's any other way you could compensate the internship credits with other courses. Even if you, it's gonna be hectic in my opinion. Just do the PESU research centre internship and don't worry about the unpaid part. At least you're getting credits."
    },
    {
      "id": "m7tj2r7",
      "body": "Alongside internship we got to choose only one special topic. So i don't think so there's any other way you could compensate the internship credits with other courses. Even if you, it's gonna be hectic in my opinion. Just do the PESU research centre internship and don't worry about the unpaid part. At least you're getting credits."
    },
    {
      "id": "m7tpf8d",
      "body": "I hope they would provide an option to make us take courses later in the near future. Because the ma'am that announced the internship details told us to apply only if you can meet these conditions. Also I don't think they have enough room to accommodate everyone in research centers I feel. And I personally disagree that doing 3 more courses is going to be hectic for me. I did 5 special topic courses in 7th sem together and it was not hectic whatsoever."
    },
    {
      "id": "m7tqaj3",
      "body": "Yeah, you get it. That's a lot of hours I'd need to put in. Personally I hope that they'd later give us an option to just take additional courses instead as I don't think everyone can get an internship in these centers for research as I've heard the number of people like me is a lot, and the madam that announced the internship details told us to not apply if we don't agree to the conditions of the internship. When I asked her today what happens if for some reason I don't get selected in the center of research too, she herself didn't know and told me to ask the department instead. And thanks for replying."
    },
    {
      "id": "m7ttyp3",
      "body": "Just want to also add in that while I disagree with it being unpaid, you should know that working 8 hours x 5 days is standard full time hours anywhere, whether it's at PES or outside for a company. You'll be expected to put in at the very least those many hours on a regular basis, and maybe sometimes more. So saying that it's a \"lot of hours\" isn't helpful."
    },
    {
      "id": "m7tx39p",
      "body": "In the course curriculum, it is clearly mentioned internship as a compulsory part(like an actual course) alongside one special topic and capstone phase-3. So you have no option but to do the internship."
    },
    {
      "id": "m7xelq4",
      "body": "If a student gets 3 months internship during summer does he still need to do internship in 7 sem"
    }
  ]
}