{
  "id": "1i4wpd5",
  "title": "Mechanical. How to.",
  "content": "Yeah, mechanical(p cycle) has gone pretty bad in isa's, how do I prepare for esa cuz the regular method of study isn't working and I can't really byheart a lot of things.",
  "metadata": {
    "author": "Bitter_Front226",
    "url": "https://www.reddit.com/r/PESU/comments/1i4wpd5/mechanical_how_to/",
    "permalink": "/r/PESU/comments/1i4wpd5/mechanical_how_to/",
    "score": 15,
    "created_utc": 1737287025,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "m7yvwoz",
      "body": "this subject better be relative bro 😭  \neverytime it deviates from pattern, have to just byheart everything atp"
    },
    {
      "id": "m7ywhxo",
      "body": "\nDo all the numericals from your slides and PYQs properly. You'll definitely get a few of these in your ESA, and you can easily score 20 marks just from them.\n\nThe rest is mostly diagrams and memorizing stuff, so it all depends on how good you are at remembering things."
    },
    {
      "id": "m7ywmd1",
      "body": "Mug up slides 🙏🏻"
    },
    {
      "id": "m7z57jy",
      "body": "u need to mugup slides for mechanical ,  \nthats the only way   \nall the best 👍"
    },
    {
      "id": "m7zoqv5",
      "body": "1)See the PYQ's there are a bunch of questions which have a higher probability of coming in the paper \n\n2) try to watch videos to understand the process and write it on your own words \n\n3) this method worked for me you can try it too. I am better at remembering diagrams and pictures so I used to draw and learn the processes from diagrams and I also used to make mindmaps to recall\n\n4) distribute your syllabus into smaller subtopics and learn one at a time, focus on understanding rather than by hearting it \n\n5)If you can relate what you learn to real life examples so you can recall it better in the exams\n\nHope this helps"
    },
    {
      "id": "m8i5kbq",
      "body": "lmao mechanical is my best subject, why are you struggling in it though"
    }
  ]
}