{
  "id": "1i70yzd",
  "title": "ECTS conversion",
  "content": "Does anyone know how to convert credits to ECTS? I don't find pesu handbook unlike other universities. If there is an alumni who has done this please let me know",
  "metadata": {
    "author": "No_Engine4660",
    "url": "https://www.reddit.com/r/PESU/comments/1i70yzd/ects_conversion/",
    "permalink": "/r/PESU/comments/1i70yzd/ects_conversion/",
    "score": 8,
    "created_utc": 1737514275,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "m8h034p",
      "body": "You might get quicker responses on the PESU Study Abroad discord server"
    },
    {
      "id": "m8h087m",
      "body": "Can you share the link please"
    },
    {
      "id": "m8h0akw",
      "body": "DM me"
    },
    {
      "id": "m8h18qf",
      "body": "Check dm"
    },
    {
      "id": "macqnbi",
      "body": "Please share the link\nI need to convert 176 credits to ECTS too.\nAny idea on that?"
    },
    {
      "id": "madow3c",
      "body": "Someone posted it on the server. DM me for the link."
    },
    {
      "id": "na9dgff",
      "body": "Hey did you find how to?"
    },
    {
      "id": "na9ep8s",
      "body": "Well i found out that \"4 years degree in india is considered as 3 years in Germany\" so it's only 180 ECTS"
    },
    {
      "id": "na9l48y",
      "body": "Will this cut off for TU berlin masters ? Where they have specific subject requirements? So it's basically 1 pes credit is around 1.1 1.2? "
    },
    {
      "id": "na9laeo",
      "body": "Basically you can apply to courses with 4 semesters not 3 semesters"
    },
    {
      "id": "na9li72",
      "body": "Ahh i see. But this would be met right?\nA total of 36 credit points in the fundamentals of computer science, with\n\n\n12 credit points in theoretical computer science,\n\n\n12 credit points in computer engineering or information technology,\n\n\n12 credit points in methodological-practical computer science.\n\n\n18 credit points in mathematics, with a minimum of 30 further credit points in computer science. The bachelor's thesis may not be used to make up these 30 credit points."
    },
    {
      "id": "na9llfz",
      "body": "Also are you pursuing masters now or are you planning for the next intake? "
    },
    {
      "id": "na9lpsv",
      "body": "Yesss"
    },
    {
      "id": "na9ofo3",
      "body": "Also are you pursuing masters now or are you planning for the next intake? "
    },
    {
      "id": "na9olkp",
      "body": "Yes I'm starting my studies this October"
    },
    {
      "id": "naas2i2",
      "body": "May i know as to which country you are pursuing in? If Germany how'd you convert your grade to their system? What's the min grade you took for the calculation? "
    },
    {
      "id": "nadgc48",
      "body": "Bremen, Germany \nUse TUM grade conversion calculator which is available online for free\nMinimum gpa is 5"
    },
    {
      "id": "nadgwgo",
      "body": "Oh then i think I'm screwed. I'm getting a 2.0 with min gpa as 5.\nSo tu9s are out of the picture then? \n\n\nAlso for University of berlin I'm not meeting the theoretical computer science ects i beleive they require 12 ects. Pes's compiler design isn't taken into consideration so i only have 6.\n\n\nAlso do you recommend any uni for ai/ml or distributed systems masters preferably Germany"
    },
    {
      "id": "nadhd35",
      "body": "Naah, 2.0 is good (I mean average), most of the universities give points while selecting students.\n\nFor example: \n1 - 1.5 ~ 40 points\n1.6 - 2.0 ~ 30 points and so on\nYou gotta score well in a motivation letter and exam (if they conduct), so give it a try\n\nI don't have much idea about cs courses, try using daad website to shortlist your courses and yeah most of my friends had 2.0 and above gpa who are studying ai or ds courses in Germany. So I think you can also try.\n\nAll the best ✌️"
    },
    {
      "id": "nadho2v",
      "body": "Thanks a lot for the info! If it’s not too much trouble, could you maybe connect me with some of your friends who are studying AI/DS in Germany?"
    },
    {
      "id": "nadhtjs",
      "body": "Check dm"
    }
  ]
}