{
  "id": "1i824r4",
  "title": "Welpppp",
  "content": "So see, I am a freshie...CSE...my internals very average...like equal to every overall average of the subject lmao...so I managed to score like 30 of 50 in maths ISA 1, 2 and assignments (Matlab).... similarly with EPD... 28 of 50... I though to get a come back kind in ESAs, Maths I was sick like f, and EPD, I barely could study, not that I wasn't able to study, smthg personal work had come in past 2 days....both I am able to score a max of 40 50....was it a good thing to uk, attempt the exam and pass with low grade, or was it better to withdraw the course instead?? LIKE see, I ain't a weak stud, but if I had things in my hand properly, pretty sure, I would have settled atleast with a A, but these 4months, it was shit, something or other would come up....\n\nSo seniors please helpp....was it a good thing to have attended the ESAs or better had to withdraw the course instead??",
  "metadata": {
    "author": "beastmaxop",
    "url": "https://www.reddit.com/r/PESU/comments/1i824r4/welpppp/",
    "permalink": "/r/PESU/comments/1i824r4/welpppp/",
    "score": 20,
    "created_utc": 1737634966,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "m8ps2gc",
      "body": "Yes rarely anyone withdraws as u  never know Abt the future and dealing with 1 more subject in the future becomes really difficult"
    },
    {
      "id": "m8psjyp",
      "body": "true true, so it wasnt a bad decision right, giving ESA and passing with Low grades, maybe I can put those same backlog efforts to other subjects in next sem, am I right??"
    },
    {
      "id": "m8pvcn3",
      "body": "dont withdraw enol.....nothing is lost as of yet.....u got plenty of time to do good"
    },
    {
      "id": "m8pwvd1",
      "body": "Yes u won't get that low also people have scored bs and cs with worse internals"
    },
    {
      "id": "m8uv98c",
      "body": "Bro, you have the confidence, right? For the upcoming semesters, you need to prepare simultaneously along with your regular subjects. Otherwise, choose the summer term. If you prepare well, you can get a maximum of A or at least a B. So, don't be lazy.\n\nIf you need to pass easily, take the exam seriously now. Put in some effort, and you'll get a C—it’s easy because you already have 30 marks from the ISA final."
    }
  ]
}