{
  "id": "1i9ppwh",
  "title": "Expectations vs reality",
  "content": "How are the marks given in esa like how linient is the correction done in sem1?",
  "metadata": {
    "author": "Parking-Ad5556",
    "url": "https://www.reddit.com/r/PESU/comments/1i9ppwh/expectations_vs_reality/",
    "permalink": "/r/PESU/comments/1i9ppwh/expectations_vs_reality/",
    "score": 12,
    "created_utc": 1737820013,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "m93ud24",
      "body": "Usually  u get as much as u expected or more, nothing less than that. Dk why u guys are so anxious abt results just focus on ur exams ."
    },
    {
      "id": "m93v6gd",
      "body": "Bcz epd paper was shit(for me atleast)"
    },
    {
      "id": "m93w80v",
      "body": "Same bro, my eee paper went shit,i mean it was easy according to ppl but i fucked up,so im scared."
    },
    {
      "id": "m93ynm7",
      "body": "Corrections are usually standard. You mostly get what you expect based on what you write. They are not lenient, but at the same time, you won't be penalised heavily for minor mistakes or silly errors. \n\nCorrections are also standardised: profs who are correcting papers are each assigned a specific subset of questions and are responsible for evaluating *all* answers for those questions. So although your paper gets evaluated by multiple profs, each answer is evaluated by the same prof for all students. This ensures that your answer and your friend's answer to the same question are both assessed with the same level of leniency/strictness.\n\nTo summarise, corrections are usually standard. You get what you deserve."
    },
    {
      "id": "m9nuv4f",
      "body": "It depends on the teachers lol."
    },
    {
      "id": "m9o7st3",
      "body": "This part sucks"
    },
    {
      "id": "m9s9gv3",
      "body": "First year is difficult but you'll get through it. Remember the marks you get in first year matters too...a word of advice don't get anything below C if you want a high gpa."
    }
  ]
}