{
  "id": "1iagjz1",
  "title": "Wifi login id please",
  "content": "They have provided login ids for each student , but it has limit to only one device, we hostelers are dying from past 4 days, they almost blocked all wifi ids, please help!!",
  "metadata": {
    "author": "Strikeout1311",
    "url": "https://www.reddit.com/r/PESU/comments/1iagjz1/wifi_login_id_please/",
    "permalink": "/r/PESU/comments/1iagjz1/wifi_login_id_please/",
    "score": 4,
    "created_utc": 1737903455,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "m99yn4n",
      "body": "connect on phone and use hotspot right.  \nthat's what i do."
    },
    {
      "id": "m9aiogk",
      "body": "Or connect to the laptop (windows) and turn on the hotspot...."
    },
    {
      "id": "m9ctfdf",
      "body": "this works too, but i don't want to open laptop all the time."
    },
    {
      "id": "m9mbx6f",
      "body": "Are you a day scholar or smth? Cuz if you are a hosteller, you'll however be in your room, you can just keep it open and increase that screen lock timer... And you can actually do it in class also tbh, just log it in, keep your lappy under the desk or on the desk and change those power settings, closing the lid makes the laptop sleep"
    },
    {
      "id": "m9mejvh",
      "body": "I am a day scholar, But its not like connecting it to ur phone has any disadvantage?"
    },
    {
      "id": "mc020m2",
      "body": "Do you mean connecting to the phone via laptop? Or directly?"
    },
    {
      "id": "mc025lg",
      "body": "And yeah there's a new authenticator tool which eventually lets you unbind all the MAC addresses which your account is logged in to. Not completely sure....."
    },
    {
      "id": "mcddfmm",
      "body": "like connecting ur phone directly to the college wifi and then hotspoting ur laptop to it."
    },
    {
      "id": "mi86a7o",
      "body": "See the thing is you need to use device mac if you connect it through your mobile. If you use a randomized mac, you will be locked out of the portal and you have to mail them or wait for automatic logout, which sometimes takes months also who knows..."
    }
  ]
}