{
  "id": "1ic3f9l",
  "title": "CGPA Distribution",
  "content": "When the Vice Chancellor shows the distribution of CGPA, what does the percentage of the CGPA mean is it for the entire batch or is it calculated in another way ?? And are the scholarship given on CGPA based on the number of students or is it fixed ???",
  "metadata": {
    "author": "AKPRO30",
    "url": "https://www.reddit.com/r/PESU/comments/1ic3f9l/cgpa_distribution/",
    "permalink": "/r/PESU/comments/1ic3f9l/cgpa_distribution/",
    "score": 6,
    "created_utc": 1738076376,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "m9nm0yh",
      "body": "Huh, its weird that you aren't aware of simple statistical distributions. It means that x% of your batch has scored between each interval of GPAs. This is assuming that this is what they showed you.\n\nScholarships have both a GPA and number of students criteria. For example, you need > x SGPA and need to be in the top y% of performers who got above x SGPA to qualify for MRD/CNR (whatever its called) scholarship."
    },
    {
      "id": "m9nnvua",
      "body": "The percentage didn't add up to 100 for each of the intervals of GPAs so I couldn't understand what logic they had used there, at first even I assumed the same just as you said in the beginning"
    },
    {
      "id": "m9no6n4",
      "body": "PESU level math, what do you expect. It's also possible they aren't showing for all GPAs lmao.\n\nJokes aside, if you can share a screenshot of the recording maybe others can help. Can't say anything without looking at what they are showing."
    },
    {
      "id": "m9nopaq",
      "body": "https://preview.redd.it/gplfer7zfrfe1.jpeg?width=3847&format=pjpg&auto=webp&s=2372d40a603cd48b90c494aa11cf2acbee423445\n\nThis was what the Vice Chancellor showed us today"
    },
    {
      "id": "m9nqkfs",
      "body": "It's cumulative. And the titles are stupid. Should've just been like \"7.5 and above\"\n\nBut yeah, like rowley bro said. If you really couldn't understand what this means you should probably get some more math skill lmfao"
    }
  ]
}