{
  "id": "1icw6vf",
  "title": "What is this sessional sheet bs? can i see everybodys marks and will they show final isa?",
  "content": "",
  "metadata": {
    "author": "According-Reveal-954",
    "url": "https://www.reddit.com/r/PESU/comments/1icw6vf/what_is_this_sessional_sheet_bs_can_i_see/",
    "permalink": "/r/PESU/comments/1icw6vf/what_is_this_sessional_sheet_bs_can_i_see/",
    "score": 16,
    "created_utc": 1738164116,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "m9u7oqf",
      "body": "??"
    },
    {
      "id": "m9u7wc5",
      "body": "what?"
    },
    {
      "id": "m9u84ir",
      "body": "What is sessional sheet"
    },
    {
      "id": "m9u8cmd",
      "body": "its a sheet with your isa marks on it and you have to sign it apparently"
    },
    {
      "id": "m9u8k8d",
      "body": "Ohh Ohkk , which we have to sigh Tom rgt"
    },
    {
      "id": "m9u8nv6",
      "body": "Ohh Ohk , which we have to sign Tom rgt"
    },
    {
      "id": "m9u8oe6",
      "body": "yes do you know the process? or anything"
    },
    {
      "id": "m9u8x9b",
      "body": "We just have to go to our respective lab and just sign it ig"
    },
    {
      "id": "m9u9kcy",
      "body": "on paper? so i can see everyones marks💀"
    },
    {
      "id": "m9u9txb",
      "body": "Its a sheet which lists all your marks scored across ISAs for every course. Yes you can see everyone's marks (this is PES, do not expect data privacy). I do not remember if they show final ISA, as far as I remember, they do not."
    },
    {
      "id": "m9u9xvo",
      "body": "Maybe☠️"
    },
    {
      "id": "m9ub0c0",
      "body": "are there teachers present there? and is it classwise the list?"
    },
    {
      "id": "m9ubtv0",
      "body": "You are overthinking it lol. We had to go to the department office and sign; nobody there cares about how much you have scored - they just want you to sign and move so others can sign it. The sheet used to be ordered by SRN for us, not sure about it now.\n\nDon't overthink it - nobody out there cares about how much others have scored. Once you sign the sheet, the marks are finalised and entered into the system. People are more concerned with their correct marks being entered. And yes, there can be errors, so check thoroughly."
    },
    {
      "id": "m9uc5da",
      "body": "okayy thanks alot rowlet 🙏"
    },
    {
      "id": "m9ufuyk",
      "body": "Yes you can see other people's marks"
    },
    {
      "id": "m9uoihp",
      "body": "great 💀 and how will i know that they corrected my marks if I encircle it"
    }
  ]
}