{
  "id": "1id9fil",
  "title": "Pls help",
  "content": "If I have something of a 4 sgpa in the first sem of Chem cycle but I have taken cse and I actually find that better but I suck at solving problems of mech, Epd and those subjects will I be able to pull up to 9 at the end of 4 years and also will physics cycle be tougher considering i start consistently before the Sem even starts ",
  "metadata": {
    "author": "shimmyshimmy12",
    "url": "https://www.reddit.com/r/PESU/comments/1id9fil/pls_help/",
    "permalink": "/r/PESU/comments/1id9fil/pls_help/",
    "score": 7,
    "created_utc": 1738197347,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "m9xdttv",
      "body": "in physics cycle rn and all i can say is good luck"
    },
    {
      "id": "m9xrrke",
      "body": "https://preview.redd.it/72f0aetze1ge1.png?width=505&format=png&auto=webp&s=959b05698ae2232354877ede71b0348fa536b385\n\nAs you can see from the calculator (check FAQs), if you get a 4 SGPA this semester, the only way you can cross is if you can get a perfect 10 *every* semester onward, *including* the *tougher* physics cycle semester. Also you should know that CS isn't about writing those tiny snippets of code you write in Python class/lab. There is a lot more to it, and a lot of CS is theoretical and many courses are challenging. First year (and specifically, chem cycle) is the lightest and easiest year and forms the foundation of your GPA. I won't sugarcoat it: you've fumbled big time.\n\nHard work and consistency go a long way, my dude. You were given enough advice about academics being rigorous here and how you will need to start putting in effort early and regularly to do well. The people who excel academically here are the ones who aren't just smart but also know when and how to work hard.\n\nI hope you turn things around, good luck."
    },
    {
      "id": "m9yheah",
      "body": "Phy cycle is harder ngl"
    },
    {
      "id": "m9zifnu",
      "body": "the thing is its not hard like concepts are easy but when it comes to scoring i underperformed and though most of us put in consistent efforts the problem is still somehow stuff pile up and on the day of the exam we aren't 100 % prep focus on these stuff (sem1 kid here)"
    },
    {
      "id": "ma4yuw3",
      "body": "Hello can I dm you?"
    },
    {
      "id": "ma513z3",
      "body": "Yep sure."
    }
  ]
}