{
  "id": "1idhmbu",
  "title": "anyone from ba llb department ???",
  "content": "HELPPPP\n\nok i am in 12th currently and i got into pes ba llb course but since its not much knows for law i am kinda scared .... is its really worth studying law in pes ???   \ncuz i can easily get admission in christ and there is still time for christ enterance its just tht i am lazy to travel so much to christ ....   \n",
  "metadata": {
    "author": "gwenchana_gwenchana0",
    "url": "https://www.reddit.com/r/PESU/comments/1idhmbu/anyone_from_ba_llb_department/",
    "permalink": "/r/PESU/comments/1idhmbu/anyone_from_ba_llb_department/",
    "score": 3,
    "created_utc": 1738222025,
    "flair": "PESSAT/Admission",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "m9z4cwu",
      "body": "Be kinda scared only and don't join"
    },
    {
      "id": "m9z4gym",
      "body": "whyyy"
    },
    {
      "id": "m9z4jby",
      "body": "Like that only"
    },
    {
      "id": "m9z4m0m",
      "body": "brother you are not helping"
    },
    {
      "id": "m9zdxxk",
      "body": "It just depends on how you take it , as the notes and slides and the reference books everything will be provided. There is a huge library too from where you can access the reference books. \nBut ya you can’t expect to have half days or any of that sort you’ll be having classes till 4 if the morning timings are 8 then the classes will be up to 4 if the morning class starts at 8.45 class goes till 4.45\nYou’ll be having running internship from 5th sem which is 3rd year. You’ll have to attend Clg till 1-1.45 and then go for internship after the classes.\nAnd from 2yr or 2nd sem you’ll have an dedicated hour for legal eagle , it’s basically you need to sit and write the topic or the case they give you and in a week there will be an open hour.\nTeachers are good at times helpful to.\nBut the attendance thing is very strict if you are late even for a minute they won’t allow you no matter what (some teachers allow)\nIf you have legal eagle then that attendance will also be calculated and divided into the other subjects."
    },
    {
      "id": "m9zncmv",
      "body": "i am not talking about the attendence notes classes cuz they already told me this when the person called me for admission ... my concern is the reputation of tht clg for dept and how it will help me in future ,i.e might be future studies or placements"
    },
    {
      "id": "m9zqagz",
      "body": "Don’t trust what they say when you call them we to were promised a lot of things and were said many things it never happened and our batch still cusses that admission person."
    },
    {
      "id": "m9zs1if",
      "body": "again u are missing my question .... placements future studies options ?"
    },
    {
      "id": "m9zttfl",
      "body": "For that u need to go talk to any faculty or any alumni, as far as ik law here started recently so there are no much alumni for law department"
    },
    {
      "id": "ma040iz",
      "body": "Bruh are you really making decisions on which college to choose based on which one is less tiring to travel to? You do realise these are often career defining decisions right? Choose what's best for your career, everything else is secondary. Wtf do you mean by you're too \"lazy\". Be a little more serious about your career. Nobody else will care about it except you."
    },
    {
      "id": "ma04qxp",
      "body": "if i join christ after maybe a month i probably never end up going to campus cuz its very far from the place i stay .... so i need a uni which is a bit more comfortable to travel but at the sametime has enough reccognition in tht field of education   \nand the exact point of this post was to understand if pes is good enough for law as of my career plans and further education   \ntht clearly shows tht i a serious about the place i am opting for"
    },
    {
      "id": "ma0bxgo",
      "body": "You yourself said that PES is \"not known for law\" in your original post. And given this statement, you also know that Christ is a much better option. You already know the answer, you're just here to seek validation for your laziness. When choosing colleges, choose what's best for you, not \"good enough\". \n\nStop fooling around. \n\n> maybe a month i probably never end up going to campus cuz its very far from the place i stay\n\nThat's a you problem. If you can't be bothered to attend college because it's far, then it shows how serious you are about your degree."
    }
  ]
}