{
  "id": "1ieezb5",
  "title": "RV vs PES Semi Finals!",
  "content": "Go vote [here](https://www.instagram.com/reel/DFfcWPIzN35/?utm_source=ig_web_copy_link)",
  "metadata": {
    "author": "Tetsuya17",
    "url": "https://www.reddit.com/r/PESU/comments/1ieezb5/rv_vs_pes_semi_finals/",
    "permalink": "/r/PESU/comments/1ieezb5/rv_vs_pes_semi_finals/",
    "score": 49,
    "created_utc": 1738330761,
    "flair": "Pride Of PESU",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ma6zhnp",
      "body": "Once again requesting all PESts to go make our supreme overlord proud by spreading the Pride of PESU\n\n![gif](giphy|egDHVpiXAESXJ14ZE1)"
    },
    {
      "id": "ma7ndf9",
      "body": "Dude which year and which branch are you studying in?"
    },
    {
      "id": "ma7nqph",
      "body": "5th year, Defence against the Dark Arts (at PESU)"
    },
    {
      "id": "ma7pc6c",
      "body": "cRuCiO !!"
    },
    {
      "id": "ma7s3og",
      "body": "We call that spell the ESAs here"
    },
    {
      "id": "mabmaic",
      "body": "This match is not suited for semi finals. Its made for finals"
    },
    {
      "id": "mabzk1x",
      "body": "The one that changes every year?"
    },
    {
      "id": "madorij",
      "body": "Yes, PES finds new dark art techniques every year to always keep everyone on their toes"
    },
    {
      "id": "madqaw9",
      "body": "Bro are you unplaced? No one wants your 'wannabe cool reply'\nBe a professional \nJust answer the question \nDon't act too smart"
    },
    {
      "id": "madqjd1",
      "body": "Yeah man, currently unemployed :(\n\n>!Check my post history for what I'm upto<!"
    },
    {
      "id": "madz1g6",
      "body": "Hey! Watch your tone with Rowlet-Owl! He’s the one and only guardian angel (or should I say *guardian owl*) keeping our little PES Reddit kingdom from total chaos. Show some respect, peasant."
    },
    {
      "id": "mah4tes",
      "body": "First read the comment properly peasant!\nNo one wants his wizarding world reference \nJust told him to answer properly kiddo"
    },
    {
      "id": "mahbjjr",
      "body": "Upvotes say otherwise 🤡"
    },
    {
      "id": "maioijs",
      "body": "The reason for your unemployment is this"
    },
    {
      "id": "majxnmd",
      "body": "Lmao, you don't know shit about me."
    },
    {
      "id": "mak3wu7",
      "body": "Ok Gilderoy Lockhart"
    },
    {
      "id": "makdpvg",
      "body": "If you have really achieved some shit \nYou should be able to tell it straight \nYou don't even have the guts to say your status and you give answers like a loser(5th year Lmao)\nGilderoy Lockhart"
    },
    {
      "id": "makenwq",
      "body": "DM me, I'll send you my LinkedIn. You can judge for yourself. Or go check my post history. You'll find more about me. \n\nYou're just making a fool out of yourself here lmao."
    },
    {
      "id": "makf07y",
      "body": "Lockhart I just asked your year and branch\nYou are not even confident to tell it straight and give answers like a kid"
    },
    {
      "id": "makgq9d",
      "body": "Well I don't owe you or anyone else an answer. If you're really curious, as I said, my profile is on my reddit or you can DM. Maybe stop trying to be cool and actually comprehend an answer when I give you one."
    },
    {
      "id": "makj3u0",
      "body": "That's what I said stop being cool"
    },
    {
      "id": "makklce",
      "body": "Ok thanks for answering in DM,hope you get a job you have tried enough"
    },
    {
      "id": "makmb37",
      "body": "You literally did not DM me? Not sure what you are trying to prove here my man.  \n\nGood luck cracking JEE when you cannot crack a walnut at this rate."
    },
    {
      "id": "makroc1",
      "body": "My guy, you clearly don’t know anything about Rowlet.\n\nJokes aside, he’s one of the most helpful people in this sub. He consistently clears everyone’s doubts and goes out of his way to guide others as an alumnus, even when many ignore posts like yours.\n\nSecondly, whether he is unemployed or not (he's pursuing his master's, afaik), that doesn’t justify insulting him. There’s no reason to be disrespectful.\n\nLastly, this community values mutual respect. If you don’t fit in here, you’re welcome to leave.\n\nHope that’s clear to you"
    },
    {
      "id": "mapjccv",
      "body": "I have already cracked my nga,\nGood luck cracking a job when you cannot crack a straight answer"
    },
    {
      "id": "maqmjk8",
      "body": "Still haven't managed to check my profile or DM, have you? What happened, too scared to be proven wrong? Keep living in your delusion my dude."
    }
  ]
}