{
  "id": "1ief0qo",
  "title": "PHY CYCLE?",
  "content": "To the people from physics cycle what were the resources that helped y’all clutch the semester. Would really appreciate it if you guys share the YouTube channels or the sources from where u studied from (or wished you would’ve studied from but found out too late) .",
  "metadata": {
    "author": "Old-Car8159",
    "url": "https://www.reddit.com/r/PESU/comments/1ief0qo/phy_cycle/",
    "permalink": "/r/PESU/comments/1ief0qo/phy_cycle/",
    "score": 16,
    "created_utc": 1738330878,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ma70arz",
      "body": "Chill for 1 week bro 😭"
    },
    {
      "id": "ma760zz",
      "body": "For physics, Faisal Sir’s slides are the best, but actually pay attention in class if your professor is decent. the course is poorly structured and i wouldn’t have understood a lot of weird topics if I hadn’t listened.\n\nFor electrical, class notes and slides are more than enough. It’s the easiest subject in the physics cycle.\n\nMechanical is just mindless memorization. It wasn’t hard, but if you start two days before the exam, you’re screwed."
    },
    {
      "id": "ma774q2",
      "body": "For physics, Faisal Sir’s slides are the best and you can find them on discord. but actually pay attention in class if your teacher is decent. the course is poorly structured and i wouldn’t have understood a lot of weird topics if I hadn’t listened.\n\nFor electrical, class notes and slides are more than enough. It’s the easiest subject in physics cycle.\n\nMechanical is just mindless memorization. It wasn’t difficult imo, but if you start two days before the exam, you’re screwed.\n\nalso man just calm down and enjoy your 10 days off, forget college exists."
    },
    {
      "id": "ma8gapb",
      "body": "adding onto this, for C language, pesu notes are amazing, use them, guaranteed S grade.\n\nmath 2 is chill if you do all CW problems + gajendra purohit videos on youtube\n\nall the best & enjoy ur break, sm time to think ab studies"
    },
    {
      "id": "mabpej2",
      "body": "Pesu notes or slides?"
    },
    {
      "id": "macda52",
      "body": "Is gajendra purohit necessary to watch? I didn’t watch him for math1 and did only class notes and scored decently well…how hard is math2 as compared to math1"
    },
    {
      "id": "mb7xy87",
      "body": "Math 2 is almost entirely multiple variable integration, and there are a lot of formulas and problems, so yeah people tend to find it harder than math 1.  Some concepts like laplace and fourier transforms will really kick your ass if you don't listen in class, so please be attentive and take proper notes, sit in the front bench if you have to and torment your teacher with doubts if you're unable to understand anything. You'll have one easier unit on probability which has barely 4-5 topics and literally just involves substituting values in your calculator. I did better in Math 2, so it depends on the person."
    }
  ]
}