{
  "id": "1ifzk8d",
  "title": "dsa",
  "content": "planning to start dsa(just got done with my 1st sem) is the striver dsa course along with leetcode problems or do we need anything extra to start off with?",
  "metadata": {
    "author": "Regular-Beautiful-71",
    "url": "https://www.reddit.com/r/PESU/comments/1ifzk8d/dsa/",
    "permalink": "/r/PESU/comments/1ifzk8d/dsa/",
    "score": 17,
    "created_utc": 1738509929,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "makfk6m",
      "body": "Please start right now ! You will have to learn Algorithms (Time and Space Complexity along with Algorithmic Analysis) before you do actual high level DSA ! Learn graph based algorithms and other imp ones. You'll thank your future self for starting early"
    },
    {
      "id": "makn3r1",
      "body": "Its a little too early for DSA. You should focus on learning C thoroughly first. Most people choose C/C++ to solve DSA and prepare for placements. Also, this isn;t the time to prepare for placements either. You are just in 2nd sem: you have a lot of time for this. Now is the time to actually learn things, figure out your interests, build projects and develop skills in your field of interest and so on. People seriously take up placement prep only from 5th sem, with 90% of them doing it only from 6th sem.\n\nThere are more details on FAQs about this if you'd like a more detailed version."
    },
    {
      "id": "maktni1",
      "body": "So do you recommend web/app development or aiml or smthng like that before DSA?"
    },
    {
      "id": "manzwg0",
      "body": "I woulf argue that while they are useful, hands on experience with programming is just as useful. BUILD STUFF >> grind DSA as you start off life.\n\nYou get two things from that,\n#1 the ability to get a job, irrespective of placements \n#2 early valudation that you are doing something you can do for the next 20 years"
    },
    {
      "id": "maoxu12",
      "body": "Neetcode sheet but keep exploring."
    },
    {
      "id": "marg2ex",
      "body": "try [codeintuition.io](https://www.codeintuition.io)"
    },
    {
      "id": "maxd2do",
      "body": "Depends on your interests, but yes: find your niche."
    },
    {
      "id": "maxnhsd",
      "body": "thanks"
    },
    {
      "id": "maydcyv",
      "body": "DSA first always, get a hold on a particular language, it will definitely help you in dev as well."
    },
    {
      "id": "maydq4o",
      "body": "Striver's is excellent for DSA, and the links that are provided in the striver sheet for a particular problem are leetcode problem links, so yeah, they're almost one and the same."
    }
  ]
}