{
  "id": "1igpe1x",
  "title": "Uni mail id",
  "content": "We (28 batch) were told that we'll not be getting the @pes.edu mail ids this year, and told us to use the teams credentials would be the mode of communication. Has anyone tried to access the CLion with the teams id? Also, seniors, which IDE would you recommend for C?",
  "metadata": {
    "author": "Intelligent-You1593",
    "url": "https://www.reddit.com/r/PESU/comments/1igpe1x/uni_mail_id/",
    "permalink": "/r/PESU/comments/1igpe1x/uni_mail_id/",
    "score": 6,
    "created_utc": 1738590327,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "maqiicj",
      "body": "Why dont u use Codeblocks or VS code with gcc compiler"
    },
    {
      "id": "maqnjeu",
      "body": "I used to (and still use) VS Code for C/C++. You don't need a fancy IDE for it, especially for the course."
    },
    {
      "id": "marp17k",
      "body": "If VS Code is too hard, try sublime text, seems good. Had tried a few years back"
    },
    {
      "id": "mas55vg",
      "body": "hold up why wont we get the mail ids"
    },
    {
      "id": "masgxhu",
      "body": "But the ms id isnt registered in some places as officially valid, so some websites require the pes.edu mail for claiming student benefits\n\nI was waiting for the ped.edu mail id for claiming a benefit, now genuinely fudge pes."
    },
    {
      "id": "mauk89i",
      "body": "pes decided to fuck with us in this way"
    },
    {
      "id": "maukcxc",
      "body": "you can use your id card for verification. Ive used it for spotify and economist benefits"
    },
    {
      "id": "mav5ouu",
      "body": "Vim supremacy 📈📈📈"
    },
    {
      "id": "mavspe7",
      "body": "But most websites don’t have that option of uploading the id card and all?"
    },
    {
      "id": "maw4e3z",
      "body": "true, but if they do have the option of uploading your id then you can use that"
    },
    {
      "id": "maxefyz",
      "body": "What's \"too hard\" about VS Code? For C/C++, just use it as an editor and use the terminal to compile manually. Ofc there's the options to set up compilation configs but you're better off doing it manually to learn how to compile and the steps in compiling files rather than automating a 2 second task, atleast when you're starting off with the language."
    },
    {
      "id": "mayl067",
      "body": "not hard, but if setting up for first time, it takes some time. So, sublime text is much simpler i feel"
    }
  ]
}