{
  "id": "1ihkpns",
  "title": "Time to draw alliances",
  "content": "Hey PESts\n\nAs all of us know, we are in the finals with Dayanand Sagar (context: https://www.instagram.com/reel/DFpyTNsTRO5/?igsh=aGNobzAxZGczbnFs)\n\nSo, as it's the final steps, let's use the time to build up alliances with our fellow colleges\n\nPlease reach out to the communities of our friends and their colleges and extend our hand of friendship, repost this in fellow colleges subreddits and let's get prepared \n\nLet's together with our friends reach the peak of the ranking \n\nMay all of us be the PRIDE OF PESU ❤️",
  "metadata": {
    "author": "ChromaticChaos",
    "url": "https://www.reddit.com/r/PESU/comments/1ihkpns/time_to_draw_alliances/",
    "permalink": "/r/PESU/comments/1ihkpns/time_to_draw_alliances/",
    "score": 51,
    "created_utc": 1738684183,
    "flair": "Pride Of PESU",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "may8138",
      "body": "fewer placements = more unemployment = more votes, may the worse college win"
    },
    {
      "id": "mayb9iz",
      "body": "How about we all mind our own business? I get the point of fun, but it shouldn't be to that extent where people are going out of ways getting involved in this, just for the sake of temporary \"who knows for what\" happiness ."
    },
    {
      "id": "mayzn94",
      "body": "Idk about which college would win this, but we do know unemployment would win this for sure🤡🤡🤡. Call me a boomer. But come on guys you could do better than this tbh."
    },
    {
      "id": "mb1xyyd",
      "body": "Umm dude, you do realise that a lot of people who have jobs are being part of this right!\n\nLike, once you start working, you can still be involved in silly things!!!\n\nHave fun in your life dude"
    },
    {
      "id": "mb1y6sl",
      "body": "Good one 😭😂"
    },
    {
      "id": "mbacxw7",
      "body": "You must be fun at parties"
    },
    {
      "id": "mbas136",
      "body": "Don't get me wrong, my objection was only for \"repost this in fellow colleges subreddit\". But yeah u r free to do whatever u want. I was just trying to convey my take which can be entirely/somewhat wrong.\n\nAt last have no doubts, I am damn fun at parties (never been to one)"
    }
  ]
}