{
  "id": "1ijv7zl",
  "title": "ESA provisional results",
  "content": "Can your results change even after the provisional one's are out? bcz my frnd who wrote only questions somehow passed and got better marks than me 😭. How is it possible?",
  "metadata": {
    "author": "SurpriseAsleep5171",
    "url": "https://www.reddit.com/r/PESU/comments/1ijv7zl/esa_provisional_results/",
    "permalink": "/r/PESU/comments/1ijv7zl/esa_provisional_results/",
    "score": 12,
    "created_utc": 1738935647,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mbh5xne",
      "body": "how much did the other guy get lmao"
    },
    {
      "id": "mbh626s",
      "body": "His ISA marks and labs (if it's a 5 credit course) would've carried him"
    },
    {
      "id": "mbh6ng6",
      "body": "Same i didn't even believe my marks when it popped up, hope the grades won't change😭😭"
    },
    {
      "id": "mbh6ss2",
      "body": "So much relative in the P cycle I mean, a lot."
    },
    {
      "id": "mbh7kpw",
      "body": "Your results will only change if you apply for re-eval. Not automatically. If you don't apply, your provisional results are your final results."
    },
    {
      "id": "mbh7vta",
      "body": "bro he passed... he literally wrote the questions and came"
    },
    {
      "id": "mbhbq96",
      "body": "can you loose marks in re-eval?"
    },
    {
      "id": "mbhcdf9",
      "body": "Marks? Yes. Your marks can go down. Your entire paper is checked again from scratch and corrections may be stochastic. \n\nCan your grade decrease? No. \n\nThey assign the max (current grade, new grade). So you'll either end up with the same grade or a better one."
    },
    {
      "id": "mbhf91v",
      "body": "If marks decrease even grade can decrease (given that it crosses the grade threshold)?"
    },
    {
      "id": "mbhg4to",
      "body": "Read the last paragraph again."
    },
    {
      "id": "mbhgdyl",
      "body": "Oh mb mb. Thanks for the clarification :)"
    },
    {
      "id": "mbhnuus",
      "body": "ive written like most of the answers but i can evidently see that i didnt get any marks for the steps .. can that change after re-eval"
    },
    {
      "id": "mbi01mc",
      "body": "I can't predict if you'll get marks after re-eval. It's upto the person who checks your paper."
    },
    {
      "id": "mbi2z6w",
      "body": "are there chances tho"
    },
    {
      "id": "mbi4moo",
      "body": "If you're looking for validation on something that's not in my hands, you're not going to get it from me."
    },
    {
      "id": "mbi81k7",
      "body": "But i still don't seem to get my results even the fees is completely paid 🙂"
    },
    {
      "id": "mbj4r4r",
      "body": "There are exceptions.  I remember for the previous year of sem 4 or sem 6 students(?) in ec campus they declared, everyone was shocked and so they took them back and declares again a few hrs later with changed results. Saw it in the sub not sure what exactly went down"
    },
    {
      "id": "mbj8bvx",
      "body": "+1"
    },
    {
      "id": "mbj8gxb",
      "body": "1. The results were released back as *provisional* results, not final results. Unless people applied for re-eval, those remained final. There was an issue with the evaluation and they released the new results. These cases aren't comparable. \n2. The incident was an exception, not the norm (as you said). Best not to mislead people into thinking that it can always happen when in the last 6 years or more it's happened only once."
    },
    {
      "id": "mbjhieg",
      "body": "Will 8.7 or 8.8 cgpa be good enough for final year?"
    },
    {
      "id": "mblcqgn",
      "body": "Yep that's a good GPA."
    },
    {
      "id": "mblw1on",
      "body": "How do we check our internal marks given in labs "
    },
    {
      "id": "mc7ahre",
      "body": "No the results won't change."
    }
  ]
}