{
  "id": "1ike5bf",
  "title": "Is it worth it to apply for re-evaluation?",
  "content": "I'm thinking of applying for re-evaluation for math and EEE.\n\nHas there been any instance where the grade of a student has increased from A to S? What are the odds of this happening?",
  "metadata": {
    "author": "fuckstans42069",
    "url": "https://www.reddit.com/r/PESU/comments/1ike5bf/is_it_worth_it_to_apply_for_reevaluation/",
    "permalink": "/r/PESU/comments/1ike5bf/is_it_worth_it_to_apply_for_reevaluation/",
    "score": 4,
    "created_utc": 1738986101,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mblqehp",
      "body": ">Has there been any instance where the grade of a student increased from A to S?\n\nMultiple times. It's all possible. \n\n>What are the odds of this happening?\n\nHow would one predict this? It depends on your original marks, whether there are actually any errors in correction, the person who corrects your script again and whether the new marks are enough to bump your grade up. It's not in anyone's hands to predict the chances. Nobody can tell you that you have exactly x% chance for grade improvement. \n\nAll you need to know is that the review process is fairly transparent: you can view your corrected answer script and thus find out how many marks you've scored and whether you are indeed owed more marks. Once you submit for re-eval, it's *not* guaranteed that you'll get those marks. You may get it, you may not. \n\nYour paper will effectively be corrected from the beginning again and they will assign you the maximum between your new grade and current grade. There won't be any other information provided. \n\nYou can decide whether it's worth it or not."
    },
    {
      "id": "mblqknk",
      "body": "Thanks!"
    },
    {
      "id": "mblt4k2",
      "body": "What is the script review? i feel that after going through my paper, i can decide if it's re-eval worthy or not, so will script reeview help in this case?"
    },
    {
      "id": "mbm00bl",
      "body": "Yes. You can view your paper."
    },
    {
      "id": "mbncqas",
      "body": "Is it also possible to get lesser than your original after re eval"
    },
    {
      "id": "mbnpowv",
      "body": "The answer is in my comment. Read it again."
    },
    {
      "id": "mbom41r",
      "body": "Can i pay 1000 for re-eval after i've seen my paper or what? How does it work?"
    },
    {
      "id": "mbopt6m",
      "body": "Yeah you can, it’s the same procedure again. Print out the form fill in the details. Attach the payment receipt and submit it at Coe. "
    },
    {
      "id": "mcdq1zf",
      "body": "I never felt the need to revaluate. It feels pointless. Also I was afraid my marks would go down."
    }
  ]
}