{
  "id": "1ikhflo",
  "title": "GPA Doubt",
  "content": "Will it be hard to maintain/score 9 sgpa from 3rd sem onwards till the last sem??Cuz I want to improve my overall grades \nSince I was told 8.5 is good enough for almost 95% of companies \nMight end up the first year with an 8+ grade\nSo getting 9 or 8.5 every sem will get me to my target\nIs it doable?\n",
  "metadata": {
    "author": "knightrider08",
    "url": "https://www.reddit.com/r/PESU/comments/1ikhflo/gpa_doubt/",
    "permalink": "/r/PESU/comments/1ikhflo/gpa_doubt/",
    "score": 8,
    "created_utc": 1738997800,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mbmfgie",
      "body": "First roadblock I feel at RR in sem3 is that the quality of teaching will fall tremendously, so if you are good at studying on your own, it will be fine .\n\nPlus you will need to refer the textbook for some subjects too, like DDCO for example, whose U1 and U2 slides are absolute dogsh!t\n\nSubjects themselves are not that hard in sem3. Sem4 Subs till now are completely theoritical and core as well."
    },
    {
      "id": "mbolfc2",
      "body": "wrt to second year idt it would be too difficult as long as you put in efforts to understand concepts and not study  just for the sake of exams. There will be subjects that are hard and that you may not like (WT,DDCO🥰🔫) but there will be some really interesting subjects too.\n\nSem 4 has a little more theory than sem 3 .I remember my senior telling me sem 4 would be scoring but they did absolute grading for my batch and not a lot of people did well. Speaking entirely academically this semester has a lot of useful subjects placements wise (OS,CN,DAA) and it would be better if you strengthen those concepts as and when you study it while you still have time.\n\nThird year just becomes cramped up depending on the electives you take (but honestly all of them atp have quite a lot of assignments/hackathons etc), and it becomes hard to score just becuase of the 1000 submissions waiting for you + placement prep that dont let you study.\n\nOverall up to 2nd year its still easy to score because you have time to put in effort. 3rd year is mostly trying to keep your cgpa from plummeting.\n\nAlso this comment is written assuming you'd be putting consistent efforts into studying (as much as possible lol I get that its hard to find time) , it will be hard (not impossible though take that how you will) every semester otherwise.\n\nThis is a comment on what to study for 3rd sem if you're interested in checking it out :)\n\n[https://www.reddit.com/r/PESU/comments/1fwndo6/comment/lqkj4k6/](https://www.reddit.com/r/PESU/comments/1fwndo6/comment/lqkj4k6/)"
    },
    {
      "id": "mbqqouw",
      "body": "Realistically is it possible to get a 9sg from 5th sem?"
    },
    {
      "id": "mbqr17h",
      "body": "Also what amount of people get 9sg from 5th sem onwards"
    },
    {
      "id": "mbs7aq1",
      "body": "I’m still doing my 6th Sem, but they did some mad relative grading in 5th and everyone would’ve done exceptionally well. So for our year , crossing 9 wasn’t too hard. But generally speaking i don’t think it’s impossible , you’ll have 2-3 subjects you’ll really like and if you put all your focus on that and slightly focus on the others you can still get 9+\n\n\nThe general strategy for me has always been do well in the Isas as much as you can and give yourself enough room to at least get a comfortable A. If you think you can get an S in the subject , lock that down."
    },
    {
      "id": "mbs7os3",
      "body": "They didn’t release the whole scholarship list this time , just sent mails. so If I’d had to guess with the relative grading they did maybe 70-80+ , to give an idea with absolute 4th sem would had (I think) only 40-45 with >=9 sgpa"
    },
    {
      "id": "mbuat8s",
      "body": "damn so if i just put effort from day 1 of the sem, is it possible for me to maintain 9 by end of 4 years as my 1st sem sg is 7.33, cuz this might shatter the dream tier possibility"
    },
    {
      "id": "mbus2yu",
      "body": "yeah its possible, my friend was in the same position as you. He's doing well now. \n\nAlso dont know what cycle you're in but sem 2 was P cycle for him and his grade shot up a lot , there will always be a possibility if you really want to achieve it."
    },
    {
      "id": "mbv13bi",
      "body": "Okay it is phy cycle for me too, tq for the insight!"
    },
    {
      "id": "mc57e2j",
      "body": "Anything is DOABLE"
    }
  ]
}