{
  "id": "1ikm02p",
  "title": "Section change",
  "content": "Recently they have allotted sections for 2nd sem but I don't like my classmates can I change my section regardless of branch? Let's say my branch is ec and I want to transfer to a section where all students are of cs branch but the syllabus is same regardless of branch.",
  "metadata": {
    "author": "CompetitiveClue1820",
    "url": "https://www.reddit.com/r/PESU/comments/1ikm02p/section_change/",
    "permalink": "/r/PESU/comments/1ikm02p/section_change/",
    "score": 15,
    "created_utc": 1739016944,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mbnbpxe",
      "body": "😂😂😂"
    },
    {
      "id": "mbncgns",
      "body": "I went through the same thing in the second semester when I got put in a class with strangers while my friends from first sem got moved to another class. I talked to new people and made friends, what else do you do lmao. It’s literally just 1 semester. Your sections will change again after 2nd sem anyway."
    },
    {
      "id": "mbndj83",
      "body": "Nah most of my classmates are in same section. That is why I said I hate them and I need new people. Only very selective people got transferred. I at least want to enjoy my 2nd sem with decent mates."
    },
    {
      "id": "mbne1r8",
      "body": "what do you hate so much about them"
    },
    {
      "id": "mbneo27",
      "body": "Just don't like them. Yk there are always some people that don't match your vibe. They do some cringey things which sometimes involve me and it irritates me."
    },
    {
      "id": "mbos0zn",
      "body": "You can maybe ask chairperson"
    },
    {
      "id": "mbsqy26",
      "body": "Yo atp im also in same situation more friends better for u anyday"
    },
    {
      "id": "mbsu4tv",
      "body": "I just hope there are baddies in my class. Or else imma jump /s"
    },
    {
      "id": "mbsv14s",
      "body": "Valid"
    }
  ]
}