{
  "id": "1il98gx",
  "title": "Opinion on profs",
  "content": "C - Bivas Bhattacharya \nPhysics - Rangaswamy \nMechanical - Deepu P Nair \nMathematics - Devi Priya \nElectrical - Rajesh Chandrashekhar \n\nThanks in advance :)",
  "metadata": {
    "author": "fat_penis69_",
    "url": "https://www.reddit.com/r/PESU/comments/1il98gx/opinion_on_profs/",
    "permalink": "/r/PESU/comments/1il98gx/opinion_on_profs/",
    "score": 6,
    "created_utc": 1739085212,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mbsx51i",
      "body": "I’ve been taught by Rangu and Bivas\nRangu: either give up on physics or study on your own, coz you can’t understand anything in his class. If you speak Kannada you are fine else he will bully you if you stand out even a bit. Be ready for him to start the class with asking questions, if you don’t answer you are going to stand until he is satisfied, dw though half of the class will stand with you. \n\nBivas: really cool guy, easy to approach knows a lot about his subject and is excited to teach it, but if you do not match his vibe, you won’t understood much, he is a good teacher for those who are interested or focused and really bad/yapper for the others. Our class opinions were 50-50 in the end."
    },
    {
      "id": "mbsxeke",
      "body": "It's been over 2 years and I still have PTSD from R*ng*swamy's classes. All the best."
    },
    {
      "id": "mbt8bbx",
      "body": "Thanks a lot!"
    },
    {
      "id": "mbxz2lc",
      "body": "Rangu: nobody understood shit in his class, your on your own in physics \nBivas: really knowledgeable, but if you are an absolute beginner you'll find it hard to understand, so I suggest do some basics on your own. If u do that then he's goated\nRajesh: One if the nicest and best teachers. Probably the only nice guy in ece department"
    },
    {
      "id": "mc1f22r",
      "body": "Rangu - cooked Devi priya - goated, jus her notes and classes are enough to get an A"
    }
  ]
}