{
  "id": "1im3w6g",
  "title": "How much is enough?",
  "content": "Today our ma'am tells told us to aim for 10 for those who got 9.5+.  Like is it even worth the hassle to get everything thing perfect?",
  "metadata": {
    "author": "Arjun9514",
    "url": "https://www.reddit.com/r/PESU/comments/1im3w6g/how_much_is_enough/",
    "permalink": "/r/PESU/comments/1im3w6g/how_much_is_enough/",
    "score": 20,
    "created_utc": 1739186551,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mbzzy6k",
      "body": "No one gives two fucks about your results after a few days (or perhaps even one day) tbh, but still it is better to keep improving yourself."
    },
    {
      "id": "mc001j4",
      "body": "Dude do you realise that it’s going to be significantly harder for you to score in higher sems?\nIf you score a 10 this sem and don’t score well in other higher sems do you think your cgpa will remain 9.5 or 9.6? It wouldn’t \nSo score better in these easier sems while you can"
    },
    {
      "id": "mc045b5",
      "body": "There’s ntg like this much is enough…\nYou can try to aim for higher cgpa always"
    },
    {
      "id": "mc09pr1",
      "body": "She stupid asf cgpa does matter but that's not the only thing, 8.8+ is safe bet, 9.2+ is extremely good for placements."
    },
    {
      "id": "mc0aaou",
      "body": "It's not significantly harder, I've done much better in semesters 5 and 6 compared to 1 and 2 because the subjects were much more interesting and you get to choose two subjects per semester, which makes your life easier too."
    },
    {
      "id": "mc0tplq",
      "body": "Tell her to get a life!"
    },
    {
      "id": "mc1bkpr",
      "body": "Beyond a 9.5 or so, your CGPA is not really relevant. Focus on building your overall profile as others have suggested. You can read my old comments on this for more details."
    },
    {
      "id": "mc1crhn",
      "body": "I mean can atleast aim for it and have a goal right? Would definitely help as a reserve for the future, cus later semesters may just be tough. She's just encouraging you to improve. Ik who you're talking about btw, she's one of the few teachers who actually cares and wants to see you improve in all aspects while also literally covering everything in the syllabus. No nonsense and perfect. As for a difference, it matters a lot for dream companies ig as seen in the placement sheet (especially the internships) but yeah I agree focusing only on cgpa and ignoring every other fest/opportunity for exploring is very bad."
    },
    {
      "id": "mc6a2pw",
      "body": "Hey I'm in second semester now. I'm kinda confused about this talk of 'skill improvement'. It always seemed quite vague so could u explain wdym by it"
    },
    {
      "id": "mck5gg7",
      "body": "It might act as cut off that’s it , but most of the companies go after what you know and your application skills not your CGPA"
    },
    {
      "id": "mcq5w1m",
      "body": "Brooo thats soo true….. \ni have a cgpa of around 7.07 and im employed in a company. But my friends with 8 cgpa still are unemployed."
    }
  ]
}