{
  "id": "1im4jnl",
  "title": "placements",
  "content": "ik that is question has been asked too many times but\n\ni looked at the placements sheets and i saw that most of the companies have their gpa cutoff to be 8 or 8.5(i only referred to the placements sheets on this subreddit),so me as a 4th sem cse student i have a gpa of 8.3 and good at dsa(can solve some good level questions),should i focus on getting a better gpa or grind dsa and do better projects,and building a better resume( im aiming for high paying tier 1 jobs).is maintaining an 8.3 sufficient?",
  "metadata": {
    "author": "Plane-Assist-3318",
    "url": "https://www.reddit.com/r/PESU/comments/1im4jnl/placements/",
    "permalink": "/r/PESU/comments/1im4jnl/placements/",
    "score": 11,
    "created_utc": 1739188952,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mc05rpi",
      "body": "\\> grind DSA and do better projects, and building a better resume\n\ndo this. yeah 8.3 is good, try to keep it 8.5+ if possible"
    },
    {
      "id": "mc05yae",
      "body": "Do both? It should not be too hard to go from 8.3 to 8.5 in 3 sems. Many also have around 8.75 or 9 cutoff. I would say it’s not mutually exclusive anyway, a lot of the 4th sem subjects like OS, CN, DAA are useful for placements too so learning them well is 2 birds with one stone. Beyond focusing on class, you mostly only need to study well few days before exams, so you should have enough time for dsa and projects"
    },
    {
      "id": "mc06iph",
      "body": "even for high paying tier 1?"
    },
    {
      "id": "mc06ntd",
      "body": "yes"
    },
    {
      "id": "mc1g4o5",
      "body": "I'll be frank , U might miss out on some companies ( who advertise themselves as min 8 gpa cutoff but in the end - they send OA to only 9+) cuz competition is too high . (Personally experienced this when my gpa was just sub 9 and they rejected me for OA)  \nHigher GPA doesn't hurt ... but try to grind dsa along with it"
    },
    {
      "id": "mc98dpn",
      "body": "Anyway nobody will study entire sem so you can build your resume with projects and also can shift your focus towards exams when it's near. Also it's not that tough to bring gpa of 8.5 + from 8.3. All the best 👍"
    }
  ]
}