{
  "id": "1imub0k",
  "title": "script review",
  "content": "can someone tell me the procedure of script review and challenging like , if i pay 100 for the script review now when and where will i be able to view my script and stuff coz it says it has to be in person.\n\n...............................",
  "metadata": {
    "author": "CharacterPangolin244",
    "url": "https://www.reddit.com/r/PESU/comments/1imub0k/script_review/",
    "permalink": "/r/PESU/comments/1imub0k/script_review/",
    "score": 1,
    "created_utc": 1739263794,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mc5lr5i",
      "body": "You have to take the filled form from the pdf that states which subjects you are reviewing with the receipt of payment and get it signed from the hod of science and humanities department \n\nThen you go to the coe and submit the signed papers ,they'll let you review it in around 10-15mins"
    },
    {
      "id": "mc5n9ql",
      "body": "Till what time will the COE office be open ?"
    },
    {
      "id": "mc5ng36",
      "body": "until when can i go to the coe office"
    },
    {
      "id": "mc5slvt",
      "body": "Idk exactly but prolly till 5"
    },
    {
      "id": "mc60ark",
      "body": "They don’t let script review beyond 4"
    },
    {
      "id": "mc66daf",
      "body": "i didnt get it signed from the HOD and directly went to COE"
    },
    {
      "id": "mc68srq",
      "body": "Yeah yeah ,I asked them ,btw just after we submit that form they'll allow us to look into the paper ?"
    },
    {
      "id": "mc69bmy",
      "body": "Can we challenge the paper after viewing it?"
    },
    {
      "id": "mc6ek85",
      "body": "You can even go without submitting the form"
    },
    {
      "id": "mc6eook",
      "body": "Oh I went the same way first and they sent me back to get the signature"
    },
    {
      "id": "mc6gql4",
      "body": "Yes"
    },
    {
      "id": "mc6guqt",
      "body": "Ohh finee tq tq"
    },
    {
      "id": "mc6iqze",
      "body": "are the dates for challenging and viewing the paper on different dates?"
    },
    {
      "id": "mc6jlsl",
      "body": "You can see the paper anytime this week"
    },
    {
      "id": "mc6w5eh",
      "body": "cruel  \nthey didnt do that with me luckily"
    },
    {
      "id": "mcki69s",
      "body": "i checked my paper and i paid for re-eval....tomorrow i will submit those papers, after that do i have to go to the nest and select the questions for re-eval like in ISA or will the whole paper get re-evaluated??"
    },
    {
      "id": "mckpnzt",
      "body": "Idk as I haven't put any for re-eval but according to the teachers the whole paper gets checked again"
    },
    {
      "id": "mckqlrg",
      "body": "So I just have to submit those papers in be block that's it right!?"
    },
    {
      "id": "mckqvdk",
      "body": "Yep"
    }
  ]
}