{
  "id": "1imz6ia",
  "title": "Is it just me?",
  "content": "I feel like I have no actual friends in this college, it feels like I'm just a tag along in my friends group. I have tried to make new friends but everybody are in their own groups that they prefer. Is this how my college life is gonna end. It's affecting me a bit too much lately that i don't even have proper friends in college. Is it just me who's going through this?",
  "metadata": {
    "author": "Meandwho2",
    "url": "https://www.reddit.com/r/PESU/comments/1imz6ia/is_it_just_me/",
    "permalink": "/r/PESU/comments/1imz6ia/is_it_just_me/",
    "score": 108,
    "created_utc": 1739282386,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mc6nqrg",
      "body": "Nah I've seen people sitting alone during breaks just scrolling,well including myself"
    },
    {
      "id": "mc6nz23",
      "body": "Lmao did u make a profile off my name"
    },
    {
      "id": "mc6orlq",
      "body": "But it feels so lonely"
    },
    {
      "id": "mc6pkcr",
      "body": "Actually,let’s start a loneliness cult"
    },
    {
      "id": "mc6q5jy",
      "body": "we actually should damn"
    },
    {
      "id": "mc6rcfc",
      "body": "i also used to feel the same way the first 2 months...i switched many friend groups and tried to find people who i vibe with....the first 6-7 weeks i felt exactly how u did...but dont overthink about this...give it some time and slowly and surely u will start to find people who want to have a genuine frndship with you....just dont put yourself in a shell and disconnect yourself from others...just keep talking to people and slowly u will find gud frnds...dont overthink about stuff and go for it thats what matters the most"
    },
    {
      "id": "mc6rebz",
      "body": "Looks like both you and OC are looking for a friend. That friend ain't going to be me, so why not reach out to each other? \n\n- Brought to you by your friendly neighborhood matchmaker rowlet"
    },
    {
      "id": "mc6ru8f",
      "body": "yea guess we should start conversations with other lonely people we see.but i literally cant go first.ngl id be so happy if someone comes up and speaks"
    },
    {
      "id": "mc6s1ai",
      "body": "this is so real i feel like i sit alone most of the time 🥲"
    },
    {
      "id": "mc6u35n",
      "body": "Glad you found your crowd"
    },
    {
      "id": "mc6w1fc",
      "body": "Buddy, I had loads of friends during college time, had a good but not great and now after college time, every one of them has gone different ways and paths, during college time, I was thinking ki maybe he or she would be there for me in hard time but no one was their seriously no one, at the end of the day, sabko bas apni fikar rehti hai I am alone, jese hi placement mili, gyab hogye and even placement se phle bhi no one was telling anything to each other because I thought dosti mein sab kuch btate hai be it worse or acha, so Dost bnao ya an bnao kya hi farak pdta hai :)"
    },
    {
      "id": "mc6z0qb",
      "body": "we got pesumatrimony before gta 6"
    },
    {
      "id": "mc70l78",
      "body": "blahblahblah"
    },
    {
      "id": "mc72fa1",
      "body": "It always existed. TAS used to be the Tinder of PESU. That's how a lot of people in the batch used to meet their partners lmao"
    },
    {
      "id": "mc759pe",
      "body": "Did you meet with any luck ? PESU WANTS TO KNOW BLAHAHHA"
    },
    {
      "id": "mc766e9",
      "body": "Guess u found your \"who\""
    },
    {
      "id": "mc778ju",
      "body": "Damn this is so relatable. It actually feels like everyone found their crowd during bootstrap or first few weeks of first sem and they are just sticking to that. I  really wanna interact with new people who i can actually vibe with cause hanging out with some people who aren't my vibe makes me actually feel lonely even when I'm not exactly alone."
    },
    {
      "id": "mc789ub",
      "body": "Are you me?"
    },
    {
      "id": "mc79kqh",
      "body": "It doesn't matter if you do or not.  I was lucky to find one person who became my friend. Don't force yourself to be a part of a group if you're not being valued."
    },
    {
      "id": "mc7d47x",
      "body": "Real"
    },
    {
      "id": "mc7dt3t",
      "body": "People who know me know the answer to that question"
    },
    {
      "id": "mc7e6ts",
      "body": "we just wanna know if there is any rowlet -owl hen 😩"
    },
    {
      "id": "mc7e9x7",
      "body": "Used to be"
    },
    {
      "id": "mc7ecl9",
      "body": "this is so true"
    },
    {
      "id": "mc7mjc9",
      "body": "Well thats just life.   \nYou can always find someone where you currently are, will help you get the citizenship also iykwim :wink:"
    },
    {
      "id": "mc7mjyl",
      "body": "cough cough"
    },
    {
      "id": "mc7mrfi",
      "body": "Brother that's not why I'm here 💀"
    },
    {
      "id": "mc7muny",
      "body": "No comments"
    },
    {
      "id": "mc7n6hs",
      "body": "I feel you, all these years I also had to go through times where I would be a bit lonely. It would be nice if we all sharing the same feelings of loneliness could meet at college one day, maybe it might be kinda awkward, but I think it's worth giving a shot."
    },
    {
      "id": "mc7nf0h",
      "body": "yeah shd make a \"we all feel lonely\" gc"
    },
    {
      "id": "mc7ngr0",
      "body": "Which cipher are we using"
    },
    {
      "id": "mc7nkab",
      "body": "Oh ya  XD. Average The boys moment ig ? :lmfao: though a green card would be nice ya know hehehehhe......especially after that blonde mongoose has taken over"
    },
    {
      "id": "mc7nors",
      "body": "If you're serious about doing so, add me too"
    },
    {
      "id": "mc8lrcs",
      "body": "Woe is the hour\nI miss a love I've never had\nA perpetual downpour\nTo be in this group id be glad"
    },
    {
      "id": "mc94sot",
      "body": "It's quite common to feel in this way even I had nobody when I joined the college. I was introvert when I joined pesu which was also a major reason for not getting the girl whom i loved the most.  I didn't express to  her and it ended abruptly without any clarity. After this phase I literally joined few clubs like music club, rotaract,aikya etc where I met many people and got some friends I became extremely extrovert.  But in end of the day everybody got job in different fields or companies and few of them decided to pursue higher education but still I made lot of memories especially in Sutta Gully which I will cherish in my life. Also I am grateful for whatever happened in my life. I would like to suggest you to join some clubs in college try to participate in more events try to meet new people start conversation with them. Make memories and Enjoy your life...👍"
    },
    {
      "id": "mccdlk1",
      "body": "me ne me me me me"
    },
    {
      "id": "mcdf31a",
      "body": "Bro I’ll be dead ass, it’s just like that in Pesu, and a lot more feel like this. I’ve never had this much trouble finding a group in any other institution . A lot of people are just distant here, you can either wait it out and eventually find a few people you fw like I did or give up. I tried to force conversations a few times but it’s really not worth it."
    },
    {
      "id": "mch4u30",
      "body": "Nah buddy, we are there"
    },
    {
      "id": "mcpe529",
      "body": "you're not alone 🫂"
    },
    {
      "id": "mcqz3ut",
      "body": "me in pes. tbh i might have been this way throught out my life and it was somehow okay at the end. The others truly accepted me. but in uni nobody seems to give more than one shit. just get rolled over"
    },
    {
      "id": "meod4xv",
      "body": "im also lon ely pls friends im in ec campus"
    },
    {
      "id": "mfns9lr",
      "body": "a fellow TAS user uh"
    },
    {
      "id": "mfr6oye",
      "body": "Its better to be alone than be with people who don't understand you."
    },
    {
      "id": "mznq472",
      "body": "omg this is so real. did y'll end up making that group?"
    }
  ]
}