{
  "id": "1ipiwm2",
  "title": "When should one pick AI & ML over CSE in PES?",
  "content": "Hey all, my friends brother wants to join PES but is unsure of which branch to pick among AI & ML and CSE. As a CSE grad before the AIML course was introduced, I don’t have an idea on how the AI ML course in PES is. \n\nAny feedbacks? When should he pick AIML over CSE or CSE over AIML?",
  "metadata": {
    "author": "Budget-Phone-1466",
    "url": "https://www.reddit.com/r/PESU/comments/1ipiwm2/when_should_one_pick_ai_ml_over_cse_in_pes/",
    "permalink": "/r/PESU/comments/1ipiwm2/when_should_one_pick_ai_ml_over_cse_in_pes/",
    "score": 6,
    "created_utc": 1739561739,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mcs7z93",
      "body": "Take cs. Don't think about aiml for a second"
    },
    {
      "id": "mcs8ixs",
      "body": "A couple of reasons justifying your opinion would be helpful..."
    },
    {
      "id": "mcsaldc",
      "body": "Check the faq or just search up aiml in the subreddit and you'll find your answer. \n\nThe only reason to take aiml is if you don't get a cs seat and still want to do cs"
    },
    {
      "id": "mcsc2ru",
      "body": "Aiml syllabus in pes is updated and much better than most other colleges...and there's definitely a huge scope for aiml...but the problem is it is constrained to only aiml unlike cs which has broad range of choices...if you are interested in aiml then go for it if not go for cs to explore various domains..hope it helps:)"
    },
    {
      "id": "mcugwou",
      "body": "Well if you prefer AI & ML only."
    },
    {
      "id": "mcv2kb5",
      "body": "When should one pick Aiml over CSE?\nNever?"
    },
    {
      "id": "mcv30wc",
      "body": "See , AIML is a good branch and will definitely have similar scope to CSE because the syllabus here is nice , but companies and some foreign unis ( for masters ) , don't always prefer a specialization during undergrad ( there may be very specific companies that come for those , which is fine if you're very interested in only that field , but u'll end up restricting urself ). Moreover , you can take AIML electives as a CSE core student later on too , but you can't do the same with AIML branch.\n\nSo I'd recommend picking AIML only if he doesen't get CSE core or if he's genuinely interested in the AIML field ( which is very mathematical and in a way research-oriented by the way )"
    },
    {
      "id": "mcva12x",
      "body": "Dude as a freshman you've got absolutely no idea the differences between aiml and cs. \n\nFor our batch pretty much the entire degree is identical except for 3 main differences\n\nBig data is a core course in wnd year \n\nWe do not have the oop course and have deep learning instead \n\nAnd we have fewer elective choices. \n\nOtherwise it's literally identical. You're not going to be utilising the \"scope\" of ai better by taking one additional course that doesn't have jack shit."
    },
    {
      "id": "mcvblpm",
      "body": "Dood I understand ultimately we too will be sitting in the cs placement only I guess because aiml needs experience and deep knowledge...it'll be beneficial for those who want to pursue their masters maybe"
    },
    {
      "id": "md8mp69",
      "body": "Run to cse, aiml is just cse with some extra extra syllabus u can cover all of that with a minors or an elective in cse."
    }
  ]
}