{
  "id": "1ipvqo1",
  "title": "How much relative grading was there in maths? Can someone please comment their overall marks and grade in maths, as I have to apply for re-evaluation",
  "content": "Title",
  "metadata": {
    "author": "Unlucky_Professor_38",
    "url": "https://www.reddit.com/r/PESU/comments/1ipvqo1/how_much_relative_grading_was_there_in_maths_can/",
    "permalink": "/r/PESU/comments/1ipvqo1/how_much_relative_grading_was_there_in_maths_can/",
    "score": 5,
    "created_utc": 1739602107,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mcv72pw",
      "body": "In 1st year u will get a better grade then u expected in maths dw"
    },
    {
      "id": "mcv78c1",
      "body": "Yeah, already got the grade lol\nBut it might increase after re-evaluation, that's why I'm asking for marks vs grade as I'm not sure how much relative grading was there"
    },
    {
      "id": "mcv7c97",
      "body": "I have 77/100 and got an A grade\nSo from this we can predict that bounds were changed Atleast by 3 marks"
    },
    {
      "id": "mcv7c9p",
      "body": "I got 49 total isa and my grade at the end was S"
    },
    {
      "id": "mcv7ct3",
      "body": "Nobody knows how much relative was there , only other people who saw their paper can tell"
    },
    {
      "id": "mcv884x",
      "body": "Bro can they decrease the grade if they cut marks in re-evaluation?"
    },
    {
      "id": "mcv9rd4",
      "body": "No\n\nMarks can change but grade will either remain same or increase, it cannot go down."
    },
    {
      "id": "mcv9y75",
      "body": "Which other papers did u see?"
    },
    {
      "id": "mcva1ew",
      "body": "Like if they cut some marks and according to the revised marks, the grade goes down\n\nIn that case, do they give the best out of 2 grades?"
    },
    {
      "id": "mcva5ce",
      "body": "I saw mechanical, maths and physics\nI don’t think there’s any reason to downvote my comment guys?"
    },
    {
      "id": "mcvatxn",
      "body": "Can u say the marks and grade u got for all these?"
    },
    {
      "id": "mcvc17v",
      "body": "Yes"
    },
    {
      "id": "mcvojmk",
      "body": "They changed it by 1.5 ig"
    },
    {
      "id": "mcwevxy",
      "body": "guys is there any chance, 2 ppl can get same total score but 2 different grades cuz i saw my paper and my total score sums up to 77 but but i got a B grade...??"
    }
  ]
}