{
  "id": "1ipzi1o",
  "title": "Life is Unfair for me",
  "content": "I am an introvert ( first year cse) . I did my 11 th and 12th in  a college (hostel lite)where the rules were strict like you can't talk to your parents for more than 10mins ,talking to girls means ₹500 fine . \n\nDue to this now I am not able to socialize with my sem 2 classmates . I am not able to participate in activities and join any clubs . I don't know what to do \nMy friends tell me not to worry much and just talk to new people .But even if do some introduction I cant carry on the flow\n\nMy friends talk to girls normaly but when it comes to me i get confused and overthink.This fear makes me not to ask any doubt in the class too 😞",
  "metadata": {
    "author": "Frequent_Purple3443",
    "url": "https://www.reddit.com/r/PESU/comments/1ipzi1o/life_is_unfair_for_me/",
    "permalink": "/r/PESU/comments/1ipzi1o/life_is_unfair_for_me/",
    "score": 41,
    "created_utc": 1739619159,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mcvzilj",
      "body": "WHAT WAS YOU PCM AND CET MARKS?\nALONG WITH RANK?"
    },
    {
      "id": "mcvzwqy",
      "body": "PCM - 283\nCET - 102/141\nRank -  3995"
    },
    {
      "id": "mcw01a7",
      "body": "4k enough for pes cse? Howw"
    },
    {
      "id": "mcw0751",
      "body": "I am in pes ece campus not RR"
    },
    {
      "id": "mcw175a",
      "body": "Bro don't reveal your exact numbers like this publicly"
    },
    {
      "id": "mcw3mcu",
      "body": "Why are people down voting my comment?\nWtf did I do?"
    },
    {
      "id": "mcw3p55",
      "body": "Why are people down voting my comment?\nWtf did I do?"
    },
    {
      "id": "mcw3wl7",
      "body": "Idk, but i think because asking for rank and marks was unnecessary here"
    },
    {
      "id": "mcw8r9w",
      "body": "ecc campus? if so, dm me"
    },
    {
      "id": "mcwca7k",
      "body": "ur a fuckin retard , thats why"
    },
    {
      "id": "mcwce7o",
      "body": "Cope harder blud"
    },
    {
      "id": "mcwcluj",
      "body": "'cope harder blud'🤓🤓"
    },
    {
      "id": "mcwcvdv",
      "body": "The last time I used thet word my account got banned \nSo better delete it 😌"
    },
    {
      "id": "mcxcy93",
      "body": "General advice: the only way to build confidence is to get out of your comfort zone. The more you push yourself to get out there and break your shell, the easier it gets to mingle with others. Join whatever activities interest you and talk to people. Don't think about how they'll perceive you. Introduce yourself to people and begin a conversation. If you're looking for conversation topics, talk about the activity you're both in and so on. You're just going to have to be yourself after coming out of your shell. \n\nIf you're looking for friendship with women, the first thing you need to do is treat them like humans (like you treat other men) and not some mystical beings or a chamber of secrets that you need to unlock. There's no special secret or key here. Just be normal and don't be pretentious. Treat them how you'd treat any of your guy friends, discuss the same things etc. They aren't looking for anything different. If you treat them as human and like any of your other friends, odds are they'll reciprocate the friendship. And ofc but extremely important - don't go in with the wrong intentions/expectations. If you want something more, then be clear from the beginning. Nobody wants to have a friend with ulterior motives."
    },
    {
      "id": "md1gd1d",
      "body": "500 bucks for talking to girls is crazy. If I was in ur school I'd prolly be the richest guy out there"
    },
    {
      "id": "md8wn1z",
      "body": "Yes bro i feel.the same , sometimes it feels not to continue in this shitty collage"
    },
    {
      "id": "md90hsa",
      "body": "Leave everyone and everything just focus on your goals and dreams , I think you don't need any friends u are searching for a women who can understand  you , that you'll get when the time comes , do things what you love to do, cross your limits every day , make yourself busy in any sort of work, if you are lacking happiness just go out and watch people playing in football turf or cricket ground , kicks are very important than friends, find the thing/work where you get some kicks, join gym be physically fit listen to some music make your mind calm . Stop overthinking. Be selfish,work on building yourself. Life is unfair ik ,belive in universe remember the comeback is real...\n\nStill you want friends instantly then come to me I'll get them for you😂"
    },
    {
      "id": "md947ru",
      "body": "Say Life is enjoy"
    },
    {
      "id": "me6o8ln",
      "body": "Just be comfortable with awkwardness bro , once you reach the last stage of embarrassing yourself, u will realise there's nothing left to be scared of anymore."
    }
  ]
}