{
  "id": "1iqpryf",
  "title": "Electrical(phy cycle)",
  "content": "Do they ask only the questions from slides,qb and assignment? Or do they ask other questions too(numericals)? please give some tips to tackle numericals.",
  "metadata": {
    "author": "Parking-Ad5556",
    "url": "https://www.reddit.com/r/PESU/comments/1iqpryf/electricalphy_cycle/",
    "permalink": "/r/PESU/comments/1iqpryf/electricalphy_cycle/",
    "score": 4,
    "created_utc": 1739703000,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "md22455",
      "body": "Listen to the class properly. Units 1, 3, and 4 are easy asf,  Unit 2 is a bit tricky and the only unit where you can lose marks.\n\nSolve the PESU academy slides (this is a must, and questions in the ESA/ISA come directly from them) and solve the PESU question bank (questions come from this in the ESA, not the ISA). Do this, and you're sorted. Please focus on the ISAs, I had 29 in ISA 1, 36 in ISA 2, and 92–94 in the ESA (I could have gotten an S if my ISA 1 had been better I ended up getting an A coz of my ISA1 shit).\n\nAlso, take the assignments seriously. I got 9 in assignments while most of the class got 10 (it's so easy to get a 10, so don't lose any marks).\n\nAnd, Electrical is the easiest subject in the P cycle, with the highest average every time, whether ISA or ESA. Try to get at least an A in this subject."
    },
    {
      "id": "md22onv",
      "body": "🙏thanks!"
    },
    {
      "id": "md25kv6",
      "body": "Get lokesh sir's notes from ec campus u r done with eee"
    },
    {
      "id": "md2xwik",
      "body": "really well put, but study theory of unit 4 electric machines theory and a bit of theory from unit 3 ( the electric installations part) for esa, the  theory component gets asked only in mcqs of isa, isa 4markers will most deffo be numericals"
    },
    {
      "id": "md2yok8",
      "body": "Yeah i kinda forgot, editing my cmnt"
    }
  ]
}