{
  "id": "1irb2ph",
  "title": "Tips for incoming freshers",
  "content": "Yooo so i m upcoming batch jus needed a few tips coz dc sever changed completely so any sr from cse branch how is it the life overall i am aiming for ai and ml branch maybe might change my mind if i get any branch is cse so hows life of cse do they give time for in hands experience of projects and coding and how is the management right now after all those incidents,did it get better or still the same?",
  "metadata": {
    "author": "Any-Bake-8154",
    "url": "https://www.reddit.com/r/PESU/comments/1irb2ph/tips_for_incoming_freshers/",
    "permalink": "/r/PESU/comments/1irb2ph/tips_for_incoming_freshers/",
    "score": 1,
    "created_utc": 1739764831,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "md73poo",
      "body": "Don't come to PES"
    },
    {
      "id": "md751xj",
      "body": "Why"
    },
    {
      "id": "md78n5y",
      "body": "Concentrate on your subjects from the beginning. This is important in order to get a good cgpa. The management has no relationship with the incidents so there is no \"change\" since they also don't know anything.\n\nCSE is challenging. You will have mini projects for your subjects so you will have hands-on projects. The life you will have will depend entirely on you. If you balance your time properly then you will have a good time, otherwise your life will be full of suffering and pain. I'm not kidding. Focus on your subjects. PES is known to have a much more stringent and higher level of difficulty in their exams compared to other colleges. If you think you can't handle it then choose a different college."
    },
    {
      "id": "md7e1g1",
      "body": "There's a detailed post in the FAQs for dos and don'ts while starting college."
    },
    {
      "id": "md7k2tc",
      "body": "Aight got it thanks man"
    },
    {
      "id": "md7k5o7",
      "body": "One last query like for non karnataka ppl how is the management in sending back home like is it lenient enough or much strict and all"
    },
    {
      "id": "md8tqpg",
      "body": "wdym sending back home?"
    },
    {
      "id": "md94erk",
      "body": "Deportation from the motherland 🇺🇸"
    },
    {
      "id": "md94i5d",
      "body": "Don't put posts without context. Add more info or link to existing comments/posts."
    },
    {
      "id": "mdg4hw0",
      "body": "Don't get any grade below C if you want a good GPA."
    }
  ]
}