{
  "id": "1isxqfq",
  "title": "JEE Admissions possible cutoff",
  "content": "Hey, so I got about 97.5 percentile in JEE Mains Jan attempt and I was wondering if theres a good chance I can get into PES RR for CSE. ",
  "metadata": {
    "author": "Early_Transition8818",
    "url": "https://www.reddit.com/r/PESU/comments/1isxqfq/jee_admissions_possible_cutoff/",
    "permalink": "/r/PESU/comments/1isxqfq/jee_admissions_possible_cutoff/",
    "score": 8,
    "created_utc": 1739941895,
    "flair": "PESSAT/Admission",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mdkh02t",
      "body": "Yeah you'll be getting it dw"
    },
    {
      "id": "mdkjimn",
      "body": "You could be getting better colleges at that percentile I think"
    },
    {
      "id": "mdkqkph",
      "body": "I think the cut off last year was 99 percentile for pes rr campus \nNot sure tho"
    },
    {
      "id": "mdkt1vf",
      "body": "No"
    },
    {
      "id": "mdktwqx",
      "body": "Maybe but Im kinda keen on doing CSE cuz ive been coding for a quite a few years now and wanna pursue smtg i like and I cant really find anything else for CSE thru mains."
    },
    {
      "id": "mdktxzm",
      "body": "Thanks fingers crossed : )"
    },
    {
      "id": "mdku3hu",
      "body": "Yea even I got a bit scared looking at that first ( it was 98.2 percentile for CSE i think ) but that was for 5% of seats cuz PESSAT still existed, now its 45% of seats only thru mains cuz PESSAT is gone. Maybe the cutoff will be lower .... shud be I think"
    },
    {
      "id": "mdkuj27",
      "body": "Ahh makes sense \nConsidering there is no pessat cutoff will be lower"
    },
    {
      "id": "mdkutfv",
      "body": ": ) Hoping so"
    },
    {
      "id": "mdkwlsa",
      "body": "So how low in terms of percentile can the cutoff to for pes cse rr or electronic City campus"
    },
    {
      "id": "mdkwsu3",
      "body": "Don't really know since its the first year of PES admitting thru jee mains ( with a high intake ). I dont wanna make any guesses without having some data of which none exists."
    },
    {
      "id": "mdkxla9",
      "body": "The people presently in cse, here at RR, had a mains percentile of about 93-94 and above. Even though its not that great of a metric to go with, you can take it as a reference."
    },
    {
      "id": "mdkxrfd",
      "body": "I scored more than him and I didn't get any"
    },
    {
      "id": "mdkxyr4",
      "body": "Thanks for the info. Imo thats probably the best metric to gauge with."
    },
    {
      "id": "mdky6p0",
      "body": "Could you elaborate, was this last year? And did you go in through KCET/PESSAT/HFC?"
    },
    {
      "id": "mdky9o4",
      "body": "Cet"
    },
    {
      "id": "mdkyts1",
      "body": "Ohh intakes gonna be high??"
    },
    {
      "id": "mdm5hq4",
      "body": "Check out the PES website it has all the details about intake for this yr."
    },
    {
      "id": "mdqw6b9",
      "body": "if you like CSE choose it, PES is great for it (placements wise alone)"
    },
    {
      "id": "mivrhso",
      "body": "Did they get admission with mains or pessat? And someone mentioned that the cutoff with pessat was somewhere around 98"
    },
    {
      "id": "miza5xc",
      "body": "The ones that came in through pessat, after writing pessaat exam, had a mains percentile of about 93-94 and above.  Earlier very very few seats were reserved for students coming through mains and thus the cutoff was very high (about 98). You can definitely expect that to drop."
    },
    {
      "id": "mizai7a",
      "body": "how much can be expected as the total expense in this uni? They have listed their tuition fee at 5 lpa (ain't that way too much?)."
    },
    {
      "id": "mj0hin8",
      "body": "The college doesnt take any more money on top of that 5 lakhs.. even if it does, it is quite meagre in comparison with the 5 lpa. 5 lpa is just ridiculously high.. add hostel and or commute to that expense and it just simply isnt worth it. \n\n  \nMost people come with the idea that the plaacements are insane in the clg and that you'd make that 20 lakhs spent in 4 years within a year or 2 of joining a job. Which puts a lot of pressure on you to perform and maintain your cgpa. Also if you are a decent student (top 25% of your batch)  and consistently remain top 25% you'll get 40% of your fees back as scholarship so that should bring your fees down to say  3lpa.. but thats only if you stay consistent.. which again adds to the pressure on you\n\nAll in all I'd say pes isnt worth it for 5lpa. If you have other opportunities, go for them."
    },
    {
      "id": "mj0iaiy",
      "body": "man, 25% does sound tempting but I don't know if I can use the comparison from my school performance. Can one be in the 25% with just theoretical portion? Coz I'd be a complete beginner and thus would take time and I am sure that there'll be many who have been doing that since a young age."
    },
    {
      "id": "mj68xj6",
      "body": "skills dont matter jack when it comes to scoring in exams. All you have to do is memorize shit and go to the exam. I was exactly like you with having absolutely zero knowledge but did end up getting scholarship in all sems. It will be tougher than your school grading because people are actually smart.. though no one studies till like a week or 2 before exams. \n\nWith all that said I'd, once again advice you to think for yourself if it's really worth it. The fees is still ridiculous even after the scholarship (also no scholarships are awarded in the final year). Most other colleges give scholarships as well. PES isnt worth it imo. Most people come here for the insane palcement stats but let's be real no one can tell how it's gonna be 4 years down the line.. that makes this whole 5lpa thing a gamble."
    },
    {
      "id": "mn1e49o",
      "body": "can i get cse at RR just at 93.47 percentile in mains, considering pessat is gone??"
    },
    {
      "id": "mprwdh2",
      "body": "Thapar also takes based on jee scores, check once"
    },
    {
      "id": "mtuht7a",
      "body": "Hi, Igot 95.37%ile in jee and 1320 rank in pesu jee rank vard\nWhat can I get?"
    },
    {
      "id": "mtun39y",
      "body": "i got 2290 idk what will i get"
    },
    {
      "id": "mtur708",
      "body": "I came to know that for sure I can get CSE in any one of the campus\nAnd for you, you may get cSE in EC campus"
    },
    {
      "id": "mtutc8n",
      "body": "How did you get to know that you will get CSE in any campus? \n\nI have got a rank of 1995 in the rank card, can I get CSE in RR campus?"
    },
    {
      "id": "mtuukkr",
      "body": "I spoke with my relative sister who is currently studying in PES EC campus.\nAnd for you, you may get CSE in EC campus. And you may get ECE in RR campus. But I'm not sure.\nIf you join ECE too you can jump to CSE in end of 1st year if you have good CGPA in 1st year. And also you can jump to RR campus if you have around 9.5+CGPA in 1st year."
    },
    {
      "id": "mtuva9n",
      "body": "What could the cutoff be for cse irrespective of campus?"
    },
    {
      "id": "mtuw0ge",
      "body": "No she is not aware about that. But she said for sure for 1320 rank you will get CSE but which campus I can't tell."
    },
    {
      "id": "n3gk77r",
      "body": "What would i get with a 3K rank?"
    },
    {
      "id": "n3y8m7y",
      "body": "would it drop down to 92 percentile for cse??"
    },
    {
      "id": "n3y8my1",
      "body": "btw what is your crl in mains?"
    },
    {
      "id": "n3y8qiq",
      "body": "Bro what was your crl in mains?"
    }
  ]
}