{
  "id": "1isx10t",
  "title": "Slides enough for OS ISA???",
  "content": "i tried reading the textbook but i don't think I can cover so much content. ",
  "metadata": {
    "author": "Middle-Station1823",
    "url": "https://www.reddit.com/r/PESU/comments/1isx10t/slides_enough_for_os_isa/",
    "permalink": "/r/PESU/comments/1isx10t/slides_enough_for_os_isa/",
    "score": 9,
    "created_utc": 1739939518,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mdkmrw8",
      "body": "slides are more than enough lol don't waste your time trying to study from the textbooks"
    },
    {
      "id": "mdl2771",
      "body": "really? our teacher said if we study from only slides we'll get like 10/15 in isa and if we do tb we'll get 30"
    },
    {
      "id": "mdl2xgn",
      "body": "my teacher said ready only slides and my friends teacher said the same thing yours said. i dk at this point"
    },
    {
      "id": "mdl6e50",
      "body": "our teacher said the same last year lol just make sure you know your concepts well after you read the slides. usually you'll get all theory qns with 1 or 2 numericals (if any)"
    },
    {
      "id": "mdl7yyv",
      "body": "slides is honestly all you need. the exams here aren't groundbreaking or anything, just mug up the slides"
    },
    {
      "id": "mdlotrp",
      "body": "oh okay I see. and what about CN? I liked os as a subject so I read the tb but I can't get myself to be motivated enough to read everything from CN tb."
    },
    {
      "id": "mdlrerr",
      "body": "the cn textbook is great and the topics are explained in a manner that makes it easy for a layman to understand. the only issue is the time constraint. \n\n i found cn to be much better than os (probably subjective because i really do not enjoy OS)"
    },
    {
      "id": "mdltzv2",
      "body": "Do they ask code for isa?"
    },
    {
      "id": "mdm3txp",
      "body": "can someone please answer this"
    },
    {
      "id": "mdm63vn",
      "body": "\\+1"
    },
    {
      "id": "mdmbqht",
      "body": "\\+1"
    },
    {
      "id": "mdmbz66",
      "body": "did they ask any codes???"
    },
    {
      "id": "mdmx757",
      "body": "I don't remember clearly but i think they asked aiml students a coding question but cs didnt get any last year. Not entirely sure about the aiml part."
    },
    {
      "id": "mdrkx99",
      "body": "i think 1 question was coding. i don't remember what topic it was though."
    },
    {
      "id": "mdrl6mm",
      "body": "slides are enough for every subject in sem 4. read the textbook only if you have time. its really important that you understand the concepts well though."
    },
    {
      "id": "mdt3siz",
      "body": "they do. especially in isa 1. its nothing too much, iirc they asked us to identify and fix an error in the existing code with proper reasoning (something to do with processes, idr)"
    },
    {
      "id": "mdt3zo6",
      "body": "Ok thx"
    }
  ]
}