{
  "id": "1iuwv5z",
  "title": "Dating in PES",
  "content": "How do y'all find a loving and caring partner here? 😭😭\n\nI'm just an average-looking third-year guy, and it feels nice seeing so many of my batchmates finding supportive and caring partners. But how long do I keep wishing for someone while never getting the chance to have someone by my side in this absolute rat race? It would be so nice to have a partner to support each other through this student phase and hopefully build a long-term relationship.",
  "metadata": {
    "author": "Plastic_Cost_6802",
    "url": "https://www.reddit.com/r/PESU/comments/1iuwv5z/dating_in_pes/",
    "permalink": "/r/PESU/comments/1iuwv5z/dating_in_pes/",
    "score": 73,
    "created_utc": 1740159987,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "me0wvn4",
      "body": "Skill issues lil vro"
    },
    {
      "id": "me0wwt6",
      "body": "Go study bruv 💀"
    },
    {
      "id": "me0yjfq",
      "body": "Go work on yourself first (get job)  \nshit will happen when it happens as long as you do everything possible within your control"
    },
    {
      "id": "me10h93",
      "body": ">How do y'all find a loving and caring partner here?\n\nBe the same\n\n\nWhy do you want \n\n\nYou have a bigger rat race you should be worrying about"
    },
    {
      "id": "me10iwt",
      "body": "Study hard, get placed with 69lpa, find unplaced girl/guy(i won't judge), enjoy"
    },
    {
      "id": "me10o0j",
      "body": "If you aren't happy single you'll not be happy in relationships also at a point. Plus having someone as a partner after knowing them for less than a year wont work out always"
    },
    {
      "id": "me13r1g",
      "body": "The only right answer!"
    },
    {
      "id": "me1gmur",
      "body": "I found mine when I stopped looking. At a hackathon at PES. Funny story!"
    },
    {
      "id": "me1nsu9",
      "body": "Damn, happy for both of you! 😃"
    },
    {
      "id": "me1qwxa",
      "body": "lmao a friend found her boyfriend on this subreddit. he dmed her about something she posted, and they started talking."
    },
    {
      "id": "me1skov",
      "body": "lmao i have a friend who found a boyfriend on this subreddit. he DMed her about something she posted, they started talking, realized they were from the same campus and batch, and eventually met up. they've broken up now.\n\nim not giving you ideas, but this post just reminded me of how random that was."
    },
    {
      "id": "me1sokf",
      "body": "Lol okay, I mean I don't see this as a platform to find one,I'm  kinda venting it out here.\nReally happy for my friends who are actually serious about their relationship and their career at the same time.Finding someone to struggle with together and later enjoy the fruits of success together is bliss!"
    },
    {
      "id": "me1tkmm",
      "body": "Yep, going on"
    },
    {
      "id": "me1tmnc",
      "body": "💀"
    },
    {
      "id": "me1tpwy",
      "body": "Actually 🥹"
    },
    {
      "id": "me1u6xo",
      "body": "I understand, just wanted to vent it out\n\nI've been working on it, I'm currently interning while juggling between academics and clubs. So it's just a wish that I have that maybe someone joins me in this journey someday and things work out for both of us.\n\nI'll focus on my career too, thanks!"
    },
    {
      "id": "me1v3ju",
      "body": "most of these relationships don’t actually last. people graduate, move cities, go abroad, chase careers, and what worked in college just stops working. sure, i’ve seen a few exceptions, but they’re rare. and at this age, no one really knows what they want in life partner anyway. it’s nice to have someone during college, but more often than not, it’s just for the moment."
    },
    {
      "id": "me27p2e",
      "body": "Ahhhhhh study. \nAs somebody in their mid/late 20s, I'm realizing that people in their early 20s have more time to \"get lost in the sauce\" and explore what options work for them. As people get older, they have \"lesser time\" to play the field, and start getting more serious about dating and \"settling down\". \n\nAs you get older, you'll realize that your age is a direct function of how real people are with themselves and their intentions."
    },
    {
      "id": "me3p5ie",
      "body": "Brozoned on reddit 💀"
    },
    {
      "id": "me3xqwv",
      "body": "Bruv thought ranting here will give him a gf 😭😭😭\n(me too)"
    },
    {
      "id": "me4hj3t",
      "body": "It's all in your fate brother. There's no such thing as pulling chicks in reality. It's just them being attracted to your humour and other fancy stuff lol."
    },
    {
      "id": "me4krjt",
      "body": "Lol chill"
    },
    {
      "id": "me4ribj",
      "body": "im reading pesu as pepsu cuz yk"
    },
    {
      "id": "me4vl7i",
      "body": "stfu, fuck the love blind bs, no dating no bs, just platonic stuff... be platonic thats what the life should be about   \nHail Plato!"
    },
    {
      "id": "me5cfal",
      "body": "Make an effort. Talk to someone you like. Even if they reject you it's not the end of the world. Always be yourself cause if you pretend to be someone you won't enjoy talking to the person cause you will always have to pretend and it will get irritating after a time(if you say weird ass or outrageous things I've met a few girls who find that fun). Try to become their friend first but keep dropping very subtle hints that you are interested(keep it very subtle or it will get creepy) so you don't get friendzoned. And please for the love of God don't just stick to talking about studies and job and shit ; Diversify your knowledge know a little bit about most things so you could hold a conversation. Try having fun rather than impressing that will happen naturally if you guys have fun.\n\nTip: if you're texting someone never close the conversation. Always leave it open ended so they have to respond to you and that way you can keep the conversation going. Keep in check whether the person is talking to you or just responding to you."
    },
    {
      "id": "me5ipt8",
      "body": "give up, nobody loves you cuz ur ugly n fat, not to mention that you're dumb as fuck\n\ni wanna roast u based on ur profile but cant cuz it seems ur coward ass made an account just for this one post\n\nand nobody likes a pussy"
    },
    {
      "id": "me5jump",
      "body": "Bruh You'll never get a \"Sudha Murthy\" kind  supportive, just do what makes you Satisfied."
    },
    {
      "id": "me5nwi3",
      "body": "It’s third year\nGo n Study\nElse after 4th year, you will be searching jobs like you are searching partner now"
    },
    {
      "id": "me79hf7",
      "body": "Post Nut Clarity"
    },
    {
      "id": "me7eey4",
      "body": "Neeraj pepsu 😔"
    },
    {
      "id": "meabti2",
      "body": "Focus on yourself,partner you'll get when the time comes and the time is gonna come for sure just wait and work hard later there will be no regrets , if you want things to be done instantly then just jump from top floor of be block and get the work done in heaven."
    },
    {
      "id": "mebcpv9",
      "body": "How can you expect to be loved if you don't love yourself?"
    },
    {
      "id": "mebf5xg",
      "body": "Join clubs."
    },
    {
      "id": "mebgwvq",
      "body": "Ehh tbh us girls feel the same way 🤷\nFinding nice caring guys who might even consider something long term feels like a dream ngl"
    },
    {
      "id": "mepp3vv",
      "body": "\"study\" such a useful advice 🤌🏻"
    }
  ]
}