{
  "id": "1iw36u4",
  "title": "Laptop advice",
  "content": "Hi everyone! \nI'm currently using this laptop which is 4yrs old: https://amzn.in/d/720MD5G \nI'm wondering if it would be sufficient for the rest of my engineering course. Would it handle the necessary tasks, or should I consider an upgrade?",
  "metadata": {
    "author": "ManyJackfruit5026",
    "url": "https://www.reddit.com/r/PESU/comments/1iw36u4/laptop_advice/",
    "permalink": "/r/PESU/comments/1iw36u4/laptop_advice/",
    "score": 6,
    "created_utc": 1740289515,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "meas7bx",
      "body": "I feel it’ll do okay. Not gonna do any wonders, but should manage to push through most things."
    },
    {
      "id": "meas9e4",
      "body": "Upgrade your ram to 8 gb"
    },
    {
      "id": "measorm",
      "body": "I tried running a VM but it was really slow and laggy"
    },
    {
      "id": "meat4sb",
      "body": "That’s what I meant by just pushing through most things. VM’s are a little heavy and things like that probably won’t be as smooth. Atleast in my experience, we didn’t really need VMs unless you got into the network/security spec so most things should run fine till then. If needed, you could upgrade then. \n\nOr if you have funds at the moment, you could go ahead and upgrade right away! If you want VM’s make sure you get something with a higher number of cores and more than average RAM"
    },
    {
      "id": "meazz6w",
      "body": "Ig this should do the trick, but if u have money to spend and if u are looking upgrade build a pc, it's way more cost effective. Ik it's not portable but it gives u a lot more power"
    },
    {
      "id": "meb01oo",
      "body": "cpu is good, upgrade the ram and storage, or if you cant afford the upgrades then switch to linux and be a little careful on disk usage, 256gb is usually not enough, keep pen drives and backup important shit"
    },
    {
      "id": "meb06jz",
      "body": "cpu is good, upgrade the ram and storage, or if you cant afford the upgrades then switch to linux and be a little careful on disk usage, 256gb is usually not enough, keep pen drives and backup your files regularly to make sure your disk wont fill up"
    },
    {
      "id": "meb0cli",
      "body": "if your computer boots up, its sufficient \n\nall other things can be figured out later"
    },
    {
      "id": "meb1end",
      "body": "I'm actually a beginner in Linux and was running a VM to practice and get more hands-on experience. Thanks a lot for the advice tho"
    },
    {
      "id": "meb2ymb",
      "body": "Tell that to my windows vista laptop"
    },
    {
      "id": "meb399l",
      "body": "Okay thanks a lot"
    },
    {
      "id": "meb9k71",
      "body": "No need untill u are training some ai ."
    },
    {
      "id": "mec4hoj",
      "body": "WINDOWS VISTA? NIGGA HOW ARE YOU EVEN ALLOWED NEAR TECHNOLOGY? I BET YOU STILL BLOW INTO GAME CARTRIDGES AND THINK DIAL-UP WAS PEAK INTERNET. USING VISTA IN 2024 ISN’T JUST DUMB, IT’S A CRY FOR HELP. SERIOUSLY, WITH DECISIONS LIKE THAT, I’M AMAZED YOU REMEMBER TO BREATHE EVERY DAY"
    },
    {
      "id": "mecbnlt",
      "body": "The og goat Windows Vista slander? In 2025? Bro out here acting like he's cracked the code of the universe just because you run Windows 11 with its 500 background processes eating your RAM alive. Meanwhile, my Vista machine boots up with style, still lighter than the \"gaming laptops\", has that green hill bg, helps with my declining attention span AND doesn’t shove ads in my Start menu. \nBlow into game cartridges? Hell yeah, because unlike you, I actually know how to fix things instead of crying when a ‘Restart Required’ popup shows up. \nYou call it outdated, I call it elite. Stay mad while I enjoy peak UI design."
    },
    {
      "id": "medpqt6",
      "body": "Upgrade RAM to 16GB and buy external SSD\nOr\nGet a macbook"
    }
  ]
}