{
  "id": "1iw92k2",
  "title": "Regarding malpractice policy at PESU",
  "content": "Could anyone please let me know what are the policies inline for malpractice in ESA ? Student found using internet and has proof copying.\nStudent was then asked to write a letter of apology to Controller of evaluation and was allowed to finish exam as is. \nIf possible could anyone tell the consequences that might cause by this ?\n",
  "metadata": {
    "author": "manoj-ht",
    "url": "https://www.reddit.com/r/PESU/comments/1iw92k2/regarding_malpractice_policy_at_pesu/",
    "permalink": "/r/PESU/comments/1iw92k2/regarding_malpractice_policy_at_pesu/",
    "score": 1,
    "created_utc": 1740313727,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mec12yr",
      "body": "please don’t think of cheating."
    },
    {
      "id": "mec60k3",
      "body": "bro really got caught cheating and was told to write an APOLOGY LETTER?!? WHAT IS THIS, KINDERGARTEN??? \n\nNEXT TIME THEY'LL ASK HIM TO DRAW A SORRY CARD WITH GLITTER.\n\nif this is how pesu handles malpractice, i think i wasted my life studying pointlessly"
    },
    {
      "id": "med35uj",
      "body": "the second part is very clear and understandable, but I didn't get the required answer.  please don't think of cheating is for an Action that is going to happen in future and I'm asking for actions that's already happened in past."
    },
    {
      "id": "mejawi5",
      "body": "Possession of electronic devices, papers, copying, etc. Besides nothing is worth the headache cheating brings. It'll be a black mark on your record"
    },
    {
      "id": "melbvxu",
      "body": "I just wanted to know what will the college do about this,  will the subject be failed or will the person be failed for a year ... 😕, in vtu, the subject would be failed that's it,  I don't know what will they do in private university"
    },
    {
      "id": "meo4m0k",
      "body": "They'd scold you, give you a fail for your subject, you'll have to take it as backlog. Maybe suspension...Idk I've never been in said situation"
    }
  ]
}