{
  "id": "1ixued8",
  "title": "Save us",
  "content": "CONS- 1) SAVE PSYCHOLOGY DEPARTMENT 😭they bring in meaningless rules.\n2) Recently their new drama started 'cannot use laptop to make notes' this was also fine.\n3) But, every student will get their name cards and they are supposed to get it everyday and sit in the class according to srn. Like wHY?  I mean who really gives a damn about which student will sit where. Like its gonna slove the problem of using phones etc. \nThey couldn't even go an extra step to make a decent name card, they used 'already  used' paper to make them. And the names are written in such huge bold font. we are supposed to bring it and keep it everyday on the table like cattles! But if thats what you want, why have id cards???Are they just stupid at this point? It literally just a laminated A4 SHEET cut in half thats already been used! And bring that shit everyday college.  The management really needs to get a life.  And not make our lives a living hell! \n4) Already we are over worked. They don't leave us early even when the prof is not teaching anything, WE STAY IN COLLEGE EVERYDAY TILL 4' .The psychology department is a disaster.\n 5) We have 3 huge research paper to finish,  assignments, case studies,  case reports. And they wont let us go home early and when we mention how much work we have, they say to do it in college,  but for that we need a goddam laptop.  Who in their sane mind would carry laptop everyday while using public transportation!? And even if we do carry laptops, whats the bloody use? We can't make notes in our laptop in class anymore. \n6) Keeping eyes on students through camera 24/7 , isn't that creepy, like get a life! Not just that, they from what i hv heard they can ultra zoom into phones and get a nice look of whats going on in the phone.  \n7) They make a HUGE deal about SLEEPING IN CLASS. I agree its not a good thing to sleep in class.  But how much can the students take!? Everyday wake up at 5, to reach college at 8 and then return home around 6pm. And then stay up all night working on research papers! Its impossible to not put our heads fown for just 2 mins! 8) IN ALL OF THAT THERE WAS 1 GOOD THING, WE COULD ATLEAST SIT NEXT TO OUR FRIENDS IN THE CLASS AND RELAX A  BIT, AND SIT ON THE BEACHES WE WANTED TO SIT ON.  BUT THESE PEOPLE TOOK THAT AWAY FROM US, MADE US SIT IN THE ORDER OF OUR SRN LIKE MINDLESS ZOMBIES! Many people cant sit in the back bench because they cant see the ppt properly from the back, many cant sit in the front bench because they are very light sensitive. Many of us get migraines etc, we could choose where we wanted to sit before BUT THEY WONT LET US SIT COMFORTABLY IN THE CLASS FOR 3 BLOCK CLASSES! \nSOMEONE FROM THE MANAGEMENT IS READING THIS, PLEASE TELL  ME WHATS THE POINT OF THIS????\n\nif anyone could please save the psychology department before i cry tears of blood and die. I feel like since pes loves to give us exposure about future so much, they are giving exposure of 'after life hell' at this point. \n\nWasn't clubbing all 3 sessions into 1 class not enough? Wasn't not giving attendance for people who came after the 1st session got over for they second session not enough? Wasnt not  letting us even keep our heads on the table even  for 2 mins not enough? They should draw the line with the rules at some point. \nThey made the guest lectures and the club hours in between the short and long break,  so no matter what, the students stay till 4 everyday. All other departments have their departmental clubs hours in the afternoon, but here, its only us that has it in between classes. \n\nEverything was fine. Why sit in the order of srn? Why make it so hard on us? And then expect 75%, for what? Ruining our mental health? Irony of the situation , its THE PSYCHOLOGY DEPARTMENT \nI wouldn't be surprised if they introduced the rules that 'the profs would sit in our class during the lunch time and we need to take permission from the professor to go out of the class during the lunch time'. Like seriously when will this stop? \n\nPros- the course design is good, the subjects are good",
  "metadata": {
    "author": "Far_Badger1318",
    "url": "https://www.reddit.com/r/PESU/comments/1ixued8/save_us/",
    "permalink": "/r/PESU/comments/1ixued8/save_us/",
    "score": 62,
    "created_utc": 1740488398,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mep18a4",
      "body": "Bruh that cls sounds more like a prison tbh ."
    },
    {
      "id": "mep3e7w",
      "body": "Yes I am shocked too."
    },
    {
      "id": "mepbavq",
      "body": "Please format your post with paragraphs and bullets."
    },
    {
      "id": "mepfz2k",
      "body": "Im from psych dept and yeah mostly making us sit with srn’s is the most pissing off , tbh other than that decent ig"
    },
    {
      "id": "mepxk25",
      "body": "yo @ claude 3.7 sonnet summarize the key points"
    },
    {
      "id": "mepxrf4",
      "body": "It won't last long, soon enough teachers will stop implementing the srn wise seating thing and people are going to end up sitting with their friends or where they want anyway"
    },
    {
      "id": "meq3d3e",
      "body": "Sounds like you guys need a.. psychologist 🫂"
    },
    {
      "id": "meqfq09",
      "body": "I think you need to take some therapy, I know a psychologist lemme know"
    },
    {
      "id": "meqit36",
      "body": "Wow! Am i sadistic for being happy to see some other department suffering with us!?😇😭 it’s the freaking same for us. Seating arrangements/ regular rotation. What are we? School kids?"
    },
    {
      "id": "mequcsi",
      "body": "Wtf...rotation . School was better than this! But this is too much!! We must do something about it!"
    },
    {
      "id": "mequz7e",
      "body": "I am doing just fine! Someone needs to tell the management that what they are doing is not 'okay' ! With so much work load from college they are making thses bizarre rules!"
    },
    {
      "id": "meqvims",
      "body": "Decent? What exactly is Decent? I am pretty sure they won't put a stop to making nee rules everyday if we dont stand for ourselves now"
    },
    {
      "id": "merxo0d",
      "body": "Management aint gonna give no shit,fr! Atleast thankfully , i somehow ended up sittng with my friends."
    },
    {
      "id": "merxrwv",
      "body": "And yes! We are also required to sit till 4pm even there is legit no classes.. freaking jealous of cse."
    },
    {
      "id": "methf0v",
      "body": "I would be left all alone because of this system 😭. Its surprising to see how no one is complaining or enraged!!"
    },
    {
      "id": "mettodm",
      "body": "ba dum tss!!!"
    },
    {
      "id": "meufjmo",
      "body": "There's much more than that\n\n1. We are also being made to attend guest lectures of other FOMC departments so that they can fill the seats \n2. Our deadlines are set by the hod who isn't from psychology background so all of them are unrealistic. She moved up a deadline by a month \n3. When asked \"why do we have SRN order in class\" she says ask Harvard why they do it \n4. On the topic of cctv, we also have other management faculty doing rounds, and then visiting classes to \"catch them red handed\"\n\nIf we don't sit according to srn order we don't get attendence, if we lose the paper with our names we will be fined.\n\nWelcome to psychology everyone"
    },
    {
      "id": "meuiey6",
      "body": "Lemme add on \nShe mentioned about 'Harvard'...There are so many other amazing colleges in india where people are made to attend classes based on their cgpa, if pes management wants to copy other universities so bad, why not implement this system? Where ppl with top grades dont have to attend classes! This will motivate the students to do well in classes as well!\n\nSince psychology is so much research oriented,  tell the HOD to give as scientific reasons behind why are me made to sit in SRN order. WHY AREN'T WE ASKING THE MANAGEMENT TO GIVE US VALID REASONS ?\n\nJust because someone wants to jump into a well,  doesn't mean everyone has to jump along with them. And that sure as hell doesn't mean if something works for a grp of ppl that same thing will work here\n\nAnd i can say all this, coz look at the name cards they have given us - they themselves didn't bother to fit in on our tables, they didn't even put efforts to use fresh sheets,  and even the way the paper are torn, it looks like some sat there tearing every paper by hand and laminated it!\n\nDo we pay the fees to learn some real things in college or to just get trained to 'obey authority' and not voice out any of our concerns !? \n\nJust imagine saying - 'i lost attendance because i wasn't  seating on the seat 'that was not official appointed me by the college ( coz if they were serious about it, they would actually allot us specific seats like they do for all the isa and eas) ' and thats the reason why i have a shortage and cannot write my exam. And this backlog will be reflected on my marks card and my resume! \n\nDoesn't that sound ridiculous!?"
    },
    {
      "id": "meuj8w9",
      "body": "Its not that no one is complaining about it \n\nThing is you know how the deadline petition went without being acknowledged. And we have also signed something during admissions that there will be no protest. \n\nIts not that people are okay with us but there is no way we can change anything here. Furthermore, who are you going to complain to? The Dean?? The same one who texts professors mid class that there are students sleeping???"
    },
    {
      "id": "meuletz",
      "body": "The fact is these people don't want us to protest,  but if we do things the 'right way' no one will listen to us! \nTHEY WILL NOT LISTEN TO US UNTIL WE FORCE THEM TO LISTEN! \nAlot of professor know whats going on isnt right,  but even they can't say anything coz the people at the top will drag them into some kind of politics \nIf the students don't think for themselves,  don't voice out anything, we are psychologically doomed!\nWe keep complaining about the things going wrong in the country, and as a citizen what are we doing to change it? If we can't do anything about the university,  forget about the country \nAnd the results of this... people are crying on the internet about a comedy show and comparing it to terrorism and on the other hand real issues are being swiped under the rugs!"
    },
    {
      "id": "mexloio",
      "body": "Idk they say it for making connections and rapport buiding idk , tbh that’s a good reason for srn seating other than , those other stuff you talk about aren’t really that bad"
    },
    {
      "id": "mexwiwz",
      "body": "I personally love sitting with my friends, because i love the course i am studying. With the group of people i hangout with, we discuss and debate about our views and opinions related to the subject etc. This promotes the freedom to think,  the freedom to choose,  the freedom to understand people at our own pace.\n\nBut if u say, making us sit in srn order will help us make connections in anyway, then you are absolutely wrong!\n\nLet's say, we do sit in the order of our srn, suppose my srn is 'y', then every day i get to only interact with 'x' and 'z' for the rest of the semester because 'a' , 'b' , 'c' are sitting somewhere far away! But without the bizarre rule, i can sit with 'a' , i can sit with 'x' or whoever i want. \n\nIf this rule is applied,  i would personally not speak with the neighbors around me, because i dont particularly like them. As a result i will get lonely and loose interest to come to class! \nBefore these rules,   the people i sat with, taught me so many things,  gave me these oceans of knowledge and it made learning interesting !\n\nAnd moreover, we have informal relationships with friends,  that makes asking them questions much easier  than approaching a professor, and this informal relationship help us grow as a person and also in career. \n\nAnd let me also make u aware that we are not kids , that we start to mingle with people just because they are sitting next to us! Alot of us by now know what kind of people we want to hangout with, its our personal preferences. And since you spoke about 'rapport building' , 1) I don't see how this will help with rapport building skills, as we have to sit in the same order throughout the semester.  2) the people i am sitting with  are not my 'clients' and i sure as hell cant see them like one. 3) who in there right minds will spend 7 hours a day working on communication and rapport building!? 4) if 'rapport' building was the reason behind these bizarre rules, they could have very well done proper workshops for that! \n\nUniversity is a place to where we can learn,  explore ourselves and our interests,  our bonds with people. And it also helps learn about ourselves,  at our own pace, some people might be fast and some people might be slow. \nBut you know what these bizarre rules will do!? Induce learned helplessness. It will stop our thoughts before we even begin understand our pace, because now we have to do, what everyone else does and just try so hard to keep up with the people around us, while being lonely.    And this, my friend will bury our individuality!\n\nSo now,  instead of learning, its just purely struggling to keep up. \nATLEAST I HAD MY FRIENDS THAT TIME, WHO MADE ME FEEL, ITS OKAY TO TAKE IT EASY SOMETIMES."
    },
    {
      "id": "mf1d8jt",
      "body": "Sensibilities are promoted by philosophers and great thinkers alike. But biased opinions from a few successes that aren't even fully understood is being learnt from. \nCommon sense as they say, is not so common after all even in the management"
    }
  ]
}