{
  "id": "1iym9ly",
  "title": "KCET 2025",
  "content": "im preparing for kcet 2025 and  ive completed my entire syllabus for boards and am confident i can get 293-295/300 in pcm. as for kcet, ive completed 95% of 2nd pu syllabus including short notes, pyqs and a few practice questions. after boards ill finish the remaining 5% of 2nd pu syllabus and give about 7-10 days for 1st pu syllabus. then i plan to keep 1.5-2 weeks for mock tests. please let me know if u think i should be doing anything else to get a rank below 2k. i want to get civil in one of the top colleges (i know pes doesnt have civil but maybe ramaiah or rv or something)",
  "metadata": {
    "author": "Training_Image_2433",
    "url": "https://www.reddit.com/r/PESU/comments/1iym9ly/kcet_2025/",
    "permalink": "/r/PESU/comments/1iym9ly/kcet_2025/",
    "score": 2,
    "created_utc": 1740572498,
    "flair": "Study Help :table:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mevjyx4",
      "body": "Civil😳😳"
    },
    {
      "id": "mevk65h",
      "body": "if you want to get into civil engineering at any kcet college here, you wouldn't even need to study half as much as you are now."
    },
    {
      "id": "mevnfq6",
      "body": "Why civil tho"
    },
    {
      "id": "mevo9jd",
      "body": "That’s great prep you got going on there, you’re on track to get under 1k if you follow through. But maybe you should reconsider your branch option as there’s very little scope in India atm. If you’re plans are to shift abroad then maybe you could consult any senior who’s done it"
    },
    {
      "id": "mevoc88",
      "body": "let them take civil, there needs to be less compeition for us cs peeps lol"
    },
    {
      "id": "mevohr5",
      "body": "Nothing wrong with taking civil, I'm just curious why"
    },
    {
      "id": "mevp92v",
      "body": "because some people prioritize studying a field they’re passionate about rather than choosing a more lucrative path. \n\ntho yeah civil engineering has limited opportunities, so OP should consider IITs or NITs, where the prospects might be slightly better."
    },
    {
      "id": "mevpwv6",
      "body": "i have a family business in construction lmao i'd be insane to take cs"
    },
    {
      "id": "mevq1be",
      "body": "Yea makes sense for u to take civil, good luck 👍"
    },
    {
      "id": "mevq4hd",
      "body": "my family already has a pre-established construction business so im actually taking the easy way out here. no looking for jobs or worrying about placements."
    },
    {
      "id": "mevqe0w",
      "body": "yes but i want a good rank for the flex lmao and also to show myself and other people that i could get any branch i want, but im voluntarily choosing civil because it aligns with my interests and future plans"
    },
    {
      "id": "mevr01y",
      "body": "What future plans you have that you wanna chose civil now"
    },
    {
      "id": "mevs0cj",
      "body": "family has construction business so ill join that. im also inetrested in business and plan to take a few project management and accounting courses after all these exams are done. im hoping to expand the business and take it further."
    },
    {
      "id": "mevs6ew",
      "body": "if everything goes according to plan this can be both lucrative and emotionally-fulfilling too"
    },
    {
      "id": "mevs6yz",
      "body": "look for civil in some other better colleges... cause the quality of students in civil in these colleges will be very poor"
    },
    {
      "id": "mevsso5",
      "body": "See bro its better you go to rvce or bms instead cuz they have civil engg in pesu you aren't going to find things that are going to favour your interests then"
    },
    {
      "id": "mevtlka",
      "body": "but as far as i know pes doesnt even have civil right?"
    },
    {
      "id": "mevv9vn",
      "body": "which colleges? i was looking at rv and ramaiah"
    },
    {
      "id": "mevwb71",
      "body": "nigga is probably from mechanical😭😭😭😭😭"
    },
    {
      "id": "mevxjjp",
      "body": "sorry mb... cutoff of civil at R.V. is 16k so its good enough..."
    },
    {
      "id": "mew60aw",
      "body": "try going for iit"
    },
    {
      "id": "mew7wp1",
      "body": "Yep you're right"
    },
    {
      "id": "mexefs7",
      "body": "advanced n all not worth it bro"
    },
    {
      "id": "mf036s4",
      "body": "bro civil from iit is insanely good wdym, although if you just want a \"degree\" then ig any college will do"
    },
    {
      "id": "mf08q5u",
      "body": "Pes doesn’t take into kcet from 2025 right"
    },
    {
      "id": "mf0kdfl",
      "body": "it doesn’t take pessat. it takes kcet "
    }
  ]
}