{
  "id": "1izxgiq",
  "title": "Placements",
  "content": "how difficult is it for a female with 7.2 cgpa and good DSA to get placed in T1 or maybe just get placed (pls answer for both)",
  "metadata": {
    "author": "Frequent_Umpire8571",
    "url": "https://www.reddit.com/r/PESU/comments/1izxgiq/placements/",
    "permalink": "/r/PESU/comments/1izxgiq/placements/",
    "score": 10,
    "created_utc": 1740710218,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mf7193m",
      "body": "For T1 - any T1 just needs good GPA, and some companies shortlist for the first round, that is online assessment itself, so most likely with 7.2, maybe u can write some companies tests and attend interviews too.   \nFYI, I had 7.2 GPA, and i was allowed to write Apple test. \n\nAny company - easily yes, many T2 / T3 keep a cutoff of 6.5 CGPA so u can safely write the test.   \n  \nWell, about clearing these tests in the above cases, depends on how strong your problem solving and DSA skills are, along with other CSE fundamentals. The male/female matters only for few companies only, who hire for females only"
    },
    {
      "id": "mf7rfmn",
      "body": "Yes DSA is very strong and T1 desperately needed"
    },
    {
      "id": "mf7rjd1",
      "body": "*along with core subjects and personality resume also nice, can explain and all communication also very good it’s just that I’m sure I’ll be able to clear OAs but cgpa thing scares me tbvh"
    },
    {
      "id": "mf7vk98",
      "body": "Ah dw, try to keep uptil 8.5+ CGPA, it shud be good enough, and u can sit for almost all companies tests"
    },
    {
      "id": "mf954zg",
      "body": "I can’t my cgpa is 7 and safer side will go 7.2 after this sem then i have placements"
    },
    {
      "id": "mf96y8a",
      "body": "ah okay, its fyn, u can still sit for many companies, dw"
    },
    {
      "id": "mf973w8",
      "body": "What is the best that i can do apart from Stivers to maximise my chances of T1 and also are you placed?"
    },
    {
      "id": "mf97dmi",
      "body": "yes, I am placed. Apart from strivers, u can do any codeforces / LC contests that happen every weekend"
    },
    {
      "id": "mf97fjm",
      "body": "How was your cgpa?"
    },
    {
      "id": "mf97pxo",
      "body": "same as yours"
    },
    {
      "id": "mf97rzl",
      "body": "Heyy damnnn so are you placed in T1?"
    }
  ]
}