{
  "id": "1izz5tk",
  "title": "How was DAA for you guys",
  "content": "CS people ",
  "metadata": {
    "author": "Fantastic_Jelly_1582",
    "url": "https://www.reddit.com/r/PESU/comments/1izz5tk/how_was_daa_for_you_guys/",
    "permalink": "/r/PESU/comments/1izz5tk/how_was_daa_for_you_guys/",
    "score": 20,
    "created_utc": 1740715808,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mf75a1d",
      "body": "🫠🫠"
    },
    {
      "id": "mf75qba",
      "body": "Keywords- “till now”"
    },
    {
      "id": "mf77n6j",
      "body": "I feel DAA is still at second position. M2 will always hold the throne😭"
    },
    {
      "id": "mf7depj",
      "body": "Lost my id 0/10 🙏"
    },
    {
      "id": "mf7hlv3",
      "body": "Everyday I wake up, hoping what could go wrong today. \nThen I go to the examination centre and look at the first question. Then I look at myself. I. Give. Up. \n\nWorst sem of all, not even close"
    },
    {
      "id": "mf7s8nf",
      "body": "honestly... skill issue"
    },
    {
      "id": "mf8zc39",
      "body": "prolly gonna get downvoted for this   \nBut  \nblaming college for not being able to score seems kinda du"
    },
    {
      "id": "mf9n4v2",
      "body": "We will see after u reach 2nd year"
    },
    {
      "id": "mf9vgsc",
      "body": "i've seen multiple comments by this nigga basically meatriding this college. we'll see what he says after ddco and webtech."
    },
    {
      "id": "mfa8eow",
      "body": "Aight bet, you might wanna buckle up homie.\n\nWhat was your JEE score?\nWhat was your advanced score?\n\nThe point you ended up in PES, speaks of a major skill issue in scoring. It's not even about scoring, it's about how they set the question paper. Id get 38/40 anyday on the paper AIML people got. CS everyone was shitting except some bookworms."
    },
    {
      "id": "mfabl8t",
      "body": "But he's got a point right? If the exam is tough and you didn't do well, it simply means you need to put in more effort and build a better understanding of the topics. Figure out why you didn't do as well: could be because you didn't paper sufficiently at the level required to answer those questions, or you didn't even know those topics, or anything else.\n\nWhat's the point of blaming PES for setting a difficult paper? They've always been known to set harder papers than necessary. Can't do anything about it except prepare accordingly. \n\nDon't pick on a fresher irrationally. Think rationally about why you didn't do well and then work on it. Mocking people for their JEE scores is irrelevant here."
    },
    {
      "id": "mfaiqwk",
      "body": "The thing is it would have been understandable if he was from the same batch but he is a jr and hasnt experienced the shit show from 2nd year onwards "
    },
    {
      "id": "mfajqni",
      "body": "I don't wanna argue in the middle of the night, I deleted the message, let him experience it, I think the whole point of reddit pesu is to rant about college. I don't need lectures here also.\n\nThanks, appreciate it"
    },
    {
      "id": "mfaln90",
      "body": "He definitely cannot relate to the workload and other stuff, but his point is still valid. Shit show it may be but your frustrations are misplaced."
    },
    {
      "id": "mfalxrk",
      "body": "It's understandable you want to vent after a bad paper. But maybe after you've vented, sit down and think rationally about it. Good luck for your other ISAs :)"
    }
  ]
}