{
  "id": "1j083ry",
  "title": "PES Merit List not accounced?",
  "content": "https://preview.redd.it/vkokogu7xvle1.png?width=1305&format=png&auto=webp&s=f61ceed66ca8e55b32cdd5ca4fc2093c00e90d36\n\nWasn't the Merit List supposed to come today?  \nI applied via the JEE Mains Session 1 thing. I got 99.6xx, will that get me CSE in RR?",
  "metadata": {
    "author": "Least_Development_51",
    "url": "https://www.reddit.com/r/PESU/comments/1j083ry/pes_merit_list_not_accounced/",
    "permalink": "/r/PESU/comments/1j083ry/pes_merit_list_not_accounced/",
    "score": 19,
    "created_utc": 1740750634,
    "flair": "PESSAT/Admission",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mf92bv1",
      "body": "with that percentile if you applied to pes maybe natural selection is in play"
    },
    {
      "id": "mf92tvm",
      "body": "My parents forced me to lol. It's not my choice at all, but they've been bugging me to check this"
    },
    {
      "id": "mf93h51",
      "body": "pretty sure you get cse in RR but im waiting for the merit list too its said tentative so might not release today"
    },
    {
      "id": "mf93y5u",
      "body": "How much did you get in mains? Is PES your first preference?"
    },
    {
      "id": "mf942yy",
      "body": "Are you a PES student?"
    },
    {
      "id": "mf9442i",
      "body": "Called up PES they said they are having some issues and would post it by the end of today or tmr. So most prolly its gonna come out tmr."
    },
    {
      "id": "mf94at8",
      "body": "Hopefully it's today. My mom won't stop asking me to refresh the page lol"
    },
    {
      "id": "mf94c11",
      "body": "I’ve gotten a 96.5 and I’m still not sure about it being my first preference right now"
    },
    {
      "id": "mf94cqj",
      "body": "I saw 99.6 and I was like wit this competition where tf do i get a seat"
    },
    {
      "id": "mf94n6p",
      "body": "imo its gonna come out tmrw, Idts anyone will still be working, day is almost over"
    },
    {
      "id": "mf9502o",
      "body": "Ah probably, Thank you!"
    },
    {
      "id": "mf95497",
      "body": "Have you applied for KCET? Cause you might CSE RR thru kcet (fees is 1 lakh) instead of paying 5 lakhs thru JEE Mains"
    },
    {
      "id": "mf959ch",
      "body": "I have applied for both, but KCET is yet to happen"
    },
    {
      "id": "mf95jdr",
      "body": "Oh nice..."
    },
    {
      "id": "mf95pdu",
      "body": "Are you a PES student? Can I DM you?"
    },
    {
      "id": "mf95tjr",
      "body": "yes"
    },
    {
      "id": "mf96huv",
      "body": "im pretty sure you can get into a good nit with that percentile. pes is not worth paying 4.5 lakh for, so keep it as your last option."
    },
    {
      "id": "mf97dlz",
      "body": "Yes yes! I'm still trying to improve my score in JEE Mains Session 2, and then BITS and Advanced etc. We'll see, but according to my parents \"PES is a safe option\" hence the application. Thank you though! Much Appreciated"
    },
    {
      "id": "mf98guw",
      "body": "Yeah I mean if u got 98-97 would make sense to apply to pes as a back up but at 99.6 ur bound to get good seats in nits and iiits."
    },
    {
      "id": "mf98uz1",
      "body": "He can get IIIT bangalore cse with that i think"
    },
    {
      "id": "mf98vxo",
      "body": "np. all the best."
    },
    {
      "id": "mf9f9dl",
      "body": "that hurts to hear, where did she end up going?"
    },
    {
      "id": "mf9l87v",
      "body": "PES e city lmao. she got a good enough kcet rank for RR but her parents did let her go there either."
    },
    {
      "id": "mf9lwcn",
      "body": "my brother in christ dont do this to yourself. you'll hate yourself.  \nwith that kinda percentile go to some iiit or any decent nit that u get.  \nand if u really really want to, come in thru cet, i can assure you u'll easily get in. the 5ish lakh fee thru mains with that kinda score is REALLY not worth it"
    },
    {
      "id": "mf9o5cy",
      "body": "iiitb is in ecity as well... or did they not want her to go to an hostel?"
    },
    {
      "id": "mf9r9uf",
      "body": "they didn't want her to \"mingle with boys\" and IIITB would have more guys obv"
    },
    {
      "id": "mf9yn83",
      "body": "it genuinely pains me to hear this, I hope shes doing okay now"
    },
    {
      "id": "mfd41p5",
      "body": "Hey dude,\n\ndid you email them regarding prefrences?What did they say?"
    },
    {
      "id": "mfdn353",
      "body": "wait what\n\nmy parents are sorta like that, and I told them I got cse at pes ecity 🥹"
    }
  ]
}