{
  "id": "1j09enh",
  "title": "I Need Help Feeling Lost and Don't Know What to Do",
  "content": "Im a 22-year-oldand over the past few years, I've been struggling with mental health challenges. I was on medication for four and a half years but had to stop due to severe side effects. In the past, I sought help for alcohol addiction, but unfortunately, l've recently fallen back into daily drinking.\n\nA few days ago, I made a series of choices that I deeply regret. I went to a spa for a massage, and when I was offered additional services, I made the mistake of accepting. I take full responsibility for my actions, but looking back, I realize that this could be the beginning of something far more harmful than I anticipated. Worse still, I engaged in unprotected encounters, which has left me anxious and uncertain about my well being.\n\nLately, l've also started smoking a pack and a half of cigarettes a day, lost my close friends, and surrounded myself with toxic influences. My college life is a mess, and I've been having dark thoughts that I don't know how to deal with.\n\nAt the same time, I know this isn't who I really am. I used to be among the top students, had great friendships, and was an active investor. I always believed in kindness l've donated to those in need, helped watchmen uncles and children with food, and genuinely tried to be a good person.\nBut somewhere along the way, I lost myself.\n\nIf there's one thing l've learned, it's that “regret is a choice” but so is every action leading up to it. We often tell ourselves, \"I'll just try it once, I have self control” but addiction doesn't work that way. No one truly understands their own limits until it's too late.\n\nI don't know how to fix this, and that's why I'm posting this. If anyone has been through something similar if you've found a way out please share your advice. I need help, but I don't know where to start\n\nTo anyone reading this, I'm sharing my experience not for sympathy but as a caution. If you're on a similar path or feel lost, seek help before it's too late. And if you've never tried substances, casual encounters, or anything that could spiral into addiction please don't start. Some choices have consequences we can't take back.",
  "metadata": {
    "author": "Flimsy_Landscape_526",
    "url": "https://www.reddit.com/r/PESU/comments/1j09enh/i_need_help_feeling_lost_and_dont_know_what_to_do/",
    "permalink": "/r/PESU/comments/1j09enh/i_need_help_feeling_lost_and_dont_know_what_to_do/",
    "score": 41,
    "created_utc": 1740754264,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": true,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mf9i03i",
      "body": "Not exactly the same situation, but I think this [video](https://youtu.be/1MgQFcBRLLo?si=4jeEdiYM0pI5zVza) by Jak Piggott on YT puts it into words really well. Highly recommend checking it out, and maybe follow him too. I've found the stuff he says to help in subtle ways. Consider this your starting point brother.  \n  \nPersonal experience:  \nI'd been in an existential shithole during 1st and 2nd year. Only now in 3rd year am I starting to break free from my own mind and really enjoying life for what it is.  \nI've learned that of all the feelings I can have, regret is the worst one. Going to sleep sad as fuck is still better than regretting not doing/trying something. I've learned to fear regretting things to the point where I just say \"fuck it\" and jump into whatever it is I'm hesitant about. Its a mindset that comes to you once you start taking those starting steps.  \nChange is gradual, but what truly works is constantly trying to do better by yourself. Being better than you were yesterday. If you can go to bed tonight feeling like you did better than yesterday, consider it a win and keep going."
    },
    {
      "id": "mfk7z78",
      "body": "Just goes on to show that trying to be “COOL” has serious implications in life, life is a rat race, true but that’s literally what makes a person want to live, that competition is what keeps one going regardless of the situation. Have control of your mind and body. There’s ups and downs in everyone’s lives all you need to tell yourself is fuck I need to be ahead of everyone, I need to be indestructible. YOU NEED TO TALK TO YOURSELF, PUT YOURSELF AMONGST PEOPLE who actually will make you better. \nI have simple motto in life, if you can’t get yourself to do something, surround yourself with people who have accomplished some milestone, their aura will transform you."
    }
  ]
}