{
  "id": "1j0f43n",
  "title": "Just got a seat alloted",
  "content": "So I applied for counselling through jee mains Jan attempt and today I was alloted a cse AI/ML seat in EC campus\nJust wanna know some honest opinions on the clg and the course...is paying the fee worth it?",
  "metadata": {
    "author": "Professional_Train63",
    "url": "https://www.reddit.com/r/PESU/comments/1j0f43n/just_got_a_seat_alloted/",
    "permalink": "/r/PESU/comments/1j0f43n/just_got_a_seat_alloted/",
    "score": 4,
    "created_utc": 1740768522,
    "flair": "PESSAT/Admission",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mfapyb6",
      "body": "What was your percentile lil bro?"
    },
    {
      "id": "mfaqeyk",
      "body": "92.98"
    },
    {
      "id": "mfaqoce",
      "body": "The fee is not worth it.\n\nThere are some good things about pes bug this is a post that you should see before choosing pes: https://www.reddit.com/r/PESU/s/oJL1tOI0pW\n\nAlso, i have seen many people on this sub saying that you should prefer the normal cse course over aiml."
    },
    {
      "id": "mfaqu8f",
      "body": "Thnx"
    },
    {
      "id": "mfas6bk",
      "body": "what??? mine is 96 percentile...got alloted for ece seat at rr campus :(Â "
    },
    {
      "id": "mfassgk",
      "body": "Yea I'm kinda shocked rn...I heard this clg takes 97+ to get cse...idk how I ended up with cse ai/mlðŸ’€"
    },
    {
      "id": "mfast1z",
      "body": "Here is a rough ranking order that is followed\n\nRR CSE > RR AIML > RR ECE >= EC CSE > EC AIML> EC ECE"
    },
    {
      "id": "mfasu93",
      "body": "what the fuck i got 95 and didnt get shit"
    },
    {
      "id": "mfat9mu",
      "body": "Bro what...chk againðŸ’€"
    },
    {
      "id": "mfau6y7",
      "body": "https://preview.redd.it/jznqbyblixle1.png?width=815&format=png&auto=webp&s=29c7d760c1b64ee6d763c41f78e4faccebe2eae4\n\nwtf is this ðŸ˜­ðŸ˜­ðŸ™"
    },
    {
      "id": "mfav8u6",
      "body": "The hell?idk bro I'm still shocked at how I got AI/ML...does it depend on preference choice or something?idk"
    },
    {
      "id": "mfavf2s",
      "body": "Scam...did you mess up in your preference order?"
    },
    {
      "id": "mfavvbd",
      "body": "i dont really know mate, i put cs rr , ai rr , cs ec , ai ec.   \nLooking back i have know clue why i even chose cs rr knowing i wont get it. Thought the priority order would be like they have for mains and not ACTUALLY go priority by priority. Do you think calling them tmrw is gonna help?"
    },
    {
      "id": "mfawetz",
      "body": "Try waiting and seeing how many people take seats, you'll probably get a better seat after session two"
    },
    {
      "id": "mfayrlg",
      "body": "looks like their selection criteria logic is cooked.."
    },
    {
      "id": "mfaz75c",
      "body": "yeah man, i got 2 full percentile more and ur gonna give the seat to the guy with first priority order just cause i put it 3rd in mine? thats BS"
    },
    {
      "id": "mfb0zxg",
      "body": "Aiml is just a harder cse branch. My frnd who had taken ai ml in rr told me that it's all the subjects in cse and more. Maybe ull learn more.\n\nThe fees is definitely not worth the facilities. If you were in RR Campus you could justify it\n\nPs ec campus cse here"
    },
    {
      "id": "mfb3w8h",
      "body": "Thnx"
    },
    {
      "id": "mfef3p9",
      "body": "Lmao can't justify in rr either. You should know that ecc and rrc are exactly the same, 12th graders are just not very smart while choosing colleges lol."
    },
    {
      "id": "mfef6b9",
      "body": "Bro, branch>>campus...."
    },
    {
      "id": "mfehlh4",
      "body": "Check previous year cutoffs"
    },
    {
      "id": "mffnfg9",
      "body": "Ya maybe not for the price jee is offering. But that jawahar keeps saying equality. The most hypocritical bitch I have known"
    },
    {
      "id": "mfk2grr",
      "body": "Not at all true, U have any idea how much relative grading aiml people have"
    },
    {
      "id": "mfk40b5",
      "body": "Is it hard to get a gd cgpa?"
    },
    {
      "id": "mflsln9",
      "body": "It's very easy for AI&ML people in our batch"
    },
    {
      "id": "mfqlnsl",
      "body": "Bro don't join if not kcet. The fees will be high and return on investment will be less. Moreover rr is better than ec campus. Try your best to get some nit or clg thru kcet. Don't end up here with high fees and high stress"
    }
  ]
}