{
  "id": "1j0fh0s",
  "title": "Messed up the Priority for Merit Seat",
  "content": "The Merit List was announced, and I think I mis-clicked(?), I'm not sure what happened but I'd like to switch Preference 1 and Preference 2.\n\nAlso, can seniors please share what would be the best Preference Order?\n\nIs it possible to do with the second round of counselling via JEE Mains? I got 99.6x percentile. Please let me know\n\nThank you!\n\nhttps://preview.redd.it/khk7v95tgxle1.png?width=1513&format=png&auto=webp&s=a058f5b938da90aec841424527a9f76ea9f9a322\n\n",
  "metadata": {
    "author": "Least_Development_51",
    "url": "https://www.reddit.com/r/PESU/comments/1j0fh0s/messed_up_the_priority_for_merit_seat/",
    "permalink": "/r/PESU/comments/1j0fh0s/messed_up_the_priority_for_merit_seat/",
    "score": 6,
    "created_utc": 1740769437,
    "flair": "PESSAT/Admission",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mfatkk2",
      "body": "yeah put rr cse as 1   \nyou'll get it easily with a 99.6x percentile  \n(try for better colleges though)"
    },
    {
      "id": "mfaurlo",
      "body": "Only PESU can have the big brain to sort a table by the non-sortable columns."
    },
    {
      "id": "mfaw0f4",
      "body": "Can I edit it now? or Should I email them about it?  \n(Or I could wait for 2nd session councelling)"
    },
    {
      "id": "mfax7cx",
      "body": "Can I walk in to their campus and change it? Should I email them?"
    },
    {
      "id": "mfaxjhf",
      "body": "No clue. You're probably already aware that this is the first year they've done away with PESSAT. Besides, I graduated in 2022 so no clue how these things work now. \n\nAsk a current 1st year. Maybe someone can help you."
    },
    {
      "id": "mfaxqen",
      "body": "we did not have all this, we had offline counselling for pessat so I doubt anyone knows"
    },
    {
      "id": "mfaxqtn",
      "body": "Alright. Thank you so much!"
    },
    {
      "id": "mfaxrt4",
      "body": "Call the helpline number and ask them"
    },
    {
      "id": "mfaxxf9",
      "body": "Okay will do tomorrow! Thank you so much"
    },
    {
      "id": "mfb6gsc",
      "body": "Heyy if you do manage to connect to them tomorrow can you please lmk what they say? Like atleast if not for this counselling wb the next one"
    },
    {
      "id": "mfb8ukl",
      "body": "I'll ask them yeah, if they don't give a good reply on call, I'm planning on going to RR campus on March 12th"
    },
    {
      "id": "mfcj7on",
      "body": "Bhai you got 99.6x, go get a nice NIT, why do you wanna suffer?"
    },
    {
      "id": "mfdmcia",
      "body": "Aight sounds good, if they do respond please ping me"
    },
    {
      "id": "mfdmswn",
      "body": "bro something very similar has happened to me.\n\nI'm kinda confused: how exactly do you \"book\" a seat until all your exam decisions are out? Since I'm happy, but I don't want to finalize anything until all the exams are over. (97.1x %ile)"
    },
    {
      "id": "mfdphqt",
      "body": "You have to pay the fees upfront, for me it shows 5.1lakh, and if you cancel your seat you'll get 5lakh refunded.\n\nI'm probably not going to pay in this round, and if my Session 2 result is not good enough for NITK CSE, I'll block a seat"
    },
    {
      "id": "mfdzber",
      "body": "Ah okay, thank you! Because I really wanna give NITs, IITs, and BITS my best shot, but my parents kinda value safetyand convenience so I'm worried they'll make me settle for pes too soon."
    },
    {
      "id": "mfe0cmr",
      "body": "They'll refund it, don't worry."
    },
    {
      "id": "mfefbjb",
      "body": "Bro 99.6 will get you an NIT pretty easily why come to PESU lmao"
    },
    {
      "id": "mfh3k4h",
      "body": "Bro what is this? Comedk ke exams ke se milte h na ye sab clg?"
    },
    {
      "id": "mfhfso8",
      "body": "Got cse in rr allocated for 99.5. will eee in nit k or ece in nit calicut better than pes cse?. FYI. Not very particular about cse branch"
    },
    {
      "id": "mfj97p4",
      "body": "imo if your not particular on cse... then NIT will be better as placement opportunities and NIT tag is bigger.. (even if you get PES thru KCET)"
    },
    {
      "id": "mfjlw9q",
      "body": "If branch doesn't matter, do NITK easily."
    },
    {
      "id": "mfjt2pc",
      "body": "pes was never part of comedk, it always had kcet and pessat major and little mains. Now they scrapped pessat and split it b/w mains and kcet"
    },
    {
      "id": "mflmtri",
      "body": "please take any branch that u get in NITK dont come to PESU for cs/aiml(you are wayy above this league) plss NITK ECE/EEE(2nd priority) should be better and rather write JEE advance and join IIT (1st priority) which is possible coz u got 99.6"
    },
    {
      "id": "mfln150",
      "body": "obviously why join and suffer for 4 yrs here when u can chill in a private beach........"
    },
    {
      "id": "mflr72i",
      "body": "Even if you were particular about cse, you could try for iiit bangalore cse (if fees isn't an issue). but since your not particular about cse ofc your options increase. At this percentile you have much better options than pes in my opinion"
    }
  ]
}