{
  "id": "1j33v7w",
  "title": "Protest against the newly implemented policies",
  "content": "We, the students of the PES UNIVERSITY, strongly oppose the newly implemented policies regarding seating arrangements, break restrictions, class timings, and student well-being. These regulations negatively impact our mental health, academic performance, and overall learning experience. We urge the administration to reconsider these policies for the following reasons: \n\n1) The SRN-Based Seating Order Policy \n\nWhy should we sit according to SRN? \n\nThe decision to enforce seating based on Student Registration Numbers (SRN) is unnecessary and counterproductive. While the administration may argue that it promotes discipline and rapport-building, the disadvantages far outweigh the supposed benefits. \n\nCons of SRN-Based Seating \n\n• Mental Well-being & Social Support:\nWe spend 8 hours daily in college, with 6 hours and 45 minutes dedicated to lectures. Along with attending classes, we are required to complete extensive coursework, including three research papers, assignments, case studies, and reports.\nIn this rigorous academic environment, sitting next to friends provided much-needed emotional support and motivation. This policy strips us of one of the few comforts we had in class. \n\n• Learning Preferences & Health Considerations:\nMany students face challenges related to classroom seating: \n\n• Some cannot see the projector screen clearly from the back and need front-row seats. \n\n• Others are light-sensitive and prone to migraines, making front-row seating difficult. \n\n• Previously, students could choose seats based on their needs, but this policy now forces discomfort upon them. \n\nIntellectual & Academic Growth: \n\n• Sitting with friends fosters collaborative learning, debates, and discussions that enhance critical thinking beyond textbooks. \n\n• Freedom to choose seating encourages interaction with different perspectives, helping students develop holistic viewpoints. \n\n• Forcing students to sit beside fixed individuals throughout the semester limits their exposure to diverse opinions. \n\nPersonal Preferences & Autonomy: \n\n• University students are not children who require forced socialization. We already know the kind of peers we work best with and should be allowed to choose accordingly. \n\n• The argument that this builds \"rapport\" is weak because: \n\n• Sitting in the same order all semester does not foster dynamic interpersonal skills. \n\n• Students are not clients; we cannot be expected to \"build rapport\" with seatmates as if it were a professional setting. \n\n• Communication skills are not developed by merely sitting next to someone but through meaningful interactions, which should not be forced. \n\nThe Consequences of This Policy \n\n• Learned Helplessness & Loss of Individuality:\nBy forcing students into predetermined seating and social interactions, the policy discourages independence, self-awareness, and individual learning paces. It pressures students to conform, stifling their personal and academic growth. \n\n• Decline in Classroom Engagement:\nMany students will not interact with those seated next to them if they do not share common interests. This policy may reduce engagement, increase social isolation, and diminish the enthusiasm to attend classes. \n\n2) Leaving Early When Professors End Class Early \n\n• Students are required to stay in college even when professors finish lectures ahead of time. \n\n• Given our academic workload, including three extensive research papers, multiple assignments, and case studies, we should be allowed to leave early to manage our time efficiently. \n\n• The administration argues that we can complete our work in college, but: \n\n• Research work requires laptops, which are inconvenient to carry daily due to long commutes and public transportation constraints. \n\n• Additionally, students are no longer permitted to take notes on laptops in class, making their presence in college outside of lecture hours even more unproductive. \n\n3) Restrictions on Resting or Sleeping in Class \n\nWhile sleeping during class is not ideal, the administration must acknowledge the exhausting schedules students follow. \n\n• Many students wake up at 5 AM, commute long distances to reach college by 8 AM, attend lectures all day, return home by 6 PM, and then spend hours completing coursework late into the night. \n\n• With this overwhelming workload, it is unreasonable to punish students for resting their heads for a few minutes when they are physically and mentally drained. \n\n4) Department-Specific Issues in Psychology \n\n• The Psychology department already faces excessive restrictions compared to other departments. \n\n• All three sessions are clubbed into one class, adding extra mental strain with no significant breaks. \n\n• Students who arrive after the first session are denied attendance, even if they were present for the rest of the lecture. \n\n• Even resting one’s head for two minutes is not allowed, despite the long and tiring schedule. \n\nInequality in Event Participation \n\n• Guest lectures and departmental club hours are scheduled during our breaks, preventing us from relaxing or managing our academic work. \n\n• Other departments conduct club activities in the afternoon, while psychology students must sacrifice their breaks to attend. \n\n• Many university-level events occur on Wednesdays after 1 PM, but psychology students cannot participate due to ongoing classes. \n\n• If students choose to attend, they lose attendance, creating an unfair disadvantage compared to other departments.\n \nFeel free to debate.  Any statements opposing or supporting this is welcomed\nIt could possibly be taken to the higher up in the future!",
  "metadata": {
    "author": "Far_Badger1318",
    "url": "https://www.reddit.com/r/PESU/comments/1j33v7w/protest_against_the_newly_implemented_policies/",
    "permalink": "/r/PESU/comments/1j33v7w/protest_against_the_newly_implemented_policies/",
    "score": 2,
    "created_utc": 1741066706,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mfx2pj3",
      "body": "U are just experiencing psychology practicals, though btech also is experiencing those practicals"
    }
  ]
}