{
  "id": "1j3430c",
  "title": "Debate against university policies",
  "content": "We need to protest against the srn policies, the 'no sleeping in the 5 mins break in 2hr 15 mins class, infact the 'no break policy'. \n\n1) THE SITTING ON SNR ORDER POLICY - \n- why should we sit according to srn? Pros and cons\n- we spend in total of 8 hours in college,  \nIn that we spend 6 hours 45 mins listening to lecture everyday. We have 3 huge research paper to finish,  assignments, case studies,  case reports\n-  in all of that there was  one good thing , we could atleast sit next to our friends! It helped with our mental health. Just shuffling the classes every semester wasnt enough!\n-  Many people cant sit in the front bench because they cant see the ppt properly from the back, many cant sit in the front bench because they are very light sensitive. Many of us get migraines etc, we could choose where we wanted to sit before but they wont let us sit comfortably in class!\n- I personally love sitting with my friends, because i love the course i am studying. With the group of people i hangout with, we discuss and debate about our views and opinions related to the subject etc. This promotes the FREEDOM TO THINK, the FREEDOM TO CHOOSE, the FREEDOM TO UNDERSTAND PEOPLE AT OUR OWN PACE!\n- Let's say, we do sit in the order of our srn, suppose my srn is 'y', then every day i get to only interact with 'x' and 'z' for the rest of the semester because 'a', 'b', 'c' are sitting somewhere far away! But without the bizarre rule, i can sit with 'a', i can sit with 'x' or whoever i want. \n\nIf this rule is applied, i would personally not speak to the students around me, because i dont particularly like them. As a result i will get lonely and loose interest to come to class! Before these rules, the people i sat with, taught me so many things, gave me these oceans of knowledge and it made learning interesting! \n\nAnd moreover, we have informal relationships with friends, that makes asking them questions much easier than approaching a professor, and this informal relationship help us grow as a person and also in career. \n\nAnd let me also make u aware that we are not kids, that we start to mingle with people just because they are sitting next to us! Alot of us by now know what kind of people we want to hangout with, its our personal preferences. \n\n- And alot of people argued  that it helps in 'rapport building \n1) I don't see how this will help with rapport building skills, as we have to sit in the same\norder throughout the semester. \n2) the people i am sitting with are not my 'clients' and i for sure , cant see them like one.\n3) who in there right minds will spend 7 hours a day working on communication and rapport building!?\n4) if 'rapport' building was the reason behind these bizarre rules, they could have very well done proper workshops for that! \n\n- University is a place to where we can learn, explore ourselves and our interests, our bonds with people. And it also helps learn about ourselves, at our own pace, some people might be fast and some people might be slow. \n\n-BUT YOU KNOW WHAT THE BIZZAR RULES WILL DO TO US?\nInduce learned helplessness. It will stop our thoughts before we even begin understand our pace, because now we have to do, what everyone else does and just try so hard to keep up with the people around us, while being lonely. AND THIS , MY FRIENDS WILL BURY OUR INDIVIDUALITY. \n\n2) leaving us early, when the professors  ends the lecture soon \n\n- let us leave early when the professors end the classes soon.\n- We have three extensive research papers to complete, along with multiple assignments, case studies, and case reports. Despite this workload, we are not allowed to leave early. When we bring up the amount of work we have, we are told to complete it in college. However, this expectation is impractical, as it requires access to a laptop. \n\nCarrying a laptop daily while using public transportation is highly inconvenient. Even if we were to do so, it would be of little use, as we are no longer permitted to take notes on our laptops in class. This situation creates significant challenges in managing our academic responsibilities efficiently. \n\n3) sleeping in class \n\n-They make a huge issue out of students sleeping in class, and while I agree that sleeping during lectures is not ideal, there is only so much students can handle. \n\nWe wake up at 5 AM to reach college by 8 AM, spend the entire day attending classes, and then return home around 6 PM. After that, we stay up late working on research papers and assignments. With such an exhausting schedule, it is nearly impossible not to rest our heads for just a couple of minutes. The workload and lack of rest take a serious toll, making it unrealistic to expect students to remain fully alert at all times \n\n4)  this issue specific to the Psychology department, and other departments facing the same challenges \n\nWasn’t clubbing all three sessions into one class already enough? Wasn’t denying attendance to students who arrived after the first session ended for their second session enough? Wasn’t forbidding us from even resting our heads on the table for just two minutes enough? There has to be a limit to the rules at some point. \n\nOn top of this, guest lectures and club hours have been scheduled during both our short and long breaks, ensuring that students stay until 4 PM every day. Other departments have their departmental club hours in the afternoon, but in our case, they are placed between classes, making it even more difficult to manage time. \n\nAdditionally, Psychology department students miss many university-level events on Wednesdays after 1 PM because we have classes during that time. If we choose to attend these events, we risk losing attendance, creating an unfair disadvantage compared to other departments. \n\nPlease feel free to debate against it or add points for it",
  "metadata": {
    "author": "Far_Badger1318",
    "url": "https://www.reddit.com/r/PESU/comments/1j3430c/debate_against_university_policies/",
    "permalink": "/r/PESU/comments/1j3430c/debate_against_university_policies/",
    "score": 48,
    "created_utc": 1741067557,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mfx206y",
      "body": "This sounds more like a psychology department policy , not university policy. Protest has to yield some sort of positive result , you shouldn't just protest for the sake of it , so it'll be better to complain about the department chair to the VC or pro chancellor or something (not like they even *care* about us inferior beings , they're too busy minting money) , but recently the biotech dept managed to get a new controversial prof fired so maybe you have a shot."
    },
    {
      "id": "mfx24j5",
      "body": "Better fix it before a departments policy becomes the university's policy"
    },
    {
      "id": "mfx2ah0",
      "body": "The way pes works , department is responsible for handling student issues , atleast for now. AIML/CS department is more chill with attendance issues compared to ECE"
    },
    {
      "id": "mfx2car",
      "body": "Department policy , this ain't university policy da"
    },
    {
      "id": "mfx3bmv",
      "body": "Yeah\nAbout the sitting arrangements etc, i have heard alot of other departments complain. \n\nBut for something like this to work, out department should Unitedly complain,  because this is getting way out of hand.\n\nAnd since pes is grandly known for its sucides, shouldn't they do something to focus on student mental health. Instead of just putting cages in panini, and leaving the 8th floor open for people to jump!"
    },
    {
      "id": "mfx3etg",
      "body": "Its slowly becoming the university policy! Things have already started getting implemented in other departments"
    },
    {
      "id": "mfx4swq",
      "body": "I am well aware,  i have mentioned in the post where particularly our department lies and also about certain things that actually concerns other departments too. Because i have had other people from different departments complaining about certain things."
    },
    {
      "id": "mfx7xy4",
      "body": "First they came for the socialists, and I did not speak out—because I was not a socialist.\n\nThen they came for the trade unionists, and I did not speak out—because I was not a trade unionist.\n\nThen they came for the Jews, and I did not speak out—because I was not a Jew.\n\nThen they came for me—and there was no one left to speak for me.\n\nType shi bruv"
    },
    {
      "id": "mfx9i67",
      "body": "Honestly, the student body has to do something about it and raise their voices, is there even a student  body? It's like it doesn't even exist. I'm positive that atleast some part of the management would be open to hearing put. However many small suggestions are cut off in the dept level itself during the CCM"
    },
    {
      "id": "mfxhyuu",
      "body": "Are you sure they aren't running some experiment on you guys 💀💀"
    },
    {
      "id": "mfxj8pp",
      "body": "The BBA department does this and it’s so annoying"
    },
    {
      "id": "mfxke5x",
      "body": "Womp womp cry more this is psychology department problem not uni go complain ur HOD"
    },
    {
      "id": "mfxlqhd",
      "body": "We should propose to form a student body to scrutinize  all the policies from the student's pov  because alot of things are going on in the institution. The student body president and subordinates must be included in the meeting regarding policies ."
    },
    {
      "id": "mfxlssk",
      "body": "Hope so!\nHonestly I wouldn't be surprised even if they are running an experiment!"
    },
    {
      "id": "mfxlxrw",
      "body": "We need to come together as one group to speak against it. For that, we need to spread the message as far as possible!\nMake sure to involve your friends too"
    },
    {
      "id": "mfxmf6c",
      "body": "As i said, not just psychology department.  Every other department is facing some or the other issue. And alot of issues that i mentioned above applies to alot of other department such as bba. And honestly,  seeing how things are going, can u give a garentee that these rules won't be imposed in other departments too? \nAnd Hod probably wont do anything,  since psychology department hod isnt even from a psychology background.  \nAnd most of the times its the dean who is running this CIRCUS!"
    },
    {
      "id": "mfxmrhj",
      "body": "The best reply so far!!\nThats what i have been trying to tell! Its not just psychology department. These policies are spread to alot of departments too. And there is no garentee that other departments that don't have these policies wont get them in the future\nEven when llb or bba department has these srn policies,  we never thought it would come to our department too! But here we are struggling! We need to do something about it before its too late!"
    },
    {
      "id": "mfxmwyy",
      "body": "What i think, we need 2 representatives from each department to form the student body.  So that its fair to everyone"
    },
    {
      "id": "mfxqs5f",
      "body": "This subreddit is for the entire university. If half the posts here are just bullshit brainrot and \"am I cooked i have xyz cgpa\", why can't OP complain about a legitimate issue."
    },
    {
      "id": "mfxsorq",
      "body": "No one's reading all that😭"
    },
    {
      "id": "mfxsvz4",
      "body": "there was a student body in ecc, but it was just a bunch of management ass lickers, so it might as well not have existed"
    },
    {
      "id": "mfxu520",
      "body": "Omg bruh this is so sick of them.\nMay be all your department has to speak to your department Heads abt this."
    },
    {
      "id": "mfxuiar",
      "body": "We clearly can see how useful they are!\nNot like those people! We need proper strong representatives who can put forward all the concerns clearly and support the statements rationally.\n\nIf the university cannot produce such strong people,  then what are they doing?just creating a bunch of mindless zombies who are being conditioned to never question authority! \nIs that what we want!?"
    },
    {
      "id": "mfxuqi1",
      "body": "Which department are you in? And i am not sure whether speaking to your department head would work, might give it a try.\nHonestly,  these policies are mentally breaking us. It is getting unbreakable to stay in class"
    },
    {
      "id": "mfxuu8d",
      "body": "Im graduated man, CSE\nAll these rules weren’t there for us at-least when i was in clg"
    },
    {
      "id": "mfxvqf4",
      "body": "They are newly imposing all of them. Its getting exhausting mentally and physically to a point where alot of students have actually resorted to substance abuse! And i know students who call me and cry because of how overworked we are and no one is there to listen to any of our concers! This is getting way out of hand"
    },
    {
      "id": "mfxx96h",
      "body": "Overwork will always be there atleast those strict rules should not be imposed"
    },
    {
      "id": "mfxy68v",
      "body": "Yep!\nI am not speaking against the work!\nI just want them to think how are we supposed to work freely with all the rules being imposed! Infact these rules are making us so exhausted that we are no able to work at all"
    },
    {
      "id": "mfxy96c",
      "body": "Exactly"
    },
    {
      "id": "mfz11wf",
      "body": "Thank you so much for the support!\nPeople are not understanding the gravity of the situation. \nIts getting so out of hand that students are acting resorting to drug abuse. They are high most of the time to make themselves emotionally numb with all of the things going on\nThere are 5 huge assignments pending with only 1 month time + the ridiculous rules\nNot just students,  the professors are seeing whats happening but they cant do anything about it because of the internal politics going on!\nThey are being messaged in between classes from the higher ups to wake the people up who were sleeping, DURING THE 5 MINS BREAK PROVIDED IN BETWEEN!\nWe are not being treated as humans! Our mental health means NOTHING to them! \nThis issue is huge that concerns all the students!\n\nStudents are crying,  like literally crying out of frustration. Its a battle waking up and find minimum motivation to come to college though every cell in our body screams not to!\n\nAnd all these hard work for what!?\nWe only had ONE SINGLE CLASS TODAY THAT TO IN THE MORNING!\nTHE REST OF THE DAY, THAT IS POST SHORT BREAK AND POST LUNCH BREAK CLASSES, NO PROFESSOR SHOWED UP! YET WE WERE MADE TO SIT TILL 4!\n\nwhen the professors being this up in the meetings, uk what the authorities say ? 'Leave them at 4:01 if possible , but not a single minute before 4!' \n\nThis is the state we are in!"
    },
    {
      "id": "mfzz59m",
      "body": "that seriously sounds dystopian how tf are you guys surviving"
    },
    {
      "id": "mfzzudm",
      "body": "We are not surviving! Trust me when i say this, alot of students are suicidal. This rises an alarming situation. I really dont understand are people just that naive or they just dont care! \nAsk your friends too, and spread this post across the university!"
    },
    {
      "id": "mg00if6",
      "body": "Please make ure to spread this post across the university,  to all the departments!\nBecause this is a serious issue. And if we do nothing about it, this issue will slowly make the students hollow from inside! \nPlease ask all yours friends,  seniors and junior to join in!🙏\nAnd we can come up with solutions to these problems!"
    },
    {
      "id": "mg2rr05",
      "body": "I kinda feel bad for you bro, we never had rules like these when i was studying at pes, best thing you can do is stand up for yourself!"
    },
    {
      "id": "mg2tfkb",
      "body": "I am trying so hard to do that! To bring people together against this!\nBut no one listens or they are to scared to do anything at all!\nI will be happy knowing that i don't fall under a bunch of brainless zombies! Atleast i am speaking up!\nI dont understand how people do not bother standing up against it! Its so frustrating! \nThey keep complaining but when its time to take stands,  they back off!"
    },
    {
      "id": "mg2u7kh",
      "body": "Then gather the courageous ones who are not afraid. You can't keep waiting for people to come together, you gotta be persuasive and your voice should be heard. Aren't your so called friends ready to help you w this whole thing? Get a petition signed by many students or like drop an email to the college on behalf of your whole class or smtg and attach that signed petition....that's what we'd do if we needed to bring a change, back when I was studying."
    },
    {
      "id": "mg2vovr",
      "body": "I have asked them! Even the crs! But our crs are a bunch of pets and dont want to take stands! And give us false hopes!\nI tried convincing the whole class! But people are just too scared! They cry in shadows!\nIf we dont stand up against it as a class or a department, there is no way we can stop it! \nIts so frustrating to watch them, i genuinely wanna cry!"
    },
    {
      "id": "mg5x73g",
      "body": "I never had an issue in sitting wherever I want. Some teachers are more strict compared to others so...they're class rules vary. As for no sleeping well...that's basic decency and it depends on the teacher...some will overlook, some will not"
    },
    {
      "id": "mgbcvk5",
      "body": "Well....if it was subjective like u are mentioning,  then i wouldn't be putting up a post with 'rules' mentioned on it!\nYou might not have issues,  but alot of people from different departments do , as they have made a 'rule' to sit in srn order. And went as far as telling 'if we dont sit the way they tell us to, then we loose attendance'. And as for 'different professors, different opinion' theory ,that doesn't work as the 'rule' was mentioned by our very respected HOD.\n\nAnd the 'basic decency 'you mentioned , the dean checks the cctv and sends a message to the professors in the respected class - complaining about the students putting their heads on the desk, even when 'the professors has given us break, or is not teaching anything, or even when the professors themselves dont have an issue with it.'"
    },
    {
      "id": "mgbe0e7",
      "body": "That really sucks. I wonder what reason they could possibly have for that.  Its a bit restricting like school. Maybe to foster attention"
    }
  ]
}