{
  "id": "1j49gqg",
  "title": "Is pes completely ragging free?",
  "content": "",
  "metadata": {
    "author": "Antique_Rub550",
    "url": "https://www.reddit.com/r/PESU/comments/1j49gqg/is_pes_completely_ragging_free/",
    "permalink": "/r/PESU/comments/1j49gqg/is_pes_completely_ragging_free/",
    "score": 39,
    "created_utc": 1741197925,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mg6pj0k",
      "body": "One of my favourite thing in this college is that most of the seniors are helpful in many ways be it studies or any other thing...kudos to all seniors!\nSo yea it's ragging free:)"
    },
    {
      "id": "mg6r4ze",
      "body": "most seniors are actually very helpful , so yeah there is no ragging here at all.."
    },
    {
      "id": "mg6utzv",
      "body": "ye, no ragging here. Seniors goated"
    },
    {
      "id": "mg6uuyi",
      "body": "Where time to rag? Need to finish assignments and projects and papers and whatnot /s"
    },
    {
      "id": "mg784pd",
      "body": "/I am coming out for the first time here, The first day I joined college some seniors made fun of my doraemon tshirt and threw hot coffee on my. I still feel a lingering burn on me whenever I think of it\nThe second time I was ragged it was much more severe. They pressured one of my class mates to tell me that a girl wants to confess to me. I was told to go to a corner where there weren't many people. I was beaten up and dirty water they had taken from the bathroom was thrown on me. I had to lie to the doctor that the bruises were just from me falling down\nI go to college in constant fear and constantly look around scanning for them. At break times I hid in the bathrooms to not get bullied. The staff won't do anything about it since they don't have any proof and everyone signed an \"anti-ragging\" Form.j"
    },
    {
      "id": "mg8nt6w",
      "body": "You put a /s but that is very true lmao"
    },
    {
      "id": "mg95qy9",
      "body": "there arent a lot of good things to say about pes, but one of the few that i can say is that the student culture is really good,\n\nthe seniors are what makes the college bareable,\n\nthe college is constantly trying to get you killed, rhe professors are doing everything in their power to ensure u dont get your degree, it seems that the only person on your side is your seniors\n\nof course, i dont speak for everyone, but at least in my experience, senior culture is what's kept me going for the last two years, and it makes me so sad that soon, i wont have any more, they're all cuties and i love them all so much omg \n\nvery huggable seniors"
    },
    {
      "id": "mg98k4g",
      "body": "most of my seniors are just scraping by, struggling to get thru every day\n\ni dont get to see them much but when i do i make sure to hug them because lowkey they need it"
    },
    {
      "id": "mg9nqu9",
      "body": "Dammn bro, i heard about that, hope you are doing better now, all the best with the therapy and recovery."
    },
    {
      "id": "mg9ygbb",
      "body": "Not trying to break the freshers in first day itself 😂, soon enough they will realise ragging is the least of their worries"
    },
    {
      "id": "mg9ypv4",
      "body": "Look at all juniors being wholesome wholesome \nAww\n\nBut yes, we are mostly ragging free ✨"
    },
    {
      "id": "mga5xul",
      "body": "If not ragging by students you’ll be ragged by teachers"
    },
    {
      "id": "mga70he",
      "body": "Ragged by college yes...but I have never seen student ragging here"
    },
    {
      "id": "mgab1r5",
      "body": "Only classmates rag you 😥😥"
    },
    {
      "id": "mgc4naw",
      "body": "The seniors are goated here, they send us notes before exams and after all exams are over they send us a drive with pirated games 😭,"
    },
    {
      "id": "mh1eu4f",
      "body": "Which drive link is this👀"
    },
    {
      "id": "mh28khb",
      "body": "I never had a problem not sure about classroom to classroom."
    }
  ]
}