{
  "id": "1j4vjgx",
  "title": "Sri M. R. Doreswamy Naidu is no more. Om Shanti 🙏🏻",
  "content": "",
  "metadata": {
    "author": "varungupta3009",
    "url": "https://i.redd.it/sttxfsrsn2ne1.jpeg",
    "permalink": "/r/PESU/comments/1j4vjgx/sri_m_r_doreswamy_naidu_is_no_more_om_shanti/",
    "score": 315,
    "created_utc": 1741268014,
    "flair": "ANNOUNCEMENT :snoo:",
    "nsfw": true,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mgbr9z3",
      "body": "wait what? is this legit?"
    },
    {
      "id": "mgbrpqf",
      "body": "holiday tom?"
    },
    {
      "id": "mgbs6i1",
      "body": "Bro wtf"
    },
    {
      "id": "mgbs9f0",
      "body": "rip but holiday tmrw?"
    },
    {
      "id": "mgbs9t8",
      "body": "is this true? no grp had this"
    },
    {
      "id": "mgbsbd5",
      "body": "Is it true ?"
    },
    {
      "id": "mgbsgyu",
      "body": "No way this is true, bad editing skills my boi"
    },
    {
      "id": "mgbskam",
      "body": "https://preview.redd.it/uwy7h5sjp2ne1.jpeg?width=900&format=pjpg&auto=webp&s=d81f43e663a2d6bfa959e6ddf75965cecdfb3353"
    },
    {
      "id": "mgbsw1t",
      "body": "No more mrd scholarship? 🥺☹️😕🧐"
    },
    {
      "id": "mgbsx9p",
      "body": "Be respectful like damn"
    },
    {
      "id": "mgbtclv",
      "body": "My Condolences."
    },
    {
      "id": "mgbtggj",
      "body": "Valid question"
    },
    {
      "id": "mgbu0ix",
      "body": "MRD block will be LMRD block hereafter ?"
    },
    {
      "id": "mgbu5ld",
      "body": "Om shanti"
    },
    {
      "id": "mgbubpg",
      "body": "RIP"
    },
    {
      "id": "mgbucwe",
      "body": "With heavy hearts and profound sorrow,  we inform the sad passing of our beloved founder chairman and chancellor Dr. M. R. Doreswamy on 06th March 2025.\n\nCremation will take place tomorrow, Friday 07th March 2025. 🙏\n\nAll classes in the university are cancelled on Friday 7th March 2025"
    },
    {
      "id": "mgbujv6",
      "body": "he can rest in peace knowing IIT Banglore will carry on his legacy 🙏🙏"
    },
    {
      "id": "mgbutt2",
      "body": "Why is everyone treating this like a joke? I mean, I know when other colleges gave holidays and PES didn't, ppl said they wouldn't give a holiday even if Doreswamy died, and while that's acceptable, guys, he actually passed away now. Making jokes or  treating it like this, asking about holidays or mrd scholarship and what not, is in such poor taste. A little respect please 🙏"
    },
    {
      "id": "mgbuwsw",
      "body": "this fr?"
    },
    {
      "id": "mgbv3ef",
      "body": "Yes APPARENTLY THIS IS FROM HOD"
    },
    {
      "id": "mgbvom2",
      "body": "No matter the good and bad things that have happened in the college, but he is responsible for the facilities that we have today. RIP 🙏🏼🙏🏼."
    },
    {
      "id": "mgbw4i1",
      "body": "Rip king"
    },
    {
      "id": "mgbw6fa",
      "body": "Wait well who made a joke now?"
    },
    {
      "id": "mgbw9x7",
      "body": "RIP🙏🏻"
    },
    {
      "id": "mgbwjk3",
      "body": "Om Shanti 🕉"
    },
    {
      "id": "mgbwo5x",
      "body": "RIP"
    },
    {
      "id": "mgbwrev",
      "body": "What a visionary he was. Rest in peace 🕊️"
    },
    {
      "id": "mgbwvaf",
      "body": "The man who made PES for what it is today i truly respect him."
    },
    {
      "id": "mgbwy5m",
      "body": "RIP"
    },
    {
      "id": "mgbwzsb",
      "body": "Om Shanti founder of IIT Bangalore 🙏🙏"
    },
    {
      "id": "mgbxfn1",
      "body": "Rest in peace."
    },
    {
      "id": "mgbxhri",
      "body": "i think about smtg like death is absolutely insensitive,you just can't let your intrusive thoughts always and comment disrepectful stuff"
    },
    {
      "id": "mgbxjy9",
      "body": "RIP, I have esa tomorrow, will it be conducted?"
    },
    {
      "id": "mgbymcb",
      "body": "Respect? Do you think he cared when one of us died? Do you think it concerns him when someone in PES commits suicide? Why should we be concered then? Respect goes both ways,stop idealizing the rich."
    },
    {
      "id": "mgbymw9",
      "body": "I suppose the exams will be as per schedule. Only classes to be suspended."
    },
    {
      "id": "mgbyy7w",
      "body": "Tommorrow holiday"
    },
    {
      "id": "mgbz1ep",
      "body": "Bro just read what you said. Really questionable morale"
    },
    {
      "id": "mgbzowf",
      "body": "Om Shanti Om*"
    },
    {
      "id": "mgbzsme",
      "body": "i’m usually the last person to say anything positive about this college, but come on man you're talking as if he was a fucking war criminal or something. get a grip"
    },
    {
      "id": "mgc08k1",
      "body": "Death needs to be respected irrespective of class. Think next time before you type."
    },
    {
      "id": "mgc0a9i",
      "body": "To the ones being insensitive retards.... Imagine ur dad/grandad builds a empire in hopes to help people to be their best version...and when he passes away...some retard fucks who was being benifited by his works comments like u....how would u as someone close to ur dad/grandad feel?\n\nBe respectful 🙏"
    },
    {
      "id": "mgc0q43",
      "body": "Om shanti"
    },
    {
      "id": "mgc0umd",
      "body": "Do you really think the management has a personal vendetta against you all? Don't be a fucking clown."
    },
    {
      "id": "mgc0uua",
      "body": "Maybe they don't care about pes suicides, maybe they do. End of the day, do you know any other college that gives as many scholarships as PES does? They're clearly trying to motivate us. \nAnd we all willingly joined PES right? They did warn us that it'll be hectic. Maybe in some cases, the student didn't have a choice as their parents or family forced them, but that's definitely not on PES. \nThis is not the time or the place for this argument. You wanna talk about idealizing the rich, do it when someone hasn't just passed away. To his family, he's still the person they love and THAT is something we should respect."
    },
    {
      "id": "mgc1476",
      "body": "Now, I didn't know MRD personally (my father knew Jawahar closely since he was his client), but I just wanted to share a few words.\n\nSince I became an eligible voter, every year my grandfather and I went to the polling booths early in the morning, and amongst our dear neighbours, Doreswamy was also always standing in line. The first time, my grandfather asked me to touch his feet, since my education (and therefore, my future) was in part due to his vision and ideas. He said that MRD's blessings were something I shouldn't miss.\n\nI've voted 4 times in my life, and coincidentally, I've met him and received his blessings every time. I've done well since, and even though I'm not a very religious or \"sanskari\" person, I am very thankful for him. Not just for myself, but also for the fact that he had a major role in the education of tens of thousands (maybe even lakhs) of students in Karnataka and beyond.\n\nMay he rest in peace."
    },
    {
      "id": "mgc1995",
      "body": "Rest in peace sir 🙏"
    },
    {
      "id": "mgc1rkp",
      "body": "It was way back in 1972, with the intention of reforming the education sector, that PES University was established, and we are now proud to be a part of it.\n\nRespect to you, Sir!"
    },
    {
      "id": "mgc3b0v",
      "body": "A true visionary who built PES from the ground up. RIP."
    },
    {
      "id": "mgc5wq8",
      "body": "You should be barred from scholarships and use of any facility offered by the college. Maybe stop wearing tinted glasses which only see the bad. Don't try take the moral high ground either we all know you also don't give a flying shit about any suicide its just another leeway for you to shit on the college. The founder of one of the if not the best college in Banglore has just passed away and you are making this about idealizing the rich? get a fucking life"
    },
    {
      "id": "mgc656f",
      "body": "Rest in peace sir 🙏 Om shanti"
    },
    {
      "id": "mgc78k3",
      "body": "Such a strong man, built not just an engineering college but a whole institution. Made education more accessible. PES is easily one of the most reputed colleges in the region. My thoughts are with those close to him."
    },
    {
      "id": "mgcaqn8",
      "body": "Jokes aside and Om Shanti💐 Does anyone know what happened and how he passed away??!?!"
    },
    {
      "id": "mgcar8e",
      "body": "The point is today everyone is selfish \nMore than 50k people have died in gaza,ukraine ,\nDoes anyone care ? No one right? \nThe point is even if you do something nice there will be a portion in the society which will not like you.\nSo there's no point in arguing in this matter and let it settle down."
    },
    {
      "id": "mgcasz5",
      "body": "The point is today everyone is selfish \nMore than 50k people have died in gaza,ukraine ,\nDoes anyone care ? No one right? \nThe point is even if you do something nice there will be a portion in the society which will not like you.\nSo there's no point in arguing in this matter and let it settle down."
    },
    {
      "id": "mgcc0s3",
      "body": "RIP"
    },
    {
      "id": "mgce8vv",
      "body": "That's a really touching story, I'm sure there are many others (me included) who thank him just the same. RIP"
    },
    {
      "id": "mgchoeo",
      "body": "RIP to the greatest man ! may his soul rest in peace"
    },
    {
      "id": "mgcjl5i",
      "body": "A news article is available here:\n\n[https://kannada.hindustantimes.com/karnataka/m-r-doreswamy-death-pes-university-chancellor-m-r-doreswamy-passes-away-uks-181741270132153.html](https://kannada.hindustantimes.com/karnataka/m-r-doreswamy-death-pes-university-chancellor-m-r-doreswamy-passes-away-uks-181741270132153.html)"
    },
    {
      "id": "mgckx06",
      "body": "Bruh are you mentally retarded by any chance."
    },
    {
      "id": "mgcy8dn",
      "body": "late MRD scholarship"
    },
    {
      "id": "mgd1f17",
      "body": "Can students too go and pay respect to him, at his cremation place tomorrow??"
    },
    {
      "id": "mgdinpr",
      "body": "Bkl.."
    },
    {
      "id": "mgdliv0",
      "body": "Om Shanti 🙏🏼"
    },
    {
      "id": "mggbyfw",
      "body": "is the hackathon cancelled"
    },
    {
      "id": "mggptfp",
      "body": "Rest in peace sir\n\nMy father studied in PES in 90s and always praised the hardworking nature and his orientation towards quality education, today is PES is a big name because of Dorreswamy Sir's foundation..\nRest easy King 👑"
    },
    {
      "id": "mgh29iu",
      "body": "He was admitted from long time ago due to health issues."
    },
    {
      "id": "mgh3m3q",
      "body": "RIP, IIT Bangalore should carry on his legacy."
    },
    {
      "id": "mgh88io",
      "body": "Rip"
    },
    {
      "id": "mgi0gdp",
      "body": "Rip"
    },
    {
      "id": "mgnajuk",
      "body": "REST IN PEACE JAI SHREE RAAM"
    }
  ]
}