{
  "id": "1j7xezl",
  "title": "Does this confirm I’m getting scholarship?",
  "content": "",
  "metadata": {
    "author": "JellyfishLonely9155",
    "url": "https://i.redd.it/wfo3uw4jvune1.jpeg",
    "permalink": "/r/PESU/comments/1j7xezl/does_this_confirm_im_getting_scholarship/",
    "score": 29,
    "created_utc": 1741609608,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mh0g7fl",
      "body": "These emails are general communication, everyone gets them. You would know if you're getting a scholarship based on the CGPA brackets set by your department"
    },
    {
      "id": "mh0g8w7",
      "body": "same doubt like does this apply for the 2000 rupees one"
    },
    {
      "id": "mh0h801",
      "body": "They have asked to upload first page of pass book... it isnt filled for me.. should i get it filled from the union bank branch?"
    },
    {
      "id": "mh0i2aq",
      "body": "where did they ask that? are u a kcet student?"
    },
    {
      "id": "mh0ivrn",
      "body": "https://preview.redd.it/cseweh020vne1.png?width=1067&format=png&auto=webp&s=2dc6614c77ba0d44170f54999658848629920b9a\n\nYes.. im from KCET"
    },
    {
      "id": "mh0k0ds",
      "body": "ahh also ec campus right? they didnt ask us for pass book photo for rr campus  \nwe got that mail long back"
    },
    {
      "id": "mh0k2d3",
      "body": "No i think everyone has to fill this"
    },
    {
      "id": "mh0l7fv",
      "body": "No"
    },
    {
      "id": "mh0mvhc",
      "body": "You should have a sgpa of 7.75 or more\nAnd to get this you should have a account in union bank"
    },
    {
      "id": "mh0tq5a",
      "body": "i didn't open an account bc i thought i wasn't getting a scholarship- now i have gotten a good enough cgpa and don't know what to do. the union bank acc people at pes weren't there the last 3 to 4 days as well- so what do i do rn??"
    },
    {
      "id": "mh113zh",
      "body": "Go to union bank office near college and open a new savings account"
    },
    {
      "id": "mh1dk2z",
      "body": "Hey is opening an account free ? College was asking for 10k from me when I wanted to open"
    },
    {
      "id": "mh1rsnn",
      "body": "its free,idk why they asked 10k"
    },
    {
      "id": "mh1tcu4",
      "body": "I'm a cet guy. In the pdf they sent for fee it was mentioned"
    },
    {
      "id": "mh25txp",
      "body": "It's not for opening the account. For kcet people you have to pay 10k to be eligible for scholarship. Distinction mrd or cnr.\nIt's a one time thing pay in the first sem then applicable for all sems. If you are confident in getting above 7.75 every sem then you can opt for it otherwise it a waste."
    },
    {
      "id": "mh27d43",
      "body": "It isn't a one time thing \nGotta pay every year\nAnd they told us once I opt in I cannot opt out"
    },
    {
      "id": "mh2ahle",
      "body": "Ah indeed my mistake. Had to consult with a friend. So basically hnless you have confidence of getting 8.5 don't take."
    },
    {
      "id": "mh2h3uf",
      "body": "I do have. Just my dad thinks it's stupid and scummy to have to pay for it in the first place, so"
    },
    {
      "id": "mh4nldi",
      "body": "It’s a gamble to say the least.."
    },
    {
      "id": "mh4py2o",
      "body": "Yup it is stupid and scummy. They'll shame you for it as well sometimes. But don't care too much"
    },
    {
      "id": "mh51fze",
      "body": "Even if you get mrd or cnr scholarship in 1 semester the 10k every year will be recovered so it’s worth going for it"
    },
    {
      "id": "mh888u5",
      "body": "If you have an SGPA of above 7.75 you should get this"
    },
    {
      "id": "mhcwl7h",
      "body": "yes, cet students have to pay 10k to be eligible to get scholarships, 10k isnt fee for opening bank acc"
    },
    {
      "id": "mhu6dg7",
      "body": "Hey man! Could you please specify where theyve sent the form?\nI haven’t received it"
    },
    {
      "id": "mhuxg8o",
      "body": "They sent on email on 10th March... but to receive that email you should have an 7.75 sgpa + and paid 10k (if your a kcet student)"
    },
    {
      "id": "mhv4cyr",
      "body": "Was it an exclusive mail for kcet students?\nAlso can u pls send the mail?\nI got the cnr scholarship but haven’t received the mail"
    },
    {
      "id": "mhv50vi",
      "body": "Only the kcet students who paid 10k + all pessat students received the email... if you got 8.5+ sgpa and paid 10k you should have received the email, check the email which you used for pesuacademy.."
    },
    {
      "id": "mhv9a8i",
      "body": "Well maybe this is for cs, I’m in ece"
    },
    {
      "id": "mhv9k74",
      "body": "im also in ece😅"
    },
    {
      "id": "mhv9omo",
      "body": "Sem1?"
    },
    {
      "id": "mhvcecd",
      "body": "yes currently in sem 2.... [no-reply@pesuacademy.com](mailto:no-reply@pesuacademy.com)"
    },
    {
      "id": "mhvclkb",
      "body": "So u come under science and humanities \nNot ece bro\nFrom sem3 you’re in ece\nThat’s y u would’ve received the mail"
    },
    {
      "id": "mhvcquc",
      "body": "oh sorry... i thought your also in sem 2 currently lol"
    }
  ]
}