{
  "id": "1j9hcce",
  "title": "Can I take an year break?",
  "content": "I'm not doing okay right now and I'm in 1st yr, is it possible I can continue the same course next year basically like repeat first year coz I need some time for myself?",
  "metadata": {
    "author": "Maybewtfwtf",
    "url": "https://www.reddit.com/r/PESU/comments/1j9hcce/can_i_take_an_year_break/",
    "permalink": "/r/PESU/comments/1j9hcce/can_i_take_an_year_break/",
    "score": 29,
    "created_utc": 1741776832,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mhdcvoy",
      "body": "if its a mental health/psychological issue there's no way they'll give you an year break. If it's a physical health related issue, (something extreme like cancer) there's a good chance they will allow you to take time off of college. Although you will still pass out in 2028 like the rest of us, it's a relaxation on classes, ISAs and assignments."
    },
    {
      "id": "mhdrdjp",
      "body": "I think it's best to reach out to PES and find out. I personally don't know and neither have I heard of people requesting a year or absence, so I can't add any information here without speculating which I don't want to since that would mislead you."
    },
    {
      "id": "mhdrl7h",
      "body": ">Although you will still pass out in 2028 like the rest of us, it's a relaxation on classes, ISAs and assignments.\n\nDo you have any proof to support this?"
    },
    {
      "id": "mhe1d8z",
      "body": "well, if the reason is very genuine, reach out to PES. They may help you in any way"
    },
    {
      "id": "mhksa89",
      "body": "Idk if that's a problem. If you already paid the fees then it'd be a waste. Its not as if they'd be generous to refund"
    },
    {
      "id": "mi13ud7",
      "body": "yea ik a few people who've dealt with severe fractures and have gotten a relaxation on attendance... and any exam(s) which they couldn't attend, the weightage was added to ESAs."
    }
  ]
}