{
  "id": "1j9jlfh",
  "title": "Lack of common sense",
  "content": "For the guys who are using the library, kindly maintain the library's decorum. The library is not a place for loud talking/having fun. It is not a place to make phone calls. If you need to take a phone, talk softly and do not talk very loudly which disturbs others. If you want to talk in the library, you might as well use the Brain storming rooms available in each floor.   \n\n\nIf you want to have fun, there's enough space around the campus for that. Hope this message is understood.  \n\n\n",
  "metadata": {
    "author": "Brilliant_Mangi",
    "url": "https://www.reddit.com/r/PESU/comments/1j9jlfh/lack_of_common_sense/",
    "permalink": "/r/PESU/comments/1j9jlfh/lack_of_common_sense/",
    "score": 104,
    "created_utc": 1741784712,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mhdo87n",
      "body": "Sorry if it was me 👉👈"
    },
    {
      "id": "mhdon2l",
      "body": "Agreed  \nHowever mostly your advice will fall on deaf ears.  \nI tried telling a couple of people to lower their voice when they were loudly cracking jokes n stuff and they told me to sit elsewhere lmao"
    },
    {
      "id": "mhdpls1",
      "body": "That’s exactly my situation daily too. It is minimum sense that a library is meant to be quiet and it shouldn’t be like a park.\n\nAssume they didn’t know that a library is meant to be quiet. That’s fine. But despite asking them to calm down and talk softly, they don’t care .\n\nBoss, atleast after someone requests you to talk softer, listen to them. We’re all grown ups. Let’s not behave like 10 year old kids who can’t understand if someone says it once"
    },
    {
      "id": "mhdrx8a",
      "body": "I've seen couples cuddling and makeing out in the library. What happened to shame"
    },
    {
      "id": "mhdt74s",
      "body": "Let's leave that to them.\n\nMy request was only one thing.. Do whatever you want. Cuddle romance dance swim cry  \nBUT JUST DONT DISTURB OTHERS WHILE YOURE DOING THAT"
    },
    {
      "id": "mhdtl5v",
      "body": "Man public decency should also be there"
    },
    {
      "id": "mhduaw3",
      "body": "Man i'm talking about public decency in general which many seem to lack. I've seen people stretching their legs while putting their feet on chairs in places like libraries and canteens. I told one guy not to do it and he just snickered."
    },
    {
      "id": "mheidot",
      "body": "There is a lack of angry library grandma thts why these people yap at the top of their lungs"
    },
    {
      "id": "mhj0elz",
      "body": "Don't even get me started on the silent reflection room\nWith the whole point of it being SILENT going over people's heads"
    },
    {
      "id": "mhj7wqu",
      "body": "Comparitively, silent reflections is much better\n\nIn silent reflections, the security comes in once in a while and asks people to shut up. But in GJBC, there's no one to do that.\n\nBut why should someone come and ask you to be quiet? It is common sense that a library is meant to be silent"
    },
    {
      "id": "mhj8mfa",
      "body": "Recently that is but still people lack civics sense frfr"
    },
    {
      "id": "mhk4vux",
      "body": "Couples in silent reflections are my biggest opps, like get a room bro💀"
    },
    {
      "id": "mhkqzxs",
      "body": "Isn't this common sense?"
    },
    {
      "id": "mhkyd7u",
      "body": "As the saying goes… common sense is not common"
    }
  ]
}