{
  "id": "1jbvatx",
  "title": "shuffle",
  "content": "why TF does pes shuffle so much.  \nas soon as i thought i was confortable in 1 sem they shuffled in second sem.  \nand ik theyre gonna shuffle again in 3rd sem.",
  "metadata": {
    "author": "RevenueOk3294",
    "url": "https://www.reddit.com/r/PESU/comments/1jbvatx/shuffle/",
    "permalink": "/r/PESU/comments/1jbvatx/shuffle/",
    "score": 27,
    "created_utc": 1742045919,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mhx3o6j",
      "body": "Yeah lol I think other colleges like BMS put you in your respective sections with people of same branch and it stays the same for 4 years"
    },
    {
      "id": "mhx8njx",
      "body": "What are u even talking about? For 4 yrs majority of my friends name started with the same fucking letter.\n\nMaybe it's changed now for u guys"
    },
    {
      "id": "mhx8uja",
      "body": "Yeah bro, especially for cet 3rd round students, we just settled in, made friend groups, and boom they shuffled us and put us into classrooms with pessat and 1st round cet students in which they already have their own friend groups, now I just feel like a stranger in the class "
    },
    {
      "id": "mhxbop5",
      "body": "For us 2nd and 2nd ext round students we joined late \nSo we were put into seperate classes with people of all alphabets and now we're in alphabetical order for 2nd sem\nAnd they're saying we'll be SRN wise 3rd sem so itl change again."
    },
    {
      "id": "mhxbrcq",
      "body": "Same bro fu kkkkk😭"
    },
    {
      "id": "mhxcqcu",
      "body": "If its properly in srn sequence then you will be back with your 1st sem friends"
    },
    {
      "id": "mhxjr1s",
      "body": "Srn is usually alphabetical so ig it will be same but minus your other branch major ppl. since no more common subjects 3rd sem onwards"
    },
    {
      "id": "mhxkjg3",
      "body": "The thing is most of them are in other branches 😭"
    },
    {
      "id": "mhy6vbp",
      "body": "So true"
    },
    {
      "id": "mi1p5aw",
      "body": "But then the CET students SRN are not alphabetically matching with pessat students"
    },
    {
      "id": "mi7hpvs",
      "body": "No baddies "
    }
  ]
}