{
  "id": "1jc9brs",
  "title": "In Parallax's defence.....",
  "content": "Hey so i saw a post about someone ranting about the deltatime game development hackathon conducted by parallax, and i got a few things to say\n\nTo say things like \"dont attend events by this club\" and cite reasons like the food being bad is just an admission that you dont realise how little of control clubs have over their budgets.\n\nCollege Clubs, for the most part, dont get a say in how much money they spend in their club, how that money gets spent and in some cases they dont even get to pick which companies they are allowed to take sponsorships from.\n\nI'm not saying deltatime was good or fun, im saying that singling out the club is not only unfair to the parallax team, who, again, had nothing to do with most of the issues you stated, but it diverts attention from the real culprit, which is fucking ceaseless cut-throat budget cuts all the clubs are facing and the bullshit policies the college has with respect to stalls and sponsorships.\n\nIn my opinion, parallax is an amazing niche club and a lot of people that I've met in that club were really talented and had a genuine interest in their field, something that i cant say for a lot of clubs unfortunately.\n\ngiven rhe circumstances that the college leaves its clubs in, its a fucking miracle that a club is able to pull of any sort of event at all, and the fact that deltatime was able to happen without the college damn well burning down, is something i think the parallax team should be commended for.\n\nIm not saying dont bitch about events, i agree that the quality of events at pes is headed nothing but down, im just saying that the club's arent really to blame for it",
  "metadata": {
    "author": "pesu-hater",
    "url": "https://www.reddit.com/r/PESU/comments/1jc9brs/in_parallaxs_defence/",
    "permalink": "/r/PESU/comments/1jc9brs/in_parallaxs_defence/",
    "score": 34,
    "created_utc": 1742084961,
    "flair": "Club Post :upvote:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mi10lb7",
      "body": "They took 250 per person. Which is on the higher end for hackathons in pes. \n\nThey gave one dinner and one breakfast. both pesu foodcourt and nothing additional at all. Let's say 100, 60. So we have 90 left. \n\nThey gave us one keychain which nobody below 10 would ever use. Probably 5-10 rupees from chikpet. And three club stickers. Let's just be kind and say 20 rupees for them both. If they spent more, they're either overspending or lying about the costs. 70 left.\n\nAnd one midnight snack which nobody knows was. It's like a vegpuff from temu. Let's be wildly generous and take away another 20 for it. \n\nAnd one glow stick probably 10. \n\n40 left. \n\nThat's all. That's all we get for the 250 that was charged. \n\nAnd they have the audacity to put up a little stall on the outside and keep reminding you to buy chips and room temperature drinks from them. \n\nThey're on the high end for entry fee, and on the extreme low in terms of what they actually delivered. You can't even add up what they gave to make it reach the entry fee. \n\nDid the college give them them literally nothing to spend other than the 250 per person? Or did they charge the club for the room and electricity? Is that where the extra 40 rupees went?\n\nHow likely is it that they skimmed some money by screwing with the bills."
    },
    {
      "id": "mi1239w",
      "body": "Well idk if you have ever organised any of these events, but getting permissions from the management especially in EC campus is really hard. I have personally seen the head struggling for weeks to get approval. \n\nBesides, the 250rs is for vakula, the club has little to no hand in it. If you’re expecting cheaper food then you can go find an Indira canteen. \n\nThe college cross checks every single bill, they don’t handout freebies just like that so pocketing money is out of question. \n\nI understand there may have been issues with the conduct of the event, but this is not a way to put it. Don’t have to be rude, they’re also college students in third year juggling their assignments, isas, placements and trying to hold an event for you juniors. High time y’all actually start respecting the work they put in instead of going all out on the members.\n\nI felt the keychains were pretty nice. Blaming the club for the college’s food and rules is uncalled for. You don’t have to attend if you don’t want to, you knew the registration was gonna be 250"
    },
    {
      "id": "mi13sk4",
      "body": "\"the college cross checks every bill\"\n\nSo no club in the history of the college has ever skimmed even a rupee? In reality a lot of them do, so this doesn't really mean anything. \n\nOnto the food, all other hackathons do it better. And many of them don't charge 250. It was 2 meals. \n\nAnd putting up a stall is just disrespectful. Most other overnight hackathons give you chips and stuff. \n\nAnd how many of the participants do you see actually using the keychain? There's your answer."
    },
    {
      "id": "mi1431l",
      "body": "Finally some much needed subreddit drama since the bed throwing incident"
    },
    {
      "id": "mi16g74",
      "body": "For the sake of my sanity I will not get into another kalesh right during my exam week. Please go ahead and fight it out, this is just the entertainment I need\n\n![gif](giphy|uWzS6ZLs0AaVOJlgRd|downsized)"
    },
    {
      "id": "mi18p3z",
      "body": "Can you prove that parallax pocketed money?\n\nIf you can prove it well double the said money and give it to you.\n\nAnd you’re getting 2 meals for 250 how much more do u expect, try buying 2 meals in that much elsewhere\n\nAnd stalls were for you guys, most of the times when hacks are held in mrd there’s no food allowed inside. The organisers were kind enough to let stalls be setup and actually get permissions for it to be setup, I don’t get why you’re complaining. You don’t wanna buy no one is compelling you to.\n\nDo you expect the club to hand out MacBook pros to everyone? I’ve seen so many people love the keychain, you don’t want it return it or throw it the trash why cause so much drama"
    },
    {
      "id": "mi1a65c",
      "body": "you missed the point, again, clubs dont really have much control over their budget\n\nif your issue was that the mentors were rude or that the event was somehow rigged, then sure, an argument can be made that the club had a hand in that\n\nbut again, the amount of money the college forks up for an event is basically a gamble every time, parallax just happened to roll a seven at an unfortunate time and i think its unfair to say that they're a bad club for it"
    },
    {
      "id": "mi1b2l9",
      "body": "We'll obviously i can't prove it, but the numbers don't lie. Many other hackathons provide much more for much less. This one is a huge exception. Did you not get a single rupee from the college? \n\nI expect the food to cost less. 250 for two hostel mess type meals is a scam and you know it. \n\nAnd like i said, there would be no need for the \"stall\" I'd you actually spent some of the money on giving people food. Other 24 hour hackathons regularly give out some food. Yours did not. You insisted we \"grab\" some chips while you grab our money. \n\nAnd the keychain was crap don't lie to yourself. It was probably your friends who told you they liked it. Please try and ask them where it is 2 weeks later. Like i said, nobody would've wanted it and you're disconnected from reality. \n\nAll I'm saying is that almost every other hackathon gives more for less. Where did all the money go?"
    },
    {
      "id": "mi1byq4",
      "body": "We gave them 250. And the college gave them x.\n\nRegardless of what that x is, I'm saying it's shit because we didn't even get 250's worth. \n\nEvery single hackathon in the college gives you more than what the entry fee was. \n\nSo unless parallax had to pay the college and x was a negative number, it's a shady club"
    },
    {
      "id": "mi1cjgh",
      "body": "What exams you writing unc"
    },
    {
      "id": "mi1i01l",
      "body": "You can easily get for less in PES Food Court for tech events"
    },
    {
      "id": "mi1lrdy",
      "body": "Midterms"
    },
    {
      "id": "mi1uyga",
      "body": "Food was 160 per plate btw from food court"
    },
    {
      "id": "mi1z77b",
      "body": "I don't know what happened in the hackathon, nor the food quality, so not going o comment on those. What I can tell you is putting up stalls is standard practice regardless of how the food is. As a person who was in the organizing team in many hackathons at PES EC Campus, I can assure you that it had nothing to do with the food quality being bad."
    },
    {
      "id": "mi2ero6",
      "body": "midterms is crazy and also why do MS unis even ask for midterms, shouldnt they just consider it based on, in your case, RnD and projects and stuff???\n\nanyways good luck soldier"
    },
    {
      "id": "mi34tex",
      "body": "Depends on the course. Most midterms here aren't \"exams\" but large deliverables you need to meet and are meant as progress checks on your ongoing research for that course, but yes, some courses do have traditional exams and I have one such course this semester. \n\nAnd thank you :)"
    },
    {
      "id": "mi3rh0u",
      "body": "ohhhh enjoy"
    },
    {
      "id": "mi705kg",
      "body": "Why are you scrolling through reddit during your exam week"
    }
  ]
}