{
  "id": "1jghvpm",
  "title": "Got cooked",
  "content": "If you think of mass bunk in maths Swetha ma'am class, think 100x before you do....",
  "metadata": {
    "author": "beastmaxop",
    "url": "https://www.reddit.com/gallery/1jghvpm",
    "permalink": "/r/PESU/comments/1jghvpm/got_cooked/",
    "score": 90,
    "created_utc": 1742566687,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "miz82g6",
      "body": "Which course is this lmao"
    },
    {
      "id": "miz9q5e",
      "body": "Fuck around and find out"
    },
    {
      "id": "miz9sdh",
      "body": "Btech 1st yr, we had maths, physics cycle..."
    },
    {
      "id": "miza2kr",
      "body": "Wt??"
    },
    {
      "id": "mizaft3",
      "body": "Bro we mass bunked twice and they gave attendance.. wtf is up with first year staff"
    },
    {
      "id": "mizbc6p",
      "body": "During Covid, they decided to hold our second sem ISA online and the entire batch(700+ students) had made a telegram group to copy which eventually got caught by the teachers, the ISA was made null and we had an ISA will full syllabus"
    },
    {
      "id": "mize45a",
      "body": "It's not even the end of semester why would u guys mass bunk now🫠"
    },
    {
      "id": "mizewl3",
      "body": "Lmao this is pure RETARDED.\n\nAs long as you have 75% + attendance at end of the semester, they shouldn't care.\n\n  \nNo scholarships thing is mostly a bluff."
    },
    {
      "id": "mizfbzj",
      "body": "Profs being dicks. Nothing new.\n\nEgo gets hurt when nobody wants to hear their stupid lectures."
    },
    {
      "id": "mizg0ue",
      "body": "lmao i absolutely love seeing a professor’s ego get hurt so bad. i really don’t see why there’s a problem, there was nothing illegal or against the rules. people bunked? mark them absent and move on man"
    },
    {
      "id": "mizg1vj",
      "body": "Legendary 🙏🙏"
    },
    {
      "id": "miziesg",
      "body": "mental break"
    },
    {
      "id": "mizjfdp",
      "body": "These faculty think that if students attend classes they will get good placement and stuff, that’s absolutely bs. VC VC VC that’s all the power they have. They can’t make proper time tables and then deny to change them."
    },
    {
      "id": "mizmflz",
      "body": "Damn bros fk*d 💀 \nwe Did a Mass Bunk in BMS on Holi no Teacher cared the Next week !"
    },
    {
      "id": "mizo4sw",
      "body": "My mech statics prof was chill like this ppl used to bunk his class all the time, he gave full attendance to everyone as long as at least half the class showed up. \nHe understood that his subject was easy enough and kinda boring."
    },
    {
      "id": "mizr2mb",
      "body": "OP I'd suggest blurring out the names and phone numbers before posting something to reddit to avoid doxxing others and yourself as well"
    },
    {
      "id": "mizrtsp",
      "body": "Oh ya, didn't see that, thanks, will do, if any** in future...."
    },
    {
      "id": "mizsg24",
      "body": "do it now. those arent your phone numbers"
    },
    {
      "id": "mizsj3i",
      "body": "delete it and if you want to you can repost"
    },
    {
      "id": "mizss6w",
      "body": "now u guys should mass not listen to whatever bullshit this person is spouting, insecurity is radiating from this I can smell it through my screen"
    },
    {
      "id": "mizt9uy",
      "body": "Bro, she's still the same🤣\n\nBack in 2020 when we pulled shit like this, she told everyone \"if you wanted to bunk, you could've asked me. I would've given attendance to everyone... Now go apologize your HOD\". She's still the same person😂"
    },
    {
      "id": "mizvz37",
      "body": "What's the 11 in P11"
    },
    {
      "id": "mizwji5",
      "body": "11th section of physics cycle classes"
    },
    {
      "id": "mizy26e",
      "body": "That lady in particular is a huge dick and I'm pretty sure these are just scare tactics because this college is nowhere near organised to actually do this stuff lmao"
    },
    {
      "id": "mizz8hq",
      "body": "And then there's a goated faculty who indirectly tells you to mass bunk."
    },
    {
      "id": "mj039ob",
      "body": "Ego hurt profs💀"
    },
    {
      "id": "mj03yj0",
      "body": "When you're so good at teaching you have to hold students at gunpoint to listen to you"
    },
    {
      "id": "mj04co9",
      "body": "What a butthurt piece of shit. \n\nWhy can't they just sit back and take a holiday"
    },
    {
      "id": "mj059pg",
      "body": "vinay?"
    },
    {
      "id": "mj068xp",
      "body": "bro scolded us for not having the strength for doing a mass bunk💀"
    },
    {
      "id": "mj3vqw1",
      "body": "Yes indeed \nBro is the goat"
    }
  ]
}