{
  "id": "1jjj4pt",
  "title": "How to apply for summer courses in pes university?",
  "content": "I wanted to apply for summer courses. How and when to apply?",
  "metadata": {
    "author": "Ok-Jury-519",
    "url": "https://www.reddit.com/r/PESU/comments/1jjj4pt/how_to_apply_for_summer_courses_in_pes_university/",
    "permalink": "/r/PESU/comments/1jjj4pt/how_to_apply_for_summer_courses_in_pes_university/",
    "score": 5,
    "created_utc": 1742908649,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mjnhfto",
      "body": "They usually release this information at the end of the semester. You'll get a list of courses along with details on how to enroll and pay."
    },
    {
      "id": "mjnkx3c",
      "body": "Do they reward credits on completion of these courses?"
    },
    {
      "id": "mjnqjqn",
      "body": "+1"
    },
    {
      "id": "mjnr34x",
      "body": "Yup. Each course is 2 credits. You can take up at most 2 courses each summer."
    },
    {
      "id": "mjnsto7",
      "body": "Thank u for help 💓.  What is the duration of each of these courses?"
    },
    {
      "id": "mjnuftp",
      "body": "I think 2 weeks? Don't quote me on this though cause I'm not sure."
    },
    {
      "id": "mjskbnb",
      "body": "why do we have to pay for literally everything? Doesnt the college take enough money?"
    },
    {
      "id": "mjtomjg",
      "body": "Because you pay for 160 credits worth of coursework. These are extra."
    },
    {
      "id": "mjtrasv",
      "body": "Generally its a max of 1 or 2 weeks, yes"
    },
    {
      "id": "mju8kco",
      "body": "Will they add these credits to my actual gpa?"
    },
    {
      "id": "mjubs5u",
      "body": "Yes. Why else would they offer courses xD"
    },
    {
      "id": "mjuesrf",
      "body": "Valid but will it get added to my main course gpa or will it be separate?I have no clue I'm in first year:/"
    },
    {
      "id": "mjuqqly",
      "body": "oh, i didnt know that. Would these credits help tho? like assumjng worst case scenario i get a backlog in a subject but i have credits from these courses. Will they let me graduate?"
    },
    {
      "id": "mjvb5kr",
      "body": "It'll get added to your Major GPA"
    },
    {
      "id": "mjvl8ml",
      "body": "Doesn't work like that unfortunately. All courses you take up during your BTech are mandatory courses, which means you must pass in all of them to get your degree. To meet the credit requirement for your degree (160 credits), you also need to take up a certain number of special topic courses. These are offered during the semester from 2nd year onwards, the summer breaks and your 7th and 8th semesters. At the end of 8 semesters, unless you take up the required number of special topics (which btw you need to actively do on your own since PES does not auto enroll you into any), you won't be eligible to graduate. \n\nThese summer courses are effectively special topics. They don't replace any other mandatory course. Taking them up early simply reduces the number you need to take up later, freeing you up in your final year to focus on placements/higher education applications."
    }
  ]
}