{
  "id": "1jqa1io",
  "title": "Help",
  "content": "I’ll be shifting from EC Campus to RR Campus for 2nd year and was wondering if any seniors have done the same. Were you able to make friends after the move? Since most people will already have their groups from the first year, I’m a bit worried about feeling lonely. Any advice or experiences would be really helpful",
  "metadata": {
    "author": "serein04",
    "url": "https://www.reddit.com/r/PESU/comments/1jqa1io/help/",
    "permalink": "/r/PESU/comments/1jqa1io/help/",
    "score": 8,
    "created_utc": 1743657170,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ml5leiu",
      "body": "We can shift campus???"
    },
    {
      "id": "ml5lxao",
      "body": "Check FAQs for switching campuses after the first year. TLDR, you need a good CGPA and it's only possible if there are empty seats"
    },
    {
      "id": "ml5nob4",
      "body": "Damn how are you so confident"
    },
    {
      "id": "ml5yrno",
      "body": "Changing to ece"
    },
    {
      "id": "ml6aak9",
      "body": "I'm in the same boat, I do wanna change campuses but I'm worried if I'll be able to make new friends there"
    },
    {
      "id": "ml6vkjs",
      "body": "I shifted from EC Campus CSE to RR Campus AIML in August 2023.\nI made friends right away because I'm a little bit of an extrovert 😁 but even otherwise you can definitely find your group if you put yourself out there (attend events, participate, volunteer, network)\n\nWorst case scenario, you can hang out with other people who also changed campus like you."
    },
    {
      "id": "ml75vo4",
      "body": "I mean ece cutoff are rly low it was 8 last year."
    },
    {
      "id": "mleaqvw",
      "body": "no, we in rr campus keep our eyes and ears out for ec campus students that have switched campuses, the moment we find such imposters, we eat them alive to ensure that no ec campus student ever manages to make friends here"
    },
    {
      "id": "mlhxkvj",
      "body": "Yes , it takes time but u can make friends"
    },
    {
      "id": "mlpsyta",
      "body": "i have some hope now 😭🙏, what was your cgpa if you don't mind answering? and the cutoff if you know?"
    }
  ]
}