{
  "id": "1jqed4i",
  "title": "What can you as a student from PES , tell to someone from local engineering college with no tier something just like a advice???",
  "content": "",
  "metadata": {
    "author": "Sufficient_Sir3953",
    "url": "https://www.reddit.com/r/PESU/comments/1jqed4i/what_can_you_as_a_student_from_pes_tell_to/",
    "permalink": "/r/PESU/comments/1jqed4i/what_can_you_as_a_student_from_pes_tell_to/",
    "score": 7,
    "created_utc": 1743674200,
    "flair": "ANNOUNCEMENT :snoo:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ml6cfhc",
      "body": "Bro from a no tier clg needs an advice from another no tier clg wtf"
    },
    {
      "id": "ml6ct2l",
      "body": "bro i just asked  an advice from someone who is a great college for a person who has ended up in a bad one"
    },
    {
      "id": "ml6cudj",
      "body": "Exactly! bro thinks it’s IIT Bangalore.."
    },
    {
      "id": "ml6em6d",
      "body": "Blud 😭😭"
    },
    {
      "id": "ml6fbmc",
      "body": "but u get great placements package right?? then how is it not great"
    },
    {
      "id": "ml6fxll",
      "body": "See brother there's no such thing as good or bad colleges. Comparison is the thief of joy. Every college will have some pros and cons. There's no point sitting and regretting choices. Wherever your friend is they'll do good don't worry."
    },
    {
      "id": "ml6g8hq",
      "body": "great college 🤣🤣🤣🤣🤣🤣🤣🤣🤣"
    },
    {
      "id": "ml6hp1t",
      "body": "Thanku so much this is the only legit helping comment thanks for being kind i know that eevry college whether its pes rv or any bad college all are same but dont you agree pes offers great packages placements so am just worried of ending up jobless because i am from worst college"
    },
    {
      "id": "ml6i1hf",
      "body": "The market situation is worse rn. Jobs have shrunk but not completely diminished. So can't guarantee the best placements for now. Your skill set will only guarantee you a job."
    },
    {
      "id": "ml6inqr",
      "body": "thanku sm bro now i feel somthing confident about myself thanks a lot"
    },
    {
      "id": "ml6koxo",
      "body": "See there's no end to it . People in pes will tell the same by comparing themselves to bits or nits or iits just like how u r doing by comparing your clg with pes\nSo it's better to work on yourself . I'll quote the famous lines again i.e \" your clg decides the intercept you decide the your slope\""
    },
    {
      "id": "ml6rvi9",
      "body": "See placements thing is subjective, the market isn’t good and even the hiring scenario for our batch seems pretty daunting and on top of that the intake is a huge problem in pes, compared to other top clgs in blr our intake is twice particularly in CSE and a slight better placements than them doesn’t suffice this intake and man the amount of shitty profs this uni has is really a concerning thing but coming to the advice I think it depends on the person than the clg itself"
    },
    {
      "id": "ml6w1sx",
      "body": "thanku soooo  much bro so i can hope to land a job if i work hard inspite being ina  shitty clg?"
    },
    {
      "id": "ml6wbcm",
      "body": "thanku so much n the line motivated me thanku soooooo much so i can hope to land a job inspite being ina shitty clg if i work hard?"
    },
    {
      "id": "mlboipm",
      "body": "You don't need anyone's assurance buddy. \nJust work upon yourself that's it."
    },
    {
      "id": "mlbour1",
      "body": "Obviously brother , hard work pays off despite all odds"
    }
  ]
}