{
  "id": "1jqj96c",
  "title": "Nobody teaches you how to choose a job — just how to get one. Can we talk about what really matters?",
  "content": "Hey folks, at my workplace, Sustainable Living Lab (SL2), we are working on an initiative we’re exploring to improve career discovery for students — especially final-year engineering students who are preparing to take their first step into the job market. \n\n\n\nMost students are expected to make career decisions based on titles, CTC, or what seniors say — but very few get a real sense of what a job actually feels like: the team dynamics, work culture, pressure, or even what tasks they’ll handle on a daily basis. \n\n\n\nAt SL2, we’re exploring how to make career discovery more inclusive, realistic, and aligned with students’ actual strengths — especially for those who may not have access to mentorship, exposure, or insider guidance. \n\n\n\nThis isn’t a student-led project, but it’s 100% for students — and before building anything, we’re focused on listening first. \n\nIf you’re in your final year or recently graduated, we’d love to hear from you. To make it easy, we’ve put together a quick, anonymous survey (just 2 minutes): [https://forms.gle/D5wmWzfMTJHbf6ki6](https://forms.gle/D5wmWzfMTJHbf6ki6) \n\nNo product. No pitch. Just trying to get this right — with real input from students. \n\nThanks in advance for sharing your perspective",
  "metadata": {
    "author": "Jeevanpy2000",
    "url": "https://www.reddit.com/r/PESU/comments/1jqj96c/nobody_teaches_you_how_to_choose_a_job_just_how/",
    "permalink": "/r/PESU/comments/1jqj96c/nobody_teaches_you_how_to_choose_a_job_just_how/",
    "score": 13,
    "created_utc": 1743688945,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ml7rnfz",
      "body": "first year here, would be very interested to see the results of your survey/analysis!"
    },
    {
      "id": "mlgrws1",
      "body": "Interesting!"
    }
  ]
}