{
  "id": "1jsahu8",
  "title": "Wtf was that frisking?",
  "content": "How are people okay with the way frisking happened in AT? The volunteers literally touched every single part and yes i mean every single part and asked us to do weird shit like spread your legs like wtf. This isn't even done for ESAs. Bro conveniently asked \"Do I have your consent\" after frisking everywhere, and i didn't even consent to that shit. It was extremely uncomfortable.",
  "metadata": {
    "author": "ihatepesu",
    "url": "https://www.reddit.com/r/PESU/comments/1jsahu8/wtf_was_that_frisking/",
    "permalink": "/r/PESU/comments/1jsahu8/wtf_was_that_frisking/",
    "score": 40,
    "created_utc": 1743878772,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mlky0m4",
      "body": "Seeing all these AT posts I’m so glad I didn’t waste my time going"
    },
    {
      "id": "mlkzftd",
      "body": "AT Volunteers breathes**\n10 posts on reddit \n👾Too many issues regarding volunteers I think u guys should definitely report it to Dean of students at this point to ensure next year they implement some strict rules during recruitment of volunteers"
    },
    {
      "id": "mll1ada",
      "body": ">spread your legs\n\n😳"
    },
    {
      "id": "mll5lvo",
      "body": "They checked me for 2-3min atleast like bro u ain't finding shit even if you tickle my balls cuz I don't have anything"
    },
    {
      "id": "mll9m57",
      "body": "Some volunteer opened my wallet, took all the money out, asked me if I have condoms in my wallet(why would I bring that to a concert my brother in Christ), basically removed all the cards and checked, but didn't put anything back into my wallet and free handed me my shit back, like bro i get it u gotta frisk and all, but c'mon man tf"
    },
    {
      "id": "mln1gn6",
      "body": "Same here, thank god I didn't go just to get blueballed multiple times"
    },
    {
      "id": "mlnbvv4",
      "body": "Glad that I didnt come to AT this year"
    }
  ]
}