{
  "id": "1jsb2yk",
  "title": "Pro nite??",
  "content": "Dawg bought vip tickets thinking I wouldn’t have to deal w the crowd. My fault. I genuinely think people there had no civic sense lol we’re all students, they had no sense of spatial awareness whatsoever. I get it, I’m not that salty to not understand that it’s expected in such audience. But I got elbowed in my chest 7 times because THEY FORMED A CIRCLE AND DANCED?? Bro it’s Mohit Chauhan you don’t have to do allat😭 everyone’s sweaty and swamped up here be considerate? I don’t think I caused anyone any inconvenience it’s really not that hard lol have fun and let others have fun too. Ts pmo icl.",
  "metadata": {
    "author": "calm_raccoon04",
    "url": "https://www.reddit.com/r/PESU/comments/1jsb2yk/pro_nite/",
    "permalink": "/r/PESU/comments/1jsb2yk/pro_nite/",
    "score": 55,
    "created_utc": 1743880285,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mll2qcu",
      "body": "What do you expect from concerts lol? There's gonna be chaos even if you spend a grand on your tickets. Hence the reason I don't like the idea of concerts."
    },
    {
      "id": "mll30lp",
      "body": "Fair tbh I js wished they were lil considerate:)"
    },
    {
      "id": "mll38e9",
      "body": "Can't expect that from everyone tho :). At the end you enjoyed the concert, all that matters."
    },
    {
      "id": "mlnv5vk",
      "body": "Exactly! And the moment you say you don’t like concerts, they hit you with the “oh wow, became cool? being different from the rest of the crowd” Like bro, since when did having personal preferences become a fashion statement? 😂 Some people really need a hobby fr."
    },
    {
      "id": "mlnvceq",
      "body": "well i don't give two fucks about such people. In fact i love getting downvoted because that shows the number of butthurt people lmao."
    },
    {
      "id": "mlnxuk4",
      "body": "The dancing in a circle was definitely me lol. Sorry for the trouble caused vro i will sybau next time fr 💯"
    },
    {
      "id": "mlo4u4c",
      "body": "Fuck off bruh\nThis is PES"
    },
    {
      "id": "mlo4z6r",
      "body": "If you’d apologised there I wouldn’t have had no issues it’s alr glad yall had fun:)"
    },
    {
      "id": "mlo52qr",
      "body": "Good observation ig?"
    },
    {
      "id": "mloh5ly",
      "body": "What do you expect when a huge number of general guys jump over the gates into vip. Literally watched people just walk in."
    }
  ]
}