{
  "id": "1jsl7gx",
  "title": "Pro nite :/",
  "content": "I'm sorry for another pro nite rant, but last night’s experience was horrible.\n\nWe had vip tickets and had been in line since 3. Once we reached the venue at around 5:30, we managed to get to the 4th/5th row and secured just enough space to stand comfortably.\n\nWhile the Kannada comedian was performing, the people in front of us suddenly started calling their friends from back, adding six more people into an already packed crowd. They also planned on calling 2 more people. When we told them theres no space they argued with us and started yelling at us. They were all fourth years, asking us what year we were in, like it somehow justified their behavior.\n\nAfter a while we just gave up trying to reason with them. Like alright bro you came in front of us, whatever, but omg stop manspreading everywhere, not just this, they literally formed a circle and started dancing like they owned the place. My friends could barely move and were standing in a very awkward position the entire time. Their asses were practically in our faces. When we asked them multiple times to make some space, they snapped, “Why do you always have a problem?”, Bro you are the problem????????\n\nBy this time, we’d been pushed back quite a bit. One of the girls in front kept stepping on our feet on purpose because even after telling her, she refused to move. I get it, it's a concert, things happen. But when I told her for the third time that she was literally standing on my feet, she had the audacity to say i needed to move? Like, bro, you are standing on my feet. Where exactly am I supposed to go?\n\nShe also hit my face by accident and didn’t even bother to apologise. And to top it all off, they kept taking up more and more space and even said something like, “We’ll see who’s stronger,” which i found so utterly disgusting. They then had the nerve to tell us to act like adults.\n\nThey were so entitled and a complete bunch of bullies, and they completely ruined the concert for us. They then offered to let us go front towards the end of the concert like that will magically solve all the disrespect we had been through.",
  "metadata": {
    "author": "anonughhhhhh",
    "url": "https://www.reddit.com/r/PESU/comments/1jsl7gx/pro_nite/",
    "permalink": "/r/PESU/comments/1jsl7gx/pro_nite/",
    "score": 23,
    "created_utc": 1743910792,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mlnao09",
      "body": "See this may sound a bit werid , but if ppl are not taking ur words seriously just start bullying them back , lol when the ppl behind us didnt stop falling on our back , our group just made a circle and made life uncomfortable for them"
    },
    {
      "id": "mlnc4pb",
      "body": "We did try, but our group was comparatively smaller to even have an impact on them."
    },
    {
      "id": "mlncc3g",
      "body": "https://preview.redd.it/dclurop015te1.jpeg?width=828&format=pjpg&auto=webp&s=f73fc043cb324c15de77d1db02bd42f912c641ca\n\nNext time try to  sneak in this \"/s\""
    },
    {
      "id": "mlnl3la",
      "body": "You're in a concert"
    }
  ]
}