{
  "id": "1jvb2tk",
  "title": "I am in 4th semester and kind of clueless",
  "content": "Hi seniors,\n\nI was a silent scroller on this sub and only decided to make an account today to ask a question to the seniors. \n\nI am currently in 4th Sem, and I honestly don't have a good cgpa (its in the high 7's) and some of my friends have already secured an internship in some top companies even though they have a similar cgpa to mine. Most have gotten through referrals but some smart ones with high cgpa have secured on their own. \n\nThis is honestly taken a toll on me and made me a bit depressed, will I ever be able to maintain a good cgpa or get an internship or placement ever. And honestly, I feel I am late to many of the things, like I should have been ready with good projects by the end of first year and I should have started Leet code by now. But I have done none of that and my end semester exams are in a month.\n\nI am very clueless and don't know what to do. Coding used to be my passion back in school and 11th and 12th but now a days I am finding it very reluctant to code. Even while watching a movie or playing a game, I feel very bad that I am wasting my time not studying. Last semester even though I slogged (about 6hrs I studied every day during my esas) I managed to get a sgpa only in high 7's. \n\nHave any of you have gone through this phase and how do I make myself better? Seeing others in a relationship, them getting internships, watching their lives get better every day, etc. is slowing killing me inside, not that I hate them but the fact that I hate myself for not doing anything to make my life better. \n\nAny advice or any path or roadmap I should follow, please please please I beg you can you help me with it? \n\nPS I am not suicidal or anything, I am just lost and do not know what to do.",
  "metadata": {
    "author": "EffectiveRelation928",
    "url": "https://www.reddit.com/r/PESU/comments/1jvb2tk/i_am_in_4th_semester_and_kind_of_clueless/",
    "permalink": "/r/PESU/comments/1jvb2tk/i_am_in_4th_semester_and_kind_of_clueless/",
    "score": 41,
    "created_utc": 1744218670,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mm8tojz",
      "body": "How did your friends already secure internships in top companies? Offcampus? Cuz only JP Morgan has come for 4th sem students till now I think"
    },
    {
      "id": "mm8u2rd",
      "body": "Hi sorry, I forgot to mention I included some of my friends from other colleges as well (IIT, BITS and RV they're from) and also my classmates who got it from referrals from their parents or people who they know."
    },
    {
      "id": "mm8vzsf",
      "body": "oh okay gotcha   \nThat's still pretty cool tho for them"
    },
    {
      "id": "mm8z8op",
      "body": "I feel exactly like u but i am gonna write kcet to get college lol"
    },
    {
      "id": "mm961fd",
      "body": "If you're taking it this hard in the 4th semester, you're gonna be in a world of pain in the 6,7 and 8th semesters. Take a chill pill and upskill you've got lots of time."
    },
    {
      "id": "mmopm4d",
      "body": "Bro when did jp morgan come for rec how come I didn't get any mail about it 😭"
    },
    {
      "id": "mmou4y2",
      "body": "If you are in AIML OR CSE you should have gotten a mail 💀"
    }
  ]
}