{
  "id": "1jvwzxh",
  "title": "wrote UE24...141B instead of UE24...151B today. Does it matter? What can I do?",
  "content": "title",
  "metadata": {
    "author": "leoxplr",
    "url": "https://www.reddit.com/r/PESU/comments/1jvwzxh/wrote_ue24141b_instead_of_ue24151b_today_does_it/",
    "permalink": "/r/PESU/comments/1jvwzxh/wrote_ue24141b_instead_of_ue24151b_today_does_it/",
    "score": 13,
    "created_utc": 1744289096,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mmdorx8",
      "body": "sorry but you're isa 1 marks are not going to be considered anymore, also they might even make you withdraw from the subject altogether as they'll believe you were absent or negligent and >!im not kidding!<>!really not a joke !<>!jk/s!<"
    },
    {
      "id": "mmdp7sq",
      "body": "did you circle it or just write it?\nIf you circled it correctly then it shouldn’t be a problem."
    },
    {
      "id": "mmdpbwj",
      "body": "No I bubbled it too."
    },
    {
      "id": "mmdpgzm",
      "body": "go to coe, where they will ask you to write a letter (letter of request form)about your concern then submit"
    },
    {
      "id": "mmdpy7o",
      "body": "My friend bubbled the wrong SRN in her ISA. Her class coordinator contacted her the very next day, and she had to go to the COE office and write a letter. Her paper got corrected without any issues.\nIf your class coordinator doesn’t contact you in a couple of days, it’s better if you reach out to them yourself."
    },
    {
      "id": "mmdq3p6",
      "body": "Thanks for letting me know, I'll get this rectified tomorrow"
    },
    {
      "id": "mmdq63q",
      "body": "Ah okay thanks a lot"
    },
    {
      "id": "mmdqq1c",
      "body": "hey what if you write the wrong semester? I wrote sem 1 instead of sem 2 in one of the papers"
    },
    {
      "id": "mmdr9zy",
      "body": "not an issue"
    },
    {
      "id": "mmdudnw",
      "body": "Naahh when I was in p cycle I had bubbled the code incorrectly, and I was so much stressed abt it \nBut luckily nothing happened and it got corrected properly \nBut better keep an eye on it !"
    }
  ]
}