{
  "id": "1jx65mi",
  "title": "is pes actually good?",
  "content": "im sorry i dont mean to offend anyone\n\nbut in a karnataka level is it good?...i got 95%ile in jee mains and probably more in 2nd attempt...i might get cse in rr campus but definetly will get aiml or ece in rr campus\n\ni wanted to know if its actually good compared to rv,msrit and bms.\n\nhow is clg life,like proffesors,the environment,the academics,the friend groups...\n\nplease help",
  "metadata": {
    "author": "Opposite_Antelope804",
    "url": "https://www.reddit.com/r/PESU/comments/1jx65mi/is_pes_actually_good/",
    "permalink": "/r/PESU/comments/1jx65mi/is_pes_actually_good/",
    "score": 29,
    "created_utc": 1744421767,
    "flair": "PESSAT/Admission",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mmnzxth",
      "body": "Dm"
    },
    {
      "id": "mmo11vw",
      "body": "It's good if you study and maintain a good cgpa. PES lacks good extra curricular activities though so people say it feels like school"
    },
    {
      "id": "mmo75aw",
      "body": "Checkout FAQs , there are many pros and cons, based on which you can decide if what pes can offer whatever u need."
    },
    {
      "id": "mmobt2h",
      "body": "I would choose RVCE over PES"
    },
    {
      "id": "mmobv1v",
      "body": "Better than BMS and MSRIT for sure"
    },
    {
      "id": "mmod67t",
      "body": "yes ....it would be the case if i had the option to i got cooked in boards due to taking it lightly (78% pcm adn 77% overall).....\n\nim prepping for advance now and i need a solid backup thats why...\n\nif i know pes is always there then i can reassure my father but im asking this cuz if it is actually good.."
    },
    {
      "id": "mmokp5z",
      "body": "Choose cse in EC campus over ECE in RR..PES has the highest glory in cse placements from what I checked"
    },
    {
      "id": "mmomvfr",
      "body": "Every college has some issues and some advantages:\n\nBMS  \npros : relaxed schedule (5 hours per day for 1st year), relaxed syllabus and load, some event or fest every 2 weeks. \ncons : small campus, not so good placements \n\nPES\npros : tougher but better for you curriculum, infrastructure, good placements (compared to BMS)\ncons : the syllabus is too overwhelming, not that much fests, strict and loaded schedule \n\nRVCE (Best imo)\npros : best placements among any private college in Bengaluru, good crowd \ncons : well RVU issue is there so placements are ought to degrade, not much cons tbh"
    },
    {
      "id": "mmopskj",
      "body": "PES CSE ≈ NITK CSE provided you have a 9+ gpa. If you fall into that category or not is for you to decide."
    },
    {
      "id": "mmoue3m",
      "body": "No"
    },
    {
      "id": "mmouk69",
      "body": "ah damn okok aight"
    },
    {
      "id": "mmp89gz",
      "body": "Bro join elsewhere. This Uni is not worth the money and giving up your mental health. Teachers and management treat you like crap. \n\nThey are chugging out 1000 students in the name of course like Cse with ml/ai/cybersecurity/ paneer butter masala.\n\nMy advice is to spend max 5L on your bachelor’s degree. Invest the rest."
    },
    {
      "id": "mmph8g9",
      "body": "No"
    },
    {
      "id": "mmq4jn0",
      "body": "Fine only"
    },
    {
      "id": "mmqyq0r",
      "body": "MSRIT and PES are more or less at same level. Their less intake is a huge W. Although club wise PES for the win."
    },
    {
      "id": "mmse35d",
      "body": "What do you mean \"club wise\" , are there clubs in college we can join or participate in ??"
    },
    {
      "id": "mmum9l4",
      "body": "Ofcourse, there are plenty of clubs in all universities. But in among Kcet/Comedk colleges PES has the best tech clubs, and they frequently host hackathons.  That way you spend time with your friends every other week, and even go out somewhere after the hack."
    },
    {
      "id": "mmx7rqa",
      "body": "Thats is heavy cope ,NITK CSE is no where close to any private college"
    },
    {
      "id": "mmxqv92",
      "body": "PES CSE = LPU CSE for every any CG"
    },
    {
      "id": "mmxs7cn",
      "body": "More like PES CSE<= NIT K Mining provided you have 9.5+gpa lol"
    },
    {
      "id": "mn2bqto",
      "body": "I disagree, the placement stats are quite good, if you're in the top performers, you'll find a well paying job for sure, although the comparison with nitk is a little far fetched "
    },
    {
      "id": "mn2c9zp",
      "body": "I think rvce has the same problems, my friends over there complaint about the lack of extra-curricular activities and excessive focus on academics, although placement wise it's the best"
    },
    {
      "id": "mn78xs9",
      "body": "Do companies like gold sachman come for placements here.. what is the intake number .. how much gpa is reqirered for ppl"
    },
    {
      "id": "mnabz7e",
      "body": "Ohhh damnn i didn't knoww 😭😭\nThanks for letting me knoww\n*Noted*"
    },
    {
      "id": "n7qcmbw",
      "body": "RVCE PESU and Ramaiah have a common issue(in lack of extracurriculars)."
    }
  ]
}