{
  "id": "1jxcsbd",
  "title": "Burnout",
  "content": "I’m in 4th sem right now and I swear college just keeps getting worse. I used to be a decent student but this sem has completely killed any interest. My marks are shit, my teachers are honestly so bad, the college environment in general is soul sucking and depressing. I’ve lost all motivation to attend classes or do assignments andd projects, and Im not able to study anymore.\n\nSome of my teachers have started calling me out and scolding me for my performance dipping and for not listening in class, but i dont even seem to give a fuck anymore\n\nIs anyone else feeling like this? I'm not qt all. excited about going to 5th sem with capstone and the pressure of getting a summer internship. I don’t think I can handle it",
  "metadata": {
    "author": "Mountain-Geologist46",
    "url": "https://www.reddit.com/r/PESU/comments/1jxcsbd/burnout/",
    "permalink": "/r/PESU/comments/1jxcsbd/burnout/",
    "score": 23,
    "created_utc": 1744447099,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mmpeo08",
      "body": "If you want assistance with your assignments, essays and thesis hmu. You don't have to fail."
    },
    {
      "id": "mmpge1c",
      "body": "Chill out. U will have 2.5 months holidays after this where u can have as much fun as u wish as from 5th sem it will start getting hectic.   By 6th sem everybody ends up in the same situation.We don't even ask each other Abt our isa marks now"
    },
    {
      "id": "mmpi7o6",
      "body": "Us moment"
    },
    {
      "id": "mmpie6s",
      "body": "Suicide is an option for me at this point, sem is so fucking ass"
    },
    {
      "id": "mmpit7d",
      "body": "We're already halfway there. Just one more year and you'll be out of this dystopian shithole of a college."
    },
    {
      "id": "mmpkawe",
      "body": "There's a more shittier hole next"
    },
    {
      "id": "mmpl2oh",
      "body": "from one shithole to the next 🙏"
    },
    {
      "id": "mmpl4lq",
      "body": "Hopefully they don't have suicide prevention cages at the next one"
    }
  ]
}