{
  "id": "1jxzfej",
  "title": "Interview guidance needed for Salesforce AMTS Intern (Class of 2027) – Looking for serious preparation advice",
  "content": "I’m a 2nd-year B.Tech Computer Science student, graduating in 2027, and I’ve recently been considered for the Salesforce AMTS (Associate Member of Technical Staff) Software Engineering Intern role in Hyderabad/Bangalore.\n\nI’m reaching out here to get serious and structured advice from anyone who has gone through this interview process or is familiar with it. I would really appreciate your guidance on the following points:\n\t•\tWhat does the interview process usually involve? (Online test, technical rounds, behavioral interview, etc.)\n\t•\tWhat kind of DSA questions should I expect? If you recall any topics or examples (e.g., arrays, graphs, trees, dynamic programming, sliding window, etc.), please do share.\n\t•\tAre there questions on core CS subjects like OOP, DBMS, OS, and networking?\n\t•\tHow much weight do they give to projects or past work (even if academic)?\n\t•\tDo they ask anything related to Salesforce products, platforms, or company values? Should I go through their CRM, Trailhead, etc.?\n\t•\tWhich coding platform do they typically use for assessments (HackerRank, Codility, etc.)?\n\t•\tI have around a week to prepare — how should I best structure my time?\n\nIf anyone has recently gone through the AMTS intern process or knows what to expect, your insights would really help. I’m taking this very seriously and want to prepare as effectively as possible.\n\nThanks in advance for any help or advice!",
  "metadata": {
    "author": "Apex_06",
    "url": "https://www.reddit.com/r/PESU/comments/1jxzfej/interview_guidance_needed_for_salesforce_amts/",
    "permalink": "/r/PESU/comments/1jxzfej/interview_guidance_needed_for_salesforce_amts/",
    "score": 19,
    "created_utc": 1744517933,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mmupdp1",
      "body": "have you got selection mail?"
    },
    {
      "id": "mmuphxq",
      "body": "Not the selection mail ..just got confirmation mail and the process will be discussed further, so till then, I have time to prepare myself for the interview"
    },
    {
      "id": "mmupx1l",
      "body": "Hooray! You have officially applied for the Intern AMTS opening at Salesforce. Thank you for letting us know you’re interested in discovering new opportunities with us.\n\nGood news – your information is now in the cloud. A member of our recruiting team will personally review your application. If you’re a potential match for one of our open positions, we’ll be in touch. If we don’t have the right role for you now, don’t worry, we’ll keep your information on file for future opportunities.\n\nYou can check on the status of your application at any point by logging into our Careers Site. (\nhttps://salesforce.wd12.myworkdayjobs.com/External_Career_Site)\nClick the button in the right corner, then select “view profile.”\n\nThanks again for considering Salesforce and have a great week!\n\nThe Salesforce Recruiting Team\n\nSomething like this?"
    },
    {
      "id": "mmuqjnw",
      "body": "Yes"
    },
    {
      "id": "mmur7ae",
      "body": "yes i got the same, @seniors please guide for the same"
    },
    {
      "id": "mmusbiy",
      "body": "Sorry to burst your bubble but the confirmation mail doesn't mean much, it doesn't even guarantee an OA. So do not get ur hopes high. Salesforce is super selective and unless you are from a tier 1 college don't expect anything much."
    },
    {
      "id": "mmuskyo",
      "body": "Referrals works different right."
    },
    {
      "id": "mmusr8t",
      "body": "Might give u a slight edge but still doesn't guarantee an OA"
    },
    {
      "id": "mmwae3e",
      "body": "If that's the email you've received, it just means they've received your application. An OA isn't guaranteed."
    },
    {
      "id": "mmxwr4p",
      "body": "I applied for an Intern position in Salesforce with a referral, didn't even get an OA.."
    },
    {
      "id": "mn0vt72",
      "body": "exactly, did you received any oa mail?"
    },
    {
      "id": "mnq3kwp",
      "body": "did any get any update?"
    },
    {
      "id": "mnqw1el",
      "body": "nope"
    },
    {
      "id": "mo9gcaa",
      "body": "Did anyone get a mail yet"
    },
    {
      "id": "mo9ge6a",
      "body": "Not yet"
    }
  ]
}