{
  "id": "1jz7ec3",
  "title": "Internship",
  "content": "Is it very important to do an internship before placements or prep for placements instead??",
  "metadata": {
    "author": "Realistic_Ad_3721",
    "url": "https://www.reddit.com/r/PESU/comments/1jz7ec3/internship/",
    "permalink": "/r/PESU/comments/1jz7ec3/internship/",
    "score": 12,
    "created_utc": 1744658331,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mn6rvx9",
      "body": "An internship before 7th sem placement season is a plus point in your resume and also adds to your experience.But even if you dont have one before 7th sem. You should be fine as long as you have a good gpa and some skills."
    },
    {
      "id": "mn7mz8r",
      "body": "Whats good gpa?"
    },
    {
      "id": "mn7p9kg",
      "body": "8.75 is safe zone for all companies , 7 or 7.5+ is also good for most companies. Checkout FAQs."
    },
    {
      "id": "mn7pcmw",
      "body": "8.75 is safe? 😭😭🙏 thq bro"
    },
    {
      "id": "mn7zmb9",
      "body": "is 8.75 enough for all t1 companies?"
    },
    {
      "id": "mn82aaq",
      "body": "By that logic get 10 and you will be eligible for all companies lmfao"
    },
    {
      "id": "mn877e6",
      "body": "Many top companies ask for 9+, some companies ask 7+ or 8+ , but they shortlist based on higher cgpa . 8.75 is considered safe."
    },
    {
      "id": "mnpxj3h",
      "body": "To be real with you, internships help you learn A LOT. And plus we have like 2 month summer break utilise that time to get a 6-8 weeks internship done, it could be a startup, mnc, whatever help align your goals. Not only does it look great on your CV, it will help YOU learn so much more that the college doesn't teach you.\n\n I've been interning and working part-time since 11th grade, financially this also will benefit you greatly and you can save up now while your parents take care of your financial needs, and with the right investments, you'll have money saved up for essentials later!"
    }
  ]
}