{
  "id": "1jzpr0w",
  "title": "The overall median reached 12 LPA this year",
  "content": "Huge Wwwww..",
  "metadata": {
    "author": "Normal-Bad6621",
    "url": "https://i.redd.it/ypkyibuokzue1.png",
    "permalink": "/r/PESU/comments/1jzpr0w/the_overall_median_reached_12_lpa_this_year/",
    "score": 82,
    "created_utc": 1744717433,
    "flair": "Placements 🤑",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mn7uuxc",
      "body": "https://pes.edu/naac/doc.html?file=upload/nirf/NIRF_2025_PES_University_Engineering.pdf\n\nSource.."
    },
    {
      "id": "mn7y1xe",
      "body": "Then any idea wts the median for cse ppl?? SENIORS.....Help...."
    },
    {
      "id": "mn8fv3e",
      "body": "Ok that's absolutely insane...guess paying 25 lakhs could be worth it after all💀"
    },
    {
      "id": "mn8h8uc",
      "body": "Dude no pest will agree for pes being worth it thru pessat/mains.. considering you're from cet then yess its absolutely worth every penny"
    },
    {
      "id": "mn8i3qk",
      "body": "But why tho?I mean it seems way more worth it than other private colleges...they r giving 13lpa median in cse and this yr u r saying 12lpa is median for overall...so I could assume cse to be over 15lpa (not sure tho)..that's pretty insane\nU might say campus and infra don't match costs but if I'm being honest..coming from a middle class family all I care about is ROI..which seems to be very good"
    },
    {
      "id": "mn8ihbw",
      "body": "I mean, no way is the 5 LPA fee through mains justifiable, for outsiders it may go upto 6.5lpa including hostel"
    },
    {
      "id": "mn8qvkj",
      "body": "I think soon enough it'll be matching the rest of the engineering branches. India needs more manufacturing, infrastructure and transportation and with push coming from the center all these are soon to come into demand. And IT companies are hiring less and less freshers by the day. Once AI gets over it's hype cycle and starts to get deployed in big tech the run of the mill coders would be out of jobs. There would be no justification to 16 sections of CSE while only 10 sections everything else combined."
    },
    {
      "id": "mn8und9",
      "body": "😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂 (😭) \n*sigh*"
    },
    {
      "id": "mn8ustq",
      "body": "around 16LPA median and 18LPA average for CSE"
    },
    {
      "id": "mn8yblk",
      "body": "Agreed"
    },
    {
      "id": "mn96rkj",
      "body": "this is for batch 2023-2024 not for 2024-2025"
    },
    {
      "id": "mn97n72",
      "body": "I think the data in NIRF is a scam because in 2024, this many placements did not happen\n\nhttps://preview.redd.it/976tynyix0ve1.jpeg?width=1280&format=pjpg&auto=webp&s=3bd05a27c76a9ee6b1902a7cfbfc3941e8de9fdb\n\nDonot trust anything blindly"
    },
    {
      "id": "mna0bay",
      "body": "Adding to that, you can always get 40% of ur fees back every year by being consistent."
    },
    {
      "id": "mna0oav",
      "body": "Does PES let unplaced students from previous batch sit in the placements for current batch?"
    },
    {
      "id": "mnaf0ru",
      "body": "Yea I'd definitely try getting the scholarships...even if not on all sems atleast most of them (tho I heard scoring cg in pes is hard so it won't be very easy ig)"
    },
    {
      "id": "mnb7qa2",
      "body": "Just by being serious about the matter and putting in decent efforts, you can easily secure CNR scholarships every semester.. It's hard but not impossible"
    },
    {
      "id": "mncdcpp",
      "body": "No, Not all companies do some companies ask for previously passed-out students"
    },
    {
      "id": "mnetef1",
      "body": "Whaaat... close to 400 eligible CS students are not placed? Did all of them go for higher studies..."
    },
    {
      "id": "mneu952",
      "body": "I don't know about that"
    },
    {
      "id": "mnm39ve",
      "body": "Not to be a bummer, but I think the NIRF numbers are fudged."
    },
    {
      "id": "mnqs2je",
      "body": "why do u think that?"
    },
    {
      "id": "mnqs5q2",
      "body": "Is AI/ML's placement comparable to cs core?"
    },
    {
      "id": "mnqujxm",
      "body": "Yess ig?"
    },
    {
      "id": "mnt06sd",
      "body": "2 reasons I think so:\n\nCheck the pic by candid astronomer in another comment here. That's the actual stats. The nirf info might be true on a technicality, but actual numbers are not that great. Good, but not great.\n\nI graduated in 2024 in B.Tech (so 20-21 batch)."
    },
    {
      "id": "mnvi685",
      "body": "What about MBA? 😭😭"
    },
    {
      "id": "mnvi9xa",
      "body": "Is there anyway to get the same sort of data for their MBA department?"
    },
    {
      "id": "moy1jl1",
      "body": "is that final stats for that batch or mid way stats they display around january ?"
    },
    {
      "id": "mozru5r",
      "body": "I think that's the final stats. I remember a junior also said Jawahar was shitting on my batch for low placement stats in the academic year beginning speech he does."
    },
    {
      "id": "mr1dxos",
      "body": "It highly depends on your cg, it's so hard to get placed if u have a gpa less than 8"
    },
    {
      "id": "mr1zxyd",
      "body": "not even a 3lpa package?"
    },
    {
      "id": "mr2096x",
      "body": "3lpa toh sbka miljayega coz there are a lot of tier 3 companies, getting g a tier 1 offer(>12lpa) is difficult if u have a less cgpa"
    },
    {
      "id": "mr21xwb",
      "body": "I am not talking about tier 1... including all tiers 400 ppl are unplaced check the table 1142 eligible(i.e. they have >6.75cg) but out of that only 761 are placed..."
    },
    {
      "id": "mr2245j",
      "body": "Yeah coz not many accept tier 3 jobs, only some do and rest do smtg else"
    },
    {
      "id": "mr236o2",
      "body": "yeah ig that makes sense... is off campus placements included in that stat?"
    },
    {
      "id": "mr25gel",
      "body": "Nah"
    },
    {
      "id": "mr27l5n",
      "body": "nah ig off campus is included cause no way there were so many internship offers on campus (921)"
    },
    {
      "id": "mr8ptia",
      "body": "then why do so many people join bruh?  \nlike I think paying 25 lakhs is better then joining some new horizon type college."
    },
    {
      "id": "mr8qfps",
      "body": "the people who its not worth are the ones who will still join.   \nSee u cant rly put a price on ur future, the money saved wont be worth shit in 10 years. You will anyway be earning 30-40 lakhs eventually."
    },
    {
      "id": "mr8qkrz",
      "body": "source?"
    },
    {
      "id": "mr8u8s9",
      "body": "Isn't that a no Brainer?"
    }
  ]
}