{
  "id": "1k0dgvj",
  "title": "PES lab internships",
  "content": "I need an internship for summer and someone told me we can ask pesu labs or depts for internship. I don't really care if it's good or not I just need a reason to stay in Bangalore lol.\n\nDoes any senior know the process to ask these labs for internship, like CIE , CIOT , CORI etc?\nIm in 4th sem btw.",
  "metadata": {
    "author": "onionbiscuits",
    "url": "https://www.reddit.com/r/PESU/comments/1k0dgvj/pes_lab_internships/",
    "permalink": "/r/PESU/comments/1k0dgvj/pes_lab_internships/",
    "score": 19,
    "created_utc": 1744783566,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mndbc7e",
      "body": "They send out applications. They already sent out the application forms for iot/isfcr and cdsaml/ccbd"
    },
    {
      "id": "mndg4la",
      "body": "Buddy do urself a favor and please don't join any college  based internships,prbly the most useless and stressful thing ever"
    },
    {
      "id": "mnel00d",
      "body": "wait why? i heard innovation lab is nice?"
    },
    {
      "id": "mnfbxlb",
      "body": "Pil is not really a pesu lab it's mostly student run , and that's probably why it's good"
    },
    {
      "id": "mnfbzfr",
      "body": "I see. I wasn't aware. Thanks for the heads up"
    },
    {
      "id": "mnfgxhw",
      "body": "Listen, buddy Innovation Labs? Absolute gems. But internships at college centers? Now that’s where the real circus kicks off.\n\nFrom day one, they expect you to pull a rainbow.......... not out of thin air, no no......but straight out of your ass.\n\nFirst, you’ll spend an eternity , probably the best years of your youth , just trying to convince your ever-so-enlightened teachers about the idea you want to work on. And once you think you’ve finally nailed it? Oh no, sweetheart — the party’s just getting started.\n\nNext comes the grand presentation. You walk in all prepped, passionate, ready to impress... and what do you find? Teachers either blasting reels on full volume or deep in REM sleep within the first five minutes. Then, like clockwork, they jolt awake halfway through, look around like they’ve just been teleported to another dimension, and treat your work like it’s written in ancient Greek.\n\nBut wait, there’s more! Once you go through the Olympic sport of herding your panel members into one room for review, you’ll hit that sweet moment where you start questioning all your life choices — or better yet, reach for an imaginary knife and call it a day.\n\nAnd just when you think you’ve crossed all hurdles — documents done, draft copies polished, submission ready — the final boss shows up: your teachers casually roasting Tier 2 and Tier 3 conferences like they’re beneath human dignity.\n\nNow, you’re probably thinking, “Why would this guy even care about that?”\n\nWell, here’s the plot twist: the same folks who trash those conferences? Yeah, they get paid extra for every student who applies, no matter the tier. Pure class, right?\n\nBut guess what? I stopped giving a damn. Went ahead, did the work, and landed a really solid conference anyway. Sometimes the best move is to tune out the noise and just let your work do the talking."
    },
    {
      "id": "mnkv92e",
      "body": "damn thanks alot bro, really appreciate it"
    },
    {
      "id": "mnkvc6r",
      "body": "oh lol mb"
    },
    {
      "id": "mnr68l6",
      "body": "Well, you clearly had a bad experience at whichever lab you worked at. But it would be unfair to generalise and say that all labs are trash. Your experience depends entirely on your prof and the project, and you got unlucky. \n\nThere are students who look forward to working with profs and at these labs. If people didn't have a good experience in the past, there wouldn't be alumni groups for CCBD and the other labs - alumni groups who meet almost every year and value those memories. \n\nTo summarise, your experience was definitely bad but to generalise and say it's going to suck for everyone is a massive stretch. No need to hate the lab or the profs in general. Sure the research output isn't great (or as great as it used to be) but they're trying to have some kind of research output in a college that cares primarily about placements."
    }
  ]
}