{
  "id": "1k1azvb",
  "title": "Vibe Check - 7000 strong",
  "content": "We have 7000 people in this subreddit, which is crazyy!!\n\nLike always, please drop in your suggestions and improvements in comments!!\n\nAnd on a final note, thank you for all contributions and posts here, it is truly amazing how big this subreddit  is!! I hope this continues strongggg and we reach 10K sooooon  \n ",
  "metadata": {
    "author": "ChromaticChaos",
    "url": "https://www.reddit.com/r/PESU/comments/1k1azvb/vibe_check_7000_strong/",
    "permalink": "/r/PESU/comments/1k1azvb/vibe_check_7000_strong/",
    "score": 86,
    "created_utc": 1744891202,
    "flair": "ANNOUNCEMENT :snoo:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mnkl1vb",
      "body": "love you guys, but please do us all a favour and ban those fuckass bots that keep spamming the same recycled garbage for karma🙏🙏"
    },
    {
      "id": "mnklthq",
      "body": "I am fairly new to reddit, what is this karma everyone talks about ? And like do prople get money if they make more?"
    },
    {
      "id": "mnknbes",
      "body": "Karma is like a credit score that you get when people upvote your post or comment. Karma is like a reputation score which determines your credibility."
    },
    {
      "id": "mnknvf6",
      "body": "Toh basically gaining sort of respect in this virtual world ?"
    },
    {
      "id": "mnko7dy",
      "body": "Yes something like that. In many subreddits, they expect a minimum karma on your account in order to upload posts there."
    },
    {
      "id": "mnkpwvd",
      "body": "lmaooo dude if karma paid, i'd be a billionaire thanks to my 200 reddit accounts. sadly all I’ve earned is a permanent residence in the depths of internet degeneracy"
    },
    {
      "id": "mnkq85d",
      "body": "will the society accept you ?"
    },
    {
      "id": "mnkurq9",
      "body": "I've already banned one. Let me know if you see another."
    },
    {
      "id": "mnkwsjv",
      "body": "see if there is a way to delete the spammy brainrot posts, and also if there is a way to delete repeated posts. (note - try to automate this, not someone do it manually)"
    },
    {
      "id": "mnl93zi",
      "body": "Understood, let me figure something out \n\nTill then, please do flag all such posts, I'll review and remove them accordingly"
    },
    {
      "id": "mnl9bsl",
      "body": "Yup, on it\n\nPlease do report/flag such accounts and posts\n\nWe'll do the required accordingly"
    },
    {
      "id": "mnlj52k",
      "body": "\n\nu/NoTensionAtAll\n\nu/Gracious_Heart_\n\nu/AfterSomeTime\n\nu/Your_Friendly_Panda\n\nu/IndianByBrain\n\nu/FriendlyFlag"
    },
    {
      "id": "mnlkdz8",
      "body": "Oh wow, thanks lol. I'll get to this soon"
    },
    {
      "id": "mnlkveb",
      "body": "yep it's these motherfuckers 😭😭😭"
    },
    {
      "id": "mnlw0zy",
      "body": "Thats really good ppl , may the pride of pesu be with you all"
    },
    {
      "id": "mnmj30w",
      "body": "Sure !! Will do that"
    },
    {
      "id": "mnmjncq",
      "body": "Congrats nice to see and if you guys need help with automod for spam I can help you with it"
    },
    {
      "id": "mnpr5ot",
      "body": "That would be awesome, can you please DM me\n\nThanks"
    }
  ]
}