{
  "id": "1k1bps6",
  "title": "Except PIL, which other PES Internship are worth it? (ISFCR/IOT, CCBD/CDSAML, RAPID)",
  "content": "like would you recommend any of the internships listed above for a 4th sem student for the summer break, or just work on skills and do some internship with contacts?",
  "metadata": {
    "author": "Sad_Ticket_8800",
    "url": "https://www.reddit.com/r/PESU/comments/1k1bps6/except_pil_which_other_pes_internship_are_worth/",
    "permalink": "/r/PESU/comments/1k1bps6/except_pil_which_other_pes_internship_are_worth/",
    "score": 13,
    "created_utc": 1744893402,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mnksycw",
      "body": "IOT and RAPID are decent\n\n\nIf you are in your 2nd year rn, I'd any day suggest DSA grind over these centre internships if you are sure that you'll be sitting for placements."
    },
    {
      "id": "mnkukxz",
      "body": "What if we don't do an internship? I doubt it would be easy to find one in this shit job market.\n\nWould it cause an issue during placements since many companies prefer some prior experience?"
    },
    {
      "id": "mnkv3yd",
      "body": "CCBD and CDSAML aint good ??"
    },
    {
      "id": "mnkvy2y",
      "body": "will companies look at internship experiences? when do companies start coming for placements? i have a gpa close to 8.5 should i just grind dsa and prep for placements?"
    },
    {
      "id": "mnkwk3p",
      "body": "6th sem end they start coming usually.   \nDepends tbh, if u feel u are strong in DSA, go ahead and prep for other subs tat are imp for placements like DBMS, OS, CN"
    },
    {
      "id": "mnkxuet",
      "body": "Same +1"
    },
    {
      "id": "mnl6t0f",
      "body": "Best resources for studying DBMS, OS  ,CN  for placements ?"
    },
    {
      "id": "mnl8lbq",
      "body": "https://www.reddit.com/r/PESU/s/GL1JkZo5Nu\n\nPlease refer to this comment I had put up previously."
    },
    {
      "id": "mnlkj2m",
      "body": "I've hears u/rowlet-owl mention that CCBD is pretty good"
    },
    {
      "id": "mnlkl7l",
      "body": "I've hears rowlet owl mention that CCBD is pretty good"
    },
    {
      "id": "mnlkndr",
      "body": "I've hears rowlet owl mention that CCBD is pretty good"
    },
    {
      "id": "mnlpzva",
      "body": "Your experience will greatly depend on two factors: (1) the project you get assigned to and (2) the prof who advises you. Unless these two factors work in your favour, you will be in for a hard time. I was at CCBD and I got to work with KVS on an interesting problem statement that aligned (somewhat) with my interests. So we actually did a good bit of work and it was fun. Similarly, I know people who were unfortunate and didn't have a good prof/problem statement and were unhappy throughout the internship. Analogically, I've also heard anecdotes about the same at other labs like CDSAML and ISFCR. \n\nI've explained more on this in an old comment which you'll have to find, but to summarise, it's only worth it if you find a good alignment with the research being pursued and the prof. Else you'll not really have a good time. Look for what they're working on, the profs, the projects they're currently looking into (and what their past students worked on) and that will give you a good idea if you like the work. \n\nAre there benefits? Absolutely. A good research oriented LOR from a prof and a paper, if you do good work. But all this is possible only if your interest matches with what you're working on."
    },
    {
      "id": "mnlqvlw",
      "body": "my ideal plan is to grab a good internship by end of 3rd year, hopefully convert it into a PPO and have that tension off my head, then work a few and maybe do masters then. What should be my plan of action then?"
    },
    {
      "id": "mnm3t1f",
      "body": "It has deteriorated lately, so I think there are better options to consider"
    },
    {
      "id": "mnmjlvg",
      "body": "https://www.reddit.com/r/PESU/s/tXBXi9E3Mx\nIts given in detail Bud"
    },
    {
      "id": "mnmtl8v",
      "body": "GRIND DSA. That's all. Big companies will come to take summer interns in ur 5th & 6th sem, and the only thing I saw that matters to them is how strong are your fundamentals and DSA. You gotta be at a very good level in Competitive programming n all to crack the OAs tho..\n\nWe didn't know about all this as our seniors told no companies came for them in 5th sem T_T.. Most of us were unprepared.."
    },
    {
      "id": "mnr3psr",
      "body": "What is a good cg to have \nMy cg is around 8.1 \n4th sem btw"
    },
    {
      "id": "mnr3v54",
      "body": "You'll be eligible to write atleast 80% of the OAs next sem and 6th sem combined"
    },
    {
      "id": "mns41ao",
      "body": "CIE"
    },
    {
      "id": "mns4y65",
      "body": "rowlet owl the goat🐐🙏"
    },
    {
      "id": "mnwmyuw",
      "body": "elaborate? is it paid, do they do quality work?"
    },
    {
      "id": "mnwparx",
      "body": "Few of them r paid, yes they do quality work. Usually they provide internship opportunities in summer. If an intern delivers the good results at the end, they will encourage u to take the same project to higher levels(with finding)"
    },
    {
      "id": "mrkzrtf",
      "body": "Mine is 6.9 cgpa(till 3rd sem) 🥲.It would cross 7 after 4th sem results. Any chance for these internships in 6th sem?"
    },
    {
      "id": "mrsxqkw",
      "body": "Tough. But get good at solving OAs and you might get through."
    }
  ]
}