{
  "id": "1k1djkc",
  "title": "Can i get into PES engineering college??????",
  "content": "Guys/Seniors Pleaseeee helpp me!!!\nSo my KCET just got over and i seriously fucked up chemistry badly physics and mathematics were okay.(22 in chemistry, 32 physics,35 math)\nPCM total score i have is 298 \nWill i get a good rank in kcet ??\nWhats the minimum rank to get into PES ???",
  "metadata": {
    "author": "LabRat2512",
    "url": "https://www.reddit.com/r/PESU/comments/1k1djkc/can_i_get_into_pes_engineering_college/",
    "permalink": "/r/PESU/comments/1k1djkc/can_i_get_into_pes_engineering_college/",
    "score": 6,
    "created_utc": 1744898486,
    "flair": "PESSAT/Admission",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mnl572n",
      "body": "no one knows exact cutoffs, but last yr with 85/140 and 295 in pcm was 7k cet rank, so ig you get a fair idea . AGAIN its subject to changes depending on your batch. Ece cutoff in pes rr was smtg like 5-6k in last round for kcet"
    },
    {
      "id": "mnle9yu",
      "body": "No one can predict cet marks vs rank. They'll somehow never follow previous years pattern. If they do by sheer luck they'll change the damn total marks itself and frick you up. So just relax and wait"
    },
    {
      "id": "mnlgw8l",
      "body": "do yourself a favor and don't join this fuckass college"
    },
    {
      "id": "mnli3ht",
      "body": "Nope, trust me even if you get in, the competition now will be too high. Since most of your peers will be joining thru their jee mains scores.\n\nBut regardless the competition is still too high with the unreal amount of intake for CSE,ECE and EEE."
    },
    {
      "id": "mnloin6",
      "body": "Why do you say soo ??"
    },
    {
      "id": "mnlok10",
      "body": "Jee mains i got like 92.7 in first session I'm waiting for 2nd session results"
    },
    {
      "id": "mnlooy7",
      "body": "Ohhh okkkk I'm even attempting comedk and met"
    },
    {
      "id": "mnlos2c",
      "body": "Ohhh ig i won't then 😭"
    },
    {
      "id": "mnlpdir",
      "body": "I actually want mechanical"
    },
    {
      "id": "mnlpwbd",
      "body": "Why do you want the worst branch in PES?"
    },
    {
      "id": "mnm36d3",
      "body": "Idk it was the worst branch , i just want to take mechanical\nWill i get mechanical in any top colleges if not pes ????"
    },
    {
      "id": "mnok13q",
      "body": "You might get ECE in RR campus"
    },
    {
      "id": "mnoy622",
      "body": "RR campus ??"
    },
    {
      "id": "mnp4yhy",
      "body": "Yes.. but the fees will be 5.1 lakh.. a relative of mine attended the counselling"
    },
    {
      "id": "mnpk8dc",
      "body": "Thank you for the info 👍👍👍"
    },
    {
      "id": "mnpmxqb",
      "body": "What would you suggest Kcet or met ???\nAbout MET I'm pretty confident of getting it.\nIf i got into MIT(MANIPAL INSTITUTE OF TECHNOLOGY)\nShould i choose Mit or kcet top colleges??"
    },
    {
      "id": "mnr8k2g",
      "body": "I would prefer kcet top colleges, however you must ask MIT ppl for better clarity. Unfortunately none from my friend circle went to Manipal..so I am not the perfect candidate to answer this"
    },
    {
      "id": "mnrcfv9",
      "body": "Thank you 🙇‍♂️👍"
    }
  ]
}