{
  "id": "1k1n5jw",
  "title": "pls help seniors",
  "content": "I’ll be getting CS (core) at PES University, Electronic City campus, through JEE Mains. The fees are around ₹5L per year. Is it worth it in terms of ROI? Also, can PES be considered the 4th best college in Bangalore? How are the placements and the general crowd there? I messed up KCET and don’t have much hope from COMEDK either, so just wondering if this would be my best bet. Also I won’t be taking the hostel so should I book the seat?",
  "metadata": {
    "author": "beluga_billi",
    "url": "https://www.reddit.com/r/PESU/comments/1k1n5jw/pls_help_seniors/",
    "permalink": "/r/PESU/comments/1k1n5jw/pls_help_seniors/",
    "score": 6,
    "created_utc": 1744922483,
    "flair": "PESSAT/Admission",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mnnr4my",
      "body": "Check the FAQs for pros and cons. You'll get your answer. \n\n>Also, can PES be considered the 4th best college in Bangalore?\n\n4th best? In just Bangalore?? How dare you, we're literally the IIT of Bangalore"
    },
    {
      "id": "mnolfy6",
      "body": "Kitna percentile aaya btw"
    },
    {
      "id": "mnpb0vi",
      "body": "It's campus is just like stanford fr"
    },
    {
      "id": "mnq7whf",
      "body": "If you can afford it and have no better options ( BITS/NIT/IIIT) then go for it. And yea it's definitely considered in the top 2-3 colleges for CSE in Bangalore and top 5 in Karnataka"
    },
    {
      "id": "mnq80p4",
      "body": "If you can afford it and have no better options ( BITS/NIT/IIIT) then go for it. And yea it's definitely considered in the top 2-3 colleges for CSE in Bangalore and top 5 in Karnataka"
    },
    {
      "id": "mntezeh",
      "body": "wait are you being fr. would it be ranked after rvce or like after msrit and bms cuz i heard the crowd in pes is much better than msrit or bms so i wanted to join pes"
    },
    {
      "id": "mntf4c1",
      "body": "oh thanks"
    },
    {
      "id": "msi35dr",
      "body": "Im myself going thru this exact phase of urs, the campus esp the library of RR no doubt feels straight out of harvard or a foreign uni, \n\nBut looking at so many comments regarding its strictness is the only obstacle thats coming btwn me making a decision for PESU."
    }
  ]
}