{
  "id": "1k28ps8",
  "title": "Help a 12thie out",
  "content": "I have 98.38%ile in mains and won't be getting software related branch at any decent NIT/Top GFTI or IIIT, so I was considering PES however,I have some doubts :\n1 Can I (For sure) get CSE \n2 How's hostel , mess and college life \n3 discrimination/prejudice against north people?\n4 CSE median (no reliable data I found) \n5 (OPTIONAL)\nWould pes be worth it if I left NIT T/W/S Civil/mining/meta/prod and mech chem at NIT Jaipur or circuital at tier 2/3 NIT/IIIT/GFTI \nThanks!!!",
  "metadata": {
    "author": "Weekly_Advantage5426",
    "url": "https://www.reddit.com/r/PESU/comments/1k28ps8/help_a_12thie_out/",
    "permalink": "/r/PESU/comments/1k28ps8/help_a_12thie_out/",
    "score": 4,
    "created_utc": 1744992687,
    "flair": "PESSAT/Admission",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mns54g0",
      "body": "Yes it's worth it.....if you compare to those above ones...."
    },
    {
      "id": "mnsab7m",
      "body": "Discrimination against north people: there's none. Nobody cares here. \nCSE Median: 12-14. If you're GPA is 8.5+, it's closer to 17\n\nRest of the questions I don't have an answer to since I'm a day scholar"
    },
    {
      "id": "mnsdna5",
      "body": "Did you give KCET ?"
    },
    {
      "id": "mnsexn4",
      "body": "1)i think you can get , For Sure? We Dont know. beacuse we dont have any existing data for any cutoffs for admissions through jee mains (without pessat).This is the first year that we have only jee mains(and cet) for admissions.  \n2)College mess and hostel depends on college , check the reviews on this sub and Checkout the FAQ's in this sub as well.  \n3) I have not seen any discrimination towards north people personally. People in the college dont really care about that much and you will also find diverse amount of people here.  \n4) checkout the  [PLACEMENT 2025 stats](https://docs.google.com/spreadsheets/d/1TfR17y3iPGzHFmCfWGwAXBpwCHvbxEK0wOP_Kx8FOG8/edit?gid=582730064#gid=582730064) , Note : this was maintained by the students and its outdated by some margin because its a very tedious task to maintain that sheet.  \nIF you want reliable data checkout this [Placement data](https://pes.edu/naac/doc.html?file=upload/nirf/NIRF_2025_PES_University_Engineering.pdf) which is from the official website.  \n5) Depends on your interest, CSE in pes here is very good if you can maintain a good gpa throughout your college.IF you really like CSE and u think You want CSE instead of other branches go for pes.  \nPES has updated syllabus , Good textbook recommendations  and references for CSE fundamental subjects and has a good amount(too much actually) of hands on work. What PES really lacks is quality of teachers to teach these subjects and help you with the hands on.I think its best to Research about these on your own throughly and make a decision on your interests.\n\nHope this helps :D."
    },
    {
      "id": "mnsexrt",
      "body": "I'm a northie sir"
    },
    {
      "id": "mnsfact",
      "body": "Thanks for such an elaborate answer"
    },
    {
      "id": "mnsvgsk",
      "body": "comedk?? you can get cs at rvce , and manipal??"
    },
    {
      "id": "mnuxh0n",
      "body": "That wasn't explicitly mentioned so can't be assumed "
    },
    {
      "id": "mnv6y9v",
      "body": "Even nit Rourkela which is considered a tier 1 nit doesn't have 17lpa cse average package so I guess op should go for pes."
    },
    {
      "id": "mnw7jxm",
      "body": "Hostel is decent , since you're from North ull most likely get a good priority of room in the hostel. There's 3 mess's ( one is pure veg ) and they're all decent , no issues as such. Hostel rules might seem strict but there's always ways to have fun and it's not enforced a lot."
    },
    {
      "id": "mo2lmr3",
      "body": "i dont know how have you got this number, but as far as i know i have seen that many with 9 plus gpa also get into companies like HPE @ 11 lpa and some with 8.2 \\~ 8.3 ish get into companies like app dynamics ( cisco ) @ 23 lpa (17-18 base), \n\nalso not a lot of companies make the barrier as 9 gpa, and most of them keep it at 7 cgpa or 8 cgpa,   \nabout from 1400 kids  -  490 ish take home T1 placements that is 12 lpa plus"
    }
  ]
}