{
  "id": "1k2ttk1",
  "title": "How much harder are the subjects in 3rd year CSE compared to 2nd year",
  "content": "4th sem has been the worst for me in terms of difficulty of subjects so far.\n\nDoes it only get harder from here? I'm aware that 3rd year  is more stressful since students have the added pressure of internships and capstone but how are the core subjects?",
  "metadata": {
    "author": "Vegetable-Complex922",
    "url": "https://www.reddit.com/r/PESU/comments/1k2ttk1/how_much_harder_are_the_subjects_in_3rd_year_cse/",
    "permalink": "/r/PESU/comments/1k2ttk1/how_much_harder_are_the_subjects_in_3rd_year_cse/",
    "score": 15,
    "created_utc": 1745060859,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mnwuvas",
      "body": "5th sem is better than 2nd year ,  finding 6th harder than 5th but still better than 2nd year"
    },
    {
      "id": "mnwykbt",
      "body": "4 th semester is actually difficult my gpa slides to 8.17, and then 5th was easy"
    },
    {
      "id": "mnxpdob",
      "body": "Depends on a lot of factors.  \nAccording to me the Normal courses are way interesting than 2nd year , and has a good amount of Hands On work.  \nSubjects like Machine Intelligence ,Compiler Design will be slightly harder. Studying them one night before exam wont fetch you lot of marks , make sure your consistenty atleast listen to the classes for them.  \nNow is the tricky part : The Electives, they can be hit or miss, based on What you choose. There are some New Electives,Some electives have syllabus change and some have good weightage on Labs and Assignments. Choosing Electives Based on your Interest and your Bandwidth is very Crucial.  \nPLEASE DONT CHOOSE AN ELECTIVE BECAUSE YOUR FRIEND HAS TAKEN IT. Research your interests,syllabus and Also the teachers who teach them.\n\nSome Easy subjects but are very Annoying are software engineering , cloud computing."
    }
  ]
}