{
  "id": "1k4ja1o",
  "title": "ISA",
  "content": "141 IN ISA 1 IN P CYCLE HOW TO IMPROVE FROM THIS HOW IS UNIT 3 AND 4 IN ALL SUBJECTS AND HOW MUCH OF A CHANCE AM I LEFT WITH TO GET CNR SCHOLARSHIP",
  "metadata": {
    "author": "ApprehensiveBug9870",
    "url": "https://www.reddit.com/r/PESU/comments/1k4ja1o/isa/",
    "permalink": "/r/PESU/comments/1k4ja1o/isa/",
    "score": 4,
    "created_utc": 1745256678,
    "flair": "Study Help :table:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "moajk42",
      "body": "unit 3 and 4 of:  \nmath - cant tell, im in first year\n\neee - not too hard, similar to first two units\n\nmech - a bit lengthy in theory, less numericals\n\nC - cant tell either, but looks like its gonna kick up a notch\n\nphy - sry to say bro, but better luck next life\n\nchance for cnr:  \nget 180+ in isa 2 and go beast mode in esas"
    },
    {
      "id": "mocsi0m",
      "body": "Lol I had same isa1 total last sem and ended up getting cnr lmaoo"
    },
    {
      "id": "mocthqb",
      "body": ">chance for cnr:  \nget 180+ in isa 2 and go beast mode in esas\n\nI got 138 in isa2 after 141 in isa1 and still ended up with a cnr last sem (p cycle rr cmpus)"
    },
    {
      "id": "mocx1gb",
      "body": "Well tbh cnr i think depends mostly on your esa scores cause they will have higher weightage and try to get full in internals , atb buddy"
    },
    {
      "id": "mods2yv",
      "body": "Bro how"
    },
    {
      "id": "modvssn",
      "body": "What how da?"
    },
    {
      "id": "moei0kp",
      "body": "![gif](giphy|3pTtbLJ7Jd0YM)\n\nthis mustve been you in the esas"
    },
    {
      "id": "moei5fz",
      "body": "ur most likely dense, but he was asking \\*how\\* you managed to get cnr, maybe think before replying, he was only asking for help/input"
    },
    {
      "id": "moei6zo",
      "body": "Yeah coz esas of p cycle were easier"
    },
    {
      "id": "moeilqk",
      "body": "I got it your comment sums it all up. I have nothing much to say except this \"don't give up after one bad ISA You can still end up doing better if you don't give up\""
    },
    {
      "id": "mof2n4d",
      "body": "bullshit no one is gonna believe that, put screenshots else your comments are massively misleading"
    },
    {
      "id": "mof2omx",
      "body": "please attach screenshots for proof, this will be misleading otherwise"
    },
    {
      "id": "mof8egm",
      "body": "Dm"
    },
    {
      "id": "mof8lr5",
      "body": "Won't i be doxxed if i reveal my gpa?"
    },
    {
      "id": "mof8rxu",
      "body": "Dude I'm not misleading anyone plz stfu"
    }
  ]
}