{
  "id": "1k5cd3o",
  "title": "College keeps getting worse each semested",
  "content": "I’m in my 4th sem right now and college feels so depressing every day. I used to be fairly decent in studies, but now my marks are low, the teachers are really bad, and the whole environment feels tiring and sad. I don’t feel like studying or doing anything remotely productive anymore. \n\n\n\nWhat makes it worse is seeing people around me who are so smart and seem to have a lot of shit figured out. It makes me feel scared and worried about my future.\n\nI’m worried for 3rd year, especially with internship pressure. I don't know how i'd be able to handle it. How do you deal with it?",
  "metadata": {
    "author": "Mountain-Geologist46",
    "url": "https://www.reddit.com/r/PESU/comments/1k5cd3o/college_keeps_getting_worse_each_semested/",
    "permalink": "/r/PESU/comments/1k5cd3o/college_keeps_getting_worse_each_semested/",
    "score": 77,
    "created_utc": 1745343443,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mogwmul",
      "body": "different college same vibes i totally get you"
    },
    {
      "id": "moh1ndy",
      "body": "Shits so bad I put more effort into trying to copy today than learn anything"
    },
    {
      "id": "moh2a0y",
      "body": "Fr 4th sem is too bad \nSoo many assignments and quizes ,just copy stuff and submit it.\nTeachers don't even teach properly \nDoing the same thing everyday 😭😭"
    },
    {
      "id": "moh52zq",
      "body": "This semester has been the most demoralizing,. The teachers are so bad they've  killed any interest I had in the subjects. Atp i'm just trying to preserve whatever’s left of my sanity."
    },
    {
      "id": "moiirq5",
      "body": "Reading this hit home. I felt the same way during my second year at PESU too as so many of my classmates found summer internships at great companies and research opportunities on campus. \n\nI never really cared as much till then, and was just an average student, but at that point it made me start to feel bad.\n\nAll I can say is stop caring/comparing yourself to others and start working towards your own goals. You still have some time till the proper placement season. Keep slowly, silently and steadily grinding I would say. Most people overhype their readiness, preparation and skills, so don’t bother. Focus on your own GPA, capstone, leetcode, technicals, whatever.\n\nI never found a proper second year internship either. Most of us didn’t. Some of us (like myself) found some random unpaid thing, where we did no meaningful work. Still when the time came, I managed to get an internship, that I later converted to full time. All my friends did the same. So there’s success waiting down the line for everyone.\n\nAlmost 4 years out of PESU, I can say that it all worked out for pretty much all of us. I don’t think anyone that I know is doing badly at this point. Sure people are at different places and phases, but everyone still is doing good.\n\nlol this is a sappy af answer, but I felt the same when I was in your shoes. Now on the other side, I think “why did I worry so much”"
    },
    {
      "id": "moiunba",
      "body": "Guys, advice as a senior, as you move to higher sems, things get rough, but most importantly you begin to realise that you learn more outside the class than inside. That being said your own effort to understand the subject, work on projects, debug issues, learn a software. It’s no more a school.. everyday is a hurdle, just do what you love to do/ want to do, at the same time giving enough time to clear subjects without any backlogs, that’s the only way to get through college"
    },
    {
      "id": "molioqm",
      "body": "Just fyi, today was the last day of college for me and i COULD NOT BE HAPPIER. I have felt the way you are feeling for 3 years now and I really want to be done with it. One more month and the exam stress is gone for life. Maybe getting a job is worse, but at least I get paid for it."
    },
    {
      "id": "molmf60",
      "body": "I cannot wait to be done :("
    },
    {
      "id": "mor0tox",
      "body": "lock in"
    },
    {
      "id": "moruqab",
      "body": "Don't worry..it only gets worse from here."
    },
    {
      "id": "mosq0fi",
      "body": "Very helpful, thanks."
    },
    {
      "id": "mozk89d",
      "body": "Screw everything make sure u make the best of the time u spend in college Bunk Class,GO late and get screwed   \nthats the part of the college life ,at teh same time please dont let ur GRADES DROp bunk all the classes if u can get marks ,but untill then u have to listen to these some shitty teachers   \nMost of the time in ur third sem ull be free to use ur laptop do everything to make urself better.  \nCapstone u can bluff ur way through,internships are not a problem ,learn how to talk and manage ppl \\[u can start with convincing these teachers your CApstone IDea cux theyll be the ideal Critics\\] u convince them and ull do just fine in the outside world"
    },
    {
      "id": "mp6o6m2",
      "body": "That was the same for me too...regretted everything once I came to 6th sem. Majority of your gpa is based on first three years itself...the last year has very few subjects to compensate for a low gpa. A trick is to get a C at least in all subjects"
    },
    {
      "id": "mpd7y6l",
      "body": "I already bunk as much as I can lol"
    }
  ]
}