{
  "id": "1k6n80r",
  "title": "Pes jee main admission preference list !!!",
  "content": "Only 4 preferences can be submitted now I am not sure why it is like this   \nbut is this gonna be considered in 1st councelling round in june or will a different preference list come out at that time??",
  "metadata": {
    "author": "JobWorking",
    "url": "https://www.reddit.com/r/PESU/comments/1k6n80r/pes_jee_main_admission_preference_list/",
    "permalink": "/r/PESU/comments/1k6n80r/pes_jee_main_admission_preference_list/",
    "score": 0,
    "created_utc": 1745483530,
    "flair": "PESSAT/Admission",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mor9565",
      "body": "bhai same yrr, i got 94.7%ile i put my pref as cs and then aiml for first rr then ec campus...\n\napprently you should prefer the campus over the branch dk fs tho\n\nidk why there is only 4 preferences\n\nbut i think you might get ece in ec campus tho definetly i just hope i get cse\n\nwhy did you go for aiml before core CSE?"
    },
    {
      "id": "morazlz",
      "body": "CSE has a higher cut-off and there's a chance you may not get a seat if you take cse at lower percentile's than others . Last time a guy with 94% got in while a guy with 96 or something didn't "
    },
    {
      "id": "morb4yg",
      "body": "so what is the conclusion? should my pref list be same or whut?\n\nhttps://preview.redd.it/31nb5l7j0rwe1.png?width=1604&format=png&auto=webp&s=4d394a683954e135229b8f4b77a02fed88555e17"
    },
    {
      "id": "morbj3v",
      "body": "yeah that's what I had put earlier   \nbut I changed it according to my worst conditions  \nbut if I was in your position I would actually have the same dilema ki kya dalun but try kar ece koi campus ka dalne ke liye agar teko lagra ki 100% ho jaega"
    },
    {
      "id": "morbrlh",
      "body": "worst conditions? we got pretty similar percentile, i am not interested in ece at all soo much ratta bruh ///\n\ni just hope aiml is guarantedd in EC campus atleast T\\_T"
    },
    {
      "id": "morcr4r",
      "body": "yeah hoping same"
    },
    {
      "id": "more3hc",
      "body": "yo dude i asked PES U , last yr the cutoff for cse was 99%ile for cse and cse aiml, but that was when only 5%of the seats were allocated for jee mains,\n\nbut now 40% of the seats are allocated , simple calculations from chat gpt tells that.\n\nhttps://preview.redd.it/3t6vlgos5rwe1.png?width=625&format=png&auto=webp&s=1fd5711ebbe72e1a9b05aac4af5b9318a7077072\n\nsurely, 80 k rank can land me in aiml in rr minimum T\\_T\n\nthey will release the merit list soon too so fingers crossed"
    },
    {
      "id": "morf1xp",
      "body": "bro 99% is wrong I have people joined in 97 and 98 that too on reddit itself their jee ranks aren't transparent at all   \nso we have to just wait   \ncheck dm"
    },
    {
      "id": "morq6wq",
      "body": "I am also waiting ,Good percentile ,When are they releasing it btw?"
    },
    {
      "id": "mos7f8b",
      "body": "I've got 91.94 %ile i.e. 119800 Rank. Any chances of me getting CSE like anything core or aiml in rr or ec campus."
    },
    {
      "id": "mosjqco",
      "body": "It's 45 percent"
    },
    {
      "id": "mosjxyf",
      "body": "What about 93.47? Atleast ec campus cse possible?"
    },
    {
      "id": "ms2qu4z",
      "body": "Bhai same here .. 91.97 .. hopefully I get cse aiml in electronic city"
    }
  ]
}