{
  "id": "1k6y4xc",
  "title": "Exams",
  "content": "What do you think typing or writing will help us to get good score???\nBecause in our batch those who got cnr or mrd they type.\nThat's how it gonna work or what????",
  "metadata": {
    "author": "Pooja_Samarium",
    "url": "https://www.reddit.com/r/PESU/comments/1k6y4xc/exams/",
    "permalink": "/r/PESU/comments/1k6y4xc/exams/",
    "score": 9,
    "created_utc": 1745515878,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "motpmc5",
      "body": "Who told ppl with mrd or cnr type?\nI type for only C and works well"
    },
    {
      "id": "mottf7w",
      "body": "A very important lesson being demonstrated by OP here - correlation does not imply causation. \n\nAn example for those who do not know what it means:\n\nhttps://preview.redd.it/g2j41gzomtwe1.png?width=1280&format=png&auto=webp&s=1b132c39cdbb96ef971a62021247ac9bee7b9d2a"
    },
    {
      "id": "motvdkw",
      "body": "Don't trust anyone else. Only people who type get scholarships. \n\nThey give you the mandatory answersheet, but it's just a truck. It's a trick to see if you'll take the easy way and just write formulas or if you'll use the PESU TRADEMARKED editor. \n\nThere's basically 4 tiers. \n\nWorst- those who write everything \n\nAlright- those who write only formulas and diagrams \n\nBetter- only draw diagrams \n\nBest- use PESU TRADEMARKED editor, and also edit the webpage to create their own canvas to draw diagrams on. \n\nThis shows how innovative and capable you truly are. There's no other way to demonstrate your PESUness. Even if you do the best thing once, you will get an immediate graduation with a 96.69 cgpa. \n\nDon't believe the others telling you otherwise, they just don't want others to get far in life. Especially u/rowlett_owl. Always giving reasonable answers when they are absolutely not deserved"
    },
    {
      "id": "motvz0c",
      "body": "waiting for the downvotes"
    },
    {
      "id": "motw8u6",
      "body": "I'm pretty sure this image definitively proves ice creams cause sunburns. \n\nThey lower your internal body temperature, which causes a drastic temperature delta at the two sides of your skin. Something like what you see in your car on a rainy day. \n\nNow this delta fools the skincells into thinking they're hotter than they actually are. And once they think they are hot enough, they'll automatically burn themselves. Aka skinburn."
    },
    {
      "id": "mou15za",
      "body": "i've got mrd and i write all the working in the answersheet"
    },
    {
      "id": "mou20mv",
      "body": "Need some tips"
    },
    {
      "id": "moudb8u",
      "body": "I only type for coding exams cuz apparently the teachers are too lazy to run the code and will just give u marks if it looks right\n\n2nd sem, got mrd,"
    },
    {
      "id": "mouhuoy",
      "body": "Oh okay got you"
    },
    {
      "id": "mouimm7",
      "body": "Got MRD thrice in a row, I'll type as much as I can unless I'm REQUIRED to use paper to show my working"
    },
    {
      "id": "mouisau",
      "body": "Which department?"
    },
    {
      "id": "mowolcl",
      "body": "Yess if u do not type the biased AI will only scan half ur answers and reduce ur marks. Typing is the best way to get mrd even if you didn't study. The overlords of pes want you to type so they can get a detailed analysis of your typing style so you can become part of their human replication program. You Must Type."
    },
    {
      "id": "mox3i6d",
      "body": "Really???? That's how it works?????"
    },
    {
      "id": "mox7wsu",
      "body": "They're very obviously joking"
    },
    {
      "id": "moy7ico",
      "body": "But they won't even chance to run it if you write right?"
    },
    {
      "id": "moyia1t",
      "body": "tips like?"
    },
    {
      "id": "mp0l7pt",
      "body": "got mrd three times. honestly to do whatever works best for the question. i switch between typing and writing in each paper depending on whether it requires and diagramatic explainations or not."
    },
    {
      "id": "mp6pfv8",
      "body": "It depends...numericals its better to write. For theory its up to you"
    }
  ]
}