{
  "id": "1k7ebqq",
  "title": "will i get PESU at 95%ile ? also what are the fees and everything? scholarships?",
  "content": "<8 LPA, Should one prefer PESU or Thapar? ",
  "metadata": {
    "author": "ReasonPretend2124",
    "url": "https://www.reddit.com/r/PESU/comments/1k7ebqq/will_i_get_pesu_at_95ile_also_what_are_the_fees/",
    "permalink": "/r/PESU/comments/1k7ebqq/will_i_get_pesu_at_95ile_also_what_are_the_fees/",
    "score": 5,
    "created_utc": 1745562892,
    "flair": "PESSAT/Admission",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "moxgn8u",
      "body": "Which is nearer? Pesu or Thapar? Pesu will cost you 6.5lpa including hostel thru jee"
    },
    {
      "id": "moxh52l",
      "body": "Damn 💀. Didn't know pesu was that expensive. 6.5lpa is crazy. Here I thought my college was expensive."
    },
    {
      "id": "moxhfj2",
      "body": "Only thru mains, we cet people pay 1.2lpa 😎"
    },
    {
      "id": "moxhl9i",
      "body": "Damn, lucky. 1.2lpa is noice ngl."
    },
    {
      "id": "moxhwso",
      "body": "Ikr, and if u get cnr every sem and ssp (the state scholarship which everyone gets) then you just pay 2.3l for four yrs"
    },
    {
      "id": "moxhz1d",
      "body": "damn...6.5 is atrocious, but thapar is nearer "
    },
    {
      "id": "moxi1g9",
      "body": "thats crazy"
    },
    {
      "id": "moxi7oh",
      "body": "stalked you for a bit, hows mech at NSUT if i just wanna get tech placements?"
    },
    {
      "id": "moxv9gp",
      "body": "It's decent, but honestly, it's very difficult for a guy in mech to get placement in tech. You will have to work 3× or 4x harder than a cs/it guy. The placements for non tech and core is decent, and for higher studies, it is also sexy. I personally think cse in pes would be better but for mains kids the roi is shit tbh. U guys are paying 6.5lpa for a normal btech degree. Only bits could justify that amount."
    },
    {
      "id": "moxvmgp",
      "body": "6.5 is just for 1st year after that it's 6.2LPA   \nyeah still high as F"
    },
    {
      "id": "moy0v5r",
      "body": "cnr scholarship is for all india ? KA government is ruining there colleges anyway lol they pressurise Manipal authorities for 50% boards marks just because scoring 90% in KA board is piece of cake"
    },
    {
      "id": "moy2kal",
      "body": "yeah i mean i definitely cant afford pesu fees without loan/scholarship, my only other option would be UP State College CSE which im hesitant to join because kids dont even know whats reddit let alone codeforce, is the only reason im considering Mech in the first place, idk bhai confused hoo"
    },
    {
      "id": "moy40d8",
      "body": "Bhai I would have taken pes cse if the fees would have been less. But loan vaguer lena isn't worth it. NSUT mech is good and probably would have tech placements comparable to PES cse. NSUT hain at the end of the day, badiya and sec c companies come here. And by chance if you get interested in non tech or core or even post grad then toh it becomes an easy choice. NSUT mech would be a clear better option in this scenario.\n\nBaaki if you are able to get a good scholarship and the fees comes down to 2lpa then take it. Also UP state college cse toh bilkul mat lena. It would be shit af. It should not even be an option for you. Bhul ja usse, unless the state college nit Allahabad which I highly doubt"
    },
    {
      "id": "moy7zuh",
      "body": ">scoring 90% in KA board is piece of cake\n\nBut admission happens thru cet lol.."
    },
    {
      "id": "moz1wv0",
      "body": "Please don’t come the pressure is too much, there is not a shed of empathy in any of the professors. The service is just bad. This place sucks. Do your research properly before picking."
    },
    {
      "id": "moze2zb",
      "body": "well im not getting CSE at any good college except these bade bhai....my fault but yeah"
    },
    {
      "id": "mozk08m",
      "body": "wtf"
    },
    {
      "id": "mozrng2",
      "body": "Ssp is so rigged. General merit doesn't get shit"
    },
    {
      "id": "mozrsq1",
      "body": "That's why I said only 70 percent of em get..."
    },
    {
      "id": "mozsdsk",
      "body": "Lol don't listen to them, the pressure is not so much and most teachers are kind enough, the teaching is debatable tho."
    },
    {
      "id": "mp6mzax",
      "body": "i was talking about manipal"
    },
    {
      "id": "mp6ypjb",
      "body": "can you suggest the preference order?"
    },
    {
      "id": "mp9a7g7",
      "body": "when i was in your boat, i had an order of RR CSE -> EC CSE -> RR AIML -> EC AIML"
    },
    {
      "id": "mpavo89",
      "body": "id join but the fees is too much for me"
    },
    {
      "id": "mpaw1m2",
      "body": "True, jee mains fees is way too much, cet fees are a steal tho"
    },
    {
      "id": "mpaw9nu",
      "body": "UP college kyu nahi lena i can presume they kinda suck but phir bhi why? also, someone also from NSUT here on reddit said mech mt lena unless u wanna stay unemployed confuse ho gaya hu poora, can you dm some mech placements stats from ur college broski would help immensely   \nalso the 2lpa fees thing is abt NSUT right? and im def not getting NIT A lmao"
    },
    {
      "id": "mpawv48",
      "body": "well sucks to be a man from UP, no HS reservation literally nothing here"
    },
    {
      "id": "mpb3ogj",
      "body": "Bhai see, UP colleges mein there is not exposure and tu jaise college ke baarein mein bol raha tha I thought koi bekar sa hoga. Like I know people in mech who rejected Thapar/vit cse and they are better than up college any day. Baaki placements ka I have info but average shayad 10LPA ke upar hi hoti hain, cause koi bol raha tha ka DTU ka its 13 and we aren't that far behind"
    },
    {
      "id": "mpbfg1n",
      "body": "i mean id take mech hands down any day, but i met someone who even took a second drop (rejected nsut mech last year) and some guy who said take mech in nsut if you wanna stay jobless, these things kinda scared me a little, obviously its better than UP colleges, i just wanna do a tech job cuz im already into it somewhat and dont wanna go in core AT ALL, is all\nalso this average is mostly tech placement right ya majorly core jobs lagti he mech walo ki?"
    },
    {
      "id": "mpbh47x",
      "body": "Majorly core bro. Tech is rare cause already upar kaafi bacche hote hain"
    },
    {
      "id": "mpbp7l6",
      "body": "tech me bhi to jaate honge na if someone only wants to go to tech right? idk bhai confuse hu sbke alag alag opinions he koi kehta he branch cse lele koi college"
    },
    {
      "id": "mpbq6nn",
      "body": "Your choice at the end of the day bhai. Tech mein its very difficult. But its for sure will be better than a UP college, even mech. CSE agar kissi acche college mein milla toh take it"
    },
    {
      "id": "mpbtdfd",
      "body": "idk broski jo acche kalej mil rahe he unke paise nahi he baaki theres zero chance of me even trying to go into core field idk what to do anymore lmao"
    },
    {
      "id": "mpc0jym",
      "body": "Try non tech too if you want. Consultancy and all. And tech mehnat karega toh hojayega. Chill kar"
    },
    {
      "id": "mpzyoug",
      "body": "bet if i end up joining nsut ill shoot u a dm"
    },
    {
      "id": "mq0dz6l",
      "body": "Sure bhai. Always happy to help a junior"
    }
  ]
}