{
  "id": "1kczxft",
  "title": "F*ck os",
  "content": "What's this subject , fucking 600 slides for 10 marks out of 100 . I give up ,  I can't do this anymore 😭",
  "metadata": {
    "author": "Fun_Cut_5733",
    "url": "https://www.reddit.com/r/PESU/comments/1kczxft/fck_os/",
    "permalink": "/r/PESU/comments/1kczxft/fck_os/",
    "score": 53,
    "created_utc": 1746189538,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mq6tf0i",
      "body": "Do the numericals bro , they asked only numericals in isa 2 for 4 markers"
    },
    {
      "id": "mq6wgn0",
      "body": "Thanks man !!   \nWas it for both the units?"
    },
    {
      "id": "mq6yqsv",
      "body": "Yep the disk allocation shit in unit 4 if I recall and for unit 3 the shit similar to mpca"
    },
    {
      "id": "mq6z13p",
      "body": "Only relative grading can save me this sem"
    },
    {
      "id": "mq6zqgv",
      "body": "Shilpa ruined the subject for you guys... It's a beautiful subject, one of my favorites. \n\nIt's too late for ISA but I'd suggest going through the textbook and staying as far as possible from those atrocious slides"
    },
    {
      "id": "mq6zqxu",
      "body": "Cool gotcha  \nThanks again !!   \nHope they are kind enough with us too  \nCuz the theory is mind boggling lmao"
    },
    {
      "id": "mq7dyuu",
      "body": "Thanks man , I will do that"
    },
    {
      "id": "mq7gmsq",
      "body": "Been studying for 6 hours and not even done with half a unit"
    },
    {
      "id": "mq7l55g",
      "body": "Imagine ,we had just 1 day gap for os esa,  most of the guys gave up"
    },
    {
      "id": "mq7mom9",
      "body": "how many got backlogs in your batch? i heard that largest number of backs were in os"
    },
    {
      "id": "mq7n4pn",
      "body": "U will be surprised but they were in laa followed by os"
    },
    {
      "id": "mq7nawc",
      "body": "makes sense, that's why they've decreased isa weightage for us in both of these subjects"
    },
    {
      "id": "mq7p5tk",
      "body": "What is the marks required for A and B grade this time ?"
    },
    {
      "id": "mq81vst",
      "body": "I'm a first year,\nThere's numericals in OS!?"
    },
    {
      "id": "mq841ye",
      "body": "how many of gave up ? .....i gave up , just did some numericals , that's it ."
    },
    {
      "id": "mq84vip",
      "body": "you should be asking how many DIDN'T give up"
    },
    {
      "id": "mq85omz",
      "body": "Lil bro, there are numericals in almost every cs subject"
    },
    {
      "id": "mq85t9i",
      "body": "Sounds fun 👍🏼"
    },
    {
      "id": "mq86116",
      "body": "U will have them only in 1 subject though next sem"
    },
    {
      "id": "mq86a50",
      "body": "F. Hate theory \nThanks for the heads up"
    },
    {
      "id": "mq87ejy",
      "body": "Riyal"
    },
    {
      "id": "mq8d2vm",
      "body": "Don't hate it from now only bruh, there will be  some insane theory subjects like os,cn, se, cloud in cs"
    },
    {
      "id": "mq8h1t1",
      "body": "Meeeeeee, this shit so ass nd paper setters gonna fk us up as well"
    },
    {
      "id": "mq8mj9z",
      "body": "Not that I hate theory, \nThe teachers here suck, so most of the learning happens at home for me\nProblem is slogging through 1hr 30 mins of classes each subject looking lost"
    },
    {
      "id": "mqbb1jj",
      "body": "Ty for the tip 🙏 secured 8/40 atleast 😭"
    },
    {
      "id": "mqbiuqa",
      "body": "Tq for your advise , all 4 markers were numericals \nI luv u so much 😭😭"
    },
    {
      "id": "mqcg2ba",
      "body": "Guys me as a senior i understand your frustration esa will be way worse we literally got 1.5 days you guys atleast have 2.5 days study, properly and just get out of that shit hole after that you will start feeling light in the 5 and 6 th semesters, so yeah just get out of it the only time my gpa went down from 8.7 to 8.17 was 4th"
    },
    {
      "id": "mqcg4s0",
      "body": "Guys make short notes for each chapter so you can revise it and remember, but one thing there won't be any relative grading and it Will be tough so prepare accordingly"
    },
    {
      "id": "mqck536",
      "body": "Thank you for the advice 🙏"
    },
    {
      "id": "mqcpgj4",
      "body": "why do you think there won’t beany  relative grading? we got fucked over in 2nd sem just as much as you guys in 4th sem so i hope that doesn’t happen again."
    },
    {
      "id": "mqcssyq",
      "body": "Thanks a lot good sir for your input, we really did get all 4M as numericals ( Altho I couldnt solve one but its on me)."
    },
    {
      "id": "mqd3y5z",
      "body": "Naah man linear algebra and this os won't be having relative grading, it's been happening for like last two years , so yeah"
    }
  ]
}