{
  "id": "1kd55jb",
  "title": "will they kick me out",
  "content": "I'm in 2nd sem and my attendance's not enough for any so they're not letting me write any subjects plus my attendance was fucked last sem too so I have backlogs from 1st sem so overall I'll be withdrawing 10 subjects.how fucked am I \n",
  "metadata": {
    "author": "LankyAd6265",
    "url": "https://www.reddit.com/r/PESU/comments/1kd55jb/will_they_kick_me_out/",
    "permalink": "/r/PESU/comments/1kd55jb/will_they_kick_me_out/",
    "score": 25,
    "created_utc": 1746203025,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mq82y59",
      "body": "Ur cooked, roasted and boiled"
    },
    {
      "id": "mq8faf0",
      "body": "It's not advisable to withdraw so many subjects. Your overall gpa may tank...meaning you need to work harder to be in the same level as your peers. Everyone else would either do every subject or take their backlogs."
    },
    {
      "id": "mq8hirh",
      "body": "Prolly digested into shit alr"
    },
    {
      "id": "mq8k9a9",
      "body": "If u aren't interested in engineering why are u doing it, serious hard question, no one misses so many classes in both the semesters"
    },
    {
      "id": "mq8l2aj",
      "body": "who tf told you I'm in engineering blind fucker"
    },
    {
      "id": "mq8l77s",
      "body": "Then whatever the fuck you are studying mate."
    },
    {
      "id": "mq8lg1k",
      "body": "I know most PPL here may try to be nice, I am being blunt ,u can't fail every course in every semester due to attendance issues if u are interested even the slightest bit."
    },
    {
      "id": "mq8nuwp",
      "body": "ik thanks yo I'm not even into it I'm just figuring stuff out"
    },
    {
      "id": "mq8o56w",
      "body": "Atleast you accept it, i respect that, i thought u were ready to go all ballistic, u better figure things out fast, you will waste time otherwise, and no I don't mean it condescendingly i genuinely mean it so u can make the best of your time. Good luck"
    },
    {
      "id": "mq9bxw3",
      "body": "Ayy Dragon big fan!"
    },
    {
      "id": "mqbla0z",
      "body": "This is fake account just made for some stupid prank ig"
    },
    {
      "id": "mqbm8zs",
      "body": "You got such seniors in 4th sem with hell lot of backlogs, and they are currently club heads too.. they can give proper advice.."
    },
    {
      "id": "mqcipc9",
      "body": "Yeah I am one myself I have 7 backlogs it’s fucked but it’s not like everything is over I’m still getting laid. So chill out homie , stay consistent"
    },
    {
      "id": "mqhxi73",
      "body": "Yes, also with his ridiculous replies too. No offense but the juniors have made a clown of this subreddit. It used to be one of the best subreddits out there."
    },
    {
      "id": "mqitg1c",
      "body": "i mean i kinda side with that person rather cause \n1.yall misogyny fucks just concluded thats a guy\n2.why are most of you so obsessed with sucking pes' dick ur lit paying money for them make them ur slave not be one\n3.life isn't that serious \n4.ur old"
    },
    {
      "id": "mqitw59",
      "body": "exactly that's their vision and they're on reddit so fun"
    },
    {
      "id": "mqiviyd",
      "body": "you literally got dumped so stfu"
    },
    {
      "id": "mqivxtm",
      "body": "Heh?"
    },
    {
      "id": "mqj2ttc",
      "body": "You are kutty dragon uh?"
    },
    {
      "id": "mqjl842",
      "body": "check ur post about how u got dumped like a bitch you failure in life go suck kalayan jewellers dick"
    },
    {
      "id": "mqjo9b8",
      "body": "Ha? Dumped by who? What post are you talking about 😂 u sound like a retard, as for my stocks, brother i am up 400% , tum tera 10k ka khel khel this is big ppls field"
    },
    {
      "id": "mqjpjpn",
      "body": "yeah ur stocks are up so what bet ur dick always down cause u def a northie bihari u prob like it from the back"
    },
    {
      "id": "mqjq0rj",
      "body": "😂😂😂you are funny man, ninige kannadali class kodbeka loafer? I am south indian u retarded fuck, \nOr do u prefer tamil or malayalam or telugu? I know it all\nBengali mf"
    },
    {
      "id": "mqjqf7y",
      "body": "damnn boy u still talking hindi?ooo u like them north indian hitting you from the back?"
    },
    {
      "id": "mqjqjob",
      "body": "Aye chutiye spasth hindi bhi aata hai tere jaise logon ka gaand todne ko, I am multilingual bitch😂"
    },
    {
      "id": "mqjr452",
      "body": "more like multisexual u mean "
    },
    {
      "id": "mqjr77z",
      "body": "more like multi balls in ur mouth"
    },
    {
      "id": "mqjrbdz",
      "body": "I am not the confused bitch \"yo\""
    },
    {
      "id": "mqjrd9z",
      "body": "Swallow those balls for top marks in exams"
    },
    {
      "id": "mqjs8rx",
      "body": "okay\"mate\"bitch u sound bihari and nigga looking why u trying australian"
    },
    {
      "id": "mqjs9cg",
      "body": "bitch you want kcd 2 for free? cant even pirate it you pussy where did all ur stocks money go begging for a giveaway lmao"
    },
    {
      "id": "mqkf7jv",
      "body": "Broo you have like 10 backlogs and you're still out here being an asshole\n\nImagine being this stupid and being a bigot 💔 pick a disability gng 🥀"
    },
    {
      "id": "mqkoal8",
      "body": "Shut ur bitchass up just cause I got backlogs I'm stupid now?not my problem ur so in love with our education system "
    },
    {
      "id": "mqnn6eg",
      "body": "Yeah you are stupid, if you can't write enough nonsense to get passing grade in a place where they give marks for writing anything, in ten subjects, you're very damn stupid "
    },
    {
      "id": "mqnq7z7",
      "body": "i didn't even sit to write dumb bitch that'd be a problem I get it but I only have backlogs cause I withdrew them cause I wasn't allowed to write due to attendance shortage I'm just lazy af "
    },
    {
      "id": "mqnwkhu",
      "body": "Goofball complaining about the education system instead of doing something about his backlogs 🥀 grow up gng, there's nothing you'll achieve by being a bigot on reddit"
    },
    {
      "id": "mqsjiks",
      "body": "Locking thread because what the fuck is happening here.\n\nu/Snoo37787 , stop picking fights with brainrot. You can't win, I've tried. You gave your opinion, they took it. End it there. No need to fight a war cause some kid 4 years younger isn't serious about life.\n\nu/Particular_Alps9053 , you literally have no reason to get involved here. Don't like grads handing out the harsh truth? Leave the sub. We aren't holding you captive. Absolute peak joblessness to spark a comment war.\n\nu/LankyAd6265 , get serious about your life and career, whether its in engineering or otherwise. Figure out what you want to do, head to career counseling, do whatever you need. But spewing toxic comments at each other does not help one bit. You're supposed to be an adult - act like one. Be mature, grow a spine, show some fucking accountability and sort your life out."
    }
  ]
}