{
  "id": "1kg5ult",
  "title": "college decision confusion.",
  "content": "a cse course in an average college or an average course in pesu?",
  "metadata": {
    "author": "According-Cookie-",
    "url": "https://www.reddit.com/r/PESU/comments/1kg5ult/college_decision_confusion/",
    "permalink": "/r/PESU/comments/1kg5ult/college_decision_confusion/",
    "score": 10,
    "created_utc": 1746541630,
    "flair": "Admissions",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mqw2bvq",
      "body": "PES is literally an average college\n\nand what exactly do you mean by an \"average course\"?"
    },
    {
      "id": "mqw3auj",
      "body": "like ece or eee."
    },
    {
      "id": "mqw5311",
      "body": "Nah bro PES isn't average, there's probably 1000s of colleges in india and PES is probably top 50 wrt CSE placements"
    },
    {
      "id": "mqw6d1w",
      "body": "Join PES only if you get CSE. The placement for other courses is almost non existent."
    },
    {
      "id": "mqw7mul",
      "body": "Pes can't be THAT bad right?"
    },
    {
      "id": "mqw7zwr",
      "body": "for most people, the only thing that matters is cse placements, and honestly, that’s the main reason i and many others even joined pes. but i think a lot of juniors here (no offense) overestimate their chances of landing a high-paying job, they don’t realize that it is not quite easy to secure a 20 lpa offer with this massive intake\n\n when you step back and look at the bigger picture- strict rules, ridiculously high intake, fees that don’t add up, subpar teaching, and shit research, pes just doesn’t measure up"
    },
    {
      "id": "mqw9gwq",
      "body": "Aren't these the problems with most colleges in india, sure the high intake might be unique to PES but the rest sounds like most colleges in India"
    },
    {
      "id": "mqw9xl6",
      "body": "yeah. aside from the top IITs, NITs, IIITs, and BITS, everything else is either average or below. that was my original point"
    },
    {
      "id": "mqx4njo",
      "body": "even for electrical related branches ?"
    },
    {
      "id": "mqx5jtl",
      "body": "i was looking to come to pes for ece , you say its not worth it ?"
    },
    {
      "id": "mr1mshp",
      "body": "try msrit ece"
    },
    {
      "id": "mr31r88",
      "body": "i wanted pes as autonomous, msrit is just vtu"
    }
  ]
}