{
  "id": "1kg9vgm",
  "title": "Query regarding admissions at PES RR campus (ECE)",
  "content": "Hi all\n\nAbout 3 months ago I had blocked a seat under management quota for ECE in PES ring road campus.\n\nThey told, though, that theres a cutoff of 80% in boards or else theyll have to discuss and theyll most likely refund the money and not take me in. I'm expecting smth JUST below 80 in boards like a 75 or something, so I really wanna know how hard and fast they're on this rule. Those who've applied thru mgmt - did the PES people actually stick to this hard and fast or did they let you in as long as you blocked the seat and gave the admission fee?",
  "metadata": {
    "author": "Exotic_Definition108",
    "url": "https://www.reddit.com/r/PESU/comments/1kg9vgm/query_regarding_admissions_at_pes_rr_campus_ece/",
    "permalink": "/r/PESU/comments/1kg9vgm/query_regarding_admissions_at_pes_rr_campus_ece/",
    "score": 0,
    "created_utc": 1746551346,
    "flair": "Admissions",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mqy5s20",
      "body": "I think they might use a queue system in this case. They'd likely check how many candidates have applied for the ECE management quota at the RR campus. If there are enough applicants who meet the 80% cutoff under the management quota and all the designated seats get filled, then you might be excluded.\nFor example if there are 100 seats for mgmt ece rr campus and you were the 50th kid to book it but end up securing <80, and post results people get >80 and the number of applicants rise up to 120, then I think youd have to surrender your seat\nAs long as you the seats for mgmt doesn’t fill up you’re good 👍"
    },
    {
      "id": "mr1xz5u",
      "body": "Oh damn so like the cutoff is not for the cutoff itself but to let people in based on whether the applicants generally satisfy the 80% criteria...and so if most have then they get the seat and I don't (in case I don't get 80)?"
    },
    {
      "id": "mr1y8a0",
      "body": "They want ppl with 80+ *only*\nbut when seats are still vacant they’d let ppl less than that get in too"
    },
    {
      "id": "mr1zfm3",
      "body": "Oh like that \n\nAs of today a friend had called PES and they said that RR seats for CSE and ECE are completely filled - so now I'll prolly have to wait till board results come to know the final verdict"
    },
    {
      "id": "mrdkxw9",
      "body": "Its better if you do...because they'd give more priority to those who do score at least 80"
    }
  ]
}