{
  "id": "1kgse26",
  "title": "I just got accepted to PES, but i have a qs, pls helppp",
  "content": "What does this mean? Even if i pay the amount provided (1L+) won't guarantee my admission? On top of that i want to wait till the last date of blocking fee due to christ entrance. Can anyone please provide some guidance 🙏😭",
  "metadata": {
    "author": "fantasyandme18110",
    "url": "https://i.redd.it/25elc5g4nbze1.jpeg",
    "permalink": "/r/PESU/comments/1kgse26/i_just_got_accepted_to_pes_but_i_have_a_qs_pls/",
    "score": 12,
    "created_utc": 1746606926,
    "flair": "Admissions",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mr1840t",
      "body": "Pls someone help pls 😭🙏"
    },
    {
      "id": "mr19zc9",
      "body": "If you block your seat then it's guaranteed, basically it"
    },
    {
      "id": "mr1amyz",
      "body": "When did you get this mail? Counselling starts on 7th June na?"
    },
    {
      "id": "mr1btj6",
      "body": "When the counselling starts and your turn comes up you would have to pay some amount for blocking your seat which is first come first serve basis."
    },
    {
      "id": "mr1zf3k",
      "body": "when did you get this mail?"
    },
    {
      "id": "mr2bgpr",
      "body": "different course ke liye hai woh"
    },
    {
      "id": "mr3kl9t",
      "body": "This is management quota"
    },
    {
      "id": "mr5hanf",
      "body": "What does that mean?"
    },
    {
      "id": "mr7unja",
      "body": "It's not"
    },
    {
      "id": "mrawyoh",
      "body": "management quota is extra fees given to get admission without giving exam."
    },
    {
      "id": "mrcaqvb",
      "body": "i got in for bsc psych after interview. there was no written exam."
    },
    {
      "id": "mrdlrj8",
      "body": "I know only of btech."
    },
    {
      "id": "mrdolgn",
      "body": "If you pay 1L+ you’ve basically blocked your seat, if you don’t you might lose it, but once you pay you are admitted into PES and if you wanna change college to Christ then you’ll have to pay the full 4L fees and leave PES"
    },
    {
      "id": "mrex1rp",
      "body": "I've taken management quota for ECE at PES too, amount alr paid too but - they said 80% boards cutoff (and I'll get something close to that but maybe not that) \nAre they bullshitting (I.e. is my seat still guaranteed), or are they gonna follow that?"
    },
    {
      "id": "mrf3o08",
      "body": "They care about marks in Management? Never heard of that"
    },
    {
      "id": "mrf75v5",
      "body": "Ohk - yeah they do\nNo idea why cuz we blocked this seat a month or so ago - yet these people required this cutoff bs"
    }
  ]
}