{
  "id": "1kgxap6",
  "title": "Manipal banglore or PES (Electronic branch) (for CS)",
  "content": "I'm not really looking for placements since I've heard both are quite similar.\n\nI was wondering how different the college life is between the two and stuff like extracurricular, professors, clubs, people who go there etc",
  "metadata": {
    "author": "Capital-Armadillo793",
    "url": "https://www.reddit.com/r/PESU/comments/1kgxap6/manipal_banglore_or_pes_electronic_branch_for_cs/",
    "permalink": "/r/PESU/comments/1kgxap6/manipal_banglore_or_pes_electronic_branch_for_cs/",
    "score": 9,
    "created_utc": 1746624328,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mr299y8",
      "body": "I have heard that manipal has a better college life than pes, and tbh after seeing the posts in this sub i don't think pes is very fun"
    },
    {
      "id": "mr2a7aw",
      "body": "Isn't Manipal BLR new? Not sure if their first batch has even graduated."
    },
    {
      "id": "mr2gvy2",
      "body": "A small advice to not judge things in that way because, people only raise their voice while complaining. You will hardly find college praise posts lol."
    },
    {
      "id": "mr2hife",
      "body": "Yes and yes they haven’t graduated yet"
    },
    {
      "id": "mr2i86l",
      "body": "Going by that information alone I wouldn't recommend it"
    },
    {
      "id": "mr2mo64",
      "body": "Yeah obviously I am just going off what people say in this sub i will be heading into college with an open mind"
    },
    {
      "id": "mr34m28",
      "body": "Manipal campus is just mind blowing....but not the placements.....it's no where near to PES....I mean even PES both campus are really good tbh....so if I were you...I would go with pes.....I mean...I did have a situation whether to choose RR Campus cse or Manipal cse....chose pes cse....I don't regret it...and I am not the only one here who did this...."
    },
    {
      "id": "mr373ba",
      "body": "dude pes can be really fun if you want it to. people in manipal don't have fun because of manipal,they have fun because they want to. most people who come to pes just imagine its not gonna be fun so they never try and thats when they get buried in coursework."
    },
    {
      "id": "mr3nt89",
      "body": "Oh okay. Yeah I mean the only reason I'd be choosing PES would be that I could avoid hostel. Home would be 30 mins away, but yk the stuff u here in EC campus. 4 suicides is wild. Infrastructure isn't too great at EC campus, it has the old vibe idk but I really don't wanna spend another 4 yrs doing the same thing I did in coaching you know. (Jr college was traumatizing for me)"
    },
    {
      "id": "mr3o0ny",
      "body": "Yeah it is new. Ig ppl go there for just the name but I don't even consider that banglore cus it's really far from the city "
    },
    {
      "id": "mr5x6td",
      "body": "True, I get it...can feel you.....anyways now it's your call....atb"
    },
    {
      "id": "mr75rzd",
      "body": "I'll break it down for you:\n\nManipal BLR: Best Campus, No guarantee on placements but you'll have fun in ur college life\n\nPES ECC: Old/unmaintained campus but big and green, Placements are pooled with PES RR so you're getting the best placements in blr (one of them atleast) and you having fun depends on the peer group you find in ecc, but  competition is intense as fuck and I don't need to brief you about the academic pressure bec yk how it is.\n\n  \nBottom Line, if i were looking to do masters directly after college, manipal blr anyway, enjoy your life, get good grades prep for GRE etc. and go abroad then get placed\n\nif i were looking to get placed right out of b tech, PES ECC is a blind option"
    },
    {
      "id": "mr81vcy",
      "body": "Manipal banglore would be 2 hours away from home and PES is 30 mins. \n\n\nI'm not sure if I'd want to go to hostel which is why PES is on top of my list atm. \n\n\nBut tbh I was looking at RVCE until I realised that's far as well. (I live in Sarjapur)"
    },
    {
      "id": "mr8rtb1",
      "body": "its fancier then RR?  \ni have seen pics it just seems to have more space."
    },
    {
      "id": "mr8saoq",
      "body": "Manipal blr is a massive no no, not a single batch has graduated from there.   \nU can check out main campus sub reddit, they are talking about how the amount of freedom has been reduced."
    },
    {
      "id": "mr8sl5z",
      "body": "ur getting rvce?  \nthen go for it bruh  \nU get better placements then pes and a relatively fun college, my friend there complains about shitty infra tho."
    },
    {
      "id": "mr8uj57",
      "body": "It's luxurious sorted....spacious..."
    },
    {
      "id": "mr90rjd",
      "body": "Location wise it's bad, that's the only concern. And yeah infrastructure isnt that great but PES EC looks old too"
    },
    {
      "id": "mr913e8",
      "body": "Yeah many mentioned PES is good for CSE only (which is the course I prefer). But ove heard that many good profs have left, it's very strict and 4 suicides in the past 9 months or so"
    },
    {
      "id": "mrbanp5",
      "body": "hey bro, i had 97.2 percentile in jm ( 41k rank) i wanted to ask you a few questions since u were in pes, please answer..\n\n1.) can i get cs in pes?  \n2.) what is the average/median package ( roughly) ( it shows just the highest on the website)\n\n3.) how much would it cost roughly thru jee mains?\n\n4.) should i look for other colleges at this percentile ( nit lower branches, some iiit ece, vit cse, lnmiit, thapar) please guide me, im so fkin confused..."
    },
    {
      "id": "mrd7z4b",
      "body": "where u pulled the 4 suicides in last 9 months stats, no suicides since i joined, first year is almost over.  \nIts been years since the good profs left, college is doing fine in terms of placements, profs suck in almost all Indian colleges these days.   \nJust that pesu profs can be a bit like school teachers sometimes ( some of them not all).\n\nThey are chill about some things, like they don't care too much about how u dress, u can grow ur hair they wont rly care. U can skip classes too, just keep it attendance above 75%."
    },
    {
      "id": "mrf2s80",
      "body": "RVCE >>>> PES ECC anyday man, i live in Sarjapur too but I'd gp rvce if I were u, many good pgs for rvce"
    },
    {
      "id": "mumkn9x",
      "body": "Placements done for 2025 batch. Highest package 50 lakhs+. Joint placement for Manipal and Bangalore campus  inBangalore. If you can afford it is worth joining. 800+ students from all over India have joined last year. Also board marks are counted for the ranks."
    },
    {
      "id": "muo0ghf",
      "body": "https://preview.redd.it/vd6tmpsujh3f1.png?width=881&format=png&auto=webp&s=c1062e336b884ba74aba86e69e7330249a2682c8\n\nPeople check manipal placement results"
    }
  ]
}