{
  "id": "1kgyk7w",
  "title": "Guys pls help",
  "content": "Is pes EC students getting shifted to pes RR Branch????",
  "metadata": {
    "author": "Neither_Concert6255",
    "url": "https://www.reddit.com/r/PESU/comments/1kgyk7w/guys_pls_help/",
    "permalink": "/r/PESU/comments/1kgyk7w/guys_pls_help/",
    "score": 3,
    "created_utc": 1746627659,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mr2jj4p",
      "body": "I mean its possible, Idk what u meant to ask"
    },
    {
      "id": "mr2jvbo",
      "body": "i have heard that they are turning pes ec into a medical college\n\nand pes RR is real far from my home....."
    },
    {
      "id": "mr2k01m",
      "body": "thats why they are moving all engineering students to pes rr from pes ec...\n\nthats what i have heard"
    },
    {
      "id": "mr2kzmn",
      "body": "No way, lmao. Rr doesn't have that much space at all."
    },
    {
      "id": "mr2ljip",
      "body": "If a change this big is about to happen then they probably wouldn't even put EC campus in counseling this year dyud. "
    },
    {
      "id": "mr2w3oz",
      "body": "Bro even if its happening it would take 5 yrs min"
    },
    {
      "id": "mr3muqq",
      "body": "That's not gonna happen ANYTIME SOON, dw"
    },
    {
      "id": "mrw600x",
      "body": "Hypothetically speaking, if that happens then, how would the entire kcet thing work?? I mean ec has diff cutoff and rr has diff cutoff, so if ec students are shifted to rr then I dont think it'd be quite right for rr students... Also if that happens can we now consider the shifted ec students as equivalent to rr students???? Anyone please solve my doubt"
    },
    {
      "id": "mrw6bhe",
      "body": "Well,, les assume it happens bro, then do the shifted students get placements equally with rr students?? I mean it has to be mentioned somewhere that they are studying in rr branch right??"
    }
  ]
}