{
  "id": "1kimad3",
  "title": "Scenes at Amaatra Hostel 🇮🇳 (NSFW)",
  "content": "PKMKB",
  "metadata": {
    "author": "Most-Dragonfly-6962",
    "url": "https://i.redd.it/mab53gpl5sze1.jpeg",
    "permalink": "/r/PESU/comments/1kimad3/scenes_at_amaatra_hostel_nsfw/",
    "score": 48,
    "created_utc": 1746806958,
    "flair": "Meme :snoo_dealwithit:",
    "nsfw": true,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mrfw7ci",
      "body": "That’s fucking disgusting. Bunch of war mongers."
    },
    {
      "id": "mrfwycu",
      "body": "That’s fucking disgusting. Please have some humility. War mongers pick sides. Bet they’ve never read a history book their entire life. Cerebral people speculate, and make right characterisations that is just."
    },
    {
      "id": "mrfy2a0",
      "body": "TMKB"
    },
    {
      "id": "mrfzxnn",
      "body": "you are a first year student and have a backlog, clear that first"
    },
    {
      "id": "mrfzzor",
      "body": "shut up"
    },
    {
      "id": "mrg03zh",
      "body": "You are a first year student and have a fucking backlog, clear that first."
    },
    {
      "id": "mrg0kg3",
      "body": "Lol"
    },
    {
      "id": "mrg0l8f",
      "body": "Yeh dil maange more!"
    },
    {
      "id": "mrg20z4",
      "body": "How tf is it even related?"
    },
    {
      "id": "mrg4cd6",
      "body": "You really saw this image and deciphered that op was pro-war? Wow bro. I get that everything in the news is about the \"war\" but take a break sometimes."
    },
    {
      "id": "mrg5jum",
      "body": "Stop creating conspiracies, you fucking twat."
    },
    {
      "id": "mrg7dec",
      "body": "Academically gifted clearly does not mean smart. You’re a good example. You’re not a smart guy are you? Really shows. Fucking low iq retard, with no sense of morality. Common sense is not so common these days huh? Just another fucking twat. Do your npc, anti-pakistan shit, read your dumb notes and go to sleep will ya? Instead of involving yourself in pursuits of free thinkers, intelligent people. Shameless twats like you man i swear."
    },
    {
      "id": "mrg7fh9",
      "body": "Wtf?"
    },
    {
      "id": "mrg8t6u",
      "body": "https://preview.redd.it/1w1hchykisze1.jpeg?width=1080&format=pjpg&auto=webp&s=1ba3d15b3ff7647f9c795b18243d37da2a369a68"
    },
    {
      "id": "mrg8ted",
      "body": "Say what you want. I don’t actually fucking care. I wouldn’t expect much but range from a bunch of low iq war mongers. I really don’t care. Make it as personal as you want, because that’s what low iq people of your capacity are capable of? Clearly. I expected this. Because you posted this, you’re not a smart guy. You’ve never read a history book in your life, and you fucking pick sides. Go ahead. But people like me will point out you’re dumb. You are gonna have to eat that shit. Because you are. Or you can continue to be dumb loudly. Everyone laughs behind your back. Bye. Peace."
    },
    {
      "id": "mrg8ygz",
      "body": "I feel sad for the soldiers fighting day and night for people like you"
    },
    {
      "id": "mrg91dl",
      "body": "https://preview.redd.it/yhqfjicsisze1.jpeg?width=1080&format=pjpg&auto=webp&s=b4fa10227bef62dd91f31990ffee89fe5658d2df"
    },
    {
      "id": "mrg9dd3",
      "body": "Are you fucking dumb? Soldiers are fighting in the first place because of operation sindoor, which chose force, attacked pakistani civilians. If anything war mongers who pick sides(potentially like yourself) , are who should be ashamed of themselves.Here comes another npc twat"
    },
    {
      "id": "mrg9rkt",
      "body": "Bruh. This explains everything. Fucking mindwashed chutiya. Civilians? Terrorists. And Pahalgam?"
    },
    {
      "id": "mrga0n4",
      "body": "They did not just hot terrorists did they? Keep up with the news you fucking brain dead chutya."
    },
    {
      "id": "mrga18u",
      "body": "What the fuck is this. Some dude posted one line you disagreed with and you had a meltdown big enough to write a whole essay. Touch some grass"
    },
    {
      "id": "mrga5ai",
      "body": "Pahalgam?"
    },
    {
      "id": "mrgah09",
      "body": "And with something like operation sindoor, it is quite inevitable to hit civilians. The nature of the process. Which is why, its like choosing war. Which if you had even a little bit of brains, you would recognise. But you dont do you?"
    },
    {
      "id": "mrgaw1z",
      "body": "You really are stupid. Wow. You don’t even know what im talking about. And ure posting pictures of flushing the flags. Arrogant dumb bastards like you are the problem tbh. Just stfu and ho to sleep. Save yourself some energy will ya?"
    },
    {
      "id": "mrgbfiy",
      "body": "u/Due-Flan8470 I wanna meet you and handle you to our ndian forces. During this critical time, catching people like you would be of great help. Instead of supprting our country, you are spreading pro pakistani agenda. Fucking anti national. When enemy will hit your home, talk to me"
    },
    {
      "id": "mrgbzbt",
      "body": "Ppl be doin anything but studying 😭"
    },
    {
      "id": "mrgchlp",
      "body": "Have you considered handing yourself in you fucking retard? If you consider being anti-pakistani, as equivalent to a nationalist, you really are fucking dumb. Take a good look in the mirror will you. You just said “Pakistan needs war and its all fair” are you hearing yourself. Wtf do u got against pakistani civilians man? Since you’re clearly the war monger here, wtf are you doing here in college? Hand yourself in to the war, waste your life, because you quiet selfishly do want other people go lose their lives to some kind of your anti Pakistani fantasy. Another fucking senseless twat wtf. Reddit is full of losers like u these days man. Fucking idiot, with fewer brain cells than a god damn donkey."
    },
    {
      "id": "mrgctrg",
      "body": "Let’s talk irl. DM me. I wanna meet you. Seriously"
    },
    {
      "id": "mrgdg7t",
      "body": "Because you’re too dumb to talk and argue cerebrally? Yeah google what “cerebral” means now. You really are that dumb. Your not smart, but you want to win an argument. So now u wanna get physical? Typical low iq people shit man."
    },
    {
      "id": "mrgekmq",
      "body": "Seeing the number of downvotes clearly shows who’s winning the argument. If you have so much sympathy for your pakistani brothers and sisters, please move there. We don’t want people like you. I really wonder anti nationals of such mentality lie within us."
    },
    {
      "id": "mrgfc8s",
      "body": "Im not pakistani. You dumbass. Highlighting low iq people shit again. Yeah and look at the kind of comments you made. That’s more embarrassing tbh. Just somebody with common sense here. Which rare these days lol. Yeah and your whole life revolved around what other people think didn’t it? Saying that - because you highlighted the number of downvotes which is kinda dumb ngl. Listen, you can lick people’s boot if you want, say whatever pleases them, but thats not me. So I don’t fucking care. But you can continue to care, like uou have your whole life. Lol. Pathetic"
    },
    {
      "id": "mrgrlor",
      "body": "That's fucking disgusting. Please have some humility. War mongers pick sides. Bet they've never read a history book their entire life. Cerebral people speculate, and make right characterisations that is just."
    },
    {
      "id": "mrgv0nk",
      "body": "Do you think we could have prevented war?"
    },
    {
      "id": "mrj6pki",
      "body": "Yeah if modi wasn’t our pm. Mf got us into war 💢"
    },
    {
      "id": "mrjyp6a",
      "body": "sybau🥀🥀"
    },
    {
      "id": "mrjz70c",
      "body": "imagine folding when asked for irl meetup. grow a pair dawg."
    }
  ]
}