{
  "id": "1kjtl0x",
  "title": "branch change!!!!!!",
  "content": "i might join eee at rr campus,but i want to sudy in ece or aiml,can i change my branch after first year.",
  "metadata": {
    "author": "SadChannel9943",
    "url": "https://www.reddit.com/r/PESU/comments/1kjtl0x/branch_change/",
    "permalink": "/r/PESU/comments/1kjtl0x/branch_change/",
    "score": 4,
    "created_utc": 1746941245,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mrpf281",
      "body": "TLDR - Do not join with the expectation that you will be guaranteed a branch switch at the end of first year - there are usually only a handful of seats and you need a really high CGPA. Check the FAQs for more info."
    },
    {
      "id": "mrpfbfk",
      "body": "It's definitely possible if u have a good cgpa. In our batch folks with 7.5 CGPA got CSE in EC campus. Idk what's the current cutoffs tho."
    },
    {
      "id": "mrqdgj7",
      "body": "bro can you tell me, on an average how many seats will be vacant every year and how much cgpa is required to change my branch from eee to ece or aiml."
    },
    {
      "id": "mrqdqur",
      "body": "how much cgpa is required to change my branch from eee to ece or aiml"
    },
    {
      "id": "mrqmc3a",
      "body": "Last year it was 8.6+ for aiml in rr campus. Idk about ece"
    },
    {
      "id": "mrqtmi3",
      "body": ">!Check the FAQs for more info!<"
    },
    {
      "id": "mrqzkug",
      "body": "As I said. Usually there are a handful of seats and you need a very high CGPA."
    },
    {
      "id": "mrr2glq",
      "body": "bro is 9.5 enough"
    },
    {
      "id": "mrr654s",
      "body": "Yes, but can *you* guarantee that you'll get 9.5? Even before joining and seeing how rigorous the exams are?"
    },
    {
      "id": "mrrc9zc",
      "body": "brother can you pls help me with,what are all prerequisites that i should know before joining college, so that i can secure a good cgpa for branch change."
    },
    {
      "id": "mrrfgeu",
      "body": "Search this subreddit. Someone posted this a few days ago."
    },
    {
      "id": "mrv7780",
      "body": "take ece/aiml  wherever u get, don't come with expectation that u will get it in branch change, not worth the risk."
    },
    {
      "id": "mrv78z6",
      "body": "ECE was 8 it seems"
    }
  ]
}