{
  "id": "1kk304j",
  "title": "A small doubt regarding class shuffling",
  "content": "I heard that in 3rd sem the classes will shuffled baes on SRN and also I heard that the people with whom we sit to write isa and esa are the people who will be our classmates in 3 sem because for them too the exam halls are alloted based order of SRN ... Is it true ",
  "metadata": {
    "author": "Living-Cheesecake576",
    "url": "https://www.reddit.com/r/PESU/comments/1kk304j/a_small_doubt_regarding_class_shuffling/",
    "permalink": "/r/PESU/comments/1kk304j/a_small_doubt_regarding_class_shuffling/",
    "score": 10,
    "created_utc": 1746975624,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mrrd2tv",
      "body": "Yes"
    },
    {
      "id": "mrrl983",
      "body": "But we sit with people of different branches right so can’t be our classmates for upcoming sems.."
    },
    {
      "id": "mrrllx9",
      "body": "Nahh broo but most of them like 95 percent are of same branch , try asking anyone in ur exam hall , they will say ur branch and their SRN will be near to urs"
    },
    {
      "id": "mrrqt7q",
      "body": "This means all the 2nd and 3rd round kcet ppl will be together as their srns are towards the end right ?"
    },
    {
      "id": "mrrrd87",
      "body": "SRN is alphabetical order , PRN is admission taken order ,although i might be wrong , coz pesu keeps interchanging SRN with PRN and PRN with SRN for different batches"
    },
    {
      "id": "mrrsosj",
      "body": "3rd sem onward you will have the same classmates. Maybe diploma ppl will join you in the 5th sem. During the electives is only when you will have different classes. Ull stay with same class for 4 semesters. It will be according to srn."
    },
    {
      "id": "mrrtyy5",
      "body": "Ig both are admission order wise.. srns of 3rd round ppl in my class are together "
    },
    {
      "id": "mrvhita",
      "body": "Nope SRN is alphabetical order wise. This is why they take a month or so to generate SRNs for each new batch every year. They have to wait till all admissions are done."
    },
    {
      "id": "msb2umo",
      "body": "most will remain"
    }
  ]
}