{
  "id": "1klm6d0",
  "title": "Scholarship money",
  "content": "Have people received their scholarship money from Sem 1 yet?",
  "metadata": {
    "author": "Winlett",
    "url": "https://www.reddit.com/r/PESU/comments/1klm6d0/scholarship_money/",
    "permalink": "/r/PESU/comments/1klm6d0/scholarship_money/",
    "score": 11,
    "created_utc": 1747143529,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ms3adr9",
      "body": "Mee"
    },
    {
      "id": "ms3apvz",
      "body": "I haven't"
    },
    {
      "id": "ms3edq2",
      "body": "Kcet students and a few pessat students have received it. Rest of them r yet to receive"
    },
    {
      "id": "ms3wzgf",
      "body": "Physics cycle PESSAT students haven't got it"
    },
    {
      "id": "ms3z8s1",
      "body": "I also didnt get yet"
    },
    {
      "id": "ms6gacb",
      "body": "Perhaps your bank details might be messed up, reach out to Coe and accounts department.. or your class incharge"
    },
    {
      "id": "ms96vl8",
      "body": "Wait ,do they give students scholarship based on their scores??? Could you elaborate please, ??I'll be joining pesu in no time , so it'd be better to know bout it"
    },
    {
      "id": "ms9milt",
      "body": "https://pes.edu/admissions/scholarships/"
    },
    {
      "id": "msh0znm",
      "body": "Done that. They told they will give money in 2 weeks. Its been 3 almost now"
    },
    {
      "id": "msh2a2g",
      "body": "I gone thru it, but they only mentioned top 5℅ of studnets, is it 5 percebt of all students(mech+cse+bt+spec) or 5 percent of each, (5% of mech,5%of cse ,5% of bt etc)???"
    },
    {
      "id": "msh2mnq",
      "body": "Not only top 5 even the next 20 also get the scholarship..\n\n>top 5℅ of studnets, is it 5 percebt of all students(mech+cse+bt+spec) or 5 percent of each, (5% of mech,5%of cse ,5% of bt etc)???\n\nFor first year its top x percent of all and for the next two yrs its top x percent of ur branch.."
    },
    {
      "id": "msh2ubt",
      "body": "Thanks , btw,Is it applicable if  a students has changed branch from Ecc to rrc or changed their branch of subject.?"
    },
    {
      "id": "msh58fi",
      "body": "Yeah irrespective of wteva you've gone thru"
    },
    {
      "id": "mvirugu",
      "body": "Will we get the scholarship every year? Like every year someone stays in the top 5 or 20 percent or just once?"
    },
    {
      "id": "mvis6vj",
      "body": "Every semester. It's not just a one time thing"
    },
    {
      "id": "mvyiah1",
      "body": "The fee of btech on website is 5 lakh for a year. Is the full 5 lakh is considered as tution fee and will get 2.5 lakh back. Is this how it works?"
    },
    {
      "id": "mvyri4i",
      "body": "Yeah you'll get the whole 2.5l back no catch nothing"
    },
    {
      "id": "mvyti2m",
      "body": "Intresting, how much did you score and how much did you got ?"
    },
    {
      "id": "mvyu44d",
      "body": "I'll get doxxed if i reveal my gpa, i cleared the cnr cutoff and received 26k (20% of 1.3l)"
    },
    {
      "id": "mvyvrpo",
      "body": "Oh ok, I think it's work on semester wise gpa. 5 lakh per annum fee , you will get 1.25 in first sem. and 1.25 in second sem.... Isn't it ... Btw I have heard that they doubled the fee for non karnatka studentsz is it true like you said out of 1.3 lakh you got 20 percent back"
    },
    {
      "id": "mvywf0m",
      "body": "Yes, and for non-Karnataka students ir people thru mains/pessat, the fee was 5 lakh even last year so nothing like doubled or smtg"
    },
    {
      "id": "mvz722w",
      "body": "Ok, anyways thanks for sharing info.. hope next time you will be in mrd scholarship for 50 percent fee back 😊"
    }
  ]
}