{
  "id": "1kn1m30",
  "title": "URGENT : placements",
  "content": "I worked Hard and got my cgpa 7+ last sem now after this sem it looks like it’ll fall and it’ll fall to 6.97 \nbtech cse how fucked am i for placements (female) \nPLEASE PLEASE REPLY!!",
  "metadata": {
    "author": "Frequent_Umpire8571",
    "url": "https://www.reddit.com/r/PESU/comments/1kn1m30/urgent_placements/",
    "permalink": "/r/PESU/comments/1kn1m30/urgent_placements/",
    "score": 16,
    "created_utc": 1747291310,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mseqp6z",
      "body": "U are cooked to be honest, look for offcampus for better opportunities"
    },
    {
      "id": "mserb6z",
      "body": "don’t say that I’ve heard from a lot of my seniors They landed jobs at T1 companies with 6.5 and all cgpa females too IDFC and all 19LPA"
    },
    {
      "id": "mserslh",
      "body": "Yeah, I've heard of people getting placed with a 6.5 CGPA too, but I'm not sure how true that actually is."
    },
    {
      "id": "mses8r4",
      "body": "I’ve seen 2-3 examples in my circle like seniors"
    },
    {
      "id": "mset6wa",
      "body": "I am a 2024 grad with T1 offer, I personally don’t know anyone with 6.5 cgpa who got a T1 offer , most of my friends with 6.5-7 cgpa got T3 offer"
    },
    {
      "id": "mseta57",
      "body": "I can’t name them here but one is in a bank and one is in a leading MNC"
    },
    {
      "id": "msetht4",
      "body": "yep that bank is societe generale, yes u might get T1 offer but the probability is very less, so try your best"
    },
    {
      "id": "msexogb",
      "body": "What is the cgpa above which reasonable number of ppl get t1"
    },
    {
      "id": "mseyye3",
      "body": "Even IBM i think ?"
    },
    {
      "id": "msf2t0s",
      "body": "Above 8 is safe for T1"
    },
    {
      "id": "msf4j94",
      "body": "Not massively cooked since you’re a female but please get it above 7 asap at any cost."
    },
    {
      "id": "msf6fn8",
      "body": "try to touch 7 CGPA if possible"
    },
    {
      "id": "msfeorp",
      "body": "Which branch?"
    },
    {
      "id": "msfms1r",
      "body": "Wait seriously? A 8cgp has a fair shot at t1 if they have gud dsa enal?"
    },
    {
      "id": "msg8bbd",
      "body": "Not sure why you aren't believing the comments which day that you're going to have a hard time. If all you want is validation, you shouldn't have asked a question. \n\nHere's the harsh truth - your GPA is low. It barely meets the eligibility criteria to sit for placements. You're not really in an advantageous position here. Most companies will filter you out at some stage or the other. If you aren't filtered out to write the test, they'll filter you while shortlisting for interviews. And about the examples you quote - they're exceptions, a handful among the hundreds with a low CGPA who are struggling to land a single offer. \n\nThe question is, are you in that exception, or are you in that handful? Only you can answer that. Not saying you don't have a shot - but you're going to have a very uphill struggle. There's no point living in your daydream that you're going to have it all easy. The sooner you wake up and realise that instead of countering facts, the better for you. Good luck."
    },
    {
      "id": "mshtai6",
      "body": "Hey thanks for the reality check, I’m good with DSA like I’ve solved around 250 on leetcode and will do more in summer fully grind also I’ve projects like good insdustry level projects too \nI don’t doubt my calibre last sem too i got interview on campus 31LPA PPO but i got rejected in 2nd round"
    },
    {
      "id": "mshtbj2",
      "body": "Cse"
    },
    {
      "id": "mshyi3c",
      "body": "THIS. This is the only real answer.🙏\nBeing at almost the same cgpa range as OP , it takes so much effort to get a decent internship as compared to someone with 8+ gpa, you would just get filtered out even if you feel you are better in other aspects.\nThe placements are still going on (2025 batch) and i still see people less than 7 gpa unplaced. NOT saying all the people who have less than 7 gpa are unplaced.Most of them come under 7."
    },
    {
      "id": "mss8dlp",
      "body": "Ya i just want to be placed even if T3"
    },
    {
      "id": "msy92ue",
      "body": "It can happen. I had 6.5 and I currently have a 1L internship (hoping it converts)🤞"
    },
    {
      "id": "msy9828",
      "body": "Thankyou so much this came in a moment i needed the most how much DSA did you do ? I’ve currently done till greedy"
    },
    {
      "id": "msyapke",
      "body": "Please don’t let my comment make you complacent and distract you from the fact that anything below 7 is dangerous. I still consider my selection a miracle. \nAs for DSA, frankly I didn’t have to do much as i had exceptional co curriculars that helped me get a product-tech role."
    }
  ]
}