{
  "id": "1kn4g6a",
  "title": "RVCE or PES (EC branch) both for CSE",
  "content": "Im just wondering which one is better. I'm probably gonna try for masters in US (alr did for UG and gonna try again) so im not sure which would suit me better.\n\nI've heard a lot of downsides in both universities especially regarding infra, proffesors and the college life.   \nYou could argue about them here as well. ",
  "metadata": {
    "author": "Capital-Armadillo793",
    "url": "https://www.reddit.com/r/PESU/comments/1kn4g6a/rvce_or_pes_ec_branch_both_for_cse/",
    "permalink": "/r/PESU/comments/1kn4g6a/rvce_or_pes_ec_branch_both_for_cse/",
    "score": 2,
    "created_utc": 1747303356,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "msfdvq3",
      "body": "Rv cse"
    },
    {
      "id": "msfeznq",
      "body": "RVCE CSE anyday"
    },
    {
      "id": "msfja45",
      "body": "If your aim is to study abroad go with the one that has easier studies so you can get a higher GPA.\n\nThat would be RVCE I guess."
    },
    {
      "id": "msfmggc",
      "body": "Rvce cs"
    },
    {
      "id": "msfxkvp",
      "body": "And with what aim would you suggest PES?"
    },
    {
      "id": "msg90m1",
      "body": "If you're a masochist /s"
    },
    {
      "id": "msqpdjq",
      "body": "Bruh, i aint even worth answerung, altough pes can give tough competition to rvce, but at the end of the day when u see populartiy of colleges inaborad,its rvce, i read that some colleges skip interview for students who studied in rvce when they apply for masters (if i come across that post ill provide u with link )"
    },
    {
      "id": "msqrnsn",
      "body": "I don't think it works like that. Most universities in the US don't conduct interview, an application through commonapp is enough. Although for certain universities like Stanford or Brown you'd need to have an interview after passing through the initial application. (Some students directly get in that's because their stats must be really good). \n\n\nRVCE might be good because it probably is easier to score than PES. Although I've heard about all the other cons like getting little to no holidays and stuff like that. The only reason I'm choosing PES at EC is so that I could go back home everyday rather than staying in hostel. (RVCE is 1hr 15 mins away)"
    },
    {
      "id": "msryb97",
      "body": "Welp, u heard my word ,at last the choice is yours bruv, btw I'm kinda surprised that u dont belong to that kind of people who desperately trying for rvce (, cse mainly, as they are overhyped)"
    },
    {
      "id": "msv4kta",
      "body": "This is absolutely incorrect. If you are talking about MS admissions, then 99% of unis do *not* have an interview process. Only PhD requires an interview process, and *all* unis need an interview for their PhD applications.\n\nAnd speaking of popularity - being from RVCE or PES does not have any significant benefits since they are treated the same. Unless you are from IIT/NIT/BITS/IISc, you aren't going to be treated differently. And once you do end up there, nobody cares where you came from."
    },
    {
      "id": "mswgfcz",
      "body": "Yeah I were right bout interview thing, I confused it to somethi ng else"
    }
  ]
}