{
  "id": "1kncz77",
  "title": "Management scholarship",
  "content": "Do management quota people also get mrd and cnr rao?",
  "metadata": {
    "author": "Formal_Obligation753",
    "url": "https://www.reddit.com/r/PESU/comments/1kncz77/management_scholarship/",
    "permalink": "/r/PESU/comments/1kncz77/management_scholarship/",
    "score": 5,
    "created_utc": 1747327524,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "msh5rae",
      "body": "yes"
    },
    {
      "id": "msh7hto",
      "body": "How does it work? Is x% of the total fees refunded or only a portion of it?"
    },
    {
      "id": "mshiqsk",
      "body": "x% of total fees \n\nIf you pay 10L you get 1.95L for CNR and 2.4L for MRD"
    },
    {
      "id": "mskowjd",
      "body": "This is how it works you get the same scholarship as the rest of them because you get the 25% of the tuition fees, not your whole management fee"
    },
    {
      "id": "mskvd07",
      "body": "What's the tuition fee?"
    },
    {
      "id": "msl05sx",
      "body": "Whatever the tuition fees that a guy through pessat pays, that's the same tuition fees a management guy pays, this is what I heard it goes down like, so you get the same scholarship as a pessat guy"
    },
    {
      "id": "msl0g8k",
      "body": "No\nManagement fees is more than pessat fees"
    },
    {
      "id": "msl0wmh",
      "body": "Bro break it up in that the tuition fees would still be 4.1lakh or whatever your batch has rest will be under some other name , like for 22 batch our tuition fees is 3.6 and the exam fees is 50k so combine 4.1"
    },
    {
      "id": "msli4e9",
      "body": "Pessat people who got CNR got 40% of total fee"
    },
    {
      "id": "msmxw9u",
      "body": "if you are in the top y% of the batch you get either mrd or cnr- mrd being 50% of ur fees and cnr being 40% ig"
    },
    {
      "id": "msohewh",
      "body": "Bro that they have changes it in 23 october, that's fine the point I was trying to say that in management let's say there's 10 lakhs, only 4.1 will be college tuition fees, and that will be considered for the scholarship, in 2023 they changed the rule to 40% if the total tuition fees now I got 82 k instead of 72 I used to get, whole whole I was trying to make it a management gets scholarship he/she gets the same as I do as a pessat check it with your management Friends if anyone ends up getting it"
    },
    {
      "id": "msq8nsf",
      "body": "Look before it was tuition fee now it's total fee and total fee of management student is 12 lakhs... I dont know any MQ friends who got cnr..."
    },
    {
      "id": "msrgc9i",
      "body": "I don't know one who has got scholarship to get it cross checked, but this is what a teacher said a year ago, that might be wrong, so yeah"
    },
    {
      "id": "nffm4zv",
      "body": "Do they give scholarship to 1st year? Or we have to apply for scholarships from 2 year ?"
    },
    {
      "id": "nffmekv",
      "body": "yes you get scholarship in first sem itself- and it is based on top 25% or 5% of the people in your cycle"
    },
    {
      "id": "nffmmfn",
      "body": "After ESA ? And what is the process of scholarship ?"
    },
    {
      "id": "nfft5dt",
      "body": "process as in?? if u r from kcet pay the extra 10k, write ur isa and esa and wait for result if you have gotten over the gpa cutoffs you qualify and receive the scholarship after a month or so (after results being announced)"
    }
  ]
}