{
  "id": "1knv2lx",
  "title": "In a very weird situation right now, pls help!",
  "content": "I have the option of pursuing Computer Science at PES University through the management quota, and at Manipal University Jaipur (I know it's kind of a bad comparison, but please hear me out). My overall goal is to go abroad for my master's. Would you recommend PES University? The total fees would be around ₹56 lakh for four years. I don't really have any other options. I am not really sure how much your undergrad college would matter when applying for masters. ",
  "metadata": {
    "author": "iamwinningthis",
    "url": "https://www.reddit.com/r/PESU/comments/1knv2lx/in_a_very_weird_situation_right_now_pls_help/",
    "permalink": "/r/PESU/comments/1knv2lx/in_a_very_weird_situation_right_now_pls_help/",
    "score": 0,
    "created_utc": 1747380898,
    "flair": "Admissions",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "msl9rf7",
      "body": "Go to a college where you can easily get a good cg pes is definitely not recommended for a good cg"
    },
    {
      "id": "mslhpzm",
      "body": "Check out affiliated colleges, their exams are easier than ours."
    },
    {
      "id": "msm6lfy",
      "body": "if you are okay with paying the management money, check BMS or other VTU colleges if CGPA is your main point. It is easier to maintain a higher cgpa in VTU affiliated colleges. \n\nPES is an okayish college(would not recommend it for 56 lakhs for sure) but it takes a good amount of effort to maintain a decent/good cgpa(8.5+)"
    },
    {
      "id": "msmf7ki",
      "body": "Is academics in pes easier than in rvce ?"
    },
    {
      "id": "msmjmbo",
      "body": "Rvce is vtu affiliated too\nVru colleges have easier papers and more lenient correction"
    },
    {
      "id": "msoh8gt",
      "body": "Try for BMSCE, easier to maintain gpa when compared to both PES and MoneyPal. The fee structure in the management quota is similar to PES."
    }
  ]
}