{
  "id": "1kosqh1",
  "title": "Planning to join for BCA this year, How's everything?",
  "content": "Hello, I'm a very passionate and skilled programmer who's worked on related high-end projects for a while now.\nI'm planning to join RR Campus for BCA this year. At first glance: the infrastructure, the facilities(basketball court, badminton court, gym, etc) seemed pretty cool. There seems to be a decent amount of hangout spots within the campus aswell.. the food court is pretty huge.\nBut, I'm not sure what the staff is like.. the teachers.. the timings.. and so on. I would like to know more information about this.\nI've heard about how hectic the CSE life is in there, I doubt it'll be that hectic for BCA..? Would surely love to hear about it from you guys directly.\nI'm also really interested in the campus life (hackathons, clubs, and fests) But I'm unsure about if all of this is there.\nPlacements dont seem to bother me right now, I have my own plans.\n\nWould really love to hear from you guys asap.",
  "metadata": {
    "author": "programmingxpert",
    "url": "https://www.reddit.com/r/PESU/comments/1kosqh1/planning_to_join_for_bca_this_year_hows_everything/",
    "permalink": "/r/PESU/comments/1kosqh1/planning_to_join_for_bca_this_year_hows_everything/",
    "score": 2,
    "created_utc": 1747487706,
    "flair": "Admissions",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "msws0s4",
      "body": "if you have the choice of joining universities like Christ ( ie they have a name ) for bca, id suggest you take that up.\n\nmost of the professors and staff are okay but the department doesnt bother much about bca students. They're more focused on mca and mca placements. bca students are treated like an afterthought for everything. their first priority is always mca.\n\nas for hackathons and stuff, you'll definitely have in department as well as campus wide opportunities but considering bca is relatively new in the uni ( yours would be the third batch ) we aren't really thought of / considered outside of our own department. you'll have to make opportunities for yourself. \n\nthe syllabus is also constantly changing. dont go by what they show on their website because besides semester 1 theyve not stuck to any of it. what my batch has is completely different from what our juniors have.\n\ntimings are standard uni timings. full days are 8-4 during odd semesters and 8:45-4:45 during even semesters ( same as the dept of engineering ). usually full days are only 2x a week.\n\ni cant say anything about placements because my batch will be the first to sit through them in the coming semester. things aren't looking really good for us because they were struggling with mca placements the last two years and when we asked about ours they gave us very vague answers. faculty advisors will urge you to continue with mca in the department rather than look at placements 🤷🏻‍♀️"
    },
    {
      "id": "mswtmt1",
      "body": "Thank you so much for your response. Sounds good enough I guess. Is life hectic, or do you get time for yourselves too"
    },
    {
      "id": "mswv1qt",
      "body": "it only gets hectic the 1-2 weeks before exams because they pile on assignments and everything last minute on us. besides that as long as you're up to date with your coursework and stuff i wouldn't say it's hectic, in fact it's pretty decent! you get time for yourself"
    },
    {
      "id": "msxasv6",
      "body": "Please don't join here for bca \nTry other colleges like Joseph's or claret or something \nWhere the management is chill"
    },
    {
      "id": "msyjvwq",
      "body": "Bruh, what did you study may I know?? Cuz I think people join to bca after 12th, while you are claiming to have worked on high end project, so I'm asking ?"
    },
    {
      "id": "mszefyi",
      "body": "Is pessat required for this as well? Also, from the website it also seems that pessat slots are available till july, does that imply that you could get admission for BCA till the last pessat slot?"
    },
    {
      "id": "mt2kqn1",
      "body": "pessat for us was just an interview. \n\nif slots are available till july i'm sure you have a chance of getting in considering last year they had students who joined midway through first sem ( i think they were on waitlist ). semester starts in august."
    },
    {
      "id": "mt3tmm6",
      "body": "Thanks a lot! That was a relief to know. If you don't mind, can I dm you? Have some more questions about the course"
    },
    {
      "id": "mt3ws1q",
      "body": "sure"
    },
    {
      "id": "mtvmgzq",
      "body": "Yes, I have finished my 12th this year, while also working on huge projects using reactjs, python, aws, docker, and ai extensively since a long time. Who told you that you can't work on projects while in school? It's all a hobby to me."
    },
    {
      "id": "mtvmzko",
      "body": "Those ones are pretty good for commerce i think. But, I am looking for a tech focused environment. By management do you mean the staff or the fees..? \nI've taken the admission today anyways. 🥲"
    },
    {
      "id": "mtvn8r2",
      "body": "thank you for your response. I took the admission today, hope I don't regret it. 🥲\nInterview was pretty easy"
    },
    {
      "id": "mtvnfqb",
      "body": "slots are pretty much over, i had gone to the admission office today."
    },
    {
      "id": "mtw6g0l",
      "body": "I did my bca in Joseph's and now masters here in pes \nI can see both the environments \nAnd can surely tell it's hella stressful here for bca too\nIf you want good education plus a good time join Joseph's \nYou'll thank me"
    },
    {
      "id": "mtyek5u",
      "body": "Will plan for MCA in Christ, since I've already taken admission for BCA at pes"
    },
    {
      "id": "mu28c22",
      "body": "Hey mate can you help me with the interview? What kind of questions did they ask you? A lot of people are saying it was easy but I'm still feeling a bit tense. Also do we need to show our 10th and 12th marks as a PDF or screenshot? And do they ask for a portfolio I have one, but it's not that great. If they're asking for it I can work on improving it tomorrow"
    },
    {
      "id": "mu43lps",
      "body": "They'll ask you what all programming languages you know, and from those languages they will ask basic questions like \"What is OOP\" \"Types of Lists\" etc\nNo they didn't ask for 10th or 12th marks nor portfolio. Don't worry about it, they only mentioned it on thier pdf for name sake. My interview hardly lasted 2 minutes.\nGood luck, See you in the campus!"
    }
  ]
}