{
  "id": "1kozfe4",
  "title": "No second chance huh?",
  "content": "Even if u fuck up one sem it's a goner right? No hopes at all. I am in the lesser part of 7 GPA rn and 2nd sem. I am an average student but really see no hope at all rn. It's gone. Good grades are a dream.",
  "metadata": {
    "author": "manwithgoldenballs",
    "url": "https://www.reddit.com/r/PESU/comments/1kozfe4/no_second_chance_huh/",
    "permalink": "/r/PESU/comments/1kozfe4/no_second_chance_huh/",
    "score": 20,
    "created_utc": 1747505641,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mstzna2",
      "body": "Some people make a comeback in 2nd year with cs subjects so still there is a chance and u haven't even given one isa and esa for 2nd sem so why lose hope"
    },
    {
      "id": "msu2g18",
      "body": "I am not going to sugarcoat it but you do realise the fact that you brought this upon yourself, right? The only thing that you can do is to just do your best in the upcoming exams. Also pls don't be so hard on yourself ffs🙏"
    },
    {
      "id": "msu3r42",
      "body": "Fingers crossed I guess"
    },
    {
      "id": "msu3vvd",
      "body": "I do realize but my fucking dopamine addicted brain can't get off the phone. Idk wt to do. Feel like walking away from everything"
    },
    {
      "id": "msu518b",
      "body": "Just imagine what's gonna happen if you continue to be like this and then the results don't turn out to be the way you wanted. Wakeup call hai bhai, padhai chalu kardo"
    },
    {
      "id": "msudnot",
      "body": "I happen to be an average student as well, in my 8th semester. I started off with a GPA in the low 7's and now I currently sit at mid 8 CGPA. It's definitely possible to turn things around for the better, if you just put in a lot more effort than you did in the past 2 semesters. Don't beat yourself up over what's done already, focus on improving yourself to make sure you don't repeat the same mistakes again."
    },
    {
      "id": "msw9wig",
      "body": "Can I make a comeback for isa 2 and esa? With remaining time?"
    },
    {
      "id": "mswe8ip",
      "body": "yeah why not."
    },
    {
      "id": "mswf91g",
      "body": "This is good to hear bro. Thanks."
    },
    {
      "id": "mswiga0",
      "body": "Yes 70% of your grade is still in your hands"
    },
    {
      "id": "msxeu62",
      "body": "I’m a 2023 pass out , believe me getting less marks in one sem , is not that bad , you can make up for it in the upcoming semesters"
    },
    {
      "id": "msychit",
      "body": "You're going to have to make conscious efforts. Keep your phone aside, put a time based lock on it - whatever helps. Unless you make conscious changes to your lifestyle, it will affect you. Atleast you're aware about the problem. Now you need to put in the effort to stop it."
    },
    {
      "id": "msynnjv",
      "body": "Let's try our best bro that's it. It is what it is"
    },
    {
      "id": "msyo27r",
      "body": "Is it really? I mean if one is skilled in his/her domain it is nice and doable. But I don't feel confident at all😭"
    },
    {
      "id": "mszt96h",
      "body": "You're still in first year...you have time. Just make sure you dont' get any grade below C"
    },
    {
      "id": "mt2n01n",
      "body": "I was in higher ends of 7-8 till 7th then I graduated with 8.12 Im grateful 🥲"
    },
    {
      "id": "mt2p0kz",
      "body": "I have now put timers and trying to control. Wish me luck 🤞"
    },
    {
      "id": "mt4964o",
      "body": "Placement?"
    },
    {
      "id": "mt4c8wi",
      "body": "Off campus xD I’ll say I got the best offer in cybersecurity at least"
    }
  ]
}