{
  "id": "1kq697n",
  "title": "Will I get blacklisted?",
  "content": "TLDR : applied for mca interview,rejected due to technical and skill issue 💀) mailed college if I can try again but they said no but I can technically apply again with a different email will that get me blacklisted?\n\nI applied for MCA and I got rejected (The interviewer couldn't hear me properly and I tried my best to be loud and another thing is apparently I gave only like 2-3 lines explanation and i'm supposed to answer stuff in detail)\n\nMy friend says apply again the worst thing that can happen is you lose 1200 rs but my bro said i might get blacklisted if I do cause I already applied once \n\nOr should I go directly to college and ask for management seat (everyone says management seats are there they just never tell how) or just wait for pgcet? \nWill doing this stop me from getting admission through pgcet also?\n\n",
  "metadata": {
    "author": "Financial_Seesaw6427",
    "url": "https://www.reddit.com/r/PESU/comments/1kq697n/will_i_get_blacklisted/",
    "permalink": "/r/PESU/comments/1kq697n/will_i_get_blacklisted/",
    "score": 7,
    "created_utc": 1747641868,
    "flair": "Admissions",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mt3ah8j",
      "body": "Guys please answer 🙏🏻"
    },
    {
      "id": "mt3tmbt",
      "body": "DW they won't blacklist apply again just that if you get the same interviewer then you might get in some trouble otherwise it shoudl go on buisness as usual."
    },
    {
      "id": "mt3ux6g",
      "body": "No like someone said they'll have your details and all so don't apply again"
    },
    {
      "id": "mt4f8f0",
      "body": "Exactly they only have you as a reference number in their system, once you get a new reference number you're a new person to them as simple as that...."
    },
    {
      "id": "mt4mecq",
      "body": "But the rest of my details will be the same right? won't they cross check that\n\nIt's still letting me use the same number too just asks for a unique mail id"
    },
    {
      "id": "mt5frpb",
      "body": "try toh kr bro hogi jo dekhi jaegi"
    },
    {
      "id": "mt8zjt3",
      "body": "Bhai Check my update"
    },
    {
      "id": "mt9bxrr",
      "body": "Dw give the interview as if you're giving it for the first time you're not cooked you just took advantage of a loophole which should be fine..."
    },
    {
      "id": "mt9cgjb",
      "body": "Should I still give the same number or a different number because I left the number half filled cause I still wasn't sure that's why they called me today\n\nIs it fine cause they themselves were expecting me to fill it again she just said book the slot again so I think they're expecting me to fill it again anyways?"
    },
    {
      "id": "mt9crvt",
      "body": "doesn't matter atp, cuz they're EXPECTING you to fill AGAIN"
    },
    {
      "id": "mt9dcpo",
      "body": "Alright 😭 ill use the same number but if they ask why I'll tell them i attended last time but the teacher couldn't hear me properly and the zoom call was cut short ig that's why i'm applying again (which isnt technically false)"
    }
  ]
}