{
  "id": "1kqubp5",
  "title": "Application to 1st Round Counselling Jee Main Mode",
  "content": "Is the date to apply for 1st round counselling over? I cant see a definitive date on the site just May 23 as date of jee main rank list announcement",
  "metadata": {
    "author": "rynmuneer",
    "url": "https://www.reddit.com/r/PESU/comments/1kqubp5/application_to_1st_round_counselling_jee_main_mode/",
    "permalink": "/r/PESU/comments/1kqubp5/application_to_1st_round_counselling_jee_main_mode/",
    "score": 7,
    "created_utc": 1747708881,
    "flair": "Admissions",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mt8ktu8",
      "body": "https://preview.redd.it/bsm5uuk2wu1f1.jpeg?width=1080&format=pjpg&auto=webp&s=8d48050adfd98833e3e3eb3f50ce6114c8ca177a"
    },
    {
      "id": "mt8l0iu",
      "body": "Yea i checked this doesnt have closing date for application"
    },
    {
      "id": "mt8lemw",
      "body": "If u r selected in the general merit list the clg will contact u wid counseling"
    },
    {
      "id": "mt8lml4",
      "body": "Yea but im asking if application for round 1 is still open. If i apply now wud i be considered for round 1 or only for round 2"
    },
    {
      "id": "mt8mvbo",
      "body": "According to jee mains first attempt, a merit list had come.. Now 23rd final merit for jee mains will come... So if u apply now idt it would be a problem... Ur percentile matters too.. Only then it's worth through mains.."
    },
    {
      "id": "mt8pk6p",
      "body": "Aight thanks. I have 94.56 perc do u think i have a chance to get cse"
    },
    {
      "id": "mt8pv71",
      "body": "Got 94.8 didn't get anything in the first merit list.. I don't wanna hv hopes in the final merit list"
    },
    {
      "id": "mt8q0c4",
      "body": "There's preference list and everything.. First merit list they messed up real bad.. Hopefully they do it better dis time"
    },
    {
      "id": "mt8q6pl",
      "body": "Huh how tf i found ppl w 92 and 93 who got cs on this sub"
    },
    {
      "id": "mt8qite",
      "body": "That's what they hv messed it up.."
    },
    {
      "id": "mt8qu55",
      "body": "Oh shit man unlucky. Those ppl w 92 93 really hit the lottery"
    },
    {
      "id": "mtmlp4v",
      "body": "Bro did u apply? Is the application process still on?"
    },
    {
      "id": "mtmppar",
      "body": "I did. I called em and asked and they said yesterday (may 21st) was the last day. Try calling them asap"
    }
  ]
}