{
  "id": "1kqyu00",
  "title": "the review system in pes is so damn rigged bruh",
  "content": "the software is so ass, you get 5 minutes per paper and the software takes like 4 minutes just to load the damn pdf, like bro how the fuck are you an engineering college but cant loadbalance a LOCALNETWORK cdn\n\nsomehow the college is just incapable of making a web interface that works, wether it be pesuacademy, or review software, or payment portal, somehow the only software they built that somewhat works is the damn assessment software, but the moment it comes to building something even 1% more complex than a glorified google forms application, and the college IT team falls like a house of cards before a hurricane\n\nfor ISA1 i had gotten 22 marks in computer networks, and when i went for review, it turned out that the college hadnt even bothered checking the answers i handwrote, my score ended up getting increased to a 31.5\n\nsame story for ISA2, dude. how fucking hard is it? arent yall post graduate computer science majors? shouldnt this be cakewalk for you? if it really isnt then hire one of the clubs to do it bruh, at least betterpes doesnt crash\n\nand just the fact that mistakes worth 9.5 marks are even possible makes me no longer trust the ESA grading system, because just to SEE the paper you have to hork up like 5 months of rent\n\nlike dude, how about, you let me SEE what you did, and then if i want a review, THEN you can ask me for money\n\nbut being this damn unwilling to reveal what you did in the corrections, when mistakes of this size are apparently POSSIBLE, makes the system so damn shady\n\n\n\ni remember jawahar said during one of his many yap sessions that he calls speeches that the exam correction scheme is transparent and they dont try to hide things\n\nWELL THEN, LET ME SEE WHAT YOU DID NO? IF YOU REALLY TRUST YOUR CORRECTION THAT MUCH YOU WOULD SHOW ME THE ANSWER PAPER FOR MORE THAN 5 MINUTES AT A TIME",
  "metadata": {
    "author": "pesu-hater",
    "url": "https://www.reddit.com/r/PESU/comments/1kqyu00/the_review_system_in_pes_is_so_damn_rigged_bruh/",
    "permalink": "/r/PESU/comments/1kqyu00/the_review_system_in_pes_is_so_damn_rigged_bruh/",
    "score": 131,
    "created_utc": 1747725565,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mt9biuz",
      "body": "Took me 45 min to finish my review today. Dogshit servers"
    },
    {
      "id": "mt9e385",
      "body": "One major bug in the review system, it shows loading the paper, there is a fix for it : just refresh the page and click on the paper (this issue is there since 3 semesters now)"
    },
    {
      "id": "mt9jny1",
      "body": "bro first it wont load just refresh the webpage it will work just fine"
    },
    {
      "id": "mt9lah5",
      "body": "I took 3 intermittent naps of 5mins for these papers to load and still it said- Paper alr submitted lmao"
    },
    {
      "id": "mt9lmk5",
      "body": "Bro everyone knows that. It still wasnt working because there were server issues"
    },
    {
      "id": "mt9o9ge",
      "body": "Moreover why can’t they just let students access the review from home? What’s keeping them from making it accessible outside college?"
    },
    {
      "id": "mt9pwdg",
      "body": "Mine didnt even load bro, everytime I clicked on a paper it took 5 minutes to just pop with a window saying no paper found/review already done, couldn’t even do my review and ik for a fact they’ve fucked up the marks"
    },
    {
      "id": "mt9s2yv",
      "body": "It didn't let me submit anything for review  and there was literally a question they didn't correct 💀"
    },
    {
      "id": "mtb8wqe",
      "body": "Isa papers would get leaked"
    },
    {
      "id": "mtb93tr",
      "body": "Can we like do something about it? Fill a petition and submit it to the IT team fr or just spam their emails"
    },
    {
      "id": "mtbau7a",
      "body": "Bruh, that I can download pdf of it while reviewing also"
    },
    {
      "id": "mtfdm9x",
      "body": "Earlier with 5 ISA system, the reviews were so chill no hassle at all. This new software came when 2 ISA system came back. That software clearly shows the incompetence of PES or whoever has made that software"
    }
  ]
}