{
  "id": "1ksojxl",
  "title": "Special FAQ by fresher...",
  "content": "Hi , I am joining pes university in ECE branch planning on making my career based on robotics , I have a few doubts regarding the college ,I need help very confused whether to choose RVCE for ECE outdated syllabus under vtu\n\n\n\nWhat is the structure of the ECE curriculum (theory vs. labs)?\n\n\n\nHow updated is the syllabus with a current industry oriented curriculum?\n\nWhich companies recruit ECE students specifically?\n\n\nHow early do students start preparing for placements?\n\n\nAre there any ECE-focused technical clubs?\n\nWhich clubs are most active and useful (coding, robotics, entrepreneurship)?\n\nAre clubs open to first-year students?\n\nHow to get into top-performing teams (like hackathon-winning teams)?\n\nHow’s the crowd at PES RR? Friendly, competitive, collaborative?\n\nHow do you manage GPA + projects + clubs effectively?\n\nWhat mistakes should I avoid in the first year?\n\nWhich online resources help with ECE at PES (YouTube channels, sites)?\n\nAre there notes or resources passed down from seniors?\n\nWhat scholarships are available for merit or financial need?\n\n\n\n\nHow hard is it to maintain the eligibility for merit scholarships?",
  "metadata": {
    "author": "MR_parker2007",
    "url": "https://www.reddit.com/r/PESU/comments/1ksojxl/special_faq_by_fresher/",
    "permalink": "/r/PESU/comments/1ksojxl/special_faq_by_fresher/",
    "score": 3,
    "created_utc": 1747914119,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mtooxo4",
      "body": "1. The structure of the ECE syllabus is present in the ECE Handbook, search on the PES website, you can see list of subjects and what all they cover ; TLDR ; robotics systems as s subject is an elective in 6th semester \n\n2. Some subjects are surely updated as per industry but some still are old and not updated, hopefully will be updated in coming years.\n\n3. Almost all companies coming to CS allow ECE students to write tests, interviews etc. A few people from my batch did get placed in top companies like Singularity Dynamics, etc, check Placement sheet below, for the same to get an idea - (this is for 2025 batch) \n\n[ECE placements 2025](https://docs.google.com/spreadsheets/d/1GN0hXmrWHRGo75Y9vAlBFVkdVYi0lXYoLAncGVhW7CY/edit?usp=sharing)\n\n4. Around 3rd year most people start prepping for placements, because that's when most people would figure out what they want to do further \n\n5. Well, there are some labs, clubs as such there are non specific to ECE, and ECE Department itself conducts hardware contents / hackathons annually. So, keep an eye out on these, and there is IEEE RAS a club tat focuses on Robotics stuff primarily\n\n6. There are many like E-Cell, CIE, Alcoding Club, etc, more info [PESU clubs](https://clubs.pes.edu/)  \n  \n7. yeah, ofcourse, many clubs look to hire first years in the beginning of a new semester. you can apply, but this heavily depends on club too.   \n  \n8. Top performing teams? I dont understand, you need to make a team and participate, that is all. Finding good teammates is upto you.   \n  \n9. Highly subjective   \n  \n10. Depends on you, how you manage time and academics, again subjective  \n  \n11. Refer FAQs, there will be info on this. \n\n12. It depends on subjects, each one has different youtube channels, check PES Media server, refer FAQs for the link or I think you can see it on the right side too now. \n\n13. yes, refer PES Media server please \n\n14. All scholarships are merit based on your CGPA / SGPA per semester, refer FAQs or search in this subreddit, you will find info, if you dont, join the PESU Discord server. \n\n15. Again subjective, depends on you, how you manage your CGPA by STUDYING. \n\n  \nHope this helps !!"
    },
    {
      "id": "mtouv5f",
      "body": "Thank very much for your time!! It was helpful"
    }
  ]
}