{
  "id": "1ksskws",
  "title": "Tier of pesu?",
  "content": "Im tryna search up tier of pes (both rr and ecc) but aint getting anything of recent ,(apart from 2005-06 daa) ,can someone psl proved a reliable source?? Pls provide naac credited list if possible or any dox related to it?",
  "metadata": {
    "author": "Goofyuser1243",
    "url": "https://www.reddit.com/r/PESU/comments/1ksskws/tier_of_pesu/",
    "permalink": "/r/PESU/comments/1ksskws/tier_of_pesu/",
    "score": 10,
    "created_utc": 1747925239,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mtnx5he",
      "body": "PES falls in A+ category"
    },
    {
      "id": "mtny11w",
      "body": "Yeah , but can u provide any context/docs relsted to it??? Ik it competes with few tier 1 colleges (personally visited pesu), so doubt bout its pros, but i want it to be mentioned by naac or atoesst iirf or any such institue ( it realky helps for pg studies ,so im askin)"
    },
    {
      "id": "mto059e",
      "body": "https://preview.redd.it/hox1da05mc2f1.png?width=1919&format=png&auto=webp&s=28d9cf3f0fd9ede94f4c3ec615938cb319c1380e"
    },
    {
      "id": "mto1gjk",
      "body": "The tier system is vague and subjective. There is no official metric that determines how colleges fall into tiers. But the reality is that unless you are going to an IIT, NIT, BITS, IISc, IIIT, or one of a few other *extremely* well-recognized colleges, nobody cares where you are from, and that is the case with PES; you will thus not find any \"reliable\" source to tell you about its tier.\n\nFor its reputation, it does a great job with placements and is absolutely average at everything else. It is nowhere near the colleges I listed, but it is definitely a good choice for most looking to study CS if you can't get into them.\n\n*Of course, we are also known as IIT Bangalore, but there are other reasons.*"
    },
    {
      "id": "mto2074",
      "body": "Thank u bro, i hope u land 1cr+ job🥹🥹"
    },
    {
      "id": "mto2fpw",
      "body": "Lol thanks for your wish\n\nDont stress too much about tiers. You can be an absolute idiot in \"tier 1\" or a mindblowing geneius in \"tier 300\". It all depends on you and the skills you make."
    },
    {
      "id": "mto2v21",
      "body": "Thanks mate, i didnot bithered about tier of colleges , unitl i visited jeetards and saw few posts cliaming tier of college in india matters a lot ,if one wamts to pursue phd/ pg studies in us, so i asked to be on safer side, thankfully pesu got what i need"
    },
    {
      "id": "mto37vp",
      "body": "Please check you dm, hope im not bothering you tho, but dont ignore me"
    },
    {
      "id": "mto8vha",
      "body": "Manipal is A++"
    },
    {
      "id": "mtoc94e",
      "body": "please dont get info from jeeneetards!"
    },
    {
      "id": "mtoichx",
      "body": "Depends on where you get placed"
    },
    {
      "id": "mtrrxcj",
      "body": "Sorry? How does being placed decide tier of college?? Care to explain?"
    },
    {
      "id": "mtsin0r",
      "body": "Satire"
    },
    {
      "id": "mtskvqo",
      "body": "Absolutely humourous "
    },
    {
      "id": "mtsl628",
      "body": "Yeah bro, over 80% people there are crazy "
    },
    {
      "id": "mtsld9u",
      "body": "What??💀💀 Then these grades ain't supposed to say the tier??? Who TH invented this tier system?? And why is it soo confusing broo😭😭\nAnyway made up my mind ,that imma join pesu, regardless of tier, after talking to few alumni I felt better"
    },
    {
      "id": "mtsnhjx",
      "body": "What is your percentile if I may ask?.\n\nI think manipal and pesu are in the same level in academics"
    },
    {
      "id": "mtspy03",
      "body": "I might get into CE or ME in any tier 2 nit/iiit, if my lucks with me ,or I could get into tier 3 for core cs,"
    },
    {
      "id": "mtsr7ou",
      "body": "Same \n\nCan I get CS in ai/ml rr campus at 94.56?"
    },
    {
      "id": "mtsrbn9",
      "body": "Yeah might be possible, I've heard rr gon place cutoff of 95/96, anyway I ain't going to pesu thru jee"
    },
    {
      "id": "mtsrg8e",
      "body": "I'm not from Karnataka my state does not take cet Honestly this sucks 😭\n\nHoping I do get cse cause some said cutoff might go low for cse as well."
    },
    {
      "id": "mtsrox5",
      "body": "I hope so, cuz pesu cse has crazy hope, I've seen people online(idk how legit tho) a coupla of guys are choosing pesu ecc over rvce despite they could score 3 or 2 digit rank in kcet(again idk how legit), so it's kinda hard for cse to go low, but spec might have chance"
    },
    {
      "id": "mtsrw2s",
      "body": "I heard rvce is better I donno it's fees is less placement is good so I don't think they should leave that \n\nIf I get ai/ml I'll think about it I have a chance of cs in manipal"
    },
    {
      "id": "mtt97ou",
      "body": "I feel rvce is treated better by a small factor,but I couldn't care less bout them , cuz I have a lotta stuff to figure out myself .lol"
    },
    {
      "id": "mu0ylge",
      "body": "Pls reply dm sir"
    },
    {
      "id": "mutb394",
      "body": "Hey what's your met marks and board percentage, I'm also confused between pes cse (ec campus ) and mit manipal cse (more or less confirmed at marks)"
    },
    {
      "id": "muuwqeo",
      "body": "162 , 97 boards\n\nI don't know what I'll get in pesu since they automatically wrongly changed my jee rank so merit rank came bad, thinking if they do change in the second round"
    },
    {
      "id": "muuwvui",
      "body": "What's your primary option tho"
    },
    {
      "id": "muux4pe",
      "body": "I'll let the manipal rank come first I don't believe the predictor\n\nI was supposed to get 1.5k rank in pesu then I think I would have a chance in rr aiml but pesu hates me :) \nLeft thapar parents didn't allow Jaypee is backup.\n\nAll I know is I'm getting into a college I'm not sure which one 😭😭"
    },
    {
      "id": "muuxsut",
      "body": "Dude at your marks and boards cse is for sure confirm, i got 181 and 87 in boards and pes I have a high chance for ec campus , people saying manipal better so hoping for that"
    },
    {
      "id": "muuy5c9",
      "body": "Bro I dont know how normalisation works but I'm from isc boards and I see many with 170+ so I'm scared that way\n\nI was hoping for a scholarship too the only problem I feel in manipal would be the peer group I hope I do find serious peeps"
    },
    {
      "id": "muuz3rx",
      "body": "If your getting cse then mostly it will be serious people right? And what no boards band system?"
    }
  ]
}