{
  "id": "1ktc8r4",
  "title": "Missed the JEE Mains rank submission deadline. Is there anything I can do?",
  "content": "Apart from trying through KCET, is there any other solution? Will e-mailing the admissions office help? I got 98.5 percentile in CRL Mains. ",
  "metadata": {
    "author": "Individual-Camera698",
    "url": "https://www.reddit.com/r/PESU/comments/1ktc8r4/missed_the_jee_mains_rank_submission_deadline_is/",
    "permalink": "/r/PESU/comments/1ktc8r4/missed_the_jee_mains_rank_submission_deadline_is/",
    "score": 3,
    "created_utc": 1747979782,
    "flair": "Admissions",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mtshx2m",
      "body": "Tbh it's a mistake on your part. The window was opened for a month after the results. Most probably they won't consider it"
    },
    {
      "id": "mtsii17",
      "body": "I realise it, but I guess it won't to much to grovel about it. If I can do something I will. I'm asking if there's a way out that's all, if there isn't, then so be it."
    },
    {
      "id": "mtsnauv",
      "body": "why tf u joining pes with 98.5"
    },
    {
      "id": "mtsnmw6",
      "body": "I paid to register, because the dean of our school forced us to. I thought might as well get the jee rank card?"
    },
    {
      "id": "mtsv597",
      "body": "When was the last date?"
    },
    {
      "id": "mtsv944",
      "body": "Apparantly yesterday before 10pm"
    },
    {
      "id": "mtsvft0",
      "body": "When was the last date exactly \n\nI filled it a few days ago they did ask my jee percentage also for kcet but I haven't given that \n\nPaid registration fee too"
    },
    {
      "id": "mtsvkyc",
      "body": "I did it on the night of 21st I didn't know the deadline I thought it was 1st June"
    },
    {
      "id": "mtu6fl6",
      "body": "Won't get cs anywhere decent if general candidate"
    },
    {
      "id": "mtue9nd",
      "body": "portal reopens tomorrow again. you can try reuploading"
    },
    {
      "id": "mtuelp4",
      "body": "What time? I wanna be the first to re-upload this time lol."
    },
    {
      "id": "mtuzba0",
      "body": "hasn't been mentioned. prolly 10 am?"
    },
    {
      "id": "mu0v1vj",
      "body": "Idk why it's showing that \"this session will only be activated after the JEE main session 2 results are announced\"."
    },
    {
      "id": "muhb3u6",
      "body": "did it change? did you submit the scores?"
    },
    {
      "id": "muhb9jm",
      "body": "Yes, yesterday."
    },
    {
      "id": "muht1th",
      "body": "bro its showing \"this session will only be activated after the JEE mains session 2 results are announced\" today, but they said it will open on 28th when i asked on 25th. "
    },
    {
      "id": "mui07nt",
      "body": "hey, I called the admission office today and they said it is still open to upload your jee scorecard, and yes I just uploaded mine too"
    },
    {
      "id": "mui5222",
      "body": "Yes I submitted mine yesterday."
    },
    {
      "id": "mui6hx6",
      "body": "Is it possible to dm you? Cuz I wanted to know when we will be getting our ranks😭😭🙏🏻"
    },
    {
      "id": "muon047",
      "body": "did it reopen today?"
    }
  ]
}