{
  "id": "1ktjr9v",
  "title": "35+ Lakhs: Average CTC of IIM Graduates ‼️",
  "content": "Dreaming of a ₹35 LPA+ Salary? Here's How the IIM Tag Can Make It a Reality\n\nAn IIM degree isn't just about education; it's a launchpad to elite career opportunities. Top recruiters like BCG, McKinsey, Goldman Sachs, Amazon, and Microsoft actively seek IIM graduates for roles in consulting, finance, tech, and more. I'm a 99.5+ percentiler in CAT from one of the top 4 IIMs (keeping it anonymous for now). Along with my team of high achievers (99.7+ percentilers) from top B-schools, we've launched a dedicated Reddit community to guide CAT aspirants.\n\nAnd Why Join Our Community?\n\n1. Expert Strategies: Learn from those who've already aced CAT and cracked top B-schools and from top ABC IIMs.\n\n2. Comprehensive Resources: Access curated study plans, mock tests, daily questions, and prep tips that actually work.\n\n3. Stay Updated: Be the first to know about CAT notifications, exam changes, B-school deadlines, and other relevant news.\n\n4. Peer Support: Engage with serious aspirants, share doubts, stay consistent, and build accountability. Insider Mentorship: Our team includes current students and alumni from IIM Bangalore, IIM Mumbai, XLRI, FMS, and other top B-schools- offering you firsthand guidance on everything from prep to interviews.\n\n5. No Coaching Noise: Unlike other subreddits flooded with ads and bot-driven marketing, we're building a space that's by aspirants, for aspirants-with real, actionable help.\n\n6. Live Interactions: Participate in AMA sessions, mentorship circles, and prep bootcamps led by people who've been exactly where you are.\n\nJoin our community today - r/CATstudy\n\nPs- Not a promotion or an ad, we the 4 alums of the top 4 IIMs are trying to correct the misconceptions that people have related to CAT and their profiles, extra curriculars etc.\nIf you any have doubts or queries you can let us know!",
  "metadata": {
    "author": "Savings_Diamond_4368",
    "url": "https://i.redd.it/lnehwcagbj2f1.jpeg",
    "permalink": "/r/PESU/comments/1ktjr9v/35_lakhs_average_ctc_of_iim_graduates/",
    "score": 4,
    "created_utc": 1748007400,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mtu4xce",
      "body": "See getting in them for an an average private engineering college student is difficult first of all engineering is a very common thing, they need diversity if you are a boy general quota and an engineer it's is really difficult chances are slim to none it's the reality so yeah"
    },
    {
      "id": "mtu54hc",
      "body": "So the situation is the same as  most of the students  at pesu, so yeah lemme know what's gonna happen"
    }
  ]
}