{
  "id": "1ktlg64",
  "title": "3423 rank in my rank card, anything ill be able to get?",
  "content": "",
  "metadata": {
    "author": "Real_Opportunity_739",
    "url": "https://www.reddit.com/r/PESU/comments/1ktlg64/3423_rank_in_my_rank_card_anything_ill_be_able_to/",
    "permalink": "/r/PESU/comments/1ktlg64/3423_rank_in_my_rank_card_anything_ill_be_able_to/",
    "score": 3,
    "created_utc": 1748011737,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mtuetty",
      "body": "crl : 184637"
    },
    {
      "id": "mtufk50",
      "body": "I had a jee rank of 1.8 lakh and pessat rank of 3k last year.. so ig the cutoff will be similar to last year"
    },
    {
      "id": "mtufx13",
      "body": "i see, which branch did you get?, also did you get in through jee mains or through pessat?"
    },
    {
      "id": "mtug778",
      "body": "I was getting CS at electronic city thru pessat but i took ece through kcet"
    },
    {
      "id": "mtugom4",
      "body": "how much did you get in kcet?, also do you think ill be able to get ece?"
    },
    {
      "id": "mtugpz3",
      "body": "Your post cannot be answered by any member either due to a lack of details in the post or us not having any way to answer the question to help you.\n\nIf you are looking for admissions advice about your rank (ex: \"Can I get X branch at Y rank?\"), please note that this is the first year PES has introduced JEE Mains for its primary mode of admission, and thus, we do not have any historical data to answer your questions or make predictions.\n\nHere is old PESSAT rank data, this might help you: https://www.reddit.com/r/PESU/comments/1ct5ujc/which_branch_can_i_get_at_no_dont_make_such_posts/"
    },
    {
      "id": "mtuh3eh",
      "body": "can i get ai ml in ec campus with 3801 rank"
    },
    {
      "id": "mtuhbji",
      "body": "yes ig you should last year the cutoff's went very low... ig you will get cs with that rank"
    },
    {
      "id": "mtuhjm3",
      "body": "KCET cutoff for ece was 12k for general... so if your rank is below 12k in kcet you will get ece... thru pessat you will get cs itself mostly"
    }
  ]
}