{
  "id": "1kttg76",
  "title": "Just PESU things.....!!",
  "content": "They ask us to pay fu*king 5.10L before getting the seat. WTF....??",
  "metadata": {
    "author": "chaeese_v_",
    "url": "https://i.redd.it/plpmevnwal2f1.png",
    "permalink": "/r/PESU/comments/1kttg76/just_pesu_things/",
    "score": 27,
    "created_utc": 1748031436,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mtwbyvb",
      "body": "what happens if we dont take the seat though???"
    },
    {
      "id": "mtwdmcv",
      "body": "Nah this is dum asf. What kind of college even does that? Fuck off"
    },
    {
      "id": "mtxe1a2",
      "body": "'2029 juniors having their first \"Welcome to PES\" moment, love to see it"
    },
    {
      "id": "mtxfipy",
      "body": "Ain't joining pes after reading also the stuff on reddit 😭😭"
    },
    {
      "id": "mtxily5",
      "body": "Understandable."
    },
    {
      "id": "mtxiode",
      "body": "Only thing I found best about pes were placements"
    },
    {
      "id": "mtxiw54",
      "body": "Ngl, that's all PES has going for it at the moment, apart from the crowd and alumni network.\n\nIf all you care about is a decent job at the end of 4 years, this place will do its job. But nothing more. But then, you wouldn't be paying 5L+/year for that unless you are *extremely* well off."
    },
    {
      "id": "mtxl1s9",
      "body": "Rvce>Manipal>Pes>Comedk colleges\nIs this a correct ranking?"
    },
    {
      "id": "mtxn1zh",
      "body": "The top 3 do not have much difference among them, but yeah I guess you could say that is fairly accurate. Its been a while since I went through this process, so I am not the right person to answer."
    },
    {
      "id": "mtxnema",
      "body": "I think you lose 10k. That was the process for management seat.\nThis is atrocious though!!!!"
    },
    {
      "id": "mtxo9sl",
      "body": "It really doesn't matter much. \n\nI'd say rvce=manippal=pes=remaining 2-3 top comedk colleges(bms, msrit, maybe another I'm missing) >the rest of the comedk colleges. \n\nMost colleges in the same \"tier\" will give you roughly the same opportunities. It really depends on the students themselves after that."
    },
    {
      "id": "mtxuss0",
      "body": "Pes is still better than most colleges in banglore right.. Like top 3 in banglore"
    },
    {
      "id": "mtynmfx",
      "body": "On top of that worst admission management they did a glitch with my rank messed up the internal ranking and now not picking calls and responding to emails \n\nPlus the mod doesn't even approve the posts I don't know what flair and what they are asking me to"
    },
    {
      "id": "mtyp4v5",
      "body": "Any posts asking for advice on JEE rank will be deleted. If you were trying to post anything else, then DM the mods."
    },
    {
      "id": "mtypjvk",
      "body": "Mod is the office close today ? They did a glitch with my rank because of which the ranking given by pesu is affected. They're not responding on mail and not picking calls"
    },
    {
      "id": "mtypqgy",
      "body": "Not sure. Try calling them if you haven't emailed yet, or if you live in Bangalore, visit the campus and get it sorted. Someone else also spoke about a glitch in another thread."
    },
    {
      "id": "mtypxvz",
      "body": "There is an option to change rank but I'm not sure was it yesterday too, and if I do that will they release a new ranklist\n\nI have emailed them yesterday as well as a follow up today no response and I'm not from karnataka"
    },
    {
      "id": "mtyyk5t",
      "body": "Other than rvce and iiitb \nPes is way better than the rest. \nThe gap btw rvce and pes is not that much now."
    },
    {
      "id": "mtyymhc",
      "body": "That's pretty standard.\nI lost money on manipal like that."
    },
    {
      "id": "mu074fb",
      "body": "When tf did the fees go up to 5.1L lmao?!"
    },
    {
      "id": "mu07gvf",
      "body": "Yes bruuhh. For students who are joining through jee have fee of 5.1L for Cse and 4.1L for ECE and other courses"
    },
    {
      "id": "mu19d9m",
      "body": "Bro please check my recent post"
    },
    {
      "id": "mu1n71z",
      "body": "where would u keep thapar ? in same tier or below ? bcz im getting a seat at thapar in ECE and idk if i will get ECE here"
    },
    {
      "id": "mu1nnvo",
      "body": "placement wise yes but if u want more college life then manipal>pes>rv ( as what i have seen)"
    },
    {
      "id": "mu21fub",
      "body": "Just wait for it , u will see what all this college can do"
    },
    {
      "id": "mu27hy4",
      "body": "Same"
    },
    {
      "id": "mu4c04p",
      "body": "Why do they need to create a mess? Can't it be kept simple"
    },
    {
      "id": "mu4cch9",
      "body": "Got a rank of 1.3L in mains \nWill I get a seat by any chance? \nAs I saw on siksha web last year's cse closing rank was 2.3L something...plz help"
    },
    {
      "id": "mu4toyp",
      "body": "you can get ec campus with cse but idts you can get rr campus cause last year the cut off was around 1000 pes rank"
    },
    {
      "id": "mu4yo73",
      "body": "Pess jee rank cards are out . My brother got 2k . Will he be able to get cse?"
    },
    {
      "id": "mu7ds8c",
      "body": "I haven’t receive this mail but got the rank card. What should I do?"
    },
    {
      "id": "mx96a8i",
      "body": "Could you share?"
    }
  ]
}