{
  "id": "1kubwll",
  "title": "Will everyones r*nk change??",
  "content": "The mail the university sent says the portal will reopen for ppl who didnt upload their J33 r*nk. So does this mean the r*nklist is gon change and everybody is gon get new r*nk? (The words J33 and r*nk are banned here apparently)",
  "metadata": {
    "author": "rynmuneer",
    "url": "https://i.redd.it/duigcr9ahq2f1.jpeg",
    "permalink": "/r/PESU/comments/1kubwll/will_everyones_rnk_change/",
    "score": 10,
    "created_utc": 1748094113,
    "flair": "Admissions",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mu0a7p5",
      "body": "Shouldn't ig??"
    },
    {
      "id": "mu0abou",
      "body": "If new ppl get added to the ranklist wont everyones rank change??"
    },
    {
      "id": "mu0alno",
      "body": "I think it has been opened for those who had already registered till 21 but couldn't upload jee ranks ..also I don't think they will go through the trouble of publishing/ alloting new ranks"
    },
    {
      "id": "mu0av25",
      "body": "The mail says they will be allotted pesu rank card"
    },
    {
      "id": "mu0axqi",
      "body": "for the love of god ask college directly or read the website properly   \nSome fool will give wrong answer and u might make poor decisions with that info."
    },
    {
      "id": "mu0b2i6",
      "body": "Then who know s??🤷"
    },
    {
      "id": "mu0b2m2",
      "body": "Not it wont change... Dis is the final rank list is what I think.. They might have a separate rank list coz as mentioned yesterday's was the final list"
    },
    {
      "id": "mu0bi2n",
      "body": "I asked them theyre saying we're just employees we dont know itsupto the management"
    },
    {
      "id": "mu0eka3",
      "body": "They messed up my rank and another one too \nThe site had a glitch\n\nThey told us to edit it I don't know about rank card"
    },
    {
      "id": "mu0exbx",
      "body": "They give the ranklist based on what u typed in crl rank only no verification \n\nI don't know how they changed my CRL I was so sure I wrote the correct one and this happened with the op too they said to update it"
    },
    {
      "id": "mu0f1d7",
      "body": "Wait till u know they don't even pick up calls and respond to mails 😂"
    },
    {
      "id": "mu0f8lz",
      "body": "Did it get resolved ?? Or will they really reallot ranks??"
    },
    {
      "id": "mu0fjpm",
      "body": "No the new rank list is not out I made a post in the sub , they don't pick up calls and respond to mails\n\nI don't know how they changed my rank I was supposed to get a rank of 1.5k but got 3k because of that glitch\n\nI updated the rank today as the portal was open to update the rank and reuploaded my jee scorecard now I don't know what they will do"
    },
    {
      "id": "mu0ktqn",
      "body": "The portal hasnt reopened yet , i m waiting to upload since morning"
    },
    {
      "id": "mu0l2t9",
      "body": "idk if they are high or what, who system of admssion seems fcked up!!!"
    },
    {
      "id": "mu0o0kg",
      "body": "Interesting, they do tend to answer properly.\nJust wait and watch ig.\nPessat counselling was soo smooth last time, they fucked smth up this year."
    },
    {
      "id": "mu0o672",
      "body": "Yea man fr seems unprofessional ash. They messed up my jee main crl too"
    },
    {
      "id": "mu0o9hd",
      "body": "Ig they dk how to do it w jee main rank"
    },
    {
      "id": "mu0oe6m",
      "body": "They messed up jee main crl and i was able to correct it earlier (dk if theyll mess it up again)"
    },
    {
      "id": "mu0sfj2",
      "body": "But that doesn't mean *we* know the answer. Please understand that this is the first time this system has been introduced. Everybody is new to it."
    },
    {
      "id": "mu0yw3e",
      "body": "They will prolly sort it out soon, just be patient."
    },
    {
      "id": "mu19bv1",
      "body": "Bro please check my recent post"
    }
  ]
}