{
  "id": "1kug8nz",
  "title": "ECE ELECTIVE help required pls help (5th sem)",
  "content": "Hey I scored decent marks in all subjects, i dont really have any interests in any one of the domains particularly, so should i take up a balanced meal of all domains or you just grind one to get placed, and can you get placed into a vlsi company even if you just take all spase domain topics (based off of knowledge from 3rd and 4th sem) basically does electives decide what domain of company you get placed in or is it just your 3 and 4th sem knowledge",
  "metadata": {
    "author": "Trick_Contest_6348",
    "url": "https://www.reddit.com/r/PESU/comments/1kug8nz/ece_elective_help_required_pls_help_5th_sem/",
    "permalink": "/r/PESU/comments/1kug8nz/ece_elective_help_required_pls_help_5th_sem/",
    "score": 6,
    "created_utc": 1748105699,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mu1cium",
      "body": "Nope, you can’t get placed in vlsi companies with spase electives.. simply it’s not possible."
    },
    {
      "id": "mu1sanc",
      "body": "Ah you actually get a specialization certificate which will be more useful during your interviews. So, if you pick a domain stick to it for both the sem. If you have no interest in either of the subjects, consider starting a new subject like chip level photonics and Quantum entanglement and Quantum computing. These subjects start with pure basics."
    },
    {
      "id": "mu1xxkv",
      "body": "no the 3rd and 4th sem knowledge isnt enough at all for vlsi companies specifically, cant tell much about other domains tho"
    },
    {
      "id": "mu469vc",
      "body": "I was in the same spot last year with no clear preference, so I picked qeqc and clp mainly to boost my GPA since they were project-based and chill. It worked and most of us scored better than in any other elective.\n\nFunny thing is, I took it easy at first, but ended up doing a project that’s actually worth publishing. Even though exams replaced projects in our even sem (thanks to a few SRN goof-ups), I’ve heard from credible sources that they’re bringing projects back. If you're aiming for a GPA boost and something meaningful, these are great picks."
    },
    {
      "id": "mu47kan",
      "body": "+1 \nThese courses give you enough exposure to get a working knowledge of quantum computing as well. There's discussions with TAs that helps, practical coding and math etc. The course syllabus is also tied around relevant research happening now a days rather than old textbooky way. So that helps too :)\n\nThen there's also publishing. I have seen quite a few people whose assignments/esa projects getting accepted in flagship journals and conferences. \n\nDo consider this option strongly, moreover you'd be still getting a specialization in VLSI!"
    },
    {
      "id": "mu4lwz8",
      "body": "Specialisation is not useful. Its completely useless. A Bachelor's degeee is meant to be an introduction and you need to learn how to work. You only specialise in a field when doing a Masters/PhD. Take the electives based on this: (i) Interest (best) (ii) Incentive (low GPA? you can take the easy ones) (iii) Friends.\n\n\nTake electives which will be useful to your field of interest, or has a proper general usefulness in working. Whats the use of taking some subject which is meant to be in the domain of PhDs right now? "
    },
    {
      "id": "mu4pges",
      "body": "Last semester, I took CLP and QEQC because I was really interested in those topics and wanted to get a solid grasp on photonics and quantum computing. The teacher was pretty chill and made it easier to understand some pretty complex stuff, so that helped a lot.\n\nThis semester, I went with Quantum Transport and Logic Gates, and Non-Linear Optics and Quantum Technology since they’re a natural follow-up to what I learned before. I feel like sticking to these electives helps me build a good specialization, which is definitely going to look good for placements and interviews."
    }
  ]
}