{
  "id": "1kuvk6l",
  "title": "Can I still get into pesu?",
  "content": "How's the college life in Pesu? Also if I apply now can I get into the college?",
  "metadata": {
    "author": "celestialcosmicray",
    "url": "https://www.reddit.com/r/PESU/comments/1kuvk6l/can_i_still_get_into_pesu/",
    "permalink": "/r/PESU/comments/1kuvk6l/can_i_still_get_into_pesu/",
    "score": 7,
    "created_utc": 1748152935,
    "flair": "Admissions",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mu4owep",
      "body": "Bro how you all are able to post \n\nThe rules in the sub not helping me post anything"
    },
    {
      "id": "mu4p79y",
      "body": "What's your query? If it's about JEE ranks and predictions, those are blocked."
    },
    {
      "id": "mu4pagd",
      "body": "What are you expecting from the college? What are you looking for? Another post has a similar question in the past few days I think"
    },
    {
      "id": "mu4qzze",
      "body": "Hello bro i got 3604 rank can i get ece in ec campus"
    },
    {
      "id": "mu4r6tt",
      "body": "No college life is there. It's a school with PTMs and stuff. Only join if you can handle the academic pressure here"
    },
    {
      "id": "mu4r9dc",
      "body": "Placement wise, what would be better?"
    },
    {
      "id": "mu4rowm",
      "body": "What all options do you have"
    },
    {
      "id": "mu4sdow",
      "body": "Thapar, Jaypee, Jac chandigarh and Delhi, Lnmiit"
    },
    {
      "id": "mu4sf03",
      "body": "Just apply Kiya hai jac counselling mai I'll most probably get the lowest branches there"
    },
    {
      "id": "mu4spnx",
      "body": "Lnmiit sahi he . Coding culture bhi bahut accha he vaha ka. Jaypee bekar he. Pes = thapar"
    },
    {
      "id": "mu4sxir",
      "body": "Is ece what you want? Or would you take up cse if given opportunity"
    },
    {
      "id": "mu4u4b7",
      "body": "Bro i would like cse offcourse but i am asking for the safer side"
    },
    {
      "id": "mu4u7n2",
      "body": "Lnmiit mai I'll get ece..so yeah"
    },
    {
      "id": "mu4ueda",
      "body": "Bro i am new to this reddit can we connect on insta or whatsapp my insta id is @Garv0215"
    },
    {
      "id": "mu4vm7i",
      "body": "idk why y'all complain about the ptm so much. Its just 2 ptm's a sem and nobody ik ever went to ptm"
    },
    {
      "id": "mu4xvlq",
      "body": "It's not compulsory for a student to attend a ptm and you're not even in PES, so how do you know about college life lmao"
    },
    {
      "id": "mu4yaso",
      "body": "I do have a couple of friends there😏"
    },
    {
      "id": "mu4yeet",
      "body": "Ngl your frnds must be dumb if they're complaining abt ptms"
    },
    {
      "id": "mu50cwa",
      "body": "Lnm nhi milega most probably"
    },
    {
      "id": "mu50g1y",
      "body": "Bro they were just telling not complaining. Also the main problem is fees . 26 lakhs for 4 years including mess and hostel. Mad expensive"
    },
    {
      "id": "mu50kqe",
      "body": "Mhmm. Torn again"
    },
    {
      "id": "mu51wff",
      "body": "Fair"
    },
    {
      "id": "mu54dfh",
      "body": "PTM hota hai yaha ? 😭"
    },
    {
      "id": "mu566xs",
      "body": "Only for badmos 😧"
    },
    {
      "id": "mu58jpy",
      "body": "https://preview.redd.it/8f4uu5r7cw2f1.png?width=742&format=png&auto=webp&s=e9f2db3bf8fb5842a7537e66b97a226aa9a71ccd"
    },
    {
      "id": "mu5csuv",
      "body": "Which course?  \nI think for Btech its closed."
    },
    {
      "id": "mu5ecwy",
      "body": "Yeah btech only\n\nhttps://preview.redd.it/a5gjr5krmw2f1.jpeg?width=706&format=pjpg&auto=webp&s=2cfc26a0d7fcec3395e6c2c7132559bb9c96219c\n\nI think it's open?"
    },
    {
      "id": "mu5eh08",
      "body": "Percentile?"
    },
    {
      "id": "mu5fn43",
      "body": "Manipal?"
    },
    {
      "id": "mu5hwe8",
      "body": "bro just do a little bit research please? if you want to be spoon fed every answer then you dont deserve admission im sorry"
    },
    {
      "id": "mu5i0j9",
      "body": "Isn't it a part of research asking those who already passed through that level"
    },
    {
      "id": "mu5j48o",
      "body": "what your asking is cut offs, it would be better to ask questions about college, the answers to which you wont find anywhere else. you can easily access the cut off lists from various years and examinations from google/ai."
    },
    {
      "id": "mu5jrzk",
      "body": "Bro i already found a bunch of links in this group itself telling all about college and branches and campus but as there is no official cutoff of past year is released by the University i asked it but thanks for your advice it does hold a point worrying about those things are irrelevant if i am anyhow going to attend the counselling"
    },
    {
      "id": "mu5kbge",
      "body": "[check cut off for colleges here (kcet) ](https://docs.google.com/spreadsheets/d/137ZMt0DEY12AJz05wLEmg--NtxzY19da0yxRodLymXs/pubhtml)\n\nits not pointless worrying about it, its just pointless asking seniors about it who all came from different years and different exams.[](https://docs.google.com/spreadsheets/d/137ZMt0DEY12AJz05wLEmg--NtxzY19da0yxRodLymXs/pubhtml)"
    },
    {
      "id": "mu5ouy6",
      "body": "What do you mean of course u would like cse, \nPeople take courses based on interest too uk, not just follow what society says is good."
    },
    {
      "id": "mu5sip2",
      "body": "Sorry bro if you felt like that but i didnt mean to say that"
    },
    {
      "id": "mu5wa62",
      "body": "As far as it's related to clg life , you'll see some people saying \"don't join it's hell here\" yeah it's true but not as much as they say , they exaggerate it . If you are used to the jee grind it wouldn't bother you at all and every good clg has a bit rigorous curriculum so yeah just find the right peers you're all set"
    },
    {
      "id": "mukspzp",
      "body": "Can I get cse core ring road (rr) campus for 800 pessat jee rank"
    }
  ]
}