{
  "id": "1kvpt3b",
  "title": "Confused wrt choosing Electives for sem 5 ECE",
  "content": "Heyy Seniors. We're asked to choose our electives by 30th May, and I'm very confused about choosing them. Looking at EFT, I've thought of NOT choosing WiNC domain. And I'm confused between SpaSE & NICE. Hence I would like to know which among these are easy to score, has good teachers, better scope in future. Heard few subjects don't have exams, rather just the projects. Saw a few reddit posts which said QEQP and CLP are easy. And few said DSD and FFVDD are good. Gpt said ANN and SNLP are good and easy to score also. \nPlease help.🛐",
  "metadata": {
    "author": "Subject-Whereas-3221",
    "url": "https://www.reddit.com/gallery/1kvpt3b",
    "permalink": "/r/PESU/comments/1kvpt3b/confused_wrt_choosing_electives_for_sem_5_ece/",
    "score": 10,
    "created_utc": 1748250134,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mubbplf",
      "body": "Honestly, I would recommend going into NICE domain, if you're not interested in Math and Machine Learning.\n\nIts difficult to score than DSD and FFVDD and most of all it's boring. Some of my friends had taken the NICE specialization and they said it was good.  \nAs for WiNC, idk much about it."
    },
    {
      "id": "mubcw13",
      "body": "I thought of choosing one from each domain, because I really enjoyed DSP in my sem 4. I don't know whats waiting for me in sem 5, but solely because I liked DSP, i thought of one SPASE and one NICE. Thanks though<3"
    },
    {
      "id": "mubiqy6",
      "body": "then u can pick SNLP and DSD"
    },
    {
      "id": "mubizr6",
      "body": "I did think about that, but unfortunately both of them are under elective 1"
    },
    {
      "id": "mubk55m",
      "body": "I meant to say FFVDD mb"
    },
    {
      "id": "mubkfkg",
      "body": "DSD and FFVDD?"
    },
    {
      "id": "muc7bzc",
      "body": "The specialization is NICE after all!"
    },
    {
      "id": "mucvyrf",
      "body": "Hmm sure, u cud take that, but i thot u wanted a combo of SpASE and NiCE so"
    },
    {
      "id": "mucw0hv",
      "body": "true lmao"
    },
    {
      "id": "muv9r0d",
      "body": ">QEQP and CLP are easy\n\nIt's not as intimidating as people make it out to be. But it is not easy either. Do give it a thought yourself once before you pick anything in haste. Pick QEQC/CLP if you are genuinely interested in the field. Good luck!"
    },
    {
      "id": "muvkge4",
      "body": "Thankss"
    }
  ]
}