{
  "id": "1l0qyc3",
  "title": "Regarding fees refund of pesu",
  "content": "Guys so counselling is on 7th June and we have to pay 5.1 lakh before 5th June, on their website it's mentioned that if I apply for surrender of seat before 20th June I'll get a full refund of 5 lakhs, the problem is that second attempt of bitsat starts from 22nd june, so what if I get good marks in bitsat will they give refund if I join bits? I'm most prolly getting core cse in (ec campus).",
  "metadata": {
    "author": "BulletFist1107",
    "url": "https://www.reddit.com/r/PESU/comments/1l0qyc3/regarding_fees_refund_of_pesu/",
    "permalink": "/r/PESU/comments/1l0qyc3/regarding_fees_refund_of_pesu/",
    "score": 7,
    "created_utc": 1748789879,
    "flair": "Admissions",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mvfh3mp",
      "body": "same doubt so cfbr"
    },
    {
      "id": "mvfj3g7",
      "body": "oh and also where's the 20 June thing mentioned? Can't find it on the site"
    },
    {
      "id": "mvflwdv",
      "body": "Can i still register for counseling I got 95.88 percentile in jee mains can i get ece"
    },
    {
      "id": "mvfm2rc",
      "body": "Search for pesu seat surrender ig"
    },
    {
      "id": "mvfmnik",
      "body": "These are questions that are best directed to the admissions department, not to students who have not faced this system before.\n\nBut going by previous refund policies (search the sub for more details), PES does not do a 100% refund. You will need to search and read up more."
    },
    {
      "id": "mvfmwui",
      "body": "thanku!"
    },
    {
      "id": "mvfn6fe",
      "body": "Yeah 10k is cut for administrative charges , 5 lakh will be returned"
    },
    {
      "id": "mvfnbfa",
      "body": "Welcome bhai"
    },
    {
      "id": "mvfqcvl",
      "body": "My point is, if you claim a refund after the specified date, they will not refund you the full amount. They will also try to keep a good chunk of the 5L, if not the entirety. You will need to read up on this sub or email them."
    },
    {
      "id": "mvgu94x",
      "body": "you can't register anymore, you would have got cse itself"
    },
    {
      "id": "mvh25v4",
      "body": "in  main campus?"
    },
    {
      "id": "mvh5g2k",
      "body": "not sure"
    },
    {
      "id": "mvjrj9s",
      "body": "U would hv proly got main campus"
    },
    {
      "id": "mvpektn",
      "body": "my jee percentile is 95.18 nd PESU rank 13xx are there any chances for cse?"
    },
    {
      "id": "mvpij13",
      "body": "Cse AIML at main campus should be possible tbh...tho it's hard to say with surety"
    }
  ]
}