{
  "id": "1l1mjrn",
  "title": "Need Advice: Internship vs Placement Preparation",
  "content": "Hi everyone,  \nI got an internship offer for blockchain at ISFCR from June 9 for 6 weeks. I don’t have any previous internship experience, but I’m not sure if I should do this or use the time to prepare for placements. What would you suggest?",
  "metadata": {
    "author": "Ok-Author-3569",
    "url": "https://www.reddit.com/r/PESU/comments/1l1mjrn/need_advice_internship_vs_placement_preparation/",
    "permalink": "/r/PESU/comments/1l1mjrn/need_advice_internship_vs_placement_preparation/",
    "score": 11,
    "created_utc": 1748881799,
    "flair": "Placements 🤑",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mvm8r8n",
      "body": "6th or 4th sem?\n\nIf 6th, go study"
    },
    {
      "id": "mvmdn7w",
      "body": "Is the workload much , can we do dsa  while the internship"
    },
    {
      "id": "mvmeo91",
      "body": "6th sem"
    },
    {
      "id": "mvmn0zy",
      "body": "In general, internship experience is pretty valuable and helps you stand out among your peers. Most students don't really have any experience on their resumes when they apply during placement season, so having *something* often can be the differentiating factor. Note that companies do not expect any kind of groundbreaking experience since you are still in undergrad, but given the current competitive market and the cookie-cutter resumes that recruiters will see, having any kind of experience will instantly make you stand out. It definitely made the difference for me (I had 2 internships by the time placements arrived), and my interviews also delved into my internship details and the work I did there. Not to mention, I was also TA during this time.\n\nIf you do not have any experience, as you say, I would suggest taking it up. 6 weeks isn't long - it is a pretty short internship. And its not like you are going to be working your ass off from morning to night, Monday through Sunday.  People manage to take out time for placement prep, and you will too. Companies only visit from the end of July. If you time things well, manage your time, prioritise tasks and compartmentalise efficiently, you can prepare as well as pursue the internship. \n\nIt depends on you and your time-management abilities at the end of the day, but IMO, having the experience helps stand out."
    },
    {
      "id": "mvp3yto",
      "body": "What were the 2 internship you had done?"
    },
    {
      "id": "mvp4a8m",
      "body": "One at CCBD, another was off campus at a well known MNC as a research intern."
    },
    {
      "id": "mwibm8e",
      "body": "Rowlet anna, how do you go about getting these internships?\nI tried for the pes innovation lab (ps. Im in my second semester ) but the test was kind of messed up, 40s for a whole paragraph q was kinda far fetched and I do not believe I'm bad at MCQ type exams judging by my previous test scores.\nHowever I've had friends that got selected simply because they had a 12th grade project under their experience section though I did not list it on my \"resume\" because honestly, I did not understand what I did and it was assisted by the school back then.\nSo how do I apply and how do I get selected? \nShould I get into an area of interest and self learn topics and make projects about it and then apply for said internships/clubs? How did you get into them?\nWould be grateful for your insight."
    }
  ]
}