{
  "id": "1l1q1xy",
  "title": "Help: What should I do I'm confused",
  "content": "I'm getting a r*nk around 500 in manipal and 15XX in pesu from J£e.\n\nI haven't paid the fees yet for pesu counselling , should I opt for it or just go for manipal. Am I potentially missing a better college of i don't take pesu counselling? \n",
  "metadata": {
    "author": "Fun_Election9179",
    "url": "https://www.reddit.com/r/PESU/comments/1l1q1xy/help_what_should_i_do_im_confused/",
    "permalink": "/r/PESU/comments/1l1q1xy/help_what_should_i_do_im_confused/",
    "score": 0,
    "created_utc": 1748889842,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mvn4hxi",
      "body": "Mostly at this pesu rank you will get ece in main campus and in manipal you are getting cs with scholarship also as your rank is under 5k . Also placements wise pesu= manipal . So I would suggest you to take mit for cs"
    },
    {
      "id": "mvn4ry7",
      "body": "Oo people were comparing pessat ranking for this counselling rank and I thought I'll get aiml at least since the counselling process is so shit I thought if I might get lucky then cs too :("
    },
    {
      "id": "mvn58uk",
      "body": "No one's sure . You may get ai ml or ece only I feel m cs there is very slight chance as ppl won't leave that easily"
    },
    {
      "id": "mvn5od3",
      "body": "You shouldn't be taking counseling advice from someone who doesn't know how the system works. I don't know why you kids keep doing the same thing. \n\nNobody can predict. If anyone claims they can, they're just lying."
    },
    {
      "id": "mvn5pzl",
      "body": "So I didn't have ece as preference it was cse and ai in both campuses .\n\nIn general too about pesu and manipal what should I prefer?"
    },
    {
      "id": "mvn64xo",
      "body": "Yaa I know that I'm not sure too about counselling my main question was since I got this much ranking should I straight away go ahead with mit or should also sit for pesu\n\nAlso this would just be taken as an advice and in now way a deciding factor for me it's just to get a clearer picture if will I be missing anything."
    },
    {
      "id": "mvn65lh",
      "body": "I feel placements wise both are same . For a great college life you can choose manipal ."
    },
    {
      "id": "mvn6jzi",
      "body": "You can predict your branch at Manipal, not at PES. I'd say, go with Manipal."
    }
  ]
}