{
  "id": "1l2fehu",
  "title": "PES(RR) ECE vs PES(EC) CSE",
  "content": "I have these two options im confused whether i should take the 2nd campus. Im more interested in CSE than ECE. Can someone help me out.",
  "metadata": {
    "author": "kokaboka8989",
    "url": "https://www.reddit.com/r/PESU/comments/1l2fehu/pesrr_ece_vs_pesec_cse/",
    "permalink": "/r/PESU/comments/1l2fehu/pesrr_ece_vs_pesec_cse/",
    "score": 4,
    "created_utc": 1748965782,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mvsm32d",
      "body": "If you are interested in CS, pick CS. If you are interested in ECE, pick ECE.\n\nWhy is campus a factor here? I hope you are aware that both campuses are equivalent. Read the FAQs and educate yourself if are are uninformed."
    },
    {
      "id": "mvst3iv",
      "body": "Den definitely PESU EC CSE....no brainer...."
    },
    {
      "id": "mvt9l48",
      "body": "people will do anything but read the faq's"
    },
    {
      "id": "mvte94z",
      "body": "What's your rank btw?"
    },
    {
      "id": "mvtec52",
      "body": "What rank btw?"
    },
    {
      "id": "mvve2hl",
      "body": "If he likes ece?"
    },
    {
      "id": "mvw5230",
      "body": "Are you imterested in ECE? If not, don't take it"
    },
    {
      "id": "mvwsemf",
      "body": "He clearly mentioned he is interested in cse...."
    },
    {
      "id": "mvwwzpf",
      "body": "But its not like companies dont allow ece students.. its based on skills ryt?"
    },
    {
      "id": "mvwydg3",
      "body": "Most companies wont allow ece. its much different than cs. cs is more thsn just codinng knowledge"
    },
    {
      "id": "mvwzg4q",
      "body": "huh from what ive heard 85-90% looks at cgpa not branch..."
    },
    {
      "id": "mvx1rkc",
      "body": "kid, first thing thats in eligibility will be branch. do you think someone who studied CS & someone who studies ECE will have the same shot at job role thats purely CS? Similarily a CS guy wouldn't make sense for a core ECE role.\n\nthe 2nd thing in eligibility, will be CGPA & backlogs (academic performance). Its not a perfect indicator of ability, but it has correlation with how attentive you can be, how willing to work, how much you can grasp concept, etc.\n\nAnd this is all before the interview. The interview is where you can show your skills. Will not entirely impossible for a ECE guy to get CS jobs, as it has happened and will happen purely due to many people thinking \"I didnt get CS, I should fo ECE\".\n\nI don't know who have been listening to, but you can read all info on placements through many posts here & on discord"
    },
    {
      "id": "mw3ggnt",
      "body": "Valid"
    },
    {
      "id": "mwbay5u",
      "body": "mb bro"
    }
  ]
}