{
  "id": "1l34qeo",
  "title": "Manipal Fintech VS Pes Cs( or AiML) VS Vit Cs",
  "content": "",
  "metadata": {
    "author": "rynmuneer",
    "url": "/r/Manipal_Academics/comments/1l34pni/manipal_fintech_vs_pes_cs_or_aiml_vs_vit_cs/",
    "permalink": "/r/PESU/comments/1l34qeo/manipal_fintech_vs_pes_cs_or_aiml_vs_vit_cs/",
    "score": 2,
    "created_utc": 1749041418,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mvy3x89",
      "body": "Why do you all keep comparing across different branches man. Just pick the best college where you get your most preferred branch."
    },
    {
      "id": "mvyn5vb",
      "body": "If the quality bw colleges is large we shud put college over branch right. Ik manipal is better than pes but idk if the gap bw manipal and pes is large enough to warrant that"
    },
    {
      "id": "mvypdfl",
      "body": "> If the quality bw colleges is large we shud put college over branch right\n\nNot really. No use doing a branch you dont like"
    },
    {
      "id": "mvyqnot",
      "body": "I do find fintech a bit intriguing. Also even if it was another cs spec i wasnt interested in wudnt it be better to take it in a better college opposed to cse core in a worse college considering theres only a small differnce in cs core and cs spec curricula. Its not like im comparing mech and cs"
    },
    {
      "id": "mvysxr1",
      "body": "Concerning that you don't know if Fintech is a CS spec or not. Guess who else won't know, recruiters at companies and admission admins at colleges if you want to do masters there.   \nI'm not sure from a placement pov, but from a masters pov, its always core first. These \"specializations\" have no worth abroad. You'll also want some kinda senior to vet the syllabus of both courses to confirm if there is actual difference, and if its notable or not"
    },
    {
      "id": "mvytscu",
      "body": "Nope. Branch choice trumps college choice always. The effort you will need to put in to achieve what someone in your intended branch will achieve is much higher + you are forgetting many opportunities (Masters, placements, etc) have restrictions based on your branch. The rule is very simple: if you want to pursue a career in X, choose X. Do not choose Y, do not choose X+Z. Just, X."
    },
    {
      "id": "mvyv31b",
      "body": ">a small differnce in cs core and cs spec curricula\n\nThere are many fundamental problems with this. You are (1) assuming you know you will be interested in this field without even exploring it, (2) essentially giving yourself a very difficult exit method in case you do not like it and (3) specialising your degree at a stage when you should be picking up a fundamental degree and when industries have always shown clear preference for core degrees.\n\nThe \"small\" difference is not as important as the points mentioned above."
    },
    {
      "id": "mvywdde",
      "body": "Yea if i was comparing mech and cs ure completely right. But are ur points valid when comparing cs core and a cs spec?"
    },
    {
      "id": "mvywq19",
      "body": "Aight thank u for ur insights"
    },
    {
      "id": "mvywvn5",
      "body": "Ok thank u for ur insights"
    },
    {
      "id": "mw3l8sx",
      "body": "vit is the best option"
    },
    {
      "id": "mwceykw",
      "body": "hey mod I need your opinion on this\nI have got 384 in comedk which would fetch me cse in rv and a 95.6 jm percentile will get cce ig in pes what should I prefer?\nare there any other good options for me at this score?"
    },
    {
      "id": "mwcsdcz",
      "body": "I think the fees at RVCE is lower. Pick RVCE with ComedK."
    },
    {
      "id": "mwd5pi0",
      "body": "okayy ty"
    }
  ]
}