{
  "id": "1l3rvbd",
  "title": "PESU AI ML RR VS THAPAR CSE",
  "content": "",
  "metadata": {
    "author": "Legal_taxation_Mrt",
    "url": "https://www.reddit.com/r/PESU/comments/1l3rvbd/pesu_ai_ml_rr_vs_thapar_cse/",
    "permalink": "/r/PESU/comments/1l3rvbd/pesu_ai_ml_rr_vs_thapar_cse/",
    "score": 8,
    "created_utc": 1749103557,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mw3banw",
      "body": "Was in the dilemma...couldn't justify 32lakhs fees for thapar...so I'm choosing pes"
    },
    {
      "id": "mw3bkgm",
      "body": "10 lakh difference can be easily covered in 2 yrs max"
    },
    {
      "id": "mw4c40o",
      "body": "That's not the point...point is that y should I pay those 10lacs extra anyways..not like thapar has better placements or location💀"
    },
    {
      "id": "mw4hdcd",
      "body": "Placement is far better and location ka Achaar dalna hai kya … trichy aur Kharagpur wale to suicide hi karlein  location ki wajah se"
    },
    {
      "id": "mw4lxo7",
      "body": "Further if going for further studies abroad ..pes is known in banglore and nearby region only with no world rankings … Thapar have strong world rankings and accreditations ,furthermore 10 acres of school kind of campus vs 250 acres full fledged international facilities equipped green campus .. more than a location for a North Indian ."
    },
    {
      "id": "mw4oxuh",
      "body": "You'd be surprised to hear about the PESU alumni groups that exist at all the top unis abroad, or the sheer number of students from PES that end up at schools like CMU, UCLA, UPenn and the like. Just get on LinkedIn, pick a uni, search using \"<uni PES University\" as a query. You'll see how long the list can be. \n\nSaying PES has no international recognition at all is absolutely false. It's definitely no IIT, but we've got a solid presence abroad."
    },
    {
      "id": "mw4q4dt",
      "body": "You yourself know the answer then why asking the question, from your comments it's already clear that you're backing thapar so go thapar"
    },
    {
      "id": "mw4vhhg",
      "body": "91 perc pe aiml milega bi nhi dw"
    },
    {
      "id": "mw4vqqx",
      "body": "22xx rank hai 100 percent milega dada .."
    },
    {
      "id": "mw4w5ru",
      "body": "Last year 2600 Passat rank gets it … this year jee seats will add up"
    },
    {
      "id": "mw4wdfm",
      "body": "Have paid 5.10 lakhs today … genuinely want to the worth .."
    },
    {
      "id": "mw4x0zv",
      "body": "Fair, then it depends on u lol, placements are same check the distance and join the one nearest to u"
    },
    {
      "id": "mw5cc85",
      "body": "Do you realise that avg placement is less than your fees 💀"
    },
    {
      "id": "mw5nyns",
      "body": "I thoroughly chkd placements for both..can confidently say PES is kinda better in that parameter (atleast at an equal level if low balled)"
    },
    {
      "id": "mw5oru7",
      "body": "Fact check : Thapar fees 35 payback period 2 yrs with 18 lpa (considering myself above average \nBITS fees 36 payback 1.75 yrs\nPESU fees 24.00 payback 2 yrs ( for someone average )\nTo kya realise karna hai ??? Faltu ka gyan and … my father’s income is more than 1 crpa so hardly matters to me .💀"
    },
    {
      "id": "mw5v9wg",
      "body": "The world is at Sharda..where r you"
    },
    {
      "id": "mw6px4y",
      "body": "Sry man you could get any seat didn't know your game go ahead ig 😦😦"
    }
  ]
}