{
  "id": "1l5fwlm",
  "title": "Bus Transportation Facility",
  "content": "So guys had pes round 1 counselling.  \nSo i live in electronic city and i chose cse ec today, but almost immediately regretted my choice of not choosing pes rr. I asked the ceo person giving speech and he told i could change my choice to pes rr in second round counselling. The thing I want to ask is whether pes has bus facility from electronic city to rr campus. If some senior could enlighten me on this topic, it'll be really helpful! Thanks!",
  "metadata": {
    "author": "Suzuha369",
    "url": "https://www.reddit.com/r/PESU/comments/1l5fwlm/bus_transportation_facility/",
    "permalink": "/r/PESU/comments/1l5fwlm/bus_transportation_facility/",
    "score": 9,
    "created_utc": 1749284640,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mwgkdjq",
      "body": "If you don't mind can you tell me your jee main percentile and corresponding PESU rank"
    },
    {
      "id": "mwgkiwz",
      "body": "Hey i live in electronic City too and I asked about transportation , he told me there's no buses coming from electronic City "
    },
    {
      "id": "mwgkw46",
      "body": "Are you sure about that? I asked the lady doing registration and she told me yes bus does come to ec, but it did feel like she just said that so i could hurry, lol"
    },
    {
      "id": "mwgkxfq",
      "body": "DMed ya"
    },
    {
      "id": "mwgl5qo",
      "body": "Ye pretty sure although do ask again ig and lemme know if they say yes "
    },
    {
      "id": "mwgljl8",
      "body": "I see :(("
    },
    {
      "id": "mwgm6ga",
      "body": "[bus route link](https://pes.edu/admissions/transportation/) , hope this helps.  \nalso if your travel time is around 1 to 2 hours , better to choose ecc , wont be missing out on much."
    },
    {
      "id": "mwk4qm9",
      "body": "why do u regret your decision tho?"
    },
    {
      "id": "mwlq7am",
      "body": "Thanks! was really helpful!  \nYeah as i thought all the stops are too far away"
    },
    {
      "id": "mwlqdq4",
      "body": "Since like everyone above me choose rr cse,  i was like 2nd or 3rd one to chose ec"
    },
    {
      "id": "mwnhtul",
      "body": "look at the faq's both the campuses are practically the same, the only reason i chose rr is cuz i live kinda close to rr campus"
    },
    {
      "id": "mwnohva",
      "body": "Yeah that's why taking ec"
    },
    {
      "id": "mwy83vd",
      "body": "What's in RR that's not there in ecity "
    }
  ]
}