{
  "id": "1l5hshs",
  "title": "PES University BTech admission: Do they need KCET rnk or just scores?",
  "content": "I wanted to know whether if pesu uses it kcet rnks to create a merit list or they just use raw kcet scores…please help much appreciated ",
  "metadata": {
    "author": "AdExpensive2973",
    "url": "https://www.reddit.com/r/PESU/comments/1l5hshs/pes_university_btech_admission_do_they_need_kcet/",
    "permalink": "/r/PESU/comments/1l5hshs/pes_university_btech_admission_do_they_need_kcet/",
    "score": 1,
    "created_utc": 1749292480,
    "flair": "Admissions",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mwgwd9b",
      "body": "I think raw kcet scores ranks are not considered"
    },
    {
      "id": "mwgwipi",
      "body": "Kcet admissions are handled by kea based on seat availability and candidate preferences, not by PES internally."
    },
    {
      "id": "mwgxkks",
      "body": "Nah this year I’m talking pes has it’s own counselling cuz no pessat so they’ll create their merit list"
    },
    {
      "id": "mwgxrpo",
      "body": "I don't think so they have to comply to the KEA"
    },
    {
      "id": "mwgydmb",
      "body": "no not the kcet counselling this year 45% of the seats is for jee main /kcet quota based on kcet and jee main scores"
    },
    {
      "id": "mwgynu8",
      "body": "Then they will consider rank i guess ."
    },
    {
      "id": "mwgzigj",
      "body": "Nah they asked individual cet marks and then rank"
    },
    {
      "id": "mwgzx7n",
      "body": "Wait pes released kcet merit list as well? I thought they only released jee one??"
    },
    {
      "id": "mwh02at",
      "body": "Nah they’ll release on 14th"
    },
    {
      "id": "mwh0a0j",
      "body": "So like how we had counselling for jee today, we'll have one for kcet too? not through the kea counselling and stuff?"
    },
    {
      "id": "mwh11il",
      "body": "Yes"
    },
    {
      "id": "mwh12l8",
      "body": "Please don’t register for that also"
    },
    {
      "id": "mwh1h9h",
      "body": "They aren't going to consider your biology marks for engineering college. Are they ? Your engineering rank depicts the marks you scored in pcm so what's the difference if they consider pcm marks or engineering rank?"
    },
    {
      "id": "mwh2qx6",
      "body": "isn't kcet fees way lesser than mains one tho"
    },
    {
      "id": "mwh38v3",
      "body": "Nah it’s the same fee go actually see the application form"
    },
    {
      "id": "mwhyswd",
      "body": "Uh no? The ceo person giving speech today himself said that if we get seat through kcet they'll refund the money?"
    }
  ]
}