{
  "id": "1l5ltmg",
  "title": "taking admission in cse aiml, help me chosing electives!",
  "content": "i took admission is pes rr , cse aiml, \n\ni recently came across the post of cse vs aiml \n\n i love maths, so aiml is cool for me\n\nbut it mentioned id be missing out on the fundamentals of coding\n\ncan it be fixed, if i take electives on the things i miss?\n\nif so what electives would they be?",
  "metadata": {
    "author": "Opposite_Antelope804",
    "url": "https://www.reddit.com/r/PESU/comments/1l5ltmg/taking_admission_in_cse_aiml_help_me_chosing/",
    "permalink": "/r/PESU/comments/1l5ltmg/taking_admission_in_cse_aiml_help_me_chosing/",
    "score": 4,
    "created_utc": 1749305702,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mwhvabx",
      "body": "PES mostly covers the fundamentals through the course courses. They kind of fixed the issues with it. Although the entire principle of a specialised degree in undergrad is still flawed."
    },
    {
      "id": "mwhwnbk",
      "body": "What was you rank in PESU JEE. Mine is 221x but I did not sit for round 1 and planning to sit for round 2, is it possible for me toget Cse(AI/ML) at this rank in round 2?"
    },
    {
      "id": "mwi3vnw",
      "body": "For round cse ai/ml  in ring road campus closed at maybe 2200 rank , mine rank  was in  between 2130 to 2150 and 30 seat were remaining"
    },
    {
      "id": "mwi5v17",
      "body": "ah okok\n\nright...so it wouldnt effect anything right?\n\nafter a failure from jee, i want to grow successful in this atleast..."
    },
    {
      "id": "mwi6186",
      "body": "1.5k , got aiml\n\ni dont think youll get aiml in round 2"
    },
    {
      "id": "mwi6j1p",
      "body": "It closed at 2200 today so I think I can get it in round 2."
    },
    {
      "id": "mwi70mb",
      "body": "Hmm...if it works out great👍"
    },
    {
      "id": "mwohp24",
      "body": "U have a great chance of getting aiml as the cutoff goes up couple of 100s"
    },
    {
      "id": "mwvyrfk",
      "body": "It's all the same rn, cse = cse aiml for now, I haven't seen any changes in. 2 years I've been here"
    }
  ]
}