{
  "id": "1l5m7t7",
  "title": "Closing Rnk For CS EC Campus",
  "content": "What was the rnk at which CSE EC Campus closed at?? Seeing the large difference in demand bw aiml rr campus and cse campus got me worried if i made the wrong choice as Im really worried bout the peer group.",
  "metadata": {
    "author": "rynmuneer",
    "url": "https://www.reddit.com/r/PESU/comments/1l5m7t7/closing_rnk_for_cs_ec_campus/",
    "permalink": "/r/PESU/comments/1l5m7t7/closing_rnk_for_cs_ec_campus/",
    "score": 6,
    "created_utc": 1749306785,
    "flair": "Admissions",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mwhvvpk",
      "body": "Judging your peer group based on JEE rank is very biased. Once you join, you will find a mixed bag of people: people with very low JEE ranks getting 9+ CGPA and also people with high JEE ranks struggling to cross an 8 CGPA. You cannot use JEE/PCM scores to project how your batch will perform. Odds are, if you are interested and have a genuine passion for your branch, you will do really well in it, regardless of whatever you scored in JEE.\n\nThe reason people prefer RR over EC has been documented in the FAQs. Please read and educate yourself."
    },
    {
      "id": "mwi0h16",
      "body": "3400 aiml ec and 2200 aiml rr"
    },
    {
      "id": "mwi196h",
      "body": "Aiml closed at 3400 at ec campus?? I thought it would go atleast 4k"
    },
    {
      "id": "mwi1m59",
      "body": "No im asking cse ec"
    },
    {
      "id": "mwi1r1b",
      "body": "3200 ig tha"
    },
    {
      "id": "mwi3dug",
      "body": "I have 2216 rank. Can I expect to get Cse(AIML) at RR campus in round 2. I did not attend round 1."
    },
    {
      "id": "mwi5yth",
      "body": "i had a rank of 374x i was the second last one to close CS ec campus"
    },
    {
      "id": "mwi8r3m",
      "body": "It went till 4k the parent comment is wrong"
    },
    {
      "id": "mwiczvz",
      "body": "Hard to say, gotta take your chances"
    },
    {
      "id": "mwjhkmh",
      "body": "Today the last one to choose was about 224X something rank of PES RR AiMl so considering its the second round ig u have chances .."
    },
    {
      "id": "mwld6pz",
      "body": "Can you tell  the exact rank as I have 4.2k"
    },
    {
      "id": "mwlrp63",
      "body": "4059 for aiml in ec branch 4429 for electrical"
    },
    {
      "id": "mwlwb9y",
      "body": "And for ECE in both rr and ecity?"
    },
    {
      "id": "mwlx7xa",
      "body": "4429 was for ec branch for rr cs ended at 1.4 and ai and 2.2 electrical at 3.2"
    },
    {
      "id": "mwm1dfs",
      "body": "CSE EC closed at 376x"
    },
    {
      "id": "mwm4t4v",
      "body": "what was your percentile?"
    },
    {
      "id": "mwm8u5s",
      "body": "I took cse at ecity, branch closed at 37xx"
    },
    {
      "id": "mwpocak",
      "body": "I got a 37xx rank and there were about 5 seats for cse ec after me"
    },
    {
      "id": "mwsgwid",
      "body": "Bro will I get anything at pesu jee rank 559X?"
    },
    {
      "id": "mwsq19t",
      "body": "Bro chill the peer grp is good in ecc too😭"
    },
    {
      "id": "mwtf7bg",
      "body": "what was ur percentile in mains"
    },
    {
      "id": "mwtfckq",
      "body": "Percentile?"
    }
  ]
}