{
  "id": "1l5vmsc",
  "title": "I missed the counseling and since I have limited options I am panicking, please give clarity!",
  "content": "I didn't know about PES University but was really impressed with it. But when I got to know about it, round 1 registration were closed and hence I missed the Round 1 counseling. Now I am panicking because in one of the posts I saw that seats left for CSE in RR campus in 0. I wanted that only. Is there even the slimmest chance of me getting it in round 2? (95.6+ JM)",
  "metadata": {
    "author": "Hour-Afternoon1417",
    "url": "https://www.reddit.com/r/PESU/comments/1l5vmsc/i_missed_the_counseling_and_since_i_have_limited/",
    "permalink": "/r/PESU/comments/1l5vmsc/i_missed_the_counseling_and_since_i_have_limited/",
    "score": 6,
    "created_utc": 1749331507,
    "flair": "Admissions",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mwld2zv",
      "body": "The cutoff for RR CSE was around 95%.. You have a good chance to get it..."
    },
    {
      "id": "mwlhbmo",
      "body": "you might have a slim chance if someone abandons their seat before round 2"
    },
    {
      "id": "mwlsopo",
      "body": "I need help ...recently filled the form for admission through jee mains ..but there is option to upload the scorecard but on their website it says last date is 15 june"
    },
    {
      "id": "mwluniq",
      "body": "I am surprised you found PESU interesting /s"
    },
    {
      "id": "mwm1t0v",
      "body": "yes senior haha. But I'd be thankful if can you please reply me on what chances are about getting CS in 2nd round based on how ranks fell in previous years of PESSAT. Because before 2024 they used to convert merit seats into management quota (as per this subreddit). And also JEE Main Round 5 results will come on July 10 and PES will conduct Round 2 after 15 July (they're taking JEE ranks till 15 July that's why) so will this affect in falling of cutoff?"
    },
    {
      "id": "mwm1v4q",
      "body": "Thankyou, hopeful !!"
    },
    {
      "id": "mxyr1bx",
      "body": "Can i register now fresh for round 2? :’/"
    }
  ]
}