{
  "id": "1l68bi3",
  "title": "MIT cse or PES cse?? (Main campus in both)",
  "content": "Please help me choose!\nAnd please give ne proper reasoning for both",
  "metadata": {
    "author": "SiteOk7265",
    "url": "https://www.reddit.com/r/PESU/comments/1l68bi3/mit_cse_or_pes_cse_main_campus_in_both/",
    "permalink": "/r/PESU/comments/1l68bi3/mit_cse_or_pes_cse_main_campus_in_both/",
    "score": 19,
    "created_utc": 1749375684,
    "flair": "Admissions",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mwmqr7y",
      "body": "Manipal"
    },
    {
      "id": "mwmrqkj",
      "body": "remind me! -  1 days"
    },
    {
      "id": "mwmrveh",
      "body": "PES has better placements ,  peer group \nManipal has slightly better campus life \nImo pes anyday"
    },
    {
      "id": "mwmseg4",
      "body": "Nobody is falling for that trick"
    },
    {
      "id": "mwmsfaj",
      "body": "Pes cs obviously"
    },
    {
      "id": "mwmszb5",
      "body": "it is the consensus on this subreddit that Manipal main campus > PES RR you can search the subreddit if you want. Also i already have a seat at PES RR CSE so I have no need to manipulate OP to make a wrong decision"
    },
    {
      "id": "mwmt775",
      "body": "MIT CSE no doubt"
    },
    {
      "id": "mwmvt5u",
      "body": "If u are not joking then u might be one of the most stupidest persons i have ever met"
    },
    {
      "id": "mwmy4qr",
      "body": "I feel pes cse as fees slightly higher in manipal I think but placements wise both are similar offering good opportunities"
    },
    {
      "id": "mwmziew",
      "body": "It's better to do a poll or ask a senior"
    },
    {
      "id": "mwmzluo",
      "body": "Both are equivalent imo pes offering more on the research+scholarship front"
    },
    {
      "id": "mwn1859",
      "body": "MIT cse if you want a better campus life i guess, placement opportunities are somewhat equal in both campuses.  \nThese dumbareses who are d-riding college based only on placements should know that you are the one who is gonna give the interview and get a package from company, bagging a good placement is solely dependent upon you. Both colleges are equally good. Think carefully and make a decision i guess"
    },
    {
      "id": "mwnl10l",
      "body": "Between them I'm only joining pes if I'm getting in through kcet, otherwise mit anyday"
    },
    {
      "id": "mwouwd1",
      "body": "Why though?? I went to pes yesterday...the campus,placements, internships, everything seems incredible\nWhy mit cse without a doubt??\nI genuinely want to know"
    },
    {
      "id": "mwouziv",
      "body": "Why though?? I went to pes yesterday...the campus,placements, internships, everything seems incredible\nI genuinely want to know"
    },
    {
      "id": "mws34xa",
      "body": "Back in 2022, i have got computer science at manipal and the reason my parents stopped me is due to the environment and culture of parties and all that shit, and things are chill like you can do anything like you get it right, and pes is kinda strict, and when it comes to placements see it depends 80% on you and 20%on the college, like the influence ratio..."
    },
    {
      "id": "mws5s57",
      "body": "Umm...incredible is a overstatement\nIt's decent \nBut batch size is huge\nManipal has similar placements with lesser competition \nAlso better college life"
    },
    {
      "id": "mwu3l8n",
      "body": "Ask this in the mit group and see them suggest their college 😂"
    }
  ]
}