{
  "id": "1l7cls2",
  "title": "How do I uncook myself, i really value college life 😭",
  "content": "guys i took cse in ec campus in round 1 bcs that bald guy told me there’s no diff in campuses 😭😭 i got 2.6k… is cs ai/ml possible in rr in round 2? i legit can’t survive ec campus bro it’s so ass 😭😭😭 should i drop cse in ec and worst case even take ece in rr instead?? pls guide 🙏🏻\n\n",
  "metadata": {
    "author": "SIGMAHUMANBEING",
    "url": "https://www.reddit.com/r/PESU/comments/1l7cls2/how_do_i_uncook_myself_i_really_value_college_life/",
    "permalink": "/r/PESU/comments/1l7cls2/how_do_i_uncook_myself_i_really_value_college_life/",
    "score": 5,
    "created_utc": 1749494134,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mwvnzbh",
      "body": "If you aren't passionate about cse, take ece rr. If you're passionate then stay in ecc and cry, but you'll be crying doing you're passionate about"
    },
    {
      "id": "mwvo7wl",
      "body": "but is the crowd really that bad in ec campus? compared to other clgs"
    },
    {
      "id": "mwvofpq",
      "body": "It's ass bro the whole place is a jail theres no campus life as such and no big artist's for fests too, it's just a campus full of people who wish they were in rr"
    },
    {
      "id": "mwvoyzp",
      "body": "i value fests alotttt, i come from a clg with alottt of fests and I'm really passionate about cse aswell i really don't know how to choose from 😭"
    },
    {
      "id": "mwvp756",
      "body": "dm me I've done my share of research in ur phase, kisi ko toh kaam aaye"
    },
    {
      "id": "mwvpvad",
      "body": "how different is RR?"
    },
    {
      "id": "mwvq35m",
      "body": "Pls read FAQ"
    },
    {
      "id": "mwvre5n",
      "body": "There's no objective difference between campuses. Same degree, same placements, similar peers. Check the FAQs for the other subjective difference. EC has more open spaces, better tech clubs, but RR has better infra, bigger fests (although I'll add in that you can always attend fests at any campus), more clubs (not better though). At the end of the day, both campuses will provide you with the same opportunities and degree. What will differ is the experience. \n\nBesides, the campus is going to affect you for 3 years; the branch you choose today sticks with for your life. Now which is more important?"
    },
    {
      "id": "mwvrk05",
      "body": "But you can literally attend fests at either of the campuses. If you're attending, how is that a differentiator?"
    },
    {
      "id": "mwvrqk1",
      "body": "It doesnt really mention the difference in strictness of RR campus compared to EC"
    },
    {
      "id": "mwvrtrw",
      "body": "Valid point by pride of pesu"
    },
    {
      "id": "mwvsaru",
      "body": "Bs comment ignore. Ec suxcks"
    },
    {
      "id": "mwvsew8",
      "body": "ecc is obviously more strict ur 4 yrs of engineering are in a circular building with jail grills on every floor"
    },
    {
      "id": "mwvsn46",
      "body": "Why don't you share what exactly you don't like? Besides, my opinion on choosing the campus based on the branch will always be valid. Do you suggest sacrificing a lifelong affecting branch over 3 years of (what you claim) average college life?"
    },
    {
      "id": "mwvtqf9",
      "body": "Who tf told u its bad in EC?"
    },
    {
      "id": "mwvtxq8",
      "body": "EC is more chill in some ways, we dont have bouncers."
    },
    {
      "id": "mwvubvm",
      "body": "i mean i went there today and it was ass 💀"
    },
    {
      "id": "mwvx4it",
      "body": "the crowd? What crowd u saw now lol, all engineering students have holidays now.   \nEvery classroom has wifis, TVs, and plugs.   \nRR has a fancy campus but EC is fine compared to BMSCE, RVCE etc  \nHave u seen mrd student center that place is nice."
    },
    {
      "id": "mwvxke7",
      "body": "EC is clearly the best u can do , no point calling it ass, unless u urself are ass."
    },
    {
      "id": "mwvxurj",
      "body": "fire comeback but ec pes <<< rvce, bms; they have legacy as top 5 colleges in Karnataka, pes ecc does not."
    },
    {
      "id": "mwvxwqv",
      "body": "i see your point, and that's fair too, the problem I had was how old the campus looked to rr, i was really shocked at the contrast cus i assumed its the \"same,\""
    },
    {
      "id": "mwvyf4w",
      "body": "can the students of the other campus be involved in the organisation of the other fests cus visiting barely makes a difference tbh, i could pay my way in aswell"
    },
    {
      "id": "mwwv7ye",
      "body": "This really boils down to what you expect from your \"college life\". Regardless of which campus you end up in, you will still have to deal with the fact that you're in PES. It's going to be academically rigorous, and most of the time you'll be cussing the college out rather than your campus. \n\nIt's already been answered in the FAQ's, but there is quite literally no difference in the campuses. RR has more intake, so sure you might find your crowd there, but it doesn't mean that EC has a \"bad\" crowd. The buildings are newer in RR, so if the college life you are picturing involves looking at fancy buildings, go ahead, take whichever course you get there. \n\nEven if you don't get the chance to switch to the course you want now, at the end of the first year, you'll be allowed to switch courses/campuses based on your cgpa. If you truly hated the experience you got at EC, you can just shift then lol (shifting to RR-CSE is incredibly tough though) . Choose what you're interested in, don't make a decision purely because the reality didn't match your expectations :)"
    },
    {
      "id": "mwwvpzx",
      "body": "nope, you can help organize fests only for your own campus, unless you have friends in high places lmao"
    },
    {
      "id": "mwxmb8c",
      "body": "I'm sorry how are those grills hurting you? (Unless u wanted to jump off?)"
    },
    {
      "id": "mwy3ao7",
      "body": "Bruh the last statement is ppl like you, not our fault lmao"
    },
    {
      "id": "mwy3idj",
      "body": "Bruh what's so bad?"
    },
    {
      "id": "mwy5vm4",
      "body": "He was talking about the campus"
    },
    {
      "id": "mwy8p9u",
      "body": "This guy is getting cooked by first years 😭"
    },
    {
      "id": "mwyndsn",
      "body": "Comment unrelated to the post."
    },
    {
      "id": "mwynmzi",
      "body": "The education is the same lol, how tf does campus matter."
    },
    {
      "id": "mwynrcv",
      "body": "That dude is prolly not even from pes lol"
    },
    {
      "id": "mwyxba3",
      "body": "Wdym you cant survive ec campus bro? YOU HAVENT EVEN JOINED ?"
    },
    {
      "id": "mwzqhy5",
      "body": "Yes i suggest you should drop pes, even rr campus, the bald guy won't tell you this but I will, maramma institute of technology is better, they teach you everything about cloud in the cloud and about artificial intelligence all from the basics of artificial colouring and preservatives, maramma institute of technology has 100% in campus placement as a security guard, something pes can't provide for you, also the crowd is perfect, there is no crowd, u can sleep all day and still get placed and be the topper of the University, how cool is that? \nIt's not a jail as well like someone else was mention about EC , maramma institute of technology has open sky classrooms since the roof is unfinished and they teach you about weather forecasting and prediction models real time using windows XP running chat gpt on internet explorer, i strongly suggest maramama institute of technology to be the one for you"
    },
    {
      "id": "mwzr41b",
      "body": "Also no need to uncook too much, food in all hostel mess in Bangalore is uncooked only, no need to put any special efforts for that be it MIT or pes everyone eats the same uncooked roti and rice."
    },
    {
      "id": "mwzuuwn",
      "body": "bro got offended 🥀, I'm sorry if it hurt your sentiments but I come from a very strong festing and munning background and i really felt like i would be hampered of a lot of joys this has brought to me. again I'm apologetic for my tone."
    },
    {
      "id": "mwzwcmo",
      "body": "\"munning\" there's no such word called munning, pata nahi with that vocabulary kya mun karta hai tu, par theek hai, this is not bihar that you can conduct your \"mun\" in every galli about what ghutka stains can be used to colour walls, usko mun nahi kehte\n\n\n\"Festing\" both campus have only 1 fest, koi special nahi hai tu, and both campus can visit each other's fest\n\nYou visit the campus when everyone is on their holidays and say \"bad crowd\" then bring up \"munning\" out of nowhere \n\n\nAlso if you are seriously into extra curriculars more than studies i suggest u don't join either of the campus, pes is not for you, u will barely have time after the assignments extra classes and back to back tests isas etc. student of the year movie nahi hai college life"
    },
    {
      "id": "mwzwlqa",
      "body": "yo wait if you are from ecc do you mind if I dm you??"
    },
    {
      "id": "mwzwmyk",
      "body": "Was* , and ok"
    },
    {
      "id": "mx03hoy",
      "body": "He has the 3rd year tag tho💀"
    },
    {
      "id": "mx6jvki",
      "body": "Anyone assign it to themselves lol"
    }
  ]
}