{
  "id": "1l7qcpv",
  "title": "Doubt regarding counceling",
  "content": "I got  1670 and I took cse in ec I want to change it to aiml in rr is it possible ",
  "metadata": {
    "author": "Great-Sea-9382",
    "url": "https://www.reddit.com/r/PESU/comments/1l7qcpv/doubt_regarding_counceling/",
    "permalink": "/r/PESU/comments/1l7qcpv/doubt_regarding_counceling/",
    "score": 3,
    "created_utc": 1749531643,
    "flair": "Club Post :upvote:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mwyrf3l",
      "body": "Round 2 maybe yes"
    },
    {
      "id": "mwysgrw",
      "body": "https://preview.redd.it/je02zept916f1.png?width=988&format=png&auto=webp&s=dee49732957c53a5becb8d52a0c61b701e1a98da\n\nbtw, when will i be able to do this"
    },
    {
      "id": "mwzkyi2",
      "body": "U can in round two, but why downgrade from cse to aiml?"
    },
    {
      "id": "mx0ho38",
      "body": "cAuSe Rr Is SuPeRiOr CaMpUs BrO"
    },
    {
      "id": "mx53hbt",
      "body": "hey can i apply now? it is closed on website it says last date to apply is in july but it also says that first round is conducted for jee mains scorer"
    },
    {
      "id": "mx5vw0o",
      "body": "i mean, it is, in terms of student/company you will have?"
    },
    {
      "id": "mx61587",
      "body": "Dude I got 92%ile in jm and is it beneficial to apply in counselling. I want CSE or specialisation in RR campus. Is there any seats left for round 2? (My HS is Delhi btw)"
    },
    {
      "id": "mx64f9s",
      "body": "yeah, you can apply for round 2. keep checking regularly for when the portal opens."
    },
    {
      "id": "mx697w4",
      "body": "try for cse first in rr or ecc, i would say apply, why not?"
    },
    {
      "id": "mx6g5gu",
      "body": "Brother will get because there is no past year cutoffs based on jm. Still I will surely do. \nI wanted to know that placement % is 85% so it is like they allow every student (around 1400) to sit or like other clg they eliminate by cgpa and attendance criteria and allow only 1/2 or 2/3 of the batch size?\n\nP.S-Don't mind me asking because in Delhi all these top Pvt clg hype there placement and I don't know the condition of BLR.PES will be costly for me (around 25-27L) so I'm little concerned."
    },
    {
      "id": "mxin3gd",
      "body": "PES cse placements are very good tbh, the gpa cutoff is 6.75 ( 90% cross it, its very easy to cross this tbh) so most of the batch does sit for placements.   \nThe JEE quota is pure merit ( 50% seats i think), KCET quota is government control so it has reservation."
    }
  ]
}