{
  "id": "1l9mvjh",
  "title": "Need insights on the difficulty of Big Data as an elective",
  "content": "Hi everyone. I’m trying to choose my Elective II and I’m stuck between Big Data and CNS\n\nMy cgpa is not great- between 7.75 and 8, I'm a pretty average student and a slow learner.\n\nI checked the BD syllabus, spoke to a few seniors, and also asked some people working in the industry. Most of them say that BD is more useful and important these days, especially with AI and data now being such a big part of tech. It also shows up in many job descriptions so it seems better for placements overall.\n\nBut I also heard that the assignments and projects in Big Data are really difficult and time consuming. The plagiarism checks are very strict. People say that exams are easier. Still, I’m worried. I don’t want to lose marks and let my CGPA drop just because of this subject. I also need time to prepare for placements and internships.\n\nOn the other hand, CNS seems relatively easier and also interesting. And since we already studied Computer Networks in 4th semester people say that’s enough for most placements. I’m not sure if CNS adds much more value. \n\nWhen it comes to interest, I don't mind either, and have narrowed it down to BD and CNS specifically because the other options didn't appeal to me.  \n\nSo my questions are\n\n1. I wanted to take AC as my first elective. Does the specialization certificate (AC + CNS) actually make any difference for placements or future opportunities?\n\n2. Is Big Data a risky subject for me considering my cgpa\n\n3. Is it possible to manage it along with placement and internship prep\n\n4. For those who have done Big Data, is it as bad as DDCO or any other really tough subject from earlier semesters?",
  "metadata": {
    "author": "be4205",
    "url": "https://www.reddit.com/r/PESU/comments/1l9mvjh/need_insights_on_the_difficulty_of_big_data_as_an/",
    "permalink": "/r/PESU/comments/1l9mvjh/need_insights_on_the_difficulty_of_big_data_as_an/",
    "score": 4,
    "created_utc": 1749735929,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mxdt68v",
      "body": "Dude. How long are you going to stretch this? At this point you're procrastinating taking a decision, not collecting information. \n\nYou claim that you've spoken to others, including seniors, alumni and people working in the industry. They've all given you their opinions on BD. And that is all they're going to do. **Nobody is going to make the decision for you**. People have given you their pros and cons, their insights and feedback, it's now **your turn** to take all those insights and make your decision. **We are not here to tell you to take/not take BD** - nobody here is going to hold your hand and tell you what to do. \n\nMake a decision on your own. You're an adult now, and you practically have all the information you might need. Questions like \"will this help me?\", \"will it damage my CGPA?\" etc - only you can answer these based on your abilities. \n\nStart being more decisive. You aren't going to find validation for your decision here. Frankly, nobody cares what you pick. You asked for information, and we've given it. Now do what you need to do."
    }
  ]
}