{
  "id": "1lalufn",
  "title": "CSE/AIML Juniors: Would you pay a small fee for a semester of mentorship to boost your GPA?",
  "content": "We’re a team of your seniors CSE & CSE AIML (9.8+ SGPA & 6x MRD Scholarship recipients) who’ve been there, done it, and mastered it. We’re passionate about guiding you to do the same and reach your goals in 3rd semester and beyond for \\*CSE & CSE AIML ! \n\n If you’re interested in getting our support and a step-up to a superstar GPA, please fill this short form to let us know!\n\n➡ [https://tally.so/r/3EYQVN](https://tally.so/r/3EYQVN)",
  "metadata": {
    "author": "Numerous-Fail3444",
    "url": "https://www.reddit.com/r/PESU/comments/1lalufn/cseaiml_juniors_would_you_pay_a_small_fee_for_a/",
    "permalink": "/r/PESU/comments/1lalufn/cseaiml_juniors_would_you_pay_a_small_fee_for_a/",
    "score": 0,
    "created_utc": 1749835717,
    "flair": "Study Help :table:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mxlmd0z",
      "body": "Is it open to people who haven't even joined yet but have got admission?🧍‍♀️"
    },
    {
      "id": "mxlmpb9",
      "body": "I will do it for free. \n\nCollege is not hard, cs is especially not hard. There will be almost no concept in the entirety of the three years that will be very \"hard\" to understand. \n\nDon't think of it as 11/12th where you can actually not understand stuff, it's more like 10th. \n\nIn exams you rarely feel \"ahh i don't understand this\", the most common thing you feel is along the lines of \"ahh shit I can't remember the 4 points, i only remember 2\" \n\nIf you want a higher cgpa, the only thing you need to do is spend more time remembering stuff. Formulas, algorithms, or theory. Most of every single subject is pretty trivial to understand. The hard part is remembering them, and caring enough to study. If pes had open book exams, the average cgpa would probably be in this 9.5s\n\nDon't pay for this, just study"
    },
    {
      "id": "mxlnfzl",
      "body": "If everyone literally just went thru the advice on this sub-reddit, everyone would have a 9.5.\n\nThey aren't paying because they NEED it, they're paying cus paying for something is a commitment, you won't cancel an order you've paid for and isn't refundable right? same logic"
    },
    {
      "id": "mxlnhk7",
      "body": "no disrespect but looks to be a scam cuz this is the only post by the account"
    },
    {
      "id": "mxlnkl4",
      "body": "Only for CSE/CSE AIML 3rd Sem for now"
    },
    {
      "id": "mxlo0ta",
      "body": "Can't use main acc cus that one has my name :) made an acc just for this post"
    },
    {
      "id": "mxlo53s",
      "body": "If paying lakhs to the college doesn't give people enough \"commitment\", I'm sure they're not going to get it from paying a bunch of opportunistic muppets like yourselves"
    },
    {
      "id": "mxlo82e",
      "body": "Bro, how does this make sense? Can someone explain? There are a bunch of seniors like Pranav, Advaith, and Siya who are most active in the ISA ESA group and guide us on how to study for free. They even have a GPA above 9.5. No disrespect, but you all should do this for free or just don't who charges money for this"
    },
    {
      "id": "mxlofxc",
      "body": "very valid point, but its worth a shot"
    }
  ]
}