{
  "id": "1lclxuf",
  "title": "Pes ec campus girls hostel (living space)",
  "content": "So I got cse core in ec campus in the first round of counselling. We were looking for hostels and found this amaatra academy living space thing 5-6 km outside the campus. My family is like in btech you have to study a lot so it's best to stay at a hostel rather than a pg. But i saw the rules and regulations of this living space yesterday and I'm TERRIFIED. Wdym i have to take permission to use my laptop and no phones after 11 pm??? And coming back till 6:30 pm, can't leave your room from 6 pm to 7 am, permissions for everything, no meals from outside, can't cook inside the rooms.\nI've never lived in a hostel before but these rules seem way too harsh.\nIs anyone living there? Are these rules actually implemented?",
  "metadata": {
    "author": "AddressUnable842",
    "url": "https://www.reddit.com/r/PESU/comments/1lclxuf/pes_ec_campus_girls_hostel_living_space/",
    "permalink": "/r/PESU/comments/1lclxuf/pes_ec_campus_girls_hostel_living_space/",
    "score": 6,
    "created_utc": 1750056037,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "my1fyhu",
      "body": "These are just on papers, no one really follows them"
    },
    {
      "id": "my1g40n",
      "body": "Okay that's a relief"
    },
    {
      "id": "my1g5cp",
      "body": "You should call the amaatra warden and clear your doubt"
    },
    {
      "id": "my1k60x",
      "body": "Only 6.30 curfew part is true out of whatever u listed out"
    },
    {
      "id": "my1k9f3",
      "body": "Okayy"
    },
    {
      "id": "my1kb37",
      "body": "And can we order food? Like from zomato and all"
    },
    {
      "id": "my1lc9x",
      "body": "yes you can, but you have to get it delivered before 8 (or maybe 830 i'm not sure). there's also a stove which you can use if you want"
    },
    {
      "id": "my1mct8",
      "body": "Okayyy"
    }
  ]
}