{
  "id": "1ldnmy6",
  "title": "Has anyone received the counselling fees refund",
  "content": "Has anyone gotten the refund of 5,10,000 online counselling fees ? I didnt opt any seat. When i can expect the refund ?",
  "metadata": {
    "author": "Ok_Strategy4085",
    "url": "https://www.reddit.com/r/PESU/comments/1ldnmy6/has_anyone_received_the_counselling_fees_refund/",
    "permalink": "/r/PESU/comments/1ldnmy6/has_anyone_received_the_counselling_fees_refund/",
    "score": 6,
    "created_utc": 1750168201,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "my9i3mh",
      "body": "![gif](giphy|qEdbSUizkOx9MWBysO)\n\nGot bad news for you my dude /s"
    },
    {
      "id": "my9no9a",
      "body": "you’ve been posting really funny gifs as answers lately…Love em"
    },
    {
      "id": "mydss46",
      "body": "![gif](giphy|8HDAmsthnaGKa2658T|downsized)"
    },
    {
      "id": "mydwkm9",
      "body": "Yup I got back my fees that i had paid for ece in rr campus"
    },
    {
      "id": "myeib38",
      "body": "I had a management seat but got in through JEE Quota, they said the excess amount will be refunded automatically, but it was infact not automatic. \n\nI emailed Kavyashree (admissions office) and she asked for some documents, and later said that the refund would be initiated \n\nIt's been 4 days since i got that email 💀 still no refund"
    },
    {
      "id": "myewftn",
      "body": "Whenever I call them, they say a refund will be generated within 10-15 days. Still, I have no idea when the refund will be issued."
    },
    {
      "id": "myhxyzp",
      "body": "I was in ur situation but pessat last year, they gave the excess back in like 3 days"
    },
    {
      "id": "mzhx8fw",
      "body": "dude what to do now they cant just keep doing this and which number did u call on they arent picking \n\nup my calls only"
    },
    {
      "id": "mznsag4",
      "body": "Bro any update ? I still didnt get the refund, I contacted them last week through email and they said they will refund in 1 week time."
    },
    {
      "id": "mznu32u",
      "body": "i went to the campus to get it squared out, they said they'll refund by monday\n\nso i think its like a 2-3 week wait time until they refund"
    }
  ]
}