{
  "id": "1lfffrm",
  "title": "How to force PESU to print my PDC I paid for ?!",
  "content": "I paid 600 to get my PDC delivered my Post...and this request was made on Saturday!(6 days ago) And it looks like they haven't even printed it out let alone post it! 😡😡😡 and my employer wants it within tomorrow.\n\nI honestly hope this is my last straw with regards to this college. ",
  "metadata": {
    "author": "consuded",
    "url": "https://www.reddit.com/r/PESU/comments/1lfffrm/how_to_force_pesu_to_print_my_pdc_i_paid_for/",
    "permalink": "/r/PESU/comments/1lfffrm/how_to_force_pesu_to_print_my_pdc_i_paid_for/",
    "score": 6,
    "created_utc": 1750351190,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mynugi6",
      "body": "Honestly, shouldn't have opted for the post option. They are infamously slow at posting your PDC. As with all things related to the COE, it is significantly faster to handle issues/requests in person. Many people in my batch who were posted in different cities had their friends in Bangalore collect the PDC on their behalf, scan it, and send a copy within the same day, so they could share it with their employer and then post it to them over the next few days. \n\nIf you are in the city - go pay them a visit and sort it out. Else, send a proxy. Either way, unless you make a visit they will not speed things along."
    },
    {
      "id": "mynv3vz",
      "body": "So in ec campus , there is a person(pavithra) you can contact  for.  I think if your from rr someone might be there to contact."
    },
    {
      "id": "mynyj6t",
      "body": "Go in person and ask. If you send someone else you will need to fill another form.   \nI think they take 1 week minimum irrespective"
    },
    {
      "id": "myo2zrs",
      "body": "convince employer vs force PESU. pick one"
    },
    {
      "id": "myr0wuc",
      "body": "Does COE have any phone number I can dial up? Or only email ID? Please DM if you guys know"
    }
  ]
}