{
  "id": "1lhj55i",
  "title": "Help me with pesu councelling ‼️",
  "content": "Anyone who went for round 1 councelling were any mechanical seats taken in coucel process?",
  "metadata": {
    "author": "ShapeApprehensive864",
    "url": "https://www.reddit.com/r/PESU/comments/1lhj55i/help_me_with_pesu_councelling/",
    "permalink": "/r/PESU/comments/1lhj55i/help_me_with_pesu_councelling/",
    "score": 1,
    "created_utc": 1750581382,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mz4fwaa",
      "body": "Barely 1 or 2 i remember"
    },
    {
      "id": "mz4gcx5",
      "body": "I got around 47xx in kcet merit list do you think it's possible for me to get it?"
    },
    {
      "id": "mz4h7nl",
      "body": "Yeah you can get"
    },
    {
      "id": "mz4ols3",
      "body": "I got 52XX rank in kcet pes counselling. My other options are dsce mech/ete or ruas robotics. Will i get pes and is it my best option"
    },
    {
      "id": "mz4oqm2",
      "body": "I got 52XX rank in kcet pes counselling. My other options are dsce mech/ete or ruas robotics. Will i get pes and is it my best option"
    },
    {
      "id": "mza7nlx",
      "body": "I got 1822 in the kcet merit list for pes, can I get ece in rr campus?"
    },
    {
      "id": "mzahgff",
      "body": "you might get cse too"
    },
    {
      "id": "mzaqsbe",
      "body": "This is not my kcet rank, this is the rank which pes gave out"
    },
    {
      "id": "mzgkk41",
      "body": "yeah i know, i got rank 2123 thru jee mains counselling and got cse in rr so maybe we can base it off of thag"
    },
    {
      "id": "mzgld9q",
      "body": "I got 1545 through jee mains thingy and i didn't opt for it because of the fee, what if the fee for the kcet one is cheaper?"
    },
    {
      "id": "mzglit0",
      "body": "i mean the fee for both seats through kcet and jee counselling (by pesu) will be the same (5L) but if you want to apply through regular kcet counselling of the government, you might get it for way lower fees"
    },
    {
      "id": "mzgnk8m",
      "body": "Do you think I can try for ece (pes kcet rank:- 47xx)"
    },
    {
      "id": "n071ova",
      "body": "It depends on the seats surrendered by candidates who got seats in the first round, because all the PES 45% quota seats were full. Also depends on how many PESU ranker before your rank turn up on the counselling day."
    }
  ]
}