{
  "id": "1ligx4y",
  "title": "Joing PES maybe this August",
  "content": "I am getting tier 3 NITs and other pvt colleges like Manipal (main campus cs) and VIT Vellore cs, also getting PES CSE (in ec campus) will it be a good decision to join PES ?",
  "metadata": {
    "author": "Zealousideal-Ear7644",
    "url": "https://www.reddit.com/r/PESU/comments/1ligx4y/joing_pes_maybe_this_august/",
    "permalink": "/r/PESU/comments/1ligx4y/joing_pes_maybe_this_august/",
    "score": 8,
    "created_utc": 1750686156,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mzbws7i",
      "body": "you can consider manipal cs if you want better college life , placement wise both are more or less same . "
    },
    {
      "id": "mzbwyk7",
      "body": "is PES not better than Manipal?"
    },
    {
      "id": "mzbxfb4",
      "body": "location wise pes better in other aspects manipal"
    },
    {
      "id": "mzc1njj",
      "body": "i mean how can a stduent who has never attended any of the college (pes or manipal) can say manipal is better? just bcoz u have read some reddit reviews?"
    },
    {
      "id": "mzc6lrb",
      "body": "who said listen to me i am just giving my opinion"
    },
    {
      "id": "mzce637",
      "body": "I like your confidence dude \nEveryone who joins the clg knows pes has a school like nature or realises it sooner or later"
    },
    {
      "id": "mzczuj7",
      "body": "Pes cse is better than manipal cse in every aspect except college life"
    },
    {
      "id": "mzd1ifr",
      "body": "Just join manipal it has better college life than ec campus"
    },
    {
      "id": "mzh5yhi",
      "body": "Pes rr campus is the main campus and the placements are quite good for cse from what I've heard. People I know told me that the college life isn't great there. If you're academic orientated then pes is good but if you're looking for a rly good clg life Mit Manipal and Vit Vellore id definitely what you should go for."
    },
    {
      "id": "mzhqutk",
      "body": "i dont know about tier 3 nits , im from hyd , i had a vit vellore cse , manipal main campus (aiml) and pes rr cse, and i am in pes rr cse right now , i think i made a pretty good decision, couple of my friends are in ec campus cse ..."
    },
    {
      "id": "mzhr7os",
      "body": "is ec good too ????"
    },
    {
      "id": "mzhsxsx",
      "body": "Both the campus are the same (that's what the ceo person told us in orientation), placements are centralised and afaik the tests in both the campus are same too  \nI had both the option of RR and EC campus, chose EC since my house is barely 10 mins from it"
    },
    {
      "id": "mzu8udb",
      "body": "Vit vellore college life🤡"
    },
    {
      "id": "mzvtda4",
      "body": "clg life is better there anyday"
    },
    {
      "id": "mzwl0mr",
      "body": "Yes, 7pm hostel curfew with mandatory attendance,  pda officers everywhere, no contact with the other gender, more cse seats than people in Tamil nadu, so much competition. Funnest jail in india, you'll really enjoy your life😃"
    }
  ]
}