{
  "id": "1lj5p38",
  "title": "Who is the best Professor for capstone mentoring.",
  "content": "Can anybody please tell how these professors are as a capstone guide cause I am thinking of choosing one of them as my capstone guide.\nDomain (ml,nlp)\n\nDr Jyothi R\nChitra G M\nDr Preethi P\nDr priyanka H",
  "metadata": {
    "author": "NewCaptain4469",
    "url": "https://www.reddit.com/r/PESU/comments/1lj5p38/who_is_the_best_professor_for_capstone_mentoring/",
    "permalink": "/r/PESU/comments/1lj5p38/who_is_the_best_professor_for_capstone_mentoring/",
    "score": 6,
    "created_utc": 1750753814,
    "flair": "Capstone 🏗️",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mzhalla",
      "body": "Don't choose Jyothi r, chita g m and priyanka h. Avoid them at all cost. Even preethi p is not so good, but if you don't have an option it's a good one then"
    },
    {
      "id": "mzhoar2",
      "body": "What about ashwini m joshi, Dinesh singh, Surabhi Narayan, Shivagamasundari"
    },
    {
      "id": "mzhoc29",
      "body": "What about ashwini m joshi, Dinesh singh, Surabhi Narayan, Shivagamasundari"
    },
    {
      "id": "mzhon8h",
      "body": "Surabhi mam is great. Other all are not so good for ml domain."
    },
    {
      "id": "mzj5bdp",
      "body": "Shivagamma no way"
    },
    {
      "id": "mzjfcxc",
      "body": "Ashwini mam was our CN faculty in 4th sem and was very good at teaching and hands-on. But some reddit posts on her says that she is not good at mentoring [but it seems that she is well versed in her domain-ML(I'm telling this based on her depth knowledge and clarity on explanation in CN)] and won't provide good grades. The grades are decided by panel and not by mentors right?\n\nIf anyone got her as a capstone mentor or any of your friends got her & shared their experience with you, please share it with me as soon as possible.🙏"
    },
    {
      "id": "mzjwjf4",
      "body": "Grade depends majorly on your mentor more than panel;"
    },
    {
      "id": "mzmpiq8",
      "body": "Please tell about her (Ashwini mam) as a mentor"
    },
    {
      "id": "mznscc9",
      "body": "I have heard she is not so good as a mentor."
    }
  ]
}