{
  "id": "1ljci4o",
  "title": "Help me make a decision on what college to choose",
  "content": "So the thing is i have got 263 in bitsat and i have my cse seat confirmed in EC campus the thing is i’ll most probably get msc in bits but if i have to surrender the seat i gotta do before july 7 and bits’s iteration 1 is on 9 july and considering how cutoffs are increasing for bits every year it might be cut to cut so help me what to do",
  "metadata": {
    "author": "Ill_Macaron2446",
    "url": "https://www.reddit.com/r/PESU/comments/1ljci4o/help_me_make_a_decision_on_what_college_to_choose/",
    "permalink": "/r/PESU/comments/1ljci4o/help_me_make_a_decision_on_what_college_to_choose/",
    "score": 4,
    "created_utc": 1750775147,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mzioa33",
      "body": "cfbr"
    },
    {
      "id": "mziobq8",
      "body": "All I'll say is msc is a huge risk if you want cse"
    },
    {
      "id": "mzip027",
      "body": "bits should be an easy pick. U can easily get goa msc eco, take cs as ur dual degree from 2nd year"
    },
    {
      "id": "mzipokj",
      "body": "I am already a dropper so graduating at 24 and then 5th year is only for internships that just sets me back 2 years for the sake of college name"
    },
    {
      "id": "mziqovu",
      "body": "I don't understand how that's a problem. U are getting a college with way more exposure and better college life + ur desirable branch if u study decently in first year. Anyways, your call."
    },
    {
      "id": "mzj6f5t",
      "body": "There is a long post on college vs branch in the FAQs. \n\nTLDR - if you \\*really\\* care about learning and pursuing CS, and have plans of a Masters, pick wherever you get CS. Undergrad branch matters a lot more than where you are from. Plus given my understanding, Msc does not guarantee CS as a dual option, and BITS is pretty tough to crack a high GPA. On the other hand, if all you care about is landing the highest paying job post Bachelors, pick BITS."
    },
    {
      "id": "mzjbp6c",
      "body": "Afaik getting cs as your in bits is not easy, u need pretty high gpa and bits is quite competitive.CS as dual is not guranteed in bits, so op choose wisely according to your interests"
    },
    {
      "id": "mzjdpvg",
      "body": "cutoff was 8cg for cs last year at hyd campus, goa might be slightly lower since academics are relatively hard there. Competitive yes but pretty much achievable, no?"
    },
    {
      "id": "mzjemzm",
      "body": "It depends on individual, its fs achievable but not guaranteed! However its ops choice"
    },
    {
      "id": "mzjxafj",
      "body": "I had a similar score I got eee or something in Hyderabad back then 2022 scenario i didn't wanted to go, comedk 1100 might have got cs in rvce but late intake so I took pes cse because it was one of the colleges which was decent and was getting cs, manipal parents didn't allow, and being in general got  20k-21k rank in mains couldn't get a decent nit or iiiit with cs so yeah"
    },
    {
      "id": "mzjxhgn",
      "body": "Well framed answer"
    },
    {
      "id": "mzlukeg",
      "body": "Thanks Man, that clears the most of it ♥️"
    },
    {
      "id": "n1smxzh",
      "body": "Kinda same doubt here. I took of drop and this year I have a very weird selection of colleges. Its IITH engg physics v/s Bits goa ece v/s pes cse. im interested in engg physics but its kind of an irrelevant degree syllabus wise, parents say do ece at bits but i really dont like electronics and if i wanna go my masters in germany the branch will be a problem. Like idc abt placements but should i go for pes cse??? The only problem is I got pes last year thru pessat also and my parents will be pissed i took an extra year"
    }
  ]
}