{
  "id": "1lke38i",
  "title": "Is there enough charging ports for everyone in the class",
  "content": " I am asking this because this will help me taking a decision in buying a new laptop,  a laptop with trash battery life but peak performance ",
  "metadata": {
    "author": "Pranav_Powar",
    "url": "https://www.reddit.com/r/PESU/comments/1lke38i/is_there_enough_charging_ports_for_everyone_in/",
    "permalink": "/r/PESU/comments/1lke38i/is_there_enough_charging_ports_for_everyone_in/",
    "score": 4,
    "created_utc": 1750877442,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "mzqwsu7",
      "body": "if you’re in electronic city, you won’t have an issue. if it’s rr, you might face trouble in your first year because f block has only a few sockets in each class (usually at the back), otherwise you’ll be fine."
    },
    {
      "id": "mzr0a2k",
      "body": "In first year RR, no lol.\n\nAlthough not everybody plugs in their laptop so if u don't mind sitting in the very first bench then the mains socket might be free (in some classrooms there are a few sockets at the back too)."
    },
    {
      "id": "mzr49a4",
      "body": "even in ec, for first year, there aren't enough ports for everyone"
    },
    {
      "id": "mzu00i0",
      "body": "I have got RR campus"
    },
    {
      "id": "mzu04wa",
      "body": "Is there an actual need of laptop in classes"
    },
    {
      "id": "mzu9wwv",
      "body": "Just saying, please dont buy a gaming laptop"
    },
    {
      "id": "mzulmeu",
      "body": "For most classes in first yr, not really. Although u do need to own a laptop, atleast at home (occassionally we're asked to bring them for some assignments).\n\nIn class we only use laptop for MATLAB python and C, although sometimes people don't bring laptops for Python and C and just write notes in a book (I personally don't recommend that but u could if u wanted to). Ive seen people use MATLAB on their phones and if u ignore how cursed that is, it does work.\n\nI personally bring it almost everyday. If I need it in class I take it out of my bag, if I don't and I'm going to the library I can use it there. Keep in mind most of our study material is on the website so u will need a laptop, it's just that u could get away with not bringing it to class on most days"
    }
  ]
}