{
  "id": "1lnk1wu",
  "title": "College jaane se pehle hi ftt rkhi hai 😔💔",
  "content": "Bhaiiiiiiiiiiiii I m joining this year so like me college gyi thi aur UDHAR SAB KE SAB LEGITTT SABBB kannada wale haiiii wtffffff ik me Bengaluru me hu ofc kannada wale hoge but bhaiiiii koi toh apna mile jisse khulke baat kru lekin nhi idhr toh sbb mara jayega types hai aur aur aur girls hostel bhi dekha meine sundr toh tha aur menu bhi mashallah wale the lekin dean ne bola food ki bohot complaint hai udhr ye sbb itna ajeeb kyuu haiiiii MEINE APNA COLLEGE KA 1ST YEAR STUDENT OF THE YEAR KUKKAD KAMAAL DA TYPES WALA IMAGINE KIYA THAA 😔😭",
  "metadata": {
    "author": "haawwwyeeaahhh",
    "url": "https://www.reddit.com/r/PESU/comments/1lnk1wu/college_jaane_se_pehle_hi_ftt_rkhi_hai/",
    "permalink": "/r/PESU/comments/1lnk1wu/college_jaane_se_pehle_hi_ftt_rkhi_hai/",
    "score": 0,
    "created_utc": 1751217394,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "n0fsc0f",
      "body": "Expecting Student of the Year life in India is delulu"
    },
    {
      "id": "n0fsyb4",
      "body": "![gif](giphy|l4hLWYhVo0gHgGTwk)\n\nMe after reading this"
    },
    {
      "id": "n0fu33u",
      "body": "Northies are increasing every year , u won't find any problem wrt that. Treat non hindi speakers like normal humans and approach them in English initially, they will definitely be good to u if u are with them as everyone is searching for friends in 1st year."
    },
    {
      "id": "n0funhr",
      "body": "ur retarded"
    },
    {
      "id": "n0fvfr7",
      "body": "Ayyo Anna, this is PES Anna ,no KUKKAD KAMAAL  DA vibes Anna, only idli, dosa, sambar… and CGPA pressure Anna 👅🤙🏽"
    },
    {
      "id": "n0g1a6t",
      "body": "In case this isn't some ragebait, I am going to be honest and give you the facts.\n\nFirstly, we encourage English on this subreddit. Not everyone is as comfortable with Hindi as you are. Even worse, Hinglish tends to be very difficult for locals to read. And I say this as a North Indian myself.\n\nSecondly, I am not sure what you mean by \"kannada wale\"? They are your neighbours, have some respect. Bangalore is one of the, if not *the most,* cosmopolitan cities in the country. You are going to find people from all communities and languages here. Just how you find Kannadigas, you are going to find English, Hindi, Bengali, Telegu etc speakers, but of course, it is expected that you will find most of the population to be from Karnataka. Having said that, I believe most of the demographic here actually prefers English: most students who go to PES are those born and raised in Bangalore, often from financially privileged backgrounds and well-known English-medium schools. \n\nDuring my time at PES, and the numerous other times I have visited over the years post-graduation, I found most students to speak in fluent English, not Kannada. And I am sure that the same is relevant even today. You have a lot of sampling bias in your post, because I highly doubt you have interacted with enough people to form an unbiased opinion. You will even find many people (like me) who are more comfortable speaking in English, rather than their own language, given the ease, convenience, and universal acceptance. I am even willing to say that most students here are from far more progressive, developed and financially well off backgrounds than what you are used to seeing, simply because PES charges a bomb. Just because *you* cannot speak their language, does not make them aliens, you portray them as.\n\nYou need to be more respectful towards the community that is willing to accept you. They are not \"kannada wale\", they are locals making room for students like you to come into their city, study, work, and make a living. Just the way you generalised, I will go out on a limb and say that it is people like you who give the rest of us trying to peacefully mingle with the locals a bad name. If you want to \"khulke baat\", you are going to have to start treating them as friends and not aliens.\n\nThirdly, wtf do you mean by student of the year type madam? That is not true at *any* college in the country. There are numerous posts on this - please read and educate yourself. You are not going to find that lifestyle anywhere, especially not at PES, which is known to be academically rigorous. You are here to study, meet people, lay the foundation of your career and grow as a person, not live a bollywood lifestyle.\n\nI am not even going to bother fixing the grammar, that's how annoyed I am at this post. Fuck your Hinglish. Please grow up OP, you are not an infant or a kid, and you are not going to a North Indian city. You are an adult, learn to behave, be respectful, mindful, and open your eyes and mind to be more accepting. This world does not revolve around you. If you are a visitor, be a good one. Respect is a two-way street.\n\n\\-- Frustrated Northie who spent his entire life in Bangalore"
    }
  ]
}