{
  "id": "1lnyjex",
  "title": "[Question]2nd year AIML - DSA language,subject differences and syllabus",
  "content": "I’m a 1st year student and have few doubts regarding the 2nd year AIML syllabus. \nWhich programming language is preferred for DSA in 2nd year AIML - is it python/C/ something else?How does AIML syllabus differ from core CSE subjects in 2nd year ?\nWhat’s the best way to improve skills and be ahead to prepare for upcoming semesters during summer break?Are there any opportunities for internships , projects or certifications we can apply for at this stage ? Would be helpful if someone could share the AIML 2nd year syllabus and subject list.",
  "metadata": {
    "author": "sadsatity",
    "url": "https://www.reddit.com/r/PESU/comments/1lnyjex/question2nd_year_aiml_dsa_languagesubject/",
    "permalink": "/r/PESU/comments/1lnyjex/question2nd_year_aiml_dsa_languagesubject/",
    "score": 6,
    "created_utc": 1751257800,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "n0kvb9q",
      "body": "PES teaches DSA in C. And for our batch (23-27), there was no difference in the core 2nd year subjects at all."
    },
    {
      "id": "n0l2o5m",
      "body": "From Sem 3 onwards, are the batchmates going to remain the same for all classes as they were in Sem 2, based on SRNs? Or is there any reshuffling done?"
    },
    {
      "id": "n0lbnet",
      "body": "Sem 3 is the last reshuffling based on branch/SRN, first 60ish ppl 1 class, next 60ish next class etc., this class won't change for 2/3/4th yr"
    },
    {
      "id": "n0mxnr5",
      "body": "https://acrobat.adobe.com/id/urn:aaid:sc:AP:aa555efe-8e70-470e-adda-d590a1e7131f"
    },
    {
      "id": "n1oqltj",
      "body": "Hey! This might be a weird question, but is MATLAB actually useful in the long run? In our lab sessions, we're mostly asked to copy the code without any proper explanation or conceptual clarity. So I'm genuinely wondering if MATLAB is still a relevant or in-demand skill worth putting on a resume, or is it something that's okay to skip if we haven't learned it in depth?"
    }
  ]
}