{
  "id": "1lou4i0",
  "title": "[Admission] PES RR NAGAR CSE-AIML VS MIT MANIPAL MATHEMATICS AND COMPUTING?",
  "content": "I got PES through pesujee, so like the fees will be similiar. The only advantage im seeing in PES is that there is a way to get some moneyback from the college and also its in banglore.\n\nHowever currently i prefer manipal as its more reputed, better campus, better hostel life and id rather do mnc than cse. \n\nMy home is just 4km from PES, hence if i decide to join PES il mostly be at home , but if i join manipal i can live in the hostels which i want to do.\n\nHence i am asking , is there any convincing reason why PES might be a better choice than MIT",
  "metadata": {
    "author": "TheVulcanReaper",
    "url": "https://www.reddit.com/r/PESU/comments/1lou4i0/admission_pes_rr_nagar_cseaiml_vs_mit_manipal/",
    "permalink": "/r/PESU/comments/1lou4i0/admission_pes_rr_nagar_cseaiml_vs_mit_manipal/",
    "score": 0,
    "created_utc": 1751349636,
    "flair": "Admissions",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "n0qs8kz",
      "body": "!Remindme 3 days"
    },
    {
      "id": "n0qy8tl",
      "body": "If you want to go to manipal why are you asking for reasons to go to pes lol"
    },
    {
      "id": "n0qzdsk",
      "body": "I'm pretty sure placements and ROI will be better in PES considering ur commute/hostel scenario as well as scholarships and placements of the branches in general.\n\n  \nAltho undoubtedly you'll be missing out on college/hostel life and I think extracurricular clubs of MIT are better surely."
    },
    {
      "id": "n0rwxtv",
      "body": "Tf is rr nagar now.\nAnyway, I would recommend cse in ecc instead."
    },
    {
      "id": "n0sql82",
      "body": "Ffs it's NOT RR NAGAR DAMMNIT"
    },
    {
      "id": "n0wb838",
      "body": "https://maps.app.goo.gl/DYNQZoJeotE2zSBVA?g_st=ac"
    },
    {
      "id": "n0x8vis",
      "body": "Since when did pes build a campus in rr nagar bruh"
    },
    {
      "id": "n0x95le",
      "body": "he means Ring Road lmaooooo. OP doesnt know Bangalore prolly"
    }
  ]
}