{
  "id": "1lqjgod",
  "title": "[Question] Did any of you receive a call from PES recently?",
  "content": "Did y'all incoming students receive any sort of call from PES asking to come to clg on 4th July (which is tomr) for some photo session to display it during the orientation?\n\nThe lady that called didn't elaborate on the matter at all. She only said She's from PES University and asked if I am available to come to college on 4th for the above mentioned matter. \n\nAre all the students receiving the call or only a selected few?",
  "metadata": {
    "author": "South_Border3355",
    "url": "https://www.reddit.com/r/PESU/comments/1lqjgod/question_did_any_of_you_receive_a_call_from_pes/",
    "permalink": "/r/PESU/comments/1lqjgod/question_did_any_of_you_receive_a_call_from_pes/",
    "score": 3,
    "created_utc": 1751527709,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "n13aial",
      "body": "No only selected people, I guess."
    },
    {
      "id": "n13d9zx",
      "body": "No?"
    },
    {
      "id": "n13rk74",
      "body": "Got it just now annd she mentioned that we need to be there by 10 or smtg and it's a photoshoot etc etc and yes formals as dresscode "
    },
    {
      "id": "n13v499",
      "body": "R u btech?"
    },
    {
      "id": "n13vqg7",
      "body": "Yeah they called again n mentioned it was only a few students who got shortlisted."
    },
    {
      "id": "n13vtks",
      "body": "Nope"
    },
    {
      "id": "n13wil2",
      "body": "Next time do mention which course is yours when u post smtg like this"
    },
    {
      "id": "n13wyex",
      "body": "My bad 😞🤚🏻"
    },
    {
      "id": "n13zheh",
      "body": "Any idea why?"
    },
    {
      "id": "n1461wl",
      "body": "She told they wanted to make a video edit to present it on the orientation day, which is on 27th July."
    },
    {
      "id": "n14tgvy",
      "body": "Heyyy like plss reply before u go to sleep ok? Do i need to wear ethnic formals or western formals? Since u got the call i believe u r wearing smtg tooo"
    },
    {
      "id": "n157txf",
      "body": "They mentioned only formals. They didn't specify which. Why don't you wear western formal and also carry an ethnic wear? You can always keep ur bag aside while they take pics/ videos. \nOr just take the risk n wear western formals."
    },
    {
      "id": "n1599l7",
      "body": "Sent u a dm check it out pls"
    }
  ]
}