{
  "id": "1lqrwpi",
  "title": "[Question] Branch change queries",
  "content": "As the first year result is out, had a few queries regarding branch change...\n\n1. When will the branch change counselling take place, is it before or after 3rd sem starts?\n\n2. Is there a fee that has to be paid to apply for branch change? \n\n3. Will we be assigned fresh SRN numbers? If yes, then will most of our classmates be students from btech lateral entry as they will also be given new SRN's...?",
  "metadata": {
    "author": "ColdBar7452",
    "url": "https://www.reddit.com/r/PESU/comments/1lqrwpi/question_branch_change_queries/",
    "permalink": "/r/PESU/comments/1lqrwpi/question_branch_change_queries/",
    "score": 2,
    "created_utc": 1751555120,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "n15ts76",
      "body": "Any senior who has opted for branch change in the previous years, Please help!"
    },
    {
      "id": "n15tyo7",
      "body": "1) about a month into 3rd\n2) not to apply, but after you accept you have to pay. \n\n5k for campus, 5k for branch. If you're only changing one, you pay 5k. If both 10k\n\n3) yes. The new srns will start from 900. 900 is the guy who came in with the highest cgpa to the branch, and so on. \n\nNo, lateral entrys get srns from 800s. Also you will not meet them in the 3rd sem. They'll join later and have an accelerated 2nd year. You'll be in the same classes 3rd year on"
    },
    {
      "id": "n15vs93",
      "body": "So all the branch change students will be in a single class and lateral entry students will join later in 3rd year... So there would barely be 15-20 students in the class in 2nd year(for ece atleast)...?"
    },
    {
      "id": "n1614cv",
      "body": "No. The branch changers join the normal classes. \n\nLike if there's 10 sections and 20 changers, 2 per section sort of. Or depending on the current strength in each i suppose. \n\nOh you're talking about lateral entrys? Yes it's like that I think. They start third sem when you finish it roughly. So it's a separate accelerated batch for them"
    },
    {
      "id": "n18hlw9",
      "body": "Okay got it... I thought all the branch changers will be in the same class and taught the 3rd sem syllabus from scratch... Thanks for clarifying..."
    }
  ]
}