{
  "id": "1lsazkz",
  "title": "[Resource] Regarding some seniors selling \"advice\"",
  "content": "If any of you have come across an advertisement offering help from seniors who have scored 9.8+ cgpa to improve your scores in the exam for a small fee, I highly suggest you to STAY AWAY from them. I'm not saying their advice is bullshit. It's just that people who have scored that well are usually people who have scored well all their lives, presumably, Board toppers and JEE Toppers. Their advice will be of barely use to you. If you have scored CGPA of 5-8, let me give you some nice advice. SIT YOUR ASS DOWN AND GRIND. No advice will help you out if you don't even sit down and study. Study every single day. Be consistent, make goals, make plans and actually follow through. The advices they might give will only help you fine-tune your score, not help you increase them by a large margin. You'll end up wasting your money anyway.",
  "metadata": {
    "author": "dick_swagger69420",
    "url": "https://www.reddit.com/r/PESU/comments/1lsazkz/resource_regarding_some_seniors_selling_advice/",
    "permalink": "/r/PESU/comments/1lsazkz/resource_regarding_some_seniors_selling_advice/",
    "score": 43,
    "created_utc": 1751725271,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "n1ia7vn",
      "body": "Man, I honestly thought the same. Like these mfs really think its worth charging money just to give advice? There are so many seniors out there like Pranav, Advaith, Siya, and Hitesh from the ISA/ESA group who genuinely help out for free, and I seriously appreciate them for that. Charging for advice kills the whole senior junior relationship which is the most imp thing for a clg.."
    },
    {
      "id": "n1iir0y",
      "body": "Seniors who charge money to help juniors out aren't seniors. They're opportunistic leaches. You guys are absolutely pathetic - this is not how you treat the people who look up to you. You guys aren't the mentors you think you are, you're the type of seniors to avoid in a college. \n\nI've been doing this thankless job for *years*, through busy schedules, across timezones. I'm not looking for validation or appreciation. I know how difficult it is as an incoming freshman to navigate college, and my seniors made it feel very comfortable and convenient for me. I'm just repaying the favour. The only thing I ask for in return, is that you do the same when your juniors join. \n\nPESU has always had a great alumni network and peers, with approachable and friendly seniors. Even I had the opportunity of having a great set of seniors with whom I am still in touch with. We pride ourselves in the fact that seniors here will always step in to help juniors out, without expecting anything in return. I can't believe these kids are charging money to help people out. You guys are no better than PES. You want people to remember you for your good work? You're just assuring that people never remember you at all. \n\nOP, name and shame them. Let all the students know who is up to this."
    },
    {
      "id": "n1jzmul",
      "body": "Here’s the message they’re advertising through, please Beware.\n\n> Disappointed with ISA 2? worried about your GPA? \n\nDon’t let a tough semester hold you back — your GPA isn’t rocket science, it’s a game you can learn to win! \n\nWe’re a team of your seniors CSE & CSE AIML (9.8+ SGPA & 6x MRD Scholarship recipients) who’ve been there, done it, and mastered it. We’re passionate about guiding you to do the same and reach your goals in 3rd semester and beyond for *CSE & CSE AIML ! 🌟\n\n✅ If you’re interested in getting our support and a step-up to a superstar GPA, please fill this short form to let us know!\n\n➡ https://tally.so/r/3EYQVN\n\nLet's ace it together! 💪✨"
    },
    {
      "id": "n1k0nl0",
      "body": "Wow. Can you name these people? I didn't find their names"
    },
    {
      "id": "n1k20qu",
      "body": "sorry, haven’t filled the form so I don’t really know their names.."
    },
    {
      "id": "n1kj6o0",
      "body": "Time to go undercover"
    },
    {
      "id": "nfe9v9p",
      "body": "Hi! Could you please share any updated ISA/ESA notes or resources for CS that you guys in RR refer to, like seniors’ notes? I’m in 3rd sem, EC campus (CS), and usually refer to Advaith’s and Vibha’s notes."
    },
    {
      "id": "nfeenxd",
      "body": "Uhh i dont have da 🙃"
    },
    {
      "id": "nfef60l",
      "body": "Ohh no problem! If u find any in your ISA/ESA group for sem 3, please do share here or in DM."
    },
    {
      "id": "nfef7zc",
      "body": "Sureee"
    }
  ]
}