{
  "id": "1lw9b6t",
  "title": "[Question] for 2nd years and above",
  "content": "Why does everyone hate ddco? Is it that hard? If yes, why\n(Just wanna be prepared beforehand)",
  "metadata": {
    "author": "serein04",
    "url": "https://www.reddit.com/r/PESU/comments/1lw9b6t/question_for_2nd_years_and_above/",
    "permalink": "/r/PESU/comments/1lw9b6t/question_for_2nd_years_and_above/",
    "score": 12,
    "created_utc": 1752143404,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "n2cb50b",
      "body": "1. The subject is painfully dry (ECE core material)\n\n\n2. The syllabus is overloaded to the point of being ridiculous.\n\n\n3. The slides are poorly made, just random diagrams and lines slapped together with zero context. So you'll have to read the textbook which will make you wanna die.\n\n\n4. ISAs are dogshit and full of questions pulled from the most obscure corners of the syllabus.\n\n\n5. You'll have to write Verilog code, which is basically torture.\n\n\n6. Out of all the faculty, barely one or two can teach it"
    },
    {
      "id": "n2cc43y",
      "body": "ALL ABOUT ELECTRONICS and Neso Academy are your only saviours"
    },
    {
      "id": "n2ccuep",
      "body": "As a student going to 2nd year, I've seen the unit 1 slides and oh boy, they are so terrible. The topic the slides intend to explain is done in a very sparse way, which makes me think it's been done deliberately to confuse the reader. This has made me lose interest in this subject, and I do have the prescribed book but not the patience to read the fuck ton of material shoved in the book, which may be a me problem, but still, this subject does not instill confidence in any way and makes me more worried than excited."
    },
    {
      "id": "n2ced0p",
      "body": "Big bro of ddco, mpca will definitely kill you if you aren’t dead by then"
    },
    {
      "id": "n2ceuuo",
      "body": "Well, in the most unequivocal sense, I'm fucked next year"
    },
    {
      "id": "n2clml9",
      "body": "Did we mention dsa in c language?"
    },
    {
      "id": "n2cmh2r",
      "body": "2nd year was absolutely horrible. All the best."
    },
    {
      "id": "n2cmi4y",
      "body": "And webtech"
    },
    {
      "id": "n2cwf2w",
      "body": "Bruh unit 4 epd slides itself were shit."
    },
    {
      "id": "n2cycqc",
      "body": "Lol , u haven't experienced the shit slides from 2nd year onwards , truckloads of material in each unit in many subjects"
    },
    {
      "id": "n2d6h0d",
      "body": "If you get a good teacher, listen to them and make proper notes and follow them as they teach DONT create your own personal study backlog especially in this subject and do solve problems in the textbook. \nIf you feel your teacher isn’t good enough then REFER TO THE TEXTBOOK along with youtube videos if you want visual representation suggesting - NESO ACADEMY."
    },
    {
      "id": "n2hsgue",
      "body": ">\" DONT create your own personal study backlog\" What do you mean by this?"
    },
    {
      "id": "n2hvmbv",
      "body": "Don’t leave your syllabus for the last minute. 2nd year onwards the portion gets too vast to cram in just a few days. Start studying early."
    },
    {
      "id": "n2hw6lg",
      "body": "NESO ACADEMY FOR THE WIN."
    },
    {
      "id": "n2i65fe",
      "body": "I am among the very few who actually enjoyed ddco to the point it was my favourite subject of 3rd sem.\n\nI won't disagree with the retarded subject structure of ddco and the lack of cognitive abilities of ddco teachers.\nI was blessed with a decent enough faculty who made the subject most fun for me and actually clarified doubts.\nBut no matter what how much a teacher can explain you still might have more doubts left one day before isa than you had in class. \nSo the only way to actually love or even make the subject decently more fun irrespective is to treat the textbooks like your 1st source of information and reference material. You can literally say fuck you to slides and just keep them to check if a topic is in syllabus or not maybe.\nBut when you lock in for ddco, you have your syllabus, textbook and notes(if u made in class or want to make on ur own).\n\nI understand the amount of hate most of my peers have to DDCO was mostly them crying about it being \"soo ece based\", \"why do we need this in cs\", \"why do we have to study ece stuff in cse\" type of things, but yes they are right and wrong.\nDDCO like subject literally forms one of the few basics of you plan to become a person who might someday work on the borderline of ece/cse where uk at times the conceptual border won't even exist.\nIt's not for everyone yes but it is very required, to understand how the basics of your computer works and it's not irrelevant believe me."
    },
    {
      "id": "n2i79i4",
      "body": "Meaning study as and when they teach dont leave it for later, they may go far ahead in syllabus and you might get left behind and each topic is related to the other so it gets difficult to catch up"
    },
    {
      "id": "n3gjxwb",
      "body": "Just be curious to know how binary works under the hood."
    }
  ]
}