{
  "id": "1lwy587",
  "title": "[Admission] Original documents required",
  "content": "What are the original documents required to be submitted for seat confirmation? Pls",
  "metadata": {
    "author": "Putrid_Painter_3909",
    "url": "https://www.reddit.com/r/PESU/comments/1lwy587/admission_original_documents_required/",
    "permalink": "/r/PESU/comments/1lwy587/admission_original_documents_required/",
    "score": 1,
    "created_utc": 1752209551,
    "flair": "Admissions",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "n2ifpaz",
      "body": "During the time of admission they will let you know, generally they would ask for  \n1) 12th Original Mark sheet  \n2) 10th Original Mark Sheet  \n3) Transfer Certificate \n\nAlso you can claim this back after 1st year. Or maybe 1st Sem."
    },
    {
      "id": "n2ifu8o",
      "body": "I just finished and came out. Thanks tho🙏"
    },
    {
      "id": "n2imnaa",
      "body": "I think its for UG Tell me about pg"
    },
    {
      "id": "n31ucxe",
      "body": "Marksheets (10th and 12th)\n\nAadhaar or any other proof of identity that you gave @ the time of admission\n\npassport size photos.\n\nTC \n\nI think this is the basic"
    },
    {
      "id": "n6nxi5t",
      "body": "if submitted in other college, what to do. As other colleges start early, but PES 4th round is later. Want to quit the other college and take admission here depending on counselling"
    },
    {
      "id": "n7wnwq1",
      "body": "Hi..I’m in sem 3 at ECC. Last year, I submitted my original 10th and 12th mark sheets to the RR office, and they told me the docs would be transferred to ECC if I am not wrong. I’ve applied for passport renewal and need those originals back in about 2 weeks. Should I write an application or just email the admin office? Planning to contact them tomorrow. Any tips on how to get my documents back smoothly?"
    },
    {
      "id": "n7wz78i",
      "body": "If it's still in RR campus, you need to visit the MRD office and ask. If they say no...u should ask in the equivalent in the EC campus"
    }
  ]
}