{
  "id": "1lx3yxx",
  "title": "[Question]Summer Internship Not Giving Me CV-Worthy Work, Need Advice on What to Do",
  "content": "Hey everyone, I’m a pre-final year CS student at a tier-2 college, and I’ve been doing a summer internship after my 2nd-year vacations (currently). Unfortunately, the experience so far hasn’t been what I expected, and I’m a bit stuck.\n\nHere’s the situation:\n\n1. **First 2 weeks:** We were assigned to AI testing. The app was already stable, and there was nothing extra for us to work on. We spent the time researching test case generation and related concepts. It was decent learning, but not something I can showcase on my resume.\n2. **3rd Week:** The task was to work on a project called \"Aadhar Censor,\" where we had to censor Aadhar numbers in documents. The problem is, this was already done by others, so there’s no point in putting this on my GitHub or CV.\n3. **After much requesting:** I finally got a task related to app/web development — creating widgets and shortcuts (long-pressing a button for more options). But when I asked for the source code so I could apply it to the app and get some real hands-on experience, my supervisor was like \"Nope\" and wouldn’t provide it. So even though I got the task, it’s tough to make any real progress or learn much without the full context.\n\nThe thing is, this internship was my big chance to make my resume stand out since my CGPA isn’t the best. But now, I feel like I’m just stuck doing stuff that won’t really help me down the road.\n\nSo, **what should I do now?** How can I still make the most of this internship even if the work isn’t what I was hoping for?   \nI used ChatGPT to express my situation more clearly ",
  "metadata": {
    "author": "obv_throwaway1105",
    "url": "https://www.reddit.com/r/PESU/comments/1lx3yxx/questionsummer_internship_not_giving_me_cvworthy/",
    "permalink": "/r/PESU/comments/1lx3yxx/questionsummer_internship_not_giving_me_cvworthy/",
    "score": 15,
    "created_utc": 1752231790,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "n2jpehv",
      "body": "Well, first I wud like to ask which company this is? if u can reveal it. \n\nAnd secondly, considering what you said, seems like ur best bet is to try in other company / startup. Else, what you can do is, ask them for more better real work, that would actually be useful."
    },
    {
      "id": "n2oly0y",
      "body": "hey can i dm you on some ece doubts as you are a senior ?"
    },
    {
      "id": "n2ooume",
      "body": "yeah sure"
    }
  ]
}