{
  "id": "1lxa3zi",
  "title": "[Question] : Is TAMS worth it ?",
  "content": "Hello. \nAsking a high school teacher from Gujarat. Is TAMS worth the experience ? The Amateur Manager and Scientist festival sounds really exciting but the Uni has surprisingly no images or videos of past TAMS events. \nWe already give our students a lot of hands-on activities to initiate learning.\n\n Here's some information about our school : We are an IB school. No textbooks and no exams till grade 9. Only project work needed and all of the classes are linked to projects. \n\nGiven this, can you tell us if this feat would be a worthwhile experience in general or not ? \n\n\nThanks ",
  "metadata": {
    "author": "fragmented_man",
    "url": "https://www.reddit.com/r/PESU/comments/1lxa3zi/question_is_tams_worth_it/",
    "permalink": "/r/PESU/comments/1lxa3zi/question_is_tams_worth_it/",
    "score": 4,
    "created_utc": 1752248326,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "n2krygk",
      "body": "TAMS is the rebranded version of TAS (\"The Amateur Scientist\"). You can find their Instagram page(pesu.tas if I remember), as well as a few ghost links on Google."
    },
    {
      "id": "n2m6a4k",
      "body": "It's definitely worthwhile purely to get an exposure to competition with students from other schools, as well as get a look at what college-level technical clubs work on (TMAS a few years ago used to have demo stalls from some of the technical clubs on campus and still probably does)."
    },
    {
      "id": "n2p4woe",
      "body": "No. Only Team Haya presented their cars due to the insistence of Ajoy sir in the last year's TAMS."
    },
    {
      "id": "n2tkzah",
      "body": "He's referring to 4-5 years ago. You may/may not know him (iykyk)"
    },
    {
      "id": "n3nwmj2",
      "body": "Hey!  \nThanks for reaching out 🙂 I’m part of the TAMS team, and I can totally understand why you’d want to know more before deciding.\n\nTAMS is actually a super fun and hands-on event! It’s all about real-world thinking, team challenges, and creative problem-solving. Since your school already focuses on project-based learning, your students would definitely vibe with it.\n\nYou mentioned there weren’t many pics/videos online — we recently put everything up on our official website, including all the event details and a full gallery from past editions! You can check it out here:  \n🌐 [https://tams.pes.edu](https://tams.pes.edu)\n\nHope that helps! Let me know if you have any other questions, I’d be happy to share more.\n\nWarm regards,  \nTAMS Team"
    },
    {
      "id": "n3nwzh1",
      "body": "You can find our latest page at [https://www.instagram.com/pesu.tams/](https://www.instagram.com/pesu.tams/)"
    },
    {
      "id": "n3o46j2",
      "body": "Why are you marketing it to me lol"
    },
    {
      "id": "n3o4ob8",
      "body": "No no i added it there as a reply to show the latest insta page for the people who read it in the future lol"
    }
  ]
}