{
  "id": "1lxcv9m",
  "title": "[Question] which one is given more preference while changing branch to cse rr? A cse ec student or cse-aiml rr student?",
  "content": "Not joining solely dependent on branch change but would like to clarify it. ",
  "metadata": {
    "author": "Level_Eye_8778",
    "url": "https://www.reddit.com/r/PESU/comments/1lxcv9m/question_which_one_is_given_more_preference_while/",
    "permalink": "/r/PESU/comments/1lxcv9m/question_which_one_is_given_more_preference_while/",
    "score": 0,
    "created_utc": 1752254701,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "n2l8y5i",
      "body": "There's no preference like that, only your CGPA is checked. Your campus/branch don't matter"
    },
    {
      "id": "n2la75n",
      "body": ">If I remember correctly, changes from EC CSE to RR CSE are given more priority than complete branch changes. This will again put you at a disadvantage.\n\nThis is from the faqs."
    },
    {
      "id": "n2lnptb",
      "body": "It's wrong"
    },
    {
      "id": "n2lovv3",
      "body": "So can a student change from ec campus to rr campus or not?"
    },
    {
      "id": "n2lpkq1",
      "body": "Yes. The source is me. This is exactly what I did. \n\nBefore the second year starts some random number of people leave for whatever reason. \n\nAnd in the beginning of second year, they have a seat allotment and instead of rank it's based on your cgpa. \n\nIf a biotech guy has 10, he's the first rank essentially."
    },
    {
      "id": "n2lvlma",
      "body": "Thank you bro, I might get pes ec cse. I’ll try to change to pes rr cse if I can."
    },
    {
      "id": "n2mwjna",
      "body": "Yeah, sorry about that. It used to be that way but things have changed. I will update this in the FAQs/"
    },
    {
      "id": "n2mwoqv",
      "body": "Arguably, PES EC CS is currently a better option if you are solely interested in tech."
    },
    {
      "id": "n2oh479",
      "body": "I see. I have read ec campus has better tech related clubs and is more tech oriented. It’s just the distance, ec campus is 33km from where I live but rr campus is just 7 km."
    },
    {
      "id": "n2om53v",
      "body": "Ah thats a fair decision"
    }
  ]
}