{
  "id": "1lxszsn",
  "title": "[Question] Who is the most successful PES Alumni you have come across?",
  "content": "Not talking about the FAANG people in San Francisco Bay Area, but people who have been insanely successful through Software Engineering etc.",
  "metadata": {
    "author": "dick_swagger69420",
    "url": "https://www.reddit.com/r/PESU/comments/1lxszsn/question_who_is_the_most_successful_pes_alumni/",
    "permalink": "/r/PESU/comments/1lxszsn/question_who_is_the_most_successful_pes_alumni/",
    "score": 36,
    "created_utc": 1752299518,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "n2opit5",
      "body": "Rowlet 💕"
    },
    {
      "id": "n2os3lc",
      "body": "rituparna jawahar🔥🫡"
    },
    {
      "id": "n2osbof",
      "body": "rowjee"
    },
    {
      "id": "n2osi5q",
      "body": "Rishikesh SR ( the cofounder of Rapido)"
    },
    {
      "id": "n2oszyy",
      "body": "I'm nowhere near being the most successful 😭. I'm just relatively well known."
    },
    {
      "id": "n2otp2d",
      "body": "There are several prominent individuals who have graduated from PES University, Bangalore, making names for themselves in various fields.\nEntrepreneurs and leaders\nSR Rishikesh: Co-founder of Rapido Bike Taxi Services.\nMekin Maheshwari: Founder of Udhyam.org and previously headed Digital Media and payments at Flipkart.com.\nSudarshan Mogasale: CEO of Dassault Systemes Solutions Lab (formerly 3DPLM) and leader of Dassault Systèmes R&D in India.\nChirantana Mysore: Founder and Director of FreshersCareer.co.in.\nManish Singh: CEO of Innovators Bay, a company featured among CIO Review's 20 Most Promising Machine Learning Startups.\nPavan Kumar: A notable Kannada film director known for crowd-funding his films.\nShreyas Srinivasan: Director at OML Digital and co-founder of NH7, a prominent Indian indie music company. \nOther notable alumni\nPriyanka Arul Mohan: An actress in the Tamil film industry.\nPawan Kumar: A movie director in the Kannada film industry.\nShreyas G Hosur: The first Civil Servant from Karnataka to complete the IRONMAN Triathlon.\nMrinal Kalakrishnan and Jnaneshwar Das: Robotic Scientists with publications and leadership in robotics research.\nAdarsh Jagannatha: An entrepreneur and a PhD candidate at IIT-Kanpur.\nSuhas Gopinath: Recognized as the world's youngest CEO.\nAnil Muppalla: A researcher and hacking enthusiast.\nSaad Hashim: Executive Director at Goldman Sachs.\nParul Gupta: Co-founder of Springboard.\nSumiti Tayal: Assistant Vice President at Tech Mahindra.\nNasika Bilkhis: Product Manager at SAP Labs.\nDeepti Ramesh: Marketing Consultant at Hindsyght.\nSumeet Varma: Known as the highest-rated coder from India.\nZarana Parekh: Selected for the Veterbi Program and an Anita Borg Scholar.\nDhruvi Shah: Held internships at Google and Goldman Sachs and works as an Analyst with Morgan Stanley.\nAditi Bhatnagar: Participated in the Red Hat organized competition, Outreachy.\nGaurav Vaz: A bass guitarist, artist manager, writer, product evangelist, and web developer.\nKalyan Verma: A wildlife photographer and filmmaker.\nSuresh Narasimha: Entrepreneur and Founder CEO of TeliBrahma.\nDr. Girish Bharadhwaj B: Awarded the Padma Shri by the Government of India."
    },
    {
      "id": "n2p2jof",
      "body": "Aye Jude (YouTuber with 1M+ Subscribers)"
    },
    {
      "id": "n2p3dlw",
      "body": "3.9M+ dude not 1M"
    },
    {
      "id": "n2p8fk4",
      "body": "The taxi driver was told by jawahar in new york."
    },
    {
      "id": "n2pbdln",
      "body": "3.9M+ is still technically 1M+"
    },
    {
      "id": "n2pch4p",
      "body": "It's not even anywhere around"
    },
    {
      "id": "n2q1he3",
      "body": "Even if you are using ChatGPT, please format your answer. Also I'd highly recommend fact checking this and not trusting AI slop."
    },
    {
      "id": "n2qe3e5",
      "body": "Is that jawahars daughter"
    },
    {
      "id": "n2qe4mv",
      "body": "Agreed."
    },
    {
      "id": "n2r9vna",
      "body": "okaymohit :)"
    },
    {
      "id": "n2te6ef",
      "body": "yes, she is director,strategic initiatives pesu"
    },
    {
      "id": "n2us967",
      "body": "Who"
    },
    {
      "id": "n304bw1",
      "body": "Priyanka Mohan"
    },
    {
      "id": "n3dhbu5",
      "body": "Rapido co founder"
    }
  ]
}