{
  "id": "1m4mo25",
  "title": "[Question] What happens if we dont collect the temporary id card after document submission?",
  "content": "So from the title, u can see I kinda messed up. Basically noone said I have to collect a temporary id card after document submission. I got to know about it from freshers grp. So now, how do we fix this? Will I be allowed to collect it on orientation day?",
  "metadata": {
    "author": "Swarno007",
    "url": "https://www.reddit.com/r/PESU/comments/1m4mo25/question_what_happens_if_we_dont_collect_the/",
    "permalink": "/r/PESU/comments/1m4mo25/question_what_happens_if_we_dont_collect_the/",
    "score": 7,
    "created_utc": 1753011049,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "n45k677",
      "body": "Nothing's gonna happen, they'll give you official ID cards 1-2 weeks into classes."
    },
    {
      "id": "n45nbmk",
      "body": "ok nothing that serious , just show your pesu app at the entrance while coming , cet ppl got it like after 3 weeks lol , we used just show our pesu app"
    },
    {
      "id": "n45qae8",
      "body": "I didn't even know there was a temporary ID card. If you manage to solve this issue please share"
    },
    {
      "id": "n474qmh",
      "body": "Bro is there any PES WhatsApp group? And can u help me a little "
    },
    {
      "id": "n474wn3",
      "body": "Are you in discord? U can find the link there"
    },
    {
      "id": "n477c5n",
      "body": "I am not on discord, don't even know how to use it \n\n\nAnd one thing, civil branch still exists? I saw few seats (4) in comedk's seat availability pdf "
    },
    {
      "id": "n477sh2",
      "body": "Comedk? Is pes even in comedk? From what I know, civil branch doesn't exist anymore.  Also pes takes only through kcet and jee mains (and management quota) from what i know"
    },
    {
      "id": "n479m8y",
      "body": "Join Discord. PESU runs on discord - various clubs, events etc are all managed primarily through discord. Might want to get used to it. \n\nAs for ComedK: PES does not take in admissions through ComedK. And there is no civil engineering anymore."
    },
    {
      "id": "n479zj9",
      "body": "Yes sorry, its PES college not PES Uni"
    },
    {
      "id": "n47afef",
      "body": "Yes thank you and sorry, i didn't know PES college is different and PES uni is different "
    }
  ]
}