{
  "id": "1m58ykm",
  "title": "[Question] Are there no sears for admission through pes kcet merit list ?",
  "content": "Help me out and are they planing on increasing the seats",
  "metadata": {
    "author": "6ix9ineisGoat",
    "url": "https://i.redd.it/s9jrh53ji5ef1.jpeg",
    "permalink": "/r/PESU/comments/1m58ykm/question_are_there_no_sears_for_admission_through/",
    "score": 17,
    "created_utc": 1753070461,
    "flair": "Admissions",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "n4a8osd",
      "body": "Exactly my doubt bro if they haven’t segregated seats for jee and kcet pes counselling itll be a mad screwup"
    },
    {
      "id": "n4a9nok",
      "body": "look total seats reserved for JEE MAINS+KCET is 45% which is 320 seats for CSE out of 720\n\nOut of these 320 maybe its 260 for mains+60 for kcet... and in these 260 for mains there is overbooking of seats which will be adjusted in the 60 kcet seats.."
    },
    {
      "id": "n4aanxn",
      "body": "I think that's what they said in yesterday's councelling meeting"
    },
    {
      "id": "n4aatsr",
      "body": "did they give the exact seats for mains and kcet?"
    },
    {
      "id": "n4ab40h",
      "body": "No.... But if you are saying that there will be 60 seats for KCET ( assuming that it's 60 ) then there won't be much left for KCET after JEE."
    },
    {
      "id": "n4ab90m",
      "body": "yup if its 60 then KCET seats for PES EC campus CSE will be less"
    },
    {
      "id": "n4acqi6",
      "body": "There is seat reserved for pesu kcet da but donot expect seats in triple digit for each branch and campus"
    },
    {
      "id": "n4auhry",
      "body": "The overbooking seats are merged from pesu kcet so yeah it's. Over"
    },
    {
      "id": "n4axsqz",
      "body": "5% is reserved for cet i think"
    },
    {
      "id": "n4axuck",
      "body": "no 5% is left for cet"
    },
    {
      "id": "n4axv1x",
      "body": "5% def not triple digits"
    },
    {
      "id": "n4aynbk",
      "body": "5% of 720 is 36... possible but ig it will be around 60"
    },
    {
      "id": "n4bd3vn",
      "body": "Wtf does it mean when they write negative numbers??"
    },
    {
      "id": "n4bgfu1",
      "body": "Bro what does a minus indicate I didn’t understand that"
    },
    {
      "id": "n4bpw5v",
      "body": "oh but thats what they said in counseling, maybe extra seats due to management or something?"
    },
    {
      "id": "n4c7rb6",
      "body": "Oh okay... maybe management seats then.. will wait and see... they will release the number of seats for kcet soon ig"
    },
    {
      "id": "n4gump3",
      "body": "Overbooked seats"
    },
    {
      "id": "n4gunrs",
      "body": "Overbooked seats"
    },
    {
      "id": "n4i2f8k",
      "body": "What does that mean. I’m getting PES through KCET. Will this affect the no if seats assigned to KEA counselling ."
    },
    {
      "id": "n4i2zym",
      "body": "Idk..... Maybe they will decrease the seats for KCET from 60 to (60-34=)26 maybe they will have more no. of people in one batch."
    },
    {
      "id": "n4i3c47",
      "body": "WTFFFF . Bro I don’t think they can do that . KCET seats are already reserved . If they try to do anything with those seats, the KEA has full authority to take action against them."
    },
    {
      "id": "n4oedez",
      "body": "Not the KCET Merit seats dude... the KCET 5 lac seats through PES counselling"
    },
    {
      "id": "n4olc5e",
      "body": "overbooked   \nthey prolly hope that enough people will surrender their seats when kcet results come."
    },
    {
      "id": "n5k81m2",
      "body": "The exact number is 252(mains)+72(kcet).. i.e. 10% of the total seats in every branch is reserved for KCET 5 lac seats.... Prof Jawahar mentioned this in his latest interview.."
    }
  ]
}