{
  "id": "1m5fiav",
  "title": "[Question] Is PES recognized for masters in germany?",
  "content": "How hard is it to get into a good uni (eg: Munich technical or Heidelberg) for masters if i join pes. Like cgpa requirements aside, is the University recognized in Germany \n\nI have the option between ece in bits hyd vs pes cse ( im not interested in electronics like at all ) so i just wanted to make sure that recognition wouldn't be a problem ",
  "metadata": {
    "author": "Human_Canary1021",
    "url": "https://www.reddit.com/r/PESU/comments/1m5fiav/question_is_pes_recognized_for_masters_in_germany/",
    "permalink": "/r/PESU/comments/1m5fiav/question_is_pes_recognized_for_masters_in_germany/",
    "score": 8,
    "created_utc": 1753094351,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "n4bh3qx",
      "body": "U can join the pes study abroad server \nThere are prolly some alumni from pes who are in Germany."
    },
    {
      "id": "n4bh53i",
      "body": "Was in a similar position three years back I chose pes cs because I can't study eee or ece (don't remember properly) at bits, that's it"
    },
    {
      "id": "n4bhgm2",
      "body": "sorry to ask but is that the same server as the one given in the FAQs or is it a different link"
    },
    {
      "id": "n4bijo2",
      "body": "That's the normal server, there is one specifically for studying abroad.\nhttps://discord.gg/f34x9rzmgf"
    },
    {
      "id": "n4bog7u",
      "body": "It probably is. Check anabin database and search for it(lists recognized unis for college credits etc)."
    },
    {
      "id": "n4bow09",
      "body": "Your post contains personal and private information. Please refrain from sharing such information without consent."
    },
    {
      "id": "n4bozyb",
      "body": "Different server. Join the main server and ask for the link."
    },
    {
      "id": "n4bpldd",
      "body": "Graduated from PESU almost 2 years ago, currently in Germany pursuing masters. \nThere’s absolutely no issues with PESU recognition here (officially speaking from visa or admit p.o.v) You can also verify it here: [Anabin](https://anabin.kmk.org/rechercheanleitung-hochschule)"
    },
    {
      "id": "n4bvnsr",
      "body": "Bhaiya if someone has done bachelors from ece for example can he/she do masters from cs without any problem in europe?"
    },
    {
      "id": "n4bw455",
      "body": "I believe the EU is very strict on Bachelor course requirements. But I'll let OC comment on this since they're more experienced. \n\nAlso fyi for OC - there is a discord server for PESts studying abroad. I hope you're on it!"
    },
    {
      "id": "n4bwai1",
      "body": "Please don't share the server link publicly. There's a lot of personal information on that server, including names, addresses and phone numbers. It's a safe space for alumni to keep in touch with each other. \n\nIf you want to share the link, DM it to them."
    },
    {
      "id": "n4bx7b2",
      "body": "Depends from University to University. If you plan pursue to CS with some modules from electronics, then it’s possible.\nI would suggest you to check the requirements of the university. All reasonably good universities have a well drafted requirements without which admits won’t be issued."
    },
    {
      "id": "n4bxkg9",
      "body": "Haven’t used Discord since 1st sem, will have to check if I can find my account. Will do it when I can access my account"
    },
    {
      "id": "n4byjna",
      "body": "Oh thanks bhaiya 🙏"
    },
    {
      "id": "n4byl6b",
      "body": "Oh thanks bhaiya will check"
    },
    {
      "id": "n4bz4g5",
      "body": "Don't call us bhaiya/didi. We don't encourage that culture here. Everyone's your friend here."
    },
    {
      "id": "n4c01sx",
      "body": "🫂❤️"
    },
    {
      "id": "n4c5x3s",
      "body": "How is rvce not in this"
    },
    {
      "id": "n4isc73",
      "body": "Lol what"
    },
    {
      "id": "n9kiqms",
      "body": "Hey I'm planning on pursuing my masters as well.\n\nAny pointers for college applications, part time jobs, how's the job scenes over there? Also how easy is it to learn German? Also which uni did u get into"
    },
    {
      "id": "n9kzuha",
      "body": "Please send me a direct message. We can discuss any questions you have."
    },
    {
      "id": "n9l3237",
      "body": "Sent you a dm"
    }
  ]
}