{
  "id": "1m5kjtc",
  "title": "[Placements]: going into placements",
  "content": "I am currently starting my 4th year cse , going into placements, I wasn't able to put my 100% efforts in dsa during the summer ( I did dsa before that but it was on and off , hardly 20-25 questions) \nI couldn't focus on doing dsa because I interned this summer at a pesu research lab ..which wasn't even ml domain ..it was ar/vr ...which idts would help..I regret doing the internship rn \nSo far I can solve only dsa easy and medium i struggle alot.i am not able to solve dp , recursion \nMy cgpa is 8.4 and I am rn not sure what to do .. looking at the stats I lost hopes on placements ..My gpa is fine but I feel like I am very bad at dsa and have been in no clubs so far ..my internship wouldn't help as well ...should I start preparing for higher studies exams or should I continue doing dsa and prep for placements..\nPlease any advice would be very helpful to me \n",
  "metadata": {
    "author": "okiadmitilikekdrama",
    "url": "https://www.reddit.com/r/PESU/comments/1m5kjtc/placements_going_into_placements/",
    "permalink": "/r/PESU/comments/1m5kjtc/placements_going_into_placements/",
    "score": 32,
    "created_utc": 1753108463,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "n4cvtxm",
      "body": ">should I start preparing for higher studies exams or should I continue doing dsa and prep for placements.\n\nThis one only you can answer, we cannot answer for you. You would have to talk to parents, and get some advice, etc. And if masters where? India or Abroad?\n\nConsidering what you said, I would say try to keep doing leetcode / codeforces & be consistent, watch youtube videos/take help from AI and practice nicely, and if u are really consistent and improve, you can prep for placements and also keep attending to companies that come. \n\nThat's all I can say :) Good luck"
    },
    {
      "id": "n4dg09i",
      "body": "Thanks a lot for taking the time to answer my question..I will work hard"
    },
    {
      "id": "n4g26t7",
      "body": "Take it as a challenge, from this point work so hard that everyone should be shocked during the placements by seeing your package. Have a positive mindset, whatever happened in the past is over. Now it's your time to prove what you are worthy of.\nBest of luck mate 👍"
    }
  ]
}