{
  "id": "1m87n5k",
  "title": "[Placements] saw this stats on counseling presentation",
  "content": "just wanted to share for info~",
  "metadata": {
    "author": "Intelligent-Cat8630",
    "url": "https://i.redd.it/vnlmchj5duef1.jpeg",
    "permalink": "/r/PESU/comments/1m87n5k/placements_saw_this_stats_on_counseling/",
    "score": 71,
    "created_utc": 1753371326,
    "flair": "Placements 🤑",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "n4x2ksf",
      "body": "Median being higher than avg is interesting"
    },
    {
      "id": "n4x2zz1",
      "body": "1843(total) - 861(placed) - 373(higher studies) = 609 (unplaced) ?"
    },
    {
      "id": "n4x30h3",
      "body": "Internship offers are included in no of people placed?"
    },
    {
      "id": "n4x43j5",
      "body": "Isn't that a good thing?"
    },
    {
      "id": "n4x556q",
      "body": "It means there are few people with low salaries pulling the median down.\nWhich is weird cause it's the other way around normally"
    },
    {
      "id": "n4x5b3e",
      "body": "I tried calculating using llms each time median was higher than avg so that's not rigged"
    },
    {
      "id": "n4x6sss",
      "body": "there are even students whose data is not mentioned in the slide. The ones who don't have the required gpa to sit for placements."
    },
    {
      "id": "n4x7bm6",
      "body": "This only increases the number of unplaced students 🥲"
    },
    {
      "id": "n4x7zoq",
      "body": "ik that's why I mentioned it\nyou are in 2nd year so i hope you have better about me about how things work ?? so is it really like many people don't get placed???"
    },
    {
      "id": "n4x901d",
      "body": "I'm entering 2nd year and whether or not there are so many unplaced studets is not obvious to me... you will have to ask 3rd or 4th year seniors.. that was why I also added a question mark in the end lol"
    },
    {
      "id": "n4x9771",
      "body": "ooh ok"
    },
    {
      "id": "n4xap9t",
      "body": "I have no idea , tho I ll be joining this year😺"
    },
    {
      "id": "n4xkdva",
      "body": "i mean the job market is pretty shit so it makes sense that ppl would have taken up any job offer they got even if low paying"
    },
    {
      "id": "n4xszo5",
      "body": "So around 430 students got a package of more than 13 lakhs, Damnn!"
    },
    {
      "id": "n4y25ge",
      "body": "563 got Tier 1"
    },
    {
      "id": "n4y6xzj",
      "body": "What is tier 1 offer in PESU?"
    },
    {
      "id": "n4yaaoc",
      "body": "12+ LPA"
    },
    {
      "id": "n4yfia3",
      "body": "Afaik pesu is a very good college in bangalore and its median ctc is around 13-14lpa, then how the hell IIITB getting an median of 33lpa?"
    },
    {
      "id": "n4yka1b",
      "body": "Lower intake. Better quality students "
    },
    {
      "id": "n4ykp6n",
      "body": "Iiitb have 120 CSE students only that’s why"
    },
    {
      "id": "n4yl4tx",
      "body": "are those stats even real? like I've seen some IITs stats those are very similar (IITs stats were even better than this)"
    },
    {
      "id": "n4ylbl8",
      "body": "but 120 is less?"
    },
    {
      "id": "n4ylmfm",
      "body": "In pes this no. Is more than 1000"
    },
    {
      "id": "n4ym079",
      "body": "No one can know for sure since it's a private university. But since it's only CSE and ECE, their stats are definitely gonna be better. And Bangalore location advantage and the fact that IIITB does not have only Btech, it's Integrated 5 year MTech which means students get to specialize more and also become more valuable in the industry."
    },
    {
      "id": "n4ym2yg",
      "body": "isn't this no is very high? like iits/nits also have about 80-100 seats in each branch"
    },
    {
      "id": "n4ymxv8",
      "body": "they have btech programs too, but is it worth to join that? Or should I go with my state govt college?   \nTbh idk much about these things"
    },
    {
      "id": "n4ymzgg",
      "body": "Avg of top 100 in pes may be 20+"
    },
    {
      "id": "n4ysl6z",
      "body": "If you have IIITB as an option, I dont see why you should not join"
    },
    {
      "id": "n50oh8a",
      "body": "I'm getting BTech (DSAI) there but my concern is fees (will cost me around 26-27 lakhs including everything) and my state govt clg (NSUT) will cost me around 14-15 lakhs. My parents are ready to pay this but it should it worth it atleast"
    },
    {
      "id": "n50ohxj",
      "body": "Wasn't De Shaw internship stipend 1.5 lpm"
    },
    {
      "id": "n50yhl5",
      "body": "bro wtf imagine comparing iit nit and iiits to a private college"
    },
    {
      "id": "n511as0",
      "body": "sorry bro as I earlier said Idk much about these things (sorry if I said anything wrong)"
    },
    {
      "id": "n517m1k",
      "body": "IIITB easy. Your internship stipend itself will be 1 to 2L a month. You can make back the money in 5 years max. Plus Delhi pollution. Bangalore weather is much better. Job opportunities are better. and you get the IIIT tag which will help in future."
    },
    {
      "id": "n517nof",
      "body": "It'll be 35+ lol"
    },
    {
      "id": "n51gwcf",
      "body": "What's the usual gpa requirement"
    },
    {
      "id": "n51idrq",
      "body": "It is 2 lpm right now"
    },
    {
      "id": "n51p4us",
      "body": "Juniors, the 56LPA offer is not actually 56. \n\n56 will be the 4TH YEAR’s CTC if you hang on to zomato till then. It’s misleading."
    },
    {
      "id": "n52ce4o",
      "body": "If you have more than 7 you'll be eligible for internship and placements, but the companies might add their own CGPA requirements.\n\nSo having 8.5+ increase your chances by quite a lot.\n\nBut I think 8.5 is safe."
    },
    {
      "id": "n58mk6n",
      "body": "That 56lpa will be me🔝🥰"
    },
    {
      "id": "n5a5uee",
      "body": "But still 24l base is a lot"
    },
    {
      "id": "n5b984t",
      "body": "my jee %ile is 99.52 any other good option u would like to give?"
    },
    {
      "id": "n5e69zf",
      "body": "Woah that's an amazing percentile. I think NITK ECE, AIML, Data Science might be a good option. I hope you have finished JOSAA counselling. Also IIITB registrations are done."
    },
    {
      "id": "n5e6tp6",
      "body": "I was not getting anything (AIML,DS,ECE) I'm from Gen category and other state so I was only getting NITK EEE 😭  \nYup I've registered for all my friends told me about where to register for"
    },
    {
      "id": "n5ebgfd",
      "body": "NITK EEE is also good. Go for it."
    },
    {
      "id": "n5hktvy",
      "body": "Bro ig in these stats ppos aren't incl right?"
    },
    {
      "id": "n5kbik8",
      "body": "They don't include ppos and off campus placements"
    },
    {
      "id": "n5kckc9",
      "body": "Firstly PPO's that are offered through on campus internships are counted\n\nSecondly the number of off campus placements cancels out the number of ineligible students\n\nHence the final figure 609 remains more or less the same"
    },
    {
      "id": "n5kcy3z",
      "body": "https://docs.google.com/spreadsheets/d/1SnSNM_GnuTwIJ0oI3bHt9nAnDQXfqwIhT8JHEwq727g/edit?usp=drivesdk but bro tier 1 2 3 incl gives 872 offers not even including ppos from summer and spring internship"
    },
    {
      "id": "n5kdi7w",
      "body": "Genuine question- does pes include ppos in there placement stats which have been offered on campus?"
    },
    {
      "id": "n5kegsu",
      "body": "https://docs.google.com/spreadsheets/d/1SnSNM_GnuTwIJ0oI3bHt9nAnDQXfqwIhT8JHEwq727g/edit?usp=drivesdk tier 1 2 3 incl gives 872 offers not even including ppos from summer and spring internship (I am having difficulty understanding there placement stats) and they have shown 861 which is close to tier 1 2 3 offers combined and excludes ppos from spring and summer internships ig"
    },
    {
      "id": "n5kfbzs",
      "body": "Hmm your right:\n\nSo maybe a possible explanation is\n\n904(FTE offers)+536(Internship only offers)\n\nBut in the sheet as its maintained by students not very accurate:\n\n830(FTE offers)+398(Internship only offers)"
    },
    {
      "id": "n5kfnb3",
      "body": "I had that in mind because someone I don't know which yr student was he/she said they don't incl off campus and ppos in a post made in this subreddit few days ago"
    },
    {
      "id": "n5kfr78",
      "body": "Yes this seems correct"
    },
    {
      "id": "n5kg44g",
      "body": "Imo 536 internship offers are there 50-70% of them get converted to ppos so still %age of students placed atleast in cs would be around 70%+"
    },
    {
      "id": "n5kgh2q",
      "body": "They have mentioned internship offers though they haven't incl number of students placed through ppos"
    },
    {
      "id": "n5kjwky",
      "body": "No problem lol... ig we are on the same page"
    },
    {
      "id": "n5l3ao8",
      "body": "Is this from rr or ec campus?And is ec campus good,is it worth joining?"
    },
    {
      "id": "n5lakud",
      "body": "Nope they don't include"
    },
    {
      "id": "n5mzt8w",
      "body": "Combined"
    },
    {
      "id": "n5n081j",
      "body": "Does that mean they don't differentiate.And if yeah y cutt off differs too much"
    }
  ]
}