{
  "id": "1magyvs",
  "title": "Sharing my tier 3 to FAANG journey [He is from PES University as mentioned in his CV]",
  "content": "",
  "metadata": {
    "author": "Unusual_Sky5634",
    "url": "/r/Btechtards/comments/1magmlb/sharing_my_tier_3_to_faang_journey/",
    "permalink": "/r/PESU/comments/1magyvs/sharing_my_tier_3_to_faang_journey_he_is_from_pes/",
    "score": 28,
    "created_utc": 1753604142,
    "flair": "Pride Of PESU",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "n5fk2qo",
      "body": "How is PESU tier 3 eh? Bcz of less percentage of placements? I though it was considered tier 2"
    },
    {
      "id": "n5fmhtw",
      "body": "Pes is tier 1.5-2"
    },
    {
      "id": "n5focoe",
      "body": "There is a lot of misdirection in that post. I wouldn't recommend using it as a blueprint or taking any of it as advice. \n\nPES is nowhere near T3. It has great placements and people regularly end up at Amazon and the like if they work hard on upskilling and being hireable. For a college that boasts a median and average of 12-14L and a highest of 50+L, if you don't end up with a good job then it's on you for not putting in the hard work when it matters, or for not being industry ready and being eligible for the roles they come hiring for. You can't blame the college for being mediocre when you were mediocre yourself.\n\nAnd once you start working, there is no concept of \"off campus\". *Everything* is off campus, and which college you come from is completely irrelevant. All that matters is your work experience, how you performed at your previous role to advance in your career, and what you bring to the table. Nobody looks at your college once you've spent enough time in the industry; if you're good at what you do, you're a good candidate to interview. The entire story of \"making it off campus from T3\" is logically flawed here because it isn't even relevant to the discussion.\n\nLuck will only take you a short way. Everything else depends on your hard work. Put in so much effort that your own skills can take you places luck cannot. And focus on your CGPA. It matters. Everywhere. All opportunities from jobs, placements, internships, higher education - all depend on your CGPA. Don't screw this up. \n\nFair praise to the dude for making it to Amazon. But stories like these are one in a thousand. Kids, there are no shortcuts in life. If you want success, you're going to have to earn it."
    },
    {
      "id": "n5fvtzs",
      "body": "PES is literally the IIT of Bengaluru /s"
    },
    {
      "id": "n5fzncz",
      "body": "It is lmao.\nHis reason for it being tier 3 is that he got admission without a competitive exam.\nI mean he paid 40 lakhs for management back then.\nThat's only 10% of the seats."
    },
    {
      "id": "n5g0z5y",
      "body": "His contacts might have helped, look at his post history.\nBro is Richy rich."
    },
    {
      "id": "n5g24ts",
      "body": "Heyy do you study in PESU rn? If so, any idea about the placements percentage of PESU RR CSE? I got it in KCET mock allotment but my friends said it has very less percentage of placements. Is that true? I am confused between RV ECE and PESU CSE. I am interested in programming as well as electronics. So hell of a lot confused. Could anyone help?"
    },
    {
      "id": "n5g2e7x",
      "body": "I don;t think a college which has a median of 12-14L can be considered \"T2\", irrespective of how ambigious the entire tier system is. You are forgetting that there are many collges in the country which have averages at < 50% of PES' median."
    },
    {
      "id": "n5g2gql",
      "body": "Probably. Good for him. Doesn't take anything away from my opinion though."
    },
    {
      "id": "n5g3dq4",
      "body": "Yeah I study in pes rn.\nI don't know what the placements for rr specifically are as placements are done together for both campuses.\nCse is 70% placed I think and the median is like 15ish.\nThat's with 1500 seats in cse.\nUr gonna have to decide btw cse and ece man, they are very different.\nDo more research.\ncse in rr is a safer bet if u can't decide btw cse and ece"
    },
    {
      "id": "n5g3tco",
      "body": "Yeah 100% agree,  but I don't like how he wants to be seen as a rags to riches story, where he grinded out of a difficult life."
    },
    {
      "id": "n5g41zu",
      "body": "Dude was lucky. Fair play, but it is very misdirectional and misleading if posted on a platform like reddit and shown to incoming students because real life isn't like that for everyone."
    },
    {
      "id": "n5g75hq",
      "body": "Shit typo, I meant it isn't tier 3"
    },
    {
      "id": "n5gavlw",
      "body": "Yup, definitely didn’t intend for my post to be advice lol. Just wanted to show that it’s possible to eventually become successful even in today’s job market, and even if you didn’t do anything in college."
    },
    {
      "id": "n5gb6bf",
      "body": "Lol nah, I don’t have any contacts. Not rich either."
    },
    {
      "id": "n5giot9",
      "body": "no way PES tier 3"
    },
    {
      "id": "n5h85lh",
      "body": "Bro learnt the most important skill unknowingly, LUCK. Lmao"
    },
    {
      "id": "n5hcdt8",
      "body": "It's just to spread hopium imo 🥴"
    },
    {
      "id": "n5hqi82",
      "body": "If pes is tier 3 iit is tier 4 cuz pes >>>>> iit"
    },
    {
      "id": "n5ilquo",
      "body": ">Just wanted to share an anecdote that it’s possible to eventually become successful even in today’s job market, even if you didn’t do anything in college\n\nKnow your audience. Stories like these are dangerous to students preparing to step into college. They do not know how the real world works, and often take anecdotes as pathways of life to live by. I'm happy for your success, but you shouldn't be parading your story around, especially with those choices of words. \"I'm proof that it's still possible to break into FAANG despite ..., \"It's never too late to find success\" - these phrases simply sell your story to people who do not read between the lines. \n\nYour entire story paints you as someone who did not work hard throughout their life (college or their job), yet found the stepping stones to success by chance. Surely there is something *else* to also highlight here, right? What about the times you realised that having studied more would have helped, or the times you felt that having put in hard work would have prevented you from getting laid off? You are sharing your story of rags to riches, but you did not take any accountability for your circumstances.  Those lessons are just as important. Instead of telling people to work hard to not be in your shoes, you are claiming that being in your shoes is okay because it might work out in the end.\n\nFor every one of you, there are thousands in this country who end up struggling to find a job, and I am pretty sure you are aware of this. Being a senior who is multiple years older than the current batch of incoming students, *and* a fellow senior to me as well, you should know better than to put out posts that are 90% misdirection and 10% reality. Your story isn't quite what you think it is. \n\nStop parading your story as a comfort read. It's, at best, false hope. You aren;t motivating anyone."
    },
    {
      "id": "n5itca9",
      "body": "That’s a fair take, thanks for the reality check.\n\nI guess I wasn’t expecting anyone to take the post seriously, it was meant to just be a silly anecdote. But I see what you mean, teenagers might not realise that."
    },
    {
      "id": "nb2rdfk",
      "body": "It kinda is now, no? Jee mains cutoff was below 90 percentile which is a joke."
    },
    {
      "id": "nb2tocr",
      "body": "For what mech?\nCse rr got over above 95 itself afaik\nAnd it's only the first year without pessat, so acceptable ig"
    },
    {
      "id": "nb2x4h7",
      "body": "Cs is not the only branch that exists. Mechanical engineering matters too. All branches make up the college average and median."
    },
    {
      "id": "nb2xjf9",
      "body": "And for cse as well, it was below 90. Like other tier 3 colleges."
    },
    {
      "id": "ne4mscb",
      "body": "Username checks out"
    }
  ]
}