{
  "id": "1md979a",
  "title": "[Question] how do I get mrd scholarship?",
  "content": "What is the eligibilty criteria? ",
  "metadata": {
    "author": "Putrid_Painter_3909",
    "url": "https://www.reddit.com/r/PESU/comments/1md979a/question_how_do_i_get_mrd_scholarship/",
    "permalink": "/r/PESU/comments/1md979a/question_how_do_i_get_mrd_scholarship/",
    "score": 1,
    "created_utc": 1753888357,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "n5zq0jb",
      "body": "Top 1 or 2% in your branch ig (based on cgpa)"
    },
    {
      "id": "n5zswkm",
      "body": "Do u have an idea on how much would that be? Will above 8 gpa  suffice?"
    },
    {
      "id": "n5ztdax",
      "body": "Idk, i scrolled through the subreddit 9+ is the safe score maybe for 50% and 8.5+ for 40%"
    },
    {
      "id": "n5ztgsk",
      "body": "Read past posts or the FAQ, please"
    },
    {
      "id": "n5ztsqy",
      "body": "Top 5% in ur branch (cycle for 1st year) provided that ur cgpa is above 9"
    },
    {
      "id": "n5zv9ls",
      "body": "8.5 is the qualifying cut-off. They will not give out scholarship even if you are in the top % but if you get less than 8.5.\nMRD is really hard to get , top 5%. CNR scholarship is top 15% based on sgpa. Cut off for that usually hovers around 8.7 - 9.3."
    },
    {
      "id": "n5zw64j",
      "body": "Though 2nd sem scholarship results haven’t come out yet, for us, mrd cutoff was set to 9.5 in 1st sem. This score depends on how the batch performs, so it can vary, but you need to be in the top 5%"
    },
    {
      "id": "n607wkw",
      "body": "They changed the names of the scholarships about a year or two ago. So you would find conflicting information.\n\nLet's just call them the 'big scholarship' and the 'small scholarship'. \n\nThe small scholarship was formerly called MRD scholarship. It is now called CNR scholarship.\n\nThe 'small scholarship' provides you a 40% fee return given that you're above 8.5 GPA (afaik) and in the top 20% in the branch according to your Semester GPA (SGPA). This would translate to roughly 8.5\\~8.6 above. \n\nThe big scholarship was formerly called CNR scholarship. It is now called the MRD scholarship\n\nThe 'big scholarship' provides you a 50% fee return given that you are in the top 2% of your branch according to your Cumulative GPA (CGPA). This translates to usually 9\\~9.1 above."
    },
    {
      "id": "n60fbo0",
      "body": "Okk thanks a lot"
    }
  ]
}