{
  "id": "1me6gyy",
  "title": "[Question] sections  help                       .",
  "content": "pesu gave us our sections today, the sections of our class we're supposed to be in from 2nd year onwards... sadly, im in the same class as the ppl who bullied me badly in 1st yr. and i really want to change the class.  is there any way this is possible? has any senior change their class before? can i contact someone?  is there anyone i can mail? please help me out.  ",
  "metadata": {
    "author": "No-Willow-1446",
    "url": "https://www.reddit.com/r/PESU/comments/1me6gyy/question_sections_help/",
    "permalink": "/r/PESU/comments/1me6gyy/question_sections_help/",
    "score": 22,
    "created_utc": 1753979861,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "n66ytrj",
      "body": "afaik , theres no way to change classes due to reasons like this , there will be \\~60 people in ur class , just avoid those people and try making new friends"
    },
    {
      "id": "n69roeo",
      "body": "Bullied? Man just complaint they will get proper punishment. "
    },
    {
      "id": "n6a8l8c",
      "body": "Try avoiding them for now in second year.\nIf it gets bad just tell your parents and ask them to talk eith yoir dept. coordinator. If parents are involved then the administration might take drastic measures.\n\nI hope you get through this man, just reach out for help if it gets worse."
    },
    {
      "id": "n6a90eh",
      "body": "Exactly, PES, for all that we make fun of it, has a solid anti-ragging policy."
    },
    {
      "id": "n6b0obv",
      "body": "thank you. but if there is a way i can change sections pls lmk. pls send me the mail id of whoever i can contact."
    },
    {
      "id": "n6b0q6a",
      "body": "thank you. but if there is a way i can change sections pls lmk. pls send me the mail id of whoever i can contact. or phone number."
    },
    {
      "id": "n6b0qll",
      "body": "thank you. but if there is a way i can change sections pls lmk. pls send me the mail id of whoever i can contact. or phone number."
    },
    {
      "id": "n6b0r5g",
      "body": "thank you. but if there is a way i can change sections pls lmk. pls send me the mail id of whoever i can contact. or phone number."
    },
    {
      "id": "n6b5pw2",
      "body": "You can't change it .Bro you should learn how to deal with that kind of people  .\nThere is no guarantee that you will get good friends if you change class also.\n\n\nSo try ignore and focus on real things .\nIf still you couldn't just ask help from mentor .Pes is strict about this types of things."
    },
    {
      "id": "n6bmez3",
      "body": "contact ur mentor"
    },
    {
      "id": "n6dl4q2",
      "body": "Contact your Faculty Advisor Mentor (FAM)"
    },
    {
      "id": "n6jt3fb",
      "body": "Depends on which branch you are in. Talk to your HOD\n\n For biotech we only had one class for each year."
    }
  ]
}