{
  "id": "1mgfkxg",
  "title": "[Discussion] Help me choose the right path",
  "content": "I am yet to join through cet , but will soon join pes rr campus  \nWhat is the criteria for branch change from eee to cse  \nHow hard it is to get the oppurtunity ?",
  "metadata": {
    "author": "CalligrapherLazy4403",
    "url": "https://www.reddit.com/r/PESU/comments/1mgfkxg/discussion_help_me_choose_the_right_path/",
    "permalink": "/r/PESU/comments/1mgfkxg/discussion_help_me_choose_the_right_path/",
    "score": 3,
    "created_utc": 1754215502,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "n6o6fbe",
      "body": "Don't."
    },
    {
      "id": "n6o6hgj",
      "body": "anyone else ?"
    },
    {
      "id": "n6o7yg1",
      "body": "What"
    },
    {
      "id": "n6oalyc",
      "body": "Either if u can get in further rounds or after first year priority will be given to ppl with max cgpa to change branch"
    },
    {
      "id": "n6obgs5",
      "body": "generally how many ppl opt and successfully change their branch ?\n\ndoes it depend on the seat vacancy ?"
    },
    {
      "id": "n6obouj",
      "body": "This method is not reliable. It depends on the seats left, some batches had only like 2-3 seats but my batch had more than 20, so it completely depends on luck. If the seats remaining are less you'll need a very high gpa but if theres more seats, more ppl can move so the cutoffs decrease. For my batch we need around 9.45 to get cse rr"
    },
    {
      "id": "n6ocg1b",
      "body": "How does the seat vacancy be predicted ?  \ndoesnt pes intake to their max capacity ?"
    },
    {
      "id": "n6ohlna",
      "body": "very few get to change their branches even if ther r empty seats like 3-4, with highest of gpas of 9.5+ so yeah its not reliable as depends on too many factors"
    },
    {
      "id": "n6oiwcx",
      "body": "Some people leave the seat last minute even though they dont get a refund. They seat vacancies cannot be predicted, you have to just wait till 2nd year to know. Or you can try asking the administration dept, idk if theyll tell tho"
    },
    {
      "id": "n6op0d2",
      "body": "Same thing but i am now stuck in pes because i took a seat in jee counselling. Ill prolly join EE through kcet too. I really am cooked rn💔"
    }
  ]
}