{
  "id": "1mgmn00",
  "title": "[Question] Hellp about Holidays",
  "content": "MOD please don't ban me 😭😭😭\n\nI wanted to ask about holidays that I will get in first year. I am from North and i wanted to know when can I come home during my first year. Heard that pes doesn't give muchh holidays to first year people, is it true. Being a very homesick kinda person I am really concerned.",
  "metadata": {
    "author": "pareshan_aatmaaa",
    "url": "https://www.reddit.com/r/PESU/comments/1mgmn00/question_hellp_about_holidays/",
    "permalink": "/r/PESU/comments/1mgmn00/question_hellp_about_holidays/",
    "score": 13,
    "created_utc": 1754236221,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "n6poj5w",
      "body": "Delhi?"
    },
    {
      "id": "n6ppahn",
      "body": "naah"
    },
    {
      "id": "n6ppzjd",
      "body": "Holidays? What that bro?\n\nI been swimming through mud pools, fighting heat strokes and what not to get to clg and back.\n\nBut on a serious note, definitely lesser holidays than other colleges around and less forgiving. During the semester maybe around 10-15 days due to festivals, public holidays etc.\n\nAround 1-2 weeks after odd sem.\n\n2-3 months after even sem.\n\nCheck the FAQs once."
    },
    {
      "id": "n6pqxqh",
      "body": "Summer break you might get 1.5 month holidays. Other than that the break b/w 1st and 2nd sem which is 12ish days."
    },
    {
      "id": "n6pr9fa",
      "body": "like even after 1 sem do we get 1-2 week holidays??? because someone only 25 th is a holiday for the first sem."
    },
    {
      "id": "n6prjtj",
      "body": "like even after 1st sem do we get 1-2 week holidays??? because someone told me only 25 th is a holiday for the first sem."
    },
    {
      "id": "n6ps788",
      "body": "No you atleast get a week I'm sure."
    },
    {
      "id": "n6pt4q4",
      "body": "We won't ban you unless you do something offensive. We will however block all posts if you post questions that have been discussed before. \n\nSearch the FAQs or the subreddit. It's been asked and answered already."
    },
    {
      "id": "n6ptpeu",
      "body": "Comment unrelated to the post."
    },
    {
      "id": "n6pymnk",
      "body": "Pretty sure we had like one week. Check your calendar all holidays are given there."
    },
    {
      "id": "n6qdr9h",
      "body": "username checks out 😭🥀"
    },
    {
      "id": "n6qj3i9",
      "body": "Bunk 3-4 days and go home clubbing it with a weekend when u don't have any project submissions exams, etc and then try not to bunk too much apart from that, it's quite ez to maintain 75% attendance."
    },
    {
      "id": "n6t2f55",
      "body": "😭😭😭😭"
    },
    {
      "id": "n6t2k32",
      "body": "Okay Noted, Thank you 🥹"
    },
    {
      "id": "n6u31zs",
      "body": "what abt diwali times   \ndo we get a few holidays for that or no"
    },
    {
      "id": "n6viul9",
      "body": "Mostly 1 day for festivals if it is a big one. During ongoing semesters holidays are less"
    },
    {
      "id": "n78hyhb",
      "body": "The main ones will be in Christmas and Summer. \n\nYou might get long weekends if a holiday happens on friday"
    }
  ]
}