{
  "id": "1mgodqw",
  "title": "[Placements] Help me with Internships",
  "content": "So I am currently going to 2nd year ECE, and I wanted help on internships during 2026 summer break. Is it common to do internships in-between 2nd and 3rd year and like what are the ways to apply. Do people usually go for big companies, or is it small internships for experience. Also how does internships after 3rd year work, is there a summer break where we can do and 7th sem starts as usual with classes, or will we have to do internship for the whole of 4th year?",
  "metadata": {
    "author": "Signal-Cat2063",
    "url": "https://www.reddit.com/r/PESU/comments/1mgodqw/placements_help_me_with_internships/",
    "permalink": "/r/PESU/comments/1mgodqw/placements_help_me_with_internships/",
    "score": 6,
    "created_utc": 1754240496,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "n6q30aw",
      "body": "Usually when you’re going to 2nd year,no one is going to offer you an internship,I would recommend spending your time on learning different topics and moving into whatever you personally find interesting.\n\nBetween 2nd and 3rd year you can do a summer internship,same for 3rd and 4th year.You can claim 2 credits and I’d say 50-70% of people do summer internships but very few get good corporate ones.\n\nYou have to mandatorily do 4 months of internship in your 8th sem,you’ll usually get these via placements or applying online.\n\nOverall chill out"
    },
    {
      "id": "n6q4vhs",
      "body": "So I want to do an internship after my 2nd year, i.e 2026 summer, when and where do I start applying? And what type of companies are realistic to apply?"
    },
    {
      "id": "n6q5991",
      "body": "You can’t really apply anywhere now,for PES students doing it in between 2nd and 3rd year you mostly do it at a centre in PES,you can talk to your professors and ask to work under them or so.\n\nI’d say 99.99% of companies or research centres don’t want a student that’s starting their 3rd year."
    },
    {
      "id": "n6q6o7e",
      "body": "Ohk thanks for the info, really helped"
    },
    {
      "id": "n6smfz2",
      "body": "But I’ve heard a lot of CS students, at least, doing internship between their 2nd year and 3rd vacation? Are we meant to do internship in summer after 2nd year or are we meant to work on skills? \n\nPlease note I am not talking about internships in PESU labs"
    },
    {
      "id": "n6tzydu",
      "body": "Up to you"
    },
    {
      "id": "n6u3mrj",
      "body": "Not 4 months, by the way. 1 credit= 2 weeks of internship. You need 6 internship credits in your 4 years of University. You can do a summer internship for 2 credits and even get away with a 2 month internship during your final semester. If you get something through the College Placement cell though you'll be doing a 5-6 month internship. I know someone who did her 8th sem internship at a random startup and she basically just interned there for a little more than 2 months. (She had a FTE with no associated internship and also a summer internship)"
    },
    {
      "id": "n6w2en4",
      "body": "They’ve changed it to 8 credits of internship for the 26 batch"
    }
  ]
}