{
  "id": "1mkz8qn",
  "title": "[Question]help me score well in cs/aiml maths",
  "content": "which resources do i use to score well in mcse sem 3?",
  "metadata": {
    "author": "spartanplays7",
    "url": "https://www.reddit.com/r/PESU/comments/1mkz8qn/questionhelp_me_score_well_in_csaiml_maths/",
    "permalink": "/r/PESU/comments/1mkz8qn/questionhelp_me_score_well_in_csaiml_maths/",
    "score": 6,
    "created_utc": 1754669085,
    "flair": "Study Help :table:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "n7mgzjw",
      "body": "If you have a good teacher, just pay attention in class well. Practice the cw problems religiously before isas. One of the easier courses to score in"
    },
    {
      "id": "n7mhwwd",
      "body": "thank you!  would appreciate if you could drop the lore on other subjects as well"
    },
    {
      "id": "n7mjaw9",
      "body": "Idk wym by lore in this context lol. If you’re asking what it’s about, it’s statistics. There’s a few simple formulas to remember and distributions to understand. They emphasise more on application and less on actual computation and stuff. Easy S grade"
    },
    {
      "id": "n7mji18",
      "body": "he meant other courses apart from math"
    },
    {
      "id": "n7mk86z",
      "body": "I’m blind lmao. Aight so wt you need to practice a lot. I found it kind of hard, but I didn’t study till th night before, don’t do that, especially for wt. dsa is super important, pay attention in class and practice, it’s asked in interviews for placements. Ddco is cancer, your grade depends on how generous the paper setter was feeling. Afll also is pretty easy if you are regular. It’s pretty logic driven and scoring imo"
    },
    {
      "id": "n7mkcyk",
      "body": "lol yes"
    },
    {
      "id": "n7ml2th",
      "body": "would appreciate if you tell what resources to use T-T. Im kinda aware of how hard the subjects are lol"
    },
    {
      "id": "n7mn1si",
      "body": "For wt, refer Anurag notes, they are godsend. While studying just refer the slides side by side to avoid out of syllabus stuff cuz they are a couple of years old at this point. Ddco I found the slides dogshit, try to refer the tb. It takes time but gives very solid understanding. Maths as I told just listen in class and the cw problems. Afll slides are more than enough. Dsa you can find some yt playlist, slides are kinda meh"
    },
    {
      "id": "n7mpac9",
      "body": "ok thanks a lot, will try my best to score well"
    },
    {
      "id": "n7qiyj7",
      "body": "Where could be find Anurag notes?"
    },
    {
      "id": "n7qm6q4",
      "body": "It’s prolly on Pesu media discord"
    },
    {
      "id": "n7qzwp1",
      "body": "when i went thought the math slides i saw that it's mostly theory and even in the qb not a lot of problems were asked,is this how it'll be in the isas as well?"
    },
    {
      "id": "n7rd6qp",
      "body": "Mcqs will have a bit of theory but iirc all the 4 markers for numericals"
    }
  ]
}