{
  "id": "1mlq1rv",
  "title": "[Placements] Are there any hopes left?😭😭",
  "content": "Almost 15+ companies have come for placements and i didn't even get a chance to write a single OA..  \nI have a cgpa of 7.4.. I had applied for some companies with 7 cutoff but still didn't get shortlisted for any OA.",
  "metadata": {
    "author": "Several_Appearance78",
    "url": "https://www.reddit.com/r/PESU/comments/1mlq1rv/placements_are_there_any_hopes_left/",
    "permalink": "/r/PESU/comments/1mlq1rv/placements_are_there_any_hopes_left/",
    "score": 49,
    "created_utc": 1754747748,
    "flair": "Placements 🤑",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "n7s9lvz",
      "body": "Cfbr"
    },
    {
      "id": "n7siua7",
      "body": "You will have to either wait it out until students with higher GPA get placed. With that CGPA, its going to be challenging to get through to the interview round as well, regardless of how well your OA goes. This is why I keep telling everyone to keep working on their CGPA. Anyway, you cannot do anything about it apart from upskilling so that when you do make it to the interviews, you are a strong candidate. For now, keep applying off campus and don't lose hope. Its going to be a tough ride for you."
    },
    {
      "id": "n7swrtg",
      "body": "15+ how?   \n  \n10 company's OA happened till now, they were all too high CTC companies so obviously cutoff would be higher. Wait it out for your turn, there's like 400 8.5+ cg people in CSE+AIML💀"
    },
    {
      "id": "n7swy5f",
      "body": "💀💀"
    },
    {
      "id": "n7szbgb",
      "body": "Total students??"
    },
    {
      "id": "n7t5hci",
      "body": "No idea. Can be 1400-1600 eligible and applying (7+ cg)"
    },
    {
      "id": "n7t6edn",
      "body": "Above 8 , around 1000 and above 8.5 almost 500 and above 9 about 150"
    },
    {
      "id": "n7t6koi",
      "body": "Bro oa's are getting real hard, would it even decrease or is it going to be this way"
    },
    {
      "id": "n7t8d5g",
      "body": "Difficulty level depends on the company. T1 and other major ones tend to keep harder tests. The only thing you can do is prepare better."
    },
    {
      "id": "n7ta0cj",
      "body": "do they cut off just for the current one or do they also cut off for puc ans 10th"
    },
    {
      "id": "n7tab91",
      "body": "Schneider puts 90% on 10&12 cutoff. One more company did that can't recall which one was it."
    },
    {
      "id": "n7tyh12",
      "body": "It's definitely more than that for our batch, because of the addition of aiml."
    },
    {
      "id": "n7wegsr",
      "body": "were the cutoffs 8.5 mostly?"
    },
    {
      "id": "n7wihy3",
      "body": "Yeah.. few 9+ also"
    },
    {
      "id": "n7wl7zi",
      "body": "is someone maintaining a placement sheet?"
    },
    {
      "id": "n7wo61z",
      "body": "I don't think so"
    },
    {
      "id": "n83riaj",
      "body": "Yeah, company cutoffs are pretty frustrating — not even getting to sit for them can really put you down.\n\nBut hey, placements have just started. Ik it’s tough seeing people around you land jobs, but control what you can control and keep moving forward with your best foot."
    },
    {
      "id": "n88729z",
      "body": "1000 above 8 is crazy💀"
    },
    {
      "id": "n8m2pqp",
      "body": "Will there even be any tier 1 companies with 7+ criteria ? Rn many of them keep 7+ cutoff then change it to 8, 8.5+ a day before the test , it's so frustrating"
    },
    {
      "id": "n9812vd",
      "body": "Yeah, there will be, but not too many at first. Having a 7.5 or 8+ definitely puts you in a better spot tho.\nSome of my friends in the 7–8 GPA range did land placements in T1 companies."
    },
    {
      "id": "n9jvq5g",
      "body": "😢 😭In upcoming batches,this will only get worse I'd assume lol."
    }
  ]
}