{
  "id": "1mpt2wf",
  "title": "[Discussion] Is macbook M4 air the best laptop to choose rn ? ( Neglecting the price)",
  "content": "{title } and i saw there are some problems with macbook users to do some assignments in class , is it manageable or i should go for windows. ",
  "metadata": {
    "author": "eatenzack",
    "url": "https://www.reddit.com/r/PESU/comments/1mpt2wf/discussion_is_macbook_m4_air_the_best_laptop_to/",
    "permalink": "/r/PESU/comments/1mpt2wf/discussion_is_macbook_m4_air_the_best_laptop_to/",
    "score": 13,
    "created_utc": 1755153905,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "n8m0g8t",
      "body": "Using a MacBook for college applications is just extra work.\nIf u don't mind doing lil more than the windows users then it's all good\n\nWhatever u take but windows will always be a better option for me"
    },
    {
      "id": "n8m0nyb",
      "body": "Ahhh okay 😭 , which is the best windows laptop under 70k or 50k"
    },
    {
      "id": "n8m4a16",
      "body": "I own a gaming laptop but would suggest mac . If you are not that much into gaming"
    },
    {
      "id": "n8m4ye6",
      "body": "Get a mac, u will be bringing ur laptop to college regularly from 2nd year onwards, it's way lighter than most windows laptop and convenient to carry. The portability alone makes it a better option. I bought a reaaaaaally expensive windows laptop but regret buying it cuz it's so fucking heavy, I workout at the gym just so I can carry it around lmfao"
    },
    {
      "id": "n8m83xy",
      "body": "Oh okay"
    },
    {
      "id": "n8m85di",
      "body": "Okay"
    },
    {
      "id": "n8mhuuy",
      "body": "No bro u actually have to do less work than windows users if anything is not working linux is always an option"
    },
    {
      "id": "n8mqwi7",
      "body": "Ok bro now I am convinced to take mac"
    },
    {
      "id": "n8n7n26",
      "body": "Go with a mac bro, it's much better than windows laptops"
    },
    {
      "id": "n8o1ahr",
      "body": "For dev work, Mac’s a good choice (macOS is the closest to Linux), and yeah, some softwares won’t run natively, just use UTM or some online emulator."
    },
    {
      "id": "n8sh8h3",
      "body": "Just buy an old thinkpad (t480) and flash some linux distro on it"
    },
    {
      "id": "n8voyu5",
      "body": "Here comes the Linux nerd, no hate ofc"
    },
    {
      "id": "n8vp1vs",
      "body": "Macbook is the best choice"
    },
    {
      "id": "n8vpkbq",
      "body": "Kay"
    }
  ]
}