{
  "id": "1ms554k",
  "title": "[Placements] 7.9 CGPA gang… are we cooked for placements or nah?",
  "content": "Bro I’m losing it. Sitting here with a 7.9, grinding Leetcode like a clown, decent at DSA, have solid projects + experience in devsecops/ML… and then boom not even shortlisted because CGPA filter.\n\nLike what are we supposed to do? For people who were in the 7.7–8 range, did you still get placed on campus? Or did you just go full off-campus warrior mode? How bad was it really?\n\nI know I’m not dumb, but this stupid number on a piece of paper is blocking me before I can even try. Anyone been in the same boat? How did you handle it?\n",
  "metadata": {
    "author": "No_Ordinary7317",
    "url": "https://www.reddit.com/r/PESU/comments/1ms554k/placements_79_cgpa_gang_are_we_cooked_for/",
    "permalink": "/r/PESU/comments/1ms554k/placements_79_cgpa_gang_are_we_cooked_for/",
    "score": 49,
    "created_utc": 1755372510,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "n924z9w",
      "body": "Yo please y’all are seeing the post not saying anything 😭😭\nAlready 100 views"
    },
    {
      "id": "n925psr",
      "body": "You do not need to worry.\n\nTBH placement is luck.\nWe had people with 7.5 gpa getting placed in aug-sept while we also had people with 9 gpa not placed until dec.\n\nTo be honest grind away. You gotta prepare for the interview while practicing dsa.\n\nNo need to be worried just yet. Just grind away and bide your time."
    },
    {
      "id": "n9269hp",
      "body": "Chill mate."
    },
    {
      "id": "n94ikv2",
      "body": "I was placed with 7.3ish GPA in September, so dont lost heart, I got placed on campus. but a few friends of mine who had 9+ CGPA hadnt got placed at all yet."
    },
    {
      "id": "n94l9na",
      "body": "You'll be fine with 7.9, the first few companies might emphasize on 8+ or even higher, companies like Okta, Arista, Intuit, StockX JP Morgan and Couchbase did. However, Societe Generale for instance took many people in the 7-8 range."
    },
    {
      "id": "n94wn41",
      "body": "Now ur scaring guys with 9+ CGPA 😢"
    },
    {
      "id": "n953ike",
      "body": "https://preview.redd.it/t9zo5lnk7jjf1.png?width=62&format=png&auto=webp&s=32368a679c70a3be41a2a9cd508ecf2850c7cf28\n\nyoooo 🥀🥀"
    },
    {
      "id": "n95adea",
      "body": "Bhai 9cg😭✋️"
    },
    {
      "id": "n95j609",
      "body": "Yuh"
    },
    {
      "id": "n96ctzj",
      "body": "I got placed with 7.76 CGPA in a tier-1 company in  October so dw"
    },
    {
      "id": "n96czk2",
      "body": "Which branch CSE or ECE"
    },
    {
      "id": "n96d2ku",
      "body": "ECE"
    },
    {
      "id": "n96qfog",
      "body": "Hey, I am not generalizing chill"
    },
    {
      "id": "n96qfz0",
      "body": "Hey, I am not generalizing chill"
    },
    {
      "id": "n9a0382",
      "body": "bro, can you tell us a bit more about ece placements?"
    },
    {
      "id": "n9b400a",
      "body": "I mean what kind of details do you need"
    },
    {
      "id": "n9b4w7a",
      "body": "What was ur strategy?? were u always interested in Electronics from the beginning??"
    },
    {
      "id": "n9b50tt",
      "body": "IT related or Electronic related??"
    },
    {
      "id": "n9b6nme",
      "body": "I mean I did my minors in CSE and started doing leet code from second year , out of 10 companies that come for placements only one will be the core company and that ratio reduces further as placements progress"
    }
  ]
}