{
  "id": "1mtvn4w",
  "title": "[Placements] ECE ppl cooked for 25-26 ?",
  "content": "As of now every company which has showed up recently is choosing mostly from CSE background. ECE ppl are allowed for the placements but only those who have done the minors in the CSE are able to compete with regular CS ppl up to some extent. But what about the core guys like me... I mean I have done courses for Data Analytics, Full Stack MERN, and I have started solving the DSA also, but this is too much for me. And the capstone is also almost upon us... 😭😭😭 Any suggestion from the grads ?? ",
  "metadata": {
    "author": "Thin-Judgment-2216",
    "url": "https://www.reddit.com/r/PESU/comments/1mtvn4w/placements_ece_ppl_cooked_for_2526/",
    "permalink": "/r/PESU/comments/1mtvn4w/placements_ece_ppl_cooked_for_2526/",
    "score": 30,
    "created_utc": 1755544717,
    "flair": "Placements 🤑",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "n9ehbpo",
      "body": "Omg, it's almost as if whatever I wrote in the FAQs is actually true! /s\n\nIf you wanted to end up in IT, you should've chosen CS or CS-adjacent degrees. You can't really do anything right now except keep working on your skills, polish your DSA and build your skills. You've got to make the most of whatever opportunities come your way, so keep working hard. Eventually, you'll get shortlisted for interviews, and that's when you've got to make it count."
    },
    {
      "id": "n9ek2wx",
      "body": "I wanted to do CSE, but the management fees was way too much for me. So I chose ECE. I have joined through lateral entry diploma and you know the funny part, we had to give a DCET exam in which I scored 66th rank in all over Karnataka. But since I was not from Karnataka, I had to give management fees. Which is totally fair from there perspective, but a little concession could have helped. Ppl with 3000 ranks are paying almost 1 Lakhs per year. Mine is 4 😭"
    },
    {
      "id": "n9ifkyb",
      "body": "you choose your own fate, you chose ECE but u are doing all these CS courses, do you know what you actually want?"
    },
    {
      "id": "n9joy0e",
      "body": "Tbh, you have brought this upon yourself, as already explained in other comments, put in effort that is all I can say. some day you will get shortlisted and you can show your true potential there. \n\nGood luck !!"
    }
  ]
}