{
  "id": "1mv5acy",
  "title": "[Question]LAPTOP USE AND SPECIFICATION",
  "content": "I am a CSE&AIML student in EC campus so I just wanted to know how frequent we are supposed to bring laptop and what is the specification required ",
  "metadata": {
    "author": "Ecstatic-Alarm-3213",
    "url": "https://www.reddit.com/r/PESU/comments/1mv5acy/questionlaptop_use_and_specification/",
    "permalink": "/r/PESU/comments/1mv5acy/questionlaptop_use_and_specification/",
    "score": 17,
    "created_utc": 1755664779,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "n9nqqlu",
      "body": "joining ec cse as well, I am toh bringing a normal laptop which can handle moderate amount of task"
    },
    {
      "id": "n9nqz6z",
      "body": "you don't have to bring it a lot during the first year- just in the c/python classes if the teacher allows it- for other subjects, just occasionally maybe to complete an assignment or some presentation, which again depends on the teacher."
    },
    {
      "id": "n9nrhnq",
      "body": "bhaiya a question doe, will we get some kind of charging ports in classroom? cuz my laptop gets emptied in about 2 hours(more or less)"
    },
    {
      "id": "n9nsjdz",
      "body": "Yes"
    },
    {
      "id": "n9nskvx",
      "body": "You have charging ports in classrooms. Also, you don't have to call people bhaiya here. Just call by names"
    },
    {
      "id": "n9nswtl",
      "body": "Got it!! thank youuu"
    },
    {
      "id": "n9nxb4f",
      "body": "I guess it would be better if you buy one after joining the college as you then get a student discount."
    },
    {
      "id": "n9nxoo4",
      "body": "do i need a graphic card like NVIDIA"
    },
    {
      "id": "n9o1xwr",
      "body": "Depends what you wanna do but I'd say not really."
    },
    {
      "id": "n9o7z4f",
      "body": "Get a macbook and stay in peace for 4 years"
    },
    {
      "id": "n9or1tj",
      "body": "Is 16gb ram necessary? Won't 8gb be enough?"
    },
    {
      "id": "n9os5kn",
      "body": "For realllll\nMacBook are the best \nThe silent ones and the most reliable \nI have few friends who have windows yearly they get issues with wifi card or SSD"
    },
    {
      "id": "n9os68e",
      "body": "Get 16gb bro"
    },
    {
      "id": "n9os7bz",
      "body": "Yeahhh you need"
    },
    {
      "id": "n9osbaw",
      "body": "Then get MacBook \n14 hour battery life man \nThe best thing I bought in my life it’s still running and no lag"
    },
    {
      "id": "n9p5han",
      "body": "only for gaming  \nmost ml stuff you do on cloud anyway"
    },
    {
      "id": "n9ppq15",
      "body": " you'll need to use it to build projects, complete course work etc- so, to be on the safer side, 16GB RAM is advised"
    },
    {
      "id": "n9tw05x",
      "body": "Get a macbook , if budget doesn't allow buy a good quality windows laptop , (thinkpads , yoga and other equivalents).\nDon't buy a gaming laptop, almost everyone has it and everyone I've talked to is just annoyed by dealing with it , they are bulky , fragile , shit battery and you won't be doing much gaming in pes  (light and indie games can be handled by non gaming laptops)"
    },
    {
      "id": "n9u5qac",
      "body": "A dedicated gpu isn't required ryt?\nI thought of buying a ThinkBook."
    },
    {
      "id": "n9u6k0y",
      "body": "spent all the money trying to pay the absurd tuition fees 😭😭"
    },
    {
      "id": "n9uaqgj",
      "body": "No , the entire course can be done on a 10+ year old laptop running linux , there's only one elective Ar vr or something where gpu is needed for unity , thinkpads are better built than thinkbooks but check for urself before buying"
    },
    {
      "id": "n9umv18",
      "body": "Ya even i bought omen and in one year it has some display issue"
    }
  ]
}