{
  "id": "1myjunk",
  "title": "[Question]Tell me your experience",
  "content": "I want a detailed pros and cons about pesu rr campus hostel ( IT block 4 sharing rooms with common bathrooms) , (especially)are students crowded in bathrooms at peak hours and is hot water available for bath? Pls help",
  "metadata": {
    "author": "Ksjaysheel",
    "url": "https://www.reddit.com/r/PESU/comments/1myjunk/questiontell_me_your_experience/",
    "permalink": "/r/PESU/comments/1myjunk/questiontell_me_your_experience/",
    "score": 9,
    "created_utc": 1756001964,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "nacr44n",
      "body": "Pros:-\n1. You'll make a lot of friends.\n2. You get Garden\nCons:-\n1.Washrooms might not be clean, but it'll stop bothering you in a month.\n\nEarlier IT Block used to be triple sharing."
    },
    {
      "id": "nad5jno",
      "body": "From Room 103\nPros : U can join a late night group discussion \n           Make more friends\nCons : Washrooms n Toilets r not that good\n            Rooms rnt spacious \n            and also doesn't look as good as nb"
    },
    {
      "id": "nad6bsg",
      "body": "Are pg's better option than hostel, if I buy mess membership in campus"
    },
    {
      "id": "ndh95s8",
      "body": "Listen man, I’ve been living outside the hostel for three years, and unless you have a lot of money, I’d strongly recommend choosing the hostel. Here’s why:\n\n* **Laundry is included.** Trust me, this will save a lot of your time.\n* **Food is close by** (you might not always like it, but it’s convenient).\n* **Better environment.** Around PES, most rooms rented out to students are terrible. I’ve stayed in four different places (yes, I’ve moved four times), and it’s honestly been the worst experience — especially if your roommates are annoying or try to peer-pressure you.\n* **Space.** Some people say hostel rooms are cramped. I’ve seen them, brother — they’re not. They’re actually decent enough to live in comfortably.\n* **Saves time.** Hostel life saves you a lot of time, because all the little chores that people living outside have to handle are already taken care of.\n\nI really wish I had chosen the hostel in my first year itself.\n\nAnd whatever you do, don’t even think about commuting from anywhere farther than Vijayanagar."
    }
  ]
}