{
  "id": "1mz4uic",
  "title": "[Placements] Shortlist for Lam research",
  "content": "Lam research have released the shortlist for all the roles except for the QA/Testing role\nAre they going to take people from dev itself or will they release it at some later date?",
  "metadata": {
    "author": "Hopeful_Wing5559",
    "url": "https://www.reddit.com/r/PESU/comments/1mz4uic/placements_shortlist_for_lam_research/",
    "permalink": "/r/PESU/comments/1mz4uic/placements_shortlist_for_lam_research/",
    "score": 4,
    "created_utc": 1756063421,
    "flair": "Placements 🤑",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "nan3mc1",
      "body": "I think they are going to take from the people shortlisted for dev itself."
    },
    {
      "id": "nan4bng",
      "body": "Well that’s insane😭"
    },
    {
      "id": "nan4jz0",
      "body": "Yeah, but surely they will hire just one or two from the shortlisted; So no hope from Lam"
    },
    {
      "id": "nan4o42",
      "body": "Placements soo cooked 🥀"
    },
    {
      "id": "nan4y49",
      "body": "Yeah, the number of companies visiting in next few weeks has suddenly dropped; Only some magic like the ibm mass hiring can save us now"
    },
    {
      "id": "nan519w",
      "body": "Dropped? Why?"
    },
    {
      "id": "nan5ipf",
      "body": "Don't know man, like generally september and October are the peek of placements; But the number of companies is not even one per day, it was 1-2 per day during last academic year I guess."
    },
    {
      "id": "nan5ubp",
      "body": "That is honestly soo depressing 😭"
    },
    {
      "id": "nan639s",
      "body": "Yeah, with this market getting an offer campus is much more difficult; We are totally cooked at this point"
    },
    {
      "id": "nan67a0",
      "body": "How many have gotten placed so far?"
    },
    {
      "id": "nan6iym",
      "body": "Around 108 have got placed through the drives and I guess at least 30-40 have got ppo; So it must be around 150."
    },
    {
      "id": "nan7m28",
      "body": "😢"
    },
    {
      "id": "nap7h4s",
      "body": "Ngl, isn't that a good number. I thought it would be just 30-40"
    },
    {
      "id": "naprk93",
      "body": "It's not, already we are 1 month into the placement and not even 10% are placed."
    },
    {
      "id": "naprtgl",
      "body": "100+ is still good imo, can't do anything Abt the batch size"
    },
    {
      "id": "naprzcx",
      "body": "But even though the last batch faced same issue, they had 250-300 at this point. So the situation is not at all good."
    },
    {
      "id": "naps3vy",
      "body": "It will get better , what can we even do other than hope and prepare"
    },
    {
      "id": "napshfg",
      "body": "Honestly looking at the market, it's not at all going to get better; It can at max reach the previous batch level; Hope is the only thing we can have"
    },
    {
      "id": "naptvz6",
      "body": "That was only because of ibm last year  ig thats not the norm"
    },
    {
      "id": "napu5xs",
      "body": "It was the norm generally. But this year even ibm is doubtful of visit"
    }
  ]
}