{
  "id": "1mzlgru",
  "title": "[Placements][Rant] 2025 Campus placement.",
  "content": "I heard from few VPs and managers of some companies, that they are willing to come for placement to PESU. But looks like PESU is not able to provide them with the required infra and asking them to do virtual interviews!!. So these companies are still thinking, as most of them don't prefer this method. So they may end up NOT coming for placements this year. Students after paying so much fees, going through all the hardship of joining this so called top college, in this kind of tough job market, are going to be robbed of these precious opportunities. PESU's placement office is completely responsible and should be answerable for this.",
  "metadata": {
    "author": "Exotic_Garbage9371",
    "url": "https://www.reddit.com/r/PESU/comments/1mzlgru/placementsrant_2025_campus_placement/",
    "permalink": "/r/PESU/comments/1mzlgru/placementsrant_2025_campus_placement/",
    "score": 91,
    "created_utc": 1756112729,
    "flair": "Placements 🤑",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "najy8yw",
      "body": "It's the sheer amount of students in PES. It's apparently too hard for PES to accommodate wifi for 400 people for an OA. Companies had to do retests to divide the batch so that their wifi can hold up. Only god can help pes atp"
    },
    {
      "id": "najz0ry",
      "body": "It's a dogshit college \n\nThat's what happens when the strategy is \n\"take in more students, deal with it when it's a problem\"\n\nThey kicked bangaloreans out of the hostels, and now they can't even do the one and only job indian colleges have."
    },
    {
      "id": "najzcif",
      "body": "A different perspective but if a company is not hiring from a college just because of college not providing infra, it also raises some red flags about the company \n\nLike yes, it would be better if PES did provide, it would be beneficial; but grow up, almost all meetings are online, you should have a SOP to hire online too"
    },
    {
      "id": "nak0b46",
      "body": "Offline tests are a quadrillion times better. Everyone alive knows how rampant the cheating is in OAs. and when tons of people get perfect scores, it's like the shortlist are just completely random. And generally full of idiots\n\nBut when the tests are in campus, you see the better and more deserving people get shortlisted. And I'm sure companies know this too"
    },
    {
      "id": "nak0bpq",
      "body": "Agree, batch size has been increased to a ridiculous number"
    },
    {
      "id": "nak19vo",
      "body": "This exactly, idk what our college is smoking , they make us sit in assesment centre for all kinds of useless 2 credit exams and the actual most important tests have all kinds of dogshit happening ( meesho literally took a gforms test wtf)"
    },
    {
      "id": "nak1sx8",
      "body": "So true. I honestly feel I got placed only because the company’s test and interview were offline. If that test had been online, the shortlist would’ve been filled with random people who just know how to cheat without getting caught, instead of deserving candidates.\n\nI think companies are starting to catch on to this, which is why most of the tests in the first and second week were conducted offline on campus. And when I saw the people who got selected in those companies, many of them were genuinely smart and knowledgeable, people I personally know. I can’t say the same about the results of many online tests, even with proctoring.\n\nWhat I also like about offline tests is that even if you don’t get shortlisted, you know the people who did actually performed better and deserved it. But with online tests, it’s so frustrating and demotivating to see random people who cheated getting shortlisted while you’re left out."
    },
    {
      "id": "nak1vwn",
      "body": "Wasn't that netcor"
    },
    {
      "id": "nak2dxk",
      "body": "Meesho took on hackerearth right? Even that they had to do it 2-3 times I remember. Idk about the time they came for BA though."
    },
    {
      "id": "nak3syt",
      "body": "Bro during he orientation Mr.Jawahar doreswamy was like he can get companies like apple by just one phone call , he said we won't regret not joining any iit/nit after listening to his 1hr speech yesterday ( which really pleased my parents tho)"
    },
    {
      "id": "nak45f3",
      "body": "Marketing"
    },
    {
      "id": "nak4nus",
      "body": "It's gonna get worse . Our juniors are almost 3k .\nThey are not able to place 1.7k ppl idfk how they gonna place so many"
    },
    {
      "id": "nak53ur",
      "body": "Man only we know 26' batch how we struggling to get placed or TO EVEN GET SHORTLISTED WHEN SHORTLISTING IS SO RANDOM"
    },
    {
      "id": "nak5qg5",
      "body": "By these issues, will pesu(rr campus)be better option than bmsce ,\nI would like to hear a suggestion from the seniors"
    },
    {
      "id": "nak6p5c",
      "body": "I think pesu(only through cet) is still better than bmsce"
    },
    {
      "id": "nakd35g",
      "body": "And also don't forget about the people who cheated clogging up the shortlist majority of them get kicked out during technical interview while people who genuinely tried their best wouldn't even get a chance to prove themselves in the technical round."
    },
    {
      "id": "nakew1l",
      "body": "You know it's only going to get worse for the future batches due to the enormous increase in the number of seats"
    },
    {
      "id": "nakeztk",
      "body": "Then why don't u also cheat bro, it's simple, why would others simply not cheat because u are better than them., when it's ez to cheat"
    },
    {
      "id": "naki283",
      "body": "How retarded do people have to be to believe him?"
    },
    {
      "id": "nakj8rp",
      "body": "If it’s online, most people end up cheating. The shortlisting criteria are so vague and unpredictable that it feels completely random. Even those who finish the test early with all test cases passing often don’t get shortlisted, while others who didn’t even solve the full problem do. Sure, there might be reasons like plagiarism flags, proctoring issues, or other checks, but in many cases both groups have cheated, and the final list still feels random.\n\nAnd even if the process were perfectly fair, where only those who solved everything got shortlisted, it still wouldn’t fix the bigger issue, the test just becomes a competition of who can cheat faster and smarter without getting caught. That completely defeats the purpose of giving deserving candidates a real chance, because speed at cheating doesn’t make someone the more capable candidate."
    },
    {
      "id": "nakjkca",
      "body": "Can't do anything Abt it, placements have always been luck based in every college if u have heard from elders"
    },
    {
      "id": "nakjo16",
      "body": "I'm telling that it is pointless"
    },
    {
      "id": "naknyqh",
      "body": "The most frustrating thing was when they called to campus for the PPT of LAM research and then after like two hours told us that we have to go home to write the OA\nLike just defeated the whole purpose of travelling to college"
    },
    {
      "id": "nakrrwt",
      "body": "Wait has it really instead so much? Even in EC campus??"
    },
    {
      "id": "nakyb3w",
      "body": "Marketing bruh"
    },
    {
      "id": "nakymvc",
      "body": "If you're getting it via CET join.Else join BMSCE."
    },
    {
      "id": "nakyup6",
      "body": "Why like that ?"
    },
    {
      "id": "nal73dm",
      "body": "No wonder Google is bringing back F2F interviews now, no more virtual !"
    },
    {
      "id": "nalfc6q",
      "body": "As someone who has been recruiting post Gen AI became famous, trust me, we know when a person cheats.\n\nSo again, is offline better? Yes\nBut, is \"I am not recruiting because there's no offline mode\" good? Nope \n\nBut i wish you luck, i hope things work in your favour"
    },
    {
      "id": "nalsko0",
      "body": "Now reading this makes me worry, should I join PES RR or choose msrit, both via KCET?"
    },
    {
      "id": "naluhdx",
      "body": "okay now i’m seriously scared about joining pes, am i making the wrong call by coming here through kcet? i don’t intend on doing masters and my primary concern is placements so will this college be okay for that?"
    },
    {
      "id": "nam7bpq",
      "body": "Any idea would hsbc do the same thing again?"
    },
    {
      "id": "namcm4r",
      "body": "Are you seriously okay paying 5 lakhs per year?"
    },
    {
      "id": "namk6ir",
      "body": "One of my friend came from baiyappanalli for that!!!"
    },
    {
      "id": "namki7q",
      "body": "The thing is college is very good with all the facility,   \nbut the main problem is the crowd and the competition.  \nSo for this you have to work your asss off mann.   \nConnect with seniors, network and improve your skills"
    },
    {
      "id": "namkl0g",
      "body": "yesss so muchhh"
    },
    {
      "id": "namq9ne",
      "body": "Would hsbc do the same as well?"
    }
  ]
}