{
  "id": "1n28s6k",
  "title": "[OffTopic] truggle to make freinds as a fresher",
  "content": "I have attended all the bootstrap sessions and talked to many people but have still not been able to make my group of freinds. Many others have already made their group and it is tough to approach them. Will this improve when classes start and we have fixed sections. Someone please advise me what to do.",
  "metadata": {
    "author": "Ok-Major-9257",
    "url": "https://www.reddit.com/r/PESU/comments/1n28s6k/offtopic_truggle_to_make_freinds_as_a_fresher/",
    "permalink": "/r/PESU/comments/1n28s6k/offtopic_truggle_to_make_freinds_as_a_fresher/",
    "score": 35,
    "created_utc": 1756377621,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "nb3y78a",
      "body": "Which bootstrap u doing now?"
    },
    {
      "id": "nb40evi",
      "body": "just give it a month of scheduled classes and you will find your own circle of friends :)"
    },
    {
      "id": "nb45z7h",
      "body": "Pick one topic and ask everyone about it the one who finds it relatable will start speaking to you and that's how conversation builds come to 5th floor canteen talk to seniors during break."
    },
    {
      "id": "nb4hygd",
      "body": "Same here...in my case , in my colour sub group majority of them are hostel people,  so they all have formed groups already , i feel alone ......I'm just waiting for classes to start , probably ill meet some more"
    },
    {
      "id": "nb4nere",
      "body": "Come to room no. 122 if u are in hostel or dm me ur room no. Me and my homie will come to u , either way its fine"
    },
    {
      "id": "nb4o0a5",
      "body": "I am coming bro"
    },
    {
      "id": "nb4pnfy",
      "body": "i couldnt attend the boot strap so can u tell me whats going and is there attendance"
    },
    {
      "id": "nb4s73k",
      "body": "Chill out bro, many of us lost contact with bootstrap friends the moment actjal classes started. Wait for them to start and then do socialize with people in your class."
    },
    {
      "id": "nb53w5h",
      "body": "In the words of many seniors, most of the people u make friends in bootstrap don't even stay ur friend after the program so dw u will definitely have another chance to make friends"
    },
    {
      "id": "nb55qqv",
      "body": "when is actual classes gonna start ?"
    },
    {
      "id": "nb580sg",
      "body": "WTF BRO SAME\nNgl this has been eating me up for a while now since I had a few very very gd frnds back in my hometown...if u r from rr campus just dm me bruh"
    },
    {
      "id": "nb5bpq6",
      "body": "In my experience, bootstrap friends last only for that one week and perhaps one week after that. You'll have so many other people to talk to when proper classes start.\nGive it a few more weeks then you'll see."
    },
    {
      "id": "nb5ju69",
      "body": "Which group bruh ,if you don't mind me asking."
    },
    {
      "id": "nb6bt6r",
      "body": "they won’t take attendance for bootstrap, and if they said they would, they’re just scaring you"
    },
    {
      "id": "nb6bv41",
      "body": "should start on monday"
    }
  ]
}