{
  "id": "1n2i4uj",
  "title": "[Question] ECE placements preparations",
  "content": "I’m in 5th sem ECE, and I’m more inclined towards preparing only for core ECE companies. I know that very few core companies come for placements, but I still want to focus on them. What I’m confused about is — what exactly do they ask in their pre-placement tests? Like how CS students grind DSA and Leetcode, what are the domains and topics we need to prepare for our OAs? Any guidance would be really helpful because I’m honestly feeling quite lost and scared about what to study and where to study from.",
  "metadata": {
    "author": "Fast-Consequence6360",
    "url": "https://www.reddit.com/r/PESU/comments/1n2i4uj/question_ece_placements_preparations/",
    "permalink": "/r/PESU/comments/1n2i4uj/question_ece_placements_preparations/",
    "score": 6,
    "created_utc": 1756401106,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "nb69ijf",
      "body": "revise all core concepts and subjects mainly, that's the main thing, there wont be / very less coding in ECE core role OAs but MCQs and all very commonly asked. Learn about op-amps, and other core concepts, CMOS, VLSI etc., There is little reason to get scared, because core companies will come, its not 0, but just less than CSE based companies thats all."
    },
    {
      "id": "nb9d87l",
      "body": "Plz it would be a great help 🙏\nIam taking admission in PESU in EEE branch.U guys may know about EEE Faculty,i heard that the faculties are not so good,is it true?\nAnd I want to focus on core EEE and parallely on CS i want to do both things on next level,is it possible?\nIf not then what can I do in this situation."
    },
    {
      "id": "nb9t2z4",
      "body": "I am not sure, sorry"
    },
    {
      "id": "nex37d8",
      "body": "EEE depends very less on department and more on how interested you truly are in electronics. I had done major in eee and minor in cs, kinda helped me out, but its really about how much you are doing extra apart from your course work in my opinion and how truly deep you can delve into electronics, cause that is very vast topic. If you wanna do both in parallel its hard because you wont gain expertise in either and it will be just surface level. You just need a good grip on programming and OS.\nThis is just my opinion, differs for everyone."
    }
  ]
}