{
  "id": "1n38adi",
  "title": "[Question] can anyone help",
  "content": "DSCE CSE cutoff stopped about 50-60 ranks before mine in Round 2 of KCET. I’ve already got PES EC AIML. Should I still participate in Round 3 hoping for DSCE CSE, or is it safer to stick with PES EC ?",
  "metadata": {
    "author": "New-Personality2524",
    "url": "https://www.reddit.com/r/PESU/comments/1n38adi/question_can_anyone_help/",
    "permalink": "/r/PESU/comments/1n38adi/question_can_anyone_help/",
    "score": 5,
    "created_utc": 1756476133,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "nbbkl14",
      "body": "why would you wanna go for dsce if you’ve already secured pes ecity though?"
    },
    {
      "id": "nbblolq",
      "body": "High competition"
    },
    {
      "id": "nbbsgp8",
      "body": "Just do one thing join ec campus study well n transfer urself to main (rr) campus n about placements there atleast 200-250 companies appearing ig approx"
    },
    {
      "id": "nbc0sf0",
      "body": "How can we switch campus?"
    },
    {
      "id": "nbc1ypo",
      "body": "Yaa it's totally based on ur score when u score more than 9.3 or more cgpa then u can switch at 2 nd year that too in any branch"
    },
    {
      "id": "nbc2fat",
      "body": "I am taking admission in EEE branch in pESU RR campus, should I score 9+minimum in overall 2 semester CGPA  to switch my branch."
    },
    {
      "id": "nbc2p8u",
      "body": "Idk Abt changing branch but u can change branch n campus from ec but yaa ig iu can change !! So don't u worry chill"
    },
    {
      "id": "nbc36b8",
      "body": "Thanks, but iam totally stressed that what should I do to get 9+CGPA, as i heard that it is very difficult in PESU RR campus."
    },
    {
      "id": "nbc4tjl",
      "body": "Bruhh lifes not over chill buddy if u really got ec campus then u r worthing to get just don't give up"
    },
    {
      "id": "nbc73va",
      "body": "Can I DM you sir ?"
    },
    {
      "id": "nbc7f9k",
      "body": "Yaa budd feel free"
    },
    {
      "id": "nbcaohj",
      "body": "just go with PES EC college.  \nYes RR compus has more demand and better infra.  \nbut technically you are in PES University no difference its RR or EC"
    }
  ]
}