{
  "id": "1n3tvsa",
  "title": "[Placements] share your craziest experience of cheating in placements",
  "content": "what are the different forms of cheating u hv seen among , students who do cheating ",
  "metadata": {
    "author": "No_Replacement_1434",
    "url": "https://www.reddit.com/r/PESU/comments/1n3tvsa/placements_share_your_craziest_experience_of/",
    "permalink": "/r/PESU/comments/1n3tvsa/placements_share_your_craziest_experience_of/",
    "score": 24,
    "created_utc": 1756532830,
    "flair": "Placements 🤑",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "nbg55m2",
      "body": "op reducing competition"
    },
    {
      "id": "nbg660y",
      "body": "I was sitting in the assesment center , one guy front of me (diagonal) was copy pasting from gpt with 2 tabs and some company related guy came(he did not even look at his computer). bro closed both the tabs(test and gpt) and he couldnt relogin and left the center.\n\n  \none more was i think sahaj ai , they had some sort of CTF kind off test, not the regular OA. Apparently the test link was accessable outside the assessment centre , so few ppl who logged out early , went out and still continued the test(crazy that they even remember the test link address).\n\nthey eventually got logged off."
    },
    {
      "id": "nbghtuy",
      "body": "Netcore came this year, and the first round was an MCQ assessment on some platform. We were all sitting in the 1A and 1B auditoriums, but thanks to the shitty Wi-Fi (or honestly, PES incompetence), the server got overloaded and the test wouldn’t even load. So Netcore had no choice but to switch to a Google Form with the aptitude MCQs.\n\nThe Netcore staff was walking around to invigilate, but people were being sneaky. I saw this one guy who straight up PRINTED the google form as a PDF, dumped it into GPT, got every single answer in one go, and filled out all 50 questions in like five minutes and walked out."
    },
    {
      "id": "nbgk08s",
      "body": "So did they get caught or the end or got away with it?"
    },
    {
      "id": "nbgkd1m",
      "body": "They did not qualify. Most of them ppl who qualified got all the flags in the ctf"
    },
    {
      "id": "nbh4tik",
      "body": "I’m a graduate. A quarter of the students who wrote the test for some mass recruiters wrote it for someone else. This was in full view of the placement office. They don’t raise the alarm because they will apparently lose their “reputation”."
    },
    {
      "id": "nbh73vu",
      "body": "Saw one dude copying the code and pasting it into an online compiler and executing to find the output"
    },
    {
      "id": "nbhzat3",
      "body": "oh hell nah, we're cooked"
    },
    {
      "id": "nbipjj1",
      "body": "That's crazy. Pes should better their wifi infrastructure. Did you guys complain about it?"
    },
    {
      "id": "nbk2x1p",
      "body": "Wasn't this during covid"
    },
    {
      "id": "nbz2zwd",
      "body": "I still remember, for the SDE 1 Meesho test, it was clearly mentioned that people should come to GJBC to write the test. Despite this, some people wrote it at their homes or hostel rooms and got shortlisted for the interview lol. They couldn't clear it as it was a bit tough, involving system design.\n\nFor blackbuck, the placement officer himself told the recruiters that almost everyone has copied in OA and that no one knows anything. So, those guys were tested on the approach that they used to solve the problem during OA."
    }
  ]
}