{
  "id": "1n44arr",
  "title": "[Question] - can parents see the timetable on the app?",
  "content": "my mother is asking for the timetable as it has been released today, but i cannot show her the real timetable as she will expect me to come home as soon as college is done. so i am thinking of faking some of the classes and making it look like everyday is a full day. but in order to do this i need to know if she can see the actual timetable through the parents login in the app. PLEASE HELP ASAP",
  "metadata": {
    "author": "Dazzling_Chemist_109",
    "url": "https://www.reddit.com/r/PESU/comments/1n44arr/question_can_parents_see_the_timetable_on_the_app/",
    "permalink": "/r/PESU/comments/1n44arr/question_can_parents_see_the_timetable_on_the_app/",
    "score": 10,
    "created_utc": 1756567263,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "nbi6oqv",
      "body": "whats the point of lying about this? Just say u wanna stay back in campus for a while"
    },
    {
      "id": "nbi72em",
      "body": "you clearly do not have experience with strict parents so im not going to answer your question"
    },
    {
      "id": "nbi8877",
      "body": "You could tell you have club activities or something, no?"
    },
    {
      "id": "nbi8drl",
      "body": "there is nothing to help here tbh. just tell u have some work or something and move on. Done."
    },
    {
      "id": "nbi8jlb",
      "body": "oh yeah this makes sense tysm 😭😭<3"
    },
    {
      "id": "nbi8ksm",
      "body": "Probably yes , but you can edit the timetable pdf you send and try to gaslight them or say you have club activities"
    },
    {
      "id": "nbi91xu",
      "body": "BAHAHA thats what i had in my mind tbh until i remembered pes wants to involve parents in everything : |"
    },
    {
      "id": "nbi9b3g",
      "body": "Who wants to stay in clg da"
    },
    {
      "id": "nbibpgs",
      "body": "ye but lying is a time bomb waiting to explode. God forbid they find out, they sure as shit wont think you stayed back to attend club meetings."
    },
    {
      "id": "nbicg9c",
      "body": "Honestly, just tell them you are trying to work with some profs and you have meetings with them after classes (that is anyway when these tend to happen). *Back in my time*, there wasn't any \"parents app\", but if the same timetable renders on both apps, there isn't anything you can do. Just be smart about it and come up with a solid excuse."
    },
    {
      "id": "nbid4ie",
      "body": "I think its mainly about OP not wanting to go home rather than staying inside college lol"
    },
    {
      "id": "nbj002q",
      "body": "I have strict parents but after a certain point u shud have made it clear to them that u want to do stuff and not tell them everything u do. My parents have eased up on me since I turned 18 cuz they know they can't keep controlling everything I do. U can try and persuade them , prolly take help frm ur older siblings who can relate"
    },
    {
      "id": "nbj2wfd",
      "body": "Aah lol, makes sense "
    },
    {
      "id": "nbj7usv",
      "body": "Not really, just empty threats dw."
    },
    {
      "id": "nbj8y7h",
      "body": "Actually they don't. My parents know nothing of what happens in college"
    },
    {
      "id": "nbk3s58",
      "body": "Chill , my parents don't know isa's exist and I'm in third year , i only tell them my final sem marks lmao"
    },
    {
      "id": "nblb5fr",
      "body": "Parent here. I can see the timetable.\n\nWhy fake ? You can explain to your mother what you want to do on the days with half day. \n\nHonesty is the best policy. If you break her trust now, she will definitely micro manage you over the years."
    },
    {
      "id": "nblu6um",
      "body": "makes sense, thankyou for your comment. it is hard to communicate with my parents and sometimes its easier to resort to other methods 😔"
    },
    {
      "id": "nbm4qdx",
      "body": "It's important for one to be authentic even if it makes others uncomfortable. You are an adult and so are they. You can respectfully talk to them and assure them you aren't doing anything that will harm you. Make sure your grades are good. Sooner or later they will trust you more and they will give you the freedom you need."
    }
  ]
}