{
  "id": "1n46z5n",
  "title": "[Placements] Understanding the 47% Placement Rate",
  "content": "The placement rate is reported to be 47%. I am concerned about this statistic and would like to understand it better. Does this mean that approximately half of the students do not secure a job placement? I am willing putting a lot of effort into my studies and ofcourse skills and want to ensure I have a good chance of being placed after graduation. Could you please provide a clear explanation of what this placement percentage entails, using full words instead of abbreviations?\n",
  "metadata": {
    "author": "Consistent-Formal483",
    "url": "https://www.reddit.com/r/PESU/comments/1n46z5n/placements_understanding_the_47_placement_rate/",
    "permalink": "/r/PESU/comments/1n46z5n/placements_understanding_the_47_placement_rate/",
    "score": 17,
    "created_utc": 1756573857,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "nbisnc0",
      "body": "https://preview.redd.it/g344ak1cw6mf1.png?width=511&format=png&auto=webp&s=8e0fe70c899ec1e676f3cc773e3430ed7fa1e1d1\n\nSource \\^"
    },
    {
      "id": "nbithpz",
      "body": "The number increased to 1041 but still a bit scary tho"
    },
    {
      "id": "nbiuyov",
      "body": "https://www.reddit.com/r/PESU/s/6HgVCFfDgx"
    },
    {
      "id": "nbiv1rf",
      "body": "I think this does not include internships converted to ppos?"
    },
    {
      "id": "nbivj6o",
      "body": "Too complicated bro, I wanted to have a comprehensive and simple discussion here to be a easier representative to the Juniors"
    },
    {
      "id": "nbiwn9i",
      "body": "Basically the figures you posted / given by pes don't include ppos"
    },
    {
      "id": "nbiwt87",
      "body": "Right so does this significantly improve the statistic tho?"
    },
    {
      "id": "nbix0fm",
      "body": "Yes incl the ppos stats are better"
    },
    {
      "id": "nbix25r",
      "body": "Yep it doesn't"
    },
    {
      "id": "nbix5xt",
      "body": "Like atleast 65% placed for cse"
    },
    {
      "id": "nbixtyc",
      "body": "Isn't that a point of concern aswell? Cus there is no shot that 35% of the individuals went towards masters."
    },
    {
      "id": "nbiy3r1",
      "body": "Some of them didn't get placed and hence they were put in that category some genuinely went for masters and some got placed off campus this 35% includes all"
    },
    {
      "id": "nbiyn8b",
      "body": "The latter half?, are those universities also at the same statistic (Thank you for the clear, summarized explanation; it's extremely helpful.)"
    },
    {
      "id": "nbiywta",
      "body": "Imo you should really check the company wise sheet and count the total offers of T1 T2 T3 SUMMER INTERNSHIPS AND SPRING INTERNSHIPS you will get a good idea"
    },
    {
      "id": "nbizg1m",
      "body": "Do nothing just count total no of offers"
    },
    {
      "id": "nbj5jw5",
      "body": "I understand that it really does make it 65% after factoring it, but I had two major doubts\n\n1. If the students who were planning to do their master’s didn’t end up going, would the percentage have gone up to around 85%? I know it’s tough to predict and involves a lot of guesswork, but I just want to get a feel of the environment and how much the university can actually help with job placements.\n\n\n2. I’ve got other options like BMSCE, MSRIT, and DSCE. Do you think choosing PES with all the extra effort it takes for VTU would actually pay off in the long run? Is the effort worth it? As apparently they have a better placement percentage"
    },
    {
      "id": "nbj8w3z",
      "body": "1.Lemme tell so the number given by pes in the name of students going for higher studies contains many who couldn't get placed this is done not only by pes but many other colleges be it govt or private if they are unable to place students they will put some in the name of higher studies \n\nIf we really get into master I would say some people would have gone for masters but Idts it would make up 85% but people get placed off campus + some go for govt exam / masters incl this it can be high but no one would be able to tell how much %age\n\n2.according to almost all people on reddit pes is better than all the colleges you listed in point two if it was rvce cse/ece then only it was considerable , and the colleges you listed don't have better percentage placed or wouldn't have in future cuz dsce and bms have increased there intake like crazy only msrit can have better percentage placed cuz it have way less intake then pes\n\nThe rest part abt vtu and grind in pes I can't answer cuz it depends"
    },
    {
      "id": "nbjayho",
      "body": "The placement % numbers will never be accurate simply because there's no way to accurately determine it. PES only has the data they have access to. PPOs offered to students at the end of their summer/spring internship are usually between the company and the student, so PES doesn't have any information here. Additionally, many students apply off campus and get into different companies (sometimes abroad as well), and these aren't on PES' record either. \n\nThe *only* record PES has is the number of students directly placed through their placement cycle, which is absolutely not representative by any means."
    },
    {
      "id": "nbjb175",
      "body": "THERE WILL NEVER BE 100% PLACEMENT PERCENTAGE BRO ARE YOU CRAZY PLACMENTS DEPENDS ON STUDENT AND NOT ON COLLEGE. COLLEGE CAN ONLY BRING OPPORTUNITIES NOT EVEN IITB HAS 100% PLACEMENT."
    },
    {
      "id": "nbjb92p",
      "body": "This made it a whole lot clear, mind answering the last follow up 3 questions to this aswell please?"
    },
    {
      "id": "nbjbsll",
      "body": "IITB goes hard 😭🙏"
    },
    {
      "id": "nbjchw4",
      "body": "Btw even that has 83% placed for btech programs"
    },
    {
      "id": "nbjcs2o",
      "body": "And they only include fte since they also don't have any data Abt ppo conversion?"
    },
    {
      "id": "nbjdy6h",
      "body": "That's what I just said."
    },
    {
      "id": "nbjkuia",
      "body": "Yeah close to 400 unplaced out of 1843"
    },
    {
      "id": "nbttorr",
      "body": "Source?"
    },
    {
      "id": "nbtucq3",
      "body": "Orientation"
    },
    {
      "id": "nbtwhcw",
      "body": "Do you have photo ??"
    },
    {
      "id": "nbtwkut",
      "body": "I dont, I just remember the number"
    }
  ]
}