{
  "id": "1n4zex3",
  "title": "[Admission] Help me choose between Pes ec campus cse and mit manipal cse",
  "content": "ive been alloted pes ec campus (cse) in kcet round 2.  \nive also joined mit manipal cse, i can withdraw from the course if i wish to join pes ec..\n\nso far i dont really like the teaching at manipal.. and since im a day scholar im not able to attend their student projects which take place at night.. also manipal is insanely expensive.\n\nhere are some of my questions about pes ec campus:\n\n1. hows are the teachers? (ik youre not supposed to judge a college based on teaching, but i still wanna know ;-; )\n2. do ec campus students face any discrimination during placement time compared to rr campus?\n3. does the ec campus have good student projects?\n4. how are the placements going at pes in the past few years? (could someone send their placement stat? )\n5. do you think i should switch from manipal to pes ecc? (please give reason)",
  "metadata": {
    "author": "MuggerXD",
    "url": "https://www.reddit.com/r/PESU/comments/1n4zex3/admission_help_me_choose_between_pes_ec_campus/",
    "permalink": "/r/PESU/comments/1n4zex3/admission_help_me_choose_between_pes_ec_campus/",
    "score": 2,
    "created_utc": 1756658359,
    "flair": "Admissions",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "nbp12tb",
      "body": "im a fresher and gonna join through cet (not been in college yet) so can only  answer :\n\n2) No i dont think so, but in the recent placement sheet i saw one company that was RR campus exclusive in internships  (Im just saying what i saw)  \n4) The placement will be good if you are atleast in the top 50%, cuz the packages are pretty good but the placement percentage is like 63% for CS (Will be more considering the converted internships but yeah)"
    },
    {
      "id": "nbrk0i0",
      "body": "Muggerrrrrrrrr"
    },
    {
      "id": "nbrprqk",
      "body": "1. Teaching anywhere is luck, 70% teachers are ass\n2. Companies don't know what campus ur from"
    },
    {
      "id": "nbrq4ze",
      "body": "3. There's nothing called student proj, it's mini projects in subjects so u pick what proj you'll do\n4. Placement is good if you're in the top 40% of CSE (rr + ecc) so get 8.75+ cgpa for tier1 companies \n5. Id take manipal over pes ecc anyday cus i would have preferred the campus life, if student projects are in night, stay till night, you're a day scholar anyway, no curfew for you. Manipal might not have better placement but it does have good campus life and almost as good placements + you going to main campus so"
    }
  ]
}