{
  "id": "1n5i51t",
  "title": "[Question]Doubt regarding documents required",
  "content": "I have got pes rr cse through kea r2.\nI was checking the required docs page on the pes website.\nThey've asked for admission order..\nBut from this year, we can't download admission order by ourselves , and it shd be given by college, acc to kea director.\n\nAnd what is the tuition fee receipt? \nI didn't get any option to downlod tuition fee receipt.\n\nAlso, please guide me on what exactly I'm supposed to do when I reach the college with these documents.",
  "metadata": {
    "author": "Shot-Ad-4036",
    "url": "https://i.redd.it/3wpnazw18imf1.png",
    "permalink": "/r/PESU/comments/1n5i51t/questiondoubt_regarding_documents_required/",
    "score": 6,
    "created_utc": 1756711111,
    "flair": "Admissions",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "nbssw6z",
      "body": "Bro ' 2 sets of self -attested photocopies' means?"
    },
    {
      "id": "nbst264",
      "body": "Bro is parents pan card enough or student pan card is also necessary?"
    },
    {
      "id": "nbst5o7",
      "body": "Also yeah admission order is given by college this year maybe pes didn't update their documents list"
    },
    {
      "id": "nbstoaq",
      "body": "You have to sign on those photo copies"
    },
    {
      "id": "nbstr0h",
      "body": "Many say that parents' is sufficient..\nBut I didnt want to take risk..\nSo i applied for epan yesterday..\nGo it within 5 hrs."
    },
    {
      "id": "nbstt0f",
      "body": "Exactly..\nSo should we take the printout of confirmation slip in its stead?"
    },
    {
      "id": "nbsty8e",
      "body": "Also, if we have paid offline, should I take 2 photo copies of  the college copy in the challan and submit?"
    },
    {
      "id": "nbswp8c",
      "body": "Hey guys\n\nI finished the process today.. they’ll take ur 10th and 12th marks cards and tc original. You also need to give one copy of all 3. You need to give 3 passport size and 3 stamp size photos. You need Aadhar original and Aadhar copy. Also one printout of confirmation slip. That’s all. They’ll give admission order there in college."
    },
    {
      "id": "nbswqb1",
      "body": "If you paid online, no need any receipt or proof"
    },
    {
      "id": "nbswt5t",
      "body": "Thank you soo much brother!!"
    },
    {
      "id": "nbswywb",
      "body": "Npp"
    },
    {
      "id": "nbsxddz",
      "body": "black and white copies with your signature on those"
    },
    {
      "id": "nbt7q7z",
      "body": "Do you need to sign the photocopies?"
    },
    {
      "id": "nbt84sb",
      "body": "Yes but they’ll tell u at the admission desk"
    },
    {
      "id": "nbtf67a",
      "body": "Does that mean PAN card copy and Tuition fee receipt aren't required?\n\nAnd what about online application form?"
    },
    {
      "id": "nbthvgi",
      "body": "They didn’t ask me for any of those.."
    },
    {
      "id": "nbtti6u",
      "body": "Extra fees they asked you? Like 13 k something and hostel fees and all ?"
    },
    {
      "id": "nbtzhqj",
      "body": "Yes"
    },
    {
      "id": "nbtzlvh",
      "body": "Ohh, if they ask me my pan i will also do the same thing, thanks"
    },
    {
      "id": "nbu3sof",
      "body": "You're welcome bro!"
    },
    {
      "id": "nbu3yw0",
      "body": "Aight!"
    },
    {
      "id": "nbvq22j",
      "body": "Thanks"
    },
    {
      "id": "ndldd32",
      "body": "Hey what about 11th and 12th study certificate signed by DDPI for state syllabus student?"
    }
  ]
}