{
  "id": "1n6aww5",
  "title": "[Question]Should I apply for MRD and CNR scholarships by paying 10000 extra....? ....?",
  "content": ".....?",
  "metadata": {
    "author": "Niranjan2278",
    "url": "https://www.reddit.com/r/PESU/comments/1n6aww5/questionshould_i_apply_for_mrd_and_cnr/",
    "permalink": "/r/PESU/comments/1n6aww5/questionshould_i_apply_for_mrd_and_cnr/",
    "score": 12,
    "created_utc": 1756789910,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "nbyuqjf",
      "body": "Unless you are confident that you'll never get the scholarship. No risk, no reward."
    },
    {
      "id": "nbz0k2x",
      "body": "Check first year if you can score 9+ then apply from second year(you can apply from 2nd year )"
    },
    {
      "id": "nbzbeva",
      "body": "This is incorrect, I wasnt allowed to apply after 1st year.\nEither u sign up from the very beginning or u never sign up"
    },
    {
      "id": "nbzbhwy",
      "body": "No"
    },
    {
      "id": "nbzbz80",
      "body": "It isn't that hard to get cnr(above 8.5)\nObv this depends on how ur batch performs.\n\nMrd little harder to get\n1st year mugga slides , do cw for math. Give urself at least 2 weeks before isa/esa, comfortably u can cover syllabus and revise."
    },
    {
      "id": "nbzc0wy",
      "body": "What 😭, i was told I couldn't apply"
    },
    {
      "id": "nbzc5q5",
      "body": "Who told you that my friend accidentally paid 1000 extra in 2nd year he was told that he is eligible for scholarship"
    },
    {
      "id": "nbzcl5p",
      "body": "Ok thank you"
    },
    {
      "id": "nbzftqg",
      "body": "My class teacher from 2nd sem\nAlso wtf"
    },
    {
      "id": "nbzg22a",
      "body": "Lol if you really wanna know ask the accounts department in gjb.You will get the right answer don't believe me or your class teacher."
    },
    {
      "id": "nbzg9mq",
      "body": "And also i always thought it's a nice trick to leech off maximum people in the first year by saying that they can't apply for scholarship from next year"
    },
    {
      "id": "nbzhwlo",
      "body": "Bruh 😭"
    },
    {
      "id": "nbzl4ly",
      "body": "If I applied for it for first year then can I cancel it for second year..?"
    },
    {
      "id": "nbzncrs",
      "body": "Yes \nThere's no 'cancelling' for scholarship. For next year's fee just don't pay the 10k and you're automatically removed from eligibility. The year after that again u choose whether u want to pay the fee or not.\n\nRemember tho, scholarship is only for the first 3 years, in the last year u don't get it."
    },
    {
      "id": "nbzo0l0",
      "body": "Short answer - yes\n\nLong answer -\nSay you pay 10k for scholarship eligibility \nThen qualify in both sems\nU now get 50k back (including both sems) (For CNR)\nThat's 40k profit\n\nSay u don't qualify for it both sems, but have 7.75+ sgpa\nU get 4k as DAC scholarship (including both sems)\nThat's a 6k loss\n\nNow weigh it out, 6k loss vs 40k profit. You decide."
    },
    {
      "id": "nbzrl9q",
      "body": "Yes, if you have even the slightest confidence that you can perform better than 25% of the class consisting of meritorious students from various modes of admission, No if you Lack self confidence "
    },
    {
      "id": "nbzs7oa",
      "body": "well this is news for me, i got a pdf with annual fee details and it clearly told me to either continue paying or never be eligible from the beginning"
    },
    {
      "id": "nc09l3j",
      "body": "Lol no"
    },
    {
      "id": "nc0cxmn",
      "body": "Hey, do I need to fill out any forms or pay extra for the MRD scholarship? I got in through JEE Mains.\n\nAlso, I already have a bank account. Will that work, or do I need one at Union Bank? And how can I get PESU to help me open an account there?"
    },
    {
      "id": "nc0k2yh",
      "body": "i am a fresher, when are we supposed to apply for this?????"
    },
    {
      "id": "nc0kes0",
      "body": "also wtf i dint know we were supposed to pay for the scholarships"
    },
    {
      "id": "nc0luvc",
      "body": "I have the exact same question"
    },
    {
      "id": "nc10nsj",
      "body": "A few of my friends have done this, since the 10k is an optional fee.\n\nThen again everybody has a different story to tell, so might as well go ask in the office for accurate info."
    },
    {
      "id": "nc1130q",
      "body": "Bro how does everyone have a different story 😭. I just told what my friends did."
    },
    {
      "id": "nc1d38o",
      "body": "Just pesu things 🥀"
    },
    {
      "id": "nc1l1po",
      "body": "There is no application, even after first sem results you can pay the scholarship fund amount and get the scholarship; It's around 10k per year"
    },
    {
      "id": "nc1l6zf",
      "body": "The scholarship is offered by the campus not any other org so you have to pay 10k to get eligible for it"
    },
    {
      "id": "nc1lq55",
      "body": "You don't have to fill any form, you just have to pay the scholarship fund fee to be eligible;\nYou must have a union Bank account to get scholarship; A representative from union Bank(pesit branch) is available in some days near the admission office in mrd block or you can go to any union Bank of your choice and open an account there"
    },
    {
      "id": "nc1m1cc",
      "body": "Actually you can't apply for it, according to the accounts section; You can only opt for it during your first year and you have to pay till 4th year without missing"
    },
    {
      "id": "nc1pqy1",
      "body": "thanks man"
    },
    {
      "id": "nc46xta",
      "body": "https://preview.redd.it/wi682d8apumf1.jpeg?width=1240&format=pjpg&auto=webp&s=ce0156c76fee17bd2c6af846e2670153bafff7ce\n\nthis was mentioned in our first year's fee circular..."
    },
    {
      "id": "nc5xaom",
      "body": "I think 10k is for kcet people only"
    },
    {
      "id": "nc5yla3",
      "body": "Wait so only the kcet students have to pay extra to get that scholarship or pesu jee students also cause I thought for pesu jee students it was already included"
    },
    {
      "id": "nc6cw6e",
      "body": "Yes, for other people it's already included in their fees so they don't have to pay"
    },
    {
      "id": "ncjdwnd",
      "body": "What kind of scam university asks to pay for scholarships?"
    }
  ]
}