{
  "id": "1n6el4a",
  "title": "[Question] is there a shuttle bus service provided by EC campus to metro station",
  "content": "I saw there is a bus service for RR campus students for their nearest metro station, so I thought whether its available in ec campus ",
  "metadata": {
    "author": "No_Replacement_1434",
    "url": "https://www.reddit.com/r/PESU/comments/1n6el4a/question_is_there_a_shuttle_bus_service_provided/",
    "permalink": "/r/PESU/comments/1n6el4a/question_is_there_a_shuttle_bus_service_provided/",
    "score": 5,
    "created_utc": 1756804105,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "nbzh7b9",
      "body": "No, not yet"
    },
    {
      "id": "nbzpad6",
      "body": "r they willing to create one, ik yellow line opened recently, wt is the management saying about it,"
    },
    {
      "id": "nbzpcpd",
      "body": "my home is already too far, the walking upto college will eat up so much time of mine"
    },
    {
      "id": "nbzyy06",
      "body": "The metro station is right outside the campus tho, would honestly take longer in bus than by walk"
    },
    {
      "id": "nc028qb",
      "body": "They may but it's not even logical.\nIf they were to pick up, they would pick up near the gate, which itself is a 8 mins walk from BE block.\nThen from the gate, the metro is a 7 mins walk. You can't take a U-turn in the service road with so much traffic, unless they use some small bus or that golf kart they have lol.\nYou can say I'm frustrated just as much , but it's better to just accept a 15 mins walk daily to and fro, gives mental peace."
    },
    {
      "id": "nc0wh42",
      "body": "doreswamy sir grilled us about this during orientation saying stuff like how we can't walk this much distance and stuff\n\n\nso i don't think they will add a shuttle for ec campus"
    },
    {
      "id": "nc4j6qc",
      "body": "can agree tht"
    },
    {
      "id": "nc4j80o",
      "body": "oh hell nah"
    },
    {
      "id": "nc4jdnb",
      "body": "its not right outside bruh, nearly 1 km walk upto engineering block"
    },
    {
      "id": "nc4jmq9",
      "body": "nigga would come by car once in a year, says we can't walk daily"
    },
    {
      "id": "nc5f5b0",
      "body": "I doubt? Took the metro for the first and last time during my grad on Sunday and the metro bridge is just a short walk from the gate. Besides this, the driver would have to drive until Hosa Road to take a U-Turn and reach campus after dropping y'all. Back in 2021, Jawahar told us in our orientation that we would need to walk everywhere within campus and I doubt bro has changed his views four years later lmao. The golf kart dude has explicity been told not to transport students anywhere, I twisted my ankle once in my third year and I had to have an almost 10 minute talk with him that \"just because you can't see my injury doesn't mean it doesn't exist\" lmao. Maybe if a lot if you request, they might oblige but if they haven't provided a bus to the Konappana Agrahara bus stand, I don't see them providing a shuttle service to the metro, which is a shame because those roads are dangerous and the NICE Road exit is also there.\n\nRR Campus is a whole different story. Both Mysore Road and Pantarapalya Nayanadahalli metro stations are 2km away and its a common bus route."
    },
    {
      "id": "nc5hub9",
      "body": "yea dude, its really hard sometimes to cross tht nice road ext"
    },
    {
      "id": "nc5wit5",
      "body": "The answer to this is: No (Until a serious issue happens)\n\nSource: EC Campus 2025 Inauguration \n\nClaim: Jawahar walks 15k steps a day so students our age must \n\nRelief: They are trying to make the walkway more fun as per what they claimed."
    },
    {
      "id": "nc5xbru",
      "body": "thank u, walkway I think is good start to solve the issue"
    },
    {
      "id": "nc5xjrt",
      "body": "tht does not solve the issue tho,"
    },
    {
      "id": "nc5xlfz",
      "body": "well walking 1km it is, cannot do anything"
    },
    {
      "id": "nc5ytn1",
      "body": "walking 500m not 1km, bro the metro is arguably opposite to the college only, the biggest distance is walking inside the campus it's just too big 😭\n\nMaking the walk fun will help bro btw, its all in the mind"
    },
    {
      "id": "nc7bf1a",
      "body": "grow up"
    },
    {
      "id": "nc7blqm",
      "body": "what ecc rlly needs is to use those goddamn golf carts to drop us outside campus"
    }
  ]
}