{
  "id": "1n6mxfc",
  "title": "[Discussion] JEE & KCET Cutoff for batch 2025-2029",
  "content": "I have a cousin who would be writing JEE and CET the next year. So if anyone knows the cutoff for JEE & CET who got into PES for 2025, pls comment down.  \nProviding KCET cutoff would also be of help.",
  "metadata": {
    "author": "Historical_Battle286",
    "url": "https://www.reddit.com/r/PESU/comments/1n6mxfc/discussion_jee_kcet_cutoff_for_batch_20252029/",
    "permalink": "/r/PESU/comments/1n6mxfc/discussion_jee_kcet_cutoff_for_batch_20252029/",
    "score": 0,
    "created_utc": 1756827660,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "nc4rth6",
      "body": "Get above 95 percentile and uk rank ull be gucci"
    },
    {
      "id": "nc5pt4a",
      "body": "Through JEE: Anything above 92% is usually sufficient to secure a CS (AIML) seat in the Ecity campus. The better your percentile, the higher your chances of getting into the top branches.\n\nThrough KCET: The cutoff for ECE at Ecity was around 6.1k (GM category). So, a rank better than that improves your chances of getting CSE, ECE, and other top branches in both campuses.\n\n(I had a 3k rank in KCET which was enough to join ECE in the RR campus but since I live much closer to the Ecity campus and preferred CSE, I took admission in the latter)"
    },
    {
      "id": "nc79gc2",
      "body": "RR cse==93-94 percentil\n\nRR aiml ==90+percentile\n\nRR ECE ==88percentile\n\nECC cse==85.8 percentile\n\nECC AIML==84-83 percentile \n\nECC ECE==80-82 percentile\n\n  \nthis was the first time PES admited using jee mains in such high volumes definitely cutoff will increase next year by a lot"
    },
    {
      "id": "nc7fqhx",
      "body": "Thanks buddy"
    },
    {
      "id": "nc7fxoq",
      "body": "Woah ... Full elaborated .... psych man... thank you"
    },
    {
      "id": "ncb0icd",
      "body": "Pretty accurate lol."
    },
    {
      "id": "ncdo5uw",
      "body": "bro i was branch closer for ECC cse full data ik 😂"
    },
    {
      "id": "ncj33bh",
      "body": "what do you think, how much will the cutoffs increase next year specifically for RR aiml ?"
    },
    {
      "id": "ncj8rns",
      "body": "it might get above 93 ig not sure"
    },
    {
      "id": "ncj9e6x",
      "body": "I see thanks a lot man"
    },
    {
      "id": "nd1uyfr",
      "body": "How cutoff can we expect for pes ec cse next yr?"
    },
    {
      "id": "nd2uiu4",
      "body": "see, now PES has got some recognition as it is accepting JEE mains and now in Electronic city metro is also available(right in front of campus) so it is convenient to be on the safer side i would say 92 percentile+ for sure next year cutoff wont go as down as low as 85percentile for ECC cse"
    }
  ]
}