{
  "id": "1n729pz",
  "title": "[Admission]Which college would you choose",
  "content": "I need to make a decision quick between two colleges PESU RR cse-aiml in bangalore or SSN chennai cse core. i am from bangalore and some may say pesu is the obvious choice, even the fees is much lesser in pes(6-7 lakh for 4 years where as 25l in chennai). But also the intake in pes is currently around 2200 for both campuses but here it is only 180 students. So want to know what you guys will choose placement opportunities is only slightly better in pes",
  "metadata": {
    "author": "Least-Treacle-3746",
    "url": "https://www.reddit.com/r/PESU/comments/1n729pz/admissionwhich_college_would_you_choose/",
    "permalink": "/r/PESU/comments/1n729pz/admissionwhich_college_would_you_choose/",
    "score": 7,
    "created_utc": 1756864401,
    "flair": "Admissions",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "nc4jy34",
      "body": "I think placements r fine, if u work lil hard in pes, if u r among top 10% of students in pes u wil get a 12lpa+ job, and being in top 10 % aint very hard"
    },
    {
      "id": "nc4owe0",
      "body": "\"aint very hard\" 🥀"
    },
    {
      "id": "nc4pqg7",
      "body": "Bro can you please tell how hard it actually is to"
    },
    {
      "id": "nc4qi00",
      "body": "Top 10?? You'd do fine if u stay in top 30-35 percent lmao"
    },
    {
      "id": "nc4r49f",
      "body": "yea, it won't as hard as jee"
    },
    {
      "id": "nc4rd7h",
      "body": "what college are you in vro"
    },
    {
      "id": "nc4re2v",
      "body": "to be in top 10 % is not a big deal, its an achievable goal , even if u hv joined by some management quota"
    },
    {
      "id": "nc4rhxv",
      "body": "im joining PES CS this year"
    },
    {
      "id": "nc4rml9",
      "body": "good luck"
    },
    {
      "id": "nc4ro37",
      "body": "> Being in top 10% ain't very hard in pes\n\nLmao"
    },
    {
      "id": "nc4rvk3",
      "body": "of course it wil be hard if u do 4 cgpa activities all 3.5 years and start sweating real hard in 8th set for placements"
    },
    {
      "id": "nc4sp66",
      "body": "![gif](giphy|tMuTXPEnsnM2dOHFMH)"
    },
    {
      "id": "nc4tis6",
      "body": "yea sure mate, its sad u r in 4th year, nd don't know abt place ments and shit , pretty sure u r not from CS department, or prob as I said 4 cgpa in CS"
    },
    {
      "id": "nc4tzvx",
      "body": "![gif](giphy|khGuFhshLWQIdXijHa|downsized)"
    },
    {
      "id": "nc53rfv",
      "body": "Lmao you're joining no? Let's see."
    },
    {
      "id": "nc5hhwg",
      "body": "See what?"
    },
    {
      "id": "nc5vt9e",
      "body": "SSN is really good bro.i would say same level as pes"
    },
    {
      "id": "nc61q04",
      "body": "lmaooo, thats like saying being in the top 1%ile of jee is not a big deal."
    },
    {
      "id": "nc66i5r",
      "body": "bruh r u sane ? thts gotta be rage bait"
    },
    {
      "id": "nc66wg3",
      "body": "I got 97% I worked my ass off for it straight 2 years, moreover there r 13 lakh ppl in jee mains and only 2k ppl in pes, so if u can't be in top 200, tht too from a non jee based college, this conversation is totally useless or mb a RB"
    },
    {
      "id": "nc68ekx",
      "body": "lmaooo, i’m sure a 4th year knows more abt pes than someone who hasn’t even joined yet"
    },
    {
      "id": "nc6deb4",
      "body": ">Non jee based college\n\n13 lakh people don't have strict eligibility criteria to apply for jee while the 2k people you mentioned most of them wrote kcet or pessat and scored a rank < 10,000 to get into pes who competed against 3 lakh people. Yeah jee is tougher than kcet agree but saying you can top the people who went through all this is totally senseless.I have also seen students who were eligible for iit/nit just chose pes because they didn't wanted to leave their hometown for iit/nit"
    },
    {
      "id": "nc6gqii",
      "body": "you dumbfuck half of those 2k ppl in pes have also grinded their ass off for 2 years. do you still not understand the competition? you just wasted your 2 years if you still underestimate the competition lmao  \nyou are very ignorant and egoistical for someone who could only manage to get 97%ile, stop disrespecting others and focus on yourself. you are not going very far by talking down a senior"
    },
    {
      "id": "nc6h0l2",
      "body": "dont waste your precious time on him bro, if he hasnt realized any of this he isnt exactly very bright to begin with."
    },
    {
      "id": "nc6mnad",
      "body": "Lmao as a 97 percentiler my self, im laughing so hard ngl"
    },
    {
      "id": "nc79ieh",
      "body": "oh look who got hurt, sorry lil bro \n\n![gif](giphy|RWUqVYucDBD4A)"
    },
    {
      "id": "nc7agww",
      "body": "so many down votes, looks like peeps who did this got hurt \n\n![gif](giphy|GpyS1lJXJYupG)"
    },
    {
      "id": "nc7mega",
      "body": "?  \ni wont brag about my college/jee mains and adv rank but know one thing im leagues above you"
    }
  ]
}