{
  "id": "1n7brd6",
  "title": "[Question]Mechanics Statics textbook",
  "content": "Any senior here willing to give their engineering mechanics statics book please....teacher is SV venkatesh sir , he is telling get it by monday....in campus mart its 850 something  , cant get it from library coz i dont have any id card   , he is telling dont get xerox and stuffs ....I'll go and check in avenue road to see if i can get it cheaper but before that if any senior willing to give it please ",
  "metadata": {
    "author": "yashasss29",
    "url": "https://www.reddit.com/r/PESU/comments/1n7brd6/questionmechanics_statics_textbook/",
    "permalink": "/r/PESU/comments/1n7brd6/questionmechanics_statics_textbook/",
    "score": 0,
    "created_utc": 1756897417,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "nc6e2ik",
      "body": "Don't buy not needed"
    },
    {
      "id": "nc6ea2m",
      "body": "Svv sir will ask us to get out of the class then"
    },
    {
      "id": "nc6ixum",
      "body": "Grab one polite looking senior and take his id. Thats what I did until I got my id"
    },
    {
      "id": "nc74blj",
      "body": "If you know someone having id card, just ask them for help; If you don't know anyone, just ask any senior, they will definitely help you out"
    },
    {
      "id": "nc79zmz",
      "body": "They gave some pdf with questions and solutions for us, all the 100% of esa questions came from that itself."
    },
    {
      "id": "nc7k8ct",
      "body": "I had him too. Till I got my ID card, I took a print out of the required pages of 1st unit. He will make a fuss about why you took a print out despite him telling not to. Just explain him that you will get a book once you get your ID card. \n\nIf you dont want to take print out, take a seniors ID card and borrow it using his/her name. Keep renewing it every 10-13 days. Else penalty will go to the ID card holders name. \n\nPES will soon give your ID cards and once they do that, you can go to the lending library and borrow it yourself."
    },
    {
      "id": "nc7lw8n",
      "body": "That’s not the point here, SVV requires you to get the physical copy of the mechanics textbook to class everyday"
    },
    {
      "id": "nc7s3ir",
      "body": "https://preview.redd.it/1r2ap03u5zmf1.png?width=252&format=png&auto=webp&s=a804e150e606b01315685803e2729bf9d2b33555"
    },
    {
      "id": "nc7wwbp",
      "body": "Ok broo,  thank you"
    },
    {
      "id": "ncbobfn",
      "body": "DM me I have one"
    },
    {
      "id": "nccrjeo",
      "body": "To all people who have SVV. I had him too.\nDon't be scared of him just go to him and tell him you'll get a book from library when you get your ID card. He may be scary but if you talk to him he'll allow you to wait for card.\n\nAlso, if you are brave enough. Go to 6th floor to his staff room when he is there and ask him if he has any spare textbooks. He usually has 3-4 spares which he gives to students."
    },
    {
      "id": "nd130jb",
      "body": "Take it from the library."
    }
  ]
}