{
  "id": "1n82o18",
  "title": "[Placements]IBM Interview Questions Help",
  "content": "IBM is Coming This Year So If Any Senior Can Share What Questions They Asked both in Interview and in Coding Round That Will Be Big Help.Than For Any Help.",
  "metadata": {
    "author": "Stunning_Reward_7908",
    "url": "https://www.reddit.com/r/PESU/comments/1n82o18/placementsibm_interview_questions_help/",
    "permalink": "/r/PESU/comments/1n82o18/placementsibm_interview_questions_help/",
    "score": 27,
    "created_utc": 1756967113,
    "flair": "Placements 🤑",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ncc0lty",
      "body": "Bro leave see the diversity factor everywhere my gosh I don't know Man this shit feels depressing like whether we have to blame ourselves by not being that better or gender thing no clue"
    },
    {
      "id": "nccg93v",
      "body": "Don't have much hope on ibm it's most probably a diversity hiring"
    },
    {
      "id": "ncchqm6",
      "body": "Are they coming for male? I’m from MIT and they strictly came for Female this year. Couldn’t apply on NeoPat as it literally asked me to change my gender 😭"
    },
    {
      "id": "nccuz4u",
      "body": "Username checks out"
    },
    {
      "id": "nccxphi",
      "body": "Hehehe suiii"
    },
    {
      "id": "nce51ne",
      "body": "Coding questions were in the easy-medium range. None were hard. So, you shouldn't face any difficulty if you are comfortable with DSA to a certain extent. \n\nAs far as interviews are concerned, it doesn't matter what questions they ask you, your selection is entirely a matter of luck. They will aim to hire as many girls as possible, if you look at previous year's pattern. In the interview, I was asked fairly easy questions related to stack, some questions on my resume and some general cultural fit questions."
    },
    {
      "id": "ncjnttp",
      "body": "Do you know what was the male female hiring ratio in ibm for our college last year ?"
    },
    {
      "id": "ncjogu8",
      "body": "Not sure but it was very skewed. You can assume somewhere around 80-90 girls and 30-40 boys. This is primarily because they hired only girls via a separate diversity hiring drive and both girls and boys through their normal hiring drive"
    },
    {
      "id": "ncl837i",
      "body": "Damn that’s still not bad , even if they take like 10-15 guys this time I’ll be happy 😭"
    },
    {
      "id": "ncpbth3",
      "body": "I heard that placements are good this year. My friend told me that 100 got placed in the first month itself. Uber, Arctic wolf never came to our college last year"
    },
    {
      "id": "ncpc7c2",
      "body": "I’m currently in 4th year and our placements are wayyy better than any other college but everyone feels it won’t reach last years numbers unless ibm pulls a mass hiring scene again"
    },
    {
      "id": "ncpcgum",
      "body": "That's how initially you will feel but college will keep bringing companies until you guys graduate. So there are plenty of opportunities for everyone to get placed."
    },
    {
      "id": "ncpeqhv",
      "body": "Hope that’s the case bro , thanks a lot 🙌"
    }
  ]
}