{
  "id": "1n83ika",
  "title": "[Placements] Bruh why are they handling the placements so poorly",
  "content": "Cloudera and Walmart Labs interview is on the same date.  \nAnd some companies backed out cuz of PES infra limitations and date clashes",
  "metadata": {
    "author": "No-Barnacle-107",
    "url": "https://www.reddit.com/r/PESU/comments/1n83ika/placements_bruh_why_are_they_handling_the/",
    "permalink": "/r/PESU/comments/1n83ika/placements_bruh_why_are_they_handling_the/",
    "score": 55,
    "created_utc": 1756970373,
    "flair": "Placements 🤑",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ncc2aro",
      "body": "Infra limitations?? Wdym??"
    },
    {
      "id": "ncc2nwz",
      "body": "“Freshman” \nI’m a fresher this year and have joined the CSE branch. I wanted to ask if the girls’ hostels in PES RR campus are already full or if admissions are still open. Any seniors or current students, please share your experience or guidance.\n\nThanks in advance!"
    },
    {
      "id": "ncc39mt",
      "body": "Is this real seniors that some companies backed out?"
    },
    {
      "id": "ncc3voe",
      "body": "Yess"
    },
    {
      "id": "ncc3zwz",
      "body": "Sad... How many companies btw? And what are the infra problems?"
    },
    {
      "id": "ncc53sv",
      "body": "Comment unrelated to the post."
    },
    {
      "id": "ncc5azl",
      "body": "mostly its the wifi issue and they not being able to accomodate"
    },
    {
      "id": "ncc5xum",
      "body": "OA/interview date clashes are common. Unfortunately PES isn't the one scheduling these, so they have little control over it."
    },
    {
      "id": "ncc5z36",
      "body": "Wifi issues don't seem so big but anyways they should try to eliminate these kind of things.... Were these also there for your batch i.e 25 batch?"
    },
    {
      "id": "ncc6nbw",
      "body": "Unfortunately, the Company decides on a date for the OA and PES has to comply with it. Keep in mind they're going to multiple colleges. I believe Cloudera is diversity hiring, by the way. \n\nI do agree that a lot of other aspects of placements are unregulated such as curbing cheating and people abiding with the placement policy."
    },
    {
      "id": "ncc76ky",
      "body": "It's the biggest issue in campus, holding a test for 1k+ people in the campus is very difficult with the quality of wifi we have."
    },
    {
      "id": "nccg2bm",
      "body": "It's not completely true; Few backed out because of date unavailability(they wanted a particular date), but most of the companies which have shown interest are visiting."
    },
    {
      "id": "nccgh00",
      "body": "Yep and if you have clashing dates , you need to prioritize which company your going to give interview."
    },
    {
      "id": "nccgmzz",
      "body": "No but I have heard that companies would also not mind shifting dates if the PESU placements give them an alternate date before and plan it out properly for OA and interviews. Poor management of dates by placements office is also a major drawback here"
    },
    {
      "id": "nccpni4",
      "body": "Ohh then it's a major issue"
    },
    {
      "id": "nccpnv9",
      "body": "Ohh"
    },
    {
      "id": "ncd89bq",
      "body": "Most companies already have planned out recruitment in advance, which includes dates for OAs and interviews for different colleges. The date selection is on the company's end and then proposed to PES, and given their plans, they might not have room to adjust. Quite naturally, the larger the company, the lesser the chance they will reschedule."
    },
    {
      "id": "nce2f6t",
      "body": "yup, some high paying ones also backed out. This was the most disappointing thing. While a stream of tier2 and 3 companies were coming, these backed out. luckily, some of them, who backed out of the internship process, came back for FTE hiring."
    },
    {
      "id": "nce3b7c",
      "body": "Oh good to hear that but they should do something atleast give tier 1 companies more priority"
    },
    {
      "id": "nchticn",
      "body": "I'm a 3rd year student in PES and I haven't been receiving the PPT/Test links, even though all my submitted details are verified and correct and I've cleared the GPA criteria. I've confirmed that others, both with higher and lower GPAs, have received the links. I'm also part of the placement Google group and I have received other emails, including the ones that say \"all registered students have been sent the link.\" I’ve tried contacting coordinators via email/WhatsApp but haven't gotten any clear responses. If anyone has faced something similar or knows how to resolve this, any help would be appreciated."
    },
    {
      "id": "ncijbfr",
      "body": "The PO doesn't care man. If you ask him, he might ask you to prefer a tier3 company over a tier1 company lol"
    },
    {
      "id": "ncivvp2",
      "body": "What might be the ratio of diversity to non-diversity hires?"
    },
    {
      "id": "ncksvtz",
      "body": "i mean its PES lmao, whatd you expect 😭"
    },
    {
      "id": "ncvc9vf",
      "body": "Hello, varies tbh. The guys had a 9.5+ cutoff iirc, while it was 9+ for girls which is a lot more achievable. you can expect the ratio to be 1:2 to 1:4"
    },
    {
      "id": "ncw0575",
      "body": "Seems like a pretty solvable issue.\nInfra should not be a limiting factor"
    },
    {
      "id": "ncw0biw",
      "body": "All classes are happening along with the test, so the wifi has difficulty."
    }
  ]
}