{
  "id": "1n8hyoa",
  "title": "[Placements] I hate Placements - what was that shortlist for SAP, Uber and Apple !",
  "content": "Companies using cloud flare lava lamp random picker ahh shortlist.  \nNo use having skills and gpa   \nJust copy and get shortlisted.  \nBruh ppl finished OA in 20-30 min and without any sus got shortlisted.  \nNo wonder if companies dont come next year - get shortlisted fuck up interview -> college lectures everything on why cheating bad -> make it bad for everyone  \nLost all hope to get any Job  \nI wouldn't be surprised if same thing happens for IBM - 1500 ppl eligible + diversity hiring",
  "metadata": {
    "author": "Difficult_Leopard952",
    "url": "https://www.reddit.com/r/PESU/comments/1n8hyoa/placements_i_hate_placements_what_was_that/",
    "permalink": "/r/PESU/comments/1n8hyoa/placements_i_hate_placements_what_was_that/",
    "score": 114,
    "created_utc": 1757010164,
    "flair": "Placements 🤑",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ncf3zp6",
      "body": "Aren't OAs offline ? how are they cheating? "
    },
    {
      "id": "ncf49jf",
      "body": "OAs were online as per the placement sheet but probably if they cheated to get shortlisted wouldn't they face difficulty in interviews bypassing those isnt easy at all..."
    },
    {
      "id": "ncf4a3g",
      "body": "Some are online, some are offline"
    },
    {
      "id": "ncf7k68",
      "body": "Uber shortlist out?"
    },
    {
      "id": "ncf850n",
      "body": "To any junior reading this, don't have a very high GPA and keep it around 9 if you want to get a good job. I feel like this placement cell has started doing some shady shit by ensuring lesser GPA people get more chances, so that they can flex a \"consistent average LPA\" across all GPA ranges. \n\nYet again, PES trying to be unique in the most odd way possible."
    },
    {
      "id": "ncf93de",
      "body": "VALID AF.....Will not name the person but ik a girl since my pu days ...Girly used to cheat during that time in our competitive tests , got management seat (not at shaming her for this its her life her choice). And now is literally boasting of copying in every test and she has got shortlisted with a gpa of below 7.5.BYE"
    },
    {
      "id": "ncfa99f",
      "body": "whats the use of them failing interview when someone who legit had a chance didnt even get interview chance : also some ppl not being harsh are dumb and havent done jack dsa or system design   \nIf they get grilled in Interview (the company wont come next yr if things go on like this)"
    },
    {
      "id": "ncfark3",
      "body": "some online (Online oas are competitive cheating at this point - tried to be fair didnt get into interviews too but i was being too naive)\n\noffline also no use - SAP many ppl had phones with them with no proctoring OR wrote from home  \n(Placement cell just let them go and let them take interview too guess what obv most of them fucked interview badly like one guy legit told binary search complexity as nlogn thats the scenario)"
    },
    {
      "id": "ncfawgm",
      "body": "Now I fear my future 😭🙏"
    },
    {
      "id": "ncfazvj",
      "body": "yes   \nNo point in grinding for GPA and doing good projects  \nnone matter at this point."
    },
    {
      "id": "ncffuzj",
      "body": "Hey, it's a completely valid crash out. Sorry about that. Although, I wouldn't bank on campus placements entirely. \n\nNGL Campus Placement is more luck-focused than skill-based. Use LinkedIn to build a better network and attend conferences and tech meetups. You are much more likely to land more interviews. And in some cases, even by-pass the random GPA blockers."
    },
    {
      "id": "ncfi1b7",
      "body": "What really matters then?  \nJust luck, connections and being skilled enough to pass the interview?"
    },
    {
      "id": "ncfkvc1",
      "body": "Does she play badminton xD?"
    },
    {
      "id": "ncfl6be",
      "body": "How many did sap take?"
    },
    {
      "id": "ncfn6dj",
      "body": "buddy she got a 9+ gpa."
    },
    {
      "id": "ncfnk7d",
      "body": "They didn't release that yet. It'll be in 2 days tho."
    },
    {
      "id": "ncfo3bf",
      "body": "Ohh even that person management damn"
    },
    {
      "id": "nchq2iw",
      "body": "I feel very sorry for seniors who worked hard, grinded, scored a good GPA and now are facing all this in placements. 💔"
    },
    {
      "id": "nchs2gj",
      "body": "around 20 total"
    },
    {
      "id": "nchwvdq",
      "body": "Why is the sample space of girl playing badminton is just 1"
    },
    {
      "id": "nci2039",
      "body": "Did UBER come this year?"
    },
    {
      "id": "nci3g9a",
      "body": "Yes, and they only shortlisted 3 people"
    },
    {
      "id": "nci3ou9",
      "body": "12"
    },
    {
      "id": "nci4ae4",
      "body": "It's not shortlist anymore it's slop list"
    },
    {
      "id": "nci4fv9",
      "body": "What’s the average package gonna be and what’s the highest one?"
    },
    {
      "id": "ncidc28",
      "body": "Highest till now 60  \nAverage 20"
    },
    {
      "id": "ncifmwa",
      "body": "is IBM doing two types of hiring this time as well, diversity hiring and normal?"
    },
    {
      "id": "ncigbgr",
      "body": "No one is aware of that. The shortlisted google form has gender as diversity and non diversity, that's where the speculation comes from. \n\nLast year, did they explicitly have a different registration for diversity hiring?"
    },
    {
      "id": "ncikm89",
      "body": "No connections needed just the luck and bare minimum skills to impress a boomer."
    },
    {
      "id": "ncil0ke",
      "body": "the theory is, most companies do the shortlisting and forwards to pesu placements, but there is also a rumor that sometimes placement cell shortlists ppl. not sure for which ones it is done, but its just a rumor"
    },
    {
      "id": "nciw88r",
      "body": "Do they like kick out ece people to accomodate more cs peeps , like suppose 10 shortlisted in that 4 are ece will they end up just removing ece n adding cs peeps atleast for T1 . Weird question I have"
    },
    {
      "id": "ncjaex5",
      "body": "I have good reason to believe that rumour is true. In-fact I think it's the reverse. First the shortlist goes to the placement cell. From there candidates who aren't eligible are removed. From there it goes to companies."
    },
    {
      "id": "ncjwye2",
      "body": "Nope, I doubt that happens really. I have seen ECE getting shortlisted for many T1, not just 1 ECE student multiple"
    },
    {
      "id": "ncjxh5j",
      "body": "Ah okay, i see. I hope placement cell shortlists based on companies criteria only"
    },
    {
      "id": "nckcch5",
      "body": "The diversity of ppl in Apple and Uber shortlists is so great I can clearly see the downfall of these companies just in case these ppl get the final offer"
    },
    {
      "id": "nckfxma",
      "body": "You are just entering corporate world.\n\nYou will realise, LUCK exists. Infact plays major role in everyone’s life.\n\nTrust me, DO NOT compare WITH THEM, you will be happier and healthier."
    },
    {
      "id": "ncla43a",
      "body": "Not at all saying sap is not a good company but my best friend slogged for 3 year to keep a goa of 9.2+ and hass accepted sap while one of my other friends partied went to goa during exams and has been shortlisted for uber....not at all saying anyone is wrong here but it's really unfair to anyone I have no idea how is anyone getting shortlisted atp"
    },
    {
      "id": "nclciv4",
      "body": "I think it's most probably going to be a mix of both in a single drive this time; I think they will concentrate majorly on diversity hiring"
    },
    {
      "id": "nclg7wn",
      "body": "I swear man placements really are effed atp it's not even in our clg but across almost all it's a harsh reality to accept and move on"
    },
    {
      "id": "ncoih29",
      "body": "oh okay"
    },
    {
      "id": "ncx6wfy",
      "body": "Cope"
    }
  ]
}