{
  "id": "1n8x3ja",
  "title": "[Discussion] Need some advice",
  "content": "",
  "metadata": {
    "author": "VictoryCommercial238",
    "url": "/r/Btechtards/comments/1n8x2x4/need_some_advice/",
    "permalink": "/r/PESU/comments/1n8x3ja/discussion_need_some_advice/",
    "score": 5,
    "created_utc": 1757051021,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ncieszw",
      "body": "In case this post is actually *serious*, then you should know that you're going to find all kinds of people at PES. Given that most people choose a college in our country based on placements, you're quite naturally going to find the majority discuss it. But maybe one thing you don't realise is that people discussing placements are also innately focused on building the skills needed for a good placement. \n\nIf you've read my older comments, you will know that you cannot get placed without good skillset and having a polished profile that is industry (and job) relevant. Given that you speak of wanting to skill up, the odds of you achieving the former are much higher at PES, where you are going to find competitive peers creating a competitive environment, a solid network of students and a strong tech culture (at least, if you are from ECC) and a recognised alumni network. I'd love to see *tier 69* colleges with no attendance requirements boast of the same. \n\nAt the end of the day, building the skills you want to have depends on you. The college provides an accelerating environment to accomplish that. If you think all people care about are placements, then you're partially right. But since you've barely spent a week here, you're too quick to judge and looking at the whole picture with partial information."
    },
    {
      "id": "ncieyba",
      "body": "I think presidency tolerates upto 50% attendance"
    },
    {
      "id": "ncigtjt",
      "body": ">cannot get placed\n\nIm sorry for not clarifying but I want to get a master's done abroad, all my seniors in RR Campus are just depressed of how many options PES has eaten up with no returns whatsoever.\n\n>no attendance requirements\n\nBro the Teachers in RR Campus for CSE are too shit, I don't even understand how they have a PhD, I travel 20kms daily to get nothing in return and only a receeding mental health.\n\nI asked this question particularly only after I realised how terrible of a decision I ended up making where I'm going away from my goals paying a 1 Lakh few for all these teachers and considering I won't get better profs anywhere in this city and my main goal being upskilling and going abroad, i thought why not\n\n1. Get a 10 GPA in a VTU college with no attendance \n2. Get alot of certificates\n3. Work on mental health \n\nPlease correct me if I'm wrong"
    },
    {
      "id": "nciho91",
      "body": "and do what lol, what is the end goal after four years with this?"
    },
    {
      "id": "ncihsd6",
      "body": "Im thinking of working in the states so a tier 2 in india or a tier 69 in india is valued the same"
    },
    {
      "id": "ncihzbt",
      "body": "If your goal is a Master's, then PES will help you way more than any tier 69 colleges lol. As someone currently pursuing their MS from a top-15, and having known friends and peers from PES who regularly make it to schools like CMU, UCLA, UCSD and the like every single year, I can vouch for the fact that you're better off here in a competitive environment that will encourage and push you to build your skills. Plus, the opportunities to actually build your profile - research labs, connections with profs, etc are much higher in number here.\n\nAlso fyi, certificates mean dogshit. Getting an 8.5 in PESU will get you much farther than 10 in VTU. Won't disagree about mental health, this place is a shitshow for mental health lmao."
    },
    {
      "id": "ncii4id",
      "body": "Uci cgpa convertor"
    },
    {
      "id": "nciigsb",
      "body": "Wouldn't recommend blindly following it since it's literally for a single university. The odds of other UCs following something similar are high, but you definitely cannot draw a conclusion that all unis use the same conversion scale."
    },
    {
      "id": "ncijckr",
      "body": "Oh shit, I was unaware, this was useful thankyou moderator, I'll check into it"
    },
    {
      "id": "ncikkj3",
      "body": "bro also non sarcastically can you tell me if keeping my grades will help me keep my mental health up or pesu will just destroy me to the core and leave me beaten"
    },
    {
      "id": "nciky1w",
      "body": "Depends on whether you're satisfied with keeping good grades. Your mental health will depend entirely on what makes you happy. Some people are satisfied with average grades as long as they get to work on other things. Some only find peace with 9+ GPA."
    }
  ]
}