{
  "id": "1n9xutb",
  "title": "[Placements] Placements after rejecting PPO",
  "content": "Does anyone know what the placement policy is for rejecting PPOs? If I reject a PPO for T1 internship+FTE( summer internship ) can I still sit for Fte+Internships?\n",
  "metadata": {
    "author": "Khayali-Biryani",
    "url": "https://www.reddit.com/r/PESU/comments/1n9xutb/placements_placements_after_rejecting_ppo/",
    "permalink": "/r/PESU/comments/1n9xutb/placements_placements_after_rejecting_ppo/",
    "score": 11,
    "created_utc": 1757160318,
    "flair": "Placements 🤑",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ncpx93v",
      "body": "Yes you can"
    },
    {
      "id": "ncpxj0t",
      "body": "So the one spring internship offer only rule doesn't apply to PPOs?"
    },
    {
      "id": "ncpyl9i",
      "body": "So if you get a ppo (doesn’t matter fte or intern or fte+intern) if you reject it you can still sit for all companies"
    },
    {
      "id": "ncpyx6z",
      "body": "Thank you!"
    },
    {
      "id": "ncqhggt",
      "body": "Nope, you cannot, rejecting a PPO from a tier will make you ineligible to sit for companies for that tier. As per college, they say that since college has indirectly played a role for that PPO, rejecting it is equivalent to rejecting a direct offer from that tier through placements.\n\nI got a PPO from my company where I did my summer, but the package was tier 2 and the clg had some bs clause which said I cant sit for entire tier 1. So i rejected the PPO and sat for placements in tier 1, but they have told that I cant sit for tier 2 anymore"
    },
    {
      "id": "ncqj18m",
      "body": "Dentsu?"
    },
    {
      "id": "ncqkz85",
      "body": "bruhhh can anyone sned any official documents for all these placement policies...there has been no official orientation of any sorts for us so yea"
    },
    {
      "id": "ncqqin8",
      "body": "How does placement office find out if you got a PPO offer?"
    },
    {
      "id": "ncr59wj",
      "body": "When companies give the student a PPO, it goes through the placement office only. Company informs placement telling this student(s) has/have gotten a PPO, we need a formal acceptance of the same from the student by replying to this mail and all. So based on that placement decides what to do."
    },
    {
      "id": "nctr6jw",
      "body": "You can reject a PPO. I rejected a T1 PPO and received a better offer in the same week. I got it clarified from the placement office before rejecting the PPO."
    },
    {
      "id": "ncu0vzb",
      "body": "So 100% for sure I can reject a PPO and continue to sit for both internship and fte right? There won't be any problems?"
    },
    {
      "id": "ncu71nc",
      "body": "Yes"
    }
  ]
}