{
  "id": "1na34ih",
  "title": "[Question] \n How to study at PESU",
  "content": "i am a fresher at pesu cse branch . its hasnt been a week here and i am already struggling in understand how to study for stuff . parents **expectation is like 9+ gpa** but i dont understand how do you really learn stuff\n\n  \nMost people said **notes and slides** from pesuacademy which is a lil inconsistent as in school there were always physical books but its fine i will get used to it . the major problem i am facing is **where to solve questions from** and looks pyqs are one thing but i am on literally first unit and esa pyqs dont have many questions\n\nteachers also only do **few questions in class and there is like 1-3 questions in the question bank at pesu academy** which many times dont even have the correct answer key correspondingly\n\n  \nany kind of help would be appreciated and if you could mention **active study hours** , it would be even better . ik study hours diff for diff people but still ..\n\n\n\nThanks :)",
  "metadata": {
    "author": "Creative-Rhubarb4287",
    "url": "https://www.reddit.com/r/PESU/comments/1na34ih/question_how_to_study_at_pesu/",
    "permalink": "/r/PESU/comments/1na34ih/question_how_to_study_at_pesu/",
    "score": 47,
    "created_utc": 1757174236,
    "flair": "Study Help :table:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ncr7k0e",
      "body": "1. Vibha notes on BetterPES\n\n2. AV Summary is goated\n\n3. Do the QA & MCQs on PESU Academy\n\nActive study hrs is a myth lol.... right before exams, the entire day will be active study hours and during normal days we barely study. So jus find ur groove and grind... tas all blud."
    },
    {
      "id": "ncr8txj",
      "body": "i get the college vibe and stuff but theres no way you manage to study just the night before exam and get good cgpa lol\n\n\n\n qa and mcq on  pesu academy are low . did you buy/borrow any physical book for practice"
    },
    {
      "id": "ncr9daq",
      "body": "Okay this is quite normal and this is how I exactly felt at first..\nIll list out resources and study methods which is quite enough to get an S grade in that sub..\n\nPhy: Faisal slides the holy Gita for phy, study everything line by line and solve all the numericals from those slides, read the pesu notes side by side, remember every formula. Do this first, then solve the question bank and pyqs (mainly the last 2 yrs), the isa papers will mostly have derivations and numericals in the 4 markers so do practice properly..\n\nEEE: The easiest subject in p cycle (this had the highest average in p cycle), for this do slides both pesu academy ones and one more is the krithika slides, all the questions in both isa/Esa come from them, not the same but of the same pattern, no need to study notes and qb for this, do listen to class coz you will understand this as it mostly has continuation of 11/12th.. \n\nMechanical: Lmao the shittiest of all the subs, for this you have to mug up slides, in isa1 youll have 2 numericals and 2 theory and for isa2 youll only have theory so prepare accordingly, just mug up every fucking thing, you are also expected to write diagrams so start studying this sub like 3 weeks before your isa or else you getting fcked \n\nMath 1 and Math 2: Solve all the CW questions, and qb (both are necessary so dont skip) \n\nPython and C programming: This is smtg yall will figure out on your own, yt/documentation/slides/notes do what works out for you..\n\nChem: This do slides and pyqs, (requires some mugging up but not as horrible as mechanical) this is sufficient fot both isa/Esa (questions will be straight forward)\n\nMechanics: Solve banana and orange for isas, orange and jackfruit for esas. Again a very straight forward sub (had the highest average in c cycle)\n\nEpd: Do slides and pyqs, again and very straight forward sub"
    },
    {
      "id": "ncr9qsa",
      "body": "We ppl def had some good set of QA & MCQs... so that worked for us.\n\nAnd about the night before exam, it varies, one might be the kind to learn a night before and one might need a while. Thats why I said find ur groove and stick to it lol.\n\nDin use any physical book till date but always had the material soft copies I referred to... all of them that were given in slides only."
    },
    {
      "id": "ncra8jc",
      "body": "Alright , its just the first week of pes . guess i will figure it out\n\n  \nthanks for your time"
    },
    {
      "id": "ncraf63",
      "body": "thanks for such a detailed reply regarding every subject\n\n  \ni will make sure to refer to Faisal sir's slides as i am currently stuck at Maxwell equations"
    },
    {
      "id": "ncrqfki",
      "body": "Adding to this great explanation , I would suggest one more thing.\n\nTry listening to all ur teachers for atleast 1-2 weeks and decide whom u r able to understand quite well and make a detailed notes while in class for that subject, things like how u understood a difficult topic because once u understand it and don't touch it u'll easily forget so writing it down of how u understood particular things will help a lot. (this takes lot of effort) but if u can do this for atleast one subject u can easily score S , by just revising it for 1-2hrs the day before the exam.\n\nIf you can do this for more subjects , that is great , but I feel every class has one good teacher."
    },
    {
      "id": "ncudfxa",
      "body": "where can we find Faisal sir's slides?"
    },
    {
      "id": "ncva2g0",
      "body": "[https://file.notion.so/f/f/1a3d7ac0-7804-45f4-b26d-cc70b24b7a75/8a2afb65-ea46-40ff-b770-10df1569dce9/Faisal\\_Sir\\_Slides.pdf?table=block&id=1dcd762f-3a8c-80ad-855e-cb55515c098e&spaceId=1a3d7ac0-7804-45f4-b26d-cc70b24b7a75&expirationTimestamp=1757253600000&signature=6fAXbYPUyeW9NDGQ3uOIgzlhgi3a5\\_sEQQvp2JQIA1E&downloadName=Faisal+Sir+Slides.pdf](https://file.notion.so/f/f/1a3d7ac0-7804-45f4-b26d-cc70b24b7a75/8a2afb65-ea46-40ff-b770-10df1569dce9/Faisal_Sir_Slides.pdf?table=block&id=1dcd762f-3a8c-80ad-855e-cb55515c098e&spaceId=1a3d7ac0-7804-45f4-b26d-cc70b24b7a75&expirationTimestamp=1757253600000&signature=6fAXbYPUyeW9NDGQ3uOIgzlhgi3a5_sEQQvp2JQIA1E&downloadName=Faisal+Sir+Slides.pdf)"
    },
    {
      "id": "ncwp7es",
      "body": "The link has expired, could you please send it again, i really need it"
    },
    {
      "id": "ncwsrw3",
      "body": "I took ECE and since it’s 1st it’s all mix so can I refer this? I just want to clarify bcz I had the same doubt"
    },
    {
      "id": "ncwtl6z",
      "body": "You can, this is for everyone"
    },
    {
      "id": "ncx4psa",
      "body": "Find the concept on the internet and find more questions. You might have to look out for stuff that's out of the syllabus. Try to understand what they're trying to teach you. First year is all basics. Except maybe that useless quantum physics course. Get questions from the teachers if you run out. They'll know the places to get em. Usually specific textbooks. You can even make your own shit up for math."
    },
    {
      "id": "ncxkfwi",
      "body": "hm okay .. did you buy any physical books in first year\n\nyeah that quantum physics subject just goes over me . i dont seem to understand it even a bit\n\nthanks for the reply"
    },
    {
      "id": "ncxl2fn",
      "body": "For Faisal sir's slides you can visit [https://hitesh-notes.notion.site/hiteshnotes](https://hitesh-notes.notion.site/hiteshnotes) and find it under sem 1 physics column u/New_Brilliant_7189  u/No_Comfortable9067"
    },
    {
      "id": "nd33ldo",
      "body": "https://drive.google.com/drive/folders/1UWQVsc_eLyksVZdDFDKe17gW6xCA34jk?usp=sharing \ncan someone confirm if this is the right one please"
    },
    {
      "id": "nd8l4ar",
      "body": "In sem 2 you will need mechanics textbook for statics. Because it's easy to access all problems.\n\nApart from that you don't really need a textbook for any course. Everything can be found from the aforementioned sources👍"
    },
    {
      "id": "ndh2r8z",
      "body": "ty"
    },
    {
      "id": "ndyslvv",
      "body": "Any physical textbooks are required for any subjects?"
    },
    {
      "id": "ne42vqk",
      "body": "Nah"
    }
  ]
}