{
  "id": "1nakdk0",
  "title": "[Question]at present I'm in 1st year, and I wanted to join any clubs .so,can anyone suggest me the best clubs which are usefull for my placements and also which increases my communication skills.",
  "content": "but my problem is that I don't have that much time so,can anyone suggest me the best clubs to join or is it better to join clubs in second year",
  "metadata": {
    "author": "PassionateEngineer29",
    "url": "https://www.reddit.com/r/PESU/comments/1nakdk0/questionat_present_im_in_1st_year_and_i_wanted_to/",
    "permalink": "/r/PESU/comments/1nakdk0/questionat_present_im_in_1st_year_and_i_wanted_to/",
    "score": 8,
    "created_utc": 1757220751,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ncutovb",
      "body": "Let's first clear the common misconception: No club will help you directly in your placement journey. Adding clubs to your resume adds exactly 0 value. Having said that, clubs are effectively a way to take time off from academics, work on your interests and build some skills, which indirectly may or may not contribute to your placement journey. Also, joining a club isn't any kind of \"official\" or formal \"contract\". \n\nIf you're looking to improve your communication skills, take part in events like debates and MUNs which are organised by the respective clubs. There are also other similar events. You'll have to pick based on what you like or what you want to do.\n\nAlso if you think you don't have time in first year, you're going to have even lesser time as the years progress."
    },
    {
      "id": "ncuvftn",
      "body": "I am now a product manager straight out of college and let me tell you clubs were one of the most impactful things on my resume. \n\nIf you’re able to pull off some actually meaningful stuff in clubs, interviewers will be more than happy to hear it. It can surely help with placements sometimes."
    },
    {
      "id": "ncux2xq",
      "body": "Let me rephrase, in case you glossed over my original comment: just being in the club and writing it on your resume has 0 value. However, being in a club gives you opportunities to work on yourself, which can in turn help you during placements. I believe it's the latter that helped you (not simply writing down the names of 5 clubs on your resume), since it helped you build the skills needed for the role."
    },
    {
      "id": "ncv01as",
      "body": "Clubs don't matter lol"
    },
    {
      "id": "ncv589y",
      "body": "Just spam codeforces dude"
    },
    {
      "id": "ncvtttl",
      "body": "For realllll"
    },
    {
      "id": "ncvuhlb",
      "body": "The only thing you can do in first year that somehow will affect your performance in placements"
    }
  ]
}