{
  "id": "1nao8o8",
  "title": "[Question] How is mechanical engineering in PES?",
  "content": "Hi, I might get a seat in PES mechanical in 3rd round of KCET. I'll be honest but I was never really interested in Engineering in the first place so I view all the branches like CSE/Electrical/Mech as the same and its not like I have a burning passion for it or anything. I got ISE in JSSATE, but I didn't like that college. I'm also not that financially viable for masters abroad.  How's the scope in mechanical? Really would appreciate some advice thanks!",
  "metadata": {
    "author": "RashGenZ",
    "url": "https://www.reddit.com/r/PESU/comments/1nao8o8/question_how_is_mechanical_engineering_in_pes/",
    "permalink": "/r/PESU/comments/1nao8o8/question_how_is_mechanical_engineering_in_pes/",
    "score": 2,
    "created_utc": 1757234942,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ncviwr5",
      "body": "on it's extinction i think"
    },
    {
      "id": "ncvjkr1",
      "body": "WHAT 😭"
    },
    {
      "id": "ncvjosl",
      "body": "Run"
    },
    {
      "id": "ncvjsds",
      "body": "PES is the best shot i got rn but only the mechanical :/ otherwise i have to do cse and all in lower colleges"
    },
    {
      "id": "ncvk96d",
      "body": "Go for it"
    },
    {
      "id": "ncvke48",
      "body": "fr? 😭 its so confusing bro many people are telling its bad and all but at the same time i wanted PES"
    },
    {
      "id": "ncvkjfe",
      "body": "Yea if u r okay with any branch then prefer clg over course"
    },
    {
      "id": "ncvkm9f",
      "body": "At the end of the day u have to work hard to get a job either way"
    },
    {
      "id": "ncvkvaa",
      "body": "Haaa yeah that's also there but I'm worried that I won't be capable enough and all 😭 How is PES academically? I heard its like academically challenging so is it hard to get a good CGPA?"
    },
    {
      "id": "ncvorav",
      "body": "Not good, go for RVCE, MSRIT or BMSCE"
    },
    {
      "id": "ncvpzvx",
      "body": "What's your goal? If you want to end up in IT, you'll doom yourself by picking mech because you won't even be able to sit for IT companies that visit."
    },
    {
      "id": "ncvqqls",
      "body": "Take cse in other colleges. It's worth it. Mech here is quite literally dead.\nOnly join mechanical here if you're willing to grind your ass out over the first year and get 8.5+ at the very least so you can branch change to aiml or maybe even cse at ec campus (which is very possible imo"
    },
    {
      "id": "ncvse68",
      "body": "hmm, its more like a gamble bro 😭 how is PES academically? isn't it tougher than most colleges?"
    },
    {
      "id": "ncvsi42",
      "body": "Yeah, but unfortunately my rank isn't that high enough for those colleges :/ The best college I can get is PES and that too mechanical branch"
    },
    {
      "id": "ncvsno2",
      "body": "It is but ec campus cse cutoff went very low this time.\nYou can easily get 8+ if you work atleast one day seriously before the exam and you have a decent ability to grasp info.\nBut you will in reality be studying atleast 1 week before.\n8 is enough to get you ec campus cse.\n8.6 is enough to get you rr aiml\nAnd 9.1 is enough to get you rr cse going by this year's stats.\nWouldn't rely on that though, just grind and keep it above 9.\nYou will definitely get rr ece or ec campus cse through branch change which is pretty good.\nNot a gamble imo, just make sure you work consistently during your first year."
    },
    {
      "id": "ncvsnx3",
      "body": "I'm fine with IT and core mechanical companies tbh. PES is the best college I cna get through KCET and that too only its mechanical branch otherwise i have to settle for CS in lower branches :/ I'll do research on its syllabus and if I find it appealing, I might just go for pes </3 also can you please elaborate why is it bad?"
    },
    {
      "id": "ncvtoqu",
      "body": "ah ok. i will research about the syllabus at PES regarding mechanical branch and if I find appealing ill go ahead with it. Also thanks so much for that info! If i join i'll make sure to stay disciplined and try my best. tysm for the info! btw which branch and course are you in?"
    },
    {
      "id": "ncvtu7i",
      "body": "Nw bro, take the right decision.\nI belive pes is good\nBranch change is risky but very doable with hardwork and discipline, it's a calculated risk.\nI'm in the aiml dept, 2nd year"
    },
    {
      "id": "ncvukez",
      "body": "Right.. thats great! how's it? also, if you take the worst case scenario, and if i somehow get lesser gpa to switch branches... i have to put in extra efforts just to get an average job right?"
    },
    {
      "id": "ncvuuzj",
      "body": "Oh yes \nBut imo if you get above 7 you will be able to switch branch to smtg other than mechanical be it ece at ec campus or anything else \nThen yes you will have to work extra hard to get a good job\nIf you transition to cse / aiml at any of the campuses it won't be that hard tho.\nHow's life? Pretty shitty still, but the subjects in the 2nd year here have gotten interesting.\nOther than that, life at pes is very shitty but hopefully rewarding at the end."
    },
    {
      "id": "ncvvrks",
      "body": "PES for anything but CSE is a disaster"
    },
    {
      "id": "ncvw7rq",
      "body": "Woah I see. Tbh I'm open to ECE as well. I see. Grind hard bro! Wait are you talking about scholarship? If i get 8.7+ i'll get that muchmoney  back? Also, do you have friends from mechanical branch? if yes, what do they say?"
    },
    {
      "id": "ncvyaz5",
      "body": "No that's horrible advice, don't pick Mech if you don't want it, especially in PES. There are 720 cse students, 480 aiml, 360 ece and 60 eee. Most IT companies don't even let Mech kids sit for placements"
    },
    {
      "id": "ncvygka",
      "body": "\"on the other hand\" and it was the same hand lmao 😂"
    },
    {
      "id": "ncw0c14",
      "body": "doesn’t the cutoff for PES go much higher than most engineering colleges you can get through kcet though? from what i know mech is very good in NIE (mysore) so if that’s your interest you can try for it. i don’t really think PES is good for mech as it’s a very CS oriented college i’ve been told so think accordingly i’d say"
    },
    {
      "id": "ncw1ldc",
      "body": "NIE is already out of reach for me because of its distance. Tbh I'm not really pursuing mechanical but rather a good college like PES, do you think if I join with a slight intention of changing branches like ECE or CS, its worth it?"
    },
    {
      "id": "ncw1q62",
      "body": "accha. what about core companies then?"
    },
    {
      "id": "ncw9pjx",
      "body": "Life is indeed like that sometimes"
    },
    {
      "id": "ncwa4f9",
      "body": "> good college like PES\n\nWhich means youre looking for IT placements.That also means that PES is only worth it if you can change branches at the end of your first year to ECE, at the very least"
    },
    {
      "id": "ncwe75h",
      "body": "joining a college just for branch change is very risky though"
    },
    {
      "id": "ncwezyr",
      "body": "so its a gamble? Heard this year the cutoffs lessened and it was quite easier to switch branches if u have 7+ gpa. how hard is it to get that much on a scale from 1-10?"
    },
    {
      "id": "ncwf4qn",
      "body": "yea. is PES mech really that bad though? like comparing it to mid-tier 2 colleges cse or smtg like that?"
    },
    {
      "id": "ncwl81h",
      "body": "This year was a little weird since the cutoffs dropped unexpectedly. Usually, you need at least an 8.5ish to get CS anywhere. The issue is that crossing an 8.5 isn't enough, because the number of seats are handful and many cross an 8.5."
    },
    {
      "id": "ncwqii9",
      "body": "ah. i see. i'm still kinda confused about this, like i'm more kinnndaaa inclined towards pes mech? but at the same time im paranoid if cse in tier 2.5 clgs are better"
    },
    {
      "id": "ncwuz69",
      "body": "Ya it’s both people tell according to there perspective good and bad but since u told pes is the best u got now join u got clubs and stuff going or maybe do some online courses outside but ya pes is good for IT placement but u can get good job outside placement depending on ur skills and cgpa  id prefer clg over any sub its like saying i got civil in IIT Bombay but i wanted CSE so i went for pes id chose IIT Bombay civil so its the same case go for the clg not sub"
    },
    {
      "id": "ncx0hv7",
      "body": "Again, you need to prioritise branch over college. What are you *actually* interested in?"
    },
    {
      "id": "ncx3bcn",
      "body": "Just take mechanical and then get a branch change by studying. It's not that hard cutoffs were really low. Then you can do like AI prod dev or some basic coding thing."
    },
    {
      "id": "ncxbhcg",
      "body": "Yup scholarship indeed!\nThanks bro\nNot got any furness from mech branch sadly \nBut you don't have to worry.\nFirst year subjects are common to all courses and you will be shuffled into classes with all people from all branches in it.\nSo first year is going to be common and you can branch change before second year where people enter their respective depts."
    },
    {
      "id": "nd0uu7c",
      "body": "Oh I see. I'm planning to take the risk and go with mechanical regardless then."
    },
    {
      "id": "nd0v1wl",
      "body": "as I said i'm ok with anything in CS and any spec, electrical or mechanical in top clgs bro 😭 but mech I can only get in pes nothing else"
    },
    {
      "id": "nd0v8cp",
      "body": "Ya i'll mostly go ahead with that only then bro"
    },
    {
      "id": "nd0veqe",
      "body": "yeah makes sense"
    },
    {
      "id": "nd0yzw5",
      "body": "update: i put mech on top n im trusting myself to clutch to other branches if not im cooked 😔"
    },
    {
      "id": "nd1y2tz",
      "body": "It's actually very very less of a gamble \n\nYou can get cs at ec campus for like 7.5 in my year, and ece in rr was lower, ece in ec campus was a participation trophy\n\nEspecially now that the aiml intake is higher+ec campus has aiml, the cutoffs should be much lower.\n\nIt's a risk yeah, but i think it could be worth it. Especially if you're properly motivated \n\nCs in ec campus would be a huge upgrade from whatever you're getting, and ece in ec campus would still be better for the most part"
    },
    {
      "id": "nd2dp5a",
      "body": "Yeah. I did choose PES mech as my first option on KCET. Wish me luck! Hope I can get any cs/electrical branch in [e.city](http://e.city) branch if not, then just try winging it 😎"
    },
    {
      "id": "nd2gcfd",
      "body": "Good luck 🫡"
    },
    {
      "id": "nd2hrq4",
      "body": "Good luck bro, be serious and work decently hard.\nHave fun also, 9 is very possible with a consistent \"work life\" balance."
    },
    {
      "id": "nd2izp5",
      "body": "How's placements spinny anna 😶‍🌫️\nAre we getting cooked in the 28 batch?"
    },
    {
      "id": "nd2rq30",
      "body": "Yes sir. Thank you so much for your help twin! Appreciate it. I will put my max effort bro."
    },
    {
      "id": "nd2rtgs",
      "body": "Thank you so much brother 🫂"
    },
    {
      "id": "nd33ska",
      "body": "There's a Sheet posted last week or so, check the sub. It's like 99% correct with a few mistakes \n\nBut yeah, placements are good if you're good. Do dsa, cn os, DBMS, ooad, and system design. \n\n2-3 good projects. Talk able, prepare for common questions like why you used this, why haven't you used this other alternative. \n\nVery doable if you start a commited grind from 5th sem onwards. Or even the two months break after 6th sem is enough"
    },
    {
      "id": "nd3cjxs",
      "body": "Thanks a lot bro,\nDid check out the sheet yep 👍🏼 \nJust wanted to know beyond the numbers\n\nGood luck!"
    }
  ]
}