{
  "id": "1nbnebr",
  "title": "[Placements] When will Goldman Sachs release shortlist for Ops role?",
  "content": "We had written the GS OA on 2nd September, but they still haven’t released the shortlist for interviews.",
  "metadata": {
    "author": "pimpassjim",
    "url": "https://www.reddit.com/r/PESU/comments/1nbnebr/placements_when_will_goldman_sachs_release/",
    "permalink": "/r/PESU/comments/1nbnebr/placements_when_will_goldman_sachs_release/",
    "score": 10,
    "created_utc": 1757337202,
    "flair": "Placements 🤑",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "nd33gqt",
      "body": "First of all their website was trash it couldn't handle the load couldn't upload only"
    },
    {
      "id": "nd3fqx7",
      "body": "It is an open campus opportunity for 3 clg pes,psg and one more was there; They generally release shortlist after 1-2 week of aptitude test; And generally they don't send shortlist, they directly send an email to all shortlisted ones to take up the coding assessment."
    },
    {
      "id": "nd3gz33",
      "body": "Is there a coding assessment for Operations Role?"
    },
    {
      "id": "nd3j6vl",
      "body": "It's not an operations role; They are hiring for operation team/division, the role includes design of technology as well, so it will include coding assessment."
    },
    {
      "id": "nd3jm5y",
      "body": "Oh okay wasn't aware of this. Thank you"
    },
    {
      "id": "nd3nwgx",
      "body": "Bro there’s no coding, it’s Operations Role. After OA, there will be GD, and then interview. Confirmed it with a senior"
    },
    {
      "id": "nd3oveo",
      "body": "Vit lmao"
    },
    {
      "id": "nd3pt75",
      "body": "Oh ok, then why are they even hiring from b.tech; Like what's the point of hiring btech people for an operations role."
    },
    {
      "id": "nd3utac",
      "body": "You won’t be coding. You’ll be using tools like Power BI, Alteryx, Tableau."
    },
    {
      "id": "ndncxsu",
      "body": "Did Anyone get Goldman Sachs shortlist ?"
    }
  ]
}