{
  "id": "1nbohfb",
  "title": "[Placements] Need guidance about Apple internship",
  "content": "Apple's come for placements, and I have a few questions to the seniors who've worked at Apple OR anyone who's got inputs. \n\n1. As Apple has offices both in Bangalore and Hyderabad, which one do they recruit us for? Is it the same location for everyone or is it based on some individual requirements/performance? Would it be the same location for FTE in case they give a PPO or do I have the flexibility to choose? \n\n2. How's it working at Apple IS&T, specifically? Do you get to work on meaningful projects? Would love to hear more about the experience.\n\n3. What kind of questions are asked in the interviews, and any specific tips to prepare? \n\nIt would really help if you could guide me, and I'm open to advice.",
  "metadata": {
    "author": "Immediate-Floor2648",
    "url": "https://www.reddit.com/r/PESU/comments/1nbohfb/placements_need_guidance_about_apple_internship/",
    "permalink": "/r/PESU/comments/1nbohfb/placements_need_guidance_about_apple_internship/",
    "score": 23,
    "created_utc": 1757339941,
    "flair": "Placements 🤑",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "nd3593d",
      "body": "Hey! Not working at Apple but I know people who do.  2025 batch. You can be assigned to either Hyderabad and Bengaluru. I know someone who was in BLR for internship but moved to HYD for full-time. Interview depends on interviewer."
    },
    {
      "id": "nd35z55",
      "body": "Just to add, I don't think you'll ever see anyone admit that they don't enjoy working at Apple. Working there carries that prestige. I do know that the work is quite secretive though because none of them submitted an internship report and couldn't share manager details."
    },
    {
      "id": "nd38464",
      "body": "Cool, thanks a lot!"
    },
    {
      "id": "nd3bqkn",
      "body": "How much CGPA is needed to be shortlisted for Apple?"
    },
    {
      "id": "nd3jdkb",
      "body": "7+ to be eligible. 95 students were shortlisted for interviews (in the IS&T org) after the OA, which I believe they're 8+. They'd probably shortlist for other roles with a higher GPA limit."
    },
    {
      "id": "nd49m3i",
      "body": "I dont think there is an apple office in bangalore. are u sure there is one?"
    },
    {
      "id": "nd4b1oa",
      "body": "It's in Minsk Square, just a 4min work from Cubbon Park Metro Station."
    },
    {
      "id": "nd7ffn1",
      "body": "They did shortlist a few people below 8 as well"
    },
    {
      "id": "nd864zz",
      "body": "Nice"
    },
    {
      "id": "ndafx9f",
      "body": "How much are they offering?"
    }
  ]
}