{
  "id": "1nbq4cd",
  "title": "[Admission] worth taking mgmt quota CSE?",
  "content": "my nephew is getting mechE in BIT via comddk but he is interested in doing CSE from PES EC branch but might get only mgmt quota. is it worth of spending 12lpa for this course here? total cost would be close to 50L by the time he completes it. can he get placed and recover this ROI?",
  "metadata": {
    "author": "Foreign_Wedding2060",
    "url": "https://www.reddit.com/r/PESU/comments/1nbq4cd/admission_worth_taking_mgmt_quota_cse/",
    "permalink": "/r/PESU/comments/1nbq4cd/admission_worth_taking_mgmt_quota_cse/",
    "score": 3,
    "created_utc": 1757343730,
    "flair": "Placements 🤑",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "nd453rq",
      "body": "subjective but my answer would be not worth it"
    },
    {
      "id": "nd47nj9",
      "body": "Nothing subjective tbh, its just not worth it"
    },
    {
      "id": "nd6wiyb",
      "body": "Not worth it. Maybe check for rvce mgmt quota, I would rather pay a little more and take that instead of PES tbh"
    },
    {
      "id": "nd76zbc",
      "body": "if you get 12lpa sure"
    },
    {
      "id": "nd8aay1",
      "body": "If man is smart enough to get scholarship, definitely worth it. Considering u pay 50L for 4 yrs and he manages the 40% scholarship at least, u wud get back 20L. The scholarship is on the entire money paid not only on the tuition fees. And abt getting placed and recovering it, thats based on how he manages the 3 years and gets placed. Tier 1 meaning he can def recover the ROI in 2-3 years."
    },
    {
      "id": "nd8x8uy",
      "body": "No"
    },
    {
      "id": "nd98g9r",
      "body": "thank you, will ask him to check abt this."
    },
    {
      "id": "ndb6iqw",
      "body": "Nope, get CSE from any other college and save the money for masters."
    },
    {
      "id": "ndbuyp6",
      "body": "you mean it costs more than this?"
    },
    {
      "id": "nddgvnc",
      "body": "rvce management quota is 70L 💀"
    },
    {
      "id": "nddhawj",
      "body": "you should get back the money u invested in pes, at a management quota this will be difficult cuz you invested a lot and have a high probability of getting a lower package (unless you're a genius). which means you will essentially will take a very long time to get that money back, and then pursue higher education or anything else"
    }
  ]
}