{
  "id": "1nd8t7i",
  "title": "[Rant] WTF is this IBM shortlist",
  "content": "IBM was my last fucking hope, i dont want to attend any more tests anymore cuz every fucking company has their entire process flawed. the entire industry is flawed ffs. this was my last piece of bread, i wanted it so badly. now all my college mates who i have been around since day 1 of college have been placed and are chilling so hard. i envy them and hate them. i dont want anything so badly as being placed anymore. the ultimate goal to attend such a 'prestigious' college with all its star decked army of professors and research labs, paying lakhs each and every year has been to get placed and support my family. now i have lost my best chance of doing that. idk what to do anymore.  \nNo logic nothing in the shortlist, i already gave up on placements. The shortlist makes no sense. Not one deserving person in the list. Is this what it has come to? Does hardwork never payoff? People should realise how bad the cheating has gotten. only we know our condition properly.  \n",
  "metadata": {
    "author": "arjuuuuunnnnn",
    "url": "https://www.reddit.com/r/PESU/comments/1nd8t7i/rant_wtf_is_this_ibm_shortlist/",
    "permalink": "/r/PESU/comments/1nd8t7i/rant_wtf_is_this_ibm_shortlist/",
    "score": 135,
    "created_utc": 1757493723,
    "flair": "Placements 🤑",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ndexlpb",
      "body": "this is the situation with the whole Indian IT industry, we cannot do anything about this except but move on. we have to accept the fact that we are competing with hundreds of thousands of students like us. some study hard and work like us, but some resort to cheating and take the easy way out. i completely understand its unfair and not right but not everyone wants to put in the work because they think its unecessary.   \nso the best solution to this is to just move on and not think too much about this. make sure we are giving our 100% for the next test and pray to god we live long enough to get placed."
    },
    {
      "id": "ndey0xv",
      "body": "Fr bro this has just become a game of fastest fingers. Just copy, submit in 15 mins ,get shortlisted and fuck up interview. So unfair man. I just feel like fucking giving up"
    },
    {
      "id": "ndey4q9",
      "body": "Last line got me overthinking everything bro😭"
    },
    {
      "id": "ndf2jec",
      "body": "Dw the cheaters may be chilling now but they won't last 5 years in the industry."
    },
    {
      "id": "ndf3s93",
      "body": "Most cheaters are in 7 to 8 CGPA range !!! Companies keeping 8 , 8.5 and 9 + cutoff get true talent and not cheaters"
    },
    {
      "id": "ndf3zg9",
      "body": "What was ibm cgpa cutoff?"
    },
    {
      "id": "ndf42qo",
      "body": "7+ all branches CSE,AIML,ECE,EEE 1400 people appeared for test and 150 got shortlisted for interview"
    },
    {
      "id": "ndf65j9",
      "body": "Bro fck it idc if they live in industry or not.\nAtleast the people who have good skills who can crack interviews. They should get shortlisted.\nI know many who don’t know Ghanta about coding all they will fck up the interviews \n\nLiterally my all test cases are all passed and I know one of friend whose only 7 test cases passed he got shortlisted how the fuck??"
    },
    {
      "id": "ndf69qf",
      "body": "Offcampus is even harder many companies have opening not for freshers they are asking atleast 2+ years"
    },
    {
      "id": "ndf7f73",
      "body": "what if a deserving \"smart\" candidate starts cheating then? won't they last in the industry? why don't y'all deserving ppl also start cheating then,please explain,i am a junior, are you guys scared of being caught or something?"
    },
    {
      "id": "ndf7s3q",
      "body": "Unfortunately, work at organisations is usually much easier than the hiring tests. I know some folks who cracked NVIDIA like this and are doing decently there lmao"
    },
    {
      "id": "ndf7t6a",
      "body": "Broke my fucking heart bro. Its like people are getting punished for being honest  \nLike random ass people are getting selected......."
    },
    {
      "id": "ndf8dpz",
      "body": "Even after cheating there isn't any guarantee of getting shortlisted it's cheating+ pure luck which is required "
    },
    {
      "id": "ndf9ixr",
      "body": "As someone else said, cheating isn't enough to beat cheaters. There are multiple factors when it comes to shortlisting. Some are known: CGPA, resume, performance on OA; some are not visible: how quickly you submit, how quickly you solve each question, the number of attempts you make to solve etc. it's entirely up to the company to decide which parameters to use to shortlist candidates. In such situations, cheating unfortunately gives people the upper hand."
    },
    {
      "id": "ndfak4b",
      "body": "It honestly seems like cheating has led to drastic effects in the hiring process now. *Back in my time*, cheating existed but it wasn't exactly *rampant*. What helped is that we did not have any AI agents and chat assistants at our fingertips (this was even before ChatGPT came out lmao). So the only way people could \"cheat\" is by forming groups and solving together, which you can understand, isn't nearly as effective as the solutions that exist today. \n\nUnfortunately, there is nothing you, me or anyone else can do about it. People are taking advantage of shortcuts and while it's unethical and illegal, the lack of real consequences doesn't deter them. Add all the invisible factors that affect the selection criteria, you're essentially looking at the process as a black box since there is no way to explain what's happening. People are giving themself the upper hand in any way possible, even if it means they won't get past a single interview. \n\nAll I can say is, focus on yourself. Hold on. Placements are not a race but a marathon. Pace yourself, you're going to have some Ws and many, many Ls. I myself didn't get placed until mid September or so, and I was in your shoes - almost all my friends were placed and many people known to cheat had gotten offers. Eventually, something will work out. You just need to keep grinding it out and putting in the effort, showing up when it matters most. Eventually, you'll make the shortlist, and since you put in the hard work and time, you'll cruise through the interviews. For now, believe in yourself and keep continuing the focused efforts."
    },
    {
      "id": "ndfasyo",
      "body": "How many did they shortlist?"
    },
    {
      "id": "ndfatbo",
      "body": "And adding some extra context: I know exactly what you're going through now as someone in the US applying for internships and jobs. The competition here is much higher with potentially thousands of applicants per role, and given the rise in LLMs as a commodity, cheating is practically everywhere."
    },
    {
      "id": "ndfb4yt",
      "body": "130 odd"
    },
    {
      "id": "ndfe9ne",
      "body": "Damn, looks like mass hiring again this year"
    },
    {
      "id": "ndfegw3",
      "body": "Don't worry the market situation is such that every other company wants to cut costs somehow. So even if you get into a company you need to keep your fingers crossed hoping you don't get laid off. The competition is rampant."
    },
    {
      "id": "ndff6p3",
      "body": "Can't something be done about this? Its really unfair how we are working hard all 4 years and then someone who doesnt know jack just cheats their way through? I'm a junior so just asking."
    },
    {
      "id": "ndfgohh",
      "body": "Didn't they take 120 itself from last year so they would have shortlisted like 200+ ig in ur time ?"
    },
    {
      "id": "ndfhb5t",
      "body": "IBM visited multiple times for us. When IBM ISL came, they shortlisted 230 and took 60+."
    },
    {
      "id": "ndflybi",
      "body": "90% of them are getting hired"
    },
    {
      "id": "ndfnrjz",
      "body": "Nothing you can do; The only way out is you also start cheating and have some luck to get shortlisted, so that Atleast a deserving candidate goes to the interviews and possibly cracks it"
    },
    {
      "id": "ndg1t0p",
      "body": "Even among all these wierd arse hirings - Apple , Uber and SAP (where ppl copied and took some of my chances - not like guarenteed I would have got an offer had I got interview chance - but better than scam shortlist) I had a small hope for Walmart where the cutoff was 9 gpa and grinded myself to get an Interview chance .  \nCleared both tech rounds and then at that moment I thought I bagged the offer (HR congratulated us)  \nThen HR round was generic Q like hobbies,strengths etc which went well   \nBut after a discussion they decided to hire only 4 out of 7 peeps bruh why did they even congratulate and give hope only to discuss and reject 3 hrs later(they didnt even tell the reason - just \\`you can leave for the day and DoNT Be DEjeCteD YoU MAde iT ThiS FaR\\`)  \nIg they had only 4-5 offerings and considered R2 perf too where I underperformed compared to others in the list   \nIt wouldnt have hurt that much if they rejected me in R2 but thats cruel to give hope that I got the Job and later kick me like that   \nWas about to breakdown there : (  \nbut anyway pulled myself thinking I had IBM  \nbut after todays IBM shortlist nothing feels worth it anymore."
    },
    {
      "id": "ndg409d",
      "body": "Ong. And the companies look for young people too they say, so the older we get the bleaker the opportunities get?"
    },
    {
      "id": "ndg9sci",
      "body": "Not so anonymous, are you?"
    },
    {
      "id": "ndgkh05",
      "body": "They have to conduct tests on campus in assessment centres"
    },
    {
      "id": "ndgst54",
      "body": "Why tf do they use the 7.75 and 8.75 as the bracket opening? This is is really annoying since it groups guys will 7.8 and 8.7 in one bracket and gives you placement percentages. If your gpa is between 7.75-8 there's no real advantage you have over 7.5 guys , so you can't really trust the statistics of a group that includes guys with 8.5+ gpas. If your gpa is 7.75-8 you might as well consider yourself in the 6.75-7.75 bracket?"
    },
    {
      "id": "ndh3tuc",
      "body": "it doesnt matter where the test is, it's always unfair"
    },
    {
      "id": "ndh5m54",
      "body": "Can't they make it strict like ESAs with real punishments? If there's no real fear of getting caught obv everyone will cheat."
    },
    {
      "id": "ndhvj5e",
      "body": "What is the CGPA required for getting shortlisted for IBM?"
    },
    {
      "id": "ndhympz",
      "body": "7"
    },
    {
      "id": "ndkrztq",
      "body": "You believe the US job market is even more competitive than India? Damn"
    },
    {
      "id": "ndkudy9",
      "body": "You honestly can't compare the competition you face in an on-campus setting to what's out there. There are like 200-250 in my own program. There are multiple programs in each uni, and ofc, there are multiple unis. That effectively boils down to thousands applying for a single role that takes in maybe 2-3 applicants. Add other factors that aren't in our control like the bias against international students, slow hiring etc, it's a pretty steep challenge to get any kind of offer here. People are driven to cheat on the OAs because that's the only thing they can control, and even if you solve 100%, it's never enough."
    },
    {
      "id": "ndkvqu6",
      "body": "How’s it going for you so far? Have you gotten any interviews?"
    },
    {
      "id": "ndkzoap",
      "body": "CTC?"
    },
    {
      "id": "ndl8ola",
      "body": "I have. Got a summer internship and also received a return offer for a Fall internship."
    },
    {
      "id": "ndlg9qg",
      "body": "Don't worry, followed by \"You're fucked\""
    },
    {
      "id": "ndlgsps",
      "body": "Duality of the corporate world. Unfortunately."
    },
    {
      "id": "ndm5vvk",
      "body": "if they cheat now, how will they perform well once in the company? don't these companies use anything to select the right candidate"
    },
    {
      "id": "ndyqmko",
      "body": "u/rowlet-owl  On a serious note should we cheat or just go by the traditional route? Since it seems totally bullshit to play fair in an UNFAIR game."
    }
  ]
}