{
  "id": "1nf0rbm",
  "title": "[Placements]  Serious doubt: Does cheating in online assessments affect future interviews?",
  "content": "Hey, I just wanted to clarify something. If someone cheats in the online assessments and the company finds out, how serious is the matter? Will the placement cell ban us from future interviews? And if we are banned, is there a way to know about it or get notified officially?",
  "metadata": {
    "author": "Own_Pea_7154",
    "url": "https://www.reddit.com/r/PESU/comments/1nf0rbm/placements_serious_doubt_does_cheating_in_online/",
    "permalink": "/r/PESU/comments/1nf0rbm/placements_serious_doubt_does_cheating_in_online/",
    "score": 27,
    "created_utc": 1757676838,
    "flair": "Placements 🤑",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ndssi8j",
      "body": "Last year a company hiring for summer internships sent mails to all suspected cheaters telling them they're out. Don't remember which one, but it happened \n\nAnd this year I've shown my phone by mistake in multiple tests, can confirm nothing happens"
    },
    {
      "id": "ndssmei",
      "body": "Lmfaooo op fumbled and is now panicking after orientation? 😭"
    },
    {
      "id": "ndstoq0",
      "body": "Bro listen copy the questions which you surely know something about, and also practice all those copied questions after tests and also be prepared purely cheating won't get you anywhere..."
    },
    {
      "id": "ndsw8rq",
      "body": "Unless the company itself identifies the cheaters and takes action, you are fine. Even the placement officers know students cheat, but they won't give a fuck about it unless the company asks them to."
    },
    {
      "id": "ndsymu6",
      "body": "I get it, but how can we actually know if we’re banned? Will the placement cell officially tell us, or do we just find out when we’re not getting shortlisted for future OAs?"
    },
    {
      "id": "ndsz9ot",
      "body": "Its crazy how seniors have normalized Cheating in the comments.  \nIs this how far we have come? That we think it \"OK\" to copy during tests and later prepare for those questions.  \nUnfair for the genuine one's.  \nu/AutoModerator"
    },
    {
      "id": "ndt2i4v",
      "body": "okay, but how do we even know if we’re banned? Do they actually notify us or just silently filter us out?"
    },
    {
      "id": "ndt41te",
      "body": "Silent filter, except that one company"
    },
    {
      "id": "ndt5e8i",
      "body": "Yes, it is normalised and the ONLY way you can even have a fighting chance in these OAs\n\nSometimes the questions are so hard that even chatgpt and other AIs can't solve them. Deepseek deepthink takes 20 minutes to solve some of them, and sometimes Gemini pro gets it. Virtually nothing else, and definitely no or very very few students might get them on their own \n\nWhen the questions are easy and actually doable, legitimate solvers take time. Cheaters do everything as fast as they can type basically. And they get the shortlist. \n\nI'm lucky that the company I got placed in has their test in the college assessment centre, but that's very rare. And i don't blame anyone who's cheating, cause it's just the way it is. \n\nThere's 400-1200 people writing each test, good luck getting shortlisted without cheating. But yeah, you'll have your pride."
    },
    {
      "id": "ndt5tcm",
      "body": "Hijacking the top comment here, but don't aim to cheat. Remember that if you get caught, companies can choose to notify the placement cell about you and force them to take action. I know that placements are tough, but the odds of you getting placed are higher if you actually get to sit for placements compared to you getting banned from placements altogether. \n\nAnd yes, companies do get to know if you cheated through OAs. The skill gap is noticeable. They know the level that was set for the OAs and how difficult the interviews are related to it. If you really struggle really bad in the interviews, it's not a good sign. And to add: cheating won't help you clear the interviews."
    },
    {
      "id": "ndt6j1j",
      "body": "There's a reason our country simply cannot progress: we manage to turn everything into a rat race. From something as foundational as choosing a college for undergrad to even jobs, it's all become a rat race and grind fest of who can survive. When people can't survive in the system, they resolve to cheat it. Note that I'm not supporting this in any way, I'm just saying that this was bound to happen sooner or later. The byproduct of this is very evident: people end up choosing branches they have no interest in, and low-skilled mediocre engineers end up in companies and get laid off cause they are incompetent. \n\nAlso, why did you tag the bot? xD"
    },
    {
      "id": "ndt73qn",
      "body": "unless you see the consequence you wouldnt really know, so why cheat? just dont, be honest"
    },
    {
      "id": "ndt7exf",
      "body": "I keep consistently seeing people ik tht 98% cheated get shortlisted, so no idt it matters cuz the placement committee gives 0 fks, just really frustrating for those of us that don't do it"
    },
    {
      "id": "ndt8n2g",
      "body": "A rebuttal to this. Cheating is the only way to get an interview in the first place. \n\nWhen the tests are on campus, the shortlists are very familiar. You see the same toppers you know in real life. With a little variation. But You always know they deserved it\n\nWhen the tests are online, you see a random set of people. Mostly complete and absolute muppets. You see people you know can't even reverse a linked list, let alone solve a hard dynamic programming question. \n\nI'd argue that if you're a person who made it though an online OA, you've got a better shot than an interview campus OA. \n\nin the latter you'd be competing in a pool of the best people. In the former you'd be competing against a range of people which makes you look better by comparison"
    },
    {
      "id": "ndta6bj",
      "body": "Your observation is correct. Its definitely going to be easier to get through if your competition is as skilled (or rather not skilled) as you. But that wasn't the intention of my comment. \n\nI just wanted to warn OP that both the company and the placement cell can take actions. Companies aren't required to hire X employees, they can very well choose to *not* hire anyone from PES if they feel that everyone shortlisted is trash. Secondly, if the company does notify the placement cell, they will very surely also escalate matters to the management, which will make things worse for you if you get banned. There could also be other cascading consequences, such as the company reducing/stopping hiring from PES in the future, or you bring blacklisted from the company forever. \n\nIts a risk vs reward scenario. You need to choose whether you're ok with the risk."
    },
    {
      "id": "ndttf62",
      "body": "You're honestly setting a really bad example for your juniors, who are going to face even tougher competition when their placement season arrives. Instead of rewarding them for cheating, you should be telling them how to focus their efforts on actually upskilling. \n\nWhen they approach their placement season, there is a chance you will be on the opposite side of the table, taking interviews. Will you hold the same opinion at that time? Would you encourage cheating to dilute the quality of recruitment at your company? Would you still be ok with someone getting hired into your team through pure cheating in the OAs? As a senior, you should do better. Don't normalize cheating. This is absolutely not the way forward, both career wise and as a human.\n\nBesides, as I said in another comment; you are telling only one side of the story. Getting banned from placements and from said company automatically nulls whatever marginal chances people had."
    },
    {
      "id": "ndu0tnb",
      "body": "It's all a bed of roses rn u will see the reality once u reach 4th year"
    },
    {
      "id": "ndur1og",
      "body": ">You're honestly setting a really bad example for your juniors\n\nEveryone i know who got placed in a company with an online OA cheated. I'm only giving the objective successful examples, good or bad upto them to decide \n\n>Instead of rewarding them for cheating,\n\nAgain, I am not rewarding anyone with anything, the companies are rewarding cheaters with jobs. \n\n>you should be telling them how to focus their efforts on actually upskilling.\n\nI tell them to do both. Cheat in OAs, and study/prepare rigorously for interviews. You only cheat in OAs so you get the opportunity to showcase your skills. \n\n>Will you hold the same opinion at that time? Would you encourage cheating to dilute the quality of recruitment at your company?\n\nAs a recruiter, i would absolutely not want any cheating. But I'd also accept the fact that everyone who I'm interviewing is a cheater. \n\nSo if a guy wasn't getting any shortlists, i would definitely tell him why. Cause he's not cheating. \n\n>As a senior, you should do better. Don't normalize cheating. This is absolutely not the way forward, both career wise and as a human.\n\nCheating is already normal. I'm only asking the small population that don't cheat to be smart and increase their odds of getting shortlisted. \n\n>Getting banned from placements and from said company automatically nulls whatever marginal chances people had.\n\nThis never or very very rarely happens though? and the simple fact that you move your eyes around can't \"prove\" anything. \n\nAnd again, it shows how flawed the cheat detection system is when everyone on the shortlist is a cheater. So anything they find is pretty meaningless. \n\nPeople i know who were using a notebook to solve dsa get the suspicious activity warning, and people who use phones get them too. It's going to be really difficult to prove, and I'm sure companies don't even care to actually screw the kids who have been flagged for suspicious activity, especially when most of them are."
    },
    {
      "id": "ndx9clo",
      "body": "Brother no one has normalised, that’s how the world works, life is unfair, why do you want to play fair?"
    },
    {
      "id": "ndxs8p3",
      "body": "im a first year, and honestly I don't want to cheat, I used to cheat in my unit test In my school in 8th grade, one day my dad got sus of me (it was online classes then), he asked me about it, I regret doing it tht day, and hav never cheated in any exams since then. my question is does offline assessment give me a completely fair shot? (I hv put up a post about it earlier where some seniors shared their exp abt cheating in offline too)if not 100% fair shot, it must be a lot better than OA, and my second q is what is the ratio of online to offline assessments, lets say out 100 companies how many conduct offline and offline, pls can u share ur exp"
    },
    {
      "id": "ndy0us6",
      "body": "Maybe like 70-80% are online. \n\nOffline being fair is like 50-50, sometimes the employees walk around as proctors. But there's been cheating in many companies. Meesho, sap labs, hyperface, netcore, and more."
    },
    {
      "id": "ndy33oo",
      "body": "so I hav 25 % chance of fair shot, lets say my expectation is like min 12lpa base and anything above 16l base I would lock the company right away, I wil be competing with genuine ppl here, if I be in the top 10 % in pesu would it cut for me"
    },
    {
      "id": "ndy9ux6",
      "body": "Generally 25-30% of the cs batch get a 12+ job. \n\n>above 16l base I would lock the company right away\n\nThat's not how it works unfortunately, you should find and read the placement rules on the sub"
    },
    {
      "id": "ndyf0qx",
      "body": "oh, I see, thanks btw!"
    },
    {
      "id": "ndysi61",
      "body": "fuck thats crazy"
    },
    {
      "id": "ndztfjb",
      "body": "Yes it does"
    },
    {
      "id": "neazm6q",
      "body": "Finally some sense! I've passed out from our college long time ago. You will feel that in many rounds that some one got in by luck, you deserved it and what not. Every batch goes through it. But none of that matters you have so many companies coming and you'll land in a great one eventually. Half job is done by getting to PES. Do not lower your standards, prepare and do the best in any test that you are writi g. Getting better is the goal , cheaters never get better. \n\nMore power to you dude. Rooting for your success. I want you to come back and comment your success story here post 2026. I'm sure you'l be a rock star!"
    }
  ]
}