{
  "id": "1nf49go",
  "title": "[Question] Does pes discriminate against kcet students",
  "content": "I've heard that some teachers are careless initially when we're segregated. Also is the scholarship thing applicable to us as well?",
  "metadata": {
    "author": "Spiritual-Air-5550",
    "url": "https://www.reddit.com/r/PESU/comments/1nf49go/question_does_pes_discriminate_against_kcet/",
    "permalink": "/r/PESU/comments/1nf49go/question_does_pes_discriminate_against_kcet/",
    "score": 18,
    "created_utc": 1757686175,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ndtjlxd",
      "body": "No discrimination except  for extra classes for 1st sem , coz u guys joined late.\n\nAnd the profs dont care about anything as long as you are in good terms with them.\n\nFor availing scholarships, you need to pay some extra amount."
    },
    {
      "id": "ndtjpek",
      "body": "guess we gonna find out from monday"
    },
    {
      "id": "ndtnset",
      "body": "Starts on Monday for round 3 students?"
    },
    {
      "id": "ndtpt0i",
      "body": "yeah lol"
    },
    {
      "id": "ndtqjxe",
      "body": "damn, did you get to know from the app? Because for me no one told anything at the campus"
    },
    {
      "id": "ndtqlkh",
      "body": "Yes, you're put into a bird cage and your ISAs/ESA are pen-and-paper only cause you can't afford to pay more unlike the JEE/PESSAT guys /s"
    },
    {
      "id": "ndtqr7i",
      "body": "i asked the teacher in F block, she told me abt that, and that classes schedule will come on the app on sunday"
    },
    {
      "id": "ndtquca",
      "body": "Ahh ok thanks bro"
    },
    {
      "id": "ndtr6vu",
      "body": "I joined through kcet round 3 and i didn't really feel they were careless per say. I mean there are teachers that don't really care but its not cuz we're kcet students... they're just like that to everyone. The scholarship is optional for us. If u want if u gotta pay 10k extra every yr (so basically 40k). For non kcet students its already included in their fees."
    },
    {
      "id": "ndtvr8x",
      "body": "It was never about the money bronana 😈 \nOnly about the principle 😈 "
    },
    {
      "id": "ndtwd15",
      "body": "dont know about the caring part. yes, the scholarship is applicable to kcet students too"
    },
    {
      "id": "ndukk3n",
      "body": "U hardly remember the difference after coming to 2nd year.\nThe only time u will remember it is while paying your tution fee with UPI while PESSAT folks are selling their village farms"
    },
    {
      "id": "ndx72bq",
      "body": "Oh yeah poor kcet kids get out in the shity classrooms, they make yall sit on the floor /s"
    },
    {
      "id": "ne5pq2e",
      "body": "Bruh, whoever told you that. is HIGH AF.  \nIm a KCET student, and we are treated equally well."
    },
    {
      "id": "ne5vwg8",
      "body": "Like this monday or next monday?, cause I haven't got hostel yet, like they said we'll have a briefing session on wednesday so will classes start before this briefing session?"
    }
  ]
}