{
  "id": "1nfuft5",
  "title": "[Question] Top commentors please see this post...",
  "content": "I want to change my clg and come to pes \nIt even possible...\nPlease walk me through the process ..\nI got a seat in nie but .\nThe campus sucks.\nThe staff suck.\nThe people and the atmosphere is soo gloomy I don't even want to go there ...\nI couldn't get any branch in pes .\nMy rank was too low ..\nIs there anyone who did change their clg ..\nplease help me guys..\nTop commentors please see this thread",
  "metadata": {
    "author": "S_r32",
    "url": "https://www.reddit.com/r/PESU/comments/1nfuft5/question_top_commentors_please_see_this_post/",
    "permalink": "/r/PESU/comments/1nfuft5/question_top_commentors_please_see_this_post/",
    "score": 5,
    "created_utc": 1757760510,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ne10dnc",
      "body": "I don't think so you can change it like that. I mean ig there's lateral entry but that's only for diploma students.. you can confirm it with PES management by calling the admission department. Other option remains taking a partial drop and trynna get a good KCET/Mains rank to end up here but I don't think so you should waste a drop year.. if you got North Campus in NIE then ig it should be fine if you're from CSE or related branches placements are decent I heard but if you're in some core branch you might be cooked"
    },
    {
      "id": "ne3nlqo",
      "body": "My clg mangement said u can apply for clg and branch change after first semester when vtu will announce the seat  vacancies later on (if there will be any) he mentioned smtg like u can only get into vtu affiliated clgs and govt aided ones \nSo I think my best shot would be to hope for any vacancies in and outside my clg and hope it all works out ..Also.\nTq for ur time :)"
    },
    {
      "id": "ne58071",
      "body": "pes isn’t VTU affiliated though?"
    },
    {
      "id": "ne5nx5o",
      "body": "It is vtu affiliated but they'll first let ppl from ec campus and their own campus to fill the vacancies ig ..so no real hope for me there"
    },
    {
      "id": "ne5r6ct",
      "body": "nah i’m 100% sure that PES isn’t affiliated to VTU. it a university"
    },
    {
      "id": "ne5tase",
      "body": "Ur right ..i just went through the entire list..\nLooks like I've wasted ur time \n.\nMy bad ."
    },
    {
      "id": "ne6tu6m",
      "body": "No pes isnt vtu affiliated anymore don't even consider seat vacancies as an option"
    }
  ]
}