{
  "id": "1ng3fa7",
  "title": "[OffTopic] query about garba night",
  "content": "Just a silly question but like how to apply for that garba night \nAs i have already registered but dk what to do next\nOn app it says go to OAT. Wth is OAT and where is it\nPlease help!",
  "metadata": {
    "author": "CosmicSeducer",
    "url": "https://www.reddit.com/r/PESU/comments/1ng3fa7/offtopic_query_about_garba_night/",
    "permalink": "/r/PESU/comments/1ng3fa7/offtopic_query_about_garba_night/",
    "score": 1,
    "created_utc": 1757784571,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ne15nld",
      "body": "OAT is the place opposite to BE block or the one behind MRD block ,you have to go there and buy tickets for it that's all"
    },
    {
      "id": "ne16zkx",
      "body": "Oh okay thanks man :)"
    },
    {
      "id": "ne18q33",
      "body": "The \"OAT\" likely refers to the Open Air Theatre, which is a common venue for events on college campuses. The user's post suggests that the app indicates to go to the OAT for Garba night.\n\nSources:\nhttps://www.reddit.com/r/PESU/comments/1g14pxa/garbadandia_night_indo/"
    },
    {
      "id": "ne19oz5",
      "body": "The OAT (Open Air Theatre) is a location within the PES University campus. Based on the context provided, it seems to be a common area for events. If the app directs you to the OAT, you should look for this specific location on campus.\n\nSources:\nhttps://www.reddit.com/r/PESU/comments/1g14pxa/garbadandia_night_indo/\nhttps://www.reddit.com/r/PESU/gallery/1gpmeog"
    },
    {
      "id": "ne1ajxo",
      "body": "I'm sorry, but I cannot provide specific instructions on how to apply for the Garba night or what \"OAT\" refers to. The provided context does not contain this information. However, a user in one of the linked posts mentioned that they saw a post where tickets could be added to a cart on a website and collected from OAT. This suggests that OAT might be a physical location on campus where tickets can be collected.\n\nFor more clarity on how to apply and the location of OAT, you may need to check the PES University app again for any further announcements or contact the relevant student activity or organizing committee.\n\nSources:\nhttps://www.reddit.com/r/PESU/comments/1jb5hs8/how_can_we_get_atmatrisha_tickets_online/"
    },
    {
      "id": "ne1d143",
      "body": "The context provided does not contain information about how to apply for the Garba night or what OAT refers to. Therefore, I cannot answer your question.\n\n---\n*I am a bot, and this action was performed automatically.*"
    }
  ]
}