{
  "id": "1nglqp1",
  "title": "[Rant] Why is ec campus so lame.",
  "content": "TF DO YOU MEAN RR HAD A FAIR. AND THEIR FRESHERS HAVE THEMES. OUR FRESHERS IS SOME STUPID CLUB ORIENTATION. ALL COOL CLUBS ARE THERE AND THEYRE ALL ACTIVE. PLUUS THEYRE DRESSINH UP AS COWBOY WHILE IM STUCK HAVING MELTDOWNS.\nAND THE CLUBS HERE SUUUUUCKK.\nTHE CLASSES HERE SUCK.\nTHE CANTEEN FOOD SUUUCKSS.\nTHERE IS NO DANDIYA NIGHT EITHER IM SURE.\nWHOEVER TOLD ME ITS THE SAME AS RR....\nRICKY WHEN I CATCH YOU RICKY RICKY WHEN I CATCH YOU RICKY .\n3 WEEKS IN AND I WANNA KMS.\n\nOnly hope is that seniors hype us up lowkey.",
  "metadata": {
    "author": "shevlotjsk",
    "url": "https://www.reddit.com/r/PESU/comments/1nglqp1/rant_why_is_ec_campus_so_lame/",
    "permalink": "/r/PESU/comments/1nglqp1/rant_why_is_ec_campus_so_lame/",
    "score": 68,
    "created_utc": 1757838064,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ne4wd1x",
      "body": "Well for tech clubs at least ec>>>>rr. Just because rr has more clubs doesn't mean they are better quality."
    },
    {
      "id": "ne4wjjk",
      "body": "\\+1"
    },
    {
      "id": "ne4x67l",
      "body": "Fr, RR clubs are shit. Even for placements the ratio of EC Campus people is more. Rr fomo is bs."
    },
    {
      "id": "ne4yosn",
      "body": "*inserts ec campus gif*"
    },
    {
      "id": "ne518tf",
      "body": "https://i.redd.it/5158jte9m3pf1.gif"
    },
    {
      "id": "ne52xqu",
      "body": "that's crazy ur not built for pesu"
    },
    {
      "id": "ne53cmf",
      "body": "agreed ^^"
    },
    {
      "id": "ne55g14",
      "body": "Hard disagree on Placementz"
    },
    {
      "id": "ne55gfr",
      "body": "Hard disagree on Placementz"
    },
    {
      "id": "ne55k3m",
      "body": "> WHOEVER TOLD ME ITS THE SAME AS RR....\n\nMe, and everyone else who knows how to differentiate objective vs subjective factors, because nobody said that they're the same in all aspects. Culturally, RR has and will always be richer. You're going to find a much larger variety of clubs, grander and larger fests and more events. EC on the other hand has always been known to have smaller fests and fewer events. This is a well known fact. \n\n> ALL COOL CLUBS ARE THERE AND THEYRE ALL ACTIVE.\n\nBut the quality of clubs (primarily, tech clubs) at ECC are leagues ahead of what exists in RR. When it comes to clubs, where ECC lacks in quantity, it more than enough makes up in quality. You're not going to find a 100 different clubs that hold 1 event throughout a year. Instead you'll find maybe 20 that instead actively meet multiple times a semester. Right now, there's a world of difference, especially if you're someone looking for tech communities."
    },
    {
      "id": "ne55mms",
      "body": "One of the best gifs to be born out of the COVID era in PESU"
    },
    {
      "id": "ne57d9b",
      "body": "Chill maadi and drink black coffee bro"
    },
    {
      "id": "ne587ki",
      "body": "leave pes lowkey"
    },
    {
      "id": "ne58hc3",
      "body": "You'll have a event similar to garba night called Dil se Diwali, plus the tech clubs are far better there, I've spent an year there, fun depends a lot on your company, personally I had a lot of fun there"
    },
    {
      "id": "ne59mzz",
      "body": "Just eat some bun samosa "
    },
    {
      "id": "ne5a495",
      "body": "Agreee i loved and enjoyed my 1 year in ec, it was so fun"
    },
    {
      "id": "ne5cney",
      "body": "Sounds like you’re auditioning for a Karan Johar melodrama, expecting college to be all Dandiya nights and Bollywood vibes! Come out of your delusion prepare for ISA-1 and attend some workshops on Wednesdays. You’re not starring in *Student of the Year* **cowboy.**"
    },
    {
      "id": "ne5iaeb",
      "body": "😭😭 Suitable reply.\n\n![gif](giphy|uQJA39wrz0vJKY37i1|downsized)"
    },
    {
      "id": "ne5knux",
      "body": "ye that is true, acm and hsp are miles better than whatever is offered here at rr"
    },
    {
      "id": "ne5o75c",
      "body": "Yeah, I changed from ecc to rr and can confirm I enjoyed my first year in ecc.\nBoth campuses have their pros and cons, ecc mainly lacks infra and research facilities.\nRr is cramped af and the cse type clubs are kinda dead.\nNgl rr ece clubs are better, be it IEEE Ras or silicon."
    },
    {
      "id": "ne5p5rn",
      "body": "Exactly, EC campus clubs hold the most goated tech events, like game dev workshops, space science workshops and other goated things. Its so sad that many of us in RR can't join them because of time contraints. The tech clubs in ECC are indeed leagues ahead of RR."
    },
    {
      "id": "ne5u8wq",
      "body": "🤓nigga Im sure you wrote this to feel sigma. But idt theres anything wrong in expecting clg life to have some fun. Especially when its other campus falls under the same umbrella but w more life and yet better outcomes w regards to student mental health and placements. No point in coming up with reductionist idelogies to guilt 1st years into pressured study. Act like this then complain why ec campus has more suicides🤡🤡 clg is the only time where people can be a little free and lowkey live. Scratch your itch somewhere else. Delusional my ass"
    },
    {
      "id": "ne5uwj0",
      "body": "Are you sure of this. I joined ec because you said better tech clubs. But there is so much hype into shifting to rr after 1st year that ec campus feels like a dead end.\nSome seniors claimed that all good placements go to rr"
    },
    {
      "id": "ne5vpbz",
      "body": "If you don't believe me, consider the comments from other current students in different years who support my statement about ECC tech clubs being miles ahead. The placements stat is absolutely not true, more students get in from RR, but that is not because interviewers select people from RR (it's been discussed in the FAQs, it's simply down to more people from RR applying for a single company). As for the hype surrounding the shift to RR, many still choose ECC not because of subjective factors that suit them better, but rather because they were unable to get into RR. So they are bound to feel that way. It does not help that people's idea of \"cultural events in colleges\" matches RR's energy rather than EC."
    },
    {
      "id": "ne5w5tn",
      "body": "canteen food is pretty good in ecc idk what ur yapping about.   \nget a sandwich from 5th floor, or go try some shit in MRD.   \nRR food is mid and cost more. It also takes for ever to go the canteen and come back"
    },
    {
      "id": "ne5xj4e",
      "body": "They gave me rancid noodles at mrd after waiting for 40 minutes."
    },
    {
      "id": "ne6380j",
      "body": "To all the juniors who r gonna join next year\nI searched a lot abt all this shit if ecc is the same as RR, trust me it's not worth it time especially not if ur searching all this even before u even appeared to the exam which helps get into this college \n\n\nComing to what op said in his post, the culture at ecc may not be as vibrant but as a fresher I honestly found it good, still too early to say anything but we need to realize there r ppl out there who dream to j come to pes at the first place, the fest's that happ here are way better than other cet colleges in the state and the culture and senior interactions gawdddd it's an experience in itself "
    },
    {
      "id": "ne683hm",
      "body": "If you just wanna enjoy rr campus is for you . \nEC campus folks are built different...."
    },
    {
      "id": "ne6dq4l",
      "body": "I had the worst experience w neural hive bro what are you on. That club has too much politics. PLUS they couldnt even handle as simple of a thing as registrations. Infact they went on blaming others for their incompetence. \nPlus weal looks very inactive in ecc."
    },
    {
      "id": "ne6prnj",
      "body": "bro weren't you the one who got caught trying to scam the organizers and then got kicked out 😭"
    },
    {
      "id": "ne6rb2s",
      "body": "Ok leave neural hive . But weal also organised a hackathon last sem ..."
    },
    {
      "id": "ne6rcpz",
      "body": "Ah no?? I never got in to get kicked out bro"
    },
    {
      "id": "ne79pjx",
      "body": "what did the other person say (kinda curious) ?"
    },
    {
      "id": "ne7fyhp",
      "body": "OP said smth abt the hackathon ig"
    },
    {
      "id": "neah7l3",
      "body": "I agree! Thank God I got into RR..."
    },
    {
      "id": "neb66sa",
      "body": "shouldve gotten better marks"
    }
  ]
}