{
  "id": "1ngqlqt",
  "title": "[Placements] VC and Chancellor mentioned cracking down on cheating in OAs — do you think they’ll follow through?",
  "content": "So the Chancellor and Vice Chancellor recently addressed the cheating going on during the orientation for 3rd years, saying something along the lines of, “Companies have told us about the cheating that’s happening, and we had to put our heads down.”\n\nThey also said they’re going to come down hard on cheaters. Do you all think they’ll actually follow through on their words?",
  "metadata": {
    "author": "Suitable-Cattle-755",
    "url": "https://www.reddit.com/r/PESU/comments/1ngqlqt/placements_vc_and_chancellor_mentioned_cracking/",
    "permalink": "/r/PESU/comments/1ngqlqt/placements_vc_and_chancellor_mentioned_cracking/",
    "score": 43,
    "created_utc": 1757854544,
    "flair": "Placements 🤑",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ne5sc69",
      "body": "If they find an alternative to \"bring your own laptop\" then cheating will be almost 0%."
    },
    {
      "id": "ne5sui5",
      "body": "![gif](giphy|pynZagVcYxVUk)"
    },
    {
      "id": "ne5t8r5",
      "body": "Nope cheating is still going on in almost every OA"
    },
    {
      "id": "ne5tmw9",
      "body": "Why is PES like this? wont companies just stop coming?"
    },
    {
      "id": "ne5tujy",
      "body": "Yep gonna happen if the people who they selected don't meet with their standards"
    },
    {
      "id": "ne5vijx",
      "body": "That and simply have cameras on the college systems, so many people cheat in the exam center too lol, you just need to invigilate the way you would for an ESA/ISA."
    },
    {
      "id": "ne5zxb4",
      "body": "They will at max keep OA in assessment centre, where there is zero proctoring, so most people will copy easily, pes would think they have done something fascinating, but the cheating streak will continue."
    },
    {
      "id": "ne61eny",
      "body": "Why can't they use the systems used for isa/esa?"
    },
    {
      "id": "ne61iio",
      "body": "How do other colleges prevent it?"
    },
    {
      "id": "ne61xxg",
      "body": "It is common in all clg, from many years; Nothing has changed, every year every clg says we will control it this year; It won't change in the future as well; The only way out is changing something to real world application instead of pure dsa."
    },
    {
      "id": "ne66hht",
      "body": "Bro half the people in ibm shortlist cheated wht do u expect lmfao , they don't give a flying fuck , they just want people getting placed , they don't care who"
    },
    {
      "id": "ne66kad",
      "body": "Companies know that cheating happens in oa that's why they keep multiple rounds after it"
    },
    {
      "id": "ne6axj4",
      "body": "They do for many OAs but many at times there is a conflict with the OA and isa / esa schedule"
    },
    {
      "id": "ne6bqgu",
      "body": "If companies want they can prevent cheating in the OAs. I remember for Commvault test last year there was strict attendance taken and the link was only sent to those present in the assessment centre and also there were many ppl from the company like 15-20 people to invigilate in every room. I can guarantee that it would have been impossible to cheat in that OA. If the company is willing to invest resources to stop cheating they can, but most companies want the invigilation to be done by the college which is going to be strictly enforced."
    },
    {
      "id": "ne6c4wt",
      "body": "Yeah that's the reality; And with so much crowd like around 1000 people attending OA, it is impossible for companies or clg to monitor it, so cheating is possible in clg as well"
    },
    {
      "id": "ne6f48e",
      "body": "People will continue cheating. That's not something which you totally crack down on. Karma will take care of them. You do it with honesty."
    },
    {
      "id": "ne6hfz7",
      "body": "Those USB cameras refuse to connect sometimes. Different companies come with different proctoring service providers and all have different issues."
    },
    {
      "id": "ne6tx5s",
      "body": "Maybe they might. Why I am saying this is, if the process of cheating continues and to the extent where companies themselves notice, then it will affect placements largely in coming years. Companies will loose trust on college. Basically the college business goes down"
    },
    {
      "id": "ne81zor",
      "body": "Man IBM shortlist was not fair.\nMost of them fcked their interview failing to answer difference between HTTP vs HTTPs \nAnd for some they asked swapping the variables itseem"
    },
    {
      "id": "neaq57y",
      "body": "nah man, my friend wrote it from home and got shortlisted for the interview too."
    },
    {
      "id": "neaw8ir",
      "body": "Be ready to say the same karma dialogue when you sit for placements and feel like shit when everyone copies and you trying to be right"
    }
  ]
}