{
  "id": "1ngykyv",
  "title": "[Capstone] Phases of capstone project",
  "content": "There are 4 phases of the capstone project. What happens in each of them?",
  "metadata": {
    "author": "RevolutionaryFix7617",
    "url": "https://www.reddit.com/r/PESU/comments/1ngykyv/capstone_phases_of_capstone_project/",
    "permalink": "/r/PESU/comments/1ngykyv/capstone_phases_of_capstone_project/",
    "score": 10,
    "created_utc": 1757873851,
    "flair": "Capstone 🏗️",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ne7o62n",
      "body": "refer FAQs"
    },
    {
      "id": "ne7olmn",
      "body": "**Phase 1 (End of 5th sem - 2 credits)**  \nForm your team and choose a mentor. By the end of this phase, you need to finalize the domain and problem statement for your capstone project.\n\n**Phase 2 (6th sem - 2 credits)**  \nNow that you have a problem statement, this phase is about research. You’ll be expected to do a literature review, read papers related to your problem and pick out what’s useful for your project. You’ll also need to make a presentation covering your findings, a rough project timeline, high-level architecture, and a master class diagram (basically an overview of your project plan). At this stage, you should also start showing some early results, like dataset exploration or basic experiments.\n\n**Summer break (after 6th sem)**  \nYour team should use this time to build a working prototype or at least get solid results that show your project is close to completion.\n\n**Phase 3 (7th sem - 4 credits)**  \nAt the start of the semester, you’ll present a working prototype. Since you won’t have regular classes, the expectation is that you’ll complete your final prototype in this semester. You also need to write and finish your research paper based on the project.\n\n**Phase 4 (8th sem - 4 credits)**  \nThis is the wrap-up stage. You’ll refine your paper and work on getting it published in a journal. Once that’s done, your capstone is complete."
    },
    {
      "id": "ne7td40",
      "body": "How do these credits affect our sgpa tho? Will it be calculated at the end once capstone review/grading is complete?"
    },
    {
      "id": "ne7wcwi",
      "body": "It will reflect in the respective semester's result"
    },
    {
      "id": "ne7xbcz",
      "body": "Since I'm in sem 5 right now 2 creds alloted for capstone how would I be assigned a grade for those creds?"
    },
    {
      "id": "ne7xm9b",
      "body": "Like you will have 2 isa and esa; Your final phase 1 grade will be determined by combination of both; It will reflect in your 5th sem esa results"
    },
    {
      "id": "ne8s6k1",
      "body": "There has been a slight change to this (2027 batch onwards). 7th sem now has 6 credits for capstone instead of 4.\n\nhttps://preview.redd.it/z4uiobhcb7pf1.jpeg?width=1204&format=pjpg&auto=webp&s=9df6706b8e88375641cd17510d568a4dc13e496d"
    },
    {
      "id": "ne9yhae",
      "body": "How will the isa and esa be for capstone?"
    },
    {
      "id": "neawdmv",
      "body": "One of the isa will be with your own guide, you will get full marks for that; The other isa and esa you will have to prepare slides and present it to the panel,  depending on your work and presentation they will give marks"
    },
    {
      "id": "neb3inq",
      "body": "Tf😂 6 credits for just capstone is crazy"
    },
    {
      "id": "nedfmz9",
      "body": "1. Denial  \n2. Anger  \n3. Bargaining  \n4. Depression  \n5. Acceptance"
    },
    {
      "id": "newpqzo",
      "body": "Yeah it's wild, unnecessary pressure for no reason"
    }
  ]
}