{
  "id": "1nhf9l6",
  "title": "[Question] Ec campus kcet r3 guys how many of you are missing the first few days of classes?",
  "content": "I am joining after 2 3 days so how many of you will miss the starting classes and till when r u guys joining? 🥲\n\nBtw which section are you guys pls tell so that even I can have some company 😁",
  "metadata": {
    "author": "Correct-Engineer5178",
    "url": "https://www.reddit.com/r/PESU/comments/1nhf9l6/question_ec_campus_kcet_r3_guys_how_many_of_you/",
    "permalink": "/r/PESU/comments/1nhf9l6/question_ec_campus_kcet_r3_guys_how_many_of_you/",
    "score": 9,
    "created_utc": 1757920863,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "neb4zhl",
      "body": "For first-year students joining PES University through KCET Round 3, especially for the EC campus, here's what you can expect regarding missing initial classes and section allocation:\n\n**Missing the First Few Days of Classes:**\nFor students joining through KCET Round 2 or 3, you will generally not have separate bootstrap programs. Instead, you will join the ongoing schedule and will need to catch up on the syllabus. You can expect to miss approximately one to two weeks' worth of content that you'll have to cover on your own. While some first-year batches might still be undergoing bootstrap activities, those joining late via KCET Round 3 are often integrated directly into the regular class schedule, which can involve daily classes from 8 AM to 4 PM.\n\n**Joining Timeline:**\nThe provided context indicates that the admission procedure for Round 2 and 3 is very similar to Round 1, requiring reporting to the college before a specified deadline. However, it does not provide specific dates or a general timeframe for when KCET Round 3 students are expected to join classes.\n\n**Section Allocation:**\nStudents who join PES University through KCET Round 3 are typically placed into a **different section** compared to those who joined in earlier rounds.\n\nSources:\n\n- https://www.reddit.com/r/PESU/comments/1n226be/question_have_regular_classes_started/\n- https://www.reddit.com/r/PESU/comments/1dwu90v/first_dayweek_at_pes/\n- https://www.reddit.com/r/PESU/comments/1fo6cle/will_the_kcet_round_3_people_be_thrown_straight/\n- https://www.reddit.com/r/PESU/comments/1n3ylu8/questiondoes_people_who_join_from_r3_have/\n\n---\n*I am a bot, and this action was performed automatically.*"
    },
    {
      "id": "neb6x61",
      "body": "Im joining on Thursday, section 1"
    },
    {
      "id": "nebpovb",
      "body": "S section here"
    },
    {
      "id": "necp5rd",
      "body": "Whats your Name?"
    },
    {
      "id": "necy0x3",
      "body": "Urs?"
    },
    {
      "id": "neprbdv",
      "body": "Session s"
    },
    {
      "id": "nepudvh",
      "body": "Same Did you join"
    },
    {
      "id": "neq2pju",
      "body": "Yeah"
    }
  ]
}