{
  "id": "1nhjwma",
  "title": "[Question] Exams at pesu??",
  "content": "How are exams conducted for isa1 (phy cycle)? and how many marks should I target(out of 40) for s grade (9.5+)??",
  "metadata": {
    "author": "SadChannel9943",
    "url": "https://www.reddit.com/r/PESU/comments/1nhjwma/question_exams_at_pesu/",
    "permalink": "/r/PESU/comments/1nhjwma/question_exams_at_pesu/",
    "score": 7,
    "created_utc": 1757937719,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "nec6h37",
      "body": "For physics, we had one really hard ISA and one okayish one. Understand each topic in depth because no questions in physics is asked directly and practice a lot of questions. They can literally ask anything even remotely related to the topics.\n\nMechanical is a lot of theory, but iirc unit 1 and 2 had a few numericals so those came for us in 4 markers (literally copy paste from slides lol), most mcqs will be theory tho. Can't do anything, but by heart unfortunately.\n\nEEE is probably the easiest, some theory questions for mcq can come but most will be numericals. Use Krithika's slides to prepare. \n\nDo a lot of questions for math, the 4 markers are usually pretty lengthy, and at least 1 4 marker will be difficult. I would recommend doing cw problems, assignment questions, and some tb questions. CW problems are a must tho.\n\nFor python, they sent us slides with mcqs that was harder than the actual isa, but it helped a ton, so look out for that. I also used [these](https://www.sanfoundry.com) for extra mcqs. They might ask some weird questions in the mcqs, but 4 markers will be pretty straightforward.\n\nIf you want 9.5+ sgpa, target 35+ in the ISAs. Ideally, you would want at least a 45 or higher in your final ISA + Assignment scores for a safe bet of 9.5+\n\nHope this helps!"
    },
    {
      "id": "nec97cb",
      "body": "Is there any other type of slides beside what they show in class or is that it plus any book guide recommendations? Or any yt channel"
    },
    {
      "id": "necarf6",
      "body": "Some teachers use different slides compared to the pesu slides, but pesu slides and notes are good enough. You don’t need any textbooks for phy cycle, for math 1 I used grewal as some questions were good. For physics, it was mainly pesu notes + chatgpt. Didn’t really use yt to study"
    },
    {
      "id": "necfydq",
      "body": "Can you please send the krithika's slides for EEE?"
    },
    {
      "id": "necge1i",
      "body": "It’s on the pesu discord server"
    }
  ]
}