{
  "id": "1nj0edb",
  "title": "[Rant] why is the '29 batch so anti-social",
  "content": "So I am fresher and all my classmates are literal NPCs . Even on the WhatsApp grp all I find is the seniors talking. And the discord server for our batch also seems very dead. \nAlso I kinda liked one of my classmate but how do I approach him without sounding like a creep.",
  "metadata": {
    "author": "Designer-Ad-1581",
    "url": "https://www.reddit.com/r/PESU/comments/1nj0edb/rant_why_is_the_29_batch_so_antisocial/",
    "permalink": "/r/PESU/comments/1nj0edb/rant_why_is_the_29_batch_so_antisocial/",
    "score": 52,
    "created_utc": 1758073842,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "nemvjot",
      "body": "if ur in jee batch\n\nthats weird as hell\n\nif ur in kcet batch\n\nits been 2 days bro give it time"
    },
    {
      "id": "nemyzcp",
      "body": "Its just 2 days bruhh"
    },
    {
      "id": "nen0gy3",
      "body": "Nigga i bet ur scholarship cutoffs will skyrocket"
    },
    {
      "id": "nen13ru",
      "body": "Is thera a group ?? Add me brooo 😒"
    },
    {
      "id": "nen26hu",
      "body": "Lmao"
    },
    {
      "id": "nenbsx3",
      "body": "Kcet batch? Lol"
    },
    {
      "id": "nenc3jq",
      "body": "What fucking group??"
    },
    {
      "id": "nencygq",
      "body": "off topic but what's the cutoff in JEE for CSE at rr campus ? I'll be giving jee next year"
    },
    {
      "id": "nend19v",
      "body": "i thought I was the only one who felt like that, no one in my class speaks to each other\nMaybe us 2 loners can get along🙏\nDm me ur class if  ur fine w it"
    },
    {
      "id": "nenf69d",
      "body": "What growing up during COVID does to the iPad generation"
    },
    {
      "id": "nenrttb",
      "body": "Add me too"
    },
    {
      "id": "nenyd1v",
      "body": "If no one is talkiing you go and start the conversation."
    },
    {
      "id": "neoe3r6",
      "body": "Aiml closed at around 92 percentile"
    },
    {
      "id": "neoet3q",
      "body": "thanks ! and I heard that cutoffs will go higher next year is it true ?"
    },
    {
      "id": "neof4sv",
      "body": "Most probably....as someone said earlier in this sub , get above 95percentile and you're good to go"
    },
    {
      "id": "neof7j0",
      "body": "okay sir, thanks a lot !"
    },
    {
      "id": "neooi2i",
      "body": "covid was the best time of our lives, I hope it comes back tbh"
    },
    {
      "id": "neooixe",
      "body": "my*"
    },
    {
      "id": "neosgrx",
      "body": "See, what happens is all are motivated rn. Wait till the results of ISA1 to come... People will be active again on WA, Discord everywhere. This is what I feel.\n\nAbout your second question, What you do is, say hi to him whenever you see him and he too sees back. After a few days of hi, just ask him how's his studies are going on. Talk about teachers, HWs, etc...( and if he's \na bit of a social media guy, you can also discuss about your first question too) And voila! You became his friend without looking like a creep."
    },
    {
      "id": "neosvy4",
      "body": "Nothing fun about being locked inside during the mslr formative years of your lives when you're meant to socialise outside, be exposed to a hundred different things, learn how the world works and grow"
    },
    {
      "id": "neox8xc",
      "body": "Dude in what class are you? Kcet 3rd round class? What Session? \nI know right , everybody seems to be nerdy , no socializing. They just introduce themselves and ask few questions abt us that's it. And classes started the first day itself. \nDm me if you want to be friends."
    },
    {
      "id": "neq3ytj",
      "body": "Omgg same. In my class, in WhatsApp group everyone is super active, but when in class literally zilch. NO TALK. 😭"
    },
    {
      "id": "neq53z6",
      "body": "If u wanna approach a guy, as long as he single he won't find it creepy if u approach him just dont be acting weird and it's pretty chill"
    },
    {
      "id": "neqgys0",
      "body": "Ya bro its so true"
    },
    {
      "id": "newax8r",
      "body": "ngl depends on your class really, there are 65 ppl, shld be enough to find atleast 3 good ones lmao\n\nhowever it is relatable, majority of my class people ARE npcs, sadly. but keep looking, im sure you'll find people\n\nclubs is also a great place to find people"
    },
    {
      "id": "nfdvnbt",
      "body": "takes some time. wait for some weeks but you can't expect them to come walking to you. You start the convo they might carry it"
    },
    {
      "id": "nflh7sx",
      "body": "Ahhh sammee! I have been socialising left and right but no one really reciprocates the energy so I gave up now. 😭😭"
    }
  ]
}