{
  "id": "1njc4yk",
  "title": "[Rant] STOP BEING SO LOUD IN THE LIBRARY",
  "content": "I don’t even get peace in the hostel, and when I come to the library so I can study for these shitass exams, I see assholes talking at full volume like they’re in a fucking fishmarket\n\nGO OUTSIDE if you want to speak your stupid bullshit. There are so empty classrooms  after lunch break, yet you drag your loud, annoying asses here with your friends, boyfriends, girlfriends, or whatever the fuck pathetic group you roll in, acting like this place is some goddamn cafe.\n\nThis is a  LIBRARY, not your barnyard or personal playground. SHUT THE FUCK UP or get the hell out\n",
  "metadata": {
    "author": "BraveCase5975",
    "url": "https://www.reddit.com/r/PESU/comments/1njc4yk/rant_stop_being_so_loud_in_the_library/",
    "permalink": "/r/PESU/comments/1njc4yk/rant_stop_being_so_loud_in_the_library/",
    "score": 94,
    "created_utc": 1758113098,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "nep2yys",
      "body": "I’m tired of telling people to shut their mouths.. despite me telling, they continue to talk. \n\nCame to a conclusion that these bunch of “kids” will remain as “brainless idiots” and no point trying to tell them to be quiet. I have learnt to adjust to such kids"
    },
    {
      "id": "nep67ui",
      "body": "So real man."
    },
    {
      "id": "nepcfnt",
      "body": "i know man, get a good anc earphone they help a lot"
    },
    {
      "id": "nepm5ye",
      "body": "I yelled at 2 kinds.of such people in this week. These people will only be willing to listen if you publicly humiliate them. Otherwise, they have no remorse whatsoever"
    },
    {
      "id": "nepolrp",
      "body": "Cry about it lil bish😈"
    },
    {
      "id": "nepsm10",
      "body": "Clear your backs lil bro💔"
    },
    {
      "id": "nepwapz",
      "body": "3rd year btw 💔💔"
    },
    {
      "id": "nepxtpw",
      "body": "So true.\nEven silent reflections."
    },
    {
      "id": "neq040w",
      "body": "People forget the whole point of a library. If u wanna talk or have a group discussion go to the discussion room or canteen. "
    },
    {
      "id": "neq5e92",
      "body": "Op this happened with you at RR or EC today?"
    },
    {
      "id": "neq7inz",
      "body": "that's what I am doing but kind of getting ear pain :(. There's always a good and bad thing about something"
    },
    {
      "id": "nerboa5",
      "body": "And yesterday due to that freshers djb noise  thing 70% of them in central library who were studying for isas left"
    },
    {
      "id": "nex2jpm",
      "body": "there are silent areas in the library where they regularly enforce noise rules, also silent reflections is usally monitored for noise, in my experience, those places are better for quiet study sessions than the library"
    }
  ]
}