{
  "id": "1njhhuu",
  "title": "[Placements] Egnyte Interview Shortlist",
  "content": "We got the interview Shortlist of Egnyte company,   \nIn the OA, two coding questions and a SQL question was given, I had solved all three questions and passed all the test cases, and 10 Aptitude MCQs were given, and i was confident about my answers in almost all of them, still did not get shortlist for interviews,\n\nWhat else other than this needs to be done to get to interviews, Its already mid of September and i have not even faced a single interview till now.\n\nSeniors, any tips or suggestions, ",
  "metadata": {
    "author": "Immediate_Gold_2218",
    "url": "https://www.reddit.com/r/PESU/comments/1njhhuu/placements_egnyte_interview_shortlist/",
    "permalink": "/r/PESU/comments/1njhhuu/placements_egnyte_interview_shortlist/",
    "score": 37,
    "created_utc": 1758125622,
    "flair": "Placements 🤑",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "neq8fei",
      "body": "Saw the people who got shortlisted, dw there’s nothing wrong with you , it’s just people who cheated and did it better , you gotta start doing it as well if you wanna stand a chance , no other option"
    },
    {
      "id": "neq8q3b",
      "body": "Yeah!"
    },
    {
      "id": "neq9ir2",
      "body": "The people who are cheating they are also not getting shortlisted.   \nIdk how the companies are shortlisting"
    },
    {
      "id": "neq9olk",
      "body": "It's screwed up. The cheaters go to interviews only to screw up and waste everyone's time. \n\nTrust me, if you're good you'll get a job after 1-3 interviews max. Atleast that's what I noticed among the people I know. \n\nIf you're shit you won't get shit. I know a guy who cheats in God knows what way, but he got like 6+ interviews or so. Somehow messed up everything"
    },
    {
      "id": "neq9uok",
      "body": "Same here"
    },
    {
      "id": "neqajfx",
      "body": "Most are cheating so it’s just whoever’s cheating quicker and also some companies do use ai checkers so whoever is changing the code better is getting selected"
    },
    {
      "id": "neqapot",
      "body": "Did better in what? I faced the same issue in ibm. Passed all the best cases still couldn't get shortlisted."
    },
    {
      "id": "neqaz2d",
      "body": "Did better means : \n1) quicker \n2) changed code to avoid ai checkers if ai checkers were used"
    },
    {
      "id": "neqbfts",
      "body": "Quicker isn't criteria afaik. Coz I know few people who couldn't even pass some test cases and got shortlisted"
    },
    {
      "id": "neqbkgj",
      "body": "Know who you are talking about 👀😭"
    },
    {
      "id": "neqc9ic",
      "body": "Some companies use ai checkers heavily eliminating most, so in those cases that could happen"
    },
    {
      "id": "neqcy3z",
      "body": "Yeah makes sense"
    },
    {
      "id": "neqk906",
      "body": "I know who you are talking aboutt!!!"
    },
    {
      "id": "neqkci0",
      "body": "Speed and Plagiarism"
    },
    {
      "id": "neusyj6",
      "body": "Isnt this an ec campus guy😭"
    },
    {
      "id": "newi2y8",
      "body": "Ask your family or relatives for internships. It was cooked our time and would be even bad this year"
    },
    {
      "id": "nexsssw",
      "body": "Which batch are you from......"
    },
    {
      "id": "nf2ateg",
      "body": "2025"
    },
    {
      "id": "nf3vj57",
      "body": "get better. stop blaming other people."
    },
    {
      "id": "nf424ml",
      "body": "tch tch tch "
    },
    {
      "id": "nf42n2b",
      "body": "Where exactly was the blame element in the post....just wanted to know where things went wrong and where improvement can be done!.......what extra can be done to ensure shortlisting!......"
    },
    {
      "id": "nf447y9",
      "body": "i was just going against the general vibe in the comment section lmao. \n\nkeep trying without doubting urself man. all the best."
    },
    {
      "id": "nf44rl4",
      "body": "don't you \"tch tch tch\" me."
    },
    {
      "id": "nf45m9l",
      "body": "Cool!\nAll the best to you too!"
    }
  ]
}