{
  "id": "1njiwau",
  "title": "[Placements]What is this IBM list omg",
  "content": "100 percent diversity hiring is crazy, what was the point of taking 120 odd people for interview and give the job to just 9 and that too just diversity, wasting everyone’s time and energy, after having so much hope in ibm for mass hiring , this is what it amounts to ?",
  "metadata": {
    "author": "Revolutionary-Fox794",
    "url": "https://www.reddit.com/r/PESU/comments/1njiwau/placementswhat_is_this_ibm_list_omg/",
    "permalink": "/r/PESU/comments/1njiwau/placementswhat_is_this_ibm_list_omg/",
    "score": 74,
    "created_utc": 1758128704,
    "flair": "Placements 🤑",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "neqicuq",
      "body": "Can you dm me the list"
    },
    {
      "id": "neqj2jn",
      "body": "2 boys ?(but yes scam shortlist)"
    },
    {
      "id": "neqja0i",
      "body": "My bad , thought that was a girls name 😭"
    },
    {
      "id": "neqjdcd",
      "body": "What makes you think they were hired for diversity? Maybe they did great in the interviews"
    },
    {
      "id": "neqjzoh",
      "body": "1) the way they gendered male as non diversity and female as diversity in the initial list \n2) i have a few friends who said they had flawless interviews, and were very confident \n3) 2:7 is a very skewed ratio as it is"
    },
    {
      "id": "neqk1zf",
      "body": "when there was a colum dedicated for diversity/non diversity we know where its headed"
    },
    {
      "id": "neqkr5x",
      "body": "Remember that's what you get if almost everyone copies 💀😭"
    },
    {
      "id": "neqkxdb",
      "body": "These companies gotta start doing it offline only man , literally a lose lose situation when they do it online"
    },
    {
      "id": "neqlkkt",
      "body": "\nBruh out of 40 who from whom the biometrics were taken only 9-10 were girls and selecting 7 out of them and 2 out of 30 man… really at this point you could have just made this only female hiring and made your job easy instead of giving hope to all em literally this is the worst it can get"
    },
    {
      "id": "neqmsyr",
      "body": "Companies will always have a diversity hiring quota. You can't fight it. While it sounds unethical in 2025, it's the only way to un-skew the ratio in the IT industry which has historically always been biased towards men and barely given women the same opportunities to succeed. 90% of the workforce is still dominated by men in all fields, this is the only way to correct the wrong. \n\nAs for (2), diversity hiring aside, that's the difference between absolute and relative performance. It doesn't only matter how you did in your own interview. How you did relative to the other candidates matters too."
    },
    {
      "id": "neqn1w6",
      "body": "Even in offline most people have started to copy in one or the other way; The number of people copying decrease that's it, it won't become zero even if it is held offline; Only luck matters now."
    },
    {
      "id": "neqn251",
      "body": "Really? That seems awfully unlikely, and honestly I don't understand why people lie about it when it's so apparent. \n\nHere's some interesting facts \n\n1. There's many many more boys than girls. \n2. They literally put the word \"diversity\" next to every female, and \"non-diversity\" next to every guy's name. \n3. 42 people passed the hr round, and ibm took their biometrics. \n4. About 10-max 15 of the 42 were girls \n5. They finally selected 10 people for the job. Of which 8 were girls. \n\nI don't know how much more you need to convince you of the obvious. \n\nIs there anything that can convince you other than ibm literally sending out an email saying \"yes we chose you cause of your sex\"?"
    },
    {
      "id": "neqogyl",
      "body": "Yea but when the diversity hiring only happens in lower tier colleges and not in iits and nits , it stings a lil , not saying I wouldn’t do the same thing if I was in the company’s position, diversity inclusion should be in opportunities not outright like this. \nLeaving all that aside , I am prepared for diversity hiring but I am more surprised that they interviewed 120 and hired 9"
    },
    {
      "id": "neqoj28",
      "body": "Ong man"
    },
    {
      "id": "neqokgp",
      "body": "Bro I literally told yall , at least in Manipal they were outright honest by not allowing any male candidates to sit 😭"
    },
    {
      "id": "neqp0y2",
      "body": "I got into the interview round and I didn’t copy,my OA was genuinely easy.The interview process was shite.They came for three roles systems engineer,cloud engineer and software dev.\n\nYou didn’t get to pick which role you got interviewed for,I had the unfortunate luck of getting a systems interviewer who didn’t know much of else,I was straight up asked “design a distributed memory management system in C,you have to write your own implementation of Malloc and Free,your only input is one Malloc pointer to 20GB” which is an INSANE question.\n\nOther folks had easy interviews and I’d say a lot of people passed through,most people got 4 DSA questions and CS basics,I understand you’d think that people copied and didn’t get through but it’s just luck."
    },
    {
      "id": "neqp3ll",
      "body": "And the college is not helping AT ALL:\n1) they caught a lot of ppl through id card scanning who wrote sap at home and still got selected. They still let the ones who were caught sit for interviews.\n2) they caught a girl writing goto oa from library , made her write apology letter, and still let her sit for the placement and she got the job as well 🤣🤣🤣"
    },
    {
      "id": "neqp8no",
      "body": "😭😭😭so much better , just save your time and energy"
    },
    {
      "id": "neqplnn",
      "body": "I disagree with the reasoning as to why you think it's needed, but I'm not here to argue. \n\nJust glad to see it atleast being acknowledged. It's so much more annoying when people deny diversity hiring exists.\n\nThe company can literally tell men to not even apply, and there's still going to be people who say diversity hiring is a myth, and the best were chosen. \n\nA girl even told me that some companies reject men cause they're biologically inferior in communication and teamwork. And it's basically like a gpa shortlist. \n\nIt's a garbage clown world out there, there's no hope left"
    },
    {
      "id": "neqpqj7",
      "body": "Bro even I was asked the same questions"
    },
    {
      "id": "neqprcl",
      "body": "That's actually the usual ratio of hires. Even back in my time, most companies would interview ~100 and hire about 10-15. Last year was an anomaly, it would be unwise for anyone to expect 150 hires at a single company."
    },
    {
      "id": "neqqoh2",
      "body": "Bro it's not their fault , more than 3/4th of the list has copied , who do they have left to mass hire Lmao"
    },
    {
      "id": "neqqv0k",
      "body": "Pls dm the list"
    },
    {
      "id": "neqr6eu",
      "body": "Not what I’m seeing this year most companies were hiring I in 4 or 1 in 5."
    },
    {
      "id": "neqr9xh",
      "body": "Fair but their fault for keeping it online 😭 im just coping atp"
    },
    {
      "id": "neqrunk",
      "body": "Again, you still haven't seen the workforce and how male-dominated it is. Inclusivity is important, and if you understood that, you'd also understand that companies need to take measures to implement it. Increasing the number of women being hired is the only way to balance the ratio, when historically it's always been men who have gotten hired. How else would you balance a ratio which is skewed? Fire the men lmao? That's a lawsuit. \n\nDiversity hiring definitely exists. And for a very good reason, and it's here to stay. And as a man, it's something I will 100% support. If you think it's not required, it's simply because you and everyone else in our generation simply didn't experience any bias against us based on our gender, unlike the generations before us. So no, demanding equal opportunities now doesn't actually make things equal, since it doesn't actually fix the mistakes made earlier. \n\nHowever, having said that, it's wrong that sometimes, companies make it obvious, sometimes, it's hidden from us. And that's where I agree with you that companies need to be more honest and upfront about this, since it wastes time/energy/resources of both parties. \n\nDiversity hiring is a good thing. It's not a \"garbage clown world\" move. If this feels like an inconvenience for you, you're just getting to feel how women felt years ago."
    },
    {
      "id": "neqsc2t",
      "body": "Most of the offline tests it's the same situation; There is no difference in offline and online at this point, people who are cheating properly are getting shortlisted that's it"
    },
    {
      "id": "neqsgqb",
      "body": "The market is still self correcting, can't expect more. If not the market, the cheating has also affected recruiting strategies. I think it was today or yesterday that I saw a post on the BMS subreddit that their placement cell released a list of companies that had blacklisted their College because of incidents of cheating (again supporting my opinion that you shouldn't cheat)."
    },
    {
      "id": "neqt229",
      "body": "I agree, things have gotten pretty bad lately with regard to cheating"
    },
    {
      "id": "neqth89",
      "body": "It's an international problem, not just in India. My friends and I have the same discussions here in the US as well. It's getting pretty damn difficult to keep up with peers who are cheating through tests, and the added visa + work authorization filters don't make life any easier."
    },
    {
      "id": "neqtqvx",
      "body": "Is there any reason PES doesn't like keeping these tests offline? I thought that the new building/infra they would have the resources?"
    },
    {
      "id": "nequlmf",
      "body": "The college literally can’t handle everyone taking the test at once. The 2026 batch is the first with AIML so there are way more students than they have space for"
    },
    {
      "id": "nequuv7",
      "body": "if its offline, ppl in PG can sit there and write and scam easily. does not make much of a difference"
    },
    {
      "id": "nequvwo",
      "body": "Any idea how colleges like VIT are handling placements? Because I'm sure there are colleges which have an even larger intake"
    },
    {
      "id": "nequxzt",
      "body": "How come not a single person interviewed in MCA lab make it to the list?  \nwhat kind of a scam is this?"
    },
    {
      "id": "nequynr",
      "body": "It is a lil weird cuz natwest had a 1000 ppl writing it , they kept it offline across three different test centers , but many companies which had 100s writing kept it online , i think its more of the companies choice than college’s"
    },
    {
      "id": "neqv5ft",
      "body": "I really hope those who are cheating their way through everything get caught in their own web but it doesn’t look like it’s happening"
    },
    {
      "id": "neqv7z8",
      "body": "Why is it important? Why is it that a company doesn't hire the better person, but rather hires a person with the \"correct\" genitalia?\n\nPlease enlighten us.\n\n>Inclusivity is important, and if you understood that,\nPlease help us understand that. \n\nWhat does a woman contribute just by virtue of being a woman?\n\ncompanies want larger profits. And why would anyone looking for profits, actively choose worse employees?\n\nThey do it for good pr and better ESG scores. That's my reasoning. The hypothetical difference in value between the man rejected, and woman accepted is going to be covered in pr, and ESG. \n\nI'm interested in hearing yours. Why are you such a cuck that you'd be happy and \"100% supporting\" of a woman getting a job over you solely due to sex?\n\nIt's sad how society can make the people getting screwed over think they deserve it, and you're living proof of it. Keep it up champ"
    },
    {
      "id": "neqvggu",
      "body": "Yea even that is happening , but it’s still a much better probability of getting selected than online"
    },
    {
      "id": "neqvm19",
      "body": "Damn. Blatantly labelling candidates as diversity hiring is just embarrassing for everyone involved, including those who got selected"
    },
    {
      "id": "neqvn8l",
      "body": "Here’s a cleaner version of your sentence:\n\n\n\nMost companies prefer keeping the tests offline to prevent cheating"
    },
    {
      "id": "neqvogf",
      "body": "Idk how the interviews happened , but if only 9 got in out of 120 , I think it could be a mere coincidence"
    },
    {
      "id": "neqvwcu",
      "body": "That’s not what’s happening tho , there have been way more online tests than offline"
    },
    {
      "id": "neqvzjy",
      "body": "All the vtu colleges ik are having it offline , the so called iit/stanford of bengaluru this shit show is happening"
    },
    {
      "id": "neqwx17",
      "body": "A lot of people shit on VIT but they generally seem to handle placements well\n\nthey have bigger halls, more labs, and they're used to huge batches. PES has fewer facilities."
    },
    {
      "id": "neqxg8j",
      "body": "Yep , their labs and classrooms look ancient but they know how to handle crowd and they have surplus staff"
    },
    {
      "id": "neqy632",
      "body": "Most people like having some women in the team. There may not be any business or profit related justification for diversity hiring, but employees would rather have some ladies in the team rather than it being a complete sausage fest.\n\nI had the same opinion as you in college, but my opinion has shifted now that I have a few years of experience"
    },
    {
      "id": "neqyfxm",
      "body": ">companies want larger profits. And why would anyone looking for profits, actively choose worse employees\n\n\nCompanies in India get tax benefits for hiring more women. The main reason they like to do diversity hiring is for profit"
    },
    {
      "id": "neqyirf",
      "body": "Are people only cheating in OAs or during interviews too?"
    },
    {
      "id": "ner2m50",
      "body": "Because you're being a dick to me and women actively trying to find their place amongst men in a male-dominated field, let me break it down for you, because you clearly do not know what diversity hiring is about. I'm not going to respond to any more comments to this, at least from you, cause you are clearly not a human worth my time and effort.\n\n\\---\n\n  \nSTEM fields have been male-dominated for decades, not because men are inherently better (which you wildly and blatantly assume), but because systemic barriers made it harder for women (and other groups) to get the same opportunities: networking, mentorship, hiring, promotions, etc. Diversity hiring isn’t about hiring \"unqualified\" people, but rather, it’s about ensuring qualified candidates from all *backgrounds* have a fair shot, and fixing decades of systemic bias. Women have historically been denied these opportunities, and ignoring that history doesn’t make the field fair; it preserves inequality without a solution.\n\nWhen a company prioritizes diversity, they are usually still hiring highly competent people *within* that group (or at least that is the aim; I am going to ignore the cheating problem here since it's not relevant to our discussion). Diverse teams are better because different perspectives spark innovation, challenge existing assumptions, prevent groupthink, and improve problem-solving. They create more user-friendly, inclusive products and make better decisions overall. All of these help the company way more than you think. \n\nAlso, calling me a “cuck” for supporting women getting fair opportunities is pathetic. Supporting fairness, correcting unfir bias, and recognizing competence isn’t weakness, it’s called having principles and common sense. Throwing insults doesn’t make your argument stronger; it just exposes how entitled and insecure you are about the topic. The fact that you see it as some kind of threat shows exactly why diversity hiring is needed. Despite you claiming that you want the better person to be hired, you lose your cool when a man actually backs equality. This is the kind of bias and stereotype that diversity hiring aims to fix.\n\nIf you feel this is unfair, congratulations, buddy! You’re now getting a tiny taste of what women have been dealing with for decades. And seriously, do better. I hope nobody looks up to you as a mentor, because no matter how skilled you are at LC or your job, you’re a complete garbage human being. Complain about diversity hiring all you want, but it exists precisely because of people like you in the past: entitled, self-absorbed, and oblivious, who made it necessary in the first place."
    },
    {
      "id": "ner2syo",
      "body": "They either get fucked over in interviews, or they struggle in their role. Either way, it catches up sooner or later. The issue is that this happens a little too late."
    },
    {
      "id": "ner2xlo",
      "body": "Yep , and at the cost of others"
    },
    {
      "id": "ner3h68",
      "body": "OAs, definitely. Interviews, not sure. Cameras are always on during interviews here, so it does drastically reduce the ability to cheat. But of course, if cheaters are determined I am sure they will find a way out. One of the jokes in my friend circle is that cheaters are even better at cheating than we are at ML/SWE (since we are applying for these roles) lol."
    },
    {
      "id": "ner3mtd",
      "body": "Yes, I'm from 2025 and I remember it being quite similar for our batch too. There were two domains- Data and AI and Automation. The interviewers in automation were quite strict, but a friend in Data and AI literally got asked HR questions. If it makes you feel any better, a LOT of people who got into IBM got approached after the initial selection. Don't bank on it but keep it in mind too."
    },
    {
      "id": "ner6fia",
      "body": "I'm a girl and I have a relative from a core engineering background and those domains genuinely need more women.\n\nI'd say to some extent it's also the same for women in CS too, but it's not the same way it is in core engineering. In fact, girls are interested in CS. The efforts should instead be redirected towards retaining women in CS- being more understanding about periods, supporting women through changing priorities, pregnancies and so on. I remember my grandfather(who's quite liberal; my mother works full-time) telling me that a man's career goes on until he's forced to retire due to age. A woman's career goes on until she's forced to retire because she can't take it anymore because she's effectively juggling two jobs at once. \n\nA lot of girls get branded as diversity hires even if they worked their ass off for a job. If it's not outright stated, people still assume that \"all the guys got filtered out in the earlier stages\". We don't like it either."
    },
    {
      "id": "nera39o",
      "body": "The PPL who interviewed students in MCA went home at around 4:30-5 and then other batch interviewers probably made the final call on whom to shortlist and they chose everyone from the batch they interviewed.\nI bet that among the 42 PPL who were shortlisted for biometrics none of them had their previous round in MCA"
    },
    {
      "id": "nerb65h",
      "body": "I understand, there's tons of girls who worked just as hard for a job. I'm not trying to say women are inherently worse, or better. I'm just saying sex based discrimination is wrong, and it takes a morally bankrupt person to do it. \n\nLet's take the ibm situation \n\n1. There's many many more boys than girls in the college. \n2. They literally put the word \"diversity\" next to every female, and \"non-diversity\" next to every guy's name. \n3. 42 people passed the hr round, and ibm took their biometrics. \n4. About 10 (max 15) of the 42 were girls \n5. They finally selected 10 people for the job. Of which 8 were girls. \n\nany reasonable person can see it. And it's very very common. \n\nEven a 50-50 hire is definitely discrimination cause the vast majority of applications were from men. \n\npeople still \"assume\" that cause that's what's going on. Men are actively being discriminated against. How can you have any closure that the hiring was fair when your application literally has \"non-diversity\" attached to it?\n\nObviously every woman ever hired wasn't a diversity hire, but right now a good number are. And all I'll say is that for a lot of illogical people, this will be a source of resentment towards women. \n\nAnd before the whiners call me names, I don't blame the women being diversity hires. We should all take the opportunities given to us regardless of how we get them. I resent the people giving out the special treatment, not the ones getting it."
    },
    {
      "id": "nere4li",
      "body": "Yeah, creeps like you need someone to ogle at. No wonder posh is exists."
    },
    {
      "id": "nerer2y",
      "body": "Same MO. It's not diversity hiring and if it was, here's my long para on why it's needed."
    },
    {
      "id": "nerf6ej",
      "body": "I've realised all the 3 things are needed to get placed here essentially 80% based on luck.\n1. Getting Interview (specially after an online OA)\n2. Getting a good interviewer\n3. The company actually wants to hire like 5-10 ppl"
    },
    {
      "id": "nerg0k8",
      "body": "Are these guys labelling every women hired by any company as diversity hire - could possibly be. Or is it only for ibm."
    },
    {
      "id": "nerga40",
      "body": "Grow up. Not everything is sexual."
    },
    {
      "id": "nergts0",
      "body": "This diversity hiring is always a curse for the current workforce. I passed out from pes when there was no such hiring, and even then, most women got placed. So, this diversity based hiring is not needed for the actual talented women to get placed. What you see now in your campus placements is just the tip of the iceberg. At your actual workplace, this diversity based promotion is even worse, and you will get to see how women use this to their advantage. What this also does is it allows other women in the company to not put in their 100% as they still know they will be promoted just to meet the quota. Go to any organization and ask the guys who work there, and I can bet you that almost 80% of them would have been screwed by this diversity in some way or the other. I don't even understand some of these comments justifying it by telling that you need different views etc and that is why this is done. When plane's, cars, rockets were built, no one wanted these different views, but all they wanted was talented engineers. What needs to be done is to have policies in the organization where discrimination is not allowed. But they won't do that and do diversity based hiring or promotions as that is just easy PR for the companies now. But I can bet you when things come crashing down, then the companies will realize who the true engineers are and at that time they won't look if it's a male or female but just hire the right candidate."
    },
    {
      "id": "nerhhtb",
      "body": "I don't get why anyone would type out essays for IBM. IBM is known for it and they are doing it as well. Just accept it and move on, don't think it would make everyone this mad. \n\nI don't think these guys have the same reaction for other companies as well. So a lot of girls aren't getting branded as diversity hires."
    },
    {
      "id": "nerjg96",
      "body": "I advice you to re-read your comment again. Anyways appreciate you for being direct instead of typing out the boilerplate text. Those who are enraged in this current post are most probably going down your path."
    },
    {
      "id": "nersznc",
      "body": "bro respecfully what does systemic barriers actually mean, please lemme know, bro i can name people who actually did'nt do shit in the whole college and in that list, so when you see this happening people generally get frustrated, and bro like unqualified people were hired take it  from me, and also some of them are great I know them personally, and then companies like google do hire competent people be it girls or boys but these  companies like ibm they set the bar lower, and bro like diverse people make grea discussions I don't knwo bro i feel that competency comes from your own ability, if the student can't pass the exam and you have a quota for them, then does'nt mean you  make the paper easy for them, you need to improve ability and people with that ability get frustrated because they knew it, that they have the ability to do it, and they were not taken, and bro like you were talking about discrimination against girls, bro you are in pes, everyone here is fuckin privileged to pay that fees and come to college, fuckin tell those fuckers to hire from a remoter area or actually unprivileged background   and then say that some disparity they are bridging not this white washing bull shit, so yeah again respectfully please lemme know, just trying to have a respectful conversation"
    },
    {
      "id": "net8hqu",
      "body": "Well this is sad atp. Nothing to say. What will happen to or batch since there are 2.5k plus in cs and aiml , lol? Placements will be an utter joke if they can't handle current 3rd years and 4th years itself."
    },
    {
      "id": "net9dfl",
      "body": "Yup look at what happened to Intel for example lmao.Too much bureaucracy in the workspace."
    },
    {
      "id": "nete3w8",
      "body": "I can’t even imagine your placements 😭😭 gonna be a shit show"
    },
    {
      "id": "netfjeg",
      "body": "Well don't lose hope if your biometrics were done, last year they sent multiple selected mails in batches. Some people got their selection mail even a month after interview. So there's still hope"
    },
    {
      "id": "netraa3",
      "body": "I believe they pace themselves and send people to the OA in batches. That's what contacts in VIT are telling me. PES, on the other hand, makes all 1k+ students write the OA at the same time and scratch their heads as the Wi-Fi goes to hell."
    },
    {
      "id": "netyvvh",
      "body": "Can someone dm the list?"
    },
    {
      "id": "netzxjm",
      "body": "Who got the list? Pls dm"
    },
    {
      "id": "neuxc2f",
      "body": "IBM came again for software developer"
    },
    {
      "id": "neuxkyw",
      "body": "Yea and I’ll post the same thing all over again 10 days later 😅"
    },
    {
      "id": "newwekw",
      "body": "U rly think 8/10 would be women if it wasn't for diversity?"
    },
    {
      "id": "nex4yg5",
      "body": "new list with 5 fte + 2 interns dropped"
    },
    {
      "id": "ney8lzd",
      "body": "Not really bro we’ve 18 hours of classes weekly 🥀"
    },
    {
      "id": "neygf46",
      "body": "Layoffs trends also clearly state that its women who get laid off the least cos well diversity like how fucked up is that. Not intending to be misogynistic but diversity doesn't imply merit bruhh. You can still be a dumbfuck struggling to learn git and still be at some crazy position this is so fkin unfair"
    },
    {
      "id": "neygwpo",
      "body": "I really wonder how the yk LGBT peeps handling this stuffs in IBM in the name of diversity lol"
    },
    {
      "id": "nf1rmai",
      "body": "Even during 7th sem?"
    }
  ]
}