{
  "id": "1njkbco",
  "title": "[Placements] EC isn't getting placement mails",
  "content": "So they're not forwarding placement mails to ec campus, or they're doing it a day late, is there anyone who has access to the placements cse rr group and can add one of us there? Or is there anyone here who can forward the placement mails to us so we can send it in the group? \n\n(Rr peeps answer or I'll curse y'all with no placements)",
  "metadata": {
    "author": "boughc0whownow",
    "url": "https://www.reddit.com/r/PESU/comments/1njkbco/placements_ec_isnt_getting_placement_mails/",
    "permalink": "/r/PESU/comments/1njkbco/placements_ec_isnt_getting_placement_mails/",
    "score": 17,
    "created_utc": 1758131789,
    "flair": "Placements 🤑",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "nequ75w",
      "body": "> (Rr peeps answer or I'll curse y'all with no placements)\n\nAs if people are getting placed /s\n\nAlso someone please respond to this with the EC campus gif, thanks <3"
    },
    {
      "id": "neqvbzf",
      "body": "They only send threatening emails to attend that chancellors  talks"
    },
    {
      "id": "neqwwnc",
      "body": "I don't understand what u are yapping about cause the mails literally cc all the placement groups from aiml to cse to ece across both campuses, the reason you are not getting mails might be because you may have not joined the Google group for placements .\n\nhttps://preview.redd.it/r8hkctkonrpf1.jpeg?width=1179&format=pjpg&auto=webp&s=bed12befbb404caa828ae0dae00e6f2c63a09969"
    },
    {
      "id": "net8yiy",
      "body": "Guys, I’m also from ec campus and one thing I’ve realised is from RR they send mails to all the concerned Google Groups. The mails come till the Google Groups inbox but aren’t delivered to the email client at the same time. For instance yesterday I got the IBM email almost half an hour before my friend did and we’re both in ec campus. The friend checked their Google Groups inbox and it was there but the email about it wasn’t sent. Check Google groups directly"
    }
  ]
}