{
  "id": "1njkx8t",
  "title": "[Placements] So, are placements for 2026 and beyond batches screwed?",
  "content": "So it's 1.5 month into the placement and still around 270 students are placed So the placement percent comes out to be 15% only where as in other colleges like jiit & thapar 40% students are already placed despite of having high intake .",
  "metadata": {
    "author": "Beneficial_Yak9280",
    "url": "https://www.reddit.com/r/PESU/comments/1njkx8t/placements_so_are_placements_for_2026_and_beyond/",
    "permalink": "/r/PESU/comments/1njkx8t/placements_so_are_placements_for_2026_and_beyond/",
    "score": 39,
    "created_utc": 1758133104,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ner1mgv",
      "body": "Dude, don't freak me out, okay? I'm dropping 28 lakhs on this college just to get a good job, and I was hoping for like, an 80-85% placement rate. But now, after talking to older students, I'm hearing it's more like 45-50%. Plus, the 2029 class is gonna be huge, like 3500 students, and they're even adding more AI seats this year! It's gonna be a disaster.\n\nThis whole AI boom, the huge intake, and the IT market situation are seriously scaring me.\n\nI'm not sleeping well after investing 28 lakhs, especially since we're a middle-class family."
    },
    {
      "id": "ner2v01",
      "body": "Let's be positive, We'll figure this out 💪"
    },
    {
      "id": "ner3h0b",
      "body": "We should raise our voice against this ."
    },
    {
      "id": "ner4725",
      "body": "lmfao what?"
    },
    {
      "id": "ner4gsa",
      "body": "market's bad and job intake is less cause of AI boom , and everyone is cheating on coding rounds."
    },
    {
      "id": "ner6vbq",
      "body": "We all saw it coming - it's basically the VIT-fication of PES. They will soon start bringing in WITCH companies to mass hire for future batches to compensate for the increased number of students."
    },
    {
      "id": "ner72sn",
      "body": "Chill, your still in 1st year, u have plenty of time to prepare."
    },
    {
      "id": "ner7jy3",
      "body": "Vit placements are far better than pes this year atleast they are getting placed no matter in mass recruitment pes doesn't give that privilege too last year only 51 students placed in tier 3 companies"
    },
    {
      "id": "ner8uo3",
      "body": "As a graduate and as someone who has seen pes intake change over the years what would you say one should prefer msrit or pes considering intakes and other factors?"
    },
    {
      "id": "nerbvro",
      "body": "How you got JIIT and Thapar data?"
    },
    {
      "id": "nerbz8a",
      "body": "Mass recruitment companies are usually discouraged from entering PES because they know not a lot will apply or join them. This also explains why VIT's average and median are much worse than ours. However, it might change in the future due to the increasing intake (like I said, PES is becoming like VIT)."
    },
    {
      "id": "nerdhr7",
      "body": "Hate to break it to you, but we are slowly becoming a tier-3 college."
    },
    {
      "id": "nere73n",
      "body": "Bruh ibm scammed is instead of taking 40 they took 10🙏😭"
    },
    {
      "id": "nergev7",
      "body": "msrit obviously lol"
    },
    {
      "id": "nergz20",
      "body": "lmao the guy who put 42 in the placement sheet should be held responsible for giving people hope."
    },
    {
      "id": "nerh7f5",
      "body": "Idk how he got to know it but I found this from thapar subreddit - https://placements25-26.vercel.app/ idk abt jiit also if you know the intake of thapar for the current batch please tell me..."
    },
    {
      "id": "nerhbwx",
      "body": "So it's 230 now bruh my sister graduated in 2019 and she was telling around 500 had got placed around September 💀 and she had basic full stack projects in her resume which got her tier 1 package"
    },
    {
      "id": "nerkq2m",
      "body": "Bro I'll seriously suggest you to get pretty good at Competitive Programming and leave the cheaters and other folks behind in the summer internship cycle itself. Competition doesn't matter when you're that good. For summer internship, they won't even look at ur resume much (sometimes gender) that' all"
    },
    {
      "id": "nerl8bo",
      "body": "People used to get in writing Merge Sort in interview now they're asking system design💀"
    },
    {
      "id": "net21zv",
      "body": "How does PES (during the chancellor and vice chancellor talk ) show us *better stats* than previous year and get our hopes high 😭😭"
    },
    {
      "id": "netc2ya",
      "body": "What resources to prep for that? \nIs dsa a2z striver sheet enough? And regular cf?"
    },
    {
      "id": "netw4ff",
      "body": "looking at the trends currently.....its adviced to take college with lower student strength over factors like no of companies.....cause at last your offer matters....not total offers the clg got......and PES hasn't given any thought before bumping the intake if whether they can get proportionately higher no of companies.....and if so many fuck the interviews.....it will only hamper reputation and soon many will freeze their hiring.... tough times ahead!!!"
    },
    {
      "id": "neu65fe",
      "body": "Either join BITS or better to have a good shot at placements in this era."
    },
    {
      "id": "neu868d",
      "body": "Striver's a2z is a big mountain to climb in itself, but you have to go beyond that. Learn from a2z fully and properly then jump to CF"
    },
    {
      "id": "neu8do7",
      "body": "Or maybe learn to cheat properly during the summer internship season also along with being damn good at dsa"
    },
    {
      "id": "neu9bha",
      "body": "Now that doesn't solve the problem for those who have already joined PES, does it? It's not really a realistic solution because there will always be people joining these colleges. And besides, many do choose PES for the branches they get here compared to other more reputed colleges where they might need to sacrifice on the branch."
    },
    {
      "id": "neu9knj",
      "body": "Yeah seeing the current scenario, just being good enough to impress a boomer interviewer can also get you through but getting selected after OA is the main hurdle apart from diversity hiring"
    },
    {
      "id": "neu9m4t",
      "body": "I know I raised this question on the previous post as well, but I'm looking for more (and slightly more anecdotal) answers. \n\nWhat are colleges like VIT/SRM doing? They've had a significantly higher intake than IIT BLR for *years*. Do they hold on campus OAs? If yes how do they handle it? Because the problems PES faces today are problems these colleges would have faced a few years ago. I haven't seen (also because I don't have many friends from these colleges) much backlash about their hiring processes."
    },
    {
      "id": "neu9prl",
      "body": "I don't think there is anything bad in cheating if u have the knowledge and confidence to clear the interview "
    },
    {
      "id": "neue78l",
      "body": "Don’t be so alarmist it’s actually going decently well. Hopefully PES gets their infra right. Our placements haven’t been that bad"
    },
    {
      "id": "neuhwbn",
      "body": "Umm....I think 26' batch has 1.6k kidz in cseai... so def not decently well 😊"
    },
    {
      "id": "neuhyzl",
      "body": "They have connections with mass hiring companies like TCS, afaik TCS hires 900+ candidates from VIT every year"
    },
    {
      "id": "neui3m2",
      "body": "With the way it's heading currently, it'd be a miracle if we reach 50% placements let alone 60%"
    },
    {
      "id": "neukpsn",
      "body": "You're right. Most grads now are left to fend for themselves. Especially in core branches."
    },
    {
      "id": "neul2ib",
      "body": "*900*?! Wtf?"
    },
    {
      "id": "neullia",
      "body": "I'm pretty sure not 900 but pes will be following that soon"
    },
    {
      "id": "neuucvo",
      "body": "I see,  but most of the people would've already  been placed if 80 % of the people weren't expecting 1 lpa/month minimum salary they really think they deserve it with a forked react project and completing striver dsa playlist. I'm not extraordinary but atleast i know where i stand lol."
    },
    {
      "id": "neuxw4o",
      "body": "From going thru 100 posts on no core placements for ece , I've come to seeing no placements for cse in this sub"
    },
    {
      "id": "nev0edp",
      "body": "Brooo uk the people who got ibm offer that's what the girl just did whatever u said in the post....strivers playlist ,react project and a basic rag pipeline..she used to sit in my bench I  5th and 6th sem"
    },
    {
      "id": "nev5seq",
      "body": "https://preview.redd.it/1nd2l2arlwpf1.png?width=1080&format=png&auto=webp&s=24da54220aff76339aa76125c2f7ba7363b603d6"
    },
    {
      "id": "nevbpyy",
      "body": "Oh hell nah how is that even possible"
    },
    {
      "id": "nevcfhc",
      "body": "Then, do you mean projects and dsa playlist of striver along with some skills would be enough for placements..?"
    },
    {
      "id": "nevu6h0",
      "body": "Well for one reason, since this is the first aiml batch to be graduating, the stats might look better in terms of numbers than last year but that does not translate to a better percentage"
    },
    {
      "id": "new23hh",
      "body": "Bruh how is that even possible? No fucking way"
    },
    {
      "id": "nex9ov4",
      "body": "You stand no chance of you don't know 50 frameworks and can't recall 500 api calls"
    },
    {
      "id": "neyhqz1",
      "body": "Bruhh ppl legit think doing a basic tic tac toe project, using the terms AI, ML, GenAI, RAG, Agents etc in their resume and some basic web dev project will give them a T1 job like ssly grow up"
    },
    {
      "id": "nf0qew1",
      "body": "They ask striver sheet level questions only in interviews and u don't need crazy projects so if u somehow clear oa and are good at dsa and communication skills there isn't any reason why someone wouldn't get an offer "
    },
    {
      "id": "nf2nq83",
      "body": "for me, just neetcode 150 was enough to land a tier1 internship(in 5th sem now btw) but for 7th sem I'd say do Striver"
    },
    {
      "id": "nf2oa91",
      "body": "nigga wtf will ur voice do against a mgmt that makes hundreds of crores, you're a drop in an ocean and they're poseidon"
    },
    {
      "id": "nf2u7lb",
      "body": "How much is your stipend btw...?"
    },
    {
      "id": "nf2ued0",
      "body": "How much is your stipend btw..?"
    },
    {
      "id": "nf3jq9c",
      "body": "But tbh dsa + luck is all it takes....it isn't some upsc interview where they test all dimensions of your personality....why do u make it sound like you have to  be top at all to get t1..."
    },
    {
      "id": "nf3odne",
      "body": "see the thing is in interviews all your core technical knowledge is tested but seeing the current placement trends its luck which triumphs a lil more over your skills atp (skills is anyday needed but isn't solely enough tho)"
    },
    {
      "id": "nf3wfog",
      "body": "Other than dsa... CN OS DBMS can be revised a week before interview right ...."
    },
    {
      "id": "nf3y2p4",
      "body": "True but the reason I'm saying luck is even more important because you may end up getting easier DSA questions while your batchmates may get worse and there are countless instances to quote for the same so lol yep luck is one huge major factor in placements"
    },
    {
      "id": "nf40345",
      "body": "Right....totally get it....do interview questions also vary a lot company to company....do some not ask anything...few ask system design and shit?"
    },
    {
      "id": "nf9ylgq",
      "body": "Yeppp and it sometimes varies among interviewers of the same company themselves like some feel like asking core niche concepts, while others may wanna grind on sys design and stuffs which again reinstates my point on luck being a major deciding factor."
    },
    {
      "id": "nfa4p80",
      "body": "Can only pray 🙏 then..."
    },
    {
      "id": "nfa6z07",
      "body": "Every interviewer is not the same."
    },
    {
      "id": "nfa7axs",
      "body": "Based on what I have experienced so far and what I have heard from friends , they more or less focus on the same things"
    },
    {
      "id": "ng537yz",
      "body": "Do you think MIT manipal would be better for CSE ?"
    }
  ]
}