{
  "id": "1nk38rf",
  "title": "[Question] I missed physics lab viva. What do I do?",
  "content": "I missed the Third week phy lab viva. What do I do now? Pls help 😭",
  "metadata": {
    "author": "drosophilaCinderella",
    "url": "https://www.reddit.com/r/PESU/comments/1nk38rf/question_i_missed_physics_lab_viva_what_do_i_do/",
    "permalink": "/r/PESU/comments/1nk38rf/question_i_missed_physics_lab_viva_what_do_i_do/",
    "score": 2,
    "created_utc": 1758186152,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "neuxnuz",
      "body": "Ask ma'am for another chance"
    },
    {
      "id": "neuxov5",
      "body": "Or ask hod"
    },
    {
      "id": "neuyb60",
      "body": "Ask Doredaddy"
    },
    {
      "id": "nev016k",
      "body": "To ask him, you have to die first 😂"
    },
    {
      "id": "nev3o37",
      "body": "🫡"
    },
    {
      "id": "nev3piw",
      "body": "Ok 🫠"
    },
    {
      "id": "nevdm6s",
      "body": "We died on the inside on the day we chose PES"
    },
    {
      "id": "nevj7bt",
      "body": "You should have comment this before , students at pes hyped this college placements so much that I end up choosing this college despite of its high fees, I had many good options like mait , jiit , lnmiit, thapar, nirma I left all of this and came to this college by deep researching your comments and now the admissions are over so you started criticising college you left me of nowhere.  In this college nothing is feeling good you ruined my life 😭"
    },
    {
      "id": "nevlk3v",
      "body": "My dude, if you actually researched *my* comments then you would know that my stance on PES has always been critical. There are good sides and bad sides to this place, just like at any other college. The bad sides tend to be more pronounced on reddit because nobody gives it credit publicly. There are a few things that PES actually does pretty great at compared to other colleges, and many students and alumni like me have realised this only after graduating and comparing ourselves with peers from other colleges. And tbf, you're still better off at PES than those other colleges, except maybe Thapar but as far as I know they're equivalent. \n\nI've never told anyone to pick PES (or not pick) over any college. I've always provided all the information and asked you to make an informed choice."
    },
    {
      "id": "nevobb5",
      "body": "i’m sorry but how are you blaming someone on reddit out of all social media platforms for ruining your life? there’s no way you chose something as important as your college because XYZ person on reddit recommended it? \nno college and i really mean it NO COLLEGE is perfect so while you may complain about the college life here, i highly doubt you’d be having the time of your life in some of the other mentioned colleges"
    },
    {
      "id": "nexg03r",
      "body": "They will blame anyone but themselves for the decisions they themselves took. They think grass on the other side is always greener. Accountability is a lot of ppl’s kryptonite."
    },
    {
      "id": "nfygd38",
      "body": "None of those are t1 anyways so it ain't like your life is finished at pes.Chill."
    }
  ]
}