{
  "id": "1nl8i35",
  "title": "[Placements] Blatant discrimination against EC campus students!!",
  "content": "Ec campus students have missed nearly 5 companies because they are not being mailed about the companies.Wayfair, Gameberry, Guidewire,Societe generale and confluent…these were the companies where ec campus students werent even able to register for,what even is going on??Because of the intake the competition has become intense and the placement cell is behaving like this..",
  "metadata": {
    "author": "Slight-Discount-2623",
    "url": "https://www.reddit.com/r/PESU/comments/1nl8i35/placements_blatant_discrimination_against_ec/",
    "permalink": "/r/PESU/comments/1nl8i35/placements_blatant_discrimination_against_ec/",
    "score": 67,
    "created_utc": 1758299829,
    "flair": "Placements 🤑",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "nf3k3nn",
      "body": "Bro those placements office ppl retarded fr. Idk how they're still employed."
    },
    {
      "id": "nf3lrc0",
      "body": "Fr we need young ppl in the cell,these boomers cant even send proper mails"
    },
    {
      "id": "nf3mph6",
      "body": "Confluent is still open btw"
    },
    {
      "id": "nf3n165",
      "body": "When did wayfair come wtf 😭😭"
    },
    {
      "id": "nf3ncw2",
      "body": "Wayfair has just visited for PPT; Their test was supposed to happen in 3rd week of September, not updates yet"
    },
    {
      "id": "nf3nx0k",
      "body": "yea that I saw , I thought I missed a mail for oa. Thanks 🙏"
    },
    {
      "id": "nf3p4ip",
      "body": "I think it wasn't through placement cell. I heard CCBD or some other center sent mail."
    },
    {
      "id": "nf3q3zi",
      "body": "not sure if it will work, but create a whatsapp group and ensure admins are RRC and tell them to send email if ECC havent recieved for a particular company. it will be more work, but thats one way"
    },
    {
      "id": "nf6bqn9",
      "body": "Is it not possible to set a filter so that whenever someone from rr campus gets a mail, it automatically forwards it to CRs or couple of people from EC campus and they can spread the word?\nThat can be a way to deal with the scumbags at the placement cell"
    },
    {
      "id": "nf7ky0y",
      "body": "bruh college is effing up placements like crazy,now some talented dudes in ecc got robbed.   \nPES should make sure the best students get the best shot and impress companies so they come again an recruit more.   \nThis is the equivalent of when the f1 car and driver performs good but team effs up tire strategy last moment."
    },
    {
      "id": "nf9601a",
      "body": "Basically the students are leclercs while the placement cell is the ferrari team"
    },
    {
      "id": "nfaa0pw",
      "body": "Placements are equivalent to Haas double dnf"
    }
  ]
}