{
  "id": "1nl8r3k",
  "title": "[Rant] A few days ago I saw a post on this subreddit by someone, ranting about the EC campus being \"lame,\" which is not true (I’m from RR).",
  "content": "So the main point we made in defense of EC campus was that it has the goated tech clubs. That got me thinking,  \nWhy are the RR campus tech clubs so bad? Why are their events so underwhelming?\n\nEC campus tech clubs organize game dev marathons and other amazing workshops. Meanwhile, the only worthwhile workshops that happened in RR last year were a Docker workshop by Alcoding (though I didn’t attend, so I can’t say how good it was) and the ISFCR CTF events.\n\nAnd that’s basically it. Even those are pretty rare—except for the CTFs, thankfully, since ISFCR hosts some really great ones in October.\n\nSo seniors, do you know why the RR tech clubs are so disappointing?",
  "metadata": {
    "author": "Suitable-Cattle-755",
    "url": "https://www.reddit.com/r/PESU/comments/1nl8r3k/rant_a_few_days_ago_i_saw_a_post_on_this/",
    "permalink": "/r/PESU/comments/1nl8r3k/rant_a_few_days_ago_i_saw_a_post_on_this/",
    "score": 25,
    "created_utc": 1758300415,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "nf3qam4",
      "body": "Short answer: CSE verticals and the political hurdles. \n\nLong answer: head to PESU Discord for the very long unfiltered story. You'll find batches after batches of PESts discussing it in length and how it hurt their clubs."
    },
    {
      "id": "nf3tt74",
      "body": "Looking forward to see what they do this year, next month for Hacktoberfest"
    },
    {
      "id": "nf40dm8",
      "body": "where in pes media can i get the long answer?"
    },
    {
      "id": "nf4ootm",
      "body": "Not PES Media server. The PESU Discord server which is for all batches. You can find the link in automod's comment"
    },
    {
      "id": "nfe0ws9",
      "body": "I have been in this college for 3 years without knowing about it XD."
    }
  ]
}