{
  "id": "1nlbs6h",
  "title": "[Question] Python or Java or C++",
  "content": "I am a first year cse student at PESU. I only have a little knowledge about coding and i am done with the basics of Java during my holidays. But after entering college i hear my batchmates saying Python is used across different platforms and has more requirement than java . I dont know what to do , should i continue with Java or should i shift to python as soon as possible . Also few say that C++ is good for dsa and other stuffs . I am totally confused by listening to all this shits by my batchmates . Any senior please guide me and help me what to do?",
  "metadata": {
    "author": "UsualCalm307",
    "url": "https://www.reddit.com/r/PESU/comments/1nlbs6h/question_python_or_java_or_c/",
    "permalink": "/r/PESU/comments/1nlbs6h/question_python_or_java_or_c/",
    "score": 6,
    "created_utc": 1758307281,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "nf493g9",
      "body": "just do both python and c++"
    },
    {
      "id": "nf4b0ia",
      "body": "Python’s in your syllabus and will help you in future if want to go into ML and stuff so I’d suggest doing python, c++ you can do for dsa but only if you’re going to start in first year otherwise just do it in your year end break, by then you’ll also know C"
    },
    {
      "id": "nf4cmk4",
      "body": "Hey, I'm not someone who has it all figured out yet, but based on whatever I've seen so far, there is no one single silver bullet programming language for all tasks. Python is great for ML and Data Science tasks, and also for some development (lookup Django, Flash, FastAPI), even though Javascript frameworks are a bit more popular I feel (Javascript is NOT Java).\n\nIf you're talking about DSA, I would suggest pick one of C++ or Java. Python makes things way too easy for you in DSA and you will potentially miss out on a lot of learning. I myself had Java experience from school days and I use it as my primary language for DSA, it's great. You can also pick C++ (since you would be learning C in your 2nd sem so it would be fairly easy to pick up C++, a lot of my friends and batchmates have done this). But once you pick one, stick to it, don't keep changing your language every week.  \nPython is still great for String related DSA questions, but since you're still in first year I would suggest do everything in java/c++ first, and then pick your tool for the right problem.\n\nIn general (not DSA), be flexible and learn the underlying concepts (most are language-agnostic). If you're good with the foundations/logic it's not that difficult to move to a new language."
    },
    {
      "id": "nf4k0dt",
      "body": "Thanks bro , i will go with Java"
    },
    {
      "id": "nf4k3ns",
      "body": "Thanks bro"
    }
  ]
}