{
  "id": "1nm0g5m",
  "title": "[Rant] What kind of a warrior is ECC's \"placement coordinator\"?",
  "content": "**Context:** Mails going to RR campus weren't received by us, and that was brought up in the group very respectfully, when we actually lost one test that way (Societe general). This was his response.  \n\n\nhttps://preview.redd.it/dr8rh7l82cqf1.png?width=938&format=png&auto=webp&s=1d8ac0c30b5a400dca8232677aa7c7624c67e9f2\n\n",
  "metadata": {
    "author": "frustrated-PESt",
    "url": "https://www.reddit.com/r/PESU/comments/1nm0g5m/rant_what_kind_of_a_warrior_is_eccs_placement/",
    "permalink": "/r/PESU/comments/1nm0g5m/rant_what_kind_of_a_warrior_is_eccs_placement/",
    "score": 44,
    "created_utc": 1758380459,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "nf9cgl7",
      "body": "Username checks out"
    },
    {
      "id": "nf9cr9s",
      "body": "There's no point talking to animesh as somashekhar TP is the actual point of contact for all companies so it's better if you approach him directly through mail."
    },
    {
      "id": "nf9k176",
      "body": "That's what, Animesh will give copium and make us leave cuz the company had already sent the shortlist for the test.. Someone in the orientation already raised this point about not receiving mails on time and Sridhar was like we're in touch with IT teams fixing blah blah but this still keeps happening"
    },
    {
      "id": "nf9ki4x",
      "body": "It's never about IT teams, somashekhar is the one responsible for forwarding company mails irrespective of the campus. He may not know this issue thoroughly, but at least he will make sure ppl get a fair chance to sit for placements."
    },
    {
      "id": "nf9yukj",
      "body": "What an absolute asshat. They don't send out mails properly, and he wants to hear the complaints in person? \n\nSo basically he knows what the issue is, yet he just wants people to waste a weekend to meet in person? You bloody created the group for placement related stuff. Everyone told you about an issue. Fix the damn issue, it won't change when you hear it in person. \n\nIndian colleges have one ultimate goal. PLACEMENTS. \n\nThis college puts in negative efforts into it. Can't host in campus OAs, and now they can't even forward mails. Truly pathetic"
    },
    {
      "id": "nfa8i18",
      "body": "animesh"
    },
    {
      "id": "nfawqp6",
      "body": "You should know that Animesh is active on this sub. Might want to take this post down before he identifies who posted this."
    }
  ]
}