{
  "id": "1nmm43a",
  "title": "[Rant]Curbing of Free Speech regarding the events of 20/09/2025",
  "content": "The events of last night have led me to conclude that honest facts about our community are not entertained, which is blatantly wrong. Yes, Mayur and SaiRishi are the two most annoying idiots this college has to offer. I'll say it a billion times. If they can't accept the fact and want to \"find\" who posted it and \"beat\" them up, then that just shows why they're being hated in the first place. Genuinely, learn some civic sense and learn to take some criticism without running to your mommies. Womp womp. 🙂",
  "metadata": {
    "author": "Hot_Speech3115",
    "url": "https://www.reddit.com/r/PESU/comments/1nmm43a/rantcurbing_of_free_speech_regarding_the_events/",
    "permalink": "/r/PESU/comments/1nmm43a/rantcurbing_of_free_speech_regarding_the_events/",
    "score": 86,
    "created_utc": 1758441580,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "nfdw0rp",
      "body": "What is happening"
    },
    {
      "id": "nfdwtxs",
      "body": "Yo man chill , if they are annoying then ur gonna see many such ppl in ur corporate career aswell , So learn to move on , we had such ppl too , on the other hand yesterday night was nice  /s"
    },
    {
      "id": "nfdxs30",
      "body": "What is even happening"
    },
    {
      "id": "nfdyaxc",
      "body": "People came together for the first time last night to talk about this after a year and a half of tolerating their bullshit. They're hated yes, and if they put even a fraction of effort that they wanna put towards \"finding and beating\" the guy who made the post, into self-reflection and actually analyse their behaviors of why they act the way they do, it would do them so good. To Mayur, don't think of urself as a rowdy or don, if u truly didn't give \"two fucks\", u wouldnt have gone around and announced that u wanna beat people up. Take some constructive crisitism man, it's 2 of u vs the whole batch. Fix ur behavior, talking rudely to teachers who r just doing their jobs isn't cool. No one's gonna praise u for it nor gonna appreciate ur balls, ur behavior is disgusting and honestly repelling. It's honestly surprising how yall don't learn even after so many people speak against ur behavior"
    },
    {
      "id": "nfdyiyc",
      "body": "![gif](giphy|NipFetnQOuKhW)"
    },
    {
      "id": "nfdylzc",
      "body": "what happened?"
    },
    {
      "id": "nfdz3wh",
      "body": "Two jerkmate buddies called SaiRishi and mayur are collectively hated. Someone crashed out yesterday, idk why tho"
    },
    {
      "id": "nfdz69s",
      "body": "Nothing happened, someone crashed out yesterday and posted some hate lol"
    },
    {
      "id": "nfdzr0x",
      "body": "Valid"
    },
    {
      "id": "nfe2eif",
      "body": "Don't be a reddit warrior."
    },
    {
      "id": "nfe56yg",
      "body": "ec placement coordinator reference? lol"
    },
    {
      "id": "nfe5b83",
      "body": "Go study for isa kids, instead of wasting ur time on this pointless hate"
    },
    {
      "id": "nfe7hqq",
      "body": "Damn did he really announce that theyre gonna beat them up  \nI'm just glad someone's finally stepping up against their bullshit it's about time 😔🙏"
    },
    {
      "id": "nfe7x1i",
      "body": "Is this a reference to the placements post lmfao"
    },
    {
      "id": "nfe90qc",
      "body": "![gif](giphy|U7GRtzqJMyVEs)"
    },
    {
      "id": "nfedmaf",
      "body": "bro they're sending threats now?? tf"
    },
    {
      "id": "nfeeu8s",
      "body": "man everyone in our batch hated those clowns someone had to start the conversation and that happened yesterday which gave us some facts about them as conclusion"
    },
    {
      "id": "nfefmcx",
      "body": "Threats, what kind of?"
    },
    {
      "id": "nfefubv",
      "body": "Yeah but these knuckleheads still don't get it, he wants to \"beat\" that guy up, like that would make people like him more. It's honestly too funny how retarded he is."
    },
    {
      "id": "nfefyvb",
      "body": "yes i agree, they are so egoistic they don't understand that they should change"
    },
    {
      "id": "nfel8wu",
      "body": "Finding OP and beating him up it seems"
    },
    {
      "id": "nfesg8s",
      "body": "he can't even look at u in the eye wtf will he beat you up\n\ni am going a bit personal and i will delete it after some time (for context ask any of his classmates)"
    },
    {
      "id": "nfesu3q",
      "body": "LMFAO, mayur and i don't see eye-to-eye on a lot of things (pun intended)"
    },
    {
      "id": "nfeu0e5",
      "body": "i think you don't think you know the context he have some medical condition he cannot look straight"
    },
    {
      "id": "nfeu9at",
      "body": "Yeah bud ik he has squint eyes (not making fun of it) but yeah sometimes I think he's looking smwhere else when he's looking straight into my eyes"
    },
    {
      "id": "nfeuoqy",
      "body": "yes"
    },
    {
      "id": "nffpnxj",
      "body": "Can someone share the post? Couldn't find it in recent history"
    },
    {
      "id": "nfftzai",
      "body": "deleted by mod"
    },
    {
      "id": "nffxnkz",
      "body": "Unfortunate"
    },
    {
      "id": "nffxuq5",
      "body": "another loss for the blind"
    },
    {
      "id": "nfgilcd",
      "body": "where did mayur say he wants to beat the OP up , wheres that pussy saying all this"
    },
    {
      "id": "nfgioiq",
      "body": "where did he say he wants to beat up"
    }
  ]
}