{
  "id": "1nmqgjg",
  "title": "[Question] How badly is cgpa affected if we mess up the first physics viva (on 3rd week of college)",
  "content": "They gave us 12 freaking experiments. I really don't know what to do. I only got like one night rn",
  "metadata": {
    "author": "No-Mail-6854",
    "url": "https://www.reddit.com/r/PESU/comments/1nmqgjg/question_how_badly_is_cgpa_affected_if_we_mess_up/",
    "permalink": "/r/PESU/comments/1nmqgjg/question_how_badly_is_cgpa_affected_if_we_mess_up/",
    "score": 2,
    "created_utc": 1758457106,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "nfeofur",
      "body": "nostalgia lmao, chill out, it will barely affect it, and you can always tell him to take your viva in the next lab session"
    },
    {
      "id": "nfeoov8",
      "body": "your isas and esas will hold far more weightage than a viva conducted 3 weeks into college, so it won’t affect it that much"
    },
    {
      "id": "nfeqvga",
      "body": "bro wtf, i mean even if u do well in ISA and ESA u have very high probability of getting a F grade"
    },
    {
      "id": "nfer0jq",
      "body": "it won't even effect i got A grade after getting 3 marks in lab"
    },
    {
      "id": "nfeuhbu",
      "body": "Ur viva contribute atleast 40% of ur total sgpa in 2or1 sem"
    },
    {
      "id": "nfew8um",
      "body": "yeah but he just missed one of the lab viva's, not all of them"
    },
    {
      "id": "nfewwyc",
      "body": "tru ur cooked lil bro"
    },
    {
      "id": "nfexz8x",
      "body": "your first viva holds all the weightage on your cgpa, \n\nim a 7th year student and i have gotten S grades across all my subjects for every year, but my cgpa is still only 6.2 because i messed up my first physics viva /s"
    },
    {
      "id": "nffoo39",
      "body": "Companies shortlist people especially on their first physics viva ( on 3rd week of college)"
    },
    {
      "id": "nffophi",
      "body": "Companies shortlist people especially on their first physics viva ( on 3rd week of college)"
    },
    {
      "id": "nfl4qm6",
      "body": "Whose your teacher tho btw dont worry chill man it aint that big of a deal"
    },
    {
      "id": "nflehds",
      "body": "Are people being sarcastic or real here?"
    },
    {
      "id": "nfwegwq",
      "body": "Real, apple's first shortlisting criteria was 3rd week physics viva performance, some people who got full in viva were placed directly."
    },
    {
      "id": "nfwj16t",
      "body": "Woah 😳"
    }
  ]
}