{
  "id": "1nnmcio",
  "title": "[Rant] New at pesu rr campus and struggling to adjust",
  "content": "\nI am a fresher at pesu rr campus. I am feeling kind off anxious here. All the excitement of college has faded now. I see people in my class and I feel like a failure. I don't know the basics of coding. I don't know how I will cope up with my peers. And I haven't yet made any solid friend group either. I do have friends but none of them seem long term. And I can't find much time to study either. I reach hostel at like 5/6 and I am so tired after everything that I just rot in bed and sleep. I know i should just sit down and plan stuff but it feels so overwhelming rn. I feel like I want to do everything but can't seem to put my mind into a single thing. I want to go to gym, learn coding, hangout with friends, take part in hackathons and just live that \"college life\" I have always dreamt of but atp idk if I ever will be able to all that shit. I don't want to walk out of these 4 years having accomplished nothing\n",
  "metadata": {
    "author": "Afraid-Bed7456",
    "url": "https://www.reddit.com/r/PESU/comments/1nnmcio/rant_new_at_pesu_rr_campus_and_struggling_to/",
    "permalink": "/r/PESU/comments/1nnmcio/rant_new_at_pesu_rr_campus_and_struggling_to/",
    "score": 15,
    "created_utc": 1758547329,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "nflgzdv",
      "body": "How is the gender ratio at pes?"
    },
    {
      "id": "nfli550",
      "body": "Dw bro it's usual since it's college has just started...ull cope up as time goes...Btw which section do u belong to?"
    },
    {
      "id": "nflibmx",
      "body": "you’ve only been here a month. it’s way too early to panic. It takes time to settle in. Even the friends you have right now might not last because classes reshuffle in 2nd and 3rd sem, so don’t stress about building a “solid group” this soon\n\nAlso no one expects you to know everything about coding already. Just focus on learning the basics step by step.\n\nAnd about this whole “college life” idea, that movie version doesn’t exist here or in most Indian colleges. Pick one or two things you wanna do, get consistent, and add more later.\n\nFour years is plenty of time"
    },
    {
      "id": "nfljiuo",
      "body": "Happens, when I got in, I had classes till 4:45 for the first month and I couldn't attend any of the events or workshops, neither did I have friends either.   \nBut then it all started to get along well, made a shit ton of new friends, had a lot of fun in my first year, all I'm gonna say is, don't be negative, it'll all be fine in no time, just take initiatives and you'll be good"
    },
    {
      "id": "nfljnip",
      "body": "Same"
    },
    {
      "id": "nflnlve",
      "body": "Reach hostel at 5/6? You from EB2 hostel?"
    },
    {
      "id": "nfmicxw",
      "body": "Comment unrelated to the post."
    },
    {
      "id": "nfwrmkm",
      "body": "Hey, it's alright, it'll get better. Your words echo my experience during my first sem as well. First sem can be quite hectic because it sometimes starts late and they rush through the syllabus. It might take some time, maybe a sem, maybe 2... but you'll eventually grow comfortable with the college. Sure it's crowded, sure the syllabus can be heavy but you'll find your crowd amidst all the chaos.\n\nI'd recommend you join clubs that seem interesting to you to find people of your type. None of my closest friends were in my class and that's fine !! \n\nAs for coding, there's a fair bit of time to learn coding. I can see that you're interested and that's all that matters. You might be looking at the top 10% of first-year students who know coding and compare yourself to them, most here don't know coding just like you! You'll learn eventually."
    },
    {
      "id": "nfymsol",
      "body": "Thank you so much for the advice I really needed that. And about the shuffling of classes in 2nd sem, how do they do it? Is it among all the chemistry/physics cycle."
    },
    {
      "id": "ng3085f",
      "body": "Most of your classmates stay the same, but a few people get shuffled into different sections, and some KCET students are mixed in"
    }
  ]
}