{
  "id": "1nnpm8i",
  "title": "[OffTopic]I feel very hard to socialize",
  "content": "It has been exactly 8 days I have joined the college. But have none friends . It's not that i tried to socialize..but never had felt a friendship. It just ends up by hi , Hello . One more thing is I don't to speak proper kannada. I know language won't be a problem for socializing tho . What's ur opinion about it ?",
  "metadata": {
    "author": "BreadfruitVisual4763",
    "url": "https://www.reddit.com/r/PESU/comments/1nnpm8i/offtopici_feel_very_hard_to_socialize/",
    "permalink": "/r/PESU/comments/1nnpm8i/offtopici_feel_very_hard_to_socialize/",
    "score": 24,
    "created_utc": 1758554942,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "nfmcwyx",
      "body": "Bro, I feel you. 😭\n\nMany people may feel similar too but don't express it. \nYou know, about the friendship you're speaking, you'll definitely get a friend dw. But it needs time for you and people to actually know each other properly. You'll also get ample opportunities to socialize. \n\nIt may be awkward at first, just talk to someone first, like they may be nervous to interact with people first.. Who knows that they may actually turn out to be a great friend of yours. And you may also try joining clubs in college, maybe you'll find people with similar interests."
    },
    {
      "id": "nfmdt8o",
      "body": "Ohk thank you! 😊"
    },
    {
      "id": "nfpf4kg",
      "body": "1) You dont need kannada to socialize(although its good to know to vibe with locals).  \n2) College Friendships (Bigger Groups) dont  usually last that long, its better to just have those 2-3 friends whom you can count on.   \n3) Join events with similar interests/hobbies discuss your opinion on topics, have debate, connect with them on socials.  \n4) just start talking , 8 days dont matter."
    },
    {
      "id": "nfrchjf",
      "body": "its fine if u dk Kannada , try to make a kannadiga friend , mostly they wil help u out with lang , if u show interest. I understand,  learning it might be difficult as even I had difficulty to learn Tamil nd Telugu being a kannadiga. pro tip - try talking to ur kannadiga friends in Kannada, if ur accent is weird, they might find it funny(which is useful), nd they wil rectify u. u might start to  understand the language pretty soon, but talking in it wil take time, but its worth it. most of all, never disrespect anyone's language be it Kannada or Tamil or Telugu , or even Hindi"
    },
    {
      "id": "nfx0hrr",
      "body": "Give it time. You most prolly will find ur frnds group in your class itself. Most subs have a team based mini project for the first yr so u'll end up having one frnd fs. If that frnd has a group u can jus join his/her lol.\n\nJoin clubs .. make sure u attend the events as a volunteer from the club and not as a participant. That way u get to socialize much more work purpose at least.\n\nFind that random ass sitting around u in assessment center during exams asking u for help and jus vibe (only if ur the kind who is open to all this copying and shit) .... Personally made some good num of frnds like that lol.\n\nBe nice and u'll get the same back in return fs ... Outliers exists but jus give it a shot. Def worth it"
    },
    {
      "id": "ng52ob7",
      "body": "You can find an excellent course and some other resources for learning Kannada here if you're interested in learning: https://bhashafy.com/#kannada"
    }
  ]
}