{
  "id": "1npamzw",
  "title": "[Question] How do open book exams work",
  "content": "My teacher told me only my classnotes will work for my open book tests in chemistry but I haven't written jackshit... I have my seniors notes will I be okay w it or will my teacher check through my notes and not allow it? (Ps my teacher is moderately strict tbh)",
  "metadata": {
    "author": "VictoryCommercial238",
    "url": "https://www.reddit.com/r/PESU/comments/1npamzw/question_how_do_open_book_exams_work/",
    "permalink": "/r/PESU/comments/1npamzw/question_how_do_open_book_exams_work/",
    "score": 6,
    "created_utc": 1758716463,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "nfxpvkj",
      "body": "The concept of open book exams is that they allow you to refer your notes/textbook to answer questions. Instead of checking how much you remember, they will check how you would search for the information and utilize it in answering the question. Obviously the questions they're gonna give will be super hard difficulty."
    },
    {
      "id": "nfxpyoa",
      "body": "Our teacher told it will be easy asf tho 😭"
    },
    {
      "id": "nfxq0y2",
      "body": "no one will be checking your notes, even using a friends notebook also works .. in fact i used a printout of my friends notes ... chillax youre writing a class test in 1st yr.. all this will be the least of your concerns later"
    },
    {
      "id": "nfxq3ts",
      "body": "You got capped lol. It will be a tough question for sure."
    },
    {
      "id": "nfxqacs",
      "body": "That defeats the point of an open book exam. These exams are always designed to be significantly harder. Open book exams aren't really the saving grace people think they are because in most cases, if the paper is set to be open book it means they never expected you to complete it in a closed book setting."
    },
    {
      "id": "nfxqbji",
      "body": "I mean she said it will be a banana level problem"
    },
    {
      "id": "nfxr4y3",
      "body": "Would you recommend me completing my notes to refer or lock tf in 😭😭 I'm actually shitting my pants rn"
    },
    {
      "id": "nfxsl9z",
      "body": "Some bananas are bigger than other bananas"
    },
    {
      "id": "nfxso9l",
      "body": "Mix of both, but definitely complete whatever notes you're allowed to carry in."
    },
    {
      "id": "nfxw7il",
      "body": "🤨"
    },
    {
      "id": "nfyajy4",
      "body": "![gif](giphy|n1mNS67yQhtzzAN5H3)"
    },
    {
      "id": "nfyunvm",
      "body": "Somehow, someway you'll get the answers before the \"test\" ends, dont worry much."
    },
    {
      "id": "ng3cnd0",
      "body": "That's what you'd think but our open book test in physics was quite simple .Questions were given directly from notes and all that was needed was to pay attention in class."
    }
  ]
}