{
  "id": "1npb1yo",
  "title": "[Placements] Stop Wasting Placement Slots If You Don’t Even Want Them",
  "content": "Okay guys, placements. I know you’re all sick of hearing about it by now. The process is random as hell, shortlisting feels like dice-roll luck, and honestly it’s exhausting. It’s already September, everyone’s stressed out, and yeah, I’ve faced a couple rejections too. It sucks, but fine that’s part of it.\n\nBut here’s what annoys me: the people with high GPAs (the 8.5+ gang) who *already know* they’re aiming for fat CTCs, still showing up for T2/T1 (12LPA) tests. Like bro, you don’t even want that 10–12 LPA role, then why sit for the OA? Why get shortlisted, ace it (sometimes by copying), and then either ghost the interview or purposely screw it up? For what? You’re literally taking up a spot from someone who actually needs it.\n\nSame thing with internships. Some people just show up, then say “eh it’s just an internship, I’ll bomb the interview.” Why even waste everyone’s time?\n\nPlacements are already tough, man. People are stressed, rejections keep piling up, some of us can’t even sleep properly. The least you can do is not clog the system if you don’t even plan to go through with it.\n\nSo yeah, if you’re in final year and already sitting pretty with a crazy GPA and aiming for only the big ones  do everyone a favor and skip the T2 grind. Let people who actually want those jobs have a fair shot.\n\nDon’t block someone else’s chance just because you’re bored or treating it like practice.\n\nMany people for BT, DTCI did this.",
  "metadata": {
    "author": "No_Ordinary7317",
    "url": "https://www.reddit.com/r/PESU/comments/1npb1yo/placements_stop_wasting_placement_slots_if_you/",
    "permalink": "/r/PESU/comments/1npb1yo/placements_stop_wasting_placement_slots_if_you/",
    "score": 130,
    "created_utc": 1758717626,
    "flair": "Placements 🤑",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "nfxtk5j",
      "body": "hey im in 2nd year can i dm you?"
    },
    {
      "id": "nfxu2u6",
      "body": "someone said it finally, kudos!"
    },
    {
      "id": "nfxuj1f",
      "body": "Yeah sure man  \nHappy to help you"
    },
    {
      "id": "nfxvaj1",
      "body": "The toppers follow greedy algorithm !!"
    },
    {
      "id": "nfxvf7p",
      "body": "buddy its still september u have time done get stressed out!!"
    },
    {
      "id": "nfxwsln",
      "body": "Every single placement post on this sub just scares the shit out of me. And knowing the '27 batch is even bigger than '26 yeah we're fucked rip"
    },
    {
      "id": "nfxwvsr",
      "body": "I heard from an insider at a company that when they hire for slightly lower CTC roles (like \\~8 LPA), they intentionally shortlist extra students at PES. They know a good chunk won’t actually accept the offer, so they hedge by taking more people upfront.\n\nCompanies are well aware that if their package is average or below average for the college, a lot of students won’t take it. So they adjust accordingly.\n\nAt the end of the day, you can’t really blame students for writing every test. The real problem is with the placement office and the rules they put in place. Don’t hate the player, hate the game."
    },
    {
      "id": "nfxx0fy",
      "body": "then after which month should people technically stress out?"
    },
    {
      "id": "nfxxolg",
      "body": "I am gonna be real honest i think your batch is royally cooked,the first thing is..the intake for your batch is too much,secondly ai is gonna get even sharper so a LOT of ppl would clear the OAs"
    },
    {
      "id": "nfxy4iy",
      "body": "nov/dec"
    },
    {
      "id": "nfxygis",
      "body": "I am wearing aware that IM SCREWED dude THANK YOU FOR THIS GROUNDBREAKING NEWS😭😭\n\n It’s even more demoralizing how the market goes straight down the gutter the moment it’s finally our turn to become adults"
    },
    {
      "id": "nfxzhic",
      "body": "my batch is unholy levels of cooked"
    },
    {
      "id": "nfy25t6",
      "body": "And they don't bring  mass recruiters too, so ig it's even more cooked than vit and shit unless they start bringing them aggressively for future batches"
    },
    {
      "id": "nfyvxvx",
      "body": "What's the total CSE intake of both campuses for the 27' batch?"
    },
    {
      "id": "nfz6rkl",
      "body": "\"real\" life applications of DSA /s"
    },
    {
      "id": "nfzpfe6",
      "body": "I think we can say the same"
    },
    {
      "id": "nfzpp5s",
      "body": "I think we can say the same....even more😭😭"
    },
    {
      "id": "nfzraqh",
      "body": "Can I?"
    },
    {
      "id": "ng034ak",
      "body": "About 2k (including AIML)"
    },
    {
      "id": "ng2g8fn",
      "body": "Yeah"
    },
    {
      "id": "ng2lxpm",
      "body": "Keep whining like a bitch. Hahahaha."
    },
    {
      "id": "ng2rj6p",
      "body": "Gaand marale aryan anand!!!"
    },
    {
      "id": "ng3etx7",
      "body": "Screw you and thanks on behalf of the '29 batch 😭 😂 ."
    },
    {
      "id": "ng3ffkr",
      "body": "Why even fill the form making it harder for some to write the OA. If you want to know what the questions were you can just ask someone"
    },
    {
      "id": "ng5b3nh",
      "body": "Brother imma give u one advice  \n\\-Just grind DSA like a mad man  \n\\-try to keep ur gpa above 8.5  \n\\-Brush up cs fundamentals like OS,CN,DBMS,OOPS,System Design,LLD  \n\\-Have some good projects and be ready to explain everything present in your resume   \n\\-Above all try to get an internship and get it converted to miss all these headaches  \n  \nThe subjects u r currently learning probably won't even matter"
    },
    {
      "id": "ng5ifp8",
      "body": "Is it already too late to start DSA? When do most people start LC?\n\nAlso my cgpa is not over 8.5 and probably never will be, so I've already accepted it"
    },
    {
      "id": "ng5k55e",
      "body": "Just pick one DSA roadmap and complete it fully then u r sorted \nAnd many companies come for gpa above 7 so don't worry abt Gpa that much"
    }
  ]
}