{
  "id": "1npccev",
  "title": "[OffTopic] Why was there news channels outside gate?",
  "content": "Today in the morning I come to college and see that there are like 4 news channels reporting outside college, I asked them they refused to reply\n\nI ignore and walk in for the DSA exam, asked CS people what type of questions they had exam, most reply with code completion type etc, so that's what I study and Guess what no coding question in 4 markers, I was devastated, everything was fricking drawing \n\n** Also why was News people outside? **",
  "metadata": {
    "author": "Born_Entrance_7817",
    "url": "https://www.reddit.com/r/PESU/comments/1npccev/offtopic_why_was_there_news_channels_outside_gate/",
    "permalink": "/r/PESU/comments/1npccev/offtopic_why_was_there_news_channels_outside_gate/",
    "score": 32,
    "created_utc": 1758720995,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "nfy2dnv",
      "body": "In case you missed the discussion (scroll this subreddit), there was an IT raid on campus."
    },
    {
      "id": "nfy2kai",
      "body": "https://preview.redd.it/p7ab178294rf1.png?width=640&format=png&auto=webp&s=ffe857a122bca8c86cd17452463a0b4931f1b6e0"
    },
    {
      "id": "nfy2uq5",
      "body": "wait whattt, aiml paper had no coding questions for 4 markers? what were the questions?"
    },
    {
      "id": "nfy4aw5",
      "body": "AIML students, for some reason, almost always get easier papers than the CSE students. Everyone's been saying this since our third semester"
    },
    {
      "id": "nfybwrv",
      "body": "there was one on a splitting alternate nodes into 2 separate queues and writing the algo for postfix to infix but yeah they picked the most random ass questions 😭😭 cause i expected coding"
    },
    {
      "id": "nfyfb93",
      "body": "bro that is not coding one was pseudocode and the other was the splitting one in which everything was given we just had to implement"
    },
    {
      "id": "nfyouor",
      "body": "Pes got raided by IT"
    },
    {
      "id": "nfyqbdd",
      "body": "If only IT companies raided for placements"
    },
    {
      "id": "nfyu810",
      "body": "You're actually lucky man"
    },
    {
      "id": "nfyud9a",
      "body": "Ec or rr"
    },
    {
      "id": "nfz0ikt",
      "body": "We had 1 where we had to split a queue into two queues based on even odd index.\n\nThat's about it for coding.\n\nOne tree question that was just a pain in the ass, sparse matrix to LL and triple vector , infix postfix"
    },
    {
      "id": "nfz0pp2",
      "body": "Both"
    },
    {
      "id": "nfz4lfy",
      "body": "oh..i saw the binary search tree question in the group and it's really easy if you know the procedure (we were taught in class)"
    },
    {
      "id": "nfz6m1j",
      "body": "they raided across all campuses in Karnataka."
    },
    {
      "id": "nfz75sj",
      "body": "Damn, \n\nOur teacher just told us what inorder preorder postorder is and left it there XD.\n\nWith my usual one nighter yea I was left baffled"
    },
    {
      "id": "nfz8she",
      "body": "lmao"
    }
  ]
}