{
  "id": "1nphsyg",
  "title": "[Rant] Why is Amaatras wifi so shitty?",
  "content": "WHY IS THE AMAATRA HOSTEL WIFI SO SHITTY OMG. After waiting for SO LONG to FINALLY get wifi we get the most slow,useless, fuckass wifi in the entire world.IM PAYING 1.6 LAKHS FOR THIS STUPID HOSTEL.It keeps showing that I've reached my maximum login limit EVEN WHEN IM NOT CONNECTED ON ANY DEVICE and what the fuck is with that dumbass rule that we're only allowed to connected to ONE DEVICE,and the fact that I need to wait atleast 2 HOURS to switch to another device, on top of that the network coverage here is so insanely bad how the fuck do u manage to locate a place like that in BANGALORE.IM GOING INSANE HELP. It keeps showing maximum login limit reached even when I'm not connected on any device how do I fix this.",
  "metadata": {
    "author": "Icy-Profession-6234",
    "url": "https://www.reddit.com/r/PESU/comments/1nphsyg/rant_why_is_amaatras_wifi_so_shitty/",
    "permalink": "/r/PESU/comments/1nphsyg/rant_why_is_amaatras_wifi_so_shitty/",
    "score": 19,
    "created_utc": 1758733548,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "nfz9w88",
      "body": "Welcome to PES"
    },
    {
      "id": "nfzarnq",
      "body": "Get a Vi or Airtel sim. Jio has no connectivity in the area and hostel wifi will always be shit. I had the same problem when I was there."
    },
    {
      "id": "nfzatvw",
      "body": "😭😭"
    },
    {
      "id": "nfzb31q",
      "body": "I have a couple of login credentials, idk if they work anymore, but yeah I'll give it to you if you want em"
    },
    {
      "id": "nfzbb2w",
      "body": "YES PLEASE"
    },
    {
      "id": "nfzbdek",
      "body": "YES PLEASE"
    },
    {
      "id": "nfzbne9",
      "body": "YES PLEASE"
    },
    {
      "id": "nfzbpbu",
      "body": "YES PLEASE"
    },
    {
      "id": "ng4iqx9",
      "body": "yo could you send that to me too?"
    },
    {
      "id": "ng5j2zw",
      "body": "really man, jio sucks in this area  \nright before joining college i switched from airtel to jio.  \nlooks like I have to switch back to airtel"
    },
    {
      "id": "ngbo2g9",
      "body": "Yes...and that fuckn warden shows attitude if we ask abt queries"
    },
    {
      "id": "ngbp0jf",
      "body": "Snd me too"
    },
    {
      "id": "ngbp78d",
      "body": "Same here...i just ported from airtel to jio..could we port again??"
    },
    {
      "id": "ngh5vvf",
      "body": "YES OMG I HATE HER SM so rude for no reason"
    },
    {
      "id": "ngh74aa",
      "body": "Us bro us....🥲"
    }
  ]
}