{
  "id": "1npy4y0",
  "title": "[Discussion] How was webtech sem 3 cs",
  "content": "How was it i just need copium atp\n\n[View Poll](https://www.reddit.com/poll/1npy4y0)",
  "metadata": {
    "author": "Trying2livenice",
    "url": "https://www.reddit.com/r/PESU/comments/1npy4y0/discussion_how_was_webtech_sem_3_cs/",
    "permalink": "/r/PESU/comments/1npy4y0/discussion_how_was_webtech_sem_3_cs/",
    "score": 18,
    "created_utc": 1758776789,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ng2vsvn",
      "body": "For reference, The average for web tech in ISA 1 for us was 18"
    },
    {
      "id": "ng2x21u",
      "body": "Canon event"
    },
    {
      "id": "ng2xefr",
      "body": "Webtch ISA 1 was hands down the worst exam I’ve written in college. I honestly don’t think it can get any worse so dw"
    },
    {
      "id": "ng2xs2q",
      "body": "What about second ISA"
    },
    {
      "id": "ng2y1h9",
      "body": "ISA 2 was a lot better. they took pity on us and put all the 4-mark answers right in the MCQs so most people just copy pasted.\n\n I got like 16 in ISA 1 and 28 in ISA 2."
    },
    {
      "id": "ng2y6i2",
      "body": "21, but I remember that isa being a tad bit easier compared to first"
    },
    {
      "id": "ng37mzn",
      "body": "It’s going to be a bit tough but I suggest you learn JavaScript properly and then watch enough YouTube videos for the entire stack. Basically learn everything in the syllabus now cause it’s pretty important for placements (and good to have on resume). You’ll have more important things to learn later"
    },
    {
      "id": "ng3boh4",
      "body": "The sylllabus is hectic guys one of the worst sylllabus maker cant explore other things also only focus on cgpa today and yesterday isa are worst of worst"
    },
    {
      "id": "ng3d529",
      "body": "React got me 😵 but DDCO was worse so"
    },
    {
      "id": "ng3exp8",
      "body": "what about esa"
    },
    {
      "id": "ng3hh0o",
      "body": "pretty hard only"
    },
    {
      "id": "ng3hvxm",
      "body": "yeah i fuckin hate this subject so much, DSA, AFLL and Math are so much more interesting than this garbage"
    },
    {
      "id": "ng40d1x",
      "body": "I also fucked that paper up, I think i got 14/40.   \n[https://drive.google.com/drive/u/0/folders/1QYkEjhr8croubXsnYGh\\_dSaOC9vUd3NR](https://drive.google.com/drive/u/0/folders/1QYkEjhr8croubXsnYGh_dSaOC9vUd3NR)  \nUse these notes and don't worry because 2nd ISA and ESA are not that hard. I ended up with a B in the end :)"
    },
    {
      "id": "ng4a7y1",
      "body": "Nightmare of courses SEM3 , be prepared for ESA just saying\nWorst sem for most people in PES"
    },
    {
      "id": "ng4dnae",
      "body": "This is where I fked up, its missing so many content from slides .I completely relied on this . It's good but not complete. \nI should have gone through slides side by side ."
    },
    {
      "id": "ng4e0so",
      "body": "DDCO might be the worst exam I've ever written. EVER."
    },
    {
      "id": "ng4e3h7",
      "body": "aiml people had the first 2 question similar but i got to know the questions 15 minutes earlier and realised that the bubbling capturing thing was something i skipped(and the slides i referred didn't have them) so kinda got cooked lol"
    },
    {
      "id": "ng5jtrn",
      "body": "worked fine for me, but towards the end of the sem I was learning Webdev stuff with the help of the notes and youtube for the final project guess thats what carried"
    },
    {
      "id": "ng5ux2o",
      "body": "Lmfao same.\n\nI thought these notes were gonna put me ahead of the crowd doing the slides and fully did this.\n\nGot rodded."
    },
    {
      "id": "ng94d5l",
      "body": "There's more to see mate, this is just the beginning"
    },
    {
      "id": "ngagvrg",
      "body": "Aah, so sem 4 is better? I just hope I don't tank my cg this sem bro 😭"
    },
    {
      "id": "ngchbj8",
      "body": "Yeah, what was ts, I am ece btw"
    }
  ]
}