{
  "id": "1nq4xzd",
  "title": "[Placements]How are core ECE placements at PES for this year?",
  "content": "Guys how are the PES placements this year for core ECE companies. What is the scene for ECE students? Which top companies visit our college(RR campus) for placements and what % approx of students are the ones who get placed in tier 1 ece companies.\n\nI'm a fresher here and I'm desperately looking for a heads up on this and how I can considerably improve my chances of getting placed in core ece companies. What are some things I should keep in mind if I'm targetting package of around (30-35lpa +)\nIt may sound unrealistic and everything but for once just be brutally honest and guide me on what I need to do exactly do get there. All guidance is welcome, particularly seniors and alumni\n\nOh yes and the placement office, I see it everyday, what exactly happens there?",
  "metadata": {
    "author": "clutch_player24",
    "url": "https://www.reddit.com/r/PESU/comments/1nq4xzd/placementshow_are_core_ece_placements_at_pes_for/",
    "permalink": "/r/PESU/comments/1nq4xzd/placementshow_are_core_ece_placements_at_pes_for/",
    "score": 22,
    "created_utc": 1758801957,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ng494hw",
      "body": "Check FAQs and search this subreddit please."
    },
    {
      "id": "ng4bdgx",
      "body": "sapne suhane mc ke /s"
    },
    {
      "id": "ng4gkla",
      "body": "CSE placements only will become dogshit for the 2029 batch and blud is asking about core ECE placements"
    },
    {
      "id": "ng4hlj3",
      "body": "😆 dont do comedy bro.... 30 lakhs for core ece... this is iit bangalore not iit bombay.../s"
    },
    {
      "id": "ng4mxkz",
      "body": "Macha CSE placements are only terrible and youre asking about ECE😂😂😂😂😂"
    },
    {
      "id": "ng4x4xg",
      "body": "This ain't an NIT or IIT blud.If you wanted 30 lakh for ece core you should've worked for IIT, top IIITS or BITs or atleast an NIT level college. At the worst case an RVCE level college.A more realistic expectation is to clear GATE  or crack a top masters school abroad and to then try to meet those expectations."
    },
    {
      "id": "ng532p3",
      "body": "Are there any other private college except BITS, where this is possible?"
    },
    {
      "id": "ng55gsd",
      "body": "Ah ok......thanks for the info\nAs you said, try networking with industry experts as much as possible along with upskilling - is it through linkedin or contact known people and then get in touch with people they know and so on...?\nAnd yes you said, grind as hard as possible, I'm 100% for it, but could you clarify whether you are referring to skill development? Or in getting a good cgpa?"
    },
    {
      "id": "ng5fgym",
      "body": "Around 25-30 ppl got placed(in campus placements, exclusively core ece)in 2025. 2026 batch is facing the same issue, moreover the process is completely random and is completely based on luck and how well a student cheats in the placement test. One can't rely on their merit, hard work and practical skills. Cuz if u r honest and have worked hard for 3 years hoping that it will reward during placements, u should remember that u r competing with those who r really good at cheating. They can score more than the genuine guys,10x faster. I'm telling this cz the students who have been doing good in their academics , projects are not getting shortlisted for interviews. They rarely get shortlisted. College doesn't take any responsibility in providing fair opportunity , If u want to get what you want u should have the courage to cheat(inexperienced cheaters have more probability of getting caught). So if u r aiming high, work hard and learn to cheat. Otherwise ur hardwork, honesty will be buried. If you r aiming for masters this is a good place, study well and target good colleges."
    },
    {
      "id": "ng86d9q",
      "body": "so frank u are imoa i like ur harshness senior"
    },
    {
      "id": "ng956dv",
      "body": "Build your own startup. Vibecode it"
    }
  ]
}