{
  "id": "1nq6rkn",
  "title": "[Rant] IBM SHORTLISTED 370 PPL FOR INTERVIEWS?????",
  "content": "Guess what, I am still not shortlisted. But seriously, how many ppl are they even going to take this time? Highest number of ppl a company might take in PES history?????",
  "metadata": {
    "author": "Living-Baseball8994",
    "url": "https://www.reddit.com/r/PESU/comments/1nq6rkn/rant_ibm_shortlisted_370_ppl_for_interviews/",
    "permalink": "/r/PESU/comments/1nq6rkn/rant_ibm_shortlisted_370_ppl_for_interviews/",
    "score": 61,
    "created_utc": 1758806874,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ng4gy6n",
      "body": "What was the gpa cutoff for shortlist?"
    },
    {
      "id": "ng4h499",
      "body": "I guess around 100 or more; They said they had a target to hire 260+ people from a few clg combined, they might fulfill that completely through pes as well(if everyone performs well in interviews)"
    },
    {
      "id": "ng4h8i0",
      "body": "about time we had an IBM PES just like IBM ISL"
    },
    {
      "id": "ng4ha2z",
      "body": "There is no gpa; For OA it was 7."
    },
    {
      "id": "ng4ij2z",
      "body": "Just be lucky bro (i'm not shortlisted either)"
    },
    {
      "id": "ng4jfde",
      "body": "Bro wtf shortlisitng is it I don't even understand   \nI have friends who solved both didn't get shortlisted I solved both, even I did not get shortlisted no clue wtf is happening????\n\nis my luck bad is it my fault I have no clue???"
    },
    {
      "id": "ng4jr55",
      "body": "There is a chance your code got plagarised."
    },
    {
      "id": "ng4jyqv",
      "body": "Total 371 shortlisted how on the earth they will conduct interview in one day, thats a huge crowd"
    },
    {
      "id": "ng4kboz",
      "body": "Bruh I did not copy but......"
    },
    {
      "id": "ng4ktbp",
      "body": "They will have a coin toss or roll a dice 😁"
    },
    {
      "id": "ng4l3zn",
      "body": "In another 2-3 years 10% of ibm workforce will be from pes 😂"
    },
    {
      "id": "ng4l762",
      "body": "Will they be coming for a cloud role, or was the last one the final opportunity?"
    },
    {
      "id": "ng4l7h0",
      "body": "They will call the candidates and toss the coin"
    },
    {
      "id": "ng4lbva",
      "body": "what if they layofff"
    },
    {
      "id": "ng4ls0j",
      "body": "Every other company is laying off; Layoff is something no one can predict, if you are lucky you will keep your job otherwise even if you join FAANG you will get laid off(in this market)"
    },
    {
      "id": "ng4lzgp",
      "body": "They will come for cloud role in October during October(probably) as per recent trends."
    },
    {
      "id": "ng4wmjb",
      "body": "I did both except 2 test cases getting tle'd ,losing hope at this point. so many people in the shortlist ik have cheated"
    },
    {
      "id": "ng54ayz",
      "body": "Only the people who did complete 2 questions got shortlisted along with plagiarism check. Atp everybody is copying, we are literally competing against LLM instead of students, so you have to be very lucky to get shortlisted."
    },
    {
      "id": "ng5dy6s",
      "body": "They come again lol wtf"
    },
    {
      "id": "ng5tkue",
      "body": "There seems to be a strong luck factor in shortlisting"
    }
  ]
}