{
  "id": "1nq74o0",
  "title": "[Placements] What the **** is that IBM shortlist",
  "content": "There were only 2 DSA questions for round 1 which EVERYONE has solved ,how did they even shortlist \nAnd how they gonna conduct interview for 350ppl",
  "metadata": {
    "author": "Sea_Mail_2026",
    "url": "https://www.reddit.com/r/PESU/comments/1nq74o0/placements_what_the_is_that_ibm_shortlist/",
    "permalink": "/r/PESU/comments/1nq74o0/placements_what_the_is_that_ibm_shortlist/",
    "score": 42,
    "created_utc": 1758807763,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ng4klmc",
      "body": "I think they Shortlisted top 400 people in that they eliminated the people with plagiarism flagged; \nGod only knows how they will conduct interviews for 350+ students that too 2 rounds;"
    },
    {
      "id": "ng4l3so",
      "body": "What do you think they'll take this time, after seeing what they did before?"
    },
    {
      "id": "ng4l8kf",
      "body": "Ibm software labs took 60 people last year; Considering the shortlist I think atleast 100."
    },
    {
      "id": "ng4lkl3",
      "body": "The prior one was isdl they didn't had a goal to hire that many people so they did that; Ibm software has a goal to hire 260 people for 5-6, so most probably they will finish most part of hiring in pes as pes has been their goto clg from last 2-3 years"
    },
    {
      "id": "ng4mubj",
      "body": "Probably they will take 50+ for this role"
    },
    {
      "id": "ng5i13c",
      "body": "They probably filtered out based on how fast everyone did, and how genuine all were, and about interviews, they may conduct on multiple days or maybe virtually then"
    },
    {
      "id": "ng957pd",
      "body": "How does a company know a candidate out of 300 is \"genuine\"?"
    },
    {
      "id": "nga47lu",
      "body": "during test, if u had cheated, it wud be very evident. They have their own ways to find it out."
    },
    {
      "id": "nga9y25",
      "body": "I really hope this is true. Too many stories of cheaters not only not getting caught but getting into the companies and working there 🙏"
    },
    {
      "id": "ngbl6v1",
      "body": "so ur telling all 300 people were genuine, idts"
    },
    {
      "id": "ngcfbb7",
      "body": "I didnt mean that, I meant IBM will find out if they are genuine or not by seeing test cases passed in the coding round, and how many copied etc., if they copied, they wud have removed"
    },
    {
      "id": "ngcqh58",
      "body": "bruh i solved both questions without copying any explanation on why i did not get selected while my friend who copied got selected ? they dont see shit and just randomly shortlist"
    },
    {
      "id": "ngcrwdp",
      "body": "Hmm weird, its unfair true, try other companies its Okay. After all placements needs *bit of luck as well*"
    }
  ]
}