{
  "id": "1nqjte7",
  "title": "[Discussion]Anybody else hear a strange phone ringing sound at EC Campus Hostel at night?",
  "content": "From the past few days since the ISAs started, there's this strange phone ringing sound coming from somewhere in EC campus. I stay up late to study and at exactly 2 am in the morning or 3 am, the ringing begins. The noise is really loud too, so much that it takes your mind off of what you're trying to study. I assumed it was just a heavy sleeper who didn't turn off his alarm to wake up and study for the ISA, but the problem is that the ringing continues for more than 30 minutes at a time. If it had been an alarm atleast the roommates would've woke him up. I tried to isolate the source of the sound by moving around the corridor, on different floors too, but as soon as I enter the corridor, the sound just stops, and begins again when I come back to my room and the worst part being that i can't even make out whether it is coming from the upper or lower floors.\n\nHas anybody else observed this too? ",
  "metadata": {
    "author": "Ariiii_10",
    "url": "https://www.reddit.com/r/PESU/comments/1nqjte7/discussionanybody_else_hear_a_strange_phone/",
    "permalink": "/r/PESU/comments/1nqjte7/discussionanybody_else_hear_a_strange_phone/",
    "score": 42,
    "created_utc": 1758837275,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ng7sdqm",
      "body": "Damn we got ghosts haunting PES during ISA now"
    },
    {
      "id": "ng8kcxr",
      "body": "doredaddy still terrifying us"
    },
    {
      "id": "ng8ufo4",
      "body": "daddy is making sure that everyone studies for isas"
    },
    {
      "id": "ng94rxi",
      "body": "Babe wake up new pesu lore dropped"
    },
    {
      "id": "ng9bms5",
      "body": "this is a sign to sleep normally"
    },
    {
      "id": "ng9cfg3",
      "body": "I think it comes from salon. Probably the barber left his alarm clock or something"
    },
    {
      "id": "ng9ejar",
      "body": "But why would it go on for 20 minutes at a time, go away for 10 minutes and come back again. \nAlso the sound seems to travel from one place of the hostel to another too"
    },
    {
      "id": "ng9mivs",
      "body": "https://preview.redd.it/0ctmv15lmgrf1.png?width=1440&format=png&auto=webp&s=48fb895456b4b507fb4321097dcb9b07f9a24c64"
    },
    {
      "id": "ng9n1hu",
      "body": "ISA's made me schrizo"
    },
    {
      "id": "ng9pekw",
      "body": "Bro I thought I was the only one I stay in EC hostel too and I’ve been hearing the exact same thing around 2–3 am. At first I assumed it was someone’s alarm or maybe even a landline phone somewhere, but it’s way too persistent. What creeps me out is that the sound doesn’t have a fixed direction you walk around to track it, and it just fades away or stops completely, then starts again when you’re back in your room. Almost like it doesn’t want to be found l. It feels less like a normal phone ring and more like some glitchy loop. Honestly it’s been messing with my concentration too."
    },
    {
      "id": "ng9qat9",
      "body": "It really does mess up your concentration. Also yesterday I tried to record the noise  TWICE. It had been ringing for 15 minutes straight and when I started to record it, it just went away. \nWhen it starts it always stays on for 15 minutes minimum, but when I tried to record it for the second time, it started and I started recording again , but it stopped as soon as I did that. It stopped after 3 second which has never happened before. After a while you listen to it at a distance and slowly it gets louder as if the sound source is moving towards you. The sound stopping as soon as I started recording was probably a coincidence but it's still really creepy"
    },
    {
      "id": "ng9ryz0",
      "body": "Maybe the universe doesn't want you to study so its spawning random ghosts to distract you."
    },
    {
      "id": "ng9vqgb",
      "body": "Chitty doing some freaky ahh shit"
    },
    {
      "id": "nga7rbt",
      "body": "ghosts travel bro, so sound keeps moving"
    },
    {
      "id": "ngbd9r7",
      "body": "dore's ghost in ec campus?"
    },
    {
      "id": "ngbnp4g",
      "body": "Is it in boys hostel?"
    },
    {
      "id": "ngbx0ud",
      "body": "Yess"
    }
  ]
}