{
  "id": "1nrj67f",
  "title": "[Placements] cooked Job market for 2029 batch /?",
  "content": "I hv seen the rant of seniors both in online and offline, Im cse 2029 batch, ik its hard to say abt wt wil happen in 2029 , but can y'all tell to the nearest accuracy how cooked are we? and wt projects/skills might standout (specifically for SDE or web development roles)\n\nI would be grateful if anyone says wt things I gotta grind in the coming years(anyhow I hav a lot of time rn in 1st semester) ",
  "metadata": {
    "author": "Full_Session9060",
    "url": "https://www.reddit.com/r/PESU/comments/1nrj67f/placements_cooked_job_market_for_2029_batch/",
    "permalink": "/r/PESU/comments/1nrj67f/placements_cooked_job_market_for_2029_batch/",
    "score": 1,
    "created_utc": 1758938044,
    "flair": "Placements 🤑",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ngf5w7g",
      "body": "Just keep grinding dude. That ain't in our hands. What we can do is to focus on ISAs and ESAs and to try and upskill as much as possible in these 4 years."
    },
    {
      "id": "ngf6178",
      "body": "WT projects do not stand out in particular. I would say Big Data projects do stand out further. 2029 is a long time away to say it’s cooked for that batch. Regardless start some striver/neetcode sheet if you want to start preparing from now"
    },
    {
      "id": "ngf67px",
      "body": "bruh , I meant wt as 'what' ,"
    },
    {
      "id": "ngf7n0f",
      "body": "but thanks for the guidance , cheers!"
    },
    {
      "id": "ngf85ik",
      "body": "And he means wt as web tech"
    },
    {
      "id": "ngf8jqz",
      "body": "oh, I don't know any of these, im fresher\n\n![gif](giphy|UksRwZQXDijMUSy72G)"
    },
    {
      "id": "ngf93be",
      "body": "\"I was top in school\" 🤣🤣🤣🤣. Bro's about to be humbled."
    },
    {
      "id": "ngfer3f",
      "body": "im not bragging about it , ik it aint a big deal to top in school, its just tht my performance went down in 11th and 12th, I was not disciplined enough , y y'all in reddit always expect downfall for others :(   \nseems like u had a downfall in pes , thts y u r commenting this TT"
    },
    {
      "id": "ngffa57",
      "body": "wait till isa 1, im in physics cycle, 27th it starts , come back nd see my marks"
    },
    {
      "id": "ngfg2tk",
      "body": "Brother, no one can predict how job market will be 4 years later, I would recommend you to focus on grinding and keep up-skilling, instead of just ranting about it here."
    },
    {
      "id": "ngfghmw",
      "body": "Famous last words"
    },
    {
      "id": "ngfgjwy",
      "body": "im not ranting wthh, pls read the whole thing, I said its not possible to predict,  I asked what im supposed to do to stand out of the crowd\n\nanyways thanks for ur view, cheers!"
    },
    {
      "id": "ngfgq3b",
      "body": "oh now im definitely coming back with my report of isa 1, rowlet Anna is here"
    },
    {
      "id": "ngfqqf6",
      "body": "When I walked in here, three years ago, I did not care how the placements were, nor did I know anything about the stats. 2022 was peak recession and things weren't going too well back then. The best thing you can possibly do is not think about it at all, maximize your college experience, be happy, learn things. Placements will come eventually. You can deal with it when they do. Now is not the time"
    },
    {
      "id": "ngftuk1",
      "body": "top 10 pes tuff moments"
    },
    {
      "id": "ngfw3md",
      "body": "There is a difference between confidence and arrogance. Just saying"
    },
    {
      "id": "nggfnx3",
      "body": "Build a LLM from scratch."
    },
    {
      "id": "ngh45mu",
      "body": "aka build a startup"
    },
    {
      "id": "nghhjvc",
      "body": "if someone TELLS you what youre supposed to do to stand out of the crowd, youre not gonna stand out of the crowd"
    },
    {
      "id": "nghml8s",
      "body": "Trying to impress Rowlet Anna I see 😺"
    }
  ]
}