{
  "id": "1nrvag7",
  "title": "[Question] Full-time offer starting Jan 2026 - Is this allowed in final sem instead of internship?",
  "content": "Hey everyone! Need some advice from seniors or anyone who's been in a similar situation.\n\nI'm currently in my 7th sem and interviewing with a pretty big startup off-campus. They've made me a tentative offer but want me to start full-time from January 2026 (which would be during my final semester).\n\nHas anyone dealt with something like this before? Is the college okay with students taking full-time positions during 8th sem instead of doing the traditional internship? Will PES accept the full-time role in place of internship for the required credits?\n\nWould really appreciate any insights on this.",
  "metadata": {
    "author": "NeRDBOI24",
    "url": "https://www.reddit.com/r/PESU/comments/1nrvag7/question_fulltime_offer_starting_jan_2026_is_this/",
    "permalink": "/r/PESU/comments/1nrvag7/question_fulltime_offer_starting_jan_2026_is_this/",
    "score": 1,
    "created_utc": 1758979790,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "nghayk1",
      "body": "College generally wont be okay, before that, I am surprised startup agreed without asking a degree cert, anyway that being said, u shud talk to ur HR in the startup & also department internship coordinator about this and ask, that wud be better"
    },
    {
      "id": "nghcdfy",
      "body": "Odds are that PES won't allow you. You'll have to push your starting date to at least June. It's best to simply reach out to your internship coordinator and work it out, since at the end of the day they have the power to decide and whatever we say is just speculation."
    },
    {
      "id": "nghksd4",
      "body": "Or just ask them to convert jan to june period in an internship lol, then it will be allowed and you’ll get credits as well. As you yourself are downgrading it to internship, the startup should not have any problem. Just explain them the situation, and try to convince them of the arrangement."
    }
  ]
}