{
  "id": "jxgxmw",
  "title": "Should I join PES?",
  "content": "So glad I found this sub!\n\nOkay so, I wrote PESSAT and I got ECE in electronic city. This is too far from my house. I have an option to study ECE in BMSIT, which is very close to my residence. Also 3.3 LPA is a lot for my family to afford. ://\n\nWhat should I do?",
  "metadata": {
    "author": "lookingforajob111111",
    "url": "https://www.reddit.com/r/PESU/comments/jxgxmw/should_i_join_pes/",
    "permalink": "/r/PESU/comments/jxgxmw/should_i_join_pes/",
    "score": 5,
    "created_utc": 1605840004,
    "flair": null,
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "gcwx6y9",
      "body": "BMSIT is a fairly new college and I've heard from friends that the placements there are not great. PES on the other hand has a good placements record (only for CSE and ECE). Moreover, PES being a deemed university, has control over its administration and academics. They're very efficient when compared to VTU as they have to deal with fewer students and they also change their syllabus regularly to stay up-to-date with what the industry is demanding. But the campus is small and almost at the outskirts of the city. I spend 3 hours everyday for travel. Now coming to the fees, yes, they are high. But being in a better college gives you higher chances of getting placed in a good company. At the end of the day it is your decision. PES has experienced faculty and provides more opportunities for getting exposure to the field but the fees are high and you would have to spend a lot of your time travelling. BMSIT on the other hand isn't that great but since it's nearer to you house, you could use the time you would have spent travelling for something productive and also pay less fees.\n\nP.S. PES offers scholarships worth upto 50% of your tution fee based on your merit. They've cancelled it this year however as they've reduced the fee due to covid."
    },
    {
      "id": "gcwxkdy",
      "body": "Overall I'd say joining PES is better because of the placements. Plus if the journey is too long for you, there's always the hostel option you could look at. All the best with your decision!"
    },
    {
      "id": "gcx1d0a",
      "body": "Right thanks a lot man\nWait they've cancelled the scholarship? No way! They told they give 40% off for the top 20% of the class when I went to the councelling"
    },
    {
      "id": "gcx1djl",
      "body": "Thanks man :)"
    },
    {
      "id": "gcx1per",
      "body": "They've cancelled it for this year only. As a lot of students were demanding a fee reduction due to the covid pandemic, they reduced the fee by 10% but cancelled the scholarship. They say it is only for this academic year. I'm not sure about the freshers though."
    },
    {
      "id": "gcx2s72",
      "body": "Hmmm okay"
    },
    {
      "id": "gdfsj9q",
      "body": "One more thing actually which is important\n\nThe management right now isn't even trying to handle the pandemic well. They're making us have offline exams and are even letting people in without their covid tests done. It's a disaster and the entire student community is given no choice by the management."
    },
    {
      "id": "gdfujsn",
      "body": "Yeah I'm probably gonna go with BMSIT"
    },
    {
      "id": "gdltvqx",
      "body": "Came here to write this xD"
    },
    {
      "id": "gk1vah1",
      "body": "Mate the schoarship is 52k, thats 15-16 percent of 3 lakhs. and they only offer this to the top 5 percent of the class"
    },
    {
      "id": "gtjqtg1",
      "body": "If you did, good."
    },
    {
      "id": "gtkbwww",
      "body": "Wrong, they give 54k \\*per semester\\*, and they give it to the top 20%. Top 2% get CNR scholarship that is 70k."
    }
  ]
}