{
  "id": "okmsx8",
  "title": "Current status of college",
  "content": "Hello r/PESU, I am planning to join PES by writing PESSAT soon. I would like to know more about the current students life at PES, hows the Quality of Life. How are the academics and college life.\n\nAlso what all non-academic shit can we be part of?\n\nI have heard exciting stuff at PES, cant wait to know more.",
  "metadata": {
    "author": "[deleted]",
    "url": "https://www.reddit.com/r/PESU/comments/okmsx8/current_status_of_college/",
    "permalink": "/r/PESU/comments/okmsx8/current_status_of_college/",
    "score": 5,
    "created_utc": 1626329401,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "h58xij4",
      "body": ">Quality of Life\n\nQuality? What is a `life`?"
    },
    {
      "id": "h5apyqv",
      "body": "Academics is pretty good? So you enjoy writing a computer based test for internal exams which are as hard as End semester exams?\n\nClub culture? Non-existant in EC campus. Barely any of them are actually active.\n\nAll the fests and workshops happen in RR campus, there's only one fest that happens in EC campus.\n\nYou're spot on about the campus life. \n\nAcademic competition is so good that it gets depressing."
    },
    {
      "id": "h5asu62",
      "body": "No, PES is not ahead of it's competition."
    },
    {
      "id": "h5cnavt",
      "body": "As much as I'd like to be salty af as usual, this college still has something to offer to a class of students who at the end of 4 years want a good job. But be prepared to do what it takes to get that placement. Others have already spoken their mind."
    },
    {
      "id": "h5cxxkn",
      "body": "If you're academic, the college has a lot to offer. The college has good opportunities for you to do your own thing. Don't expect some beautiful fancy campus here. Don't expect a campus at all, it's a construction site rn. \nMost professors are great, the management is kinda annoying and will get on your nerves. \nThe college will be very supportive if you want to do things like research, entrepreneurship, and so on.  \nThis is however a university and they are governed by the laws that they make. The support for research and entrepreneurship is department wise, mainly depending on your HoD. You will have endless assignments and high attendance requirements. If you're looking at placements after your undergraduate, you will have a smooth ride if you're looking at IT/CS. \nTLDR - come to PESU if your primary goal is to study, as this place works like a school."
    },
    {
      "id": "h74703i",
      "body": "Arey Maa Chudi Padi hai"
    },
    {
      "id": "ha95x89",
      "body": "Why r u spreading lies."
    }
  ]
}