{
  "id": "p2vqrm",
  "title": "I have appeared for PESSAT 2021 recently and have a few queries?",
  "content": "I have appeared for PESSAT and am certain of getting at least ECE (RR CAMPUS)\nMy JEE Main percentile is 95.25\nI also gave Bitsat 2021 and scored 260, so there I could get chemical/civil or MSc Mathematics with B.E.\n\nI have to ask which one is better option and is PES anywhere comparable to BITS?\n I am waiting for JEE Advance and looking for a decent backup option just in case.\n \nPlus how is the culture in PES cause BITS certainly leads in that department.",
  "metadata": {
    "author": "[deleted]",
    "url": "https://www.reddit.com/r/PESU/comments/p2vqrm/i_have_appeared_for_pessat_2021_recently_and_have/",
    "permalink": "/r/PESU/comments/p2vqrm/i_have_appeared_for_pessat_2021_recently_and_have/",
    "score": 5,
    "created_utc": 1628757284,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "h8mvpsy",
      "body": "PES RR campus is known widely only for the CS branch . All other branches are just like what your average college will offer to you"
    },
    {
      "id": "h8mvvcr",
      "body": "Could you tell anything about CSE at Electronic city campus."
    },
    {
      "id": "h8mxpdk",
      "body": "Bruh dont join pes.......they will tell you they got good placement but they wont tell you they have 1000+students only in cse and there us ece students as well .......come to pes when you have no other options. Honestly speaking ...this place is shit..college life sucks college management will fuck you in every direction and after a year you will fell you are paying them for your own harassment. So do yourself a favour ....dont join pes. Please."
    },
    {
      "id": "h8n2c68",
      "body": "PES sucks, it ain't worth it. Go to bits peacefully, why'd you want to come here and cry."
    },
    {
      "id": "h8n5wpc",
      "body": "The only reason I am inclined towards PES is that I don't have enough marks for CSE anywhere (GENRAL CATEGORY BOY)"
    },
    {
      "id": "h8nhj6a",
      "body": "Only placements are good here nothin else chumma why you wanna get railed here. If you really only want cse then come to pes (as last option), if you are down to take any branch go off to bits peacefully"
    },
    {
      "id": "h8nvn8z",
      "body": "Let's get one thing straight - both campuses are not equal. There are major tradeoffs, each campus has its pros and cons though. One important insider info is that the Electronic City campus will be converted into a fully medical college and the CSE department will be shifted to RR campus anyhow. The timeframe for this is however unkown, may happen within the next 2-4 years.\n\nEC campus has a much better physical campus. Lots of open space and from my personal experience, the people here are a lot kinder and helpful. There's a collaborative spirit vs the extremely competitive spirit at RR (pretty natural since the highest rankers are quite competitive and end up in RR)\n\nThe CSE course syllabus is the same for both campuses and we're graded on the same papers. However, the opportunities are much greater in RR, many companies still treat the EC campus as PESIT and not under PESU which may significantly harm your placement opportunities if you're considering it. Another important point to note - a lot of the CSE faculty at EC campus have left the college as this campus has no future (conversion to medical college). Hence, the existing teachers are forced to teach a variety of subjects that they don't have sufficient knowledge about.\n\nCSE at PESU (any campus) has the benefit of having its syllabus updated yearly. Hence it is much more relevant than any other engineering college's CSE programs. The tradeoff is that PESU gives you a lot of work to finish during the sem so you won't be able to focus on other things. Other colleges are liberal and you'll be free to pursue other interests and build your professional skills on your own.\n\nBITS offers you a lot of freedom and is better in every way I can possibly think of. I have close friends in BITS and hence know a lot of the details. We had some ex-BITS faculty teach us and they were absolutely brilliant. They left because PESU management is horrible and treats teachers pathetically."
    },
    {
      "id": "h8o3wqq",
      "body": "BITS any day. Worth the higher fees and seemingly inferior courses ( it's better to do chemical in bits than anything other than CSE in PES Rr campus). Please don't come here. Not on pessat. No. Can't see ppl waste their parents money. Please."
    },
    {
      "id": "h8o5t42",
      "body": "CS is king here. ECE plays second fiddle with other branches being lucky to even get instruments to play. I won't say that placements are the only thing that are good about the place - I was exposed to a lot of opportunities, but it was all mostly CS exclusive with ECE getting a bit of action.\n\nIf you're keen on doing a specific subject (read: CS or bust), then PES will do its job (disclaimer - I only speak for the ring road campus)\n\nIf you're flexible with branches/courses and you want to have a more chill life on campus, bits will serve you better. BITS is academically more rigorous as well."
    },
    {
      "id": "h8o6d4i",
      "body": "Clear and to the point."
    },
    {
      "id": "h8qgn0y",
      "body": "Hey man im pretty much in your state. Btw how is pessat? and I think PES takes Mains score also, what do you think you can get with your percentile?"
    },
    {
      "id": "h8qo8o8",
      "body": "We'll know on 20th August."
    },
    {
      "id": "h8qpvgz",
      "body": "how hard is pessat?"
    },
    {
      "id": "h8qs7o5",
      "body": "Questions are easier but 180 questions in 3hours is a difficult task , so I would suggest to attempt cautiously. \nEnglish section will definitely help boost your marks.\nYou can checkout the pattern at https://pes.edu/syllabus/"
    },
    {
      "id": "h9mnszk",
      "body": "hey did u get the jee mains resutls for PES"
    },
    {
      "id": "h9rqq1d",
      "body": "Waiting, \nAlso I have emailed them today."
    },
    {
      "id": "h9rrfrz",
      "body": "i heard theyve already given it out, i think were not selected. guy with 98.5 apparently got Electronics in RR."
    },
    {
      "id": "h9rujmr",
      "body": "🤯🤯 But why would someone with 98.5 take electronics in RR, he certainly has chance in NITs. I think we would have to attend the counseling on 1st September."
    },
    {
      "id": "h9rwsek",
      "body": "Also why the fuck are people with higher marks blocking seats everywhere?"
    },
    {
      "id": "h9rzteb",
      "body": "I have got the reply, it says \"Candidate who have got selected, they have got the SMS and Email regarding the same please do check your spam and promotional folders, if not final confirmation will be sent on or before 25th Aug\""
    },
    {
      "id": "h9saaaf",
      "body": "bro got the mail, i got EE, Mech and BioTech at RR"
    },
    {
      "id": "h9sg0f7",
      "body": "Same here, btw what was your percentile?"
    },
    {
      "id": "h9si5gb",
      "body": "95.5. U taking EEE at PES??"
    },
    {
      "id": "h9sk1fy",
      "body": "I also gave PESSAT and we have the deadline till 27th to pay the fees to accept, so I would wait for the result there and also I would consider ECE or CCE at LNMIIT Jaipur at this percentile."
    },
    {
      "id": "h9soztf",
      "body": "hmm so ure fine with EEE"
    },
    {
      "id": "ha58xd9",
      "body": "How was your PESSAT result?"
    },
    {
      "id": "ha590zh",
      "body": "I got rank 240 in PESSAT, that means I will surely get CSE RR campus, now can you tell me if it is my best option or should i consider others?"
    },
    {
      "id": "ha5bfai",
      "body": "pretty good, 2xx, wbu?"
    },
    {
      "id": "ha5drex",
      "body": "Answer doesn't change much. If you're keen on doing CS then you'll have lots of opportunities here. If you're ok with doing something different, then BITS might be a better choice. \n\nPersonally, I picked branch over college just because I struggle to do things I don't enjoy. My option was Mech @ Hyderabad if my memory serves me right, but I was keen on CS, and now after graduation I'm super happy with my decision.\n\nOn the flip side, I know people who didn't have a good time here and would have much rather have gone to BITS. At the end of the day, it depends on your personal preference - what your interest is, how much does \"campus life\" matter to you, and what are you hoping to get out of college.\n\nWrt to the campus part, once you actually attempt to make friends and explore things, you'll find plenty of fun stuff to do and you'll make some great friends in the process.\n\nEdit: also yes, you're gonna get CS for sure at RR"
    },
    {
      "id": "ha5e85v",
      "body": "Same, so are you considering PES now?"
    },
    {
      "id": "hapg1nx",
      "body": "I might say a very controversial statement but I strongly believe that branch >>> college. Studying something you may necessary not like regardless of name of college, infrastructure or college life is much harder regardless of what anyone says."
    }
  ]
}