{
  "id": "p84yyt",
  "title": "PES via JEE Mains",
  "content": "Did anyone get the results for PES for the JEE Mains quota?",
  "metadata": {
    "author": "JacksonDonaldson",
    "url": "https://www.reddit.com/r/PESU/comments/p84yyt/pes_via_jee_mains/",
    "permalink": "/r/PESU/comments/p84yyt/pes_via_jee_mains/",
    "score": 5,
    "created_utc": 1629465343,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "h9qkhfa",
      "body": "Omg just stay away from PESU guys. Leave it aloneeeee!!!"
    },
    {
      "id": "h9qz3k5",
      "body": "I know I won't get in through jee but I'm still waiting for it for no reason xD"
    },
    {
      "id": "h9qzsil",
      "body": "how much did u get?"
    },
    {
      "id": "h9sg4mv",
      "body": "Why though?"
    },
    {
      "id": "h9sj1l4",
      "body": "You want to die on the inside for 4 long years and then go out with heavy regret in your heart having no good memories of the place? Just because this college sucks the life out of you and then some more."
    },
    {
      "id": "h9sjrxr",
      "body": "Look, I have seen this sort of answers before, can you elaborate because I really want to know what's so bad about this college? Because  they have nice rep in the eyes of parents and so called mentors. Please I need to know."
    },
    {
      "id": "h9sn64b",
      "body": "Reputation in the eyes of mentors and parents is good for a reason. Things are so unnecessarily complex here and the kind of dirty tricks the management employs to coerce us into doing what they want.\nThis management only wants placements. And you know what. The reason the placement are so good is because, they basically force you to take the first job they offer you. So if you get a job early on the placement process, and you chose to not take it to try for a higher package, you are disqualified for sitting for further placements. Once you accept a job offer, you can not sit for further placements. And mechanical electrical core placements are non existent.\nCivil branch is extinct. I don't think they are offering civil for the new batch. Biotechnology placements is zero.\nOnly CSE and ECE get it. And there too it's mostly because the college basically forces you to get the first job you are offered or get the fuck out of the placement process.\n\nThe academics are damn fucked. Management aside, there is no coordination. In between departments and even in departments. Mechanical HOD is big pain in the ass and he will make your life a living hell. Not kidding, a few faculty members have left the department since he joined in.\nThe faculty is a joke. In all departments. They are subject to heavy shit by the management and even they can't stand up to them.\nThere is literally NO SIGN OF EXTRA CURRICULAR activities. Now there are clubs but 99% are related to studies like robotics space and car building and drones. No sports. Drama club is inactive. Dance club is there for namesake, after pandemic little to no activity there. Music clubs are okay. But then no encouragement.\nOne writing club which is usually ignored even by the club members.\n\nIn the name of recreation they made a reading room on the roof of a building where you can usually find couples making out.\nHostels both boys and girls. Don't. Don't. Just don't. These guys are so dense.. Omfg. No. No.\n\nIn general, social life if you are not so out going person in nature is basically zero. People form cliques and it's hard to break into and assimilate.\nThere's way too much bull shit to fit in one comment. In essence don't even consider PESU"
    },
    {
      "id": "h9snyjs",
      "body": "Alternatively, it is a good college if you don't already have a life, don't plan on having one, do nothing but study all the time. And aspire to get a job after engineering. Pes is a great place. You won't have a college life with friends and stuff but you will have a job at the end of it. At which you can again go on to be hard working and commit all your time to it and have nothing fun to do with all that money you get  but hey you wanted it."
    },
    {
      "id": "h9st2o3",
      "body": "I would give you a medal for this explanation but \" mai gareeb hoo \""
    },
    {
      "id": "h9suixe",
      "body": "Hum sab hai bhai. Bas idhar mat aao."
    },
    {
      "id": "h9surzo",
      "body": "Where's the mod. Pin this comment bro."
    },
    {
      "id": "ha0cbou",
      "body": "hey, just out of curiosity what are your thoughts on RVCE or BMSCE?"
    },
    {
      "id": "ha0d031",
      "body": "Depends on branch. Engineering is just as hard anywhere. The course is structured to fuck you in the ass. But then PESU goes out of its way to make it even more difficult. At least RVCE and BMS follow a system. VTU. And it's much more reliable.\nCampus of both are way better than pesu. All we have is a huge ass construction which makes so much noise and dust that campus life is basically breathing dirt.\nBoth of them are way better choices than PESU in terms of the life that they offer."
    },
    {
      "id": "ha0d3ek",
      "body": "The first round of jee seat allotment is over! Only the selected candidates have been informed about further procedures"
    },
    {
      "id": "ha0ddyo",
      "body": "ok, I'm getting PESU CSE ECE campus, BITS Pilani Mathematics MSc (5 yrs), KIITS CSE, IEM Kolkata CSE, IIIT Bhubaneshwar CSE\n\nwhich one do you think I should opt for, considering I'm a dropper\n\n&#x200B;\n\nI want to study CSE only"
    },
    {
      "id": "ha0dybk",
      "body": "I don't know. That's your call. I can just say don't take pesu. It's not worth. And bits also because you are not getting cs there. The rest colleges. I don't really know."
    },
    {
      "id": "ha0e6ui",
      "body": "there is a chance that I might get CS in BITS\n\nthe course is like this: 4 years of Bachelors and 1 year of Masters, so I'll get a Masters in Mathematics but a Bachelors degree in some Eng. branch which will be allotted at the end of 1st year on the basis of the GPA\n\nSo if I get around 8.5 GPA or above I will get CSE but otherwise I'll be stuck with some branch for 5 years which I don't want, is it worth the risk"
    },
    {
      "id": "ha0eql8",
      "body": "I don't sit and do risk analysis for freshers. But yes if you are getting any thing in BITS I would say go for it. As a mechanical engineering final year student, I can easily very easily say CS is now universal and basic everyone should learn it irrespective of what they do. Unless you get Civil or Bio tech, you will be fine in whatever branch you get. Because come on its BITS. I imagine life there being better than any other college that you are getting. Do some research on it.\nDon't stress too much you will be done with your college before you even realise why you are there."
    },
    {
      "id": "ha0etg5",
      "body": "ok thanks \n\nI really appreciate the insight"
    },
    {
      "id": "ha5yihl",
      "body": "Do not take bits, my friend too joined the integrated course last year thinking he will study hard and get CSE but this year due to the exams being online the cse cutoff rose very high and even after scoring 8.5+ gpa he is now stuck with EEE, if the branch doesn't matter much to you then you can go ahead but if your interest lies in cse then give Preferrence to branch since a few years down the college won't matter much but your skills would"
    },
    {
      "id": "ha601fj",
      "body": "I got a rank of 151 on the PESSAT, so I think I might get CSE in the main campus\n\nIs it worth joining, I'm mainly concerned about the campus and hostel life (also, is hostel compulsary?) other than that only other college I can think of is IIIT Bhubaneshwar CSE\n\n&#x200B;\n\nThanks for the advice btw"
    },
    {
      "id": "ha60oq1",
      "body": "My suggestion would be to take IIIT Bhubaneswar if you are getting cse there. and no the hostel is not compulsory you can opt to live outside the campus. Of course in terms of college life banglore would be better since it's a students hub."
    },
    {
      "id": "ha614dy",
      "body": "Is PESU really that bad?"
    },
    {
      "id": "ha61o1i",
      "body": "PESU is not bad at all and at this point and time is ahead of all new IIITs and few NITs but 4 years down the lane with the speed at which IIITs are improving you might regret your decision of not joining a government college so if you are getting cse in IIIT go for that."
    },
    {
      "id": "haafmha",
      "body": "yeah thats what I'm thinking too\n\nthanks"
    },
    {
      "id": "hc5yw8n",
      "body": "That makes no sense cuz what if the selected people reject the seat."
    },
    {
      "id": "hc5yxag",
      "body": "also if you have been selected could you tell me your percentile."
    },
    {
      "id": "hemnd6g",
      "body": "This is probably the most accurate description of PES I’ve read so far lol"
    }
  ]
}