{
  "id": "pc20nf",
  "title": "Is pes CS course stressful?",
  "content": "Do they give a lot of assignments? \nAnd is the syllabus tough?\nAsking about RR and EC campus.",
  "metadata": {
    "author": "Revolutionary-Key31",
    "url": "https://www.reddit.com/r/PESU/comments/pc20nf/is_pes_cs_course_stressful/",
    "permalink": "/r/PESU/comments/pc20nf/is_pes_cs_course_stressful/",
    "score": 8,
    "created_utc": 1629992356,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "hafuswx",
      "body": "I also wanna know about it!"
    },
    {
      "id": "hafuwja",
      "body": "Oh boi...  \nIf you have already joined I would just say good luck for the load of torture coming ur way.."
    },
    {
      "id": "hafxfot",
      "body": "Yea..."
    },
    {
      "id": "hag2q9t",
      "body": "what about ece?"
    },
    {
      "id": "hag94i1",
      "body": "Bro *PES* in general is stressful"
    },
    {
      "id": "hagbhlh",
      "body": "Is it because of online classes or will it normally be like that? Is it manageable?"
    },
    {
      "id": "hagl604",
      "body": "are they doing it on purpose though? Like the IIT coaching institutes would put pressure on you knowingly"
    },
    {
      "id": "hagmgf3",
      "body": "me three"
    },
    {
      "id": "hairyp7",
      "body": "Online or offline it's a struggle...\nBut offline it's a lil better I feel...\nBut trust me it isnt worth the effort..\nMental health at stake"
    },
    {
      "id": "hajgj5q",
      "body": "Is it tough compared to other colleges or in general CS course is tough?"
    },
    {
      "id": "haneo68",
      "body": "Depends on the subject and prof. Some will be a breeze, the others can be much more challenging. \n\nLots of courses will ask for a project. The plus side is that it means you get a lot of stuff to show during interviews. The downside is that the deadline for the projects for all classes are usually at the same time. So you'll be rushing things towards the end of the sem April/Nov. The best thing you can do is finish projects early.\n\nBut yeah I'd say pick some courses where things interest you, and pick some where you can relax and take it easy"
    },
    {
      "id": "haoilwt",
      "body": "Is it more challenging compared to other college’s CS courses?"
    },
    {
      "id": "haomwvk",
      "body": "I mean I can't really say for sure. I've only attended one college. But I had a lot more free time than my friend at RV who also took CS, so maybe? I really can't comment on that"
    }
  ]
}