{
  "id": "pc74rd",
  "title": "Are there any downsides so many seats for a single branch?",
  "content": "there are like 720 seats for CSE for just the RR campus and 600 more at the EC campus\n\nany merits/demerits of this?",
  "metadata": {
    "author": "thundr_strike",
    "url": "https://www.reddit.com/r/PESU/comments/pc74rd/are_there_any_downsides_so_many_seats_for_a/",
    "permalink": "/r/PESU/comments/pc74rd/are_there_any_downsides_so_many_seats_for_a/",
    "score": 7,
    "created_utc": 1630007636,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "haiutqm",
      "body": "does the batch size remain the same (60) or does that increase too"
    },
    {
      "id": "hajbdfp",
      "body": "More competition for placements. You say there is 720 in rr campus alone. Now add ec campus seats also. You have more than 1000 students only in cse and dont forget other branch like ece as they will also sit for cse companies. Most colleges have at most 150-200 seats in a single branch. PES just wants to earn money."
    },
    {
      "id": "hajglzo",
      "body": "More and more seats in a single branch translates into more and more competition amongst them. PESU fundamentally always had the issue of a higher competition within it's students because while the absolute placements is high, it's intake is also increasing. Not just that the batch size is 60 but 12 batch sizes need to be made. The real downsides are not for CS. They are well equipped to handle that crowd. It's the other branches that take a hit. Some more than others. Civil is almost non existent. One of the legendary branches. Mech is fucked up in it's own way. Electrical the batch is a 10th of the CS. all this leads to less and less resources allocated to them. \nBut this is a common scene every where. In PESU it's happening faster than expected."
    },
    {
      "id": "hakobwj",
      "body": "It does, more or less."
    },
    {
      "id": "hapfj2j",
      "body": "I would say there are two major downsides to higher batch sizes:\n\n1. You cannot simply maintain the same quality of teaching for so many people. The number of good professors is a lot lesser than the number of okayish to bad profs. You are statistically more likely to get a worse teaching experience with more people.\n2. Much tougher to stand out, getting noticed by professors or for opportunities on campus. The number of the opportunities is not necessarily or really a function of the size of the batch and hence it just makes life harder."
    },
    {
      "id": "haphmb2",
      "body": "thanks for the input, \n\nis it a deal breaker though? what other colleges in Bangalore are comparable to PESU"
    },
    {
      "id": "haphw26",
      "body": "Not sure, I am not from Bangalore. RV is good as well but tough to get in.\n\n&#x200B;\n\nI wouldn't say it's a deal breaker on its own, it depends on your options as well."
    }
  ]
}