{
  "id": "pwx0bk",
  "title": "People who joined PES this year. How is it?",
  "content": "",
  "metadata": {
    "author": "JacksonDonaldson",
    "url": "https://www.reddit.com/r/PESU/comments/pwx0bk/people_who_joined_pes_this_year_how_is_it/",
    "permalink": "/r/PESU/comments/pwx0bk/people_who_joined_pes_this_year_how_is_it/",
    "score": 7,
    "created_utc": 1632797666,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "heq4yrr",
      "body": "Bootstrap has been fun so far\n\nSeniors are fucking depressed inside the hostel\nBut when inside the college they're the most chill people and really helpful\n\nI think I've luckily got the best hostel floor (MB/2nd floor) and we're the only one making noises till like 1 am\n\nAlso 90% of the batch are Bangaloreans, and 50% of them are CSE, but it's hard to mingle with the localites considering they've already come in groups. Still a few of them are really fucking chill and fun to hang out with\n\nBTW in the 5 days I've spent here, my Hostelmates and I have had loads of fun, bribed the gaurds, shouted with all our might at like 1 am, fit 14 guys in one room and locked them and turned the lights off and pretended to be the warden (this one was most fun), also celebrated a birthday today only.\n\nIt should be noted that the floors above and below us remain like pin drop silent throughout the day. \n\nThe proper lectures haven't started yet and the first week has been all bootstrap only. The first day they took us to Lalbagh, which was alright but some of my group was already there so made it fun for all. Next day was ECE, which was bland af but at the end there was a seminar about the E-Cell which had an interactive session, super fun. BTW if you ever hear about the \"Tinder for Pets idea\" guy, that's me, lol. Today was mechanical that was the blandest. Tomorrow's Electrical, so we'll see how it goes. \n\nBut yeah it's been fun."
    },
    {
      "id": "heq69ll",
      "body": "dammm, that sounds fun. How were the hostels tho?"
    },
    {
      "id": "heqblxe",
      "body": "Rooms are kinda alright, I got 2 sharing with common bathroom in the temporary allotment. The bathrooms are too fucking small even for an average person, the rooms with attatched bathrooms are good but I would not recommend opting for it because it gives you 0 reason to get out of your room. Common washrooms is why most of our interactions happen. \n\n\nHostel is strict af, I guess it's because this is the first week. By we leave 0 chances of breaking a rule. There are some really absurd rules like, you can't roam in the corridors after 7:30, you can't have other mates in your room, etc. All have been broken by us. That's the reason the security guard comes like 2 times per day to our floor, lol."
    },
    {
      "id": "hetnc08",
      "body": "you come next year. you'll also become depressed like us :')"
    },
    {
      "id": "hetrest",
      "body": "So I have heard, lol"
    },
    {
      "id": "heucluw",
      "body": "Hey!  \n\n\nExperienced hostel-lite here, yes, rules are strict, but no body cares about 80% of them..  \n\n\nStay within limits and enjoy life xD\n\n(Over the years, hostel admin will stop caring :P)"
    },
    {
      "id": "hf0b5te",
      "body": "\\*next week"
    }
  ]
}