{
  "id": "ql3w3n",
  "title": "Product Design at PES",
  "content": "I'm interested in taking up Product design at PES University, RR Campus. Could anybody studying in the course, or alumni of the course, give me any firsthand info on how good the course is, pros, cons, whether it's easy to get into, placements, teaching, campus life in general, and whether you'd recommend it overall?",
  "metadata": {
    "author": "riteshua",
    "url": "https://www.reddit.com/r/PESU/comments/ql3w3n/product_design_at_pes/",
    "permalink": "/r/PESU/comments/ql3w3n/product_design_at_pes/",
    "score": 7,
    "created_utc": 1635858698,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "hj3uxxd",
      "body": "I’m assuming you’re asking about Industrial Design (well that’s what it’s called now). The course contents are good, the syllabus covers most of the things that an industrial designer should know. But mind you, the internship/job opportunities are very less. College does a bare minimum job at helping you find an opportunity. You’d have to learn things outside of college in order to beat the competition which is very stiff. I’d suggest you to try for NID or Strate first."
    },
    {
      "id": "hj3xci8",
      "body": "Strate is an option too for me, but their first batch hasn't even graduated, so that kind of leaves info like placement opportunities in the dark. I'll have to see NID though. Thanks for the information!"
    },
    {
      "id": "hj3y0bd",
      "body": "Hi! I am doing my final year of Product design at PES University. When you say PRODUCT, I'm assuming you want to know about industrial design. \n\nFirst off, it's a 4 year course (last year is reserved for internship work and exposure).   \n\n\n**How easy it is to get into:** Not sure about applying through PESSAT, because I wrote UCEED and based off the rank I got, I was directly offered a seat after an interview \n\n**Syllabus:** The syllabus has a wide variety of topics covered, from manufacturing all the way to color theory. There is a good mix of other design as well, through electives or common subjects that make it interesting, so overall, the syllabus is FAIR. I say fair, because compared to other colleges, this one focuses more on teaching students the software aspect of product design, and lesser of hands on, practical work. (At least this was the case for the '18 - '21 batch) Now with the pandemic in place, I'm not sure how things will play out. Another thing i noticed was that some colleges like Strate start focusing on all different aspects of product design from the very beginning, like manual rendering, sketching, etc. PES has a foundation course in the first year that is common to all streams of design.   \n\n\n**Placements:** Not good. There is one list of companies that the seniors had passed down to us, but there was almost no help from college in this field. Despite what the management claims in their presentations, like 3 companies come for placements, and they're all only for internships. That being said, the companies that DO come, are 'big' names like Samsung, and Home Centre.  \n\n\n**Teaching:** The method of teaching is..... Interesting.... Most of the professors are knowledgeable, and are young IISc graduates who are actually interested in teaching. But some professors..... literally just play YouTube videos in class. This depends on who you get, but most of them are good.  \n\n\n**Campus Life:** The chancellor almost always forgets this branch exists in his college, so things like announcements and events need us to actively go asking for them. Facility wise, the infrastructure is really good. Good, well lit classrooms with AC, a TV and 2 blackboards, good labs with 3D printers and a library. All situated in the (currently) best block on campus!  \n\n\n**Conclusion:** 7/10. It can do much better. I was only their 3rd batch to ever exist, so it's fairly new. They may improve, they may not. That is not for me to tell you. NID and Srushti have a more artsy-oriented approach to product design, while PES has a more 'Industry-ready' outlook. And Strate has its own thing going on (the fees, yeeesh) So while it has its faults, I'm sure they'll correct it for the better. Hope this helped you out!\n\n  \nCheers :)"
    },
    {
      "id": "hj3yxza",
      "body": "Thank You ❤️"
    },
    {
      "id": "hj3yymv",
      "body": "Thank Youuuu ❤️❤️"
    },
    {
      "id": "hj3zvqq",
      "body": "Wow thanks for the detailed answer! It's definitely made me a lot more aware about the course, because I literally found nothing on the internet, so I decided to come to Reddit. This definitely helps. Btw how many students would you say are currently in the course?"
    },
    {
      "id": "hj43qcr",
      "body": "there were 80 in our batch, branched into 3, so roughly 28 - 30 ish in each stream? i think our juniours have more, maybe a 100. not really sure. But it's increasing,"
    },
    {
      "id": "hj43yr5",
      "body": "That's good to hear that the strength is increasing, thanks again"
    },
    {
      "id": "hj440g3",
      "body": "anytime :)"
    },
    {
      "id": "hj4ajjw",
      "body": "Hey, I’m a graduate from the “product design” program at PESU, to add to sumyungais comment, I’d say PESU does a really good job at teaching design theory and software skills, the only thing the design program lacks is GOOD labs, it’s almost saddening to see the current labs compared to what other universities offer. But I feel fairly competent with my design skills now and I can thank the professors at PESU for that. And when it comes to placements, work, future studies, I think it’ll all come down to your portfolio and how much you can do outside of class to improve yourself.\nDesign schools always have a more laid back communal environment, you will definitely have a great experience over the 4 years. \n\nIt’s a solid option and a solid program in my opinion."
    },
    {
      "id": "hj4hxgh",
      "body": "Thanks for the information! Also could you please specify what you meant by no good labs? Does that mean the computers aren't good, or there isn't good enough design equipment?"
    },
    {
      "id": "hj4i6xa",
      "body": "The university has well equipped computer labs. Tools and machines, like sewing machines, heat press, large sized printers, big woodworking labs are lacking. They only have the basic requirements as of now, it will probably get better over time tho."
    },
    {
      "id": "hj509fl",
      "body": "Ok ok got it thanks!"
    },
    {
      "id": "l1hoa06",
      "body": "Hi, how would you compare it with RV university, for B. des mainly?"
    }
  ]
}