{
  "id": "qmfwwm",
  "title": "Should I choose PES (Elec. City) ECE or KLETech (BVB, Huballi) CSE?",
  "content": "I am from north k'taka hence leaning towards KLETech since it'll be closer to home. I have rank of 4.9k, may get ECE in PES electronic city campus or CSE in KLETech. I am not sure what to choose.. How is placement scenario in PES ECE (electronic city campus)? if it is really good (avg near 8LPA) I will choose PES ECE. Please tell me if I am missing something, thanks",
  "metadata": {
    "author": "FamiliarMove873",
    "url": "https://www.reddit.com/r/PESU/comments/qmfwwm/should_i_choose_pes_elec_city_ece_or_kletech_bvb/",
    "permalink": "/r/PESU/comments/qmfwwm/should_i_choose_pes_elec_city_ece_or_kletech_bvb/",
    "score": 3,
    "created_utc": 1636013696,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "hl80qzf",
      "body": "Bro choose pes ece ec campus, this is solely because of location factor, Bangalore will give you opportunities other city’s can’t. Do ece, and learn as much coding as you can and get some cs related internships, or if you start liking finance related subjects take internships in that, you have a great chance to build your resume living here, in other places people can’t. Don’t look at avg package, look at opportunities and take pes ece."
    },
    {
      "id": "in13i9a",
      "body": "What kind of opportunities will B'lore solely give you due to location? I'm looking around for colleges too and wanna know in detail. Does location in Banglore itself matters too? (In the city vs outskirts) I'm not from Karnataka btw so travelling isn't an issue"
    },
    {
      "id": "in5vo2s",
      "body": "it’s more about college in Bangalore as well. Being the IT hub, a lot of top companies prefer to hire local talents as it saves on recruitment costs. If you wanna do engineering try and get cs in rv, pes, bms, msrit, pes ec campus. foll by cs related branches or ece in these colleges. I wouldn’t recommend taking other branches."
    },
    {
      "id": "in6s864",
      "body": "The first 3 are out of my rank rn :( And I didn't give pessat because I didn't know they removed themselves from comedk since this year. Getting some next ranking colleges, would hope I get one of them"
    },
    {
      "id": "inafp6c",
      "body": "Good luck bro, hope it goes well!"
    },
    {
      "id": "lfavem7",
      "body": "Bro in which college are you RN bcoz I also have to choose between DSCE(EC) and BVB(CS+AI)"
    }
  ]
}