{
  "id": "qpagtn",
  "title": "Study material and sources",
  "content": "Hello everybody, I’m in B.tech 1st sem now, I was an average student in school and didnt study much in my 12 coz of online classes. Here I’m finding the subjects pretty difficult specifically physics and maths. Apart from pesu academy could yall suggest me some sources/ lectures/ study material/ whatever that will help me understand the subjects and do better. Also how are the ISAs gonna be? Will the questions be similar to what they teach in class. Whats the difficulty level like? \n\nThanks a ton for help!!",
  "metadata": {
    "author": "Any_Lead3",
    "url": "https://www.reddit.com/r/PESU/comments/qpagtn/study_material_and_sources/",
    "permalink": "/r/PESU/comments/qpagtn/study_material_and_sources/",
    "score": 10,
    "created_utc": 1636365692,
    "flair": "Study Help :table:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "hjt5cmx",
      "body": "[bit.ly/pesufiles](https://bit.ly/pesufiles)\n\nIt's an old link (we made for our first year 2018-2022 batch), but it has almost everything you want...\n\nI hope it helps!"
    },
    {
      "id": "hjt9goy",
      "body": "For math, and in all honesty, most subjects, the best material is the recommended textbook. Solve the problems from there and you should be solid. Granted it's been like 4 years for me but I recall the BV Ramanna book being the best reference to study. \n\nFor CS concepts in ToC and Compiler design, I found Neso academy to be good. \n\nFor exam prep the best option is to find last year's question papers. It's by far the best way to prepare for core subjects, but do make sure you compare the syllabus because it does alter a bit from year to year. ISAs are usually the same difficultly as what's taught, with maybe some easier questions and a few harder ones here and there. Again it really depends on the prof and the subject"
    },
    {
      "id": "hjta6nw",
      "body": "Thanks bud! Math Text book we were told to follow is Rk jain and Srk iyengar and BV ramana is on our ref book list. Thanks for helping out"
    },
    {
      "id": "hkyesyr",
      "body": "U can find physics a little intimidating given all the quantum mechanics n stuff, don't know if the syllabus has changed, but it is really not that hard. I will give it to you straight u don't use all that physics  in engineering unless u specifically pursue that path. Think it is simple n start studying ull automatically start understanding the stuff.\n\nMath gets easier in the second year. Understanding the basics is the key. If you are able to solve the questions that the teacher solves on board on your own the first time itself scoring 75+ in ESA is not at all hard. Try understanding a few problems then start solving before the teacher does then u can look into problems from ref books. This much enough to score a good grade.\n\nDon't worry it gets easier. Only thing is to not loose interest."
    },
    {
      "id": "hkyis6f",
      "body": "Phy syllabus is same. It looks huge! Thanks for the tips, will try."
    },
    {
      "id": "hmelfs6",
      "body": "Thanks a lot dude!!"
    }
  ]
}