{
  "id": "qwm02u",
  "title": "ConfusedðŸ˜",
  "content": "RV Ec or Pes Cs",
  "metadata": {
    "author": "Professional-Set3303",
    "url": "https://www.reddit.com/r/PESU/comments/qwm02u/confused/",
    "permalink": "/r/PESU/comments/qwm02u/confused/",
    "score": 5,
    "created_utc": 1637227295,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "hl3r2si",
      "body": "Pes cs"
    },
    {
      "id": "hl3rfy0",
      "body": "Reasons?like the huge intake will not be a problem huh? I'm n worried of joining pes nly for this reason.Happy cake day btwðŸ˜"
    },
    {
      "id": "hl3twzm",
      "body": "RV EC, you can sit for cs placements."
    },
    {
      "id": "hl3u1ry",
      "body": "Going just by stream \n\nCSE>ECE\n\nNow if you want to sit in placement for CSE, instead of taking ECE, just take CSE and have a better chance at getting placed..."
    },
    {
      "id": "hl5a1bt",
      "body": "bro cause cse is better than ece, and rv and pes is more or less comparable, taking cse and doing electives that interest you like lets say ai, data science, ml, cyber security etc. makes more sense than taking ece and doing data structures, oops in your electives. when companies like microsoft come for placement they wont even consider ece in tier 2 colleges, all this only works in iits. top nits and bits."
    },
    {
      "id": "hl7bldf",
      "body": "Pick whatever course you like more. If you like them equally or have no preference, probably better to pick RV.  \nKeep in mind that you can go from CS to ECE if you're interested. \n\nI was in the same situation 4 years back and I went with CS. Glad I did because I would've flunked ECE bigtime."
    },
    {
      "id": "hl7d4t6",
      "body": "Thanks for suggestions ðŸ™Œ"
    },
    {
      "id": "hl80ays",
      "body": "Okay thanks manhðŸ™Œ"
    },
    {
      "id": "hl80ff0",
      "body": "Haan but won't tht be hectic studying programs too with ece.like i shld be knowing something bout cse ryt?"
    },
    {
      "id": "hm8nqlj",
      "body": "Yea... thanks"
    }
  ]
}