{
  "id": "r9gf3j",
  "title": "Placements EC campus CSE 2022 ?",
  "content": "I've seen 2021 ec campus cse placement and it's trash does it get any better in 2022 as it's 1st batch under PESU not vtu ??",
  "metadata": {
    "author": "Illustrious-Egg-3183",
    "url": "https://www.reddit.com/r/PESU/comments/r9gf3j/placements_ec_campus_cse_2022/",
    "permalink": "/r/PESU/comments/r9gf3j/placements_ec_campus_cse_2022/",
    "score": 2,
    "created_utc": 1638713163,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "hnbqc2r",
      "body": "Yes, it does get much better. Our batch is pretty surprised with the sheer number of \"Tier 1\" companies that are coming and giving offers since the end of July. There have been a LOT of companies with CTC above 15 lpa and there's even been quite a good number above 20 lpa as well. And the placements are still going on, it's quite impressive. EC and RR have the same companies now that it's under the uni as well.\n\nOne additional point to note is that the placement coordinator for the EC campus is horrible. He will cause a lot of unnecessary trouble for all students."
    },
    {
      "id": "hnc5b5u",
      "body": "Agree with everything u/Metachros said. \n\nAlso, there are quite a few companies with CTC above 30LPA too.\n\nThe highest so far is 63LPA from Apple and there have been a couple more at 40LPA."
    },
    {
      "id": "hnc5z5x",
      "body": "Is this info about RR or EC campus ?"
    },
    {
      "id": "hnc61d2",
      "body": "Placements are combined."
    },
    {
      "id": "hnc6lne",
      "body": "I do know that and I have a follow up question , Do companies know if someone is from RR or EC campus when students sit for combined placements ?"
    },
    {
      "id": "hnc6z11",
      "body": "Not off the bat, they don't. \n\nIt's not something companies are even concerned about. Trust me, I've sat in my fair share of internship and FTE hiring interviews. \n\nIf anything, the topic of your campus might come up in a managerial/HR interview out of curiosity but nothing more. \nThis was the case when I got hired."
    }
  ]
}