{
  "id": "r9h14q",
  "title": "Campus Placements",
  "content": "A lot of people have queries about placements in PESU... so this post can be your one stop destination for the same!\n\nI hope it helps!",
  "metadata": {
    "author": "ChromaticChaos",
    "url": "https://www.reddit.com/r/PESU/comments/r9h14q/campus_placements/",
    "permalink": "/r/PESU/comments/r9h14q/campus_placements/",
    "score": 9,
    "created_utc": 1638715118,
    "flair": "ANNOUNCEMENT :snoo:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "hnbu1do",
      "body": "*\"Firstly I didn't get placed from College because none of them were what I was looking for. I wanted to get into UI/UX and not even one job description came for it. Everything was software engineer or analyst or something similar with terrible salaries.*   \n*Since I thought it wasn't worth it. I sat for interviews in college as a practice but started applying outside by my own.*   \n*LinkedIn will be your best friend here. If you spend one hour every day for one week applying for jobs, it's guaranteed that you'll get at least one reply.*  \n*However if you are a person who goes along with the IT trend, then getting a job through PESU will be easy.*   \n*Similarly if you don't know what you want then college placements are the only way to go.*  \n*If you can't apply on campus for a particular big MNC due to some reason then don't panic since they also host offcampus placements and they are of a similar level in difficulty.*  \n*Lastly PES doesn't care about what you like. They think of their students as products that are groomed and trained for these big MNCs and are proud about this. Their reasoning is that this way you at least get a job.*   \n*Hence if you are passionate about a non trending, niche job then I would rather suggest you start preparing to head out by your own.\"*  \n\\~Graduate PESU"
    },
    {
      "id": "hnc2ks1",
      "body": "Isn't this true for every private college?"
    },
    {
      "id": "hnff8fl",
      "body": "Every niche job in the country tbh. It's due to the lack of domain knowledge in these areas in every college. That's why you gotta self study and search for opportunities yourself."
    }
  ]
}