{
  "id": "riailx",
  "title": "Placement Help",
  "content": "Hey can anyone give a detailed idea about cgpa cutoffs during placements in PES University (2021-2022)?Like which company asked how much gpa,so it will help me in deciding which companies to target?",
  "metadata": {
    "author": "Basic_Ad_900",
    "url": "https://www.reddit.com/r/PESU/comments/riailx/placement_help/",
    "permalink": "/r/PESU/comments/riailx/placement_help/",
    "score": 14,
    "created_utc": 1639720530,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "how20js",
      "body": "Placement Summary File for 2021: [https://drive.google.com/file/d/17zEt7xdUs2cVWytO770XDjkSuvO7xO9O/view](https://drive.google.com/file/d/17zEt7xdUs2cVWytO770XDjkSuvO7xO9O/view)\n\n&#x200B;\n\nKeep your CGPA at--least above 7.0 for placements...\n\n2021 placements are still going on!"
    },
    {
      "id": "how37pm",
      "body": "Yeah I have seen this file b4 but it doesnt give much idea about cgpa cutoffs....\n\nIf its above 7 which companies exactly is one eligible for...?"
    },
    {
      "id": "how3ina",
      "body": "See, companies that come for placements are categorised into Tier 1,2 and 3\n\nSo I can say, having 7+ gets your eligibile for Tier 2 and 3 companies, for Tier 1, the eligibility varies...\n\nThere's no college mandated elegibility criteria, it all depends on the company that comes for placements, adding to that, the companies that come every year is also not the same"
    },
    {
      "id": "how42ox",
      "body": "Yeah thats why I wanted this years data,and if cgpa is above 8 but below 8.5 which tier 1 companies is one eligibe for this year...?If you could provide this data it will be really helpful....Also having above 8 guarantees tier 2 atleast?"
    },
    {
      "id": "how6ng2",
      "body": "You'll be eligible for most of the tier 1 companies"
    },
    {
      "id": "how6no3",
      "body": "Having above 8 does guarantee Tier 2 (98% of the time)\nElegibility, gotta wait for the end of placement report of 2022 😂"
    },
    {
      "id": "how9hwd",
      "body": "Which tier 1 companies keep above 8.5?"
    },
    {
      "id": "hoxpyh3",
      "body": "Cursory check of my inbox gave me Cloudera, Pensando, Walmart and Clumio, but this is just what I got through a quick glance. Some emails have it worded and formatted differently or attached in like a PDF or something. Tbh it doesn't matter all that much, I can tell you that the highest paying companies (Apple and Microsoft) asked for 8+. \n\nKeep your GPA as high as you can though because it means you can get your elective+prof preferences more easily and you can get scholarships.\n\nEdit : I can dig around for the cutoff of a specific company if you want, but I can't do a full fledged data analysis and give you a distribution or anything like that"
    }
  ]
}