{
  "id": "s16vc3",
  "title": "Random Question",
  "content": "Is it true that students are divided after each semester based on score and are allotted sections respectively. Do they shuffle students after each year/semester?",
  "metadata": {
    "author": "FickleAd4141",
    "url": "https://www.reddit.com/r/PESU/comments/s16vc3/random_question/",
    "permalink": "/r/PESU/comments/s16vc3/random_question/",
    "score": 5,
    "created_utc": 1641884540,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "hs6lja2",
      "body": "In the first year, it is completely random. Students from all branches are put together in each section. However, things change from the second year. I don't know about the pre-COVID era, but for my batch, we were divided into sections in the alphabetical order of our names."
    },
    {
      "id": "hs6nc7e",
      "body": "The method isn't very transparent pre-COVID, but it was based on GPA. But it wasn't \"highest GPA in a class\", kids in a class have varying GPAs."
    },
    {
      "id": "hs6qs62",
      "body": "First year was random I believe with a mix across branches.\n\nI believe the next year onwards it went in SRN order. So the first enrolled student was in A, second in B and so on. Your class stays the same across 2nd, 3rd and 4th year though"
    },
    {
      "id": "hs6r3ok",
      "body": "\\> From second year on-wards, the section remains the same until you graduate\n\n\\> The students are divided based on SRN and GPA; they ensure that every section is equally competitive\n\n\\> You didn't ask but no, you cannot change your sections once allotted"
    },
    {
      "id": "hs6v9fm",
      "body": "Which year are you in btw?"
    },
    {
      "id": "hs6veic",
      "body": "Which year are you in btw?"
    },
    {
      "id": "hs6vvif",
      "body": "Graduated in 2021"
    },
    {
      "id": "hs6w3l9",
      "body": "Do we get shuffled after 1st sem or we have the same section in 2 sem also?"
    },
    {
      "id": "hs6w8d0",
      "body": "It's the same for the first 2 sems. Then depending on your section composition (if everyone's from the same branch or not) you may have some changes here and there"
    },
    {
      "id": "hs6we42",
      "body": "So if everyone is from cse the section remains the same? And how are srn assigned? Based on alphabetical order or first come first serve type?"
    },
    {
      "id": "hs6whjn",
      "body": "You didn't get your srns yet? It's mostly alphabetical and dependent on when you join if I'm right. One big drawback is that you'll have 5-6 classmates with the same name lol"
    },
    {
      "id": "hs6woz5",
      "body": "No we didnt get srn yet. So will the sections be shuffled even if all the students are from same branch?"
    },
    {
      "id": "hs6x2qp",
      "body": "I'm not sure on how they do it without srns. For us it was same branch and srn wise which is mostly alphabetical. Unless you join through the later stages of cet and you'll not be in alphabetical order as these are in the last few sections (seriously 12 sections is a lot). Otherwise if your class is a mix of students from different branches, the ones belonging to the same branch will remain to do so and the gaps will be filled by shifting from previous/next sections in alphabetical order (approximately 60-65 in one section)"
    },
    {
      "id": "hs6ye7i",
      "body": "i am in 4th year"
    },
    {
      "id": "hs6yfjv",
      "body": "Yes section will be shuffled!"
    },
    {
      "id": "hs6ykp0",
      "body": "U said  students are divided based on srn and gpa but how does that work??"
    },
    {
      "id": "hs6yo8t",
      "body": "No one clearly knows that ,but may I ask why it matters xD"
    },
    {
      "id": "hsgfjd2",
      "body": "Did not happen for 2022 batch (I know this because SRN 2 is in my class and we aren't in B)"
    },
    {
      "id": "hzbtar2",
      "body": "If i am from cse then all my friends of cse branch in 1st and 2nd sem will be in same class for rest of 3 years or will there be any change within same classmates ???"
    },
    {
      "id": "hzbth50",
      "body": "If i am from cse then all my friends of cse branch in 1st and 2nd sem will be in same class for rest of 3 years or will there be any change within same classmates ???"
    },
    {
      "id": "hzbtpsv",
      "body": "It will be shuffled. There is no guarantee your CSE friends in your current section will also be there with you for the next 3 years."
    },
    {
      "id": "hzbup9g",
      "body": "🥲🥲"
    },
    {
      "id": "hzc45il",
      "body": "Not sure how they allot. Not everyone from CSE in your first year class will be in the same section as you in the second year onwards. It'll be just one or two guys. Atleast that was how it was for my batch."
    }
  ]
}