{
  "id": "uadv3h",
  "title": "Campus confusion",
  "content": "I am a 12th grade student who will be giving Pessat this year\nI’m really confused between the two campuses and the ec campus is closer to my house\nSo I wanted to know if both are the same in terms of academics, placements, etc\nYour guidance would help me a lot!",
  "metadata": {
    "author": "Vengeance55",
    "url": "https://www.reddit.com/r/PESU/comments/uadv3h/campus_confusion/",
    "permalink": "/r/PESU/comments/uadv3h/campus_confusion/",
    "score": 8,
    "created_utc": 1650745032,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "i5xdwwl",
      "body": "1. It's pretty late, but then again here I am.\n\n2. Syllabus is the same. Placements are the same. If you only care about that (to which I'd say you shouldn't), it doesn't matter which campus you go to.\n\nEC dude here, so here's all the thoughts (read: rant) that I can conjure up at 3.00 am here. Mod will be able to shed some light on RR. Pressure on you klns. 0_0\n\nThe campus life is different. From what I've seen in my 4 years, there's a lot more going on in RR. Better libraries, canteen, events, stuff to do outside campus. It looks cramped and lots of construction, so there's that. EC campus is huge and tbh, that's all the good that I can come up with for EC. And there's a lot of construction as well here. Unless they changed the rules in RR, you have to pay for parking only in EC. Why? Idk lmao. They've eaten up the 2 wheeler parking space. It's literally under the sun and construction dust for the whole day -> and you gotta pay for that.\n\nThe nearest Xerox shop outside college is a 15 - 20 minute round trip trek. There's nothing to eat outside at a walkable distance in the campus vicinity if you have an impromptu plan with friends.\n\nThey dug up the 2 tennis courts, deleted one basketball court, and the other is half eaten away which already looked like a scene from the last of us. There's 2 badminton courts in the quadrangle which looks beat up. Football court is not maintained at all. It's basically an abandoned field with 2 goalposts and no nets. People play cricket in the middle of the field. The gym is in a 'this-is-not-funny-anymore' of a sorry state. Idk much about sports rn. It was absolutely pathetic before, but stuff is changing for the better. Some junior might be able to shed some light here.\n\nThe libraries look like they've been preserved from 1947. The CS labs equipment(not ones in the mech block) are likely older than me.\n\nGetting funding for an event in a club or going for a competition is a NIGHTMARE. I've consoled people who've completely broken down trying to get permission and some compensation for going to events in other colleges. Their actions actively discourage any co curricular activities.\n\nWhen we used to have ethnic day, the ladies weren't allowed to wear saree's. Yes. You heard me right. No saree. Our fest was a joke. Last time it was held was in 2019, I knew a few in the core and seniors. If Dante's inferno was a comedy, this would be a stand-up special. I'm not exaggerating.\n\nFor all other things not related to academics, I've always felt we're treated like we're secondary; always distant, always an afterthought, a nagging itch -> I've been part of a few clubs over the years. Seen a few things, or rather, not seen much the due to a lack of things to see. I've lost interest and given up on very promising projects in the process. Lockdown was a blessing as it opened new avenues for me to strech my legs and they are one of my fondest memories of being part of a club. \n\nIf you have the choice of your selected stream in both campuses, you already know the state of EC campus.\n\nSorry for rant lmao. But it's just how it is. Again, Placements and academics are the same. The campus life is drastically different between the campuses."
    },
    {
      "id": "i5xf4qh",
      "body": "Thank you so much!\nBut the main campus is pretty far from my house\nAnd the ec campus is just 10 mins away\nAlso can I dm?\nGot a few more questions to ask"
    },
    {
      "id": "i5xive1",
      "body": "Yeah sure."
    },
    {
      "id": "i67r5b0",
      "body": "its only abt 45 mins away, or just take a hostel"
    },
    {
      "id": "i67tvbh",
      "body": "Yeah but ec campus is only 10 mins away and I’d be saving a lot of time \nAnd if the syllabus, academics, placements,etc are the same, then It’s better to prefer the closer one isn’t it?"
    },
    {
      "id": "i68isyc",
      "body": "No, other things also matters. Just academics in college is not enough."
    },
    {
      "id": "i69h5qg",
      "body": "Other things like?"
    }
  ]
}