{
  "id": "udbd0q",
  "title": "PESSAT",
  "content": "Can anyone shed some light on how to prepare effectively for Pessat?",
  "metadata": {
    "author": "Vengeance55",
    "url": "https://www.reddit.com/r/PESU/comments/udbd0q/pessat/",
    "permalink": "/r/PESU/comments/udbd0q/pessat/",
    "score": 6,
    "created_utc": 1651086868,
    "flair": "Study Help :table:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "i6hbfhb",
      "body": "Your preparation for KCET/JEE should be enough for scoring well in PESSAT. I think there is a section on English too. But it's easy and you can answer most of the questions without any preparation. The difficulty level of the questions is similar to that of KCET. Maybe answering questions that appeared previously in KCET will give you an idea."
    },
    {
      "id": "i6hbsqe",
      "body": "Thank you so much!"
    },
    {
      "id": "i6jekdo",
      "body": "\nBro it’s harder than Kcet 100 percent \nIt’s close to bitsat jee levels but not at par to them.\nDon’t expect easy questions like Kcet ,\nThey will “pop” you with hard  questions \nEspecially math and physics to a extent.\nSo study hard for pessat and attempt all questions at costs.\nEven i thought it would be Kcet level but it wasn’t.\nI wrote Pessat last year for your reference"
    },
    {
      "id": "i6m5u8g",
      "body": "Why tf you are so desperate to get into pes. Focus on jee for now give your 100% in that, try to get good nit or iit. While preparing that you will automatically ace pessat exam, keep pesu as backup and try to get a good government college first."
    },
    {
      "id": "i6npn4p",
      "body": "As a PESU student who will be graduating next year , join PESU only at main campus RR not at Electronic City campus ( I'm presently at Electronic campus ) it's just not worth ur fee , main campus I kinda good"
    },
    {
      "id": "i74zqjh",
      "body": "tbh, I was surprised by its difficulty and found it harder than BITSAT"
    },
    {
      "id": "idpiigq",
      "body": "Give as many exams as possible. The experience will mount up and it'll help. I think I got negative somewhere in KVPY (didn't check marks lmao) and ended up with <500 in comedk by the end of the exam season"
    }
  ]
}