{
  "id": "vfq7c5",
  "title": "5th sem Internship Guidance",
  "content": "Hi...so I wanted to know how exactly do internships wotk at the end of 5th sem?\n\nLike whats the minimum GPA they ask,Do they ask only DSA questions or do we have to work on projects and show them?If anyone has any drive link regarding the ppl getting internships in which companies and stuff pls send..",
  "metadata": {
    "author": "Basic_Ad_900",
    "url": "https://www.reddit.com/r/PESU/comments/vfq7c5/5th_sem_internship_guidance/",
    "permalink": "/r/PESU/comments/vfq7c5/5th_sem_internship_guidance/",
    "score": 4,
    "created_utc": 1655625334,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "icxehrd",
      "body": "Companies usually start coming via placements for interns, you'll mostly see less of this in 6th sem. More in 7th. You can apply through there. Or you can go out your own way and find internships at any point yourself. \n\nQuestions really depends on the roles they hire for, too vauge of a question, as is everything that follows."
    },
    {
      "id": "icxemo5",
      "body": "If u have stats of 2021 regarding this it will be really helpful"
    },
    {
      "id": "icxf1nq",
      "body": "There are two internship seasons that come after 5th semester. One is during the summer between 3rd and 4th year, the other being your 8th semester. Regardless of when it happens, the general procedure remains the same. You fill out the registration form -> you write the placement test -> if you are shortlisted, there are some interview rounds -> if you clear those, there is the final HR round -> you get the offer letter which you can accept or reject. \n\nThe minimum CGPA depends on the company, but they usually aren't very strict. Almost all companies take in anyone above 7.5. Some companies keep the cutoff at 8, a few at 8.5. Almost no company at 9+. However, it's good to maintain an 8-8.5 since it lets you sit for all companies and also offers you a fair shot at being shortlisted for interviews (which also takes in CGPA as a factor). For the summer internships, the CGPA being used is till your 5th semester, and throughout placements your 6th semester CGPA is used. So keeping it at 8 atleast is pretty crucial this year.\n\nAlmost all placement tests use DSA for shortlisting. Unless you're atleast decent at them, you won't really make the cut. Projects come into play during interviews to identity which roles at the company fit in with your strengths and about your experience with whatever tech stacks you've worked with. All companies recruit freshers with the generic \"Software Engineer\" role, and put you into a team that closely matches your interests (if they don't find one, it'll be random). Having projects helps push them towards putting you into a more comfortable role for you. So you need both, DSA as well as projects.\n\nAs far as Drive link, I don't think anything like that exists.\n\nTLDR - Keep your CGPA around 8.5 throughout 3rd year. You need to have good DSA skills to clear the placement test as well as projects that show your technical proficiency."
    }
  ]
}