{
  "id": "vp0d8a",
  "title": "PESSAT slot booking trouble, please help me out.",
  "content": "so I am from Dehradun, Uttarakhand and i filled up the form for PESSAT. As there is no center in Uttarakhand for PESSAT exam, I put my centre as Chandigarh as it is the nearest center from Dehradun and my sister also lives there. So a couple of days ago, slot booking was started and as I was filling up the slot in Chandigarh, it is only showing me a particular date i.e. 1st July 2022(that is today) since the day slot booking was started. As I live in Dehradun, it is bit impossible to give exam on 1st July(I have to travel from Dehradun to Chandigarh and i legit have no idea about Chandigarh at all) so i wait for a couple of days for the slots to be available around 4th or 5th July 2022. But it is still showing me 1st of July. So i called at the university and told them that can you just reschedule my slot dates to around 4th or 5th July, they told me to write a mail to [pessat@pes.edu](mailto:pessat@pes.edu) . as i was told, I sent  the email to them, told them to reschedule my slot, and attached my pessat information with it. And i just got the mail from them and they saying that put your center to chandigarh, like wtf? did you even get what i am tryna say to you. I got the respond after two days and I again explained them that just reschedule my slot dates as the website showing me only 1st July and I don't know when are they going to reply back now.\n\n&#x200B;\n\n**IF ANYONE STUDIES IN PES UNIVERSITY, PLEASE DM ME AND PLEASE HELP ME WITH MY EXAMINATION. I CALLED AT EVERY CONTACT NUMBER OF THEIRS BUT THEY DAMN SHUT THEIR PHONES AFTER 5 PM SO EVEN IF YOU SHARE ANY CONTACT OF THE STAFF WORKING IN PES UNIVERSITY, IT WOULD WORK FOR ME SO PLEASE HELP ME OUT. THANK YOU.**\n\n&#x200B;\n\n***UPDATE- I have got my centre changed from Chandigarh to New Delhi by the admission cell of PESU as New Delhi is one of my preference centre for the exam. if you ever get into this kind of problem regarding PESSAT slot booking, just send an email to*** [***pessat@pes.edu***](mailto:pessat@pes.edu) ***, just explain your situation and be POLITE and straight forward about your situation, and also send your application form with it. You can ping me up for the email format that i sent to them.***",
  "metadata": {
    "author": "insomniiiacx",
    "url": "https://www.reddit.com/r/PESU/comments/vp0d8a/pessat_slot_booking_trouble_please_help_me_out/",
    "permalink": "/r/PESU/comments/vp0d8a/pessat_slot_booking_trouble_please_help_me_out/",
    "score": 6,
    "created_utc": 1656680596,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ieg84f4",
      "body": "As far as i know states outside Karnataka have only one test date(which was July 1st for Chandigarh) where as in Bengaluru you had 20 seperate dates out of which you could choose one. So I assume that you wouldn't get another test date and I guess the only option is to travel to Bengaluru and take the test."
    },
    {
      "id": "ieg8kw2",
      "body": "so is there any chance to change my center to Delhi, as one of my friend who lives in delhi having the exam on 8th and 9th july"
    },
    {
      "id": "iegdpq3",
      "body": "nope"
    },
    {
      "id": "iehtrse",
      "body": "Bro you've messed up plain and simple. PESSAT occurs on one and one date alone outside Karnataka. And that's the only opportunity to take it, it can't be rescheduled. Although it's a private uni it's exams work the same way as most national exams. they may or may not reconsider but you shouldn't have waited till exam day to travel to exam location"
    },
    {
      "id": "iejeeiy",
      "body": "You'll have to travel to Bangalore if you want another date. It takes place only once outside Karnataka"
    },
    {
      "id": "iesaec4",
      "body": "Why are you going through so much effort for joining this shithole lmao"
    }
  ]
}