{
  "id": "vy3kaq",
  "title": "PES University Electronic City Campus",
  "content": "[removed]",
  "metadata": {
    "author": "pesu2022",
    "url": "https://www.reddit.com/r/PESU/comments/vy3kaq/pes_university_electronic_city_campus/",
    "permalink": "/r/PESU/comments/vy3kaq/pes_university_electronic_city_campus/",
    "score": 2,
    "created_utc": 1657719782,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ig0pkvy",
      "body": ">Do students of PES get enough free time\n\nLmao"
    },
    {
      "id": "ig252o6",
      "body": "It's .... Ok. Good would be generous. That was my experience there.\n\nGathering some info from my juniors, with the new internal exam structure and silk board traffic, unless you're willing to study for JEE at every waking moment, forget about it. First year is PCM with programming (C and Python). They are very similar to what you know. Quantum physics is taught in more depth here. You might get time, but I wouldn't be too optimistic unless the scores there aren't your main concern.\n\nThe placements for CSE are great. For core ECE, there are very few companies that come. But they do come. All can sit for almost all companies if you have the GPA (8-8.5+ which is **NOT** easy in ECE)\n\nFrom my time, it has been really good. My seniors were accomodating, and we tried to reciprocate but COVID so didn't achieve much in that department. Hopefully a junior might shed light here. \n\n95 percentile with 50% syllabus ain't bad homie. If you're confident enough that a drop year can help you get into an IIT, go for it. Worst is you'd get a better rank next year in PESSAT and hopefully get into RR. (Way better faculty and clubs and stuff, atleast when I was there)"
    },
    {
      "id": "ig47msj",
      "body": "2 semesters are there. You got physics in one and chemistry in another. In no particular order, you also have electronics and electrical engg basics (circuits and semiconductors), mechanical engg (stress strain stuff), bio along with math 1, math 2 and your coding subjects. That's all I can conjure up on top of my head. \nMind you, they require attention to get good grades.\n\nIt's not if you need it. Rather it's you got to do it.  Core subjects. You gots to attend it.\n\nOn a side note, this post had intrigued me for a reason. I couldn't place it then, but my lightbulb lit up now. I read a clause somewhere that says if you forfeit your seat before the 4 years are over, you'll need to pay fees for all 4 years before leaving else they won't return your original doc's (which they collect early on, during admission I think). You might want to ask that during admission. 20L+ ain't a small amount..."
    },
    {
      "id": "ig48siz",
      "body": "To be honest... Better stay away from pes dude."
    },
    {
      "id": "ig555hg",
      "body": "I don't remember the amount but I remember there was a fee and it was quite big. So yeah, do check it out before you make the decision to join and then drop out"
    },
    {
      "id": "igay5u0",
      "body": "It 16L for 4 years in CSE and 14L for ECE"
    }
  ]
}