{
  "id": "vyxxpg",
  "title": "cse in pes rr, msrit or bmsce?",
  "content": "I prefer pes rr but recently I came to know that pes has higher intake of students and the workload is also more compared to the other two. Can anyone throw some light on this and is it really worth it?",
  "metadata": {
    "author": "XYZ1230987",
    "url": "https://www.reddit.com/r/PESU/comments/vyxxpg/cse_in_pes_rr_msrit_or_bmsce/",
    "permalink": "/r/PESU/comments/vyxxpg/cse_in_pes_rr_msrit_or_bmsce/",
    "score": 5,
    "created_utc": 1657810812,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ig8meg2",
      "body": "U would be better off in msrit Or bmsce... Mainly since their intake is low and u would face lesser competition... Pes is just increasing the fees and intake year by year... It's just not worth it...720 students just in cse in a single campus seems a bit high... Also  Nirf ranking of PES fell to 100 this year from 83 last year..."
    },
    {
      "id": "ig92fly",
      "body": "Thank you for the advice. Between msrit or bmsce any preference? Is rvce ise better than cse in msrit and bmsce? Thank you in advance!"
    },
    {
      "id": "igaww0g",
      "body": "From what I heard from my friends, ise and cse placements happen together , albeit they may have different course subjects. So Rvce ise might have a bit of an advantage over msrit cse... But i heard that rvce became a university recently.. So m not sure how things would change., better to ask some rvce student. \n\nIn the end the college choice would definitely depend on how u want ur 4yrs to go(placements, peers,fun, free-time etc), so just try and get some info. from the respective college students."
    },
    {
      "id": "itkmz2g",
      "body": "If we consider placements then\nRvce ise > cse in bmsce > cse in msrit \nIf we consider college life \nCse in msrit ~~~ cse in bmsce > ise rvce"
    },
    {
      "id": "iugusry",
      "body": "how would you rank PES Cse ( electronic city campus) vs BMS Ai/Ml vs MSRIT AI/ML???"
    },
    {
      "id": "iugw686",
      "body": "If u ask me i would go with bmsce ai ml because the college life is amazing even if i had to take some risk of ai branch, but i heard pes ec campus teachers are removed after lockdown, wait I'll send some reddit answers link"
    },
    {
      "id": "iugw7w5",
      "body": "https://www.reddit.com/r/PESU/comments/yhaw8c/my_views_on_pes_ec_as_a_fresher/?utm_source=share&utm_medium=android_app&utm_name=androidcss&utm_term=1&utm_content=share_button see comments in this"
    },
    {
      "id": "iugymdy",
      "body": "yes I was thinking the same too.. but idk really. Also comedk fees are a little higher, 2.5lpa.. idk if its too risky"
    },
    {
      "id": "iugzs37",
      "body": "I'm going to bmsce ai ml through kcet..90k per year. 3.6 lakhs  my whole btech will be over, so yeah, I'm not much worried even it's ai ml"
    }
  ]
}