{
  "id": "vzicio",
  "title": "Can I manage CS if I'm from a bio background?",
  "content": "I didn't have cs in 11th and 12th. I know extremely basic C and Python. I was actually a neet aspirant in the beginning (long story, don't ask) so my maths is not that good, only studied it for boards and cet, comedk pessat etc(not jee level). Do I need to study anything now so that it's easier for me later?",
  "metadata": {
    "author": "HelpMePleaaase_-",
    "url": "https://www.reddit.com/r/PESU/comments/vzicio/can_i_manage_cs_if_im_from_a_bio_background/",
    "permalink": "/r/PESU/comments/vzicio/can_i_manage_cs_if_im_from_a_bio_background/",
    "score": 11,
    "created_utc": 1657868936,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ig8jwuw",
      "body": "Lol I left my private MBBS seat in the first round because I didn't get a govt seat in that college which I really wanted and never looked back. \n\nNow I'm a manic CS graduate who freaks out over wrong amount of spaces in an indentation in vi. \n\nThere's nothing to worry about. Python is easy. You'll learn in college. C isn't very easy, you'll learn in college. There are a couple people who'll already be familiar with coding. Don't heed to it and let it get to you. Learning the curriculum when taught should be enough. \n\nIf that doesn't convince you, I tried to learn Java before I joined college. Didn't understand everything then, but I understood the basics of programming. Honestly go with any language if you are interested in learning now. \n\nMath is going to be a pain. That's a given for us bio folks 😅. But you'll scrape through."
    },
    {
      "id": "ig8k9pu",
      "body": "From your post history I think this will help 😂. Here's a shameless plug from a post on another sub. It should give some perspective. \n\nhttps://www.reddit.com/r/WorkReform/comments/srphhh/a_guide_to_entering_into_software_engineering/"
    },
    {
      "id": "ig8kz3o",
      "body": "Thanks, I hope I can \"scrape through\" lol. What are you doing now?"
    },
    {
      "id": "ig8mm4q",
      "body": "It won't be an issue... I have a lot of bio background friends who are actually performing better than us cs background guys .. We Cse guys have almost everything we need on the internet... U needn't worry about being from a bio background."
    },
    {
      "id": "ig8nylq",
      "body": "\n>Now I'm a manic CS graduate\n\nJust started working."
    },
    {
      "id": "ig8o1bm",
      "body": "Yeah I meant, what kind of work are you doing, are you happy, etc."
    },
    {
      "id": "ig8ohwz",
      "body": "Platforms engineer at an MNC. I got too much to learn and I feel like idk jack all the time, but the team helps me often. I work with C, sh scripting and python in OS development.\n\nPay is good. I like what I'm doing. Yeah, I'd say I'm satisfied with work."
    },
    {
      "id": "ig90srn",
      "body": "Don’t worry. We’ve also had students joining Cs branch  without CS background. It doesn’t matter, first sem python is fairly easy for all students and you will be able to do. C in the second sem is a little difficult but you can do if you put in efforts. Math you know wud suffice ig, you can revise your calculus portions which will continue in your first year. I would advice you to start learning coding on your own frm the first year itself. Hope this helps.\nGood luck!!"
    },
    {
      "id": "igck12v",
      "body": "Yes"
    },
    {
      "id": "ih2npo4",
      "body": "If you have time now, I mean before joining the course, I would suggest you get a basic idea as to what is CSE about, what we do here, what we learn to do, etc. CS will just come along with you if you develop some passion or like towards it. Everything is just available, all you need to do is get them together, and add your pinch of uniqueness.\n\nJust for an idea,\n\n1st Sem we are gonna be having Python, along with other courses which are more or less continued from what we have been learning in our 11th, 12th, or even before that I can tell. Python is easy, syntactically and in a few other ways too, compared to other PL's.  Get good grip on devising logic, to simple problems, and implement them using the syntax. \n\n2nd Sem, has C Language in the syllabus. It is not going to be as easy as python, but if you are able to remain consistent, follow the contents of the syllabus, and if you are able to give some of your own work and creativity to it, it won't take long for you to get a good grab of it."
    },
    {
      "id": "lq3la5z",
      "body": "Hey i am from pcb background want to admission in btech cse tell ma the admission step"
    },
    {
      "id": "lrs6ess",
      "body": "Hey can non maths student do btech cse in pes"
    }
  ]
}