{
  "id": "vzmlrl",
  "title": "Doubt in counselling",
  "content": "My PESSAT rank is in the 850s and I'm aiming for CSE in the ring road campus. Suppose I get a lower preference in the first round, do I hold on to it and attend the second round hoping for an upgrade? Or can you directly join in the second round? And I've heard most of the good CS faculty are gone, student intake has increased. Has quality drastically deteriorated?",
  "metadata": {
    "author": "Bio_is_sexy",
    "url": "https://www.reddit.com/r/PESU/comments/vzmlrl/doubt_in_counselling/",
    "permalink": "/r/PESU/comments/vzmlrl/doubt_in_counselling/",
    "score": 2,
    "created_utc": 1657885306,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ig93w48",
      "body": "Afaik idt they let you change branches as you need to pay the full amount on the spot during the counselling. So it's quite a big gamble yeah. And abt the faculty yeah even I've heard that the best teachers left (cse branch) so the quality must have gone down."
    },
    {
      "id": "ig95m52",
      "body": "Faculty is completely irrelevant to you at this point. And by the way , teachers come and go and that's not a new thing. The PES curriculum is what makes the difference with a strong emphasis on projects. A lot of people who have excellent skills in a specific domain such as ML or web dev are self taught anyway . from what I've noticed PES also has a really good coding culture. I'm not gonna say that the campus rn has the best faculty or whatever but the 'quality' hasn't deteriorated at all and it won't for a good period of time."
    },
    {
      "id": "ig97gt5",
      "body": "Syllabus is same in First year irrespective of branch for all. So suppose in First Round you got ECE ,you can later change it to CSE in Second Round. So if your sure then only go for it. Else you can directly join from Second Round."
    },
    {
      "id": "igax0v6",
      "body": "How does that work? We accept the seat and pay in the first round itself right? If accepted the seat in first round then we'll able to participate in second round also or what ..Can you elaborate please"
    },
    {
      "id": "igcnto5",
      "body": "Its not compulsory to take seat in First round, if your getting your desired branch then take it else wait for Second round. Yes you will be able to participate in Second round even after accepting seat in First round."
    },
    {
      "id": "igcq30t",
      "body": "Suppose I get cs in the ec campus in the first round, I can pay and finish everything and still attend the second round, hoping for an upgrade to the ring road campus? If I don't get it in the second round I can keep the seat I got in the first round?"
    },
    {
      "id": "igcxr1t",
      "body": "This is the exact doubt I am having"
    },
    {
      "id": "igcz6qk",
      "body": "Yes you can definitely keep the seat you have obtained in First round, and yes if your getting an upgrade go for it. Its possible to change to another campus."
    },
    {
      "id": "igd19lz",
      "body": "Are you sure about that? Because I haven't found anything regarding branch upgrade in the second round on Internet!\nDo they tell these things in the start of the counselling?"
    },
    {
      "id": "igd1j4f",
      "body": "Yeah it's so confusing, I've never attended an offline counseling like this before. What's your rank?"
    },
    {
      "id": "igd1ns6",
      "body": "Yes I myself only know quite a few people who changed from ECE to CSE through PESSAT or KCET."
    },
    {
      "id": "igd1rn2",
      "body": "I got 1770. It's pretty much of a border rank so I am doubtful about getting anything good in first round. But there were a lot of rumours about cutoffs getting higher in second round💀. So that's why I was thinking if there'll be a \"Accept and Upgrade\" kinda option in PESSAT councelling."
    },
    {
      "id": "igdb5os",
      "body": "I think you can get ece."
    },
    {
      "id": "igddz14",
      "body": "Oh ok. All the best!"
    }
  ]
}