{
  "id": "vzxi88",
  "title": "Query about PESSAT Counselling",
  "content": "Hey guys just a query about PESSAT counselling. Is there any way of doing the \"Accept and upgrade\" thing in PESSAT counselling. Or you just accept the seat in first round or reject and play a gamble for second round?",
  "metadata": {
    "author": "Upper_Nefariousness1",
    "url": "https://www.reddit.com/r/PESU/comments/vzxi88/query_about_pessat_counselling/",
    "permalink": "/r/PESU/comments/vzxi88/query_about_pessat_counselling/",
    "score": 5,
    "created_utc": 1657914639,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "igcreci",
      "body": "In the first round you can accept and hold on to that seat and branch. In the second round, if you get anything better your branch gets changed, else you're stuck with the same branch. Since you already paid during the first round you don't need to pay during the second round. \n\nThis was the procedure 4 years ago, might have changed so maybe ask someone from the more recent batches."
    },
    {
      "id": "igcybrz",
      "body": "Thanks for the reply. As you told so , I am looking for someone from 2020/21 batch to reply."
    },
    {
      "id": "iglvrp3",
      "body": "yep its exactly as he mentioned. Lock the seat during round 1 and see if u get anything better in 2. From the 2021 batch btw"
    },
    {
      "id": "igm0ziw",
      "body": "Then they'll let me change the branch/campus there itself even though I've already paid in the first round?"
    },
    {
      "id": "ignc8s6",
      "body": "yes yes afaik, since first sem is common for all branches they dont change ur section if u change branch within the same campus. But if u change campuses, then they’ll change sections and u will be attending the new campus after second round"
    },
    {
      "id": "ignhr4y",
      "body": "Great to hear that. Hopefully they'll explain all this in the counselling there. Btw can I get CSE in EC campus or ECE in RR campus with rank of 177X in second round. I mean are there any chances since the scenario regarding counselling of other competitive exams like kcet is same like last year (PESSAT's first round before kcet's first round counselling) . Second round of PESSAT will be after kcet's first round counselling most probably."
    },
    {
      "id": "igu2kcq",
      "body": "ECE in RR I think went till 2300 something, so that u have chance with, I think CSE in EC also went above 2.1K only so both should be peace."
    },
    {
      "id": "igu5i4a",
      "body": "Hey, that's great!\nBut I have a doubt, why are these good branches in the 2000s rank? Is it normal for cutoffs to reach 2k in second round?"
    },
    {
      "id": "igwp22m",
      "body": "they are increasing seats every year thats why, even CS at RR after second round went till 1057 or something this year, which is unusual really"
    },
    {
      "id": "igwp6k5",
      "body": "When was the last time they added CSE seats in PESU? (Any campus)"
    },
    {
      "id": "igyzzlo",
      "body": "my time only I think they increased the seats from 600 to 720 and now I think its has increased to 840? I think"
    },
    {
      "id": "ih0boqn",
      "body": "It's still 720 this year."
    },
    {
      "id": "ih6f2wl",
      "body": "Hey bro can you tell me first round cutoff of PES EC campus CSE?"
    },
    {
      "id": "ihc24hk",
      "body": "how was the counselling? I couldn't attend it...could I have gotten ECE with 2814?"
    },
    {
      "id": "ihc55e8",
      "body": "It was only upto 2400"
    }
  ]
}