{
  "id": "vzxj3m",
  "title": "Query about branch!",
  "content": " \n\n[**I got 1770 rank in PESSAT. I know guys will tell I can get ECE at RR campus not CSE at EC campus but are there any chances of getting CSE at EC campus in second round? I got to know that cutoffs increase in second round is that true?**](https://pessat.quora.com/I-got-1770-rank-in-PESSAT-I-know-guys-will-tell-I-can-get-ECE-at-RR-campus-not-CSE-at-EC-campus-but-are-there-any-chanc)",
  "metadata": {
    "author": "Upper_Nefariousness1",
    "url": "https://www.reddit.com/r/PESU/comments/vzxj3m/query_about_branch/",
    "permalink": "/r/PESU/comments/vzxj3m/query_about_branch/",
    "score": 3,
    "created_utc": 1657914706,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "igcxcgu",
      "body": "You're telling about first round or second round ?"
    },
    {
      "id": "igczay1",
      "body": "This was in Second round."
    },
    {
      "id": "igd06oc",
      "body": "You're 2021-2025 batch?"
    },
    {
      "id": "igd08x8",
      "body": "Yes"
    },
    {
      "id": "igi4cvx",
      "body": "Can you tell me where you are getting the information from. I can’t seem to find it anywhere"
    },
    {
      "id": "igr1seh",
      "body": "From quora I got to know about those first round cutoffs. In reddit , I contacted last year's batch and got to know the second round's cutoffs"
    },
    {
      "id": "igr2lfq",
      "body": "Can you tell me the cs cutoffs for ec campus which you got to know."
    },
    {
      "id": "igr2qyn",
      "body": "1.4-1.5k in first round for CSE in EC campus. 2.1K in second round. Second round cutoffs mostly depend upon how many people surrender their seats in mean time (kcet counselling). Btw what's your rank?"
    },
    {
      "id": "igr2x9v",
      "body": "1880"
    },
    {
      "id": "igr30bi",
      "body": "Oo we're pretty much in the same range.. Are you considering only PESSAT or KCET/COMEDK too?"
    },
    {
      "id": "igr396b",
      "body": "I expect 105 marks in kcet but because of my abysmal board marks, it will probably be useless. \n\n101 marks 3.9k rank in comedk. Also pretty useless \n\nPes ecity is my only option"
    },
    {
      "id": "igr3j02",
      "body": "Bruh who said 3.9k rank will be useless in comedk🗿🗿🗿 You can easily get BMS CSE or even better college in 3rd round of comedk! I messed up big time in my comedk exam or I would've loved to get around your rank😅🙌\n\nAbout boards , same situation here😭"
    },
    {
      "id": "igr9lgi",
      "body": "https://www.comedk.org/uploads/btech-cut-off-rank-after-r3-allotment.pdf\n\nI checked million times lol. Useless( compared to pes south cs)"
    },
    {
      "id": "igrarba",
      "body": "Wth bro you're getting CSE in BIT what else do you want😅.. It's under VTU(Bit easier academics wise) and also will have very less competition when compared to PES.. Placements are also very very good..My elder brother studied CSE from there.."
    },
    {
      "id": "igrbqof",
      "body": "You feel it’s better than cs in ec campus?\n\nHow is your brother doing now?"
    },
    {
      "id": "igrcctl",
      "body": "Where do you expect to go if you cannot get pes for some reason"
    },
    {
      "id": "igrcf26",
      "body": "But I don't know if it's any better than PES EC campus as EC campus is under PESU. Placements, curriculum everything is same now , EC campus is just an extension for PES to avoid crowding in RR campus"
    },
    {
      "id": "igrctap",
      "body": "I don't really have any options. I was not KCET eligible and Comedk didn't go well."
    },
    {
      "id": "igrdds3",
      "body": "Write aeee as well. Amrita is a decent college for cs."
    },
    {
      "id": "igre3l3",
      "body": "Is Amrita College there in Bangalore?"
    },
    {
      "id": "igrep68",
      "body": "There is one in Bangalore, amritapuri and Coimbatore \n\nCoimbatore >>amritapuri>=Bangalore"
    },
    {
      "id": "igretup",
      "body": "Bro for some reasons I've to do my engineering from Bangalore only. How is the Bangalore one tho , How the faculty and placements"
    },
    {
      "id": "igrf3gk",
      "body": "I don’t really know. But I’m sure that pes ecity is better"
    },
    {
      "id": "igrj3dk",
      "body": "Amrita's Bangalore campus is average ngl"
    }
  ]
}