{
  "id": "w21j3a",
  "title": "sgpa crisis",
  "content": "Just finishing sem 2 \nSem 1 was very bad... 6 sgpa and sem 2 is not looking better\n Do i have chance for higher  if other 6 semesters go well?\nJust higher studies , not job placements",
  "metadata": {
    "author": "Background-Fee9531",
    "url": "https://www.reddit.com/r/PESU/comments/w21j3a/sgpa_crisis/",
    "permalink": "/r/PESU/comments/w21j3a/sgpa_crisis/",
    "score": 10,
    "created_utc": 1658156525,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ignqxr1",
      "body": "Keeping it real here, for higher studies, it always depends on what league of universities youre aiming for. Most Ivy League colleges like Harvard, Stanford, MIT, all require an average GPA above 3.5 and above out of 4, Which translates to 8.5+ in the 10 point scale.\n\nOther less ambitious colleges require at least 3 or 3.3 above. Usually at least between 3.3 to 3.5. Refer to the point scale here [https://studyabroad.shiksha.com/how-to-convert-10-point-cgpa-to-4-point-gpa-articlepage-2259](https://studyabroad.shiksha.com/how-to-convert-10-point-cgpa-to-4-point-gpa-articlepage-2259)\n\nThis is considering you also perform well in GRE, have good referrals, good LORs and a solid SOP.\n\nNow, all this is considering you want to pursue higher education right after bachelors. But if you do plan of working and then masters, then youre in luck. Usually colleges prefer to see your work experience than your GPA. My cousin had no\\* intent on continuing higher education, so he didnt pay much attention to his GPA during his college days (it was around 7.5), he had a total of 4-5 years of work ex, and now hes doing his MSc in General Comp Science in ASU.\n\n&#x200B;\n\nGPA is just an edge to have your profile be noticed more, it can definitely help you, but its not the end of the world. There are people with a perfect score getting rejected because of lack of skills or real world experience. GPA is just another thing to boost your profile. You still have a good shot without GPA as well. Not Ivy colleges unfortunately but definitely some other good ones out there.\n\nWork on your skills, have projects which are more towards helping the society, and increase your networking so you get a chance to work with noticeable people out there, all this will help you get a good portfolio, a good SOP and LORs.\n\n&#x200B;\n\nAnd yes, (at least in my experience), it gets easier from here, especially if youre into the subjects you have taken. Dont be too hyper focused on it, you can definitely get your GPA upto a 7.5 if you get around 8 consistently in the next sems (its not that difficult).\n\nThis is all from my personal research and reading, it may be prone to error so apologies if Im wrong and do correct me in the comments if any."
    },
    {
      "id": "igpqb52",
      "body": "Oh. Thank you. Thank you very much"
    },
    {
      "id": "igpvga6",
      "body": "You can retake a few courses to improve your gpa in the summer"
    }
  ]
}