{
  "id": "w5ao5i",
  "title": "What are the electives available in 3rd sem and what concepts do they cover? Also please tell me about CIE L1 and which one is better to go for....",
  "content": "CIE or other electives?",
  "metadata": {
    "author": "sarcriticalist",
    "url": "https://www.reddit.com/r/PESU/comments/w5ao5i/what_are_the_electives_available_in_3rd_sem_and/",
    "permalink": "/r/PESU/comments/w5ao5i/what_are_the_electives_available_in_3rd_sem_and/",
    "score": 8,
    "created_utc": 1658496553,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ih7j7xt",
      "body": "You have special topics (ST) in 3rd sem. Not electives. Those are for 5th and 6th sem. \n\n\nPost the special topics once you get the list. Then we'll be able to say anything about it. There could be a new set every year. \n\n\nAs for some ST, app dev with Android studio, Java, R programming are some I can remember. \n\n\nCIE is a very cool ST. In case you're interest in Entrepreneurship and the likes, go for it. It's usually fun, giving you hands on experience of coming up with a problem statement and solution of your own. Additionally, you get to interact with PVL(PESU Venture Labs) and mentors. Again, choose it if you're into it. \n\n\nBut in general the other special topics apart from CIE can be categorised into two types. \n1. Basic concepts will be taught. You'll have easy ISAs and ESAs. Basically easy marks. \n2. Basic concepts will be taught. Having ISAs will be decided by the course instructor. Instead of written ESA you may have to do a project. Which if done right can be used in your resume too xD. \n\nThat's about it."
    },
    {
      "id": "ih84g64",
      "body": "So, if we choose CIE, we won't be allowed to do any of the courses like Android Studio, Java, etc. Am I right?"
    },
    {
      "id": "ih9rqof",
      "body": "Yup right. Only one ST."
    },
    {
      "id": "ihahhr1",
      "body": "Oh..."
    }
  ]
}