{
  "id": "w5znje",
  "title": "ISAs per sem",
  "content": "I just finished councelling and in the big presentation done the coo mentioned that there would be 2 ISAs per subject per semester \nOn the contrary I had heard from seniors that there would be 5 ISAs a semester\nI'd like to know if they've changed the system or are they trying to cover it up somehow??",
  "metadata": {
    "author": "19-1-13",
    "url": "https://www.reddit.com/r/PESU/comments/w5znje/isas_per_sem/",
    "permalink": "/r/PESU/comments/w5znje/isas_per_sem/",
    "score": 8,
    "created_utc": 1658567553,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ihazqgm",
      "body": "Until last year, it was 2 ISAs per semester for every course. Last year they changed it to 5 ISAs. \n\nIt's possible it was an experimental change and they've reverted it back."
    },
    {
      "id": "ihb2rv1",
      "body": "It could also be that 2 ISAs in first year and 5 later. \nI know for a fact they didn’t remove 5 ISAs because I’m currently a TA and that’s what we’re designing our course based on"
    },
    {
      "id": "ihb3lc0",
      "body": "Is there any way i can clarify the details?"
    },
    {
      "id": "ihbewh0",
      "body": "The 2021 batch had  2 ISAs in the first year and they will 5 ISAs from the second year.\nSince the COO has mentioned it you will be following the same pattern."
    },
    {
      "id": "ihbgn4y",
      "body": "believe the coo"
    },
    {
      "id": "ihc87li",
      "body": "They keep changing the format every year...literally experimenting on us.... Just be prepared and know what u r getting into by joining here."
    },
    {
      "id": "ihcoi01",
      "body": "And what is that one may be ‘getting into‘ if you could pls elsborate :)"
    },
    {
      "id": "ihd9d7n",
      "body": "For starters... \n\nExtremely high student intake, which keeps increasing every year and thus more competition for placements...there around 1400 students just from CSE combining both campuses.. Plus they have introduced the AI/ML branch this time.. So have to see how that turns out. \n\nBouncers on campus (college and hostel both) .. I don't think any other colleges have bouncers to maintain security(at least I haven't heard of it). \n\nHostels accommodation and food-wise is pretty good and worth for the money u pay... But the hostels r run by some of the most arrogant people u can find. Going to other rooms is not allowed... Wearing shorts anywhere except ur own room is not allowed... Daily attendance in hostel and lots of other stuff... I mean i understand this kind of strictness in hostels till class 12...but this is engineering... Who gives a fuck if u r wearing shorts while eating or giving laundry. \n\nToughness of exams and syllabus is pretty high compared to other colleges in Karnataka... No transparency in how u r marked or allotted grades. \n\nMost of the Teachers are actually helpful and will try their best to help us but even they r tied down by extremely tight schedules. \n\nCampus life as such is non- existent... Pretty small campus (Main) and extremely crowded...cant even afford lights for the football turf...Continuous construction going on from last 3 years( finally supposed to end this year with completion of the new building) ... .u cannot roam around even on campus and have to stay in ur room after 10pm. \n\nDuring covid when other almost all other colleges(including nits ) had online exams... We had online classes... But offline exams... Above that they suddenly changed the format of internals from computer based test (CBT)of 40 marks to written internals of 60marks Just for 1 sem... And after that sem they again reverted back to the older system.. And after that they recently changed  internals format from 2 times to 5 times (best of 4 out of 5 may be actually be a better thing, but the point here is frequent changes in patterns without taking input from any students).\n\nThe workload is pretty heavy compared to other colleges. \n\nKeep in mind that all this is coming from an average student + hostelite.. So a lot of things may not apply to many (toppers, day scholars etc.) .. There are also a lot of things (good or bad) which I may not know of. \n\nBut ig some things in general everybody can agree to are that the number of people is too much... Difficult examinations... Difficult to score marks... Very strict, pretty much like a school, certainly forget all assumptions u have of a fun filled engineering life. Others can add on if I missed anything.. \n\nAgain I reiterate...this is not to discourage anyone and there are a few good things too...also, This is not the same for everyone, but pretty much a general idea of what u will face... I feel it's better if u ask different people about their experience and then take a decision."
    }
  ]
}