{
  "id": "w60zzo",
  "title": "Can anyone disclose the closing ranks for both the campuses for cse and ece after the first round counselling",
  "content": "",
  "metadata": {
    "author": "Vengeance55",
    "url": "https://www.reddit.com/r/PESU/comments/w60zzo/can_anyone_disclose_the_closing_ranks_for_both/",
    "permalink": "/r/PESU/comments/w60zzo/can_anyone_disclose_the_closing_ranks_for_both/",
    "score": 7,
    "created_utc": 1658572679,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ihb3cxd",
      "body": "Idk bout the rest but I'm pretty sure CSE at RR closed at around 840"
    },
    {
      "id": "ihb5xfl",
      "body": "You would get it in the second round right?"
    },
    {
      "id": "ihb85xh",
      "body": "Cse rr shut off at 846"
    },
    {
      "id": "ihb882t",
      "body": "Highly possible yes…but if many ppl who missed counselling today show up next round, then probably not"
    },
    {
      "id": "ihbazbf",
      "body": "CSE at EC Campus closed at 2431"
    },
    {
      "id": "ihbffsk",
      "body": "Bruh..I just came from there..I too got CSE in EC campus. That head guy almost convinced my father to let me take ai ml but I didn't take..I took CSE in EC campus too"
    },
    {
      "id": "ihbfig4",
      "body": "Really bruh?? I left when 130 seats were left and ranks went upto 1800"
    },
    {
      "id": "ihbfoft",
      "body": "There's a big blunder done by most ig. Most of them thought to join directly in second round. In my batch 1200-2400..Only 472 came"
    },
    {
      "id": "ihbg6wn",
      "body": "perhaps the turnout was low"
    },
    {
      "id": "ihbghw9",
      "body": "ECE RR closed at 2977"
    },
    {
      "id": "ihbjx7y",
      "body": "Any idea about closing rank of aiml?"
    },
    {
      "id": "ihbnk1m",
      "body": "1400 something\nThis resulted in CSE in EC campus going around 2.4k(second batch had 472/1200 attendance consequently the high cutoff ig)"
    },
    {
      "id": "ihc67kx",
      "body": "Are we talking abt the bald man screaming into the mic at random intervals?"
    },
    {
      "id": "ihc6ut3",
      "body": "https://postimg.cc/c63vjGkC\n\nThese were the ranks when I came back after getting the admission done."
    },
    {
      "id": "ihc7glj",
      "body": "Yup"
    },
    {
      "id": "ihcdvly",
      "body": "And kept saying per se lol"
    },
    {
      "id": "ihcfska",
      "body": "Also “lotta”"
    },
    {
      "id": "ihclujy",
      "body": "Hey bro! You remember me? We used to talk about getting CSE in PESU a few days back on this sub reddit..Did you get it?"
    },
    {
      "id": "ihd1eed",
      "body": "Don't join pes , it's a nightmare just join some other decent college"
    },
    {
      "id": "ihdrogd",
      "body": "Yeah I member you. What a joke dude, the cutoff was like 2400. I easily got it"
    },
    {
      "id": "ihextnt",
      "body": "Actually the cutoff wasn't really 2400. It went upto that cuz only 472 people came. I though everyone will take cse at ec campus but some took AIML too and most people were there after my rank"
    },
    {
      "id": "ihf0h2n",
      "body": "In round 2 are you planning on upgrading to aiml, or have you decided on cs in ec campus"
    },
    {
      "id": "ihf1aep",
      "body": "AI ML is too risky bro..New batch from this year.."
    },
    {
      "id": "ihfc4tr",
      "body": "Why is it a blunder? Most people want only cse rr. And in your batch none of them would have gotten it."
    },
    {
      "id": "ihjqigw",
      "body": "Hey, to everyone who attended the counselling and selected a seat - have you recieved any email/confirmation? My rank was 2379 and it was a huge, huge surprise to get cse in ec campus. Now I'm paranoid and sort of freaking out since there isn't any written confirmation and I have NO other options anywhere else this year. \n\n(The person doing the counselling *did* say the seat is confirmed like she did to everyone who selected a seat, and I've taken an ss of my name under the 'seat selection completed')"
    },
    {
      "id": "ihjqnw7",
      "body": "Hey, have you recieved any official confirmation or email post selection?"
    },
    {
      "id": "ihln2ur",
      "body": "Yup. I tried counting the number of times he said “per se” but I lost count after the fiftieth time per se"
    },
    {
      "id": "ihlnake",
      "body": "Chill bro you made it👍"
    },
    {
      "id": "ijukbkg",
      "body": "A little too late but yeah I've got it. I attended the offline counselling though"
    }
  ]
}