{
  "id": "w6zsuq",
  "title": "Anyone moving near to PESU EC campus or in need of roommate!",
  "content": "Hello Guys, yesterday I got CSE in PESU EC CAMPUS and I live in Yelahanka. I am in search of a good place to stay near the campus. Please do suggest me the best possible options ( except hostel ). IF SOMEONE IS IN THE SAME SITUATION AS ME CAN ALSO DM ME and WE CAN DECIDE TOGETHER ACCORDINGLY.",
  "metadata": {
    "author": "Upper_Nefariousness1",
    "url": "https://www.reddit.com/r/PESU/comments/w6zsuq/anyone_moving_near_to_pesu_ec_campus_or_in_need/",
    "permalink": "/r/PESU/comments/w6zsuq/anyone_moving_near_to_pesu_ec_campus_or_in_need/",
    "score": 8,
    "created_utc": 1658680788,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ihgt0b1",
      "body": "Commenting for reach and why not hostel?"
    },
    {
      "id": "ihgwfth",
      "body": "Cuz that is the last option for me due to some reason.."
    },
    {
      "id": "ihhevor",
      "body": "It's hard to get roomates right away. If you can stay atleast 1 year in the hostel you are bound to get many willing people to shift with you. Who knows what kind of roomates you'll get now? Atleast in the hostel you'll get an idea of how the person is and then decide.\n\nAt the moment? Slim chance but all the best. Commented for visibility."
    },
    {
      "id": "ihhgres",
      "body": "Thanks for the much needed advice. I'll try to find someone in the campus itself. What I feel is PESU has really high hostel fees (1.35L per year) and in that too 4 students will be on sharing. I think I'll be better off with a good lad in a PG or something like that."
    },
    {
      "id": "ihj1x39",
      "body": "But that includes 3 meals, snacks, wifi, laundry as well, and no commuting expenses. I don't think you can get all that for 1.35lakhs outside"
    },
    {
      "id": "ihjjgz1",
      "body": "How are the hostels and mess there?"
    },
    {
      "id": "ihjmftl",
      "body": "Hostel is quite nice u will make many friends. It has football ground, basketball ground, tennis ground etc. Nearby there are supermarkets and what not. Only the curfew timing may be a pain in the ass other than that it’s awesome."
    },
    {
      "id": "ihjmoc4",
      "body": "What is the curfew timings? And the bathrooms and rooms are clean and maintained? The bro the fooood in the messs pls telll me"
    },
    {
      "id": "ihjqvei",
      "body": "Bathrooms are common in each floor. The food is fairly good( except veg kurma xD). As for maintenance , maids come once in 2-3 days and clean ur room. Bathrooms are reasonably clean."
    },
    {
      "id": "ihle3rf",
      "body": "For 2021 batch they didn't accomodate 4 people in one room mostly 2 people in a single room, 3 at max and to be on the safer side choose a room on 3rd floor because they'll fill 1st floor with 3 people in a single room and it goes on serially."
    },
    {
      "id": "ihlgnj5",
      "body": "Do you live in EC Campus college?"
    },
    {
      "id": "ihliq1q",
      "body": "I used to live in Amaatra hostel which is the hostel you'll be getting for the 1st year , now I've shifted to campus hostel."
    },
    {
      "id": "ihlnp4w",
      "body": "Did you see how tiny the rooms are. I went there yesterday and there isn’t even enough space to stretch your arms. It’s like it was designed for smurfs"
    },
    {
      "id": "ihlnzh5",
      "body": "Which hostel is better?\n\nIs the space enough to live comfortably?"
    },
    {
      "id": "ihlpboi",
      "body": "I've lived in Amaatra for 9 months and i shifted to campus hostel this week only , and I'd say Amaatra if Amaatra was closer to college people would never move out but Amaatra has ridiculous curfew timings ie 7PM though you can stay out till 8 if you inform warden about it and It was definitely comfortable for me because i only had one other guy with me and cleaning is done almost on a daily basis, And you can't choose campus hostel as a fresher as far as i know so it'd be better to choose Amaatra over PGs  because you won't be able to make friends if you're isolated."
    },
    {
      "id": "ihlpo1s",
      "body": "Thanks, hopefully I get one roommate as well"
    },
    {
      "id": "ihlr07u",
      "body": "You'll most probably get one roommate because intake is same as last year for EC campus."
    },
    {
      "id": "ihnkj6k",
      "body": "Were there 360 pessat seats for cs in ec campus last year as well?\n\nSomeone told me it was 200 and they added 160 new seats this year"
    },
    {
      "id": "ihns70a",
      "body": "Are there curfew times for the campus hostel as well? What time?"
    },
    {
      "id": "iho04qj",
      "body": "Nope it was same ."
    },
    {
      "id": "iho0chu",
      "body": "Warden told me it's 9"
    },
    {
      "id": "ihof6rl",
      "body": "why do you think the cutoff went so low. \n\nLast year it was ~1400, this year I think it went up to 2450 or so. \n\nI thought it was because of higher number of seats. If it’s not that, then what else can be the reason"
    },
    {
      "id": "ihofnxu",
      "body": "Because they started AI/ML in RR campus which affected the cutoff of EC campus and they've increased the fee and they've dropped down in NIRF rankings ,all of these factors caused the drop in cut-off for EC campus."
    },
    {
      "id": "ihogvo2",
      "body": "That’s a reasonable explanation. \n\nAnother thing I want to ask is, should I pick aiml in rr over cse in ec?"
    },
    {
      "id": "ihoj5ui",
      "body": "Last year i was in the same dilemma when I was getting AI/ML in MSRIT via Comedk and CSE in EC campus via PESSAT but people who work in industry and few seniors from this subreddit suggested it's better to pursue CSE over any specialization right now.\nAbout the EC campus it's almost double the size of RR campus and has much more potential for growth in terms of infrastructure, they're already building Medical college in it which will be functional from next year, in terms of placement i don't have much idea you can ask seniors from EC campus about that , Club activities are there but not as much as RR campus , opportunities are almost same as the RR campus.\n\nIf you've anything else to ask just DM me."
    },
    {
      "id": "ihyj2pw",
      "body": "NIRF rankings are just crap(not entirely but majorly). I saw the criterias they consider to rank colleges. Most of them are useless considering the things PESU is famous for! And yea the other factors you mentioned must be the reason for low turnout in first round. But I would not be surprised if cutoffs go higher(2400 to 1800ish) for cse in ec campus in second round!"
    }
  ]
}