{
  "id": "w8i3xm",
  "title": "Should I join or drop?",
  "content": "I have gotten into ece rr but i kinda wanted cse just because it has better job prospects , i don't have a particular passion for anything \nHow is the life of an ece guy in pes ? \nCan I get time to study cs concepts and apply for IT jobs ? \nAnd more importantly will ece ug hurt my chances of growth/masters  in cs because i am kinda planning for a masters abroad down the line so would it be better to take a drop ?",
  "metadata": {
    "author": "ShreyastheIndian",
    "url": "https://www.reddit.com/r/PESU/comments/w8i3xm/should_i_join_or_drop/",
    "permalink": "/r/PESU/comments/w8i3xm/should_i_join_or_drop/",
    "score": 5,
    "created_utc": 1658837335,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ihphr82",
      "body": "Ill try to anser them one by one\n\n&#x200B;\n\nHow is the life of an ece guy in pes ?\n\nhectic. ece is is the toughest engineering course and requires a lot of work. The dept demands a lot too. There are lots of smart peeps at ece.\n\n&#x200B;\n\nCan I get time to study cs concepts and apply for IT jobs ?\n\nWell, weekends probably at the best. You need to learn to manage time really well. Your first year ill be speed rushed. My and my junior batch both had its first year done in 7-8 months.\n\n&#x200B;\n\nAnd more importantly will ece ug hurt my chances of growth/masters in cs?\n\nnot really, but cs students might have a bit of advantage"
    },
    {
      "id": "ihpi1vr",
      "body": "You can do minors in cse and apply for IT jobs as well but if you do decide to take drop you could aim for cse at BITS or NIT which would be much better imo"
    },
    {
      "id": "ihputhp",
      "body": "Junior batch (2021) CET 3rd round guys had exactly 6 months only."
    },
    {
      "id": "ihpyarc",
      "body": "Are u from ece ? \nCan I dm some specific qns ?"
    },
    {
      "id": "ihq382y",
      "body": "come to college discord and ask them there"
    },
    {
      "id": "ihq49em",
      "body": "That whole batch has suffered a lot"
    },
    {
      "id": "ihqjft2",
      "body": "Ok ,Can u give me a link pls ?"
    },
    {
      "id": "ihqqtsz",
      "body": "https://discord.gg/YXQjBXb7Sw"
    },
    {
      "id": "ihr2hy2",
      "body": "is it relative grading or absolute?"
    },
    {
      "id": "ikoxsaq",
      "body": "Hi my rank is 3.8k in comedk. I am planning to join dsce Bangalore. Can you please tell me how is it?"
    }
  ]
}