{
  "id": "wbatm9",
  "title": "About 5th sem",
  "content": "Hey seniors!\n\nFrom this 10 aug classes will be started for 5th sem.\nWe have DBMS, machine intelligence and software engineering and for electives I took data analytics and graph theory. Are these subjects tough? From where did you study these subjects?",
  "metadata": {
    "author": "Ok-Fudge6043",
    "url": "https://www.reddit.com/r/PESU/comments/wbatm9/about_5th_sem/",
    "permalink": "/r/PESU/comments/wbatm9/about_5th_sem/",
    "score": 6,
    "created_utc": 1659116033,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ii84f5o",
      "body": "It's been a while for me, but DBMS was fine and SE was pretty straightforward. \n\nData analytics will depend on your prof. If it's Prof. Gowri, it's a good bit of work, but if you're looking to do an MS later in either data science/ML it's very useful (along with an LoR)."
    },
    {
      "id": "iiabxy1",
      "body": "FYI,  Data Analytics as a subject is really harsh with the syllabus (had to deal with literally 100s of formulae). There's even a project that you need to do and write the report in IEEE paper format, but the test question levels were surprisingly easier during ESAs."
    },
    {
      "id": "iic1x96",
      "body": "So, will it be tough?"
    },
    {
      "id": "iic24w0",
      "body": "My friends who studied in VIT said DBMS was tough to them and data analytics is also tough. So, I'm scared"
    },
    {
      "id": "iic3aze",
      "body": "Personally I found studying for the subject really tough. It's pure maths, but you don't have enough time to linger onto a concept and practice before the next one is taught. Almost every lecture was an introduction to a new formula or concept. \n\nMy advice? See if you can get a hold of this semester's syllabus. If you want, I can DM you some of the notes we used to study for each unit so that you can get an idea of how it'll be like. Check all of those and how your professor is like before making a decision. I think you can finalize or change your elective within the first week of college. \n\nIt's not an impossible subject, but it's an elective. Even if you don't take it up right now there's no need to worry over missing out on things. The thing that matters is not tanking your cgpa if you took an elective that you didn't know would be tough or stressful."
    },
    {
      "id": "iicjtnm",
      "body": "Bro can you share the notes"
    }
  ]
}