{
  "id": "wbbv3g",
  "title": "Questions regarding Placement Process",
  "content": "Hi, I wanted to know what is the placement schedule for the uni. Like do companies return to hire later after the initial deluge of tests going on right now (End of July). I wasn't prepared at all for the onslaught of tests and I'm pretty sure I won't be able to get a good offer.\n\nSo if there's a chance of companies hiring all year round i.e during 7th and 8th sem, I'll try to better prepare myself.\n\nAlso, any tips for placements based on your experience would be awesome!",
  "metadata": {
    "author": "JobHunter198",
    "url": "https://www.reddit.com/r/PESU/comments/wbbv3g/questions_regarding_placement_process/",
    "permalink": "/r/PESU/comments/wbbv3g/questions_regarding_placement_process/",
    "score": 6,
    "created_utc": 1659118613,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ii7uyhy",
      "body": "If you're referring to the same companies returning later, then no. Only a few small T-3 companies might again come to recruit again, but none of the T-2 and above companies visit again.\n\nHowever, companies do keep visiting all year round, with a few T-1 companies even visiting during 8th sem (although the number is significantly lower than 7th sem). \n\nPESU does not have a fixed order of companies that visit and the tests and interviews are mostly scheduled when a company approaches them on the fly."
    },
    {
      "id": "ii83g5y",
      "body": "The hiring cycle used to be November - April for summer internships after your 3rd year and pretty much the entirety of your 7th sem for FTE/Intern positions. Companies that pay more will come in the start. Not sure if that is still the case. \n\n\n>Also, any tips for placements based on your experience would be awesome!\n\n* Leetcode/CP isn't the most important thing. It's good to have some experience for the coding test but it's not like you need to sit and grind it. From my personal experience (+what I've seen during company hiring) during your interviews it's very important to convey your thought process. If you look at a problem and can't think of an O(nlog(n)) solution, it's fine. Start at n² and explain your thought process as you go through things. Strong fundamentals and the ability to think your way out of a problem are what most good recruiters want to see. \n\n* Your projects are actually really important. I believe they're the sole reason I got my internships/job. Since most core courses need you to do projects, just try and go above and beyond in the subjects you're interested in. \n\n* Idk if any of the old faculty still take it, but advanced algorithms was easily one of the most useful courses I took in college, and it gave me most of the tools I needed for placements and even work. \n\n* CTC is a scam. Don't bother comparing yours with someone else's or chasing after the highest package. Depending on your goals/plans, you might earn more in 2 years at a company that offers 15 vs one that offers 50 based on how they structure it."
    },
    {
      "id": "ii99kkq",
      "body": "Some placement data can be found here: https://docs.google.com/spreadsheets/u/0/d/18BzbVvG80LRJ5p2jQdZ446IqL8rUbaEyrGxpOnW2PBY/htmlview#"
    },
    {
      "id": "ii9i3a5",
      "body": "Thanks for the info! Can I DM if I have other questions?"
    },
    {
      "id": "ii9ijd7",
      "body": "Thanks for the detailed reply!"
    },
    {
      "id": "ii9ik9n",
      "body": "Thanks!!"
    },
    {
      "id": "ii9kmt9",
      "body": "Yeah sure"
    },
    {
      "id": "ii9kpos",
      "body": "Maybe make a new post? Multiple people might be looking for this"
    },
    {
      "id": "ii9kuzm",
      "body": "Sure"
    }
  ]
}