{
  "id": "wdenlz",
  "title": "ML Placements at PESU",
  "content": "Sooo....I went throught the placement list for 2022 batch and I couldnt help but notice that there were far more compnies coming for SDE roles as compared to ML roles....So that got me thinking should I continue with ML or should I switch to Full Stack development?Also those who did get placed into ML roles can you please share your placement experience so I can get an idea about what type of questions are asked....",
  "metadata": {
    "author": "Basic_Ad_900",
    "url": "https://www.reddit.com/r/PESU/comments/wdenlz/ml_placements_at_pesu/",
    "permalink": "/r/PESU/comments/wdenlz/ml_placements_at_pesu/",
    "score": 13,
    "created_utc": 1659351888,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "iihyn19",
      "body": "Companies usually don't come recruiting for ML related roles. A quick Google search will show you that all companies only offer those roles for people with atleast 1-2 years of working experience. It was also the reason why Intel (where I interned for 6 months as an ML Research Intern) did not offer me a PPO and asked me join as an SDE first and then shift after a year. Currently I'm working in Analytics in another company. \n\nCompanies will recruit you into a standard SDE role and then assign you to a team into which you'll fit in best. If there are teams aligned with ML, then you'll get lucky. But as such, companies will not come specifically looking for a ML Engineer. However there are a few companies offering data science roles to candidates. Either way, the way to get to the interviews is the same - DSA."
    },
    {
      "id": "iinaknl",
      "body": "There are some companies who come for solely ML/data science roles, but the vast majority are in regular dev. This is especially true for the guys who tend to pay more. I got hired as a dev and I shifted into an ML team after about 6 months where (surprise surprise), we also do dev work. \n\nYou should know the basics of full stack dev anyway if you're looking into ML engineering, but if ML is what you're interested in, you should go ahead and continue exploring it. You'll find options off campus as well. Be prepared to pursue a graduate degree if you want to move into actual ML development instead of just consumption though."
    },
    {
      "id": "iinl6vx",
      "body": "Hmm so if I am interested in ML domain I have to learn full stack alongside too?"
    },
    {
      "id": "iinll4j",
      "body": "Hmm but how do I take out time to learn both dev and ML stuff?Especially now with 5 isas system"
    },
    {
      "id": "iino3f3",
      "body": "Ideally the point of college is to learn this lmao. The courses that I had were fairly good in all honesty. Dunno what the situation is like now."
    },
    {
      "id": "iirkjl3",
      "body": "So i can focus on ML and aim for SDE roles?"
    },
    {
      "id": "iirklpa",
      "body": "So the web dev we learn in clg will suffice along with my ML hustling?"
    },
    {
      "id": "iirmnaz",
      "body": "I hated web dev and never did it, so can't say for sure. For stuff like cloud, yeah I think so. You'll learn more on the job ofc."
    }
  ]
}