{
  "id": "wih2hk",
  "title": "Options other than Amaatra hostel",
  "content": "Hey guys I've got CSE in PESU EC Campus, I am in search of options to stay near campus(<5km) other than the Amaatra Hostel(My father didn't like the idea of accomodating 4 students in a room). I with my father visited the Maruthi \"student\" PG that is alongside the campus and saw some dudes smoking there def not students, so yeah\n\nDoes anyone here know the other alternatives?",
  "metadata": {
    "author": "Upper_Nefariousness1",
    "url": "https://www.reddit.com/r/PESU/comments/wih2hk/options_other_than_amaatra_hostel/",
    "permalink": "/r/PESU/comments/wih2hk/options_other_than_amaatra_hostel/",
    "score": 5,
    "created_utc": 1659882682,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ijbn4rh",
      "body": "You can try Stanza living PGs near College they're better than Maruthi and closest to the college."
    },
    {
      "id": "ijbpq2d",
      "body": "Ok will see that too next time!\nBut rn I've lost fair amount of trust from PGs"
    },
    {
      "id": "ije4vv8",
      "body": "Amaatra only allows 3 person per room not 4 (at least for us it was like that) and the pessat people who came early even got allotted 2 people per room, later when cet people came in dec-jan they made it to 3 people per room. \n \nAnd coming to your question, there many pgs near hostel like living stanza which are your way to go. \nMy suggestion would be to choose amaatra, cause it's the best shot you got."
    },
    {
      "id": "ijeehue",
      "body": "That's how most of the PGs are...\n\nI would suggest staying in the hostel itself.."
    },
    {
      "id": "ijf6njs",
      "body": "It's 4 per room(Bunker beds). I visited there with my father yesterday. Eventhough I am not claustrophobic but soon I might become if I be there💀"
    },
    {
      "id": "ijfcgdn",
      "body": "funny cuz you're not the only person who's prolly thinking the same way. I was so hell bent upon not joining amaatra but one year later in that hostel and I wouldn't have had it any other way."
    },
    {
      "id": "ijftpvq",
      "body": "Yeah ik there are 4 beds and when you call them they'll tell you it's 4 person per room but it's actually 3, trust me i stayed there xd. Idk about this year though but it's highly unlikely that they'll make it 4 per room. \n\nRooms are decent imo, if you just give a visit to campus hostel and look into rooms, you'll feel amaatra rooms are far more better. Amaatra has its own pros and cons. It's upto you now. Wish you the best."
    },
    {
      "id": "ik5nulo",
      "body": "Pl share the pros and cons , if possible. Thanks"
    },
    {
      "id": "ik5pbc6",
      "body": "Pros:- typical pros of a hostel (Group study,chill,hostel life,etc.)\n\nCons:- Now this will be my personal opinion based on how I felt when I visited the hostel.\nThere was a rectangular room with ½ of the room occupied by 2 bunker beds(i.e. 4 students) , and the other half by 4 study tables that's it. And I personally felt I would develop a bit of claustrophia even though I don't have it rn. In my opinion you should check it out yourself once then decide.\n\n\n\nAbout the mess section, like any other hostel don't expect the food to be like your home's food. The other things are same like other hostels..."
    }
  ]
}