{
  "id": "wjcmu1",
  "title": "HOSTEL RELATED QUESTIONS.",
  "content": "Is there single bedroom for 1st year. If yes, what are the fees if no then what are the other alternative like pgs near hostel where I can find single bedroom.\n\n\nEdit: Electronic City campus.\n\n\nEdit 2: i stay just 20 mins from college, but i really wanna stay in hostel. So should I join hostel, what are the pros and cons.",
  "metadata": {
    "author": "More_Scholar6180",
    "url": "https://www.reddit.com/r/PESU/comments/wjcmu1/hostel_related_questions/",
    "permalink": "/r/PESU/comments/wjcmu1/hostel_related_questions/",
    "score": 7,
    "created_utc": 1659974716,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ijggct7",
      "body": "Specify the campus too"
    },
    {
      "id": "ijggif4",
      "body": "Ec campus"
    },
    {
      "id": "ijgl168",
      "body": "Bro I don’t think u should join hostel if you stay 20 min from college."
    },
    {
      "id": "ijglc9j",
      "body": "Actually my parents too want me to stay in hostel, i stay in a joint family, so it's really had to concentrate on studies."
    },
    {
      "id": "ijglkd3",
      "body": "I too agree, a college life without a hostel is very boring.\n\nAnd as you are nearby in Bangalore, when the hostel gets boring, you can always go back home"
    },
    {
      "id": "ijglpvp",
      "body": "Yeahh... That's also there every weekdays i can just cycle home."
    },
    {
      "id": "ijglvs1",
      "body": "I am a RR campus hostel kid so can't answer the first part of the question :'("
    },
    {
      "id": "ijgmbxu",
      "body": "What ABT rr campus i am gonna go through kcet, so still didn't fix my college, can I get single bedrooms?"
    },
    {
      "id": "ijgmhw9",
      "body": "For RR \n\nfirst year, you cannot get a single room, but from second year onwards you do get it\n\nIt's called the IH Block"
    },
    {
      "id": "ijgn8ph",
      "body": "Ohh ok thanks bro.."
    },
    {
      "id": "ijh2kx4",
      "body": "Pros: You get to make friends , you become more responsible,etc\n\nCons: Food is shit , Travelling to college is a bit hectic, Too many rules and  restrictions (even though most of them you won't follow)."
    },
    {
      "id": "ijh5fqu",
      "body": "isnt the hostel inside the college?"
    },
    {
      "id": "ijh5mk0",
      "body": "For EC Campus Hostel is outside in a school owned by PES(only for freshers)."
    },
    {
      "id": "ijh5yuo",
      "body": "aahh maan then its bs to stay in hostel"
    },
    {
      "id": "ijh6d5w",
      "body": "It's actually a decent place to socialize and make friends and they've plenty of spaces for different kinds of sports."
    },
    {
      "id": "ijh71v8",
      "body": "ahh will surely consider this fact before deciding where to stay"
    },
    {
      "id": "ijij5s3",
      "body": "Don't join hostel this year cause it's only 20 min travel for you. FYI for first years hostel is 7kms away from campus."
    },
    {
      "id": "ijjbich",
      "body": "ohh then its better not to join hostel"
    },
    {
      "id": "ijlse44",
      "body": "What are the fees for the IH block?"
    }
  ]
}