{
  "id": "wk32qk",
  "title": "Kcet Drama",
  "content": "[deleted]",
  "metadata": {
    "author": "[deleted]",
    "url": "",
    "permalink": "/r/PESU/comments/wk32qk/kcet_drama/",
    "score": 3,
    "created_utc": 1660050999,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ijks3vu",
      "body": "Was really concerned about this. I want to take admission in PES EC campus in EC with my rank of 2.1k, but I'm scared about the fact that this verdict from HC will hamper my admission (as a fresher in KCET). Pray that things go well and they do so quickly. Really anxious about my future. What do you think is the right solution to this problem keeping in mind the situation of both repeaters and freshers?"
    },
    {
      "id": "ijkta9y",
      "body": "Fair verdict 😂. But really even the high court is in dilemma cause if they favour droppers freshers will go on streets and vice versa ."
    },
    {
      "id": "ijkth30",
      "body": "I just hope nothing happens to my rank and the number of seats and college cutoffs. Oh man only if things worked out at least once according to me/"
    },
    {
      "id": "ijkuu5j",
      "body": "Yooooooo I wanted to ask the same thing  \nWhen the classes of 1st year are starting exactly? In counselling they said its 22 aug but I think as there's no update regarding that, it might get postponed? Pls anyone clarify this and if possible can anyone talk to the administration office regarding this."
    },
    {
      "id": "ijkvh5d",
      "body": "Yea exactly!!"
    },
    {
      "id": "ijkwvqr",
      "body": "I am from Pune and did not give KCET, but just yesterday ( 9th Aug ) I called the admissions office and they told me that the dates for the second round of counseling and commencement of classes are not fixed yet and are bound to change as a result of the current situation."
    },
    {
      "id": "ijkxen9",
      "body": "PES usually does not really wait for KCET. Last year they started without the KCET kids and they had to catch up. PES usually starts on the date announced (22nd in your case)"
    },
    {
      "id": "ijkxmht",
      "body": "PESSAT batch will start as usual, don't worry."
    },
    {
      "id": "ijkxuch",
      "body": "In the orientation, they said for PESSAT students they would start on Aug 22nd, and if KCET results are delayed or smtg, they would start a separate batch. So I think it is safe to say that PESSAT students have to go on Aug 22nd, and for the others they'll figure something out."
    },
    {
      "id": "ijky3me",
      "body": "Tnxxx"
    },
    {
      "id": "ijky9st",
      "body": "I missed CS RR by 50 Ranks does this mean I will have to start of in EC Campus and then after Round 2 I will be shifted to RR?"
    },
    {
      "id": "ijl06lz",
      "body": "PES does not wait for KCET. Since the number of PESSSAT students are way more, they just start classes for them and wait for KCET to join in later"
    },
    {
      "id": "ijl0q7b",
      "body": "Yes."
    },
    {
      "id": "ijl4g3s",
      "body": "Wht about jee adv?"
    },
    {
      "id": "ijl6s9m",
      "body": "Same. PES prioritises PESSAT quota over all others"
    },
    {
      "id": "ijocnp0",
      "body": "What abt students who join though 2nd round of counseling"
    }
  ]
}