{
  "id": "wlx81p",
  "title": "Help required :)",
  "content": "Hey, I am currently studying in the 5th semester. Yes, I joined through management quota.\n\nI have failed to score well , get good grades, and barely have any skill.\n\nI haven't crossed 7 in any of these 4 semesters. \n\nI wonder what's next. \n\nOfc Off campus is the only way. Any suggestions/recommendations accepted!.\n\nYes,only I know what I am going through. I couldn't pick up my momentum through ISAs and yes I am severely depressed about it. And No,I can't take any medical help either\n\nYes I have peer pressure. I have been procrastinating soo much. I have no mood to do anything, nor any reason to live . Yes,I am suicidal. I get these thoughts too much. But I don't wanna be a coward\n\nNor a mediocre in life.\n\nIdk if I will get placed,nor do I have friends to ask help for\n\nGG guys :)\n\nBye",
  "metadata": {
    "author": "[deleted]",
    "url": "https://www.reddit.com/r/PESU/comments/wlx81p/help_required/",
    "permalink": "/r/PESU/comments/wlx81p/help_required/",
    "score": 13,
    "created_utc": 1660239245,
    "flair": "Study Help :table:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ijwgsgv",
      "body": "Don't worry. Do mad coding. Solve like 200-300+ problems by the time you sit for placements. And go seek professional help!"
    },
    {
      "id": "ijwi1d0",
      "body": "You sound like the equivalent of the typical Indian parent saying be happy if you're depressed. As for go get help, I'd agree with you."
    },
    {
      "id": "ijwjc7r",
      "body": "I mean if the person does coding non stop will give in confidence of getting a job right. Ofc has to not have any backlogs."
    },
    {
      "id": "ijwmch0",
      "body": "I lived with roomates who are in the exact same situation as you. For a second I thought if it was my roomate XD.\n\nWhat course in BTech are you persuing? \n\nHere's the thing about coding. Unlike other types of work, coding is a very thought intensive job. I could spend all week trying to fix a critical issue in a huge program but end up changing 3 lines of code. It requires a logical train of thought foremost and the coding language would be a manifestation of this thought process. Like all things, you can sit and train yourself to think like that. But being good at anything requires effort and without that drive to push yourself, leave coding, doing anything would prove to be a challenge.\n\nMy point being, you'll need to first ask yourself, do you like to code? I'm sure you've learnt the basics of coding in first year. If that caught your interest, you'll need to motivate yourself to learn more.\n\nDon't look at what language to learn. Ask yourself again, what do I want to build with using code? A website? A ML model? A mobile app? Once you're clear with this answer, go ahead and learn the technical details in that field. You want help? Keep asking in forums like you did for CPP. There are people out there who are willing to help. But that motivation should come from you. No one, not your friends, not your parents or their ancestors will be of help here. Only YOU can motivate yourself. \n\nPlacements are still ways away. It's not too late. Don't worry about it now. Cross that bridge when you get there.\n\nWhile I understand the peer pressure you're facing, it's not the end of the world. This place and city has a lot of opportunities. You just need to be willing to jump high enough to reach it.\n\nI used to tell this to my roomate, Dream big but expect nothing. That fear of expectation will give you anxiety preventing you from doing anything. Don't fall for it. \n\nNobody wants mediocrity, not me, not anyone. But there are still countless people who work average jobs, with an average lifestyle. Mediocrity should be treated simply as a mindset. If we drowned ourselves with general population statistics for mediocrity, I'd probably be swinging from a fan 3 semesters ago.\n\nBeing satisfied with the opportunities given to you and working with what you have to give yourself a better chance to come out of your definition of mediocrity should be your concern. \n\nIt's going to get better. Don't worry."
    },
    {
      "id": "ijwn9z3",
      "body": "If I brought my roomate to meet you he'll flog you for uttering this statement because that's what he did and I can confidently say if I put that much effort, I'd end up being the college topper by a huge margin XD. \n\nSome people are simply not cut out for this. No matter how hard they try, there's only so much improvement a person can make in the limited time they get at engineering.\n\nYou can't ask a fish to climb a tree."
    },
    {
      "id": "ijxvstd",
      "body": "But the thing is guys,for me to get placed in a nice company,according to my cgpa. I can't sit for tier 1 jobs. I need to go for off campus placements and then geta high paying job.\n\nI am also asking as to how these guys are getting 10.00 cgpa that too one guy had scored 10.00 in all 3 semesters. I wonder how. Please give some tips"
    },
    {
      "id": "ijz4qh5",
      "body": "Yeah, don't tell me that you earn ur shit and u pay ur college fees lmfao.Daddy's money haha. Its soo good for u to comment haha. You don't know what happened to me when I was attending CET. So stfu you poor bitchh"
    },
    {
      "id": "ik2hivi",
      "body": "Like I said. Some people have a knack for studying. Not everyone can do what they can. You can wonder how all day long, but it comes naturally to them. Putting in some effort with that results in stuff like 10 GPA.\n\nIf you're not making an effort to do something about your situation like you implied in the post you're hurting yourself. Don't do that. Having such a nihlistic and all or nothing attitude isn't helping here.\n\nYes, maybe you can't get a 10 GPA. But try to do better than your last. Even though the results might not be as you expected, you're going to come out from this with some sense of satisfaction that you tried hard to change your situation.\n\nTips to study? I genuinely don't know what to say. It's like asking how to eat. A detailed answer would be with your hands or a spoon. Maybe a little table manners and etiquette. What more can you expect from such a question?\n\nHaving a routine to study and concentrating during classes helps a lot. Organization and completing small chunks of concepts at a time helps. Sorting out doubts ASAP helps down the line in understanding concepts. That's what I have done.\n\nSome people study with low music in the background. Others require complete silence. Some study well in groups, others find it distracting. This stuff is something you should figure out yourself. I can tell you to study, But how you do that comfortably and efficiently is something you should figure on your own."
    },
    {
      "id": "ik3dq61",
      "body": "Not good advice mate!"
    },
    {
      "id": "ik3dvc0",
      "body": "Thank Youu,\n\nAlso I meant to ask if they like study the whole textbook,workout every problem in a textbook. Read thoroughly through the notes etc \n\nOr do they just read like slides and score so well"
    },
    {
      "id": "ik3uh1j",
      "body": "Many focus on understanding concepts first and then solve a couple problems in the text book. This understanding process may involve studying text book or if slides are clear enough, they go with that."
    }
  ]
}