{
  "id": "wm8034",
  "title": "ISA and ESA",
  "content": "[deleted]",
  "metadata": {
    "author": "[deleted]",
    "url": "",
    "permalink": "/r/PESU/comments/wm8034/isa_and_esa/",
    "score": 1,
    "created_utc": 1660267118,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ijygot9",
      "body": "A) In the first year, it's 2 ISAs and 1 ESA per course, along with the regular assignments, quizzes, projects, labs. From the 2nd year, it becomes 5 ISAs and 1 ESA with the same deliverables before. There are about 5-6 courses per semester, so multiply and you'll get the total number of tests you'll be giving in the span of 4-4.5 months.\n\nB) If it's 2 ISAs, there is one ISA about 1.5 months (roughly, depends a lot on the calendar for that semester). If it's 5, it's every other week. \n\nC) The ISAs are hard. A lot of people underestimate them when they come into first year and they end up screwing the first ISA. The ISAs do take effort, and questions can be either as simple as MCQs or long theoretical derivations/writing code as well. However from the 2nd year onwards since it's 5 ISAs, there are more MCQs than theoretical, so it makes life a little easier, plus the evaluation policy becomes best of 4. But generally speaking, if you don't do well in the ISAs, you'll end up screwing up your overall grade since the ESA only contributes 50% at max. There is very little room to cover up. In first year, if you screw up your ISA 1 super bad, you've already lost the opportunity to get an S or A grade in that course. \n\nSince I don't know about the course, it's duration and it's requirements as well as your academic ability, it is difficult for me to comment and say if you will be able to handle it. I'd suggest you to keep all these points in mind before taking it up. You might get a little free time during first year but from whatever I've seen, it's extremely difficult to get any kind of free time from second year."
    }
  ]
}