{
  "id": "wn9v3j",
  "title": "Insights on subredditors of this subreddit",
  "content": "Which year student are you?\n\n[View Poll](https://www.reddit.com/poll/wn9v3j)",
  "metadata": {
    "author": "ChromaticChaos",
    "url": "https://www.reddit.com/r/PESU/comments/wn9v3j/insights_on_subredditors_of_this_subreddit/",
    "permalink": "/r/PESU/comments/wn9v3j/insights_on_subredditors_of_this_subreddit/",
    "score": 5,
    "created_utc": 1660381067,
    "flair": "ANNOUNCEMENT :snoo:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ik3xmeu",
      "body": "Lmao this sub is dead. Maybe do some marketing on the insta meme pages that are wayyyyyy more popular?\n\nEdit : most of the posts I've seen on this sub are dead with barely any comments, some have no interaction at all. How would you feel if you asked a question important to you but it fell on deaf ears? All the time? Marketing is necessary to get more people in this sub so there are more open discussions, more interactions. That's it."
    },
    {
      "id": "ik3xre9",
      "body": "The point is not to have a big subscriber count or clout\n\nIt's about talking to other peeps and mostly helping each other out\n\nYou need to see the number of people we have helped, that by itself is success for the sub"
    },
    {
      "id": "ik3ya02",
      "body": "The goal was never to make a popular forum page with lakhs of people right? It's not meant to be Instagram where people follow for entertaining content.\n\nThe goal is to have a single point of information for all questions one might have about the University. Allows people from different branches to share their experiences and help each other out. \n\nA lot of people have (hopefully) benefitted from this sub, not only incoming freshers but also people moving to other years. And now this information is out there for anyone else to access without them needing to ask again. There's information about hostel, admissions, faculty, etc all from University kids available for everyone to see, with genuine feedback from actual students, something which is not there elsewhere.\n\nYou're in the wrong place if you're looking for entertaining content about the University. Meme pages are meant for that. This was never about the number of subscribers."
    },
    {
      "id": "ik3zluc",
      "body": "Fair point but what i think he meant was that this page would benefit more if it was promoted on platforms like instagram, in that way more students would come to benefit from this page. I still know many people who have no idea what reddit means.Although i'll agree about not promoting on meme pages part but marketing it as an all-in-one page about the university would help loads imo"
    },
    {
      "id": "ik4q6fp",
      "body": "That sounds wonderful, and I'm all for it, but every post I ever see of always empty, and it saddens me. I was hoping through the pages we could get more people in here so we could have a more engaging discussion on the posts that get put here. I see the posts and I wanna help but I have nothing to contribute, so I was hoping brining in more people would help with that"
    },
    {
      "id": "ik4qkpm",
      "body": "No, I'm not talking about memes, I have seen the information available, and I could used it years ago. Sadly I didn't know this sub existed until recently, so I just wanted this sub to get some renown"
    },
    {
      "id": "ik7x3i8",
      "body": "Yeah true\n\nI am trying to get my batchmates and friends into the subreddit but yeah, it's a subreddit\n\nIt always takes time to grow\n\nWe gotta be patient xD"
    },
    {
      "id": "ik8q569",
      "body": "Insta marketing can help tho. Rn that's one thing that I can think of. Other thing I cab think of is get a shout out on the pesu discord server"
    }
  ]
}