{
  "id": "wv1zr5",
  "title": "Should I take drop instead of taking mechanical at pes?",
  "content": "",
  "metadata": {
    "author": "mitsuhara321",
    "url": "https://www.reddit.com/r/PESU/comments/wv1zr5/should_i_take_drop_instead_of_taking_mechanical/",
    "permalink": "/r/PESU/comments/wv1zr5/should_i_take_drop_instead_of_taking_mechanical/",
    "score": 7,
    "created_utc": 1661194702,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ilczehv",
      "body": "Take drop"
    },
    {
      "id": "ilerxsb",
      "body": "Take drop or join cs in a not so popular institute but work hard in developing skills( i prefer option2)"
    },
    {
      "id": "ilftjht",
      "body": "Idk man but won’t it be worth it if I get into bits next year?"
    },
    {
      "id": "ilganpj",
      "body": "Hey, just wondering, can you shift branches after 1st year?"
    },
    {
      "id": "ilguqfr",
      "body": "Yes you can but from what I’ve heard it’s really hard, you can only change if vacancies are available in the 2nd year that itself is a big if and even if there are vacancies you need at least 9.5+ cgpa basically in the top of your branch across both campuses to be eligible to change to a better branch"
    },
    {
      "id": "ilgwdie",
      "body": "Hii there.\n\nMechanical engineer from PES here.\n\nPlease take mechanical only if you're really really interested in it. Especially so if yours is a PESSAT seat.\n\nMechanical subjects from 4th semester onwards are really hard and require a lot of effort to clear in the first go.\n\nAnd even if you do well, there's no guarantee you'll get a job with a decent salary.\n\nIf you are really interested in Mechanical, then I'd suggest you go to a different college (RV BMS Dayanand Sagar etc ) then do a master's course abroad (Germany Netherlands etc). You'll have a much better career then. \n\nAnd do not take mechanical expecting that you can change branches in the second year. The competation is really high."
    },
    {
      "id": "ilgzzlp",
      "body": "Yes, you can, but it requires gaining a very high CGPA almost 9+. It also depends on the branch you are in, and changing to"
    },
    {
      "id": "ilkkjbh",
      "body": "Yes it will be worth it. If you believe in yourself take a drop."
    },
    {
      "id": "inox15l",
      "body": "Only one person shifted to RR CS from RR ECE in batch 25. Don't count on mech to cs"
    }
  ]
}