{
  "id": "wvqf9g",
  "title": "5th and 7th semester students, how many hours of classes a week do you guys have?",
  "content": "3rd semester student here. We are doing 22 credits but we have 29 hours of classes. We started early this year, had like 10 days of holidays but we still have 29 hours of classes. How many hours of classes do you all currently have? Also, when they started the 5 ISA system, did the number of classes increase for you all? Zero free time seems a bit unfair.",
  "metadata": {
    "author": "esinpe",
    "url": "https://www.reddit.com/r/PESU/comments/wvqf9g/5th_and_7th_semester_students_how_many_hours_of/",
    "permalink": "/r/PESU/comments/wvqf9g/5th_and_7th_semester_students_how_many_hours_of/",
    "score": 11,
    "created_utc": 1661265261,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ilgn0m8",
      "body": "7th sem here, I have 2 hours of classes a week. They started 5 isa last year I think, ptsd stops me from recalling exactly when they started it. Yes, we had more classes and zero free time. I'm honestly glad I'm done with it."
    },
    {
      "id": "ilgo1dw",
      "body": "Just 2 hours? I’m guessing the rest is for internships and stuff like that. Can you elaborate  a bit more on it as I am not getting a clear picture on what is going to happen in 7th and 8th semester? \n\nThis 5 ISA system robbed us of the thing that made college a ‘college’. It feels like school now, 8:15 to 3:30. We had speedrun semesters in the first year. This was our time to have regular college. During orientation, we were told that we would be able to finish off all the assignments in college. Pretty sure nothing can be accomplished in that one hour we are spared in a week. Even that is occupied sometimes."
    },
    {
      "id": "ilgvfi6",
      "body": "Can't we do something about it (like not protest but request them for amelioration) since we need to do other stuff too.\nMaybe revert back to the old ISA system."
    },
    {
      "id": "ilh8c56",
      "body": "We could, but not many people will come forward."
    },
    {
      "id": "ilhdqqg",
      "body": "In the 7th semester, we have a total of 12 credits. 6 for capstone project phase 2 and 6 for 3 special topics, 2 credits each. In the 8th semester, we'll have 8 credits. 2 for capstone project phase 3 and 6 for internship. \n\nThe special topics offered in the 7th semester are a mix of courses offered by the university and self study courses. You will only have classes for the courses offered by the university. The self study courses are, well, self study. Each special topic has 2 hours of classes per week. So how many hours of classes per week depends on how many courses offered by the university you chose. \n\nAs for the 5 ISAs, unfortunately, there's nothing you can do about it. Disregarding complainants from the students, the management will keep justifying why the system is needed. My batch is lucky as we got away with only one semester under that system. You can only hope that they get their heads out of their asses and think straight.\n\nP.S. The credit structure I mentioned is for my batch. It could change for yours. Nevertheless, you have to do project work and internship in your 4th year."
    },
    {
      "id": "ilhf29k",
      "body": "7th sem student here  Some questions have already been answered so I'll answer the remaining. \n\nFirst of all, not all classes are equal. 1 hour of theory classes per week = 1 credit. 2 hours of lab classes per week = 1 credit. Hence, the extra hours. Even then, you have more hours.\n\nWhen the 5 ISAs system started, the number of classes for us (CSE branch) did increase. It is because until then, we did not have classes specifically for lab. We were only given the tasks and deadlines. But with the new system, we had to complete all the labs in class. Moreover, now apart from the subjects that have a lab component, each subject had experiential learning, which was an additional hour per week per subject. So yeah, the number of hours per week shot up all of a sudden."
    },
    {
      "id": "ilhobzv",
      "body": "There'll be negligible time left to do other stuff if these many ISAs take place. I'll discuss about this with my batchmates fosho"
    },
    {
      "id": "ilibjar",
      "body": "7th sem is 6 hrs a week for ece"
    },
    {
      "id": "iljmjeu",
      "body": "Thanks a lot for your time and energy in giving such a detailed answer. This really gives me an idea on what is going to happen to us next."
    },
    {
      "id": "iljmryw",
      "body": "Thanks, I’m trying to do the same with my friends, but I get seenzoned every time I try something like that."
    },
    {
      "id": "ilk39jw",
      "body": "Seenzoned lmao"
    },
    {
      "id": "ilmaef1",
      "body": "The 5 isa system gave me depression  for sure but it yielded better results than 2 isa which is why they're sticking to the system"
    },
    {
      "id": "ilmbacd",
      "body": "Maybe make it 4 atleast😭 and take best 3"
    },
    {
      "id": "ilouszh",
      "body": "Yeah, well. Nobody wants to do things like this. “What if this affects my future job or higher education prospects? Let the others do it and I’ll just reap the benefits, if they’re successful.”"
    },
    {
      "id": "ilovvn6",
      "body": "Bruh-"
    }
  ]
}