{
  "id": "wyjtuc",
  "title": "PES CS IN EC CAMPUS OR MSRIT AI ML OR BMS AI ML",
  "content": "what would be the best option among these 3 ?",
  "metadata": {
    "author": "purple_cheese09",
    "url": "https://www.reddit.com/r/PESU/comments/wyjtuc/pes_cs_in_ec_campus_or_msrit_ai_ml_or_bms_ai_ml/",
    "permalink": "/r/PESU/comments/wyjtuc/pes_cs_in_ec_campus_or_msrit_ai_ml_or_bms_ai_ml/",
    "score": 7,
    "created_utc": 1661546859,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ilx5xud",
      "body": "PESU CSE in any of the two campuses is worth it.\n\nI would say do check out the curriculum differences and academic scheduling. PESU's is more industrially oriented and updated but the other two(MSRIT & BMS) are affiliated with VTU(not that updated). Scheduling wise PESU needs to improve cuz the ISA system here is fu*ked up. It might yield better results but you'll feel like you're still in school lmao doing homeworks, assignments everyday and preparing for class tests.\n\nNon academic life will be better at BMS and MSRIT."
    },
    {
      "id": "ilyx6lf",
      "body": "Don't take AI ML if you have the option of CSE in a similar level college. MSRIT and BMS are better in most aspects when compared to PES EC campus but in the long run it's better to just have a btech cse degree than AI ML. With AI ML you'll just have some compulsory subjects which will be optional for cse students. Basically cse is broader, and now that both pes campuses are under the same umbrella with the exact same curriculum (which is quite good according to many) it won't matter as much as it used to before."
    },
    {
      "id": "ilzcham",
      "body": "My main priority is getting a good placement, so I'll have to cope with rigours curriculum. I couldn't get the placement data for bms and msrit. Is it on par with pes?"
    },
    {
      "id": "ilzcl4y",
      "body": "what's ur opinion on CSE with cyber security in MSRIT ?"
    },
    {
      "id": "ilzctxf",
      "body": "I don't really know about their AIML placements. But I do know about PESU's CSE placements. You can check the pinned post on this sub reddit to see the placement stats(22' graduated batch). Average must be around 11-12LPA for cse. It is really good considering the number of CSE students sitting in placements."
    },
    {
      "id": "ilzd3ml",
      "body": "Yeah I did check that out! I found it quite impressive. I couldn't find similar type of data from bms and msrit."
    },
    {
      "id": "ilze1vp",
      "body": "I think regular CSE would still be better. Try and ask seniors about the course details."
    },
    {
      "id": "ilzeljl",
      "body": "Will check thank you"
    },
    {
      "id": "im37g6l",
      "body": "Removing campus out of the picture\n\nA BTech degree should be a broad degree so that you can know everything about the stream and probably then do a master's in a specific field\nHence CS > AI/ML\n\nPutting Colleges into the picture\nCSE placements would be better than AI/ML placement and PES CSE placements is really good"
    },
    {
      "id": "im8phry",
      "body": "Got it thank you"
    }
  ]
}