{
  "id": "x4wmgm",
  "title": "Possible second round cut off for PES EC campus CSE",
  "content": "So the first round PESSAT councelling took place and the cut off for EC campus CSE stopped at 2432 ( 0 seats left )   \nThe second round will be after KCET round 1, and there's no known date regarding when this would be happening. However, my doubt was, to what possible PESSAT rank would PES EC CSE go upto in the second round? Last year it was about 1500 and 2100 in the first and second round respectively. Any guesses would be appreciated.   \nThanks",
  "metadata": {
    "author": "Medium-Ad1870",
    "url": "https://www.reddit.com/r/PESU/comments/x4wmgm/possible_second_round_cut_off_for_pes_ec_campus/",
    "permalink": "/r/PESU/comments/x4wmgm/possible_second_round_cut_off_for_pes_ec_campus/",
    "score": 5,
    "created_utc": 1662217680,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "imxutzz",
      "body": "Don’t have any expectations on second round apparently they’ve enrolled 10% more students in round 1 itself so round 2 is uncertain"
    },
    {
      "id": "imxwgwq",
      "body": "I get you, but there has been a second round every year though right?"
    },
    {
      "id": "imxy0pj",
      "body": "There is one this year too after kcet 1st round but the no of seats that free up then is unpredictable because of the extra enrolments"
    },
    {
      "id": "imxy8df",
      "body": "Here's a analysis 👍\n\nAt this point the cutoff doesn't matter much because 1200-2400 rank batch had only 472/1200 people iirc(I was there). In that too after 1700 rank only ~120 people were remaining. This means that 1700-2400 rank range had very less people attending the counselling and consequently the high cutoff. My intuition says if more people show up in the second round counselling who didn't come in the first round thinking that they won't get CSE with the ranks above 1.7-1.8k(seeing last year's cutoffs) , the cutoffs might remain pretty much the same or even decrease (10% chance)."
    },
    {
      "id": "imxydnw",
      "body": "Do you mean PESSAT+MANAGEMENT Quota enrolled students?"
    },
    {
      "id": "imxyirf",
      "body": "Mgmt they take extra every year but this year Pessat also is what I’ve heard not quite sure"
    },
    {
      "id": "imxz1p0",
      "body": "360 seats last year also in PESSAT for CSE. Not increased there. Also I got to know that more than 150 people are in queue for management quota(CSE)."
    },
    {
      "id": "imy4e9c",
      "body": "That was like my actual question, for a guesstimate regarding the possible rank upto which second round at PES EC campus would go for CSE."
    },
    {
      "id": "imy4mfp",
      "body": "From where did you gather this intel?"
    },
    {
      "id": "imyc2lm",
      "body": "I'm confused with certain aspects of your analysis. Would you mind if I DM you?"
    },
    {
      "id": "imygxoj",
      "body": "You can DM me👍"
    },
    {
      "id": "in02xjj",
      "body": "I think it's because they introduced ai ml, many of the \"extra students\" must be the people in this branch which is completely new(120 aiml seats are there iirc)"
    },
    {
      "id": "in0wpao",
      "body": "oo yeah  \nUpto what rank do you think CSE at PES EC campus would go till? ( PESSAT rank i mean)"
    },
    {
      "id": "in0wted",
      "body": "imo 2.5 - 2.6k definitely."
    },
    {
      "id": "in0xcxl",
      "body": "Ah alright :/I've gotten a rank of 2714, so I got no shot right?"
    },
    {
      "id": "in0xjtc",
      "body": "Can't say. Till what rank did it go last year?"
    },
    {
      "id": "in17wqd",
      "body": "last year it was around 1500 and 2100 in the first and second round respectively for CSE in PES EC campus. this year, the first round itself ended at like 2432"
    },
    {
      "id": "l4ggsf7",
      "body": "Is it possible to get cs(ai ml) at 240X rank in the first round as the counselling date clashes with advanced date?"
    },
    {
      "id": "l4h3idt",
      "body": "I don't really know the situation now dude. The dynamics of number of seats and fees has changed so it'll affect the cutoffs definitely."
    },
    {
      "id": "l4h94oh",
      "body": "Alright thanks!\nEitherway, gonna meet you soon🫡"
    }
  ]
}