{
  "id": "x6iu6k",
  "title": "Travel Time to PESU",
  "content": "This question is open to both freshers and seniors.\nAre any of u spending 2-3 or more hours traveling  to PESU( either RR or EC Campus)? \nIf yes can u please tell the exact total time(up and down) that u will spend in travel?\nWhich mode of transport will u use(bus or car or auto)?\nI am asking this to know whether I am not the only one who is going to spend a lot of time in travel to college. Also knowing your mode of transport will help me in making a choice.",
  "metadata": {
    "author": "ATthebeast04",
    "url": "https://www.reddit.com/r/PESU/comments/x6iu6k/travel_time_to_pesu/",
    "permalink": "/r/PESU/comments/x6iu6k/travel_time_to_pesu/",
    "score": 11,
    "created_utc": 1662391445,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "in73ev2",
      "body": "Used to spend close to ~1h 15min each way travelling to PESU RR campus. Route consisted of auto, bus and metro. I live close to 20 km away but luckily had metro connectivity for most of it.\n\nEdit: A lot of people spend significant amount of time travelling to campus. Especially if you're in RR, you'll will see majority of the metro crowd travelling towards Mysore Road to be PES kids. Pretty sure a good portion of the crowd here that travels via metro spends atleast 45mins travelling to college."
    },
    {
      "id": "in76d8m",
      "body": "Thx"
    },
    {
      "id": "in77ar2",
      "body": "Thx"
    },
    {
      "id": "inaqgod",
      "body": "Can any more seniors or freshers reply to my query?"
    },
    {
      "id": "inhmfi8",
      "body": "Used to travel from hebbal two ways, morning reached in about 40 mins (college bus).   \nevening it took anywhere between 50 mins - 1hr 45 mins (missed college bus a lot of days as i used to stay back for a lot of things- metro + bmtc)  \n\n\nif it dosnt burn you out to travel two ways everyday no worries, somedays will be halfday etc etc so you can manage. \n\nIf you cant do it after your first year, opt for the hostel. many people did this"
    },
    {
      "id": "inw1mc2",
      "body": "Thx"
    }
  ]
}