{
  "id": "x9teeo",
  "title": "My KCET rank is 2.7k, will I get CSE in PES EC?",
  "content": "My rank is currently 2.1k, but due to the ongoing HC drama, the decision might be to change ranks to accommodate repeaters. So, as a worst case scenario, my rank might become 2.5-2.6k, will I still be able to get CSE in PES South Campus? \n\n(2021 PES EC CSE Second Extended Round Cutoff - 3055, 2020 PES EC CSE Second Extended Round Cutoff - 3735)",
  "metadata": {
    "author": "SkywalkerPadawan512",
    "url": "https://www.reddit.com/r/PESU/comments/x9teeo/my_kcet_rank_is_27k_will_i_get_cse_in_pes_ec/",
    "permalink": "/r/PESU/comments/x9teeo/my_kcet_rank_is_27k_will_i_get_cse_in_pes_ec/",
    "score": 4,
    "created_utc": 1662724172,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "inpymx5",
      "body": "It is possible. But u may need to wait till 2nd round od counselling"
    },
    {
      "id": "inqa7fu",
      "body": "You mean KCET 2nd round?"
    },
    {
      "id": "inqa95w",
      "body": "Hopefully you will, but only time will tell🤞\n\nOne thing I will tell you is that the pessat cutoff rose a lot this year.\n\nIt was ~1400 in the first round and ~2200 in the second round in 2021.\n\nIn 2022 the first round itself went up to ~2400 for cse.\n\nMight see something like that for cet people as well"
    },
    {
      "id": "inqago4",
      "body": "Might also become less right? Coz they have limited seats, and they already took many in from PESSAT."
    },
    {
      "id": "inqbtot",
      "body": "They always had limited seats lol. Even the pessat seats are limited. \n\n yeah, the cutoff could drop but I personally think you’ll make it. Either way don’t think too much about it, there’s nothing you can do about it anyways \n\nUnrelated, but do you have the option to join another college through something other than kcet or is it your best option"
    },
    {
      "id": "inqdr7p",
      "body": "KCET is my best option."
    },
    {
      "id": "inrfsov",
      "body": "Yaa"
    },
    {
      "id": "io8sgfy",
      "body": "My PESSAT rank is 2504 ,is there a chance to get CSE in EC campus in 2nd round or counselling?"
    },
    {
      "id": "ip2yrfz",
      "body": "What will be the fees for cse if we join pes through pessat &hostel fees in EC campus?"
    },
    {
      "id": "irk4ptl",
      "body": "I am a student from banglore , karntaka ,I have always been an average student & i aspire to become an engineer , I have come to know about the exam called KCET , Can anyone help me regarding this how can we crack this exam & do its coaching free of cost through yt or anyother platform . Please guide me i come from a real middle class background I don’t think my famil can really afford the coaching fees so , all the channels in yt regarding kcet speak in kannada , i don’t speak that language I’m so confused ."
    },
    {
      "id": "itbbgv9",
      "body": "You might have got it..."
    },
    {
      "id": "itcba74",
      "body": "Yes I did. 2.2k is my rank."
    }
  ]
}