{
  "id": "xak81c",
  "title": "What's with PES and them asking us to publish a paper for every goddamn project?",
  "content": "Like seriously, we have a special topic which has a project component. \n\nAnd this is what our teacher sent:\n\nFor project which carries 10 marks\nYou can submit a paper to conference or journal including the faculty names of both campuses who are in charge for this course \nOr\nYou can implement a research paper\n\nFor context, I'm in my 7th semester. I have placements and capstone going on. The capstone paper itself is too much to handle and then they dump this on us. It's just too much man. Obviously, we could just implement a project from a research paper, but it still takes so much time. These interviews take whole days, capstone takes so much time, placement tests every day and we barely have time to watch the lectures itself. \n\nWhat even, I'm so done with this :')",
  "metadata": {
    "author": "im_not_short_",
    "url": "https://www.reddit.com/r/PESU/comments/xak81c/whats_with_pes_and_them_asking_us_to_publish_a/",
    "permalink": "/r/PESU/comments/xak81c/whats_with_pes_and_them_asking_us_to_publish_a/",
    "score": 32,
    "created_utc": 1662799334,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "inu3r9c",
      "body": "I'll find myself in the same position 4 years from now💀💀"
    },
    {
      "id": "inu79qb",
      "body": "Bro their nirf rank is falling... Research papers carry weightage in the rank... That's the only plausible reason why they want papers."
    },
    {
      "id": "inu86va",
      "body": "PES wants to churn out more papers for better ranking. Issue is they don't see that their demand for quantity is causing a huge decrease in each paper's quality. \n\nNot going to call out anyone or any project but a lot of capstone projects that were turned into papers and published at low level conferences from my batch are really basic projects, followed/implemented from guides/YouTube videos/existing repos with almost 0 novelty. Some of them are implementations of the same existing papers but evaluated on different metrics. \n\nIt's a huge shame because genuine novelty work here gets put under the same umbrella as these projects."
    },
    {
      "id": "inudibr",
      "body": "Until they realise Quality>Quantity"
    },
    {
      "id": "inuougq",
      "body": "Citing someone who hasn't worked on your project is academic dishonesty. Plus if you're not actually doing research the only place that's going to take these \"papers\" are predatory journals like the garbage in IJRACET, IJSER and all those similar ones. \n\nThis is an awful idea. All it's doing is artificially inflating the number of papers faculty have. If you're actually interested in research this is terrible."
    },
    {
      "id": "inxjgug",
      "body": "Exactly."
    }
  ]
}