{
  "id": "xaqld5",
  "title": "How does the credit system work?",
  "content": "Hello, I am a first year student at PES university (RR campus) and I was curious about how the credit system works.\n\nDo you get the allotted credits for each course if you get 85% attendance overall or do you get credits every time you  attend the course?\n\nAlso do credits affect my CGPA? For example if I was to miss 2 days of classes would my CGPA and grade fall?\n\nAny help would be much appreciated.",
  "metadata": {
    "author": "Miserable_Goat_6698",
    "url": "https://www.reddit.com/r/PESU/comments/xaqld5/how_does_the_credit_system_work/",
    "permalink": "/r/PESU/comments/xaqld5/how_does_the_credit_system_work/",
    "score": 20,
    "created_utc": 1662819701,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "inuxob5",
      "body": "reach"
    },
    {
      "id": "inv0bmu",
      "body": "cfbr"
    },
    {
      "id": "inv26za",
      "body": "Cfbr"
    },
    {
      "id": "inv2urb",
      "body": "By credits you mean the 4 credit course and stuff na?"
    },
    {
      "id": "inv5f3x",
      "body": "Yes. For example engineering mathematics has 4 credits, engineering physics has 5 credits and so on"
    },
    {
      "id": "inv5h03",
      "body": "Got it"
    },
    {
      "id": "inv67ri",
      "body": "So i don't know how the entire relation between attendance and credits but attendance and credits aren't related directly..\n\nSo credit is basically equal to the number of hours of that subject you'll have in a week, 4 credits means 4 hours (except maths, it will always have 5 hours a week)\n\nFor graduation, you need a certain amount of credits, if you pass all the semester exams as conducted by PES, you'll be the required credits\n\nYou'll always get all the credits or 0 credits, there's no partial system and credits are given after you \"Pass\" that subject in the semester\n\nNow in PES, you need a certain amount of attendance to write the exams, hence you loosely say no attendance so no exam no credits but it doesn't makes sense...\n\nSo summary, credits = number of hours of that subject in a week; 0 credits if you fail and full credits if you pass that subject"
    },
    {
      "id": "invama5",
      "body": "It's based on the hours per week for the subject. 5 credits consists of 4 for theory and 1 for lab."
    },
    {
      "id": "invatu9",
      "body": "Adding to this, the number of credits = number of hours per week isn't always true. Its been changed quite a bit from the 2023/2024 batch where almost every subject has more hours than the number of credits it is assigned.\n\nCredits will also tell you how important or how much weightage a course has for your degree. More credits = greater weightage and hence will affect your GPA more as can be seen below. Try to do well in the courses with higher credits since these can easily boost (or lower) your GPA.\n\nSGPA = SUM (credits for course \\* grade obtained for that course) / total credits that semester\n\nCGPA = SUM (credits in that semester \\* SGPA obtained that semester) / total credits till current semester"
    },
    {
      "id": "invcb7o",
      "body": "Reddit works on the upvote system. The more you upvote, the higher ranked it will be. Commenting \"reach\" or \"CFBR\" does not really help it apart from adding irrelevant comments. Maybe next time upvote it instead :)"
    },
    {
      "id": "invclcw",
      "body": "oh oke :)"
    },
    {
      "id": "invljv1",
      "body": "Thank you for this answer.\n\nSo you claim full credits once you pass the course and it has no correlation with attendance (other than the required 85% to write the exam)?"
    },
    {
      "id": "invm94p",
      "body": "Yes. As long as you pass the course you will get all credits. Your performance and attendance in that course are irrelevant"
    },
    {
      "id": "inycxei",
      "body": "Hey, welcome to PESU. Ppl have already given info on how each courses is valued for credits so, your attendance doesn’t affect the credits you can earn or taking offs isn’t gonna affect your gpa or credits. If you pass a course, you get the credits the course was valued for. Eg: Engineering Maths-1 is for 5 credits so if you pass in this course you will earn 5 credits. Generally per sem you can earn 22 credits by clearing all the courses.\n \nYou will need a minimum of 160 credits to earn your degree.\n\nHope this helps you, good luck!"
    }
  ]
}