{
  "id": "xbhrm9",
  "title": "PESU Choice Urgent and Imp",
  "content": "Hi Guys, I am planning to join PESU. My Parents and Teachers are telling that it will be the perfect environment for me as I will always be engaged with one work or the other. They say so bcoz I am a very big Procrastinator and leave things for the end which builds up pressure and stress, so they feel that I will go berserk in a very free environment as I will waste all my time and get in trouble in the end. So they feel PESU will be an Antidote to that as it has regular tests and work. \nAlso PES is just 10 min (20 min total) walk away from my house whereas other good colleges are 1 hr 30 min away by bus( 3 hrs total). So I will get a lot of time to manage the work here and waste a lot of time in travel to other colleges.\nMany people in this subreddit are saying that PESU is a very Stressful Place and there is a lot of Pressure and Workload. But I assume they may also be complaining about that bcoz they are not able to cope up bcoz they are not very academically strong. But I am still concerned about this. All the real people I know say that I can easily manage the Workload if I Study Regularly Every Day and Manage my Time Well. \nMy KCET Rank is 617. My CBSE Board Marks are 98.2%. I can get Civil/Chemical or Dual Degree in BITS Hyderabad But I left that bcoz I am interested only in CSE. I managed to achieve all this in spite of getting very less time to study due to some medical issues.\nSo considering Everything will I be able to Handle PESU if I study Regularly and Manage my Time Well?",
  "metadata": {
    "author": "ATthebeast04",
    "url": "https://www.reddit.com/r/PESU/comments/xbhrm9/pesu_choice_urgent_and_imp/",
    "permalink": "/r/PESU/comments/xbhrm9/pesu_choice_urgent_and_imp/",
    "score": 9,
    "created_utc": 1662900693,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "inzdg3u",
      "body": "Join us :)"
    },
    {
      "id": "inzfkor",
      "body": "Abe sir ji aap tho topper he itna bi tension nahi lo lmao"
    },
    {
      "id": "inznf4o",
      "body": "PES is a perfect fit for you\n\nTake a CSE PESU course, score well like you did\n\nEverything will work out"
    },
    {
      "id": "inzpckh",
      "body": "Take PES. \nI too was a procrastinator, but the way stuff is spaced, leaves you no choice but to complete stuff as and when they come.\n\nIt helped me, but you'll need to accept the fact that you'll need to do stuff on time as well."
    },
    {
      "id": "inzqhtn",
      "body": ">But I assume they may also be complaining about that bcoz they are not able to cope up bcoz they are not very academically strong\n\nA misconception, since a **lot** of the people you will meet here **will be academically strong, just like you.** If people who score a 9+ CGPA consider this place stressful then trust me it indeed is. PES is tough and stressful on its own, and a lot of people undermine it from the beginning.\n\nBut leaving that aside, you seem to have great scores in KCET and also have convenience on your side when it comes to travel. PES requires a lot of consistency to do well in its academic system because it is very rigorous and tedious as well. There are a lot of components to score well in when it comes to every course. It also requires a lot of effort and time. Time management is key here, knowing how much effort to put into each component as well. As long as you plan things wisely, you should be able to do so.\n\nMost freshers undermine how tough PES can be and realise it only after the first round of ISAs. Manage your time well and remain consistent and you should be able to sail through. As for how easy things will be for you, it depends on your ability to cope with constant stress."
    },
    {
      "id": "inzs1eu",
      "body": "Thx"
    },
    {
      "id": "inzs4ap",
      "body": "Thx"
    },
    {
      "id": "inzs59r",
      "body": "Thanks"
    },
    {
      "id": "inztbxz",
      "body": "Thanks for the detailed reply"
    },
    {
      "id": "inzteol",
      "body": "Thanks"
    },
    {
      "id": "io06f60",
      "body": "I procrastinated so much that even the night before the pessat ( and basically all other exams) I spent watching YouTube videos. \n\nI got EC campus cse, and 236 in bitsat which gives me a decent chance to get eie in bits goa or hyd. \n\nI’m confused on weather or not to leave pes in case I get it"
    },
    {
      "id": "io18tj1",
      "body": "Rv nhi milegi kya vro??? Mein to RVCE mein eie lene ki soch rha"
    },
    {
      "id": "io2w82h",
      "body": "Go for , RV or BMS . They are more balanced with academics and extracurricular and not less than Pes in placements. For me ,a college is for all-round development,not just academics!"
    },
    {
      "id": "io59a4w",
      "body": "Leave pes and go for bits circuit branch. It is much better anyday. But remember that the pes refund policy is unfair. U can't surrender seat after 1 month. U have to pay 2k for each day that u attend in case u leave pes for a private college like bits. Take ur decision asap and surrender ur seat if u get circuit branch in any bits."
    },
    {
      "id": "io59fn1",
      "body": "Noted"
    },
    {
      "id": "io59hph",
      "body": "Want only cse"
    },
    {
      "id": "io59p38",
      "body": "Heard that RV is worse than PES in terms of Academic Pressure and Workload."
    },
    {
      "id": "io93abh",
      "body": "Consider bms also then, you'll definitely get bms if you're getting pes. Pes cse is tougher to get than bms."
    },
    {
      "id": "io9mjtg",
      "body": "Noted"
    },
    {
      "id": "ip2ypuy",
      "body": "What will be the fees for cse if we join pes through pessat &hostel fees in EC campus?"
    }
  ]
}