{
  "id": "xhb1yb",
  "title": "ISA will it be easy or tough? paper pattern? pyqs?",
  "content": "",
  "metadata": {
    "author": "Sea_Mail_2026",
    "url": "https://www.reddit.com/r/PESU/comments/xhb1yb/isa_will_it_be_easy_or_tough_paper_pattern_pyqs/",
    "permalink": "/r/PESU/comments/xhb1yb/isa_will_it_be_easy_or_tough_paper_pattern_pyqs/",
    "score": 9,
    "created_utc": 1663489333,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "iowp57c",
      "body": "ISAs are usually fine (atleast for most people). Most of the stuff is from slides/notes so doing them thoroughly is often enough. A few questions tend to be harder than the remaining questions. \n\nISA is computer based, you'll have to either choose the right option or type out the answer (even for math). PES does not release ISA question papers so you won't find anything online, but you can find previous ESA papers at library.pes.edu"
    },
    {
      "id": "iows2n9",
      "body": "Are they similar to the MCQs that are there on pesuacademy? (Difficulty wise)"
    },
    {
      "id": "iowt383",
      "body": "How many days before the exam will they send the time table???"
    },
    {
      "id": "iox60vq",
      "body": "I asked my teacher and he told me we'll have a week at minimum, which is pretty good for 3 weeks of classes imo"
    },
    {
      "id": "iox7113",
      "body": "See, the order of courses remains the same for each ISA. They should tell you about when you have the ISA weeks in a week or two max. Usually the ISAs are held right after you finish each unit"
    },
    {
      "id": "iox766i",
      "body": "Not sure what MCQs you are referring to, my batch didn't have anything like what you're describing on the portal"
    },
    {
      "id": "ioy8yrl",
      "body": "Math is only MCQs, all other subjects have a little bit of typing. Reading slides and notes for first year is enough, and solving the assignment questions will surely be helpful. \n\nQuestions are not difficult. Results of intermediate steps can be asked"
    }
  ]
}