{
  "id": "xhhiwr",
  "title": "How to study for isas in order to get 9+ gpa? Also, what are the kind of questions to expect ?",
  "content": "",
  "metadata": {
    "author": "Youcrap-andsmile",
    "url": "https://www.reddit.com/r/PESU/comments/xhhiwr/how_to_study_for_isas_in_order_to_get_9_gpa_also/",
    "permalink": "/r/PESU/comments/xhhiwr/how_to_study_for_isas_in_order_to_get_9_gpa_also/",
    "score": 8,
    "created_utc": 1663509852,
    "flair": "Study Help :table:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ioxgbyz",
      "body": ">what are the kind of questions to expect\n\nThe unexpected kind"
    },
    {
      "id": "ioxv4cs",
      "body": "I'm still asking this question"
    },
    {
      "id": "ioy68hv",
      "body": "Please help saar"
    },
    {
      "id": "ioy6f2y",
      "body": "Any tips on what to focus on just for ISAs? Esa can be dealt later"
    },
    {
      "id": "ip0zrhh",
      "body": "Usually notes and slides are enough. Questions are *mostly* from these sources, with a few tougher ones requiring you to pick at your brain a little. Overall, they are mostly fine. Questions depend on the course. Some courses are really direct (like mechanical in physics cycle) and some involve mostly numericals (electrical, civil etc) and ofc the Python/C courses will require you to type out code/predict the outputs. Essentially, questions depend on the course, but since it's an ISA they're very short, usually an MCQ type. \n\nAs for *how* to study, this isn't a straightforward question to answer but generally, focus on understanding the fundamentals well. You won't have too much time in between each ISA - make notes in class, keep yourself updated with the courses and at the same time keep track of your mental health. Don't leave assignment/lab/project work for the ISA week and prepare wisely - ISA does not contain detailed theoretical questions, only very short MCQs or short answers - know which topics to read through and which topics to learn in detail based on the type of questions that can be asked."
    },
    {
      "id": "ip1087q",
      "body": "+1 bro"
    },
    {
      "id": "ip10qp0",
      "body": "They ask from each and every corners. You cannot neglect anything. It mostly will have a lotttta unexpected questions."
    },
    {
      "id": "ip11265",
      "body": "From slides right?? Not from book"
    },
    {
      "id": "ip120pi",
      "body": "Yes from slides"
    }
  ]
}