{
  "id": "xwvgpw",
  "title": "PES main campus and electronic city campus",
  "content": "i may get  cse in PES electronic city campus thorugh cet  . is it similar to the main campus . i have some queries and wld appriciate if seniors cld answer them\n\n1. is the placement truly centralised as they say ? is there some catch ? i have heard some software  companies do not allow non main campus cse students for their placements (srry if this sounds stupid)\n2. i have heard u can shift to main campus cse if u have a really good cgpa . is this true and if so what is the cutoff\n3. the total number of students in cs realted branches  in both campuses combined {is competition very high during placements\n4. wld u reccomend AI/ml in MSRIT or PES ec campus cse",
  "metadata": {
    "author": "Large-Yoghurt6105",
    "url": "https://www.reddit.com/r/PESU/comments/xwvgpw/pes_main_campus_and_electronic_city_campus/",
    "permalink": "/r/PESU/comments/xwvgpw/pes_main_campus_and_electronic_city_campus/",
    "score": 5,
    "created_utc": 1665028582,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ir8qj59",
      "body": "1. For the most part it is all the same, I have not heard of any \"catch\". I've seen folks from EC campus getting placed before many people in main campus (doesn't say much but gives you an idea that it is a fair game)\n2. Idk never heard of that\n3. Oh yeah it is competitive. You fighting with 1000+ students.\n4. Imo PES EC CSE"
    },
    {
      "id": "ir8r8dl",
      "body": "thank you for your input"
    },
    {
      "id": "ir8sqcb",
      "body": "2. Yes you can. We're talking about very high cgpa like 9.5+. Otherwise it's hard. That also depends on availability of seats in RR. \n\nOn the same note, you can change branches as well. But to do so, you not only need high cgpa but that also depends on if seats are available in the branch."
    },
    {
      "id": "ir8tre4",
      "body": "oh thank you for replying\n\nalso after cse in top 4 cllgs in bangalore PES EC is the best choice right ?"
    },
    {
      "id": "ir8tusd",
      "body": "There isn't any catch. EC campus kids sometimes complain that more RR kids get selected compared to EC and hence \"companies show bias\", but this is not the case because (1) companies do not know which campus you are from and placements occur in the same place and (2) the sheer number of kids in RR is way more than EC (almost double), hence more kids tend to get placed from RR than EC, thus causing this so called \"bias\".\n\n3. The number is close to 2000, since most companies which come recruiting for mainly CS kids also allow ECE and sometimes EEE to sit for tests. Some even allow Mech. The competition is at least 1500-2000 generally for any of these companies."
    },
    {
      "id": "ir8umgd",
      "body": "EC Campus student here, youre missing out on nothing from PES RR other than clubs, activities, opportunities to work with people, good infrastructure (although crowded the buildings are hella sick, EC is getting there with the new building but still). \n\nrest are the same, the faculty used to be better in RR, but now both are shit lol.\n\nIf you can get 9.5+ in the first year AND hopefully there are some seats left in RR, then sure go for it. \n\nPlacements are absolutely same, no difference as far as I have seen. No catch whatsoever, which means that your competition will definitely increase because youre competing with folks at RR as well. \n\nany AI/ML courses, Im personally against them, and this is coming from a person who is quite into AI/ML. Personally, I would suggest juniors to do a general pure CS degree atleast. This gives you a vantage point of if youre really into ML or not, cuz alot of people just fall into the hype. \n\nTheres many core courses you need in terms of working professionally in the industry so id definitely say PES EC CSE. This not only allows you to enjoy the other core computer science subjects but also choose electives like Deep Learning, Data Science etc, through out."
    },
    {
      "id": "ir8vgzo",
      "body": "thank you for replying"
    },
    {
      "id": "ir8vpwk",
      "body": "oh wow thats reassuring thank you for the reply"
    },
    {
      "id": "ir90l3v",
      "body": "Yes."
    },
    {
      "id": "ir9imy8",
      "body": "If only that many ppl sit for placements.\n\nIn the orientation we saw the bar graph & coo told nearly 700 ppl this year didn't sit for placements (those ~700 include dropouts+higher studies ppl+(<6.75cgpa ppl)+students who didn't qualify in any of the placement tests.)\n\nIn CSE also there were 150ish students who didnt sit/go for placements due to above mentioned reasons.\n\n>the sheer number of kids in RR is way more than EC (almost double),\n\n720-720 CSE seats are there in both campuses. Intake is the same since last 2 years."
    },
    {
      "id": "l3b1cbu",
      "body": "I know this is a goofy question but are there fine girls in the ec campus 💀"
    },
    {
      "id": "liekxvi",
      "body": "Hey I am attending counseling this year , i have some doubts on pes ec campus ,can I DM you??"
    },
    {
      "id": "ln1oh63",
      "body": "I was about to write a refund letter to Pes but this made me change my mind. I’ll see you in Electronic City gng🙏"
    },
    {
      "id": "lnyenvr",
      "body": "W gang"
    },
    {
      "id": "lq32jfo",
      "body": "are there volunteering program in pes ec??"
    },
    {
      "id": "lq62e21",
      "body": "How is pes electronic City for cse??"
    }
  ]
}