{
  "id": "xyijge",
  "title": "Is cse in PES rr campus worth the extra 10 lakhs?",
  "content": "I'm getting cse in PES rr through pessat. My cet rank(1.4k, general category) is enough for branches like ai ml, data science and ise in colleges like BMS and MSRIT. I know PES cse would be much better than these but the difference in fees is too much to ignore. Pessat fees is 4.1 lpa and cet/comedk fees would be in the 1-2 lpa range. I'm not bad financially and my parents are willing to pay for PES, they're actually impressed with how strict the college is in terms of conducting tests etc. But it feels wrong to pay so much more for something when I'm getting something else that would be more or less similar in the long run. I don't see much of a difference between these colleges and courses. They're all basically cse with some compulsory specialization when compared to regular cse where there are more options to specialise in, and it's not like I can't learn what I want on my own.\n\nAlso I think I can get cse ec campus through cet, but it's too far away from my house and I'm not willing to stay in a hostel/pg, so it's not one of my options.\n\n[View Poll](https://www.reddit.com/poll/xyijge)",
  "metadata": {
    "author": "MatchDifficult9467",
    "url": "https://www.reddit.com/r/PESU/comments/xyijge/is_cse_in_pes_rr_campus_worth_the_extra_10_lakhs/",
    "permalink": "/r/PESU/comments/xyijge/is_cse_in_pes_rr_campus_worth_the_extra_10_lakhs/",
    "score": 5,
    "created_utc": 1665200732,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "irhgyc4",
      "body": "How will u leave pes? Won't u have to pay like 2k for every day u attended or something?"
    },
    {
      "id": "irhk1qt",
      "body": "Infact BMS has better overall campus vibes and more balanced study curriculum and better placement data(nirf). Pes is more of an extension of your school. Strict. They even have PTMs!!"
    },
    {
      "id": "irhmbmy",
      "body": "It’s upto you really, what are you looking for in the long run? If its to be placed - Pes is the best option imo. CSE especially goes through several reiterations almost every semester to adhere to the present tech trends and criteria that any company looks for in their hires. Otherwise in terms of college life and quality of teaching, Pes is very sub-par, so do keep that in mind. \n\nI would personally recommend you to opt for a general CSE course as opposed to ai/ml, ds and other specialisation courses. You never know when your interests might change, and it’s always better to get a wide exposure in your bachelors itself if you’re still in the process of identifying your strengths."
    },
    {
      "id": "irhmsec",
      "body": "Yes I'll have to pay 2k for every day attended"
    },
    {
      "id": "irhmvab",
      "body": "So see here's the thing, you first gotta decide what's your priority in college, if it's placement or pursuing masters ahead.\n\n If its placement, then I'd say go ahead for PES CSE (RR or EC doesn't matter here)\n\nFrom a master's POV, for someone like me who still is figuring out different fields, I'd pursue a MS in CS, so having done a B Tech in CSE helps a lot. In this case doing a B Tech in AI/ML or ISE might not have strengthened my case so much as much as doing a B Tech in CSE did. So its imp here for you to chose the right branch over college because most of the colleges we're racing about here are close in terms of NIRF ranking.\n\n&#x200B;\n\nIs PES CSE RR worth the PESSAT money?\n\nI myself was in the same dilemma a couple of years ago and had the same options as you have currently. I went ahead with PES RR CSE PESSAT and now in the hindsight I'm glad I made the right choice. From a placement POV, PES CSE blows these other colleges out of the water. From a master's POV too since I've done. B Tech in CSE, I can switch to an MS in AI/ML or go ahead with MS in AI/ML. But if I'd have done my B tech in AI/ML/ISE, I'd mostly have to do my MS in these branches themselves. Again, I'm using the word \"most\" here cuz there are always exceptions. \n\nThis is the placement data for the 2023 batch: [https://docs.google.com/spreadsheets/d/1a-eaEBcTeOJESck3f8W\\_I3uJqRRiEc\\_7d5O1Xc3nIUg/edit?usp=sharing](https://docs.google.com/spreadsheets/d/1a-eaEBcTeOJESck3f8W_I3uJqRRiEc_7d5O1Xc3nIUg/edit?usp=sharing)\n\n&#x200B;\n\nTLDR: I'd go with PES RR CSE PESSAT"
    },
    {
      "id": "irhnff9",
      "body": "Thanks a lot, this was helpful."
    },
    {
      "id": "irhnj7c",
      "body": "From what I've heard, PES is overcrowded af, (nearly a thousand students in cs and cs related courses at rr campus, another 700 at EC campus, placements are centralized).\n\nMost of the experienced and good faculty at PES RR campus have left, (u can find countless posts on this topic on this  subreddit itself if u scroll back a few months )\n\nManagement sucks and forces a lot of pointless stuff on students, makes them follow a lot of BS rules\n\nAnd like u said, through pessat it's a lot more expensive. \n\n\n\nOn the other hand u have BMSCE. One of the oldest colleges in banglore. A lot more \"chill\" than pes, more time for self studies, own projects, etc. Lower student intake, very respectable and comparable placement stats, really nice green beautiful campus, nice location and yeah it costs maybe 2-4 lakhs for ur entire btech degree. U could use the money u saved to fund ur higher education abroad.\n\n\n\n(Just my opinion,  if u feel I've said anything wrong, please feel free to correct me)"
    },
    {
      "id": "l4hjhc2",
      "body": "Remind me in a week"
    }
  ]
}