{
  "id": "xyvvkp",
  "title": "'Commuting' as a factor in terms of choosing a college.",
  "content": "Hi.\n\nThis post might be a bit long but I've been thinking a lot about this in the past few weeks and would appreciate your thoughts. So to keep it in short about my ranks, I have gotten 35XX in KCET and 27XX in PESSAT. I had attended PESSAT first round and missed PES EC campus CSE by 280-290 ranks, as the first round cut off for CSE in EC campus was 2432. I'm aware that my probability of getting CSE in EC campus is pretty low in the second round, until and unless the turn-out is very low and there are good number of vacancies in the second PESSAT round along with some other factors. However, further narrative in this post would include me talking under an assumption that I would be able to get PES EC campus CSE through my PESSAT rank. So let's say I get it in the second round with God's grace: I live near the \"Sarvabhouma Nagar\" region of Bangalore, which is around 25.6 km away from PES EC campus, via NH 48, which I'm assuming is the route that the PES bus would take. || Now, my concern was regarding the distance-factor here. Do you guys think it would be okay for me to spend about 1.5 hours one-side journey (not sure if that's how much 25.6 km would take with hectic Bangalore traffic) just in order to go to PES EC campus? || I know about the saying \"beggars can't be choosers\" but please do answer assuming only the latter part of the narrative and not the fact that I don't have any other choice at the moment.\n\nThanks.",
  "metadata": {
    "author": "Medium-Ad1870",
    "url": "https://www.reddit.com/r/PESU/comments/xyvvkp/commuting_as_a_factor_in_terms_of_choosing_a/",
    "permalink": "/r/PESU/comments/xyvvkp/commuting_as_a_factor_in_terms_of_choosing_a/",
    "score": 7,
    "created_utc": 1665243696,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "iriyzez",
      "body": "So I used to spend close to 1 hour 15 mins travelling everyday to PES. It was a 20 km journey one way. I'll get straight to the facts.\n\nYou lose a lot of time travelling. We're talking about spending close to 3 hours travelling in a day. You lose out on a lot of time to relax, chill, get work done or whatever else you'd like to do. It is also extremely tiring and takes a lot of effort. You need to get up pretty early in the morning to reach on time and when you're travelling back home you're extremely tired and really exhausted. It takes a toll on you both physically as well as mentally because this is something you'll need to do 5 days a week. A lot of people prefer staying near campus or in hostel to cut down this pain of commuting all across the city to reach college. This especially affected me during ISAs, when there was an ISA everyday and you'd go back home at the end of day super tired and exhausted to start immediately and not to mention that most people would have reached home before you, relaxed, and started prep for the next day by the time you stepped into your house.\n\nCommute is definitely an important factor while choosing your college. If hostel/PG is an option, do consider it, it will save you a lot of time and effort. You could also spend the first semester travelling and figure out if you want to continue this for the remainder of college."
    },
    {
      "id": "irj34ep",
      "body": "Why didn't you join hostel or pg near clg?"
    },
    {
      "id": "irj3ndl",
      "body": "I had good metro connectivity (I live within 4 km of a metro station). So although it took time, metro helped quite a bit"
    },
    {
      "id": "irj4uud",
      "body": "Firstly, I would like to thank you for sharing your thoughts and experiences, your answer has an added value considering the fact that you're a victim of it too. I completely agree and have both thought and been told about most of those points that you've mentioned, especially regarding the missed out 'cooldown' time, and so on and a couple of points were new regarding the ISAs and so on. Sadly, I can't go for PGs or the hostel due to personal reasons and have only this option. Do you think it'll like be a problem to such an extent that it would maybe take a toll on my GPA? I know it's a stupid question but I've been super paranoid about it."
    },
    {
      "id": "irjbbtd",
      "body": "I think it'll be hectic af..... 3 hrs of travel in banglore is Hella painful. \nMy friend who's going to PES EC campus has a travel time of 50-70 mins one way and he says it's super challenging, waking up early,coming home exhausted, skipping lunch cuz time issues. \n\n\nLike u said if u have no option then this is the best one I guess."
    },
    {
      "id": "irjei2j",
      "body": "I agree with you completely, and that's why I've been so paranoid about it. I know I've told that I don't have other options open but tbh that was mostly after the assumption that 3 hours of  total travel would probably not cause much of an issue in terms of GPA or something."
    },
    {
      "id": "irjeq0v",
      "body": "Is there anyway u can switch to hostel pg after ur first year or something?"
    },
    {
      "id": "irjfg2b",
      "body": "Not really, like I've mentioned in another reply here, I can't sadly take up PGs or hostel due to personal reasons. I've been told about Metro that'll be coming up but it still would be inconvenient as per my observation as the nearest station is about 3 km away."
    },
    {
      "id": "irjghjk",
      "body": "Then I'll be honest, I don't think it's feasible traveling 3 hrs a day for the next 4 years. I think u should start exploring other colleges/options. I think ur GPA would be harder to maintain if ur spending 3 hrs a day traveling.  Pes has ISA every 3 weeks right?  It will be too much to handle. \n\n\nLater on (2nd year onwards) maintaining GPA won't be the only thing u need to think about, you'll have to work on projects, learn stuff that's not in college syllabus but is required for placements/higher ed by yourself, and managing all this and staying healthy, both physically and mentally, when ur spending 3 hrs a day traveling, is gonna be near impossible."
    },
    {
      "id": "irjnxh3",
      "body": "Yeah ISA cycle is something like that I guess, I'm not completely sure. However I agree with you upon the other things and now it has made me more paranoid ngl💀. I'll consider all the opinions and thoughts here and think about what to do. First of all, I have to make sure that I get CSE in EC campus in round 2 before anything lmao."
    },
    {
      "id": "irli2hf",
      "body": "Same situation as above. Travelled about 3 hrs to and fro every day by college bus. When it comes to GPA, I've seen both. Few hurt their GPA, few did very well. However the travel will restrict you from a lot of things. You can't stay back and participate in any extra curriculars. All you will think of is getting back home and studying.\n \nTbh it could affect your mental health too. But if you're sure you can grind enough you could do well."
    },
    {
      "id": "irll0r9",
      "body": "It varies from person to person. I managed to get a CGPA of close to 9 during my first 3 semesters here (the rest were all online due to COVID). So you could say that I was able to manage the stress. However I've seen people at the other end of the line as well, those who struggled to manage time and mental health. And as someone else said - yes, you tend to cut down post class activites because you don't want to return home even later than you usually do. People who try to fit these also in tend to be under more pressure to get things done in time.\n\nIt's difficult to predict how things will turn out for you. Only you and you yourself can be the best judge for it. I'll still stick to my suggestion - spend a semester travelling and decide. If things are manageable, good for you. Else you'll need to find a solution."
    },
    {
      "id": "irmsiuk",
      "body": "Oh alright, noted. I once again thank you for your input. I completely agree with you regarding how the impact would be unique, as in different for every person. I surely will consider your suggestion. I had a couple more points to include in the original post, but I really am not trying to over-analyze at this point because I haven't yet gotten the college, so I'll keep them for later. Ty once again."
    },
    {
      "id": "irmt4d9",
      "body": "Fair enough, the impact would lie on both the ends of the spectrum and like how (rowlet-owl) has mentioned, it'll definitely be a unique impact on the student.  \nI am willing to grind as long as I don't come across health issues like headaches and so on which I often fall a victim for, periodically.  \nThank you for your input!"
    },
    {
      "id": "irmtnnd",
      "body": "Slept during the bus rides to avoid headaches and studied late at nights. Sleep cycle gets fucked but yeah xD"
    },
    {
      "id": "irn09hq",
      "body": "Respect the hustle😭"
    }
  ]
}