{
  "id": "y04w7g",
  "title": "What are some enjoyable extracurricular activities in PES Electronic City? Does the campus have a gym?",
  "content": "",
  "metadata": {
    "author": "SkywalkerPadawan512",
    "url": "https://www.reddit.com/r/PESU/comments/y04w7g/what_are_some_enjoyable_extracurricular/",
    "permalink": "/r/PESU/comments/y04w7g/what_are_some_enjoyable_extracurricular/",
    "score": 6,
    "created_utc": 1665374420,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "irqezwr",
      "body": "You can play football/ basketball/cricket. There is ground/court for all 3. There's table-tennis, chess, carrom, dance clubs, acting clubs, debate clubs, quiz clubs, space club, \n\nwe have 5 places where you can get tasty food in the campus. 2 are food bus, one in near parking and one is inside the main college building. \n\nWe have fest \"maaya\" each year. \n\n\nAnd there is a gym in the campus in the main building with a very helpful gym instructor."
    },
    {
      "id": "irqnrb5",
      "body": "You are talking about the South Campus right?"
    },
    {
      "id": "irr0y0u",
      "body": "Yup can confirm"
    },
    {
      "id": "irr3g2i",
      "body": "There are many enjoyable things here. Like I enjoy playing table tennis everyday here. \n\nYup there is a gym inside the PE room where the other sports facilities are.\n\nAlso you can see my comment on this post about the sports facilities.\n\nhttps://www.reddit.com/r/PESU/comments/xppr88/sports_facilities_at_pes_ec_campus/?utm_source=share&utm_medium=android_app&utm_name=androidcss&utm_term=1&utm_content=share_button\n\nThe campus is pretty lively with different technical/non technical clubs conducting events every week. Workshops, hackathons are conducted in abundance here (I joined a month ago, pessat batch). Also Maaya event is coming up! Everyone is excited for that here"
    },
    {
      "id": "irr3vns",
      "body": "2 Cafeterias are also there in btech block/main building"
    },
    {
      "id": "lrd6xx9",
      "body": "what is the gym fees??"
    },
    {
      "id": "mq26yv4",
      "body": "Does pesit EC campus has a hockey team "
    }
  ]
}