{
  "id": "y0856r",
  "title": "which is better 🙂",
  "content": "\n\n[View Poll](https://www.reddit.com/poll/y0856r)",
  "metadata": {
    "author": "Little_Elderberry233",
    "url": "https://www.reddit.com/r/PESU/comments/y0856r/which_is_better/",
    "permalink": "/r/PESU/comments/y0856r/which_is_better/",
    "score": 6,
    "created_utc": 1665385740,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "irqlxmo",
      "body": "any day every day, pes will give you significantly more exposure when compared to bvb. added bonus being the location and the peer group here. there are insanely smart people in every branch, so if you think the smart ones are only in cs, you're very wrong. although it's gonna be way more hectic than bvb, it'll be worth it."
    },
    {
      "id": "irr13iu",
      "body": "Bro but the branch ee is v hard right like it so math heavy. And tbh  the main reason i wanted to join pes  was peer grp and more exposure but the branch was main problem :⁠-⁠("
    },
    {
      "id": "irr1bow",
      "body": "What are you targetting? Placements or Higher Studies"
    },
    {
      "id": "irr1dfi",
      "body": "Placements"
    },
    {
      "id": "irr20wg",
      "body": "You might be knowing that placements here(PESU) are the best for CSE only. ECE people get some odd CS jobs so I don't think EEE here would be a great choice here if your concern is placements..But if your interest lies in electrical/electronics then you can go for it. Cuz here afaik only top1-2% of students from ece,eee,mech get the core jobs. Else most engineering students from the branches other than CS are placed in mass recruiting companies."
    },
    {
      "id": "irr2ew4",
      "body": "Haa i first thought eee PPL would also hav an equal opportunity as cse students to get t1 jobs but i don't think that's the case anymore  i specifically don't hav interest in electrical but hav a little in cse but can't get it soo was thinking of doing some cs projects and getting into some tech placements  but that's v hard right only top PPL in eee branch gets t1 jobs right"
    },
    {
      "id": "irr2vya",
      "body": "You'll mostly get placed in t3 company or t2 company (if you work very hard) if you choose circuital branch other than CS here. Also managing studies here is tough ngl. After the new internals system has been implemented , it has become very hectic. Adding to that there's 1440 cse students here(Rr+Ec) so competition is also very high. Managing other courses with  assignments,projects,ISAs,ESAs will be reallyyyy realllyyy tough"
    },
    {
      "id": "irr3607",
      "body": "True that"
    },
    {
      "id": "irr5ee3",
      "body": "you cant escape math in any engineering branch"
    },
    {
      "id": "irr5xfp",
      "body": "But controls signals waves all comes in electrical and my math is not that great so maybe i felt it that way ig"
    },
    {
      "id": "irr7gpk",
      "body": "doesnt matter. math is math, its application is different in each branch. complex numbers used in signals or smthg ece but fluid dynamics in mech. you dont think ece also has waves and shit? ece is literally a sub branch of eee"
    },
    {
      "id": "irrpeuq",
      "body": "two years every department will have math compulsory, so you can't escape math at all. also if you consider eee to be hard, you're already on the wrong foot. what maybe easy to you, may not be to your friend. in the end it comes down to your ability to handle the subject and if you're willing to compromise on entertainment for better career prospects. good luck."
    },
    {
      "id": "irsergx",
      "body": "None. Prefer CSE"
    },
    {
      "id": "irsoi3a",
      "body": "Yes i completely agree to it but ece also has some of the cse stuff which helps in better placements (correct me if i am wrong) but electrical doesn't offer that right like it's a v different path and i still don't hav any concrete liking like i haven't still found my interest so it's a little tough to experiment now so  asking seniors :⁠-⁠)"
    },
    {
      "id": "irsosht",
      "body": "Yes bro  what u said is 100 percent right and now I will reconsider my opinions and options and do some more research on this and get some concrete info"
    },
    {
      "id": "irsoxum",
      "body": "Bro that not possible for my Ranking like i will get okok kalej"
    }
  ]
}