{
  "id": "y0gat6",
  "title": "5 ISA system and increased class hours...",
  "content": "We all know that it's a pain... Can we do anything about it? Also, I heard that the Pro-Chancellor told the 5th semester students that they are not going to remove it despite multiple complaints. Is it true? I get multiple sources of fake news about it. One day someone tells me that none of the students have complained and that's why they haven't removed it. Can anyone give me proper info on it?",
  "metadata": {
    "author": "esinpe",
    "url": "https://www.reddit.com/r/PESU/comments/y0gat6/5_isa_system_and_increased_class_hours/",
    "permalink": "/r/PESU/comments/y0gat6/5_isa_system_and_increased_class_hours/",
    "score": 15,
    "created_utc": 1665412403,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "irrpi4w",
      "body": "Ethics"
    },
    {
      "id": "irrq92s",
      "body": "What? Can you please elaborate?"
    },
    {
      "id": "irrrc41",
      "body": "You will not get tier 1 placements if you complain about 5 Isa, you should be asking for more isa's."
    },
    {
      "id": "irrrvf9",
      "body": "They are not gonna remove it, even if we send a zillion requests to the management. Can't help 😭😭"
    },
    {
      "id": "irrt5xx",
      "body": "So you would rather write isas than have some extra time to develop skills required for placements? \nHow bad has our education system failed you brother"
    },
    {
      "id": "irrub5y",
      "body": "These were the exact words said by the pro chancellor 🤷‍♂️"
    },
    {
      "id": "irrx0y1",
      "body": "I'm not even sitting for placements."
    },
    {
      "id": "irrxbdg",
      "body": "Seriously, what CAN we do to change their minds?\n\nI'm tired. Mental health is gone to the worse stage since pandemic. I'm skipping sleep to balance time between college and other stuff and it is never gonna end up in a good way. Clubs, assignments, classes, ISAs, everything, is just one huge mess for me right now. Ugh."
    },
    {
      "id": "irs0mw1",
      "body": "Put it in quotes😂"
    },
    {
      "id": "irs0xuq",
      "body": "Nothing tbh... We tried everything during covid to get them to take exams online and a lot of other stuff..in the end our marks suffered and they didn't give a damn about it."
    },
    {
      "id": "irs0zji",
      "body": "When asked about how many 3rd Sem students liked 5 ISAs, majority of the students raised hands indicating support.\n\nSo the system is probably designed for that majority of students."
    },
    {
      "id": "irsbva4",
      "body": "This did not happen... I'm a 3rd Sem student and there are definitely more haters than people who liked it."
    },
    {
      "id": "irsgb1m",
      "body": "Well it happened when all branches other than CS were called for MRD that day."
    },
    {
      "id": "irvka72",
      "body": "Even I am skipping sleep almost, although I've been practising it since 12th"
    }
  ]
}