{
  "id": "y4gga4",
  "title": "Kcet vs Pessat seat",
  "content": "I am in cs-aiml right now, planning to go with EEE through Cet and opt for a Cs minor...what would you recommend?",
  "metadata": {
    "author": "_Unternehmer_129",
    "url": "https://www.reddit.com/r/PESU/comments/y4gga4/kcet_vs_pessat_seat/",
    "permalink": "/r/PESU/comments/y4gga4/kcet_vs_pessat_seat/",
    "score": 4,
    "created_utc": 1665814993,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ise11lb",
      "body": "Don't. Eventually you'll have to come to cs only for placements."
    },
    {
      "id": "ise1m5d",
      "body": "If you consider the financial differences,it's worth a try! Seeing drop in ComedK cutoffs ,sure Kcet cutoffs will also drop (being the last counseling happening), you may go for top 5 colleges CS/IT branches also."
    },
    {
      "id": "ise2fa4",
      "body": "Same with me, hope to get cse ecity with 2.4k rank"
    },
    {
      "id": "ise3kqo",
      "body": "Unrelated... is it CS-AIML or AIML? In the kcet option entry... it's showing AIML. Are both of them different?"
    },
    {
      "id": "ise4dzs",
      "body": "Officially it's AIML but syllabus wise you will have to check with the students( like if it's 90% CS with AI subjects or if it leans more towards AI)\n\nNot only in PESU..but in other colleges too when you see namewise there's a distinction between CS (specialisation in AI/DS/Cyber) and *just* AIML.\n\nFor example I think ramaiah has both CS-AI and AI. Someone cmiiw."
    },
    {
      "id": "ise4nhf",
      "body": "Aiml\\* my bad!"
    },
    {
      "id": "ise4y0c",
      "body": "Can you connect me to any EEE major? I know peeps from CS and ECE... Only intention behind my post is to save bucks for masters abroad... Looking at the placements data, Many companies have allowed circuital branches to sit for placements, cgpa required is arnd 8... and they have been offered decent package and internships too!"
    },
    {
      "id": "ise6lia",
      "body": "hey hold on... Just checked my profile... It is CSE in AiMl"
    },
    {
      "id": "ise70bz",
      "body": "Yes MSRIT has both...that's what intrigues me. It doesn't make sense for both the courses to be same... and if the aiml course at msrit is not about specialization then other colleges would also have it the same way."
    },
    {
      "id": "ise8qe6",
      "body": "Can you compare your syllabus with cse student and clarify whether aiml is specialization or it's aiml in detail... atleast in kcet option entry it's being shown aiml, so it wouldn't make sense to have different course for only kcet students."
    },
    {
      "id": "ise8vfq",
      "body": "Guys is it okay to compromise the CS branch in a below-average college for lower branches in a Good college like Mech, EEE in PES, MSRIT"
    },
    {
      "id": "ised1yp",
      "body": "Join IEM in RVCE"
    },
    {
      "id": "isednhm",
      "body": "Prefer Rvce over any college(all India known college). Can go for its cse related branches or IT. BMS /Msrit / Pes are also good but relatively lesser known in North. Def not at RV level! Take yr call accordingly"
    },
    {
      "id": "isejhtx",
      "body": "Only this year AIML got added so no one knows how it's syllabus will be.\n\nWhen I attended the pessat  counselling, it was written AIML. Pic of counselling ->\nhttps://drive.google.com/file/d/12GFDlO_wEIWjSQiGAuGCTWOG50qnczjb/view?usp=drivesdk"
    },
    {
      "id": "isekv19",
      "body": "bruh? why shld I be bothered by northies knowing about my college?... Atleast BMS/MSRIT/PES ain't some pappu ram college of engg... Cmon manh.. \n\nto be honest... Rvce is sold out to Kannad gothilla gangs cmng from north..."
    },
    {
      "id": "isel47i",
      "body": "Nope..."
    },
    {
      "id": "iseld79",
      "body": "you hv shared club orientation doc"
    },
    {
      "id": "iselz6w",
      "body": "My bad.. I've corrected it nowðŸ‘"
    },
    {
      "id": "isemi63",
      "body": "My father had talked to the councelling staff during PESSAT round 1 and they had told him that it's CSE+AIML specialization. Even though it hasn't been written this way anywhere, they had told him that it is a CSE degree but with specialization. Not sure if it still holds the same, but this was the information conveyed to him back then."
    },
    {
      "id": "iseozgf",
      "body": "Cool bro! It's not a question of North or south. More of a Reputation. RV is considered in league of tier 1 pvt college like Bits,etc. Rest are also good. In the end all depends upon one's skills.Rest yr call. No offence pl."
    },
    {
      "id": "iseyhdf",
      "body": "Your opportunities will be way better in any CS branch. \n\nEEE will not only be a harder cource but it will also not offer as many opportunities or nearly as good placements.\n\nOf course if u have an interest in EEE then go for it, otherwise do not."
    },
    {
      "id": "isf8epy",
      "body": "[https://drive.google.com/file/d/1QmnTQzQX3E1vMK2pRXJZqkwKV98hiAGz/view?usp=sharing](https://drive.google.com/file/d/1QmnTQzQX3E1vMK2pRXJZqkwKV98hiAGz/view?usp=sharing)"
    },
    {
      "id": "isf8wtf",
      "body": "Yeah, exactly what I've meant in my reply above."
    },
    {
      "id": "isfb9qa",
      "body": "I know bro.. two of my relatives are Rv graduate, one of them is working as SDE settled in US and the other is running his own company (Ethereal Machines) \\[Koushik Mudda\\]. SDE guy is Chemical graduate and Koushik is ECE graduate... \n\nI have taken their feedback and they were pretty clear that 'name of my college didnt make the current me'. Its what you want to do and finding the right peer group to move ahead"
    },
    {
      "id": "isfl99j",
      "body": "Till the announcement of commencement of Kcet option entry , in my profil it said AI&ML, now its changed to CSE-AiMl"
    },
    {
      "id": "isi7eah",
      "body": "this is not the subbreddit you are looking for"
    },
    {
      "id": "isi7hxr",
      "body": "it usually recommended to do course > college"
    },
    {
      "id": "isi8se2",
      "body": "The real question should be, are you interested in CS or EEE?\n\nIt sounds like you're interested in CS but are trying to opt for a EEE seat to lessen the financial burden. You can always make the money back, you should prioritise your interest first.\n\nThat being said, EEE is known to be much harder and if you're someone who doesn't like the course in general then you'll struggle with it. There are far lesser opportunities, and even if you do end up doing a CS minor, companies still do prefer a CS degree over an EEE + Minor in CS degree (I answered this in detail in a previous post, you can check it out). \n\nIf you want to have better opportunities (and also pursue your interest which seems to be CS) then you should stick to what you have. CS placements are really good, you can make the money back soon (if that is your concern)."
    },
    {
      "id": "isikm8g",
      "body": "Cool. Skills matter ultimately"
    },
    {
      "id": "isiowpt",
      "body": "In my opinion, they're giving CSE degree with AIML specialization."
    },
    {
      "id": "lk55rtz",
      "body": "This time eee cutoff was 46xx in mock round"
    }
  ]
}