{
  "id": "y7jy9u",
  "title": "What order should I prefer and why? CS (Data Science) or CS(Cyber-Security) or CS (Iot and cybersec) or CS(cybersec) or CS(ai/ml) or CS(ai/ds)?",
  "content": "",
  "metadata": {
    "author": "[deleted]",
    "url": "/r/Btechtards/comments/y7iqr8/what_order_should_i_prefer_and_why_cs_data/",
    "permalink": "/r/PESU/comments/y7jy9u/what_order_should_i_prefer_and_why_cs_data/",
    "score": 5,
    "created_utc": 1666129667,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "isvvpjb",
      "body": "Seeing as you've already mentioned that core CSE is your top priority, I'll go ahead and skip that part. But answering the rest of this is difficult, and since you're in r/PESU rn, I'll talk about this from the PES perspective.  \n\n\nBecause essentially, all of these are restrictive and depend entirely on the *subset* of faculty in each college. PES, which offers the AI/ML degree, does have a lot of papers published by students in ML; a few of them are even good (this is par for the course across colleges to be fair; undergraduate research is very rarely ground-breaking and ML is usually a good way to get some papers out).   \n\n\nIf you want *placements* in general, then (although since this is the first year the AI/ML degree has been introduced so take my words with a grain of salt) it is very likely you'll be able to sit for the placements that CSE gets as well. Very few core ML jobs (the usual pipeline is that you either do a masters and then get an ML job, or you work as an SDE for a few years), but lots of placements in terms of just getting a job. You can check out PES' placement statistics for this year on the pinned post on this subreddit too (thanks u/pillarsOfSaltAndSand!)."
    },
    {
      "id": "isvyruq",
      "body": "Just to clarify, the one offered by pes is a cse(ai/ml), and NOT  an ai/ml, right? And what's the difference b/w the two?"
    },
    {
      "id": "isw9mqs",
      "body": "If I'm not mistaken, the course is a B. Tech in AI/ML. I don't know what the difference between AI/ML and CSE (AI/ML) is, although the speculation is that the PES degree will be a CSE degree with electives geared towards machine learning, similar to their already existing ML/DS specialization in CSE."
    }
  ]
}