{
  "id": "y9ydyp",
  "title": "[SERIOUS][PLEASE HELP] Is it worth joining RA position and pursuing a thesis based masters ?",
  "content": "[deleted]",
  "metadata": {
    "author": "[deleted]",
    "url": "",
    "permalink": "/r/PESU/comments/y9ydyp/seriousplease_help_is_it_worth_joining_ra/",
    "score": 8,
    "created_utc": 1666370597,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ita423p",
      "body": "For starters, if you're not planning for a PHD then doing a thesis based masters is not really useful. If your plan is to work, especially in the R&D dept then maybe yeah. \n\nBut apart from that it's not worth it. Neither is masters in India or abroad. People value skills more than an additional degree. If you really want to go abroad, suck it up, take a loan and go for masters. That is, if you want to work there. And if you really just want to go abroad, you can do masters here and get into top schools abroad for PhD which will be funded. Since you said you didn't want to do a PhD, you can take a decision based on what you want in the future. \n\nHope this helps!"
    },
    {
      "id": "itafe2c",
      "body": "Ok got it.\n\nCan you please elaborate on \"masters abroad is not worth it\"? I agree that experience and skills matters more. But, what if you want to work abroad few years down the line? I've seen people go abroad after few years of workex, but for that you have to be at the top 1% in your field. And that path is much more difficult compared to doing masters abroad and getting a job there.\n\nAnd, one of my batch mate quit a 60lpa job at Apple here and went to do her masters"
    },
    {
      "id": "itb5b3n",
      "body": "My perspective:\n\nTaking loans during this recession period is like a huge risk mate. At the end of the day it is your call. Just don't get into FOMO.\n\nAnd my elder sister had to wait for 5-6 months to get a job after she completed her M.S.\n\nAnd since her visa expires soon she needs to comeback here. Which isn't really worth it even for a 30+ lakh job in India.\n\nYou can get highly paid if you just work hard and contribute more in ur present company.And then maybe with experience you can get a hike in your salary\n\n&#x200B;\n\nMy gpa is low+I am a junior. I already regret taking admission through management quota.\n\nAnd if I were you I would rather put that money into a business and scale it up. Because you wouldn't want to work till you are 60 right?\n\nI'd be happy to stay with my parents while also living life without stress from all the money I would have invested in few businesses.And retire by 30 xD"
    },
    {
      "id": "itb86xb",
      "body": "Sorry, I meant masters in India is not worth it. If you want to work here that is.\n\nBut in general, recruiters or rather anyone value skills over an additional degree. That's why even grad schools value work exp when you try for admissions in their universities. That said, it's always good to learn new things. So if you step up your game and learn better skills during your masters then I'd say it's worth it. Otherwise, maybe not.\n\nAgain, this is all what I feel. So don't let it hold you back from doing what you want to pursue :)"
    },
    {
      "id": "itcb283",
      "body": "How much did you pay for the seat?"
    },
    {
      "id": "itgwvyp",
      "body": "8"
    },
    {
      "id": "itgxzb2",
      "body": "Was it worth it?"
    },
    {
      "id": "itk390h",
      "body": "U will have to wait for me to get placed and ask the same question again. You can still get into a t3/t2 college and get highly placed \"if you develop a great skillset,be good at coding,build in public,contribute to open source projects,post the stuff u build- on internet\""
    },
    {
      "id": "itk3a4l",
      "body": "Or Remote jobs are a key to getting high paying jobs too"
    },
    {
      "id": "itlo1ry",
      "body": "Imho tier-4 college that doesn't care about attendance and grades would be a better option"
    },
    {
      "id": "itlq6gl",
      "body": "Well that's a plus point.If you want a tech role,start coding,build projects,learn and build cool stuff and put iton the internet\n\nIf you want a non-tech role,start building your portfolio. Easy"
    }
  ]
}