{
  "id": "yadlz0",
  "title": "BIG QUESTION. Why has the CSE mock cutoff for PES South Campus increased so much (from 1800 to 3500) from 2021 to 2022? What might be the reason?",
  "content": "",
  "metadata": {
    "author": "SkywalkerPadawan512",
    "url": "https://www.reddit.com/r/PESU/comments/yadlz0/big_question_why_has_the_cse_mock_cutoff_for_pes/",
    "permalink": "/r/PESU/comments/yadlz0/big_question_why_has_the_cse_mock_cutoff_for_pes/",
    "score": 7,
    "created_utc": 1666411608,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "itasr9n",
      "body": "Even I was very surprised its not just PESU , almost every college is seeing highly inflated cutoffs. In my opinion its because KCET counselling is being conducted very late ( after jee, vitee etc). If u compare the cutoffs of almost every college it is simlar to last year's round 2 extended. Also this year the government promised to increase 10% seat and in pes , only ec campus saw an increment of 60 cse seats. Also I guess there wont be much of variation in further rounds , I can be wrong."
    },
    {
      "id": "itb2fap",
      "body": "All of that along with the fact that (as per my calculations) there has been an increment of 774 seats in all IT related fields in the top 4 colleges (RVCE/PES RR/MSRIT/BMS). But yes, that still should've kept it <3000 tbh. This is why I have a feeling that it will fall down (numerically) in round 1. (That is, about <3000. This is an over-analysis / overthinking btw, so I could be wrong on the latter)"
    },
    {
      "id": "itb3p14",
      "body": "Extended round cutoffs already for most colleges💀"
    },
    {
      "id": "itbcy1k",
      "body": "Huge increase in seats for colleges above it"
    },
    {
      "id": "itbzlsi",
      "body": "Is it confirmed that in can get CSE in EC campus with 2850 rank??"
    },
    {
      "id": "itcbcak",
      "body": "Exactly. Why tho?"
    },
    {
      "id": "itcbgq6",
      "body": "Thank you for answering!"
    },
    {
      "id": "itcbjf7",
      "body": "Yes, I think that could be the case. Even if it becomes 2800, I will still get it ig. Let me not count my chickens before they hatch."
    },
    {
      "id": "itcbvrc",
      "body": "700+ IT related seats added to the colleges who have cutoffs below PESU EC CSE"
    },
    {
      "id": "itci2rc",
      "body": "True 😭  \nI missed it by 56 ranks, so it would really hurt me if that happens ngl"
    },
    {
      "id": "itd0sa9",
      "body": "Maybe , lets see it's very unpredictable. But why would the cutoff fall down tho ?"
    },
    {
      "id": "itf25se",
      "body": "Bro bms or pes? I got bms ai ml in mock allotment, should I add pes ai ml above bms and try for pes ai ml? And i won't get cse ise cse data science in rv and bms and pes as my rank is low, please answer, pes or bms?"
    },
    {
      "id": "itf2qhq",
      "body": "Yes. Electronic City campus went till 3.5k for GM. my friend who has 2AH. his rank is 6.7k and got cse here."
    },
    {
      "id": "itf89mn",
      "body": "I have an explanation for that too: So, this explanation has a lot of loopholes and is once again, an over-analysis. I'm assuming people between 2500-3500 rank put DSCE CSE above PES EC campus CSE in their priority list because they assumed that they wouldn't be allotted anything if they did the otherwise as the mock cutoff last year was <1900 for PES EC campus CSE. This is why, DSCE CSE out-performed PES EC campus CSE this year. This was the backstory for my above explanation, where people now would put PES EC campus CSE above DSCE CSE which might lead the cutoff for PES EC campus CSE to fall down numerically. All of this is a complete over-analysis, none of this might happen, or it actually might happen. BTW, I'm aware of the fact that DSCE is closer to majority of the people than Electronic city, which might also be the reason for the out-performance. Maybe people don't want to travel so much? I'm not sure."
    },
    {
      "id": "itfe6bj",
      "body": "Personally I wouldn't do that , I put my priority order based on how good the college is and, not on how good  my chances are to get in there. Like RV is my top priority dispite my rank being 2.3k and knowing that I have 0 chances to get in there, I placed it above pes and everything."
    },
    {
      "id": "itfm7je",
      "body": "Yeah, I did the same thing too. But I know like a couple of peers who actually put it according to last year's mock cutoff because of the same propagations on YouTube. This is the only reason I thought of creating that over-analysis, but I of course could be wrong and thus have put in that at the end of my sentence"
    },
    {
      "id": "itqfvvz",
      "body": "What's 2AH??"
    },
    {
      "id": "itqils0",
      "body": "Category in other backward classes in karnataka. H is Hyderabad karntaka region reservation"
    }
  ]
}