{
  "id": "yak5gv",
  "title": "BMS ECE vs PES (Ring road) ECE",
  "content": "Would like to know which one is better. \n\nI can get both through KCET.\n\nPS: Have been alloted BMS in mock allotments",
  "metadata": {
    "author": "Single_Toe_95",
    "url": "https://www.reddit.com/r/PESU/comments/yak5gv/bms_ece_vs_pes_ring_road_ece/",
    "permalink": "/r/PESU/comments/yak5gv/bms_ece_vs_pes_ring_road_ece/",
    "score": 6,
    "created_utc": 1666434350,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "itbhvzb",
      "body": "From what I've heard, PES has a better curriculum and placements, BMS has a more relaxed college life, less number of tests and so on, with decent placements."
    },
    {
      "id": "itbjea1",
      "body": "Thanks for the info. Placements and college life are my main concern."
    },
    {
      "id": "itbons8",
      "body": "So it seems to be a tough choice for you. All the best!"
    },
    {
      "id": "itc0ajl",
      "body": "Depends on your priorities.  \nPES is a place for people interested in techinal (coding) aspects. Lot of events and hackathons keep going on related to techincal domains. Also the college is a bit baised towards the same.\n\nPES is known for its strict following of Calendar of Events when it comes to academics. Also you might initally feel the life hectic until you get acclimitised to the environment.\n\n  \nAlso do consider other factors like distance (if localite) or hostel facilities, Fees (BMS Aided has way less fee), etc\n\nI had met with same dilemma and ended up choosing PESU. Have some regrets and also some amount of satisfaction. So good luck choosing!"
    },
    {
      "id": "itccfsg",
      "body": "Yes it sure is. Some say BMS is good, while some say that BMS isn't valued like it used to be and PES has more to offer,so I'm still in a dillema. And thank you for your input."
    },
    {
      "id": "itcd5ja",
      "body": "Thank you. I have heard a lot about the hectic schedule of PES and please do let me know if puuting in the work in the initial years there is worth it. And coming to the factor of convince of travelling I live nearby to both colleges so it's not really a problem for me as well as the fees. Since you say you were in the same situation as me I would really like to know more about life in PES from you."
    },
    {
      "id": "itfqech",
      "body": "I do not plan on finding a job right after graduating college as I have plans of pursuing a masters degree. So looking at my priority I think BMS suits my needs more than PES."
    },
    {
      "id": "iz457g0",
      "body": "Which college did you end up choosing?"
    },
    {
      "id": "iz46md3",
      "body": "BMS ECE"
    },
    {
      "id": "mx6nwrq",
      "body": "Why so? I am in the same dilemma rn. I really don't know which one to choose. Which one is the best option overall?"
    }
  ]
}