{
  "id": "yal3hh",
  "title": "Doubt regarding the movement in KCET 2022 cutoff.",
  "content": "As the title suggests, I wanted opinions and predictions regarding the movement in KCET cutoff this year, that is, when it moves from the mock round to the first round and then from the first round to the second round and from the second round to the second extended round. I know it's hard to say anything at this point, but I'm okay with predictions and opinions. (Will there be a usual movement, or whether it won't move at all and so on)   \nThanks!",
  "metadata": {
    "author": "Medium-Ad1870",
    "url": "https://www.reddit.com/r/PESU/comments/yal3hh/doubt_regarding_the_movement_in_kcet_2022_cutoff/",
    "permalink": "/r/PESU/comments/yal3hh/doubt_regarding_the_movement_in_kcet_2022_cutoff/",
    "score": 4,
    "created_utc": 1666437460,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "itblmuc",
      "body": "Depends on neet counselling happening before one of the kcet rounds so that medical aspirants can leave the engineering seats."
    },
    {
      "id": "itbm3ac",
      "body": "And COMEDK too, kinda"
    },
    {
      "id": "itc1c10",
      "body": "Yeah for dental maybe,But I doubt comedk would affect that much   \nNumber of Kcet seats are fixed afaik  \nEdit: yeah it does effect since they're finishing up comedk before kcet, so ppl with comedk seat can't easily give it up without paying some more"
    },
    {
      "id": "itc37m3",
      "body": "yessir, but the shift from comedk to kcet might cause a bit increment right"
    },
    {
      "id": "itf8fat",
      "body": "Yeah, like all of your points were what made me ask the question, about the movement of the ranks from mock round to round 1 to round 2 to round 2 extended. What's your take on this?"
    },
    {
      "id": "itffzbq",
      "body": "Any chances for getting pesu(rr) cse at rank 1374(GM)"
    },
    {
      "id": "itflqyf",
      "body": "ooo Yeah I get your point, thanks for pitching in your opinion, I appreciate it!"
    },
    {
      "id": "itqnfng",
      "body": "i cant really tell, ngl"
    }
  ]
}