{
  "id": "yb85vo",
  "title": "My review on the PES Electronic City Campus",
  "content": "I do not intend to offend anybody or hurt anybody's feelings. This is an honest review about PES Electronic City Campus. I visited the campus twice (yesterday and before) and the First Year Boys Hostel (Amaatra) once yesterday. \n\n1. Rooms: Very congested, can make a person claustrophobic, little to no cupboard space, and I have heard that there is a bedbug menace.\n2. Area: Electronic City is not a bad place by any means. But the Hosur road traffic, crumbling infrastructure (open drains), under construction activities in campus, stray dogs coupled with bustling city lifestyle makes PGs also a bad idea to pursue, let alone the hostel.\n3. In-campus hostel: When I enquired about a place to dry clothes in the in-campus hostel, I was told that there is no space to do so. However, I would have loved if the rooms in the Amaatra hostel were like the in-campus hostel rooms with attached bathrooms.\n4. Commutation and time-strictness: There are only certain time slots twice a day for to and fro travel from/to hostel from/to campus (7:00-7:20 AM and 4:00-4:20). If you fail to enter the bus in these slots, you'll have to walk or use any other means to reach the hostel. This makes it scary to miss the bus.\n5. Distance from home: This is a me problem. I live about 40kms away from the college and its hostel. This is why Electronic City is very very different compared to my home (near Nagawara-Thanisandra). The roads in electronic city make it incredibly difficult for visits from/to home.\n6. Bathrooms, showers and toilets: No handwash soap/dispenser is kept in the common bathroom in each floor. Toilets weren't clean when I visited, and the thought of a common bathroom shared with the entire floor makes it kind of a gross experience, especially when you know that they may or may not clean the toilets and the bathroom properly.\n7. Mosquito Menace and construction activities near the Amaatra Hostel\n\nThere were a lot of things I loved about the University, but living conditions are quite important, and I am even contemplating going to SJCE Mysore CSE using my KCET rank (2.2k). The record inflation in PES EC CSE seats also makes the situation quite sus (gut feeling).\n\n&#x200B;\n\n**Note:** As stated before, the intention behind this post is to only highlight a normal student's grievances. Some might love the PES EC Campus, and I would have too, if it were not for these problems. Please tell me if I am in the right state of mind and advice accordingly. I am aware that sacrifices are required in these issues, but my parents think otherwise. All opinions are welcome.",
  "metadata": {
    "author": "SkywalkerPadawan512",
    "url": "https://www.reddit.com/r/PESU/comments/yb85vo/my_review_on_the_pes_electronic_city_campus/",
    "permalink": "/r/PESU/comments/yb85vo/my_review_on_the_pes_electronic_city_campus/",
    "score": 12,
    "created_utc": 1666499749,
    "flair": "Pride Of PESU",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "itf7b7u",
      "body": "same here buddy, planning to join somewhere else, like sjce"
    },
    {
      "id": "itfjh8w",
      "body": "Most of your issues are regarding the hostel,  just live in a PG or rent an apartment with few other people as simple as that. About your final point , yeah even I got a similar rank as you and makes me feel quite skeptical about such a huge cutoff lol."
    },
    {
      "id": "itfjv1l",
      "body": "The campus too bro. I would not like to live in a largely under construction campus. I feel the seat there has lost its value owing to such a huge cutoff. PG for me is ruled out coz transportation, laundry and sports amenities aren't available in PGs. I'll have to make arrangements for them, therefore having to dish out more money and energy just for day to day tasks, taking away my focus from studies."
    },
    {
      "id": "itfmd78",
      "body": "Every college is under construction bro lol ( tax evasion moment ) I think PGs provide laundry, food services etc. Sports facilities ? Ofc you have that in campus. You should obviously look out for pgs near the university in order to access sports facilities and also makes it convenient for transportation."
    },
    {
      "id": "itgx86k",
      "body": "I feel like most problems you stated are solvable and some \"deal with it\" Scenarios. I have been living in ecity since 2015, you will find decent PG's within 3kms from college, where you can easily travel as per your time and also use the sport facilities. You just need to search more, use pes discord servers and you might find some good options. \nConstruction will be there in both campuses and honestly its a good sign that college is trying to maintain their infrastructure, I am also a first year student (pessat entry) and i haven't been bothered by any construction till now, but i have heard people in rr have cuz the new block is very close by. \nI'm honestly surprised you didn't mention the main points! Pes follows strict academic system and attendence is 85% min. to sit in final exams.(very hard to maintain) Part of the reason why pes is better than most pvt. colleges in terms of placements.. Rigorous effort is required... But you can get used to it. \nNow it's upto you buddy, maybe look for more options in kcet Or join pes cse."
    },
    {
      "id": "ith09os",
      "body": "I have been living in Nagawara-Thanisandra since 2013. It has been fucking crowded here (290E Bus route - most busiest) but that too is not comparable to Hosur Main road traffic. There are big potholes here in PES EC, open drains, and even a 3km commute from PG to college can be quite a ride, especially during the Monsoon (unpredictable Bangalore climate). The infrastructure in PES EC and Electronic City (Hosur Road and Kudle Gate) is very very bad compared to the infrastructure near and in DSCE and SJCE Mysore or any part of Bangalore like JP Nagar, or RT Nagar or Jayanagar. \n\nAlso PGs are not very serious about rooms without noise disturbances since most of them are in commerical complexes. 24 hour power backups and wifi may not be there in all PGs and 4 people in a room seems so bad (Amaatra Hostel)\n\nI am of the opinion that every student deserves a fully finished campus. When half of the campus is under construction, and will be for 2 years at least, continuing with open drains, stray dogs and noise. \n\nThe main points you gave are quite good, I was blinded by then for a while. But I realised a few priorities in the past few days. Thanks for your take! Do tell me your opinion on my take too!"
    },
    {
      "id": "itm5b83",
      "body": "Bro I told you about everything you've mentioned iirc. Most of these doesn't even bother anyone in the campus ngl. The road anol doesn't have potholes, it's a freaking service road how can potholes even be there. Also the construction part , as I've had told you already, is just too far from the Btech block..You barely can hear anything"
    },
    {
      "id": "ito8cpj",
      "body": "👍"
    },
    {
      "id": "lieeu3v",
      "body": "Hey I am attending counseling this year , i have some doubts on pes ec campus ,can I DM you??"
    }
  ]
}