{
  "id": "yb8joa",
  "title": "Pes e City rumours",
  "content": "i had heard some rumours abt pes ecity, could someone please confirm\n\n\\> placements are pooled.\n\n\\> ecity branch and rr branch ppl are given same priority during placements.\n\n\\> e city branch is soon gonna get merged with rr branch and then the e city branch is gonna be medical university.",
  "metadata": {
    "author": "More_Scholar6180",
    "url": "https://www.reddit.com/r/PESU/comments/yb8joa/pes_e_city_rumours/",
    "permalink": "/r/PESU/comments/yb8joa/pes_e_city_rumours/",
    "score": 9,
    "created_utc": 1666501005,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "itfb6v6",
      "body": "Yes yes no"
    },
    {
      "id": "itfb9pk",
      "body": ">e city branch is soon gonna get merged with rr branch and then the e city branch is gonna be medical university\n\nThis is not a rumour. I remember reading a news article regarding this pre-Covid times. I don't know if they will continue with it tho.\n\nCannot comment on the rest as I'm still waiting for kcet counselling to get over."
    },
    {
      "id": "itfe1il",
      "body": "yeah same, if, thats the case there is no problem for me to join pes ecity"
    },
    {
      "id": "itfhktz",
      "body": "1, 2 - Yes. Placements happen together. Companies do not know about which campus you're from. Your degree (and any other documentation) does not contain the campus name. \n\n3 - I graduated this year. Around late 2019 before COVID they told us that they would be planning to do this after a few years. If not soon, maybe in another 3-4 years this could happen."
    },
    {
      "id": "itfimny",
      "body": "Medical buildings are not finished yet so I don't see the third one happening anytime soon(1+yrs)"
    },
    {
      "id": "itflbyl",
      "body": "Bro  is pes ec overcrowded?? And is it tough to stand out in the pes crowd?"
    },
    {
      "id": "itflpqk",
      "body": "Both campuses are crowded, but RR has way more students"
    },
    {
      "id": "itg759v",
      "body": "Would definitely take some time though to happen though, ngl"
    },
    {
      "id": "itk8i9z",
      "body": "Okok"
    }
  ]
}