{
  "id": "ycg6s5",
  "title": "Can non-CS students sit for CS placement if they have the valid skills or do they have to apply outside campus if they want to get into tech ? Which companies are more particular about the field you have majored in ?",
  "content": "",
  "metadata": {
    "author": "Geekwalker374",
    "url": "https://www.reddit.com/r/PESU/comments/ycg6s5/can_noncs_students_sit_for_cs_placement_if_they/",
    "permalink": "/r/PESU/comments/ycg6s5/can_noncs_students_sit_for_cs_placement_if_they/",
    "score": 7,
    "created_utc": 1666630011,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "itm2sc9",
      "body": "Yes"
    },
    {
      "id": "itm59c7",
      "body": "Short answer: Yes you can but don't have too much hope.\n\nLong answer: \n\nMost companies allow CS and ECE kids to sit for their tests. A few allow EEE as well. Very rarely you'll find the other branches included too. But usually these other branches tend to face difficulties when it comes to tests, because our placement tests contain a good amount of CS theory namely OS, CN, DBMS and sometimes even beyond these courses. These courses are mandatory courses part of the syllabus, so if you're from another branch you'll need to cover up somehow. Some people take up a CS Minor and that does seem to help, but it won't completely put you on par with the CSE kids. \n\nI graduated this year (2022 batch) and from my experience I noticed it was mostly CSE kids getting CS based placements. Very rarely a kid or two from ECE would show up in the list. Most of them would fail to make it past the coding test itself. And even if they did qualify for the interviews, they would face difficulties there. CS interviews are heavily focused on DSA concepts along with CS theory. Very rarely do companies interview based on skills you have or the job requirement (since they all come looking for SWE roles and assign you to teams later) and to the best of my knowledge, DSA isn't covered as part of syllabus of other branches. And finally even if you've done it all, companies do tend to show bias towards CS grads because there is a higher chance these kids already know or will be able to pick up tools/frameworks/languages used in the industry/job or have atleast some degree of familiarity with them.\n\nI'd say the best shot you've got through college is to take up a Minors. It won't completely make you prepared but it's better than nothing\n\nEdit: I wrote [this](https://www.reddit.com/r/PESU/comments/wuko48/comment/ilade73/?utm_source=share&utm_medium=web2x&context=3) answer sometime back. Attaching for more reference."
    },
    {
      "id": "itm7pmr",
      "body": "Quantity of CSE students here is in surplus too! Competition will be really high in between them let alone other branches."
    },
    {
      "id": "itqje8d",
      "body": ">CS interviews are heavily focused on DSA concepts along with CS theory.\n\n2nd year student here. Does this mean I should focus only on improving my DSA skills? Are side projects really necessary?"
    },
    {
      "id": "itqliuk",
      "body": "Yes. DSA plays a huge role in placements. They are asked not only in the coding test but also in interviews. The amount of DSA concepts asked in interviews varies. Sometimes they might be completely DSA oriented, sometimes they'll ask you stuff related to the job or even your projects. \n\nProjects are extremely necessary. DSA is just a measure of how good your problem solving skills are. Projects show your ability to tackle a requirement and deliver a usable solution. They also talk about your strengths, interests, fields you are interested in, and experience with tools and frameworks. They help the interviewers understand what kind of role you'd fit in best with and show your actual industry required skills. Additionally, if you have substantial projects then your interviews will be more about your projects than about DSA (I was asked 0 DSA questions in all my 3 interview rounds! Some others I knew were asked quite a few.)\n\nInterviewers often use your projects to understand your skill level and identify which team you'd fit in best, that's why it's extremely important to put projects related to the job you're looking for on your resume, and keep only relevant ones related to the job. Example, don't keep projects related to frontend development when you're looking for cloud related roles, etc. Only do this when you don't have enough things to show. \n\nI'd say make sure you have a good balance of both DSA skills as well as projects. You need DSA skills to clear coding rounds, and projects to do well in the interviews. Find a good balance and work on what is lacking."
    },
    {
      "id": "lwpg0ee",
      "body": "Bhaiya, what if the major is IEOR...there are good number of analytical skills which can be developed, rest AI, ML, DB and other statistical approaches are already in the syllabus, plus the technological temperament that a undergrad will develop via this course will surely put him in ease to learn new technologies also...so the syllabus of IEOR and a minor in CS should become a good profile right ? Also I am no much interested in the ekdum core coding jobs, I more of wanna work more of in the managing thing and trading analytics...\nWhats you're take on this ?"
    },
    {
      "id": "lwpgkxb",
      "body": "Also, at IITB, the IEOR department has a proper DSA course too (IE203) as well as (IE505) which deals with the comp prog and algos (maybe all the IEOR departments have that idk!) but yeah it's seems like that whatever theoritical base a CS grad need is kinda provided to a IEOR kid too but in different format, now to mold myself to a CS kinda person, I can opt for a minor in CS...so overall a legitimate profile ? Rigth ?!"
    }
  ]
}