{
  "id": "ygawp0",
  "title": "Travelling to EC everyday 🥲",
  "content": "I live 15 mins away from RR campus(Chandra Layout/Vijaynagar side), but I got seat in EC campus because of my pessat ranking.. and the chances of getting RR in second round counselling seems impossible. It takes like 2.5 hrs to travel back in the evenings, and this leaves me with minimal time to study.\nSo I was wondering if any seniors travelling to and fro daily know any way to make my life easier 🙏",
  "metadata": {
    "author": "purpletrooper0613",
    "url": "https://www.reddit.com/r/PESU/comments/ygawp0/travelling_to_ec_everyday/",
    "permalink": "/r/PESU/comments/ygawp0/travelling_to_ec_everyday/",
    "score": 18,
    "created_utc": 1667020879,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "iu7sc2l",
      "body": "Take a pg or hostel till metro is done honestly"
    },
    {
      "id": "iu7ukom",
      "body": "Honestly just take the hostel"
    },
    {
      "id": "iu7vu42",
      "body": "What rank are you having in PESSAT?"
    },
    {
      "id": "iu7xl8o",
      "body": "Local Hostelite here, my house is 3 hours away from EC Campus. I had taken hostel for 1st year and ngl, i had more than enough time for studies, plus there is alot of fun as well.\n1st hostel in Amaatra academy and the rooms are really good.\nI used to go home on most weekends."
    },
    {
      "id": "iu7z5tm",
      "body": "I got around 2100"
    },
    {
      "id": "iu7z6oa",
      "body": "smh idm honestly but my parents are against it :/"
    },
    {
      "id": "iu7z7mf",
      "body": "looks like that's the best option"
    },
    {
      "id": "iu7z9vm",
      "body": "that's great! but my parents dont wanna send me to hostel LMAO, tried convincing them also 🥲"
    },
    {
      "id": "iu7zf66",
      "body": "Just try explaining how inconvenient and time consuming it is. I live 20 mins away from ec campus and still opted for hostel 😂"
    },
    {
      "id": "iu7zl9k",
      "body": "I've made multiple attempts... it hasn't worked out 😂 thanks thoo"
    },
    {
      "id": "iu83464",
      "body": "Then the only thing you can try, is(unless you shift to another college apart from PES), is to try and score really good CGPA for your 1st year, i.e above 9.5+ to get CSE in RR through another round of counselling based on GPA in 2nd year. Itll be a long wait tbh."
    },
    {
      "id": "iu879hr",
      "body": "I had posted a similar question here:  \n[https://www.reddit.com/r/PESU/comments/xyvvkp/commuting\\_as\\_a\\_factor\\_in\\_terms\\_of\\_choosing\\_a/](https://www.reddit.com/r/PESU/comments/xyvvkp/commuting_as_a_factor_in_terms_of_choosing_a/)  \nPlease do consider checking out the insightful replies by the seniors over there :)"
    },
    {
      "id": "iu8fhb8",
      "body": "How many chances do we get to shift? Is it only after the first year?"
    },
    {
      "id": "iu8fi6o",
      "body": "thank you!!"
    },
    {
      "id": "iu8gybv",
      "body": "you're welcome"
    },
    {
      "id": "iu8nlfg",
      "body": "So you don't have any other option than just being a day scholar?"
    },
    {
      "id": "iu8o5sz",
      "body": "yup... I fucked up cet and comedk too so literally no other options 😂"
    },
    {
      "id": "iu8ojay",
      "body": "I am pretty much in the same situation as you.I got 177X rank in pessat and got PESU EC CSE in pessat r1. Right now I am really confused..Whether or not I should go with the CSE(AIML) course🥲 in pessat r2."
    },
    {
      "id": "iu8qgoe",
      "body": "I mean...I'm in RR, but cheers to meet someone else from here lol"
    },
    {
      "id": "iu8qm35",
      "body": "I've heard it's only at the end of year 1...cuz everyone studies together till then, then we all shift to our own dept...so it doesn't make much sense to shift later"
    },
    {
      "id": "iu8x7tu",
      "body": "I'm sure AIML will have great job opportunities in the future.. maybe even more than CSE, but we can never know :')"
    },
    {
      "id": "iu8xaiw",
      "body": "oh okay.. 🥲"
    },
    {
      "id": "iu8xkw2",
      "body": "I've heard RR is super crowded 😂 how's it going?"
    },
    {
      "id": "iu8xvqh",
      "body": "It's not pure AIML tho. It CSE with specialisation in AIML(fixed electives in 3rd yr). All other CSE peeps will be having a specialisation on their degree by the time they graduate. The thing is it's pretty maths heavy and Idk if I'll be liking it or not🥲🥲"
    },
    {
      "id": "iu8yahf",
      "body": "ohhh okay.. maybe you could check out some course material and decide."
    },
    {
      "id": "iu8yglp",
      "body": "Only 6 days left for counselling lmao. It's not like I will understand anything if I go through 3rd year AIML stuff.. The thing I know about it is it's about calculus, statistics,etc."
    },
    {
      "id": "iu8zwpw",
      "body": "From where did you get to know  it's not pure ai/ml ?"
    },
    {
      "id": "iu90emw",
      "body": "From u/Medium-Ad1870 . His dad enquired about the AIML course and COO in the pessat counselling told that it's just CSE with fixed specialisation.\nAlso one of the guy who took AIML told that his course on pesuacademy is listed as CSE(AIML)."
    },
    {
      "id": "iu90x7g",
      "body": "I'm also in the same dilemma. Imo if it's not pure ai/ml then it's not as big a risk taking it up"
    },
    {
      "id": "iu91gpy",
      "body": "Yeah but it's the first batch and no one knows how the placements will be for it. Mostly they would be similar to CSE cuz it's basically CSE. Safe bet will be to stay with PESU EC CSE as it's no different to the RR campus one academically or placements wise.\n\nAnd the part which concerns everyone here is the distance. For me both the campuses are nearly at equal distance from my home. (30km RR,35km EC)"
    },
    {
      "id": "iu91rni",
      "body": "yeahh true.. well all the best :)"
    },
    {
      "id": "iu96973",
      "body": "I know I'm being pessimistic here but who knows if combined placements with rr would continue till our time"
    },
    {
      "id": "iu96b3v",
      "body": "yos"
    },
    {
      "id": "iu96yq2",
      "body": "Chances of this happening is in negative lmao. Everyone from this campus will go berserk on Doreswamy 😂"
    },
    {
      "id": "iuent13",
      "body": "It's actually not THAT bad lmao, lotta people just go from home to class right back home, so it's pretty decent if you wanna just hang around in campus"
    },
    {
      "id": "iug78mt",
      "body": "nicee.. how's the food there?"
    },
    {
      "id": "iv21oq3",
      "body": "it's good, it's good...having like 7 canteens helps lmao"
    }
  ]
}