{
  "id": "yhaw8c",
  "title": "My views on PES ec as a fresher.",
  "content": "Some of the points I like abt pes e city compared to other colleges like(JSS, UVCE, MSRIT, DSCE, and NIE) are:\n\n* pooled campus\n* hackathons conducted on a regular basis\n* the crowd is less compared to RR branch\n* location(within the city compared to JSS and NIE)\n* neat and well-maintained campus and labs\n\n&#x200B;\n\nsome of the main problems which ppl might face are:\n\n* the hostels are just too far from the main campus, and way too small. The only solution is to take a pg nearby for the 1st year. There are so many PGs nearby, Maruthi, Stanza, Zolo, etc etc.  \n* the faculties are pretty new and not up to the level when it comes to experience and quality. So self-study is a must.\n* there are fewer fests and clubs compared to RR branch. Nothing can be done.\n* flooded campus sometimes. The drainage system is quite poor. Leave it to college to fix it.\n* The mess food quality ain't that great. A normal problem faced by every person in any hostel.  \n\n&#x200B;\n\nPlease let me know if any of the observations are wrong or different from ground reality.",
  "metadata": {
    "author": "More_Scholar6180",
    "url": "https://www.reddit.com/r/PESU/comments/yhaw8c/my_views_on_pes_ec_as_a_fresher/",
    "permalink": "/r/PESU/comments/yhaw8c/my_views_on_pes_ec_as_a_fresher/",
    "score": 10,
    "created_utc": 1667125231,
    "flair": "Pride Of PESU",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "iucs19e",
      "body": "I got this college in the first round, and your review seems to be worse than mine. Very very hesitant to go for this now."
    },
    {
      "id": "iucs6wf",
      "body": "same here, but jss is not an option for me, its just top 4 + pes ec"
    },
    {
      "id": "iucsgoq",
      "body": "I only want BMSCE ISE or MSRIT ISE now. That would be the best deal for my rank."
    },
    {
      "id": "iucsnm7",
      "body": "ahh makes sense, all the best bro"
    },
    {
      "id": "iucsph2",
      "body": ">there are fewer fests and clubs compared to RR branch.\n\nThere's only one cultural fest per campus if I am not wrong. Aatmatrisha for RR and Maaya for EC. Maaya is on Nov 11&12."
    },
    {
      "id": "iucsvjg",
      "body": "Same to you."
    },
    {
      "id": "iuct097",
      "body": "ayeee what abt the cet ppl then? this shit is so fucked :("
    },
    {
      "id": "iuct28v",
      "body": "CET first round and PESSAT second round people would've already joined by then"
    },
    {
      "id": "iuctb62",
      "body": "cet ppl can only join after 2nd round ri8? Or we can?"
    },
    {
      "id": "iuctigq",
      "body": "Idk much about how cet works. I thought it would be similar to how pessat counselling works"
    },
    {
      "id": "iucu19n",
      "body": "What's your rank?"
    },
    {
      "id": "iucu3m6",
      "body": "Nah man, we can only attended after 2nd round, thanks btw"
    },
    {
      "id": "iucuf4q",
      "body": "KCET 2232."
    },
    {
      "id": "iucum4s",
      "body": "Bmsce ise is at 1.3k now, do you think it'll go till 2k?"
    },
    {
      "id": "iucuo1l",
      "body": "I hope it does."
    },
    {
      "id": "iud2ukh",
      "body": ">the faculties are pretty new and not up to the level when it comes to experience and quality. So self-study is a must\n\nI'm from RR campus and some of the faculty here are pretty shit as well, despite being more experienced."
    },
    {
      "id": "iud8osq",
      "body": "I just graduated this year, so let me add my perspective:\n\n>the faculties are pretty new and not up to the level when it comes to experience and quality. So self-study is a must.\n\nAbout 70% of the teachers that taught my batch (2018-22) have left the college during the Covid lockdown as PES asked them to come to college and conduct online classes for some reason. On top of this, PES' management treats teachers almost as badly as the students. Pretty sad as some teachers were even better than RR; had come from BITS.\nHowever, the idea of any engineering college is to give you an introduction to a variety of fields available for further studies or jobs. So you will have to self study to dive deep into the field of your interest and work on your own projects anyways, to build your profile.\n\n>there are fewer fests and clubs compared to RR branch. Nothing can be done.\n\nFests:\nMaaya (EC fest) is nowhere near to Aatmatrisha (RR fest) in a number of ways. The budgets for each are exponentially different. Ex: 2-10 lakhs vs 40-90 lakhs\nPlus the management rarely helps out with Maaya, whereas AT gets their full support and networking advantages for sponsors.\n\nClubs:\nLast I checked there's about 60-70 clubs in RR, and 40 or so in EC. The thing is that clubs are relatively new to EC, they started with my batch in 2018. You're quite free to create new ones, if you wish to deal with the painfully trash management. The core reason for EC being less lively than RR is the students themselves.\nVery few people are willing to stay in college post 3:30 for rehearsals or events/performances as the campus is quite far for most and travel times are crazy in Bangalore.\nNot only that, the students love to complain about small things rather than try to make the best of what they have. A club puts in a LOT of effort to hold an event, and in the end the students don't turn up and the ones that do have the enthusiasm of a vegetable. (I've been a club head for all 4 years, so I've seen this way too much, sadly)\n\n>the crowd is less compared to RR branch\n\nUnderrated benefit of EC. The people are much more collaborative and helpful compared to RR that is competitive and try to put each other down.\n\nPhew, that was a bit of a rant lmao."
    },
    {
      "id": "iud9zo4",
      "body": "that was HELL of an effort, thanks for the info though. \n\n>Underrated benefit of EC. The people are much more collaborative and helpful compared to RR that is competitive and try to put each other down.\n\nreasons to join pes ecity"
    },
    {
      "id": "iudcnjr",
      "body": "Hey bro, i have freezed bmsce in round 1, but it is asking me to report to college, but when do I have to report properly, like classes and all, is it after 2nd round ?"
    },
    {
      "id": "iudg315",
      "body": "Cultural, yes.\nBut RR also used to have Prakalpa, Epsilon as well as TAS for science/technical fests and there are some cultural ones other than AT as well. \n\nThese are from pre-COVID times so most of them are not yet back. But yes, overall RR does/did have more fests."
    },
    {
      "id": "iudz472",
      "body": "GG"
    }
  ]
}