{
  "id": "yi2u1k",
  "title": "Pes EC Cse vs BMS AI vs MSRIT AI",
  "content": "So I have already gotten Pes EC Cse in round 1 of Kcet but i also have a chance of getting AI/ML in BMS and MSRIT in Comedk round 2. I've heard that Pes is very hectic and also that Ecity campus has lower fests too. Although, it is relatively chill in the latter colleges.\n\nBTW, will students of AI/ML branch be allowed to sit for Cse and Ece placements?? \n\nand also i might get ISE in BMS in mopup round of comedk. So please note that too.",
  "metadata": {
    "author": "Intelligent-Bend4949",
    "url": "https://www.reddit.com/r/PESU/comments/yi2u1k/pes_ec_cse_vs_bms_ai_vs_msrit_ai/",
    "permalink": "/r/PESU/comments/yi2u1k/pes_ec_cse_vs_bms_ai_vs_msrit_ai/",
    "score": 5,
    "created_utc": 1667197667,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "iugzqnv",
      "body": "Looking at branches only, I'd suggest CSE > AIML.\n\nAnd you said, PES is more hectic than the others. Placements will *mostly* be the same, since it's CSE with an AIML specialisation. So if you want to pick a slightly more balanced college life, I'd suggest BMS.\n\nYou need to tell us which you prioritise more - the branch or the college. If I were you I'd pick PES CSE. Not only do you get pure CSE and the chance to pick your own specialisation (and also pursue AIML if you're interested) but you also have great placements here (which are better than BMS last time I checked). But be prepared to be in for a very stressful college life if you join here."
    },
    {
      "id": "iuh0zpn",
      "body": "In mopup round, you don't have any choice to accept or reject the alloted seat, you will have to continue with the alloted seat  in mop up rnd. (BEWARE)"
    },
    {
      "id": "iuh3lzr",
      "body": "Any idea why the cutoff for the IT related branches in the top 3 colleges (COMEDK counselling) shoot up like crazy? (Other than the obvious shift of students to JOSAA, other entrances' counselling which took place early)"
    },
    {
      "id": "iuhas24",
      "body": "Lots of new branches have been added"
    },
    {
      "id": "iuhftcr",
      "body": "But the number of COMEDK seats are so less that such an obscene jump in cutoffs for the top 3 colleges shouldn't have been visible even with the addition of so many new branches."
    },
    {
      "id": "iuhyiso",
      "body": "I was considering BMS over Pes as in the end they're both branches in the IT field which will probably lead to a software job. And BMS seems nicer but then Comedk's a little expensive for us.. so I'll just go with Pes EC Cse in kcet. \n\nThanks for replying :P"
    },
    {
      "id": "iuhyze7",
      "body": "yea that's kinda why I was in a dilemma actually.. cuz I have a good chance of getting BMS ISE in Comedk Round 3 but then I'm not completely sure if i want to choose it over Pes CSE especially it being kcet nd has MUCH lesser fees."
    },
    {
      "id": "iui02py",
      "body": "It's maybe because Comedk's more of a \"backup\" option for most students unlike Cet or Jee exams. And by now, most of the engineering exams' counselling has long been completed, so a lot of people already got filtered that way. \n\nAnd its not just the top 3 colleges, thats how it is in almost all colleges. Lesser competition for now soo🤷"
    },
    {
      "id": "iuij9km",
      "body": "For the first part of your reply, I agree with it and infact I've already written that  as my understanding of the sky-rocket in the cutoffs.For the second part, I know it isn't only for the top 3 colleges but typically those colleges are really valued and over the years have witnessed a very low cutoff and very low increment in cutoff in the subsequent rounds as people were okay to wait for it as they would get a good college as a reward."
    },
    {
      "id": "iuilvgu",
      "body": "Yes the high drop in cutoffs is def a treat!!\n\nEspecially for the people who decided to wait it out and didnt tempt themselves into joining other exam's colleges."
    },
    {
      "id": "iuiohpd",
      "body": "Yeah ngl lmao  \nlike im pretty sure the person with a 3500 comedk rank never wouldve imagined to get an it related branch in msrit"
    },
    {
      "id": "iuqagxr",
      "body": "That is pretty much the only reason imo"
    },
    {
      "id": "iuqdfw0",
      "body": "fair enough"
    }
  ]
}