{
  "id": "yj13d9",
  "title": "Some queries regarding first year hostel in PES e city",
  "content": "1. do you have a uniform of any sort \n2. briefly describe about the food (veg, non veg, breakfast, lunch, dinner)\n3. toilets and water facilities (are they clean )\n4. do cots in hostel have matrices installed or are we supposed to get one\n5. laundry",
  "metadata": {
    "author": "AloneRice6234",
    "url": "https://www.reddit.com/r/PESU/comments/yj13d9/some_queries_regarding_first_year_hostel_in_pes_e/",
    "permalink": "/r/PESU/comments/yj13d9/some_queries_regarding_first_year_hostel_in_pes_e/",
    "score": 6,
    "created_utc": 1667284711,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "iull55z",
      "body": "Is this about the Amaatra Hostel or the campus one?"
    },
    {
      "id": "iull9b1",
      "body": "Amaatra one"
    },
    {
      "id": "iulmupl",
      "body": "Thanks"
    },
    {
      "id": "ium4ivf",
      "body": "Bro we are not supposed to get our own mattress"
    },
    {
      "id": "ium5xy1",
      "body": ">we are supposed to get our own mattresses\n\nLmao no.\n\n\n>But they are cleaned everyday so it's not as big a concern.\n\nNot a concern if you figure out the time they clean and go right after that, cuz some mfs do not flush."
    },
    {
      "id": "ium7fnh",
      "body": "How many share a toilet \nJust asking as I have never been in a hostel my whole life"
    },
    {
      "id": "iumv9x2",
      "body": "Around 20 stalls per floor, only 2 or 3 are decent enough to be used tbh"
    },
    {
      "id": "iumzy0a",
      "body": "1. No uniform of any sort unless you’re a girl (girls have to refrain from wearing shorts in dining areas and outside amaatra) \n2. Food is tolerable but you’ll get bored of it after a month or so , non veg is served on weekends and breakfast does have omlettes on certain days. There is tea and some sort of snack every evening but you need to get that before 5pm. I strongly recommend carrying food that you can store for midnight snacking as ordering from outside has limitations (wardens can restrict delivery’s after 8pm) \n3. The toilets are common for each floor with around 20 stalls and hot water is available at all times (though you have a higher chance of getting hot water in the evening right after college or sometime after 6:30 pm attendance) \n4. Cots are installed \n5. Laundry is collected once every week and you’ll get your clothes back ironed; but has certain limitations (do not send expensive clothes for laundry, wash those yourself there are washing machines on ground floor) \n6. Be extremely careful with your wallet! \n7. Lock your cupboards \n8. If you do carry any electronic appliances such as hair dryers or irons please keep them inside your cupboards the warden can be weird about that. \n9. Carry your own hand wash! \n10. Carry one thermos since people do fall sick regularly and you’ll need that for storing hot water \n11. Carry a charging extension since you’ll need that to charge your phone, laptop and any other appliance. Cheers! Hope this helps :)"
    },
    {
      "id": "iun15gd",
      "body": "Thanks \nBut that 6th point really scares me"
    },
    {
      "id": "iun1som",
      "body": "No need to be scared that’s just a precautionary tip, there have been incidents where people were negligent and placed their wallets out in the open and well the rest is history, since you’re an adult now it’s time to be responsible! Have fun first year is all about lessons :)"
    },
    {
      "id": "iurpc24",
      "body": "It's not about hostel, in general don't be irresponsible with your wallet."
    }
  ]
}