{
  "id": "yk1x0v",
  "title": "Can KCET college fees be paid ONLINE(net banking/card) or it can only be paid through challan?",
  "content": "qualifications:12 passout who got assigned a college through kcet round 1 and have accepted it.\n\nSo the recent circular states that fee should be paid by 4th november but there is no link for online payment yet. \n\nCan any of the previous kcet candidates tell if online payment exists or it is only through challan\n\nThanks in advance",
  "metadata": {
    "author": "Excellent-Let2022",
    "url": "https://www.reddit.com/r/PESU/comments/yk1x0v/can_kcet_college_fees_be_paid_onlinenet/",
    "permalink": "/r/PESU/comments/yk1x0v/can_kcet_college_fees_be_paid_onlinenet/",
    "score": 6,
    "created_utc": 1667386156,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "iuqufbt",
      "body": "Just paid the fees. These are the options I've seen my friends use:\n\n1) by cash at UBI/IB. It's done in 2 installments as money paid can't exceed 50k.\n\n2) online payment through your bank account or even UPI (for eg GPay has bank transfer option)\n\n3) applying for NEFT/RTGS transfer at the bank in which you have an account.\n\nAfter all this is done do get your challan signed/sealed in the nearest bank.\n\nI think card is possible...but I think you need to have an account in either of those  2 banks."
    },
    {
      "id": "iuqwgfa",
      "body": "Thanks for the reply\n\nCan you tell how you paid?\n\nAlso, if you know, for the online payment do you use beneficial account number given in challan or we can use direct pay?"
    },
    {
      "id": "iuqwpto",
      "body": "Cash.\n\nThe bank cashier basically handled everything once I paid the fees. They used the beneficiary account. It mentions our CET number (after that KUGET2xyz)."
    },
    {
      "id": "iuqx3ot",
      "body": "Thanks a lot"
    },
    {
      "id": "iur1x4t",
      "body": "There's a bank account number and details in your challan. Do a simple RTGS/NEFT/UPI online transfer for the amount mentioned, You will get your admission order within 1 hr post payment."
    },
    {
      "id": "iur2mg4",
      "body": "So we don't require the stamped challan when reporting to college?"
    },
    {
      "id": "iursnhe",
      "body": "No. Just get one printout of the challan"
    },
    {
      "id": "iuv2eju",
      "body": "U need to get it stamped by the bank. This is Compulsory."
    },
    {
      "id": "iuzyc45",
      "body": "Incase of online you just need transaction id and KCET payment history challan is not required"
    },
    {
      "id": "jzk66jh",
      "body": "Bro did you paid through online method\nDid college asked you for challan"
    }
  ]
}