{
  "id": "ymrrb0",
  "title": "sand syllabi of Ai-mla for first 4years except the first year please",
  "content": "",
  "metadata": {
    "author": "Sea_Mail_2026",
    "url": "https://www.reddit.com/r/PESU/comments/ymrrb0/sand_syllabi_of_aimla_for_first_4years_except_the/",
    "permalink": "/r/PESU/comments/ymrrb0/sand_syllabi_of_aimla_for_first_4years_except_the/",
    "score": 1,
    "created_utc": 1667649011,
    "flair": "Study Help :table:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "iv58xvt",
      "body": "Since it's the first year that the branch has been introduced, I'm not sure anyone will have the syllabus for it unless the college sent it around, which I don't believe they have."
    },
    {
      "id": "iv5cbb4",
      "body": "Which also means they're going to make the syllabus up as they go along lmao\n\nHuge risk of a branch if you've taken it this year"
    },
    {
      "id": "iv5cs4k",
      "body": "wait ai-ml got introduced this year???"
    },
    {
      "id": "iv5cxtk",
      "body": "is there some good ai-ml teacher or just cs teachers for ai-ml peeps?"
    },
    {
      "id": "iv5e5b0",
      "body": "There are *no good teachers* only left in PES, almost everyone left in the last 2 years. Also, domain specialisations really don't matter here for faculty, we've seen random teachers being made to teach (read as flip through PPTs) ML related courses. \n\nMost of them are not qualified to teach either and in a lot of cases some students are atleast on par with teachers when it comes to expertise in a field. Almost all the professors here are average at best and at worst so bad that they've been known to teach the wrong things.\n\nIn your 4 years here you'll probably encounter maximum 5 \"good\" teachers, that is if they also don't leave."
    },
    {
      "id": "iv5e8b3",
      "body": "Should've done your research OP :)"
    },
    {
      "id": "iv5g029",
      "body": "True:("
    },
    {
      "id": "iv5gacp",
      "body": "Any reason why the good teachers left if i may ask?"
    },
    {
      "id": "iv5gmz7",
      "body": "Sad boy hours"
    },
    {
      "id": "iv5h0k4",
      "body": "There's a more detailed answer on this subreddit about this but essentially the management here is pretty shit. Overworking professors, not listening to them, stubborn and non-sensical demands, weird grading and test schemes, etc. Almost all the good ones have left."
    },
    {
      "id": "iv5n4im",
      "body": "Legit shifted from ECE to AI-ML today"
    },
    {
      "id": "iv5tf7x",
      "body": "I missed aiml by a single seat. You shouldn’t have taken it bro"
    },
    {
      "id": "iv5zjxp",
      "body": "If PES is anything like other pvt colleges, this \"aiml\" branch is basically cse with ai/ml subjects in place of the electives a regular cse students can choose. He was in ece before so if he wants good placements it makes sense to take the cse related branch."
    },
    {
      "id": "iv5zq3k",
      "body": "bruh even i lucked out as there were only 5 seats remaining when it was my turn to choose.\n\n.\n\n.\n\n.\n\n.\n\n.\n\n.\n\n.\n\nsorry"
    },
    {
      "id": "iv5zwol",
      "body": "You saved yourself"
    },
    {
      "id": "iv619ee",
      "body": "from?"
    },
    {
      "id": "iv63iky",
      "body": "This answer will unfold as you complete all 4 years, each year providing you with more details"
    },
    {
      "id": "iv63y66",
      "body": "Yeah placements wise I agree - CSE > ECE. I did not comment on the placements point btw, I am talking about the entire branch and its subjects.\n\nBtw note - *most* major companies do **not** recruit ML/Data Scientists right out of college. Only startups do. Every other company will ask for at least a Masters or at least 2 years of experience. Even if OP pursues the AIML specialisation, they will likely end up in a SWE role only."
    },
    {
      "id": "iv66lvn",
      "body": "Lol even I wanted it because of how close it was for me"
    },
    {
      "id": "iv6anac",
      "body": "Looking forward to get closer to the truth（/｡＼)"
    },
    {
      "id": "iwbisiu",
      "body": "Can you please name a few good ones in CSE who have left so that I can find AV summaries or video archives made by them?"
    }
  ]
}