{
  "id": "ynm88x",
  "title": "RV CS(Cyber) V/S PES RR CS",
  "content": "\n\nI have gotten PES RR CSE in 1st Round of KCET.I am very confused about which branch to give more preference for KCET Round 2. I have looked at the syllabus of CS(Data) and AIML in RV. Both of them look very Interesting to me. They also have Wide Applications and many jobs.So I am pretty sure that I will put those above PES CS. But when I looked at CS(Cyber) Syllabus I saw that it is only about Networks and Security. I didn't find it very interesting. I am not sure whether I will be interested in Cyber in the future, I can't say for sure. It is a narrow field and has lesser jobs than the other two. So I am not sure whether to put it above PES CS. But on the other hand RV is a much better college than PES in terms of Brand,Alumni,Peer Group, Lesser Workload, 4 times lesser CS related Student Intake, Placements etc. All these factors about the college make me want to go to RV anyday over PES. Also I may end up liking Cybersecurity once I get to know more about it.So I am finding it very difficult to choose between the branch and the college. I would like to know your valuable inputs on my conundrum (confusion).",
  "metadata": {
    "author": "ATthebeast04",
    "url": "https://www.reddit.com/r/PESU/comments/ynm88x/rv_cscyber_vs_pes_rr_cs/",
    "permalink": "/r/PESU/comments/ynm88x/rv_cscyber_vs_pes_rr_cs/",
    "score": 3,
    "created_utc": 1667729355,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "iv9m49y",
      "body": "All I can say is just CSE holds the supreme power, as compared to its sister branches... Brand,Placements,World-wide connections, PES wins... while peer group and workload, Rv wins. Nevertheless, RV is kind of overcrowded with non KA peeps. Now comes the serious topic, sister branches in cse has been introduced frm this yr, you will be the first batch . Before you finalize, plz have a word with seniors, they are the best counsellor for you.\n\nWith honours, I request seniors to give a valuable input"
    },
    {
      "id": "iv9n4ds",
      "body": "PES RR CSE easy."
    },
    {
      "id": "iv9nxbf",
      "body": "Reason?"
    },
    {
      "id": "iv9q8tn",
      "body": "Placements, Branding, Quality of Students and profs, etc"
    },
    {
      "id": "iv9z5ja",
      "body": "cfbr"
    },
    {
      "id": "ive81pd",
      "body": "Cfbr"
    },
    {
      "id": "ive824i",
      "body": "Cfbr"
    },
    {
      "id": "ive82qu",
      "body": "Cfbr"
    },
    {
      "id": "ive82yy",
      "body": "Cfbr"
    },
    {
      "id": "iwbjrdi",
      "body": "RVCE is better than PES in all those aspects you mentioned, with the added bonus of less student intake."
    },
    {
      "id": "iwcv5de",
      "body": "Not for long."
    },
    {
      "id": "iwep876",
      "body": "Cfbr"
    },
    {
      "id": "iwep8v8",
      "body": "Cfbr"
    },
    {
      "id": "iwep9km",
      "body": "Cfbr"
    },
    {
      "id": "iweud4c",
      "body": "Yeah PES is going to be even worse because all the good profs have left and student intake is even higher this year."
    }
  ]
}