{
  "id": "ynp6hb",
  "title": "Any idea when 1st year B.Tech classes for KCET 2022 batch will start",
  "content": "Well I did receive an email from  ([no-reply@pesuacademy.com](mailto:no-reply@pesuacademy.com)) stating that classes will start from 7th Nov ,is it true.",
  "metadata": {
    "author": "iamnoobaf",
    "url": "https://www.reddit.com/r/PESU/comments/ynp6hb/any_idea_when_1st_year_btech_classes_for_kcet/",
    "permalink": "/r/PESU/comments/ynp6hb/any_idea_when_1st_year_btech_classes_for_kcet/",
    "score": 9,
    "created_utc": 1667739230,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "iva4bx4",
      "body": "Yep, it's true. In fact, I got another email regarding my section which again mentioned that college is starting tomorrow."
    },
    {
      "id": "iva74nb",
      "body": "What about those waiting for kcet round 2 ?"
    },
    {
      "id": "iva8lp3",
      "body": "So does anyone have any info regarding when to report to the college? If so, please share the details. Thank you for any advice."
    },
    {
      "id": "iva9mp8",
      "body": "How can they expect us to show up in such a short notice."
    },
    {
      "id": "ivadbac",
      "body": "It's pretty absurd. I don't think rationality is their strong suit."
    },
    {
      "id": "ivae0po",
      "body": "[Looks like I was close](https://www.reddit.com/r/PESU/comments/yksrzs/when_does_the_college_start_for_students_joining/iuv0d40)"
    },
    {
      "id": "ivaedhk",
      "body": "PES usually doesn't wait for all rounds of CET counseling to finish. Even before COVID and the delayed semester starting dates, the academic session for the year would usually start after the first round, maybe max second. \n\nBack then it used to start in the first week of August and we'd see new CET kids join every week until end of August/early September"
    },
    {
      "id": "ivaeis1",
      "body": "If it's your first day and have no idea about classrooms or blocks then show up at 8 to be safe. Not saying that you're going to get lost, but just in case you need help asking around and finding the place"
    },
    {
      "id": "ivaep9z",
      "body": "Oh, I was thinking we'd have to show up at 7 or something. Thanks for this!"
    },
    {
      "id": "ivaew4f",
      "body": "Nah 7 is too early. Even if you show up at 7 and need help I doubt anyone will be there to help lol. If you want to be safe you can arrive at 7:50. As long as you don't have any documentation process to complete in the morning, showing up at 8 is fine."
    },
    {
      "id": "ivaf11j",
      "body": "Except for uploading the profile photo, which I honestly have no idea how to, I'm all set(ig?)"
    },
    {
      "id": "ivaf86h",
      "body": "For us it was on the PESU Academy portal, so could be done online. Not sure if things have changed"
    },
    {
      "id": "ivafdtp",
      "body": "Okay, thanks a lot!"
    },
    {
      "id": "ivak8zz",
      "body": "Will it be an issue if I show up a day late.Also what will be done on the first day anyway"
    },
    {
      "id": "ivb1zkt",
      "body": "Dude my classes starting at 10 45 what do I do?"
    },
    {
      "id": "ivdxd5d",
      "body": "So ppl from cet round 2, 3 will come later ah?"
    },
    {
      "id": "iveh6rh",
      "body": "They started class from first day itself we have classes from 8 to 330 weekdays today introduction was done so nothing much but they are starting proper course from tomorrow"
    },
    {
      "id": "iveh8ki",
      "body": "No i know people who are also joining late they will have backlog most probably"
    },
    {
      "id": "ivfcxgs",
      "body": "Thanks for informing. \nBut how are we supposed to complete  our backlogs. Also have they provided all the course material / textbooks"
    },
    {
      "id": "ivfdakp",
      "body": "I don't know abt backlogs but the syllabus and textbooks needed are listed on the site and once you join you can acces question banks and lectures(pre recorded) most probably they might keep extra classee for you guys"
    }
  ]
}