{
  "id": "yttc77",
  "title": "which is better pes ec cse vs bms ece(aided)? i heard that in pes we wont get time to do competitive programming because of 5 isas and assignments.is it true?wont we have time to hang out with friends on weekends?",
  "content": "",
  "metadata": {
    "author": "Intelligent_Fun5739",
    "url": "https://www.reddit.com/r/PESU/comments/yttc77/which_is_better_pes_ec_cse_vs_bms_eceaided_i/",
    "permalink": "/r/PESU/comments/yttc77/which_is_better_pes_ec_cse_vs_bms_eceaided_i/",
    "score": 4,
    "created_utc": 1668319199,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "iw66fr6",
      "body": "Prefer the branch here. BMS is maybe a better college but why take ece if you're interested in cse? BMS will give you more free time but you'll have to manage the ece syllabus as well as cp/whatever. At least in pes ec you're studying cse. And all the assignments and projects you're gonna do in pes will be cse related and give you something to talk about in interviews. The only downsides to pes ec campus imo are location and fees(BMS ece aided fees must be very less I think).\n\n(This is just my opinion)"
    },
    {
      "id": "iw66vkf",
      "body": "but i heard that 5 isas system is too hectic and we will have zero campus life and fun  and not have time for cp"
    },
    {
      "id": "iw69fug",
      "body": "1st week in pes and it's super hectic, trust me"
    },
    {
      "id": "iw69taz",
      "body": "Hostel Life is fun"
    },
    {
      "id": "iw69woc",
      "body": "If u are systematic u can do everything"
    },
    {
      "id": "iw6bk1r",
      "body": "is it for real?then i will go to bms ece"
    },
    {
      "id": "iwc7h4w",
      "body": "It's true 5 isa system is hectic , but it has its advantages. One unit at a time(you are thorough with the portions) , questions are mostly mcqs which are way easier to score. I have seen many people grades increase due to the 5 isa system.\nIf you plan accordingly and manage your time it's not at all hectic."
    }
  ]
}