{
  "id": "yup6ok",
  "title": "With 5 ISAs, what's the formula for calculating CGPA",
  "content": "",
  "metadata": {
    "author": "Totally_for_academic",
    "url": "https://www.reddit.com/r/PESU/comments/yup6ok/with_5_isas_whats_the_formula_for_calculating_cgpa/",
    "permalink": "/r/PESU/comments/yup6ok/with_5_isas_whats_the_formula_for_calculating_cgpa/",
    "score": 5,
    "created_utc": 1668401314,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "iwalaxx",
      "body": "Also how tf do you study for 5ISAs with only two weeks gap. Seniors, do you write notes or just study the pdf?"
    },
    {
      "id": "iwatrw9",
      "body": "It doesn't depend on the number of ISAs. Your final grade for a course is a combination of ISA + ESA + assignments + project + etc combined in some weighted fashion. Grades are then assigned numbers with S grade = 10, A = 9 and so on. \n\nSGPA is a weighted average of grades in a semester where the weights are the credits for that course. So, \n\nSGPA = sum(credits for course * grade obtained in course)/total credits in semester\n\nCGPA is again a weighted average of your SGPA, where the weights are the credits in that semester. So,\n\nCGPA = sum(credits in semester * SGPA in semester)/total credits across all semesters\n\nSo you see, the number of ISAs doesn't really matter. You could have a 100 ISAs but only the final grade matters."
    },
    {
      "id": "iwatw01",
      "body": "Usually for ISAs the PPTs/notes are enough. People only refer the book for courses that involve numericals or problem solving (like math or civil) and go through it during ESA."
    },
    {
      "id": "iwbffqe",
      "body": "Yeah but I'm the type of guy to write notes rather than just read the pdf. I usually spend a day or two writing notes and i find this to be extremely time consuming.\nAlso why are electrical ISAs lengthy?"
    },
    {
      "id": "iwbi9n3",
      "body": ">Also how tf do you study for 5ISAs with only two weeks gap\n\nWelcome to PES. Syllabus is completed on the day of the ISA. So yeah, writing notes doesn't help. Watch the AV Summaries, read the slides and the notes provided in pesuacademy."
    },
    {
      "id": "iwbxel3",
      "body": "Fun story - the AV summaries and notes/slides are all new, implemented only from COVID. Until then, people including my batch only had whatever notes you wrote in class and the book. PPTs used to be shared 3-4 days before the test. \n\nUsed to be an overall bad scenario if you didn't write anything. I remember us taking pictures of any notes we could find and the day before the ISA the WhatsApp group would be filled with multiple pictures of different notes. Things have definitely become a little easier with earlier access to these resources. Back then it was a panic situation"
    },
    {
      "id": "iwby06h",
      "body": "Wow, they really do know how to lie, huh? I remember how it was last year, \"We have been recording our lectures and digitizing the content not only since Covid-19, but more than 3-4 years before that\"\n\nAt least did any of the good professors end up on the AV summaries?"
    },
    {
      "id": "iwbyzio",
      "body": "They have been recording, but there have always been issues with accessing it. In most courses they wouldn't be available. Besides in my second year that platform also got shut down so whatever was left was also gone.\n\nAnd yeah there are lectures from good professors, but I don't know how you'd access them anymore."
    },
    {
      "id": "iwc1ttp",
      "body": "There's something called Video Archives in pesuacademy containing old lectures. They seem fine, if only I had time for them, lmao."
    }
  ]
}