{
  "id": "yuy40z",
  "title": "What is the honest opinion of everyone in here about the 5 ISA system and the extra classes that come with it? 22 credits now have 29 hours of classes. ISA after every 2 weeks.",
  "content": "\n\n[View Poll](https://www.reddit.com/poll/yuy40z)",
  "metadata": {
    "author": "esinpe",
    "url": "https://www.reddit.com/r/PESU/comments/yuy40z/what_is_the_honest_opinion_of_everyone_in_here/",
    "permalink": "/r/PESU/comments/yuy40z/what_is_the_honest_opinion_of_everyone_in_here/",
    "score": 12,
    "created_utc": 1668429447,
    "flair": "Pride Of PESU",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "iwbwp8i",
      "body": "As the last batch to graduate without having given the 5 ISA system, can truly appreciate the timing of my graduation. \n\nIt really sucks that this is happening, unfortunately there doesn't seem to be a way out since it's been a year(?) since it was implemented. Only way out is to prioritise your targets, good time management and looking after your physical and mental health."
    },
    {
      "id": "iwc14a3",
      "body": "We get only 4 years to be in college. It seems a lot, but it's a very small amount of time. I have just 2.5 years as this semester is almost over.\n\nThere is no way we can manage our time. I want to do courses online, try to research with professors, etc. College is eating away a huge chunk of my time. I also want to do some club work. I have an okayish GPA and I wanted to improve that too.\n\nI had planned it all out correctly. It's just that PES loves to be the only thing in our mind. I wanted to finish off the assignments, lab work, and a bit of studying (if time permitted) in college hours, and then focus on doing courses, clubs, and research after 3:30 (also studying too). Planned on keeping weekends for studying and chilling to maintain my sanity.\n\n5 ISA system came, and it destroyed everything. No free hours, so everything has to be done after class, or weekends. Also, workload increased. Every course has 5 class tests/assignments, 5 ISAs, a project, other stuff, based on their liking.\n\nMy work gets piled up after classes and during the weekends. I don't get time to do anything. No time for courses and research. No time for clubs. I tried skipping sleep to compensate, but to no avail. Nobody can make any progress when there is 2 weeks of classes, a week of ISA, and again 2 weeks of classes. The constant interruptions are making me lose out on them too. I still skip sleep, but to do assignments now. Basically, a huge domino effect, and no one cares about it.\n\nMy grades aren't improving, I'm sleep deprived. I am pissed that I am not able to do anything that I love and the reason why I joined college. Due to this, my mental health is in the drain. I am burnt out. PES didn't even give us proper holidays after last year, and neither did I get any holidays between 12th and college. PESSAT kids wrote JEE Adv after college started. It's been nonstop ever since 9th grade started, and college doesn't make it any easier.\n\nIf PES' aim was to make us lose all hope on life and future, then mission accomplished, I guess.\n\nSorry for the rant. It's just that I needed an outlet."
    },
    {
      "id": "iweviaz",
      "body": "More than the 5 ISA, it's the 5-10 assignments per subject they are giving which is stressing me out. Fortunately after a lot of unanimous complaints in CCM, surprisingly they are going to decrease it it seems. They already cancelled the last 2 WT assignments."
    },
    {
      "id": "iwgr5nf",
      "body": "Already cancelled? I just submitted Unit 4 WT assignment, but there won't be any for unit 5."
    },
    {
      "id": "iwhbcq1",
      "body": "Yes, unit 5 assignment and the last self-learning assignment are cancelled."
    }
  ]
}