{
  "id": "yzrgv0",
  "title": "Doubt regarding seat surrendering",
  "content": "Hey, one of my friend is in Btech 1st yr CSE. He is likely to get a other clg CS/EC and is considering opting for Kcet seat. As far as I know, Now its too late to surrender the seat. Is it even possible (pretty sure, they will forfeit 1st yr fees.)\n\nWhat should he do?",
  "metadata": {
    "author": "_Unternehmer_129",
    "url": "https://www.reddit.com/r/PESU/comments/yzrgv0/doubt_regarding_seat_surrendering/",
    "permalink": "/r/PESU/comments/yzrgv0/doubt_regarding_seat_surrendering/",
    "score": 5,
    "created_utc": 1668906945,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ix240bz",
      "body": "The difference between pessat and kcet fees is massive. One year pessat fees would cover all 4 years of your kcet fees.\n\nAlso, from what i know, if you surrender your seat now, pes will cut 2k a day. So if you've joined the college 2 months back, pes will cut 1.2L.\n\nThis seems huge but it's a no brainer when your other option is paying 4.1L every year for something you can get for 1L."
    },
    {
      "id": "ix24lxr",
      "body": "In 2nd round counselling, they have mentioned that no refund will be given... So, I won't recover the other 2.9L from PES right?"
    },
    {
      "id": "ix25v6t",
      "body": "I'm not quite sure about that. You could try contacting pes's admissions office. You could visit there on Monday or you could dm me if you want their contact."
    },
    {
      "id": "ix2xr6m",
      "body": "Refund would have been given if you surrendered before November 2nd. Now you won't get any refund. I surrendered my seat on that date and lost 68k."
    },
    {
      "id": "ix2xuxt",
      "body": "That 2k per day thing was till November 2nd. After that, they lose the entire first year fees if they surrender their seat."
    },
    {
      "id": "ix2xz2h",
      "body": "Oh, i wasn't very sure about the deadline. Well even in that case, economically it makes sense to let go of those 4 lakhs and take the kcet seat."
    },
    {
      "id": "ix2y956",
      "body": "Yeah it will be a net profit in the long run but it depends on the college tbh. If it's not RV/BMS/MSRIT I would stay in PES through pessat. And if he's getting RV in kcet, he can get PES itself through kcet. Then I think the process would be different."
    },
    {
      "id": "ix327cz",
      "body": "Thanks for confirming..."
    },
    {
      "id": "ix3yqdf",
      "body": "Fight this in Court. They will be going against UGC Guidelines if they don't give u a refund inspite of u surrendering before the UGC Deadline. U should have known before that PES is very Money Minded. Fight them in Court and get your money back. I know a guy who got BITS Hyderabad But they weren't giving him Refund. So he fought it in Court and got it all back. Check with the UGC Authorities about this."
    },
    {
      "id": "ix57yj9",
      "body": "Last year, I almost got into RV CS through comedk. I had asked the university regarding the fee cancellation. They flat out told me that I won't get anything back. Then i brought up the UGC guidelines, and they immediately back tracked and arranged a meeting with the head guy in the admissions building (forgot his position, I think his name is Deepak)\n\nThere he told my father and I that the management will decide how much I will get back. I missed the RV seat, so yeah\n\nTell him to go to the admissions building and SHOW them the ugc policy. You'll get a meeting with the head"
    },
    {
      "id": "ixx7rbd",
      "body": "If the college is rv or better then go if not then stay simple"
    },
    {
      "id": "ixx86de",
      "body": "Bms and ms ramaya is not better than pes i accept rv"
    },
    {
      "id": "ixx8cnh",
      "body": "U have to pay 4 lakhs every year or 4+1 lakh every year"
    },
    {
      "id": "ixx905y",
      "body": "But bms / ramaiah through kcet is better than pes through pessat . The only thing pes has better is placements, but the roi is much more through a kcet seat even if the CTC is little less."
    },
    {
      "id": "ixywtxt",
      "body": "Ya just by fees not package"
    },
    {
      "id": "ixywyym",
      "body": "Future or present then I choose future"
    },
    {
      "id": "iyvu6ml",
      "body": "I face the same problem, posted here [https://www.reddit.com/r/PESU/comments/zc0wre/pesu\\_not\\_complying\\_to\\_ugc\\_2022\\_refund\\_guidelines/?utm\\_source=share&utm\\_medium=web2x&context=3](https://www.reddit.com/r/PESU/comments/zc0wre/pesu_not_complying_to_ugc_2022_refund_guidelines/?utm_source=share&utm_medium=web2x&context=3)\n\nThe UGC Fee Refund policy 2022-2023 mandating full refund until 31st December 2022 is published at [https://www.ugc.ac.in/pdfnews/3132446\\_Letter-reg-Fee-refund-Policy.pdf](https://www.ugc.ac.in/pdfnews/3132446_Letter-reg-Fee-refund-Policy.pdf)\r  \n \r  \nThe PES Fees Refund policy simply says that - Any refund here will be done as per current UGC refund norms only."
    }
  ]
}