{
  "id": "z171bf",
  "title": "What topics are recommended for making mini projects in 1st sem? [Read description]",
  "content": "What is better for mini project, only DBMS or games like Hangman or Connect Four that are linked to a database? \n\nWhich one ??",
  "metadata": {
    "author": "siri_gouri",
    "url": "https://www.reddit.com/r/PESU/comments/z171bf/what_topics_are_recommended_for_making_mini/",
    "permalink": "/r/PESU/comments/z171bf/what_topics_are_recommended_for_making_mini/",
    "score": 3,
    "created_utc": 1669057252,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ixain01",
      "body": "Fresher here, but hear me out.\n\nI too couldn't wait for the projects, so I asked my teacher about this, and she said though a list of projects will be given, we are free to choose our unique out-of-the-box topics. But I'm not sure as of what extent of features are allowed to be used (databases, integration with other languages etc)\n\nEdit: And yeah, this question was asked previously.\nhttps://www.reddit.com/r/PESU/comments/yxn3yg/first_year_python_mini_projects/?utm_source=share&utm_medium=android_app&utm_name=androidcss&utm_term=1&utm_content=share_button"
    },
    {
      "id": "ixc8vy0",
      "body": "Oh okay... As pygame is not included in the syllabus, is it advisable to do a GUI based project or should I continue with a simple DBMS project (just asking, I am really confused) \n\nAnd yes i saw the link, thank you for sharing that! :)"
    },
    {
      "id": "ixc929o",
      "body": "I think yes, you could do a GUI based project or a DBMS, coz I had a peek at a list of possible topics and found that the standard of questions is really high. So just go all-out!"
    },
    {
      "id": "ixcvktv",
      "body": "You can use pygame, but your marks come from using concepts in your syllabus. Making a fancy thing is nice but ensure to cover most aspects of your syllabus as well"
    },
    {
      "id": "ixdus40",
      "body": "Okay \nThank you so much for informing this!!"
    }
  ]
}