{
  "id": "z2ez1j",
  "title": "help :/",
  "content": "so i missed the kcet cutoff for pesu rr campus by 26-30 ranks. should i go for the second round extended? is it worth the wait? I currently got pes ec campus.",
  "metadata": {
    "author": "lostinthedark__",
    "url": "https://www.reddit.com/r/PESU/comments/z2ez1j/help/",
    "permalink": "/r/PESU/comments/z2ez1j/help/",
    "score": 11,
    "created_utc": 1669176805,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ixg4uyc",
      "body": "Yes wait for it, it's definitely worth it. Pes rr is still way better than ec campus, whatever people may say here. Ec campus is in the middle of no where with worse student quality. Look at the kcet cutoffs for each. Pes rr aiml is preferred over pes ec campus cse."
    },
    {
      "id": "ixgarm5",
      "body": "CSE with AiMl is first batch so could it be risky to prefer AiMl over CSE.\nCSE has more scope than Cse with AiMl ig."
    },
    {
      "id": "ixgazly",
      "body": "Aiml probably differs by only few subjects with regular cse. From placements pov it shouldn't matter much at all."
    },
    {
      "id": "ixgclqr",
      "body": "But it's first batch AiMl in Pes"
    },
    {
      "id": "ixgdt1y",
      "body": "Yeah many colleges have introduced new branches only to increase seats."
    },
    {
      "id": "ixggla1",
      "body": "I would suggest you to go for second extended rounds ."
    },
    {
      "id": "ixgk4l3",
      "body": "Bro do take part in the extension round, there are high chances of you getting a seat! \nAll the best!!! :)"
    },
    {
      "id": "ixgkd40",
      "body": "Do 1 thing. Choose option 2, which states: \"I am happy with this college, but I wanna push my luck more. So I'm locking this seat and participating in extended second round.\" \n\nIt's a win-win for you then."
    },
    {
      "id": "ixgkj3s",
      "body": "I agree with your statement, but when it comes to placements, we get the usual CSE ones AND the AI-specific jobs too. And yeah, AI is gonna be the future, so learn it when you can."
    },
    {
      "id": "ixgonea",
      "body": "any cons ?"
    },
    {
      "id": "ixgp63g",
      "body": "You'll have to pay the full fees now itself, and kea is infamous for delaying the extended round more than usual"
    },
    {
      "id": "ixgpmwx",
      "body": "how much of college will i miss, and can i catch up"
    },
    {
      "id": "ixgrmdz",
      "body": "Idk man, depends on when kea completes the 3rd round. And PES started the kcet batch on Nov 7th itself"
    },
    {
      "id": "ixgus0d",
      "body": "The con is that idk what procedure happens when you choose choice 2. Prolly you need to pay 10k or smth to lock seat. \n\nAnd yeah, what I told is what I saw in round 1. So it's better if you first wait for the 4 options and then take your decision.\n\nOne of my friend is also going with round 2, I'll ask him and tell you what to do."
    },
    {
      "id": "ixguxtb",
      "body": "Yes this is 1 thing. You will lag behind in portions a lot. But yeah, you have helpful seniors and people like venkat to help you out."
    },
    {
      "id": "ixh1634",
      "body": "Hey hey, I'm not a senior, I'm not even in pes any longer, joined rvce, but I'm trying for the extended round too, so just shared my research😁"
    },
    {
      "id": "ixh2lsz",
      "body": "Bro, how did you figure you are just 25-30 ranks short of pes rr CSE seat ? Is the 2nd round rank cut off published ? So share please"
    },
    {
      "id": "ixhjk2o",
      "body": "It's published on the kcet website. Go to admissions --> UGCET."
    },
    {
      "id": "ixhlwwj",
      "body": "Ahh i see, all the best for your future too!"
    },
    {
      "id": "ixidbix",
      "body": "Thanks man, you too😁"
    },
    {
      "id": "ixil499",
      "body": "AiMl is the future but it won't reach CSE's level anytime. Also it will take AiMl 7 to 8 years to start getting boom like CSE had in early 2000's."
    },
    {
      "id": "ixil8gr",
      "body": "To suck more money rather."
    },
    {
      "id": "iyfn5fa",
      "body": "isn't rvce the best? which college are you targeting now in the extended round?"
    },
    {
      "id": "iyh0c7a",
      "body": "I was trying to upgrade from cybersecurity to data science, and just got it today!"
    },
    {
      "id": "iyh21f7",
      "body": "Awesomee! Congrats :)"
    },
    {
      "id": "iyieh4w",
      "body": "Thanks :)"
    }
  ]
}