{
  "id": "z3er00",
  "title": "PESSAT VS KCET",
  "content": "Quick context, I joined PES through pessat quota , enrolled to the course CSE-AIML, during the second round pessat counselling, I got the opportunity to upgrade to CSE. \n\nIn kcet 1st round and 2nd, I got PES ECE in EC campus... Considering multiple reasons, I decided to leave the alloted seat and upgrade (I have entered 2nd extended round). I will get ECE here in rr campus. \n\nI am a bit worried abt opting ECE  (people have told that I am downgrading my course and stuff). I want to pursue masters. I have interest in coding as well. \n\nRequesting advice from my fellow seniors.",
  "metadata": {
    "author": "_Unternehmer_129",
    "url": "https://www.reddit.com/r/PESU/comments/z3er00/pessat_vs_kcet/",
    "permalink": "/r/PESU/comments/z3er00/pessat_vs_kcet/",
    "score": 6,
    "created_utc": 1669279132,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "ixliuq9",
      "body": "I'm a 3rd year student and i think the pessat fees have risen to 4 lakhs. If you're interested in ece, I'd suggest taking ece through kcet itself. Now if you're particular about cse and don't mind splashing 4 lakhs every year, retain your pessat seat otherwise i do think you can get cse in other decent colleges. Any college equal to or better than dsce is fine else i wouldn't really consider it.\n\nYou mentioned that you want to do masters and for that very reason i don't see why you should spend 4 lakhs a year on btech. If you do take up ece here, you can also take a minor course in cse which should be enough for you to do your masters in cse.\n\nI put your options here, it's your choice. Do whatever you want to and don't look back. All the best!"
    },
    {
      "id": "ixlix6r",
      "body": "Take ECE only if you have an interest/passion in the field. Many people take ECE cuz they don't get anything else and get screwed and hate themselves for it. If you're interested in coding and don't mind paying the pessat fees just stick to CSE rr campus through pessat. Not worth ruining 4 years for reduced money if you can afford it."
    },
    {
      "id": "iye1zb7",
      "body": "ECE is a good branch."
    },
    {
      "id": "iygkq90",
      "body": "Dude I got cse in extended round with a 9k rank EC campus"
    },
    {
      "id": "iygu27o",
      "body": "Crazy.. I got ECE in rr.. was really hoping for cse as 25 seats were left..."
    },
    {
      "id": "iygxysx",
      "body": "What is your rank?"
    },
    {
      "id": "iygyax3",
      "body": "Any idea rr cse cutoff?"
    },
    {
      "id": "iygz7wu",
      "body": "No idea, but for sure it is b/w 1333 and 4400.. My friend's rank was 1333, he got CSE from AiMl."
    },
    {
      "id": "iygz82t",
      "body": "4423"
    },
    {
      "id": "iyh4joj",
      "body": "General merit category?"
    },
    {
      "id": "iyh5dgx",
      "body": "yes"
    },
    {
      "id": "iymn1zr",
      "body": "Any idea on cse ec campus cutoff"
    },
    {
      "id": "iyutfxe",
      "body": "Depends I had a reservation cat and was a bit lucky so I did get cse with a 9k rank\nI think under 4500 rank might do well if you are GM"
    },
    {
      "id": "iyutlij",
      "body": "Nah I am not GM I got a reservation cat \nHence it went till 9k\nFor GM ig it might be under 4500 as it was almost 4000 in 2nd round \nCan’t be sure as official cutoffs aren’t out yet for extended round"
    },
    {
      "id": "iyuvv57",
      "body": "Bro..You are telling us very early..."
    }
  ]
}