{
  "id": "z9qb06",
  "title": "are the web teachers that good in ec campus?",
  "content": "So the other day i was showing my project to my teacher , she understood  the outline of the project, but she dint understand any part of react hooks or backend with nodejs and express js , so if there is a question in esa for me to write a code to take input and store it in a variable, will i get marks if i use react hooks instead of the traditional bind method and also  stateless components  are not part of portions like, so which ever i have used in my project can i write the same extra things in esa ? Will i get marks for it?",
  "metadata": {
    "author": "Fun-Understanding862",
    "url": "https://www.reddit.com/r/PESU/comments/z9qb06/are_the_web_teachers_that_good_in_ec_campus/",
    "permalink": "/r/PESU/comments/z9qb06/are_the_web_teachers_that_good_in_ec_campus/",
    "score": 3,
    "created_utc": 1669907523,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "iyi4cwk",
      "body": ">will i get marks if i use react hooks instead of the traditional bind method and also stateless components are not part of portions like, so which ever i have used in my project can i write the same extra things in esa ? \n\nProbably not :("
    },
    {
      "id": "iyi6ro8",
      "body": "well. depends. you prolly will even get an RR campus teacher to check your paper in ESA, since  sections of papers are distributed amongst all teachers in both the campuses. Personally, and this is sad, but just follow what they teach. not just for WebTech but for the other subjects as well. Its not worth taking the risk of writing something their not familiar with. Projects are fine, cuz they dont care as long as it works lol. But use whats taught cuz they dont know things other than that. Not just in EC but also in RR"
    },
    {
      "id": "iyi8cjp",
      "body": "Well then i dont think i ll pass this sem😂...coz the only thing i did well was my project apart from that nothing much, i gotta  re study these old concepts, it sucks that pesu is not adapting to new frameworks or new methods..they still use the common js way of importing a module not the es6 way😵‍💫"
    },
    {
      "id": "iyifgbc",
      "body": "Ok so did not really understand most of that but essentially, most professors here aren't very qualified or up to date with current stuff (as much as PES claims about it). They might only be aware of the existence of new technologies. Not just Web Tech, but pretty much almost every course. Most of them here just know the basics enough to teach them."
    },
    {
      "id": "iyl8d1e",
      "body": "No, you don't get marks, all the things currently used in react, don't expect teachers to know and understand them. Just stick to writing the old class-based functions and stuff to take input."
    },
    {
      "id": "iylwoq1",
      "body": "In which year do you have JavaScript?"
    },
    {
      "id": "iylwrpg",
      "body": "2nd year ,odd sem"
    },
    {
      "id": "iylwvcq",
      "body": "Oo interesting.."
    }
  ]
}