{
  "id": "zf3xwk",
  "title": "Question regarding clubs",
  "content": "First-year student here\n\nI have a club I really want to join (technical club) but I'm unsure if I will be accepted, so I was thinking of joining any similar club until they are available for recruitment. \n\nIs it ok to join a club as backup and leave it if you get your desired club or do you have to stay in the club till the year's end? I don't know if leaving midway (after 2-3 months) to join another club is frowned upon and gives a wrong impression to other people.\n\nI have been abstaining from joining any club in the hopes that my desired club opens recruitment quickly and if I fail to make it, I would just join another technical club. But now many technical clubs have already finished their recruitment process and I am becoming increasingly impatient and worried that I will end up 'club-less' at the end of the year.",
  "metadata": {
    "author": "Miserable_Goat_6698",
    "url": "https://www.reddit.com/r/PESU/comments/zf3xwk/question_regarding_clubs/",
    "permalink": "/r/PESU/comments/zf3xwk/question_regarding_clubs/",
    "score": 9,
    "created_utc": 1670427028,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "iz9z3dw",
      "body": "CFR"
    },
    {
      "id": "iz9zs27",
      "body": "Obviously as is standard procedure, you will be court-martialed in case of any attempt to betray your club and thereafter blacklisted from all ESAs. \n\nOkay seriously, nah man. Join as many clubs as you want. You're a first-year! There are no bounds! You'll figure out which clubs you like contributing to and which ones you don't. And it'll all kinda work out pretty organically!  \n\n\nSo yeah. Don't worry about it. Like I said, you're a first-year. Use the free time you have and join whatever clubs you want."
    },
    {
      "id": "izanuyv",
      "body": "Join any and all clubs"
    },
    {
      "id": "j05akij",
      "body": "You can, obviously, leave the club midway. It's not \"frowned upon\" or anything. It's not as serious as you think. Everyone respects where you want to put your time. \n\nRecruitments open every year, don't worry too much about being \"club-less\". \n\nBeing a part of clubs is good but you're not losing out on anything huge."
    }
  ]
}