{
  "id": "zhstl2",
  "title": "Elective 4 NAM/TDL",
  "content": "I'm gunning for a MIDS specialization and I am opting for NLP for elective 3 and I am pretty confused between Network Analysis & Mining and Topics in Deep Learning. I would really appreciate it if any senior can please provide any insight into what the courses are like in reality or have any words of advice for me.",
  "metadata": {
    "author": "herm7s",
    "url": "https://www.reddit.com/r/PESU/comments/zhstl2/elective_4_namtdl/",
    "permalink": "/r/PESU/comments/zhstl2/elective_4_namtdl/",
    "score": 8,
    "created_utc": 1670679579,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "izo2vji",
      "body": "Depends on how much work you’re willing to put in, I can definitely say NAM is easy enough if you’ve taken Graph theory in 5th sem since around 2 units are similar, however Nam is also quite theory heavy and while easy would require time. Afaik TDL can be considered an extension of Machine intelligence and if you enjoyed that subject you’d love this one too. (P.s. Word of advice - try to focus on getting your gpa up to the mark if it’s too low this sem, and to do that choose subjects that are comparatively easier such as IFS, AIR, Blockchain) \nAll in all a specialisation doesn’t help much from placements perspective but could help if you’re planning for a masters in the same field. \nBest of luck!"
    },
    {
      "id": "izovlss",
      "body": "General word of advice: you have a TON of work in 6th semester. You have Capstone to start off with. It's also your last semester to lift your GPA (companies start coming by July end and the CGPA used is your 6th sem CGPA, which means whatever you do in the next sem is your final one that matters for placements). Since final year barely has courses, it will not affect your CGPA by much so this is officially your last effort when it comes to improving it. Additionally, you also have placement prep (which I hope you all do) to do. If you aren't looking at a job, then it's going to be your future studies which again takes up a lot of effort and time with your tests and other stuff. Add the 5 ISA system with its multiple labs and assignments, you are looking at a semester with maximum importance to your career as well as degree with multiple things you **absolutely must** do well in, but less time. \n\nKeeping this in mind, I'd suggest you to take up AIR and DBT. They've always known to be the easiest (AIR is always the easiest and DBT is mostly DBMS stuff) and easy to get marks in. **Do not take up the ML related ones**- atleast during my time the courses were terribly structured, the syllabus was crammed with everything, and ofc the faculty aren't qualified to teach. Besides, they also have a ton of assignments and labs and some even require you to write an IEEE format paper. Too much workload for such an important semester. If you do not want to take up DBT, people usually take up NAM as the other choice. \n\nThis semester is all about being smart and taking the right decisions when it comes to all these things. If you're interested you can always learn these topics on your own, and 5 semesters at PES would have showed you enough examples of how experienced these professors are. Take easy electives, make your workload easier, get a better CGPA and give yourself time to focus on your placements/future studies prep/Capstone."
    },
    {
      "id": "izrs831",
      "body": "Is NAM much tougher than DBT?Or are they comparable electives?Also can you discuss about blockchain?"
    },
    {
      "id": "izx1i81",
      "body": "I really enjoyed TDL when I took it ~ 3 years ago. Like others said though I'd recommend it only if you're enjoying ML and looking to do more stuff within ML"
    },
    {
      "id": "j01hc9v",
      "body": "Thank you! I'm a little worried about the number of assignments included in the NAM course info and that it might be similar to Big Data's assignments. 😅"
    },
    {
      "id": "j01hd6j",
      "body": "Thank you so much!"
    },
    {
      "id": "j01hdro",
      "body": "Thank you!"
    }
  ]
}