{
  "id": "zn6iyl",
  "title": "Really important - please be aware",
  "content": "",
  "metadata": {
    "author": "SilicoFlare",
    "url": "https://i.redd.it/6jl376m5z66a1.png",
    "permalink": "/r/PESU/comments/zn6iyl/really_important_please_be_aware/",
    "score": 39,
    "created_utc": 1671166746,
    "flair": "Pride Of PESU",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "j0fcd8i",
      "body": "I remember this app being circulated even in my first year, glad to see it is still there lmao"
    },
    {
      "id": "j0ftocv",
      "body": "Yaa free Netflix it was supposed to give 😂."
    },
    {
      "id": "j0hplux",
      "body": "Glad ah?"
    },
    {
      "id": "j0jxds6",
      "body": "But in my class it was serious, a girl opened it during math class, and she started crying bitterly, coz she couldn't stop it..."
    },
    {
      "id": "j0kh3jl",
      "body": "Lol this happened in my class, and thankfully  the teacher was a ds teacher , she knew it wasn't his  fault😂😭,but i still dont get it, doesnt the app require some settings permissions to override do not disturb?"
    },
    {
      "id": "j0nnlf2",
      "body": "Playing media doesn't really depend on Do Not Disturb. All it does is keep increasing the volume to max and starts moaning like shit. I fished through the app's files and realised that the app doesn't even have an Indian origin, it's Chinese. The scripts were compiled .Lua files, so i couldn't read them.\n\nEdit: Who's a ds teacher?"
    },
    {
      "id": "j0o4e1t",
      "body": "Data structures teacher, ds is a course in 2nd year"
    },
    {
      "id": "j0qrprx",
      "body": "Oo okay"
    },
    {
      "id": "j1h57ql",
      "body": "I think you can open lua files in an editor. Lua is a programming language"
    },
    {
      "id": "j1hez8y",
      "body": "I know it dude, but the content in the Lua files are encoded in base 64. When I decrypt them, it just returns random non-renderable characters.."
    },
    {
      "id": "j240xrf",
      "body": "Bruh someone sent this in my college's groups too, under the title of 'phys midsem marks' lol"
    }
  ]
}