{
  "id": "zo5673",
  "title": "How tf do I study for WebTech ESA",
  "content": "I'm literally lost. I get that you're supposed to know Javascript, understand the concepts, be able to write code on your own but like fucking hell the slides are trash. Nothing is explained properly.   \nPlus I am able to understand the code but like when they ask write a jquery code to blah blah I'm lost.",
  "metadata": {
    "author": "bitchbetterhvmemo",
    "url": "https://www.reddit.com/r/PESU/comments/zo5673/how_tf_do_i_study_for_webtech_esa/",
    "permalink": "/r/PESU/comments/zo5673/how_tf_do_i_study_for_webtech_esa/",
    "score": 21,
    "created_utc": 1671279615,
    "flair": "Study Help :table:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "j0l1cfj",
      "body": "I got 25/60 in my first ISA when I tried to study \"normally\".\n\nRote-learned every single piece of code for the ESAs, scraped an A.\n\nDon't really recommend bc it's a trash way to understand but if your memory is good, then it gets the job done ;_;"
    },
    {
      "id": "j0l9kln",
      "body": "code from where??"
    },
    {
      "id": "j0nnk42",
      "body": "Back in my day (god I'm old), they had it all on the slides and didn't really give any questions beyond that."
    },
    {
      "id": "j0oz2eo",
      "body": "oh luckyy"
    },
    {
      "id": "j0pm0bt",
      "body": "Nah \"lucky\" was any batch before the 2023 batch. Our WebTech was split into 2 courses - WT 1 and WT 2 (with WT 2 being an elective, so was optional). WT 1 only had HTML, CSS, JS, PHP and was one of the easiest courses that semester, most people scored an A or at least a B. WT 2 had the remaining stuff\n\nGood times lol"
    },
    {
      "id": "j1087x0",
      "body": "Yeah i understand  this now, we did not learn php , we have react which has classes and functions, they have taught us entirely  classes only, but now react officials  have decided to remove classes, so 2023 batch is gonna have only functions🥸"
    }
  ]
}