{
  "id": "zp0dj3",
  "title": "library card",
  "content": "Do we need a library card to visit the library and to borrow books?",
  "metadata": {
    "author": "Rathrashwa",
    "url": "https://www.reddit.com/r/PESU/comments/zp0dj3/library_card/",
    "permalink": "/r/PESU/comments/zp0dj3/library_card/",
    "score": 2,
    "created_utc": 1671375274,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "j0pt1q7",
      "body": "You just have to take your college id with you"
    },
    {
      "id": "j0pxtoy",
      "body": "Can we borrow it to home? \nIf s, for how many days?"
    },
    {
      "id": "j0q3xm9",
      "body": "You can keep it for 14 days per book (3 books max), but now after the changed rules   \n*you can keep 3 books, as long as the fine-cost does not exceed Rs. 50.* ***But, when it crosses 50, it will start fining slowly.***   \nJust make sure, you keep renewing it, as and when you can"
    },
    {
      "id": "j0svksr",
      "body": "Not an answer to your question but just putting it out there -\n\nThe campus Mart (atleast until 2-3 years ago) has copies of most textbooks. Some of them are actual books and some of them are photocopies which you can buy. At the end of the semester you could even sell it back to the campus Mart and get your money back. A lot of people preferred this option over the library."
    },
    {
      "id": "j0t17x8",
      "body": "Oh that's quite nice.... Thank you"
    },
    {
      "id": "j0t2ida",
      "body": "Try and use softcopies of textbooks available ,at the end of the sem you won't be using textbooks only ,you'll be studying from slides mainly .\nDon't waste too much money on buying textbooks."
    },
    {
      "id": "j0ya871",
      "body": "I don't see many people doing that (taking books from Campus mart ) these days....😅"
    },
    {
      "id": "j0yatm4",
      "body": "Could be due to lack of awareness or that these books are all available as soft copies online."
    },
    {
      "id": "j13z5lw",
      "body": "Yeh"
    }
  ]
}