{
  "id": "zpkhfq",
  "title": "Did i mess up?",
  "content": "In today's esa, when i was typing, i toggled some shortcut by mistake and a new tab opened.I assumed to have closed the window by mistake and I clicked on the assessment icon and proceeded to entire my login details, i was able to login and the answers which I had written were still there. I wrote the paper and submitted. Now, when i closed this window, there was the older window which I toggled out of by mistake it had no answers in it other than the few i had written before toggling and the timer was ticking, so i just closed the window and didn't submit it. I'm damn scared that I've messed up big time and my answers wouldn't have submitted.",
  "metadata": {
    "author": "EscanorrSamaa",
    "url": "https://www.reddit.com/r/PESU/comments/zpkhfq/did_i_mess_up/",
    "permalink": "/r/PESU/comments/zpkhfq/did_i_mess_up/",
    "score": 8,
    "created_utc": 1671432594,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false,
    "type": "submission"
  },
  "comments": [
    {
      "id": "j0tk0tu",
      "body": "As far as ik each time you type anything in the answer box it is auto saved , unless you cleared the answer you had written you should not worry."
    },
    {
      "id": "j0tprsi",
      "body": "Thank You! This put me at ease. I hope all my answers were saved."
    },
    {
      "id": "j0tvlwb",
      "body": "Wait you opened a different window and nothing happened to the assessment?????"
    },
    {
      "id": "j0tvo1u",
      "body": "How bad was emft???"
    },
    {
      "id": "j0tvtnp",
      "body": "Yeah a new tab opened,i didnt realise the old tab was open in the background. But, i was able to complete the exam and submit it."
    },
    {
      "id": "j0tvx8t",
      "body": "So technically we could just open up a new tab and search for answers???"
    },
    {
      "id": "j0tw981",
      "body": "They can most probably monitor us"
    },
    {
      "id": "j0twj0a",
      "body": "They would have maybe come upto you if they could no???"
    },
    {
      "id": "j0twn0n",
      "body": "most probably it's because i didn't do anything on the new window other than click the assessment icon"
    },
    {
      "id": "j0z2ddt",
      "body": "Its all monitored lol. They can access which sites are being opened. Happened to a kid in my batch in first sem during ISAs, he had to leave the lab immediately."
    },
    {
      "id": "j1idxz6",
      "body": "Heard someone use a pendrive and copy, they took all slides and uploaded on the system"
    },
    {
      "id": "lanjo2u",
      "body": "Bro is this true"
    }
  ]
}