{
  "id": "10aoezc",
  "title": "what would be the minimum cgpa to be eligible for internships, and for placements, I'm a 4th semester cse student with 6.9 cgpa.It will also be helpful to know when we are expected to intern.",
  "content": "",
  "metadata": {
    "root_comment_id": "j45i935",
    "post_id": "10aoezc",
    "author": "Safe-Bee6680",
    "url": "https://www.reddit.com/r/PESU/comments/10aoezc/what_would_be_the_minimum_cgpa_to_be_eligible_for/",
    "permalink": "https://reddit.com/r/PESU/comments/10aoezc/what_would_be_the_minimum_cgpa_to_be_eligible_for/",
    "score": 5,
    "upvote_ratio": 0.8600000143051147,
    "created_utc": 1673594874,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "j45i935",
      "body": "To have a cgpa of 8+ at the end of your 6th sem, youu need to score upwards of 9.1 each sem."
    },
    {
      "id": "j45xrrx",
      "body": "Okay so technically you can get your internship from any semester. Companies start asking for you from mid 6th sem. And after that, in 7th sem, most of the companies come to college. That means you have about 2 sems to up your GPA. Usually 8 is like a safe space, where you'll be eligible for most companies, barring the biggest ones, like apple and stuff. You're expected to intern over the course of sem 8. Current rules suggest that you can either take up courses over sem 8, or you'll be graded on your performance at the internship\n└── > Usually 8 is like a safe space, where you'll be eligible for most companies\n\nWhile 8 is enough to *sit* for most companies, CGPA will still play a role when they shortlist for interviews. Usually something close to an 8.5 is considered a safe zone if you not only want to clear the cutoff to sit for the test but also have a good chance of answering all the questions and getting to the next round."
    },
    {
      "id": "j46o7cm",
      "body": "Can we Apply for Non-Tech roles like UI/UX Design,get a internship and still get Credits?\n└── Nope, each department has its own rules. CSE for example requires paid technical roles only.\n    └── Since my CGPA is around 7(6.96). I cannot apply for Internships On Campus. \n\nI heard that we need to have extra 6 credits. Since I have already done Summer Course, does that mean that I only need 4 Credits/do only a one-month Internship?\n\n&#x200B;\n\nI heard that we need to have extra 6 credits. Since I have already done Summer Course, so does that mean that I only need 4 Credits/do only a one-month Internship?\n        ├── Yes, alll summer courses are considered. So if you've already obtained those 2 credits, you only need 4 more credits. 2 weeks of work is equivalent to 1 credit, so you need to work 2 months\n        └── Which sem are you in.. and why can't you apply for internships on campus..\n            └── 6th.Because my GPA is below 7.\n\nAnd most companies coming now for internships ask for more than 7 gpa"
    }
  ]
}