{
  "id": "10qqofb",
  "title": "Capstone Project",
  "content": "Respected seniors, I'm in my 6th and I'm confused a lot about which topic to choose, how serious is capstone's novelty. And how serious is this should I focus more on placements or this project? Will they give a very low grade if I don't do something new for the project?",
  "metadata": {
    "root_comment_id": "j6rvjld",
    "post_id": "10qqofb",
    "author": "whocares4269",
    "url": "https://www.reddit.com/r/PESU/comments/10qqofb/capstone_project/",
    "permalink": "https://reddit.com/r/PESU/comments/10qqofb/capstone_project/",
    "score": 5,
    "upvote_ratio": 0.8600000143051147,
    "created_utc": 1675249403,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "j6rvjld",
      "body": "Hey there. Depending on which stream you are currently in (Cs, ece etc) you'll have a variety of projects which are already defined by your profs. Unless it's too late and all projects of choice have been picked up, you can definitely define your own project. \n1) Doing this keeps you away from all the nonsense work that has already been done for past few years. \n2) The point of capstone is to demonstrate the process of scientifically forming a problem statement on a relevant subject , working on Lit- survey, making models (working, in many cases ), and in general skills you have learnt.\n3) try to get a prof who is known to be peaceful and will guide you as best as they can ( this is very rare, some may not be very knowledgeable but they are nice, the other half is not that great but are knowledgeable) .\n4) Capstone is not something that can absolutely ruin your grade and placements chance, but is something important for credits.\n\nDon't worry too much, I've seen lots of people make it through just fine.\n├── On average what's the worst grade you can get for capstone can you fail?\n│   └── You can fail capstone.\n│       └── How!!??\n│           └── Lot of reasons. You are assessed periodically throughout 6th and 7th semesters in which you need to show significant progress from the previous assessment. If you don't show, you get a low score. If you keep getting low scores and don't impress the panel with your work, you're looking at a low grade. Along with that, if your work isn't great, your project doesn't show any novelty value etc are also reasons for low grades. People are also graded individually in a team, so it's possible for one person to get an A and another a B in the same team. If the panel realises that one person hasn't contributed, they'll penalise that member.\n│               └── Absolutely, this was the case in my team. We were only 3 members from the beginning instead of 4 , so we had to buck up. Things like these puts that pressure on you that forces you to take action. All of us got individual grades. The panel absolutely knew who did what and accordingly graded us. \n\nYour knowledge and practical experience matters a lot, but you shouldn't neglect the relationship between yourself and the panel. Building that from the first or second year is something I did and it helped me.\n│                   └── How did you find this comment from 2 years ago xD\n├── What happens when we're not able to choose any topic? (Like our ideas are rejected by panel) will they suggest a topic?\n│   └── Maybe they will suggest something, but it will be something generic. Don't take the risk of accepting that project.\n└── Can you elaborate point 4 ? It doesn’t ruin placement? We got scolded really bad today\n    └── Like rowlett said, you can fail a capstone project. I've seen an instance where seniors were still presenting their project to the HOD a year after they were supposed to have passed out of college.  A lot of factors can affect this. Your guide can be  the cause, your teammates etc. I don't have any context on why you got 'scolded' today so I can't really say anything about that \nFor placements, it's not only the project itself that counts, its how you perform in your exams, develop your network and find better opportunities. You may even get multiple offers in different tier companies.\n        └── No I meant, will failing capstone not let you sit for placements ?\n            └── I think so, because it might be considered a backlog. I'm not very sure of this, you might have to check with someone from faculty."
    },
    {
      "id": "j6v6iqv",
      "body": "There's already a good answer here but I'll add my views as well.\n\nIf you're in CSE, the novelty can be a major factor since almost all projects are research based and require you to publish your work at a conference at the end of 8th semester. Novelty also will help you boost your grade and also give you a little buffer room during panel reviews based on the fact that you're trying something that isn't documented before and is purely experimental. But novelty is a major factor in your project's final grade and can affect it a lot towards the end. I've seen people getting low grades for simply recreating existing work on their own, so you need to ensure that there is atleast a 10% novelty factor in what you're doing. Regardless of whether it actually works or not, make sure something novel exists so your grade does not get penalised. \n\nAs for placements vs project - you really cannot choose here. You need to do well at both. Placements for obvious reasons and Project because it contributes to 10 credits. This is a massive portion and can affect your CGPA significantly. Ideally, you'd want to make maximum progress during your 6th semester and the summer following that, so it gives you more room to prepare and sit for placements during 7th sem. Making more progress early on will also give you room to experiment things in your project, and also some time off during weeks you can't work on your project due to other factors (like ISA/ESA). You'll need to find a way to manage both, both as important."
    }
  ]
}