{
  "id": "10sa2z8",
  "title": "credits",
  "content": "on what basis credits are given",
  "metadata": {
    "root_comment_id": "j70f19f",
    "post_id": "10sa2z8",
    "author": "Rathrashwa",
    "url": "https://www.reddit.com/r/PESU/comments/10sa2z8/credits/",
    "permalink": "https://reddit.com/r/PESU/comments/10sa2z8/credits/",
    "score": 3,
    "upvote_ratio": 1,
    "created_utc": 1675395659,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "j70f19f",
      "body": "Let me start from the basics so you understand\n\n1. To obtain your degree, you need to gain a certain number of credits across the 4 years of study here. This number for my batch was 160 and ideally should remain the same for you as well. If you don't get 160 by the time graduation arrives, you simply won't be given your degree.\n\n2. These 160 credits are then distributed among courses. You would have noticed that some courses will have 5, 4 or 2 credits. \n\n3. Each course will have a certain credits required, which will be awarded once you pass the course. Which means as long as you get above an F grade, you will pass the course and get those credits at the end of that semester. You either pass and get the full number of credits in that course, or you fail and you get 0, there is no partial credit. Since there is no concept of \"failing a year\", you can essentially fail all your courses in a year and still move on to the next year, but you would not have earned any credits.\n\n4. Some courses are mandatory, meaning you will have to pass them and get those credits while some of them (electives and special topics) aren't. If you withdraw from a course you'll need to make up for credits. You cannot skip out on mandatory courses. \n\n5. Credits are also obtained via internships pursued at the end of 3rd year and in 8th semester. The details of how this conversion is made aren't relevant to your question so skipping it for now. Additionally, you can also take up some extra courses beyond the official curriculum to add credits. Note that there is no concept of early graduation at PES, so even if you finish BTech a year early they'll make you stay so there is no advantage from a time or financial point or view.\n\n6. Credits also play a role in your SGPA and CGPA calculation. [You can check my previous answers for a detailed breakdown of how it's calculated](https://www.reddit.com/r/PESU/comments/yup6ok/with_5_isas_whats_the_formula_for_calculating_cgpa/iwatrw9).\n\nThis should be pretty much everything\n├── thank you so much\n└── ![gif](giphy|ZfK4cXKJTTay1Ava29)\n\nThank you"
    }
  ]
}