{
  "id": "110ajmi",
  "title": "How hard is it to increase your cgpa in higher sems ?",
  "content": "At the rate the things are going right now , I might end up with an 8  at most",
  "metadata": {
    "root_comment_id": "j887ild",
    "post_id": "110ajmi",
    "author": "Jaded-Opposite7770",
    "url": "https://www.reddit.com/r/PESU/comments/110ajmi/how_hard_is_it_to_increase_your_cgpa_in_higher/",
    "permalink": "https://reddit.com/r/PESU/comments/110ajmi/how_hard_is_it_to_increase_your_cgpa_in_higher/",
    "score": 6,
    "upvote_ratio": 0.8700000047683716,
    "created_utc": 1676189287,
    "flair": "Study Help :table:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "j887ild",
      "body": "It goes downhill mostly"
    },
    {
      "id": "j894etu",
      "body": "I'd say depends on your branch, but I can answer for CSE\n\n* 1st year is usually a great way to lay the foundation of a good GPA. The subjects are mostly easy and people tend to do well. There are lesser course deliverables as well as other responsibilities/activities/factors do not exist at this point. Whatever you get as your CGPA at this stage will roughly be the benchmark around with your GPAs will fluctuate in the future.\n* 2nd year is when things slowly ramp up. Courses get a little harder, the number of course deliverables can almost double, but overall I would say the difficulty does not exponentially increase. A lot more time however is taken away by the newly added deliverables per course, so lesser free time for yourself. This is the last shot you have at making drastic improvements to your CGPA, since you are halfway through your degree and there are lesser chances of improving in your control\n* 3rd year is by far the worst year for almost everyone. Way too many course deliverables, courses are much, much harder compared to the last 2 years. Additionally, you also have other things on your plate such as the Capstone project (which is worth a good portion of your credits), regular placement tests and prep (unless you prep, you really cannot expect yourself to get an internship over the summer with just college syllabus), and any other work for your future higher education which will start this year (Masters applications, getting LoRs, research into Unis etc). Overall, a lot of people do not improve their GPA here (and a lot of them get way lesser than their previous years). This year is all about maintaining your CGPA as much as possible. If you ask anyone in CSE, this is by far the most stressful, painful, energy draining year in your degree.\n* 4th year is relaxed, but depends a lot on how you handle things. You barely have courses, and they end before 8th semester. You have capstone project to work on and regular placement tests. If you don't get placed quickly, the stress and tension tends to build for obvious reasons and can ruin your mental health. If you are planning higher education, the stress related to that also will be at its peak. However the issue is that you cannot expect significant improvements to your GPA anymore at this stage. The courses barely affect your GPA, since their credits are just 2 each. Capstone project can be a hit or a miss, depending on the effort you put in and the panels you get (but most people tend to do well). Your internship grade is largely out of your control since your manager's feedback is used to assign you a grade, so you can't say for sure that you are going to do well. Mostly people increase their GPA by 0.1-0.3, not more in this year.\n\nIf you are looking at an 8 at the end of first year, you will probably end up between a 7.6-8.6 at the end of all years based on usual trends. It will require something astronomically different levels of effort and consistency to push that 8.5 to a 9+ if that is what you are aiming at at the end of your degree\n└── Ah shit I better do well on my second sem then . Appreciate the help !!!\n    └── hello , please suggest me over , IT at RV vs CSE at PES vs CSE at MSRIT"
    },
    {
      "id": "j95azde",
      "body": "Interesting views by u/rowlet-owl in his comment, most of which I agree with - especially regarding the course load distribution across the years. \n\n&#x200B;\n\nBut OP, don't be disheartened by thinking that you won't be able to recover your GPA after the first few years. In fact, contrary to rowlet owl's example, I was looking at an 8 in my first year and ended up comfortably above 9 by the end. This was the case with at least a handful of my friends too. 8 in first year to late 8s/early 9s by the end is perfectly capable. \n\n&#x200B;\n\nI would like to add that 2nd year was the key for me and most of my friends. Try to get as high a GPA as possible in sem 3 specifically and you'll be looking at a good average overall. \n\n&#x200B;\n\nGoodluck!"
    }
  ]
}