{
  "id": "110r88y",
  "title": "Literature Survey procedure",
  "content": "What's exactly should our literature survey contain and will it be reviewed by a panel every isa? Should literature survey compulsory contain how we want to do the project?",
  "metadata": {
    "root_comment_id": "j8aqxgp",
    "post_id": "110r88y",
    "author": "whocares4269",
    "url": "https://www.reddit.com/r/PESU/comments/110r88y/literature_survey_procedure/",
    "permalink": "https://reddit.com/r/PESU/comments/110r88y/literature_survey_procedure/",
    "score": 4,
    "upvote_ratio": 0.8399999737739563,
    "created_utc": 1676238405,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "j8aqxgp",
      "body": "Your literature survey consists of papers and reading material that is relevant to the project you're doing. It's frustrating because PESU profs do not explain the relevance of it. \nIt is very important to keep up to date on your research as you do not want to reinvent the wheel. It is also useful to develop ideas from techniques that other researchers are proposing. If you're in a fast developing \"in the scene\" topic, it can be useful to keep up to date with what people and experts around the world are focusing on. How to do a literature survey?\nLearn to make critical notes of papers you're reading. Start with the abstract - is the paper something relevant? If yes, go through the introduction, methods, and conclusion. If you need more resources, try that papers literature survey section or their references. \nKeep a Google doc/word doc/notepad of the notes and papers you're going through. PESU is not going to CHECK your literature review, but a keen professor might ask you about the references you used. Understand them we'll, as they can form the fundamentals to your research. \nI cannot emphasize on this - DOCUMENT. DOCUMENT. DOCUMENT. If you read 50 papers, you might forget something important. Make notes. \nLiterature survey is endless, sometimes boring, and sometimes confusing. It takes time to get a grasp of it, but realisation of its importance comes with time. For your second question, say you're using x to achieve y, it is vital to identify other work where they've used x on y, or x on z, or w on y. Literature survey, in the late game of your research can be used for comparison of your work with existing work. \nYour report will have a large section on literature review.\n└── So what exactly happens in the review?\n    ├── In the review by the panel?\n\nThey're going to ask you what kind of work you read, where say you wanted to achieve x, and you talk about how these papers worked through the same thing. A review by your panel is a sanity check to see that you're not jumping off a tangent into a rabbit hole, which is possible if you aren't in touch with relevant literature.\n\nFor your general literature review?\n\nYou definitely talk about the background of the work done. Here's an example, say your Capstone Project is to use mushrooms to build a house. First, you will talk about existing materials used to build a house, and why society/your community needs to explore other methods (i.e. disadvantages of the existing methods). You also talk about how mushrooms have been used for XYZ purposes and why you think that it might be a good idea to use them to build a house. Then, you talk about existing attempts to build a house using mushrooms. After this section is where I like to introduce why my method of house construction using mushrooms is effective, by stating that \"the following disadvantages were observed, and to overcome these drawbacks, this work proposes a novel/alternative method of house construction using oyster mushrooms.\" You can alternatively talk about the conclusion of your literature review, and then start off with your method of construction.\n\nI'd be happy to connect with you on DM if you need any more help on this :)\n    └── You have to explain your understandings from various papers and also point out the advantages and disadvantages of a particular method which the authors used. Compare various papers. Come out with the best approach to solve your problem.\n        └── A literature survey is the BEST source of comparison and sanity check that you can get easily"
    }
  ]
}