{
  "id": "111xenl",
  "title": "How do you maintain GPA",
  "content": "We keep hearing that companies hire based on cgpa and 8.5-9 is the number to run after. But considering how my math sem 1 esa(which is the first one) went today I'll be getting a 7/8 in math. How do people honestly score enough to secure a 9 everytime?",
  "metadata": {
    "root_comment_id": "j8hd9ry",
    "post_id": "111xenl",
    "author": "Previous_Locksmith_1",
    "url": "https://www.reddit.com/r/PESU/comments/111xenl/how_do_you_maintain_gpa/",
    "permalink": "https://reddit.com/r/PESU/comments/111xenl/how_do_you_maintain_gpa/",
    "score": 6,
    "upvote_ratio": 0.8100000023841858,
    "created_utc": 1676362090,
    "flair": "Study Help :table:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "j8hd9ry",
      "body": "First sem math is hard, I think by 7/8 in math you mean c grade it is perfectly fine if you get c as well. I had c as well in first sem math, right now I am in 4th sem and my cgpa is a bit above 9 . \n\nI think I remember vice chancellor saying 8.5-8.75 is easily enough so just focus on other remaining ones. \n\nSem-2 math is easier btw\n└── Engineering mathematics-2 you mean?\n    └── Yes\n        └── Good to know that💀"
    },
    {
      "id": "j8hybv7",
      "body": "Oh, Math 1 is a bloodbath. This is going to sound like a brag but the only time I've gotten less than an A was in Math 1, and that was a C. Don't take this exam as the standard for question papers lol, it's basically academic hazing xD\n├── What topics are there for sem 3 math?\n│   └── Uh, depends on your stream. In CS, you will have a statistics course and a course on the theory of computation. Other departments have EM3, which I believe covers a bit of statistics and some complex analysis.\n└── That's kinda relieving to know. But is it possible to get a good gpa with other subjects . I mean how did u manage a 9 in everything else. I have about an estimated 43+ in internals.\n    └── Wait internals are out of 50 right? 43+ is amazing.   \n\n\nAs for getting a good GPA, tbh dude, I can't help you there. The method honestly varies from person to person. In general though, I find that writing stuff down helps me remember theory better, and just as many problems as possible for more practical subjects.\n        └── I guess the thing I'm ultimately worried about is there any scope of scoring in the other 5 subs ESA to bring sgpa up. I'm scared shirtless since afternoon about this 😂😅. Because ppl also say it's tougher to increase gpa in further sems and the first 2 form the basis of it.\n            └── Football is played on grass and exams are written on paper, friend :3  Go give it your best shot, and if you mess up, THEN reassess your strategy."
    },
    {
      "id": "j8l7hme",
      "body": "Bros calm the fuck down. I know people who have a gpa of >7 and are still getting hired by companies. Yes, gpa is a boost and gives you an advantage. But it doesn't guarantee you a job. Work on your knowledge and that's much more important. Also a tip for you juniors: start networking on LinkedIn rfn, and, learn as much as you can. \n\nTo answer your question, study a week before exam bro, lowda also you won't study everyday. Idk what branch you are in but get used to math if you're an ece lad."
    }
  ]
}