{
  "id": "1130nm8",
  "title": "esa questions bubble filling",
  "content": "I did not bubble up any of  the questions that I attempted in my maths esa so will I be marked 0 for the subject's esa",
  "metadata": {
    "root_comment_id": "j8nehwt",
    "post_id": "1130nm8",
    "author": "Awkwardab1304",
    "url": "https://www.reddit.com/r/PESU/comments/1130nm8/esa_questions_bubble_filling/",
    "permalink": "https://reddit.com/r/PESU/comments/1130nm8/esa_questions_bubble_filling/",
    "score": 9,
    "upvote_ratio": 0.9100000262260437,
    "created_utc": 1676475046,
    "flair": "Study Help :table:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "j8nehwt",
      "body": "Yes\n├── Has it ever happened with any of your batchmates as I know a couple of people more in my class who have done the same mistake ?\n│   └── Not bubbling the questions is as good as not attempting the question.\n└── Unrelated to the main question, but will bubbling every page for the same question cause an issue, or should you bubble only at the start of a question?\n    ├── U have to bubble the next page too for the same question if your answer stretches till the next page\n    │   └── Are you sure about this? Didn't they tell in the Auditorium on Friday that the next page needn't be bubbled if it's the same question. The omr would consider it as the continuation of the the previous question.\n    └── Ideally, you should bubble the start section, and the section at the top of a page if it goes to another page. That is why it is always suggested to start questions on a new page if you know it will exceed a single section.\n\nBubbling extra does not usually cause issues, I had done it by mistake a few times, but not bubbling anything essentially means not attempting the question.\n        ├── So in that case I have 39/50 in isa so I think I would fail\n        │   └── I'd say don't worry too much about it. If you haven't bubbled anything at all they'll probably choose to manually process your answer sheets. Regardless, apply for a review when the results come out to view your corrected answer script.\n        │       └── so I typed out all my answers in today's exam, and because i was confused ended up bubbling some of those questions on my answer sheet too (those pages are blank except for the bubbling). would there be a problem for those questions?\n        └── I have a query, what do you mean by \"a single section\"?"
    },
    {
      "id": "j8oasmg",
      "body": "Bro get it corrected but requesting some teacher\n└── Yeah I would request in the  examinations control centre"
    }
  ]
}