{
  "id": "114dlc4",
  "title": "attempted all the questions on the system in ESA, but also bubbled them in the answer sheet",
  "content": "Will I get 0? I wrote all my answers in the computer. In the last five minutes due to some confusion I bubbled some questions on my answer booklet. So my answer booklet is blank, but all those questions are bubbled. Did I fuck up? Will those questions be evaluated or will I get a 0 for them?\n\nI asked an invigilator and they said it won't be an issue, but I need more confirmation.",
  "metadata": {
    "root_comment_id": "j8vpbvn",
    "post_id": "114dlc4",
    "author": "throwawayeet31",
    "url": "https://www.reddit.com/r/PESU/comments/114dlc4/attempted_all_the_questions_on_the_system_in_esa/",
    "permalink": "https://reddit.com/r/PESU/comments/114dlc4/attempted_all_the_questions_on_the_system_in_esa/",
    "score": 5,
    "upvote_ratio": 1,
    "created_utc": 1676618884,
    "flair": "Study Help :table:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "j8vpbvn",
      "body": "Same doubt"
    },
    {
      "id": "j8vps5y",
      "body": "They evaluate both the system and the booklet answers while correcting so you're all good dw\n└── Thank you! I was very paranoid about this lol."
    },
    {
      "id": "j8wcnnq",
      "body": "You need to bubble all questions u attempt anyway ig, or atleast that's what we were told, regardless of where u do it, and yes they check both\n└── Wait really? Our invigilator said there's no need to bubble if you've typed it directly\n    └── Idk lol, ours was the first batch with hybrid, i mean like to give the exams maybe they themselves were confused ,which they definitely were"
    },
    {
      "id": "j8wf50e",
      "body": "The invigilator told me to bubble Every question even though I wrote most in the system. So i basically bubbled them on blank pages. So yeah i think we should be fine\n└── I bubbled only half of the blank pages though, because by then the invigilator said there was no need to do it. So even the bubbling i did only half. Shouldn't be a problem right? I mean they check our typed out and written answers simultaneously and then tally marks right\n    ├── Ya since they check both system and booklet there wouldnt be any issue at all but it's weird that the invigilators gave different instructions\n    └── If ur invigilator explicitly said so i don't think it should be a problem. I have the same issue, where i did everything in blue pen instead of black pen on the first exam as the invigilator said i could."
    }
  ]
}