{
  "id": "11743k7",
  "title": "Serious Study Help",
  "content": "I have shitted the whole First semester might be scoring somewhere between 5 or 5.5 gpa what should I do ahead for my second semester which will be starting from 6th March\nAlso how much CGPA/gpa should I try to maintain for upcoming semesters?",
  "metadata": {
    "root_comment_id": "j9airqi",
    "post_id": "11743k7",
    "author": "HotFix7183",
    "url": "https://www.reddit.com/r/PESU/comments/11743k7/serious_study_help/",
    "permalink": "https://reddit.com/r/PESU/comments/11743k7/serious_study_help/",
    "score": 12,
    "upvote_ratio": 1,
    "created_utc": 1676891612,
    "flair": "Study Help :table:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "j9airqi",
      "body": "I got 9.96 SGPA in the 1st semester. Currently pursuing my second semester and I did this in the first semester:\n\n1. Actually listen in class (My teachers were great)\n2. Submit assignments/research work on time. (I did all the assignments on my own which somewhat helped)\n3. I focused more on ISAs and tried to get good marks. (A senior suggested that I get good marks in assignments and ISAs as ESAs are gonna be tough).\n4. I kept notes for subjects which I felt were hard.\n\nThese were some of the things I did. Honestly, I believe it depends on your course. ATB!\n(Questions are welcome!)\n├── Mine is BTech CSE EC campus, will my placements and career be affected?\n│   └── I'm a final year student in the same branch and campus. And nah, doesn't affect shit. It's just your GPA and skill that matter for placements :)\n│       └── How much should I try to maintain from next semester onwards?\nAnd I'll be having chem cycle in next sem so should i go for 8.5 to 9?\n│           └── Yes. You definitely should. Getting your gpa higher is much much harder than getting it low. Few wrong sems and you're as good as gone.\n\nSo prepare well and give it your best. Maintain atleast 8+ overall gpa and start competitive coding. You'll get placed somewhere!\n│               └── So by the end of 6th sem I should get 8.5 plus avg gpa\n│                   ├── Considering you get a 5.25 SGPA, You have to get 9.15+ SGPA to make sure you get an 8.5+ by 6th sem\n│                   └── 4th sem ideally. Companies start coming for summer internships (summer between 3rd and 4th year) before 5th sem ends, and throughout 6th sem. You won't have your 5th sem results when they start coming, so you'll need your 4th sem results. Same way you'll need your 5th sem results in 6th sem.\n├── Adding to this - consistent efforts are what is required. You have to do well in almost everything to do well here.\n└── Holy hell 9.96!!"
    }
  ]
}