{
  "id": "11764fd",
  "title": "PES innovation labs",
  "content": "How do you apply for it ? Is there some minimum cgpa requirements ? What are the benefits of joining and what kinds of projects are done? How competitive is it ? Do alumni and teachers guide students to do research?",
  "metadata": {
    "root_comment_id": "j9ek776",
    "post_id": "11764fd",
    "author": "Geekwalker374",
    "url": "https://www.reddit.com/r/PESU/comments/11764fd/pes_innovation_labs/",
    "permalink": "https://reddit.com/r/PESU/comments/11764fd/pes_innovation_labs/",
    "score": 3,
    "upvote_ratio": 1,
    "created_utc": 1676898203,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "j9ek776",
      "body": "a) You wait for the recruitment test for the summer internship to be announced. Membership is granted only by completion of the internship.   \n\n\nb) Nope, no minimum CGPA requirements. If you have backlogs, you might have to figure out a schedule with the club, but this shouldn't be too much of a hassle.  \n\n\nc) PIL is probably the oldest club on campus (and definitely the oldest technical club) so it has a really close community + alumni still interact w the groups. You also gain a lot of technical knowledge from the internship that a lot of people at that stage don't. A list of projects can be found here: [https://pes-innovation-lab.github.io/web/projects/#](https://pes-innovation-lab.github.io/web/projects/#)  \n\n\nd) Last time, the total number of registrations across three years of engineering students was 887. Out of this, maybe 24-25 second years and 10-15 first years were selected.  \n\n\ne) Most summer projects are offered by seniors in the third/fourth year. While professors may sometimes offer projects, the point of the internship is to build a student lab. Weekly lab-wide meetups will also see alumni (some of whom are PhD scholars) provide inputs on each team and project.\n└── Thanks. What is asked in the test ?\n    └── Exact pattern keeps changing. However, based on what was asked in the past, it will mostly be basic aptitude + some elementary math or electronics or CS based entirely within what is taught in 11th/12th (for math) and your first year syllabus (for the other two). It'll mostly be pretty simple; the test is just a filter. A more rigorous interview is conducted later.\n        ├── Is the interview conducted by students or professors or someone else ?\n        │   └── Students. Like I said, it's a student-run lab through and through. The two professors (Dr Rajasekar and Dr Venkatarangan) are there for guidance and support but the legwork and direction of the club is entirely student based\n        └── Shaata"
    }
  ]
}