{
  "id": "118928s",
  "title": "How much of an average should you have in ISAs (+assignments) out of 50 to stay safe, in case you screw up your ESAs?",
  "content": "ESAs aren't going well. I need to know what average will salvage your SGPA somewhat. By salvage I don't mean an astounding SGPA, just what is required to at least keep it bare minimum - above 6.85-7 range.\n\nFor context - my averages are 35 up for most subjects, 40 for about two subjects. How screwed will my SGPA be, considering that my ESA marks are going to be low?",
  "metadata": {
    "root_comment_id": "j9fx2jl",
    "post_id": "118928s",
    "author": "throwawayeet31",
    "url": "https://www.reddit.com/r/PESU/comments/118928s/how_much_of_an_average_should_you_have_in_isas/",
    "permalink": "https://reddit.com/r/PESU/comments/118928s/how_much_of_an_average_should_you_have_in_isas/",
    "score": 5,
    "upvote_ratio": 1,
    "created_utc": 1676997571,
    "flair": "Study Help :table:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "j9fx2jl",
      "body": "How low you are expecting? In the range\n└── Above 40 hopefully. That bad. Especially for maths because... well, you know how the maths esa went :')\n    └── Chill bro you'll be scoring like 7 or 8 gpa then"
    },
    {
      "id": "j9gnlbq",
      "body": "Only you can know how badly or nicely you have given your esa. But based on the info you have given of internals, your max is 40 . Which means you won't be getting any S grades. Best advice if you want to know is, take a worst case score for the esas and calculate your sgpa. You would then get an estimate on what to score for the others. Cheers and good luck."
    },
    {
      "id": "j9iaiqp",
      "body": "Since you mentioned that you're going to get 40 atleast, let's assume that as the minimum. That would mean you would be getting 20 in the ESA component. Assuming you have 35 in the remaining 50%, that's roughly 55 as your final score in the course, or a D grade.\n\nGetting all D's in a semester is approximately a 6 SGPA. You're looking at a 6±0.5 SGPA with those scores"
    }
  ]
}