{
  "id": "118z512",
  "title": "Shaded all the bubbles properly on my answer sheet, but I didn't write the question numbers in that little box",
  "content": "This is actually for an esa on monday. I realised today that I didn't write any of the question numbers inside the little box, though I DID shade all the question circles properly. Went to the COE's office and someone from there said it won't be a problem, but I'm asking over here just to confirm once more (and to see if anyone else has done the same mistake).",
  "metadata": {
    "root_comment_id": "j9jrqo9",
    "post_id": "118z512",
    "author": "throwawayeet31",
    "url": "https://www.reddit.com/r/PESU/comments/118z512/shaded_all_the_bubbles_properly_on_my_answer/",
    "permalink": "https://reddit.com/r/PESU/comments/118z512/shaded_all_the_bubbles_properly_on_my_answer/",
    "score": 3,
    "upvote_ratio": 1,
    "created_utc": 1677073201,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "j9jrqo9",
      "body": "Shading is all that matters rest is for your reference\n└── ah okay, thank you!!"
    },
    {
      "id": "j9k20ce",
      "body": "Where is the coe's office in the ec campus as I also had a query\n└── it's in the mech block third floor!\n    ├── Thanks\n    └── And where's the mech block??\n        └── It's beside the Main block where B.com classes happen (Earlier it was for Mechanical engineering but now Mechanical engg is removed from EC campus)."
    },
    {
      "id": "j9m0nxc",
      "body": "I'm sorry...what little box are we talking about? Cuz I have only been shading the question circles\n└── left to the circles there's a little box with *very* tiny print that says write the question number. I would have missed it too, but an invigilator had pointed it out to me while I was writing the maths esa.\n    └── i'll keep an eye out for it in mech, thanks :D"
    },
    {
      "id": "j9n2mmn",
      "body": "They didn't tell anything about the box on the day the explained about the esa guidelines, so it should be ok ig"
    }
  ]
}