{
  "id": "11bh54e",
  "title": "Tips for second sem",
  "content": "So I am now going to be in the chem cycle for second sem. I messed up phy cycle quite badly, although I was determined to do well :((\n\nPeople say that chem cycle is the easier cycle, what makes it easier? Which are the harder subjects? Is math harder than first sem ? Can u guys give me tips on how to manage each of the subjects ? Are slides sufficient or do you need textbooks as well ?",
  "metadata": {
    "root_comment_id": "j9y693b",
    "post_id": "11bh54e",
    "author": "Geekwalker374",
    "url": "https://www.reddit.com/r/PESU/comments/11bh54e/tips_for_second_sem/",
    "permalink": "https://reddit.com/r/PESU/comments/11bh54e/tips_for_second_sem/",
    "score": 6,
    "upvote_ratio": 1,
    "created_utc": 1677318165,
    "flair": "Study Help :table:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "j9y693b",
      "body": "Chem-Slides are enough for ISA and ESA but keep revising\nElectronics-Easy if you love the subject, slides and notes are enough but you can refer book for extra juice\nMechanics-Meriam book is the only thing you need\n\nNow give tips on how to learn physics, mechanical, electrical\n└── 😂😂 Ok. Physics refer Faisal sir's slides from discord, they contain everything taught in the lectures. If u have someone like RV Iyer sir or Raghavendra Rao sir as your teacher, pay good attention in their class, they r good. Raghavendra Rao sir' s laser AV summaries r good. Refer Authur Bieser textbook for reading and problems, although those given in PESU academy r good enough as well. Practicing proofs is very important.\n\nElectrical - Vadiraj sir slides, they will be on PESU academy, even his AV summaries are there, he explains very well. Infact all electrical AV summaries r good. It's pretty logical, so if u get the hang of it u can easily solve questions.\n\nMechanical - U may have a little trouble as none of the teachers r that good. A textbook by Gopalakrishna is recommended by teachers and it is quite helpful. Slides and notes r good enough for studying. U will be asked many diagrams in ESA, so practice those well. Pray to not get KJ as ur teacher 🤪😂\n    ├── Can you send the discord link?\n    │   └── https://discord.gg/DkWpKEfCUG\n    ├── Kj is really good tbh, I wouldn't mind him for next sem too\n\n![gif](giphy|Fu3OjBQiCs3s0ZuLY3|downsized)\n    └── Wait kj teaches mechanical also? We are dooped\n        └── Hahah yes, he is terrible at it. He was currently teaching EC campus ppl mechanical after his brief stint in our class.\n\nDo you know how vbs teaches ?\n            └── vbs is fine he does all the necessary stuff but he can get very strict sometimes and you cant predict it\n                ├── What about any other teachers in chem cycle?\n                └── Very strict ah? Man goes nuts, that's more apt"
    },
    {
      "id": "j9yaw6y",
      "body": "Mechanics will be your nightmare .. Telling this after today's ESA.. ISA will be dead easy as questions will be directly from textbook, rather with the exact same values. But ESA trust me none of the questions from ISA were asked , numericals were a bit towards harder side with more calculations . 20mk theory is guaranteed\n\n&#x200B;\n\nElectronics : One of the most easiest subjects, its simple physics , direct questions and ISA and ESA too will be super easy so peace.\n\n&#x200B;\n\nChemistry: Very Bulky .. and by that I mean it, not the first 2 chapters but definitely from 3rd onwards, give little time for chem atleast once in 2 days , it will surely help.\n\nChem lab: Pray to god you get ground floor laboratory , as teachers are super-friendly , and if you have any doubt regarding some experiment ask, don't end up doing wrong and getting out of the world values. for every sci-lab graph make sure you put for srn and scale. Keep your record up-to-date every week.\n\nConstitution: Mug up the question set, beware few questions have incorrect answers..\n└── Ok some more tips - \n\nFor EVS slides r good enough. First 2 units are pure general knowledge, so u can ace those ISAs without studying as well. Many ppl in my class used to ace EVS without studying. But study properly from 3rd unit and mug up stuff as well.\n\nPhy lab - If u have RV Iyer sir himself as your lab instructor, u will be lucky, he's rlly good at explaining and demonstrating. Other instructors are not that good, many don't even know what they r teaching, many just come and copy readings in their classes. I used to see Iyer sir personally disciplining them 😂. So u may need to manage in that case.\n\nPhysics first 2 units are going to be hard, but other 3 are pretty manageable. Practice Faisal sir's slides, they will be rlly useful"
    },
    {
      "id": "j9yudqs",
      "body": "For chemistry, plz pray that u don't get VBS for lab or theory or both, If u do(unfortunately) avoid him as muxh as u can\n└── Why ?\n    └── U will get to know\n\n![gif](giphy|XVbQsIjdXDNyswwxOO)"
    },
    {
      "id": "ja6ixf8",
      "body": "This is for chem cycle (ec campus)\nChemistry- not as easy as it seems at the start. Isas can be managed even if you mug up one day before the exam. But in esa every unit has so much to learn that it would become difficult. If u get rvm sir it's great as he gives 19-20 marks in assignment and project to almost every student provided u submit the assignments and lab record.\n\n\nElectronics- pay attention in class. Do well in the 2nd and 3rd units and u are set for a 25+ score out of 30 in isas.All profs are good enough as far I have heard. \n\n\nMechanics - maximize your isa score as much as possible as isa is pretty easy but esa is quite difficult for mechanics. Neither of the profs are upto the mark"
    }
  ]
}