{
  "id": "11bl4c1",
  "title": "Technical Error during ESA",
  "content": "Yep, you heard that right, all systems went blank during today's ESA and we had to wait for around an hour to get the hardcopy of question paper, during that time, I lost my momentum and you can say kind of fell of the track, Still managed to complete the paper. I wanna know if there is some way we can report this to COE and try to get some grace marks?",
  "metadata": {
    "root_comment_id": "j9yedke",
    "post_id": "11bl4c1",
    "author": "_Unternehmer_129",
    "url": "https://www.reddit.com/r/PESU/comments/11bl4c1/technical_error_during_esa/",
    "permalink": "https://reddit.com/r/PESU/comments/11bl4c1/technical_error_during_esa/",
    "score": 21,
    "upvote_ratio": 0.9700000286102295,
    "created_utc": 1677332017,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "j9yedke",
      "body": "Lmao, they'll never give grace marks unless the question itself is wrong."
    },
    {
      "id": "j9ypr3x",
      "body": "You won't really get grace marks for losing \"momentum\". As someone else said - grace marks are given if and if there is a mistake in the question paper."
    },
    {
      "id": "j9ytdo9",
      "body": "Bold of u to assume they gonna give us extra marks, they would blame it on u for loosing ur \"momentum\" and they wouldn't be responsible for it\n\n![gif](giphy|11mwI67GLeMvgA)\n└── To be fair.. yeah.. I was wrong to assume that"
    },
    {
      "id": "j9ytyrl",
      "body": "yep guys, I get it.. I knew it was a bad idea to ask this..\n└── Did the answers you wrote in the system before they crashed get erased or were they saved?\n    └── No idea, I knew that there was technical issues since past 3 days, thats why I avoided typing my answers\n        └── Same here didn't even touch the keyboard except for entering SRN"
    },
    {
      "id": "j9z6hjg",
      "body": "Did it happen only at your room or for all students? If it was for all students they won't even consider giving grace marks\n├── It happened for everyone\n├── for everyone\n└── Even if it happened for only one person don't expect grace marks. As long as they gave you back the time lost, its fair enough in their eyes\n    └── They did give us extra time, we got 45 mins extra🙃"
    },
    {
      "id": "ja20edq",
      "body": "Wait... There was a technical problem even before this. We physics cycle students wrote exam with question paper. Why on earth did they risk all that just for one more exam? They could have given off question paper only ryt"
    }
  ]
}