{
  "id": "11d7oy6",
  "title": "do we have any vacations?",
  "content": "",
  "metadata": {
    "root_comment_id": "ja75e70",
    "post_id": "11d7oy6",
    "author": "Totally_for_academic",
    "url": "https://www.reddit.com/r/PESU/comments/11d7oy6/do_we_have_any_vacations/",
    "permalink": "https://reddit.com/r/PESU/comments/11d7oy6/do_we_have_any_vacations/",
    "score": 8,
    "upvote_ratio": 0.9100000262260437,
    "created_utc": 1677490234,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "ja75e70",
      "body": "Since the academic session has been kind of screwed up because of COVID related delays the past 3 years, the usual session calendars aren't followed for first years.\n\nUsually, the odd semester lasts from 2nd week of August to last week December, followed by roughly a 1.5-2 weeks break. Then again from January till May last week for even semester, followed by roughly a 2.5 month break until mid August again. \n\nIf the usual session calendars are followed you get roughly 2.5 months in the summer and about 10-14 days in December, apart from the other ones thrown around here and there during the year. If you're in first year, it's possible after this year ends you'll finally get a proper academic session as it used to be.\n├── Well for us 1st sem ended in Feb, 2nd sem starts on 6 march......soooooooo when can we expect the mythical 2.5 month vacation\n│   ├── You don't!\n│   └── That's the neat part, *you* don't. But all the other years students which started their sessions on time will get this long vacation.\n\nThe ordinary session schedules are followed only if your odd semester is Aug-Dec and even semester is Jan-May. Any delays will simply eat into your summer and any other vacation days. Which is also why college is rushing your semesters so your 2nd year can hopefully start at the same time as they normally start.\n\nDon't expect holidays this first year. You're unlucky to have been affected by COVID delays. Looks like this year (2023) new incoming students will hopefully start their session in August and the normal session timings will be followed by all years\n│       └── Rip\n└── Do you think for the '27 batch 3rd/5th/7th sem will start in August itself? The 1st sem is anyways starting in 1st/2nd week of Aug.\n\nFor personal reasons I might not be in the country for a few days in July and I heard another alumni say odd term starts July so I'm worried..."
    },
    {
      "id": "ja86ztf",
      "body": "Vacation in PES ah?\n\n![gif](giphy|11mwI67GLeMvgA)"
    }
  ]
}