{
  "id": "11juyfm",
  "title": "Does your board marks matter for CSE?",
  "content": "The website says a minimum 50% is required, but I heard some people saying for getting into CSE no matter what your pessat rank is, you need to have 80% for pcm in 12th boards. Is this true?",
  "metadata": {
    "root_comment_id": "jb4kbo3",
    "post_id": "11juyfm",
    "author": "spankdank50",
    "url": "https://www.reddit.com/r/PESU/comments/11juyfm/does_your_board_marks_matter_for_cse/",
    "permalink": "https://reddit.com/r/PESU/comments/11juyfm/does_your_board_marks_matter_for_cse/",
    "score": 6,
    "upvote_ratio": 0.8799999952316284,
    "created_utc": 1678097962,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jb4kbo3",
      "body": "No i had 62 in pcm\n├── Did you get in through management or through pessat?\n│   ├── Pessat bro my rank was 2800 got CSE in EC campus\n│   │   └── Is the ec campus any good?\n│   │       ├── Not really, is very strict, stricter than rr campus. It's stricter than most schools to soum it up precisely\n│   │       └── Well, the infrastructure is wayyyy better compared to RR, teachers are from what I've heard more bearable than RR. RR only trumps over EC in terms of experience and it being the main campus and all gets the most attraction.\n│   └── You preparing for pessat\n│       └── Yeah I am\n│           └── Don't just prepare for pessat prepare for jee of you don't get them come to PES\n│               └── I may not get the 75% pcm in boards for jee that's why I'm preparing for pessat. What level is pessat compared to mains?\n│                   └── Didn't they remove this criteria from last year?\n│                       └── I'm not sure, also do you have a detailed syllabus for pessat? I can't seem to find a reliable one.\n│                           ├── I don't think so there exists a proper syllabus for pessat, just do your 11 and 12 ncert it's enough but you have to be quick especially in English and logical reasoning part\n│                           └── PCM ncert/jee will be enough\nEnglish they'll ask meaning of words, synonyms, antonyms, passages and all\n├── Bro what’s the avg package of cse in pes?\n│   └── If you consider only CSE then ig it is around 13 to 14 lakhs in PES\n│       └── Dayum\n└── Hey can you please tell me if board percentage affects placements, I know everyone needs 60% at least to sit for campus placement but do good companies have a much higher cutoff for 12th for cse in pes?\n    └── I'm in sem 2 i have no idea\n        └── Do let me know the answer as well"
    },
    {
      "id": "jb4min2",
      "body": "Nope, pessat matters a lot. Do well in your pessat, get a good rank and you have a chance of CSE. Bear in mind that CSE is very popular and getting it is difficult. But don't give up hope. You also have the chance of upgrading your seat in the second round of counseling if you don't get CSE in the first round\n└── What exactly happens and gets asked in the counseling?\n    └── Now how this works is pretty much like an AUCTION\nTwo days will be dedicated for the first round of counseling\nEach day will be divided into sessions\n\nFirst session is for students having a rank around 1-1200\nSecond session is for students having a rank around 1201-4000\nThird session is for students having a rank around 2401-3600\n\nThat concludes day 1\n\nDay 2 is for students who.....didn't do very well, ranks upto 3601-5000 are given a chance\n\nWell, let's say you get a rank 2361 something\nSo you're in the second session of the first day\nWhen you are called, you'll have to select your Engineering course.\n \nNow bear in mind, I'll assume you want CSE in RR campus, now this is highly contested and I'm 99% sure the seats are gone when you come for your counseling. Don't worry, choose your second favourable engineering course and stick with it. After a few weeks, the second round of counseling will happen where students can either change their seats or give them up.\n\nEven if you don't get your favourite seat in the second round, you have three options:\n\n1. Management (if your pockets are deep....sure)\n2. Work hard and get an SGPA of 9-9.5+ for both 1st and \n    2nd sem. (Not suggestible, because getting that \n    much SGPA is easier said than done and this also \n    depends whether seats are available for switching.)\n3. Major-Minor\n        └── Thank you, do the ranks above 1200 have a guaranteed seat?\n            ├── Can't say about CSE in RR but EC? For sure\n            └── I'll tell you this year's cutoff\nRr campus\nCse was like 1400 something after second round\nCSE with AiMl was 1900 (approx)\nEC campus\n3100 for cse\nThe reason for such increase is because of introduction of cse with AiMl and my fellow friends who had better rank then me preferred rr campus ECE than CSE in EC campus( Personally i won't suggest this)\nDegree matters\n                └── The cutoff are after second round and to add after first round CSE in EC campus was 2200 and rr campus ECE was 2900 so you'll definately get the seat"
    },
    {
      "id": "jcxtpd7",
      "body": "Please tell me about pes university for North indian student"
    }
  ]
}