{
  "id": "11mub40",
  "title": "going without direction!",
  "content": "So my gpa is almost around 7 , my isa s im doing pretty bad barely even crossing the class avg, idk what to do, the questions in isa s are very ambitious, btw im in 4th sem, i have no exceptional  projects , nothing as of now even in resume..so how should i go abt now , i have no direction atm and my future  looks void.",
  "metadata": {
    "root_comment_id": "jbkufsx",
    "post_id": "11mub40",
    "author": "Fun-Understanding862",
    "url": "https://www.reddit.com/r/PESU/comments/11mub40/going_without_direction/",
    "permalink": "https://reddit.com/r/PESU/comments/11mub40/going_without_direction/",
    "score": 6,
    "upvote_ratio": 0.8799999952316284,
    "created_utc": 1678373877,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jbkufsx",
      "body": "My brother in christ, chill out. If engineering is what you are interested in then work a teeny bit harder and improve your grades. Else, find your calling and stick with it. Try to maintain decent grades and you'll be fine. If projects are what you're worried about - pick a prof, go and ask them for a project and 99.999% of the times they'll just give you one."
    },
    {
      "id": "jbmdgo8",
      "body": "As with a lot of life's problems, the solution is usually the most obvious one (which is also the hardest to follow). If you don't have direction, get direction!  \n\n\nBasically, pick what it is you *want* to do. Do you want to improve your marks? Do you want to make your resume better via projects? Do you want to get a placement?  \nPick exactly one of these things and try to focus on how you can improve on that front. So, for example, if you wanted to improve your marks, you'd ideally be figuring out better ways to study, your assignments would have relatively lower effort, just enough to get the minimum amount of marks you need, and so on. It's important bc what you're feeling is overwhelmed, and that's okay. We've all been there. You'll get through it :)"
    },
    {
      "id": "jbn6r2r",
      "body": "You're currently in your 4th sem so I'm assuming you will have 2 months of holidays after your ESAs. You can plan what technologies you want to learn and what projects you wanna build now and then do it in your holidays. I'd also recommend you improve your coding knowledge by practicing and solving problems in websites like leetcode, codechef and so on. You can even apply for internships, I got an internship by applying in websites that provide internships. Internshala, Cuvette are one of the websites that allow you to apply for internships in 100s of companies."
    },
    {
      "id": "jft4oxj",
      "body": "My suggestion to you would be focus on competitive coding questions(it will help you get internships and eventually a job) and try to get in 2 really good projects before you graduate(5th sem and then capstone). This will help keep your options open if you want to pursue further education in the future as well(work a couple of years and then apply). Not to sound harsh but there isn't too much you can do about your CGPA right now anyway so just try and let it not drop further and you can focus your time on these other 2 things."
    }
  ]
}