{
  "id": "11nfxqy",
  "title": "Any change in passing marks ?",
  "content": "",
  "metadata": {
    "root_comment_id": "jbn9j0u",
    "post_id": "11nfxqy",
    "author": "stanelyRR",
    "url": "https://www.reddit.com/r/PESU/comments/11nfxqy/any_change_in_passing_marks/",
    "permalink": "https://reddit.com/r/PESU/comments/11nfxqy/any_change_in_passing_marks/",
    "score": 4,
    "upvote_ratio": 1,
    "created_utc": 1678426268,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jbn9j0u",
      "body": "Depends on the moderation committee. If your paper was difficult then they'll be more lenient with your correction and it will graded relatively.\n└── &gt; graded relatively\n\nUnfortunately this does not happen here, only the mappings between grades and marks get shifted to lower scores. More like normalisation rather than relative grading.\n    └── Okay"
    },
    {
      "id": "jbncicc",
      "body": "Haven't first sem results already come out? If they have then no change will take place now.\n└── It's about yesterday's VC addresal"
    },
    {
      "id": "jbnem4k",
      "body": "If you are talking abt the meeting we had with pro chancellor . He said that from now Weightage for each ISA is now 10 marks\nBest 4 will be taken \nTotal ISA : 40 marks\nAssignments + lab = 10 marks\nESA : 100 marks reduced to 50 marks\nISA (40) + Assignments+lab(10) + ESA(50) = 100\n├── Nothing he mentioned about passing marks right ? Thought heard something about it. So just wanted to clarify\n│   └── Basically a lot of ppl with 30-35 in ISA were scoring rlly low in esa to just pass. So they have warned that if we don't score properly in ESA this sem, from next sem onwards they will be keeping minimum passing marks for ESA as well. If u don't get those many passing marks in ESA, then u essentially fail the subject regardless of your isa marks. Rn the total passing (ISA + ESA) is 40.\n└── Is it only for the first years?\n    └── He called all the second sem students only so ig"
    }
  ]
}