{
  "id": "11xnmm4",
  "title": "CGPA",
  "content": "what is the cgpa I need to maintain(in sem 2 rn) to get accepted for higher studies abroad \nAnd is it gonna be taken under consideration till the 6th sem or the 8th sem for masters",
  "metadata": {
    "root_comment_id": "jd3vksk",
    "post_id": "11xnmm4",
    "author": "Timbaggg256",
    "url": "https://www.reddit.com/r/PESU/comments/11xnmm4/cgpa/",
    "permalink": "https://reddit.com/r/PESU/comments/11xnmm4/cgpa/",
    "score": 5,
    "upvote_ratio": 1,
    "created_utc": 1679419219,
    "flair": "Study Help :table:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jd3vksk",
      "body": "Always as high as possible. Typically 8.6+ they will look at your application. \n\nRight of college means 6th sem\n\nAfter work exp means ofc 8 sems. \n\nOfc you can't fail any subject or screw up any subject if you give till 6th. They will demand final transcripts. And if it's all good then only they will admit.\n└── so if work exp is considered, cgpa doesnt have much weightage right?\n    ├── Lmao balls. Work exp has 0 weightage basically. \n\nCgpa, research and projects are what matters. Work exp in research means itll have lots of value.\n    │   ├── Ofc, sop and lors also matter a lot.\n    │   └── Wait can someone throw more light on work exp then?\n    │       └── Okay so, for most MS CS applications, your work experience will be evaluated *alongside* people with work experience. In other words, it becomes clear to the adcom that you've elected to apply for the MS CS as a *professional* degree, so you'll be evaluated in a professional capacity. Likewise, if your profile is research-heavy (lots of REU, papers, etc), then you'll be evaluated with other research-heavy profiles.   \n\n\nThere are also a lot of degrees like MCS, which are meant to be professional master's courses, where work experience is paramount.\n    └── I'd definitely say that they have equal weights. You can justify a bad semester with your essays because colleges abroad are human and understand that sometimes things go wrong. You can also talk about how your work experience brought you to make this decision of \"hey I need to do a graduate program as I will be able to do XYZ in my career after I learn abc\"."
    },
    {
      "id": "jd42we7",
      "body": "Doing my masters right now. Your profile and your story should lead to why you want to continue your education. Your CGPA should be competitive. Work on streamlining your interests, either through research, internships, or work experience, and take courses leading to the same. Admission committees look at how you can be a value addition to a school through what you bring to the table.\nYou will get an admit on your 6th sem marks, but this is always provisional as you have to submit your final transcript with all semesters. If you plan to go the corporate route before going back to school for MS, all your eight semesters will be considered."
    },
    {
      "id": "jd6vt92",
      "body": "My friend got in ASU Cybersecurity with 8 so it's just fine they'll convert into scale of 4"
    },
    {
      "id": "je8er03",
      "body": "I doubt you will make it past 2nd sem"
    }
  ]
}