{
  "id": "11zjew8",
  "title": "Faculty advisors",
  "content": "Did they rlly help u get better in terms of your academics and other stuff ? If yes, then who were the profs ? Since they were telling that we may be spending more time with them from this sem onwards, I'm just curious to know.",
  "metadata": {
    "root_comment_id": "jdcjzl4",
    "post_id": "11zjew8",
    "author": "Geekwalker374",
    "url": "https://www.reddit.com/r/PESU/comments/11zjew8/faculty_advisors/",
    "permalink": "https://reddit.com/r/PESU/comments/11zjew8/faculty_advisors/",
    "score": 5,
    "upvote_ratio": 0.8600000143051147,
    "created_utc": 1679575843,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jdcjzl4",
      "body": "Lol, they're a joke in EC campus\n├── *every campus\n│   └── \\#canbackit\n└── R they rlly that bad ? My advisor only seems to care about marks, so I was curious if others r like that as well, especially in the case of higher sems as they will be needing help for internships, placements, higher studies,etc.\n    ├── Good for you that they care at least that much, mine doesn't even remember us.\n    └── Almost everyone's faculty advisor is non-existent, so I guess you at least have something\n        └── Oops forgot - ours asked us to give feedback about college after we graduated and called us a bunch of times at work for the same reason\n            └── Wait, for real? \nOMG. Is the NAAC survey not enough for College review? 😂😂😂"
    },
    {
      "id": "jdd1y6b",
      "body": "They just check your isa marks and attendance and ask if you are facing any issues .\nIf you have any issues feel free to share them , the mentors can really get them sorted ."
    },
    {
      "id": "jde5dyw",
      "body": "I'm from the EE department and my faculty mentor was Dr. Joseph. I can positively say that although he knew that my department gave NO shits about the system, he always listened to my concerns and helped me take action, although the department didn't do shit after that."
    },
    {
      "id": "jdea5z6",
      "body": "\\- They, spending more time, are just simply told, it is never followed.    \nk about future plans and interested domains \\[in ECE\\], and he also once asked me abt a dream company. That's all,   \nComing to your question.   \n\\- they in no way, help you in terms of academics, but if you wanna start a club, or do some off-academic work, they will help you\n\n\\- They, spending more time, is just simply told, it is never followed."
    }
  ]
}