{
  "id": "121dt8b",
  "title": "LoRs from teachers who've left the college",
  "content": "I graduated in 2021 and plan to apply for Masters in Fall '24. The most esteemed profs that I worked with closely have now left college - namely KVS and Dinkar Sir.  \nHas anyone reached out to them for LoRs after they've left? I wanted to know what the procedure is like, considering they don't have their PES IDs.",
  "metadata": {
    "root_comment_id": "jdp81tj",
    "post_id": "121dt8b",
    "author": "violetriot99",
    "url": "https://www.reddit.com/r/PESU/comments/121dt8b/lors_from_teachers_whove_left_the_college/",
    "permalink": "https://reddit.com/r/PESU/comments/121dt8b/lors_from_teachers_whove_left_the_college/",
    "score": 12,
    "upvote_ratio": 1,
    "created_utc": 1679727667,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jdp81tj",
      "body": "If you've got their personal/new emails just reach out. All my LoRs came from profs who had left.\n├── Ooh okay noice! Do universities consider it a red flag if the LOR is sent out from the prof's personal id instead of a college registered one?\n│   └── Some won't accept personal email addresses like Gmail - the sending system expects a University/professional email. You'll want to ask them for their current buisness email if they're still teaching/working somewhere. Something like an IEEE email will also work. \n\nIf they've retired, ask the university to accommodate it and they should oblige.\n└── Hey dude , just wondering if PES would allow me to shift college in middle of 4 years .... Or would they ask for more money\n    └── They'd almost definitely ask for money if it's after the seat allotments for the competitive exams are over.\n        └── I want to transfer to another college during my 2nd year and I don't have much options besides pes to join this year .. is there anything I can do to not be asked for the cash when I leave ??\n            └── Sorry, I've no idea"
    }
  ]
}