{
  "id": "122eihc",
  "title": "7th semester",
  "content": "What is the course work like in the 7th sem ? NPTEL+Special Topics or just NPTEL or just Special Topics ? Can we claim few credits for coursera courses ?",
  "metadata": {
    "root_comment_id": "jdqb8og",
    "post_id": "122eihc",
    "author": "annoyedsl0th",
    "url": "https://www.reddit.com/r/PESU/comments/122eihc/7th_semester/",
    "permalink": "https://reddit.com/r/PESU/comments/122eihc/7th_semester/",
    "score": 7,
    "upvote_ratio": 0.8899999856948853,
    "created_utc": 1679815712,
    "flair": "Study Help :table:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jdqb8og",
      "body": "You have to take up 3 special topics. Either through college or a combination of college + NPTEL. Courses are decided by college, so you cannot pick up any course you want from Coursera/other platforms and gain credits. Also, note that although you might do the course from NPTEL the evaluation will still take place from PESU. Additionally, college can also add extra syllabus to the existing online syllabus and/or make modifications to topics. From past experiences, it's way lesser of a hassle to pick from the ones college offers since you lose all benefit of doing non college decided courses.\n└── For the 2020 batch it's gonna be 5 special topics ."
    },
    {
      "id": "jdr7r6q",
      "body": "For CSE, U get a list of 7-9 subjects of which few are taught by college, few are nptel courses, and a few harvard and stanford ones. U have to take 3 subjects and U can take any combination of these. There may be some restrictions (might not be able to take iot if u had taken it in some previous semester), and u can't take coursera courses and claim credits. Whatever the subjects u take, u will be writing the exams in the college itself.\n└── I heard that the classes will be mostly online for 7th sem and Is it true that there is no need to come to college in that sem?\n    └── Classes will be online, but isa and esa are offline, plus u still have the capstone presentations right? Those will be offline too. But overall yeah, u won't be on the campus for classes atleast."
    }
  ]
}