{
  "id": "126k5z3",
  "title": "First year coding subjects",
  "content": "I really suck at coding. I give  it  the maximum time compared to other subjects  but I am not being able to perform at all in the exams, I scored a d grade in python and in the first isa of c language too I will most probably get a single digit score. How should I approach the subject as I am afraid that c would reduce my 2nd sem sgpa too. I also become depressed seeing fellow hostelers who study lesser than me but score better. I can't even write code for questions I have not seen \nearlier",
  "metadata": {
    "root_comment_id": "je9r12y",
    "post_id": "126k5z3",
    "author": "Awkwardab1304",
    "url": "https://www.reddit.com/r/PESU/comments/126k5z3/first_year_coding_subjects/",
    "permalink": "https://reddit.com/r/PESU/comments/126k5z3/first_year_coding_subjects/",
    "score": 4,
    "upvote_ratio": 0.699999988079071,
    "created_utc": 1680175688,
    "flair": "Study Help :table:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "je9r12y",
      "body": "Coding has two parts: the syntax, and the logic. \n\nThe syntax is painful, and every time you write a code you'll get lots of bugs, but with practise you'll get better at avoiding errors and using the right words. Listening to class, sitting with your teacher, or discussing codes with your friends will also help you learn what is allowed, and what is not allowed. \n\nLogic:\nSeeing codes, working them out in your brain, and on paper, helps you to understand what is really going on here, and how the computer is doing the task. Computer logic to me, is just like human logic, just that you have to slow down your human brain, and analyze step by step. \n\nFor example swapping two numbers. If you're holding two cups in your hand, you can't just throw them and swap them. You set the left cup on the table. Then you can easily transfer the cup from your right hand to your left hand. Now you pick up the table cup with your right hand. The table is the 'temp' variable which you often see in swap codes.\n\nFor example, while writing fibonacci, first you write 0 and 1. Then you point your finger at one number, another finger at another number, and then add the two. You forget all the previous numbers because you don't need them.\nThen you move one finger ahead. You move the other to the position where the previous finger was. \n\nAs you reach 5,8,13,21, you have Finger One on 21, and finger two on 13. Add them. Then make finger Two what finger one was, and finger one the next item.\n\n\nLinked list was really hard to me. The syntax involving structures made no sense. But the part involving inserting and deleting nodes from a linked list, can also be intuitive this way.\n\nImagine a chain of people. These people only have one arm (single direction linked list). These people are standing in a line, and their arms are held backward. Each person's arm, is holding the shirt collar of the person behind them. So you see, nobody is holding the collar of the front person (the head). And the last person is not holding anybody's collar. These people are holding each other tightly, and they're all blind. So if the chain breaks (for more than a second)(I mean, without it simultaneously recovering) it will split hard and the pieces can never be recovered.\n(Each arm is a link, of who's next).\n\nInsertion: Inserting a person between two people. How do you do that without breaking the chain. \nI'll call the two people Aditya and Rahul. And the person who wants to come behind Aditya, in front of Rahul, is Tejas. You cannot split Aditya and Rahul, the do operations with Tejas. You can't put Aditya's hand in Tejas's shirt, and then put Tejas's hand in Rahul's shirt, because Rahul will be lost by then.\n\nSo what we do. We put Tejas's hand in Rahul's shirt. So now two hands are in his shirt. Now with one simultaneous action, we say that Aditya's hand is in Tejas's shirt. (In less than a second, we move Aditya's hand from Rahul to Tejas). \n\nAnd to find someone in the list. Let's say Aditya is somewhere inside the list. And everyone has really long arms(like one kilometer long), so you can't see more than one person at a time. You only have the address of the first person (the head). You can't randomly search the earth, you need to make use of this chain. \nSo first go to the first person (the head). Check if it's Aditya. If not, follow Aditya's arm (link) to the next person. Check. Repeat until you find Aditya's position.\n\nIndu ma'am is a fantastic teacher, I learnt a lot from her. I Iove her. I'm talking about Indu, not Sindu. She told me how linked lists are used when data is stored at random spots in a system, and not all next to each other, so all they have is their data, and their link to somewhere far away (long arms).\n\nIn this way, I tried to show that most computer logics can be turned into human understandable logic. Because computer logic has to be learnt from somewhere. You can come to me if there's a concept you can't think up intuitively. Practising intuitive thinking becomes very helpful for other subjects, and helps you study quicker.\n\n\" I also become depressed seeing fellow hostelers who study lesser than me but score better. \"\nComparison has been a major source of problems for me, especially in 11th. Just don't think about them bro. There's no need of all this drama, and asking what to do. Just study. If comparison positively impacts your studies, then go ahead. But in the long run for me, Comparison just bombed my studies, and my happiness in life, so I decided to quit it.\n├── 🫡 respect and huge thanks for pushing me 🙆🏻\n│   └── Glad I could help\n└── I hope you publish this as a paper ❤️"
    },
    {
      "id": "je9r5yc",
      "body": "Oh wait, read the linked list part later during your third and fourth isa. The fibonacci and swapping part should be understandable though. I'm a senior in fourth isa, and forgot that you haven't reached that point yet."
    },
    {
      "id": "jealf46",
      "body": "What's your branch?\n\nIf you're not from CSE then it's alright man. We've all been there. I highly recommend studying by yourself from YouTube courses because they're far more superior than the shitty college. \n\nAnd about sgpa- just focus on giving it your best. Don't compare yourself because that shit is a slippery slope and it will tear you up. There will always be someone better than you. What's important is that you give it your best and keep grinding.\n└── Cse, that's why I am that scared\n    └── See idk how much this will help you but keep these things in mind (I am from ECE so keep that in mind)\n\nBro this sgpa shit will be with you throughout college. You have 2 options, you either sit there and compare yourself and watch your grades plummet or you stop giving a fuck and do your own thing.\n\nLike it or not, the crowd in cse (from what I've seen) is very very competitive and college expects a lot out of y'all. I have seen the different tone and pitch in which the pro chancellor addresses cse and non-cse branches. They expect y'all to be the next tech mogul. \n\nLuckily, you're still in your first year and that gives you a fuck ton of time. There are millions of courses available online for learning cse related stuff. I don't know if cse is what you wanted or you were forced to take it up, but do take it seriously. If cse is what you wanna pursue then man, you gotta start grinding. Next year, you will be introduced to a very very important subject called DSA that honestly is very interesting but requires you to be strong with your coding basics. Unfortunately, there aren't good courses available for DSA in C (that's the language college will teach it to you in, and believe me I have looked). You gotta start working on your basics. Do not be afraid to approach your professors for help, the majority of them are really helpful and will answer all your doubts no matter how stupid they are. Start researching for courses and learn it to completion. If you're struggling with getting coding, there's only one solution - practice, practice and PRACTICE. You will be shit at it at first but as you progress, you will see improvement. I understand the pressure that comes with being a cse kid because you will be there coding a basic calculator program and some dude from your class will be belting some high level shit. Utilise your free time to learn by yourself. It's upto you whether you wanna pay attention in classes or not. Do not be intimidated by what others are doing, just focus on what you're doing and stick with that. People talk man, 90% of the people will talk random nonsense just to look cool. You are not alone. \n\nIf cse is not what you wanna pursue, you gotta be clear with that. It takes courage to do what you want in a crowd of people that do excellent at what you're struggling with. You gotta be mentally strong to ignore that. Having said that, still put in the time to learn the basics and give it your best. Don't be frustrated with the low grades, you're learning. Study cse and do well in it in your capacity. Spend some time to find your niche. Once you enter the 2nd year, you can explore the various departments in college and talk to people. \n\nI recommend you implement a project based learning method. It helps you pick up on the basics and makes you understand the workings of how stuff works. I cannot stress this enough, regardless of what your peers are doing, you need to be focused on what you're doing. I understand it's embarrassing to not know the basics of something that someone else is good at. But trust me man, once you endure that and move forward, it is rewarding. You need to kill your ego and start from scratch. There's no shame in that.\n        └── And yeah the people that score well without studying? Only 2 types of people manage that, they're either academic proteges or love coding and grasp it super quick. It doesn't matter if you don't belong to either of the two. Start from the beginning and be consistent. You will see the results. Focus on learning rather than scoring. Your exams will be more application based and you need to learn the concepts to target them. \n\nAnyway, i wish you all the best buddy. You got this. Hope you found what you were looking for.\n            └── Thanks !"
    },
    {
      "id": "jemz6ar",
      "body": "Bro u can chill out. The questions they ask in these pes exams aren't reflective of how good or bad u r as a programmer. They ask really obscure topics that most people wouldn't ever face in their everyday programming. But this doesn't mean that your grades are unimportant. Plus as far as python is concerned remember that a huge chuck of your classmates have already learnt it in 11th and 12th. And you probably for the first time. Now try looking at their C scores and i assure you it would be lesser in most cases. It's all a question of experience with the language so just focus on upskilling urself. Plus a piece of advice a friend gave me : build projects. If you really wanna know programming upside down, pick a project that you find really difficult and commit to that. Even the useless things you learn during that will be useful later. \nCheers and good luck !"
    }
  ]
}