{
  "id": "12b80xz",
  "title": "NEED HELP GUYS, DOUBTS REGARDING PESSAT",
  "content": "So for PESSAT, is it a percentile rank based test or purely marks based rank test, I am asking this doubt because should I fill the slot of writing exam on a weekend or weekday considering that weekday less number of people will be writing and there will be a chance that my percentile will go up, so does writing on a weekday or a particular day will help me get good marks/rank in PESSAT, any advice from seniors who have written PESSAT?",
  "metadata": {
    "root_comment_id": "jevrviy",
    "post_id": "12b80xz",
    "author": "Key_Force_5463",
    "url": "https://www.reddit.com/r/PESU/comments/12b80xz/need_help_guys_doubts_regarding_pessat/",
    "permalink": "https://reddit.com/r/PESU/comments/12b80xz/need_help_guys_doubts_regarding_pessat/",
    "score": 3,
    "upvote_ratio": 1,
    "created_utc": 1680579605,
    "flair": "PESSAT",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jevrviy",
      "body": "Percentile based, so choose a day when less ratio of toppers, and not when less people xD.\n├── there's no clear way of knowing that XD, that's why I was asking in this subreddit that does anyone have any experience or advice that when can we choose, like on weekdays or the weekends\n│   └── I don't think there's really a way to know, but maybe if there is another more important entrance exam on some day, choose the same day or the day before it, can probably expect lesser ratio of toppers then.\n│       ├── Ohh Okay Fine\n│       └── *Skips JEE Mains to write PESSAT*\n├── Interesting, today I learnt that it's percentile based. Do you have any source for this? Because I always thought (and was informed) that it was completely marks-based ranking\n│   └── I just remember it being mentioned somewhere, probably some communication by the uni during pessat. I know for sure it's this because I also while deciding my day I was thinking when I can avoid toppers.\n└── how would one know that?"
    }
  ]
}