{
  "id": "12be4aq",
  "title": "Extra Learning.",
  "content": "So I've heard a lot about how it's advised to learn extra, take up online courses etc  because college doesn't teach everything we need for the real world. So my question is how do people get time to balance that AND like 5 ISAs and an ESA with 85% attendence. As soon as I start something with momentum I'm having to stop and start ISA prep once again .And I've heard that for admissions for masters your \"academic story\" should reflect the course u wanna pursue. How are we supposed to know what we wanna pursue if i can't even begin basic syntax here. Obviously this is a slight rant and i will adapt and overcome. But i just wanna know whether everyone is doing the same.",
  "metadata": {
    "root_comment_id": "jexhhyo",
    "post_id": "12be4aq",
    "author": "Previous_Locksmith_1",
    "url": "https://www.reddit.com/r/PESU/comments/12be4aq/extra_learning/",
    "permalink": "https://reddit.com/r/PESU/comments/12be4aq/extra_learning/",
    "score": 12,
    "upvote_ratio": 1,
    "created_utc": 1680602141,
    "flair": "Study Help :table:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jexo2c8",
      "body": "I agree, the 5 ISA system has screwed things around for everyone and prevents people from getting the momentum to learn new things. I was fortunate to have graduated in the 2 ISA system so I don't really know *where* you can find the time, but there is one thing I can suggest.\n\nI never put in my 100% for any ISA or ESA. It was because I had other things I wanted to learn/pursue, so I decided to strike a balance. I decided to put in only as much effort as was required to get a good CGPA, but not the best CGPA I could get. I knew I needed to cross an 8.5 for not only placements but also for potential higher studies, so I kept my target as between 8.75-9 every semester. I am academically capable of scoring more, but I instead chose to split up my time into two parts - all my time right up to 1-1.5 weeks before the tests, I'd do whatever I found interesting - extra courses, my personal projects, etc. I never flipped a page of my course work (unless there was any lab submission or something). 1-1.5 weeks before the ISA, I'd stop everything else completely and focus *only* on my coursework. So yes, in a way I was cramming down syllabus a week before the test, but that effort was enough for me to get my target SGPA, so I was satisfied. I was able to get what I needed, and on the plus side I got so much more personal work done. Looking back, yes I *definitely* could have scored more because I know my potential, but if I had done so I would never have achieved whatever I have so far in my life, because it's the things I did beyond my coursework that contributed to it.\n\nI'm not sure how much time exists between each ISA so I can't suggest exactly how to split things up, but what I can tell you is that you need to know how much effort to put in each test, lab, project and deliverable. Prioritise where you put in time and effort. If a project is worth 5 marks, do the bare minimum. If the lab is pointless, copy. If there is a test for a course you're bad at, do the bare minimum to ensure you hit your target SGPA. Don't try to give your 100% in everything but that only exists in an idealistic world. Instead focus your efforts wisely where it will make sense. I chose to focus on projects that would benefit my profile and coursework which aligned with my interests. Know when to call it and not put in more effort. But the most important thing is, **make sure you make use of the time you are saving up**. If you don't do that, then it's all for nothing. \n\nAgain, I can't suggest how to exactly split time up since I have no clue how stressful it is, but maybe try looking into effort management *along with* time management. It helped me tremendously along with a few others I personally know, so you never know.\n└── Time between the isas : 2 weeks EXACT. It's not stressful to be honest but it's like an irritating fly that u need to swat away regularly. Like u even i know what I could do if i do 4 hours of regular studies like our VC advised 😂.\n    └── Irritating yes, but it's not going to change. On paper it's led to better CGPAs for all batches that have implemented this (even the first ever batch that had this). And although it isn't related, they'll find a way to link good placements to this as well. So if it's working on paper it's very unlikely it will change."
    }
  ]
}