{
  "id": "12jkfit",
  "title": "Is pes worth the 20 lakhs smthg fees",
  "content": "So I have got 94 percentile in jee not gonna get anything good with this much\n\nso as I was prepping for comedk i came to know about pessat, but the fees I have to pay is simply mind boggling\n\nSo say if the cse placements are  really 15 16 LPA, is it worth taking a loan of about  4-6 lakhs if I got selected for pes univerisity cse/cse(aiml)",
  "metadata": {
    "root_comment_id": "jfyhyn0",
    "post_id": "12jkfit",
    "author": "bruhfame_45",
    "url": "https://www.reddit.com/r/PESU/comments/12jkfit/is_pes_worth_the_20_lakhs_smthg_fees/",
    "permalink": "https://reddit.com/r/PESU/comments/12jkfit/is_pes_worth_the_20_lakhs_smthg_fees/",
    "score": 9,
    "upvote_ratio": 0.8500000238418579,
    "created_utc": 1681302099,
    "flair": "PESSAT",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jfyhyn0",
      "body": "If you don't get into iit/nit/iiit/bits, then it's the best option you have. I'm speaking in terms of education and outcomes. I don't fully know your financial background so pls consult somebody else. \n\nPes takes admits through cet as well.. Fees is dirt cheap through kcet.\n└── I don't think I can apply for kcet as I am not from karnataka\n\nfrom 94 percentile maybe i would get iiit manipur dk if it's worth it\n    └── ahh i see. yeah then PESSAT is the way.\n        └── Asking out of curiosity PESU CSE EC RVCE ECE.I had taken RVCE ECE thru comedk instead of PESU EC CSE is it mistake\n            └── If I were you I would have chosen pesu cse ec campus. Branch + brand is killer combo. Ofc rvce is also very good. But cse branch opens many doors I personally feel. \n\nIf you are passionate abt ece then rvce ece is a no brainer. \n\nDon't look back bro. Just see what you can do now lol.\n                └── Yeah I feel regretful because of decision since I like programming but not very interested in electrical subjects.Thanks for ur input appreciate it.\n                    └── chill bro, RV ECE is really good. You can easily go into programming with local and global electives from CSE. Also, it's not electrical, it's electronics. Focus more on CS subjects and maintain good GPA in rest. Maintain CGOA above 8.5 and you can get a huge pay MNC."
    },
    {
      "id": "jfykl1i",
      "body": "Why pes? Check out other colleges... Pes is good but then u gonna comit yourself to the study... And that's bad cuz uve done that all your life... If you plan on doing masters or MBA don't take pes, If u alr with a package of 8-10 LPA you can choose different colleges for less the fee\n\nPes is Narayana and chaitanya but University level\n└── the problem is  I won't find any 8-10 LPA colleges with my current entrance  score\n\nmaybe iiit manipur  whose avg is maybe 5-7 LPA and other expensive colleges like jaypee noida whose fees is about same as pes but pes is better than it\n\nI am  from UP and there's not really any good 8-10 LPA colleges  here lol\n\nSO here  if I pay around 10-14 lakhs in fees is it worth to take a loan of about a few  lakhs for studying cse in pes... if my only other options are  5-6 LPA colleges\n    ├── Are you gonna prep for bitsat?\n    │   └── ya bits and comedk pessat is backup kind of\n    │       ├── Meri mains gigafucked hai(batane layak bhi nahi) bits to difficult hai main bhi pes ka hi hope kar raha hun\n    │       ├── Comedk ke top 2 colleges bits nahi milenge to lelena pes me hi imo(arguably manipal too idk?)\n    │       └── Bro last year was the last comedk wasn’t it\n    ├── Then CSE at pesu would be your best option imo. Great placements, great curriculum. Only major downside is huge class size and terrible faculty. \nLot of people get into top unis for masters too after their undergrad here so that’s also an option for you.\n    └── Education do be expensive sadge"
    },
    {
      "id": "jfyoolm",
      "body": "Attempt manipal university entrance exam too, if you're attempting pessat.\nAs far as I know both have similar fee structure"
    },
    {
      "id": "jg0izvz",
      "body": "If you’re studious, goal oriented, want to get a good placement / uni for masters, and would like a moderately fun college life then PES is the best. If you want to take it chill and not have the stress of attendance and marks then it’s not for you ( I don’t recommend this). I’d say go for CS in PES. I did EEE, got placed in a big4 as a tech consultant which opened up many doors for me. Placement in PES is the best."
    },
    {
      "id": "jg23vfn",
      "body": "Why not VIT, Manipal, SRM, Thapar etc? \nThere are so many decent colleges.\nVIT is expensive if you want main campus CSE, but you can compromise on those and still get 8 LPA plus without much of an issue.\n\nWhat I meant to say is VUT Chennai CSE will be cheaper, so will VIT Vellore ECE."
    },
    {
      "id": "jg2inpb",
      "body": "If it’s a loan amount of 4-6 lakh then you will earn it back within 1 year of working, so no brainer, and PES sets you up for great jobs in the future along with solid options for further studies as well.\nBut take only CSE. Take ECE only if you really like it. CSE in the EC campus is better than ECE in the RR campus"
    },
    {
      "id": "jg2vuj1",
      "body": "If you want an overall good experience join some other college like BMS and Manipal. PES is good but getting a good GPA is harder compared to other colleges and it's more academically inclined. If I had a younger sibling I would not let them join PES"
    }
  ]
}