{
  "id": "12svs6m",
  "title": "12th",
  "content": "Just wanted to know about pessat exam\nexam. Like what is asked and what is the difficulty",
  "metadata": {
    "root_comment_id": "jh05rjc",
    "post_id": "12svs6m",
    "author": "Tomper_balak",
    "url": "https://www.reddit.com/r/PESU/comments/12svs6m/12th/",
    "permalink": "https://reddit.com/r/PESU/comments/12svs6m/12th/",
    "score": 2,
    "upvote_ratio": 0.75,
    "created_utc": 1681990995,
    "flair": "PESSAT",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jh05rjc",
      "body": "Questions similar to jee mains are asked, the difficulty is moderate.\n└── I thought the difficulty was similar to kcet/comedk\n    └── I am getting around 93 percentile in jee mains, do you think i stand a chance to crack pessat?\n        ├── Dude I got a similar percentile in jee and around 800 rank in pessat which was enough for cse in RR campus\n        │   └── Oh great \nThank you\n        ├── Easily jr. My final percentile was 87 and I missed the cutoff for Jee advance by mere 1.2 percentile. Pessat went horrible (questions were easy, just that its lengthy considering the fact that you have to answer PCM+English. Also many from all over the country come to write this exam, so be prepared to expect high level competition.)\n\nGive your best shot at Kcet, that seat is blessing in disguise. PES is private college, and as you know already, (private==more expensive + hidden additional expenses)\n        │   └── you're in what course in pes?\n        │       └── ECE\n        └── yes..possible ."
    },
    {
      "id": "jh0b1gx",
      "body": "Difficulty level of pessat is in between KCET and JEE . \nThere's no harm in writing the exam . With the current fees structure and declining teacher quality I would  suggest not to join here unless it's your last best option or you are joining through KCET.\n└── i am so confused about pes i feel like people either say it's the best college in blore or it's the worst\n    ├── yea exactly, im confused too\n    ├── The only people who say it's the best are the ones who only have an idea of it from the advertising they do. Everything looks better from the outside (applies to every University tbh). \n\nPES like any other college has its share of flaws but the issue is that it never learns and there is no scope of improvement. It suffers from deep mismanagement issues and over the years has turned more into a full fledged business rather than an institution. The only good thing here are the placements so if that's your *only* concern then yes it's a good choice. \n\nI graduated in 2022 and I've witnessed the shitshow this college can be. Beyond placements, this college doesn't really have anything special to offer, and won't definitely be worth the 4.x lpa you'll pay as fees per year.\n    │   └── which dept bro?\n    │       └── CS, graduated 2022\n    │           └── ohh..how were placements at ur time.. i am 2019 batch student in ece dept( graduating this year)..\n    │               ├── placements was completely rollcoster like experience..academic life was shit..i dunno what i am learning in pes\n    │               └── > at your time\n\nSir I'm only one batch before yours xD. Placements were great for my batch. Companies also recruited way more than the current batch as well. Overall, really good\n    │                   └── oh ..nice which company r u working in right now..how was ur experience with somashekar.sir?.mine was not at all pleasant one..placement is shit this year..luckily i got placed..but still not satisfied..\n    │                       └── If you want to know my personal info, DM. I'm not sharing details publicly. And yeah, makes sense your placements were bad. Somashekar is the *most* incompetent person in charge of arguably one of the most important departments at this University. His incompetence and ignorance is honestly shocking.\n    └── well from what i can say it all depends on individual's experience in this college .Personally , my experience was bittersweet in my 4 years's journey in this college( i am a 2019 batch student graduating this year doing btech in ece).Placements here is a rollercoaster..luckily i got placed .But if u r non technical branch competition is going to be tough during placements because of cse (mechanical branch forget about it ..very few companies come most of my friends are still not placed.).U need to keep descent cgpa of 7 or 8+ is very good..this is going to help u a lot during placements and very few core companies come with a double digit package .. mostly consultancy companies and tech companies..come here .If u are in cse then don't need to worry about placements at all. Being in non tech branch.. if u r in ECE dept then 3rd sem ..is going to bring a lot of suprises to u .. u might find it difficult but don't need worry too much..u will get over it ..just create a timetable and plan everything proactively..u will definitely exel in xams.But the most shittiest part is relative grading. During placements make sure to learn dsa and sql,dbms..if not that do some good projects..and add things which u know in ur resume. learn c++ or java along with python ..as many companies come for dev role in c++ or java very few come for python. Finally I would like to say ALL THE BEST incase u join pes."
    },
    {
      "id": "jh3jfuf",
      "body": "Join PES at your own risk"
    }
  ]
}