{
  "id": "12vz3gw",
  "title": "Enquiry about admission into B. Des.",
  "content": "Peeps I needed some information about BDes for a friend. I wanted information in the following topics:\n\n* What course should be taken in 11th and 12th?\n* What competitive exams should be written to join BDes, and what type of questions are asked?\n* What stuff do you learn in BDes? \n* What is the fee structure?\n* Any other colleges with BDes\n\nand any other topics that you might find useful. I didn't find any reliable sources online, so please help me out. Thanks in advance!!",
  "metadata": {
    "root_comment_id": "jhdjsfu",
    "post_id": "12vz3gw",
    "author": "SilicoFlare",
    "url": "https://www.reddit.com/r/PESU/comments/12vz3gw/enquiry_about_admission_into_b_des/",
    "permalink": "https://reddit.com/r/PESU/comments/12vz3gw/enquiry_about_admission_into_b_des/",
    "score": 4,
    "upvote_ratio": 1,
    "created_utc": 1682232965,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jhdjsfu",
      "body": "If your friend wants to do B.des and has 2 years to prepare, try for UCEED to do B.des at IIT's and NID-DAT for B.des at NID. If you have the aptitude it's not that hard to get in, don't overestimate your sketching and practice daily, you can go for classes if needed. I gave UCEED this year and got rank ~ 3k, you should aim for under 50 rank. You can choose science, commerce or arts but if you want to join IIT guwahati u need to have physics, chemistry and maths. Questions asked in these entrance exams will mostly be aptitude based or basic maths\nand sketching.\nyou can check the [curriculum ](https://design.iith.ac.in/academics/bdes/curriculum/)  for iit-hyd here, you can search on the net for course curriculum of other colleges.\n└── Thanks a lot! I needed this from a very long time...\n\nHow do you join BDes in PES? Is it the same UCEED exam or smth else?\n    └── You can visit pessat.com and apply from there. Admissions are still open afaik.\n\nYou need to get UCEED rank below 1000 is what we were told but pessat is fairly easy, more of a formality. Keep your portfolio ready because many colleges ask for the same during the interview\n        └── Thanks a lot!\n\nWhat exactly should be in the portfolio??\n            └── Portfolio is a way to showcase your creative/artistic skills. You have the creative liberty. \n\nSome have a theme for their portfolio and different works of art for it. Some create an assortment of their clicks, sketches, paintings etc.\n\nGoogle for B Des portfolios. You will get a good idea"
    },
    {
      "id": "jip9frt",
      "body": "\n\n* What course should be taken in 11th and 12th?\n- Any stream can apply but some colleges ask for PCM for product design and few other specializations\n\n* What competitive exams should be written to join BDes, and what type of questions are asked?\n- In Bangalore, most colleges have their own admission tests apart from UCEED, NID. All of these are aptitude tests. Some have a sketching/illustration based test too\n\n* What stuff do you learn in BDes? \n- Depends on the course you pick. Interior design, fashion, product design to name a few. Most colleges have the curriculum uploaded on their site. Check them out for better insight \n\n* What is the fee structure?\n- Again depends on the college. From 80-90k to 7L per year. This is just tuition fee. Hostel and other charges are additional.\n\n* Any other colleges with BDes\n- Shristi Manipal, RV, PES, Jain, Alliance, Presidency to name a few in Bengaluru"
    }
  ]
}