{
  "id": "12yjg34",
  "title": "Is pes good for bsc psychology",
  "content": "I really wanna know if pes is good for bsc psychology. Ik that there are other better colleges to do psychology but most of the good ones only offer ba psychology and I wanna do bsc. I also  know that pes is good for engineering but I have no idea how good it is for other bsc courses.\n\nInitially I did wanna apply to christ but after doing some research (reading endless reddit posts) I came to the conclusion that I wouldn't want to go to such an institute that's so rigid and don't gaf about individuality.\n\nHonestly speaking pes is the only good option for me atp. I really need your advice.",
  "metadata": {
    "root_comment_id": "jhnnpix",
    "post_id": "12yjg34",
    "author": "Eastern-Masterpiece9",
    "url": "https://www.reddit.com/r/PESU/comments/12yjg34/is_pes_good_for_bsc_psychology/",
    "permalink": "https://reddit.com/r/PESU/comments/12yjg34/is_pes_good_for_bsc_psychology/",
    "score": 2,
    "upvote_ratio": 0.7599999904632568,
    "created_utc": 1682429288,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jhnnpix",
      "body": "yeah man same here😭\ni applied and got in as well and rn its literally the only option for me\n├── PES is good only for Engineering Courses especially Computer science . Don't join this course over here \nIt's a tech heavy college \nConsider Christ University for Psychology in Bangalore. \nYou will meet more like minded people and some great faculty. \nOther suggestions would be liberal arts colleges \nFrom PES Student\n│   └── i tried for christ and i didnt get in and my only other option is jain other than pes. I read the reviews for jain online and they do not seem to be okay\n│       ├── Still I won't recommend PES .\n│       │   ├── How are the faculty members? How is the placement for this course? Another advantage is that this is  4 year course compared to other 3 year courses. Additionally, How are the people in this course?\n│       │   │   └── >rogram is almos\n\nhows it?\n│       │   └── Why not?\n│       │       └── Multiple reasons but the biggest one being that PES mostly focuses on engineering, this matters a lot coz college won't take any major decision that benefits your interest.\n│       ├── Hey what about Ramiah. They also offer bsc psychology.\n│       └── yes me too what did you end up\npicking?\n├── Did u try to apply in ramiah? Their program is almost similar to what pes offers\n├── Hey how easy is it to get into pes university for bsc psychology?\n├── Hey can I know which university did you choose to proceed with your bachelors studies \n└── Heyyy... Which one did u choose now?"
    },
    {
      "id": "jleyxpp",
      "body": "OP which campus apparently there are 2 main campuses in Banashankari the big or the small?\n└── I don't really know about that. I thought there's only 1 campus in banshankari."
    },
    {
      "id": "jp390j3",
      "body": "yeah same here... i got in and i do like the course overview but am kinda confused if it is actually good\n└── hey did u get into pes? how is the course there overall? could u please help me out as im applying this year"
    },
    {
      "id": "jq06mli",
      "body": "same here 😭 pes is basically my only option rn and I've gotten accepted already, can anyone tell me if the faculty members are good? i only saw two of them in the online orientation program and one in my interview\n└── There was a online orientation program???\n    └── yes!! it was back in February iirc, and they talked at length about the program, what we're going to be studying, a whole syllabus overview and at the end they answered all and any questions the participants had (around 140 people were present). they also talked about scholarships and how to obtain them, etc. i applied for pessat in Feb and got accepted back then, and the online orientation was a few days before my interview\n        └── Hi,  Are you in Pes right now? If yes then, how is the course? I've been planning to apply there so can you please help me out to know how it is?"
    },
    {
      "id": "l1006gc",
      "body": "i got into jain and pes and my christ university entrance is next month which should i pick? what is advisable? @op\n├── Which one u hv opted..\n├── Would not recommend Jain. I graduated from there and it had has to have been one of the most underwhelming experiences I’ve ever had. Avoid Jain’s psych course at all costs\n│   └── Hey implannimg to join may ik the reason\n└── Where u hv opted then pls suggest me good options for bsc psychology "
    },
    {
      "id": "l7265mh",
      "body": "Is pes good for bsc.psychology, as unfortunately I couldn't get into Christ "
    },
    {
      "id": "l8zjij7",
      "body": "Hey I even wanna know about the same hv another option of Jain,Manipal n Alliance University.In Christ also thy r giving offer for BA psychology(Delhi campus)..Plz can one help me with this"
    },
    {
      "id": "laszq6p",
      "body": "Did u choose PES? Cuz im at this same point and idk what to do"
    },
    {
      "id": "lsc9vfb",
      "body": "Hey... I'm planning to join for pes university for BSC in psychology next year... Pls do tell me how's everything there??\n└── what have you finalized,i'm in the same boat as you\n    └── So ur planning to do bsc psychology? Do uk any other good clg?\n        └── yeahh,idek i have also applied for christ\\[ik i wont get into it\\]so has to have some other alternativess\n            └── I too didn't get into Christ but I was already accepted at PES... So getting into PES now"
    },
    {
      "id": "lscbspx",
      "body": "Guys pls tell if pes is good for psychology 😭 \nIf not, recommend any other good university for BSC in psychology in Bangalore"
    }
  ]
}