{
  "id": "135992s",
  "title": "Attendance",
  "content": "How strict is the 85 percent attendance rule ? If we maintain our attendance around 80, is it enough for writing esa ?",
  "metadata": {
    "root_comment_id": "jiitg9z",
    "post_id": "135992s",
    "author": "Awkwardab1304",
    "url": "https://www.reddit.com/r/PESU/comments/135992s/attendance/",
    "permalink": "https://reddit.com/r/PESU/comments/135992s/attendance/",
    "score": 8,
    "upvote_ratio": 1,
    "created_utc": 1682995893,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jiitg9z",
      "body": "Ya it's enough. I had dot 80% in Mechanics SEM 1\n└── Perhaps, last sem they were lenient as it was 1st sem"
    },
    {
      "id": "jij1wak",
      "body": "It depends if you're in ece or cs. I'm in ece and I had my attendance in 50s in Sem 3 and 4 and they didn't really care or ask me anything. I believe they ask for affidavit and medical certificate for cs ppl\n├── And for 2nd sem,where we are a part of the science and humanities department ?\n│   └── I'm not too sure as we had 90+ becauase it was online. But usually S&H is really chill\n└── Wait 50's?? And still they let you write esa??\n    └── Yeah I had already got my hall ticket by the time they released the attendance list so it was peaceful only\n        └── better to say you were lucky that time..\n            └── nah, i confirm i had 50s too and wrote exams this time i have 40s also still havent been asked anything\n                └── Thats a good news though.. Since I too am from ECE dept\n                    └── Which campus tho?\n                        └── rr"
    },
    {
      "id": "jij5dde",
      "body": "If you're in eee, keep 85.\n└── I keep a 78 and they let me roll.\n    └── Lucky you. They never let that pass in my time.\n        └── what year did you graduate in?\n            └── 2022"
    },
    {
      "id": "jio0cup",
      "body": "The attendance form for club states that the attendance should be above 80% and 70% even with club shit so 80 above is fine they tell 85 for safer side"
    },
    {
      "id": "jio4qrt",
      "body": "I garduated 10 years back. Great to see some problems are constant, lol."
    }
  ]
}