{
  "id": "137hayo",
  "title": "Third Year PESU Student Seeking Advice on Internships and Upskilling",
  "content": "Hi fellow PESU students,\nI am a third-year student and I am currently struggling to secure an internship for the upcoming summer. I am interested in pursuing a software-oriented internship or an internship related to data analytics/machine learning, but so far, I haven't had any luck.\nI am considering upskilling myself by taking some online courses or working on personal projects. However, I am not sure if this will be enough to make up for not having an internship experience.\nI would appreciate it if some of the seniors who have gone through this process could share their insights and experiences. Is it okay to upskill myself instead of having an internship? Or should I keep trying to secure one? Any advice on how to approach this situation would be greatly appreciated.\n\nThank you in advance!",
  "metadata": {
    "root_comment_id": "jiuvzvy",
    "post_id": "137hayo",
    "author": "Huckleberry-4915",
    "url": "https://www.reddit.com/r/PESU/comments/137hayo/third_year_pesu_student_seeking_advice_on/",
    "permalink": "https://reddit.com/r/PESU/comments/137hayo/third_year_pesu_student_seeking_advice_on/",
    "score": 13,
    "upvote_ratio": 1,
    "created_utc": 1683198292,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jiuvzvy",
      "body": "Actually not getting a summer internship is way more common than getting one. Most people struggle to land one regardless of their skills so don't be too harsh on yourself for not getting one. \n\nIf you haven't found one yet, it's unlikely you'll find one before the summer internship season starts. I'd suggest focusing on placements and working on your capstone in the summer. You could also try working with a professor on any project, that will help you secure a good LoR as well (ofc depending on how you perform). Focusing on placements will help you do better in placement tests (which start from July end) and working on capstone will reduce the workload next semester (which is already packed with coursework and placement tests). \n\nDon't worry, not having 2 months of summer internship experience won't be a deal breaker for companies coming in. Instead of being gloomy about it, focus on what you can do and make.the most of the time you have.\n└── Aaah i see, was getting kinda stressed because all my friends were getting internships for the summer but at the same time I wasn't able to focus on any of my interviews because all I kept thinking about was how much i needed a break from all this academic stress......\nThank you for the insights\n    └── No issues. Final year is a pretty important year with a lot of things on your plate but if you play your cards right and prepare for each thing in advance there won't be any stress at all. Make the most of your time during the summer so the stress and workload relaxes throughout the year. Good luck!"
    }
  ]
}