{
  "id": "13fmpbo",
  "title": "Hello.",
  "content": "Hey everyone! I recently completed my 12th grade and I'm looking to join PES University for a B.Tech program in biotechnology. I have a couple of questions and would appreciate any insights or experiences you can share.\n\n1. Is PES University worth joining?  I'd love to hear from those who have firsthand experience or knowledge about the institution.\n2. Specifically, how is the biotechnology program at PES? Any information on the faculty, curriculum, research projects, or industry connections would be really helpful.\n\n Edit: Thanks for all the information guys!",
  "metadata": {
    "root_comment_id": "jjvn3s9",
    "post_id": "13fmpbo",
    "author": "TheGamerBoy489",
    "url": "https://www.reddit.com/r/PESU/comments/13fmpbo/hello/",
    "permalink": "https://reddit.com/r/PESU/comments/13fmpbo/hello/",
    "score": 4,
    "upvote_ratio": 0.8299999833106995,
    "created_utc": 1683901557,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jjvn3s9",
      "body": "Biotech is useless in India. PES is mainly known for the ads, not real education. You should do BioTech only if plan to do masters overseas and look for a job over there only. Indian degree will get you a 30k salary at max.\n└── I have plans of doing master's abroad. But would PES be satisfactory for btech?\n    └── naah..i forgot that  even biotech dept existed in our college..they had apparently civil branch..pes is know to have  brand value because of the students..i mean they increased the brand value .."
    },
    {
      "id": "jjvvip6",
      "body": "I graduated from PESU in 2022 with a CSE degree so I cannot answer about biotech, but I can answer about PES in general.\n\nScroll just a little on this subreddit and you will see that almost every other post is about what kind of a shitshow PES is. Every college has its own share of problems, no denying that, but PES is just a business that keeps draining out your money and energy without any concern for quality of education.\n\nDisaffected and unequipped management, dissatisfied profs who are also incapable of teaching and also literally not qualified to teach (a LOT of them have left - there are almost no good ones left), rigorous schedules giving you no time to even take a breath and absolute shitshow planning of syllabus and courses will plague your 4 years here. Add to that, you will not be able to do anything besides college work because you are always running between tests and other course deliverables. You will be under constant pressure worrying about the next test, project, lab etc. Club activities do happen but most of them are a fraction of what they used to be. Fests as well.\n\nPES' reputation is built from CSE placements alone, nothing else. What seems like a pretty solid University has gaping holes from the inside which cannot be fixed anytime soon. You will only get to know about its flaws once you join because all you see in the papers and other ads are the packages people get (which as I mentioned, are mainly CSE). Additionally, if you are targeting Biotech, I'd suggest to only join if you have no other choice. Its pretty much an ignored branch here (once you join you will realise how non-CS branches are treated like crap) and besides the placement statistics won't accurately depict your situation in 4 years.\n├── Thanks for enlightening me on the situation. I was considering PES because of the brand\n│   └── join if u want to get placed in a good companies, lastly i would say join here at ur own risk.\n├── is there any other redeeming quality of PES apart from its CSE placements?\n│   └── The campus infra (not the campus itself tho) is good, updated syllabus so students are always in touch with the latest stuff in the industry. \nTho even the CSE placements are not that good this time compared to previous years.\n│       └── The syllabus might be \"updated\" but the syllabus of most courses is planned terribly and ineffectively. They claim it is updated by just briefly touching these topics, enough to make you aware of their existence but nowhere near enough to understand them. Note that this is based on my batch's syllabus, but I doubt much has changed.  The \"updated\" syllabus is mostly in name only from my personal experience.\n│           └── Yaa that's actually true, they don't go in depth, but just a overview of the topics as u said. For practical purposes you are pretty much on your own.\n└── But would be worth if I join PESU for solely CSE? The things you mentioned are same for CSE too?\n    └── Buddy the things I mentioned are regardless of branch. CSE at PES is going through a bad scene right now - all good profs have left, placements have sucked this year because of hiring freezes, well-known research clubs have shut down and research professors have left their jobs to go back to working corporate. There is nobody properly equipped to teach because in reality there is nobody who knows the subject matter well anymore (there have been instances of profs teaching incorrectly as well). Here you will find the same prof taking up courses across a wide spectrum of even unrelated topics because there is nobody to take these subjects so they assign someone who can barely get the job done. All CS clubs are barely functional and exist mainly in name only. The syllabus is updated, yes, but its mainly in name only. You will be taught barely 10% of the skills to get a job and if you don't individually prepare yourself for the industry you really won't get placed anywhere because this place won't teach what is necessary. If you do get placed, its all because of what you have achieved on your own, this place will not contribute anything besides bringing the company to campus.\n        └── Thank you, I understand now"
    },
    {
      "id": "jjwe01v",
      "body": "PESU was good. Now, most of the good professors are leaving and the rest are overworked. They are burnt out and unable to focus on teaching and research. Management will not give two shits about what you are going through. u/rowlet-owl pretty much put a very accurate description of what it's like. If you want to come to an engineering college solely to study, get burnt, and graduate after some money down the drain, come here. I'm from the electrical department and there is so much politics amongst just like 12 professors. A lot of Biotech students I know did get along with their professors and did some nice research ig, but I definitely suggest talking to biotech students as it is kind of ignored.\n└── 100% agree...,here   ece  , eee are a complete torture.. u will face a lot of  burnout as you enter ur respective branches..weekly exams, learn some useless stuff as in when it comes to placements u will understand whether i have learnt something in my core field of study or not. Syllabus not getting completed on time and useless lab experiments ..except for few but most are like having free time.  Studying thru slides and notes is enough. (2019 batch..graduating this year..as i am from ece branch.. this is what i felt..but  overall it is a journey of ups-downs.\n    └── Everybody is burnt out. You, the professors, the cleaning staff. Everybody.\n        └── There are some departments that are being planned to shut down as well like civil and mech. I heard a few rumours about profs from these departments slowly undergoing training in other departments just so PES can hold on to them. It's a pathetic situation right now.\n            └── I'm not even surprised. \nTotally unrelated but ik who you are irl"
    }
  ]
}