{
  "id": "13gitaj",
  "title": "I need help regarding pessat.",
  "content": "I didn't study, nor I have any motivation. I will be writing pessat. please let me know what all I should do for getting cse or ece in rr campus. I got just 75% in boards. I want to start from zero, I booked last slot for the exam. I am lost and sorry, idk where to post or take guidance.",
  "metadata": {
    "root_comment_id": "jk04ifo",
    "post_id": "13gitaj",
    "author": "Specialist_Shoe_9211",
    "url": "https://www.reddit.com/r/PESU/comments/13gitaj/i_need_help_regarding_pessat/",
    "permalink": "https://reddit.com/r/PESU/comments/13gitaj/i_need_help_regarding_pessat/",
    "score": 10,
    "upvote_ratio": 0.9200000166893005,
    "created_utc": 1683987535,
    "flair": "PESSAT",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jk04ifo",
      "body": "Idk when your exam is but make sure you're prepped with CET level of difficulty minimum. Expect questions from the same syallbus, but the question themselves might be a little tougher.\n└── the exam is on 4th june, where can i prep for cet level?\n    └── attempt tests on embibe"
    },
    {
      "id": "jk04jkj",
      "body": "hmm..don't worry about that ... i am sure u will get in. I suggest you to first keep a list of formulas when it comes to mathematics , physics, physical chemistry ..revise them daily then practice along with that practice some  ncert problems like 1-10 daily  from each subject. Study organic chemistry..from ncert ..i think ncert is enough when it comes to chemistry.Building basic concepts are important ..during my time they asked basics so i was able ..then practice a few medium- higher level questions that come for cet or bits (in case u have written)...Then we have english..i dunno much about that but knowing synonyms and antonyms , reading comprehension..just basics i think. Don't worry if u don't get here i am sure there are better colleges out there.\n├── like try getting into BMS , ramaiah..etc.\n│   └── I need cse so through kcet it is impossible\n└── thank you sirr I already started maintaining a formula book.i am not eligble for bits because I got 74% pcm. but it doesn't matter I want to get into pes because it seems the only possible one as i have around 20 days time. thanks once again"
    },
    {
      "id": "jk0rxhv",
      "body": "Are you tall like 5'11''+?\n\nif you are and the dude in front of you is smart then you can get branch u want\n├── Realest advice\n└── I am 6'1 lol"
    },
    {
      "id": "jk2kchn",
      "body": "Go through previous year questions (chapter wise )of KCET . Identify your strong subjects and topics and try focusing on them . Maintain a formula book."
    },
    {
      "id": "jk38t1g",
      "body": "i was like you last year and i got eee seat offer at rr campus in the very end(7k rank). I had already claimed a seat thru comedk by then .\n└── Now are you in PES?\n    └── As I said, I had already locked in a seat thru Comed-K so no."
    },
    {
      "id": "jk43kov",
      "body": "Just prep at kcet level at least and ur good, I’m sure u can get in at least ec campus if not rr"
    },
    {
      "id": "jk7vne7",
      "body": "Feels bad man..I mean no offense to OP but i thought PESU had some brand and only smart people who could not crack the likes of IIT's,NIT's and BIT's came here...sad to see literally anyone can get in now without even studying :("
    },
    {
      "id": "kzvgpx3",
      "body": "What was your pessat rank?"
    }
  ]
}