{
  "id": "13huzra",
  "title": "Bcom vs acca",
  "content": "I passed out 12th this year. I have decided to take bcom. But I'm confused between bcom and acca. I initially planned to take bcom hons but they are saying placements are better for acca as mnc and big 4 prefer acca. Could any of you who are already taking the above courses give your suggestions.\n\nEdit: I heard that there is a student in ec campus who is doing both. If possible can someone please share their contact 🙂😅",
  "metadata": {
    "root_comment_id": "jkbhm46",
    "post_id": "13huzra",
    "author": "[deleted]",
    "url": "https://www.reddit.com/r/PESU/comments/13huzra/bcom_vs_acca/",
    "permalink": "https://reddit.com/r/PESU/comments/13huzra/bcom_vs_acca/",
    "score": 3,
    "upvote_ratio": 0.800000011920929,
    "created_utc": 1684117896,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jkbhm46",
      "body": "You can do bcom plus acca tho it will mean a more hectic schedule.\n\nCA isn't the only certificate. I'd advise you to go through all the options (cma,cs,cfa,frm etc) and decide based on what you find interest in the most.\n\nDo you plan on doing an MBA in the future? CA won't help you if you do but the other certifications might. \n\nDon't settle down on CA so early or you might regret it\n└── Thanks. I'm mostly deciding between the ca route through bcom hons or acca through bcom with acca. This is because I'm more interested in accounting background.\n\nI might do mba but that would be to get additional skills and not to get into managerial roles.\n    └── definitely bcom+acca, at least you'd have a good security backup degree. Also why are you considering pes for bcom?\n        └── Yes. I have sent a mail to shift. Yes having a secured degree is the main reason I took this decision yesterday. \n\nI chose pes because they don't have languages. I didn't want that extra burden which is completely unrelated to what I'm doing.\n            └── wdym by languages?\n                └── In other colleges it is mandatory to take up languages. Hindi or kannada or else foreign languages\n                    └── have you considered outside Karnataka colleges, I'm sure many won't have this rule\n                        └── Yeah but I don't want to go out now"
    },
    {
      "id": "jkddv60",
      "body": "u/babumastanu what are you studying in pes currently?\n└── I'm not in college bro"
    }
  ]
}