{
  "id": "13k2x29",
  "title": "Is there any negative marking in pessat this year??",
  "content": "(Asking for a friend)",
  "metadata": {
    "root_comment_id": "jkigi8e",
    "post_id": "13k2x29",
    "author": "throwawayeet31",
    "url": "https://www.reddit.com/r/PESU/comments/13k2x29/is_there_any_negative_marking_in_pessat_this_year/",
    "permalink": "https://reddit.com/r/PESU/comments/13k2x29/is_there_any_negative_marking_in_pessat_this_year/",
    "score": 5,
    "upvote_ratio": 1,
    "created_utc": 1684332711,
    "flair": "PESSAT",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jkigi8e",
      "body": "Nope, there is no negative marking pessat, pessat has never had negative marking"
    },
    {
      "id": "jkj1eki",
      "body": "Nah infact seats are increased and fees too so competition may decrease\n└── so what is the new fee structure?\n    ├── i think it's 5 lakh per annum in total now\n    └── 4.5L per year looks like at this pace it will take over manipal bits in fees structure\n        └── Then should I join pesu through pessat??\nAnd what about the ROI?\n            └── What are your options\n                └── Basically I was a neetard whose neet didn't go too well\nAnd as a pcmb student + a person who lives in banglore, I'm going to be writing cet+pessat so pesu is the backup plan for me if I'm going into engineering\n                    └── Should have rather written comedk as back up, but roi is almost not good in any pvt college,  but still pes is a good college,  almost all colleges would cost you ~5Lpa nowadays unless thru kcet or comedk , imo if you get into pes do well there you can get amazing roi\n                        └── Oh okay thank you\nTbh I just missed the deadline of comedk and I'm going to write cet so it won't be a issue ig, so I took pessat as a backup as it is know as a good private college in Bangalore\n                            └── Yup most pvt colleges are good in karnataka dw. I told comedk cuz it's easier exam and easier to get in thru it\n                                └── As per my north indian friends, there are many students taking comedk this year so the cut off would go higher than expected as the jeetards whose jee missed by some percentile are taking comedk as a backup\n                                    └── Bro every year same thing is told and barely 60k ppl end up writing the exam, half of them don't even know any other college other than rvce"
    }
  ]
}