{
  "id": "13lw7mh",
  "title": "pessat marks and cutoff",
  "content": "how much marks do i need to score to atleast secure ece in rr campus...i know pes does not releases the marks but still if anyone know something/ approx figure then please help",
  "metadata": {
    "root_comment_id": "jkrx3bo",
    "post_id": "13lw7mh",
    "author": "Traditional-You2708",
    "url": "https://www.reddit.com/r/PESU/comments/13lw7mh/pessat_marks_and_cutoff/",
    "permalink": "https://reddit.com/r/PESU/comments/13lw7mh/pessat_marks_and_cutoff/",
    "score": 3,
    "upvote_ratio": 1,
    "created_utc": 1684504690,
    "flair": "PESSAT",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jkrx3bo",
      "body": "Cfbr \nPes releases rank only \nMarks is not released\n└── Would you recommend me taking eee or ece in pes if i don't get any college? I come from middle class family and 4 for ece and 3.6 for electrical is huge if ROI is not good otherwise i can pay the fee\n    └── In general, the other non-CS branches here cannot keep up in terms of opportunities and placements at all. While the branches you mentioned might not be *bad* here (maybe someone else can confirm), they might not be worth the fees you'll end up paying. Join PES only if you don't have any other choice."
    },
    {
      "id": "jks59s9",
      "body": "https://shas.reeee.ee/63318ogwr\n├── my savior 😭 ive literally been searching the ENTIRE INTERNET for this... crazy how someone somewhere on reddit is bound to have something lol\n│   └── lol what's your rank?\n│       └── 742 😎\n\nyours??\n│           └── just 3k ranks behind you :')\n│               └── oh dangg you'll still get smtg in ec campus tho right?? or just go to a diff clg w eamcet or kcet or whatever\n│                   └── idk I think I might get ece there but I performed worser in all other exams.\n│                       └── ahh oof :(( same here my mains rank was terrible... either way good luck my dude, i'm sure it'll all work out eventually :)) i'm always here if you wanna vent or just talk or some shit\n│                           └── sure all the best to you too 😭🫂\n├── Thankyou so much\n├── THANK YOU FOR THIS. \nRedditors to the rescue 🥲\n└── Hey can you repost theink it isn't working.\n    └── I'm sorry, I lost the image :(\n        └── Do you study in PES ? I have some doubts\n            └── no, i joined some other clg which comes under vtu I guess"
    }
  ]
}