{
  "id": "13mm514",
  "title": "How is CSE placements for ECE students? How many clear? what package can they expect?",
  "content": "",
  "metadata": {
    "root_comment_id": "jkwn8fv",
    "post_id": "13mm514",
    "author": "AdeptnessExtension91",
    "url": "https://www.reddit.com/r/PESU/comments/13mm514/how_is_cse_placements_for_ece_students_how_many/",
    "permalink": "https://reddit.com/r/PESU/comments/13mm514/how_is_cse_placements_for_ece_students_how_many/",
    "score": 10,
    "upvote_ratio": 1,
    "created_utc": 1684571217,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jkwn8fv",
      "body": "My answer is based on the observations I made during my batch's placements (2022 outgoing batch). \n\nCS companies let CS, ECE and very rarely EEE kids also sit for their placements, but unless you're in CSE, there are very few chances of you clearing the test (without prep that is). Even if you do have prep, the number of CSE kids getting shortlisted for interviews is much higher. When they'd list out all the students who would get selected for the interview rounds, there would be only atmost a handful of other branch students compared to CS, so in all likelihood you won't clear the test itself. If you do manage to clear the test, you need to sit for interviews which are heavily based on CSE theory and practical concepts, which you wouldn't have covered. Even if you try to make efforts on your own, it is highly implausible to cover everything to the level that you can answer those questions and gain that level of understanding you need to clear the rounds. Even if you do clear all the interviews, companies still can show a little bias and select a CS kid with the same profile as yours based on the assumption that they might have the skills the job needs or they can pick it up faster (a bad assumption, but it does exist).\n\nWe'd see maybe one or two students a most here and there getting selected for CS placements. In over 90% cases they're all CS kids. If you get selected by a company, you'll earn the same package as the CS kids. But it's going to be a miraculous task to study on the side and get selected. It's even more competitive trying to find a job off campus.\n\nIf you're giving the entrance tests you are strictly looking for CS placements, you have a higher chance of being in CSE and getting a CS job at PES than in other branches. And if you're interested in CS in general, choose the branch over the college (my personal opinion, people can have theirs)."
    },
    {
      "id": "jkxdcj9",
      "body": "Adding to rowlet-owl said as the placements are still going on(2023 outgoing)..I would like to share u certain things that i have observed during  placements..especially cs companies..do hire a lot from cs ..but a very few ece students get hired..now the reason for this could vary from company to company some companies..one could be because..their choice..they want  more of  cs students as they are know more acquainted with technical skills that they require ..then ece students , other could be use for shortlisting because of gpa factor for writting the first round or because of the competitive skills that they..possess.etc.so i would say cs do a lot of chances..than ece students but that does n't mean ece student can bag a 10lpa offer or more than that..all u need to make sure is that u learn , practice  dsa in programming language of ur choice very well , os , dbms ,sql (basics --intermmediate) along with that add some real time or mini projects in ur cv.. remember that whatever u have added in resume..u should be prepared to answer it..when it comes to interview not only that try keeping  8 gpa above it will give u  higher chances to get shortlisted for 1st rouns .For ece branch u can expect 43lpa(provided u are good at  dsa and the other subjects i have mentioned above) also most of the ece students who have been placed in cs companies have got around 14lpa+ but it depends on company at the end ..it is possible that u can to get the same package as cse but it all depends on jd.If you have any other queries or want to more info ..feel free to dm me.I  wish u all the best for ur placements!!\n└── Thank you!! I have dmed you."
    }
  ]
}