{
  "id": "13r8ntg",
  "title": "Got 284 in boards and getting around 81 in KCET. Is there any hope for below 10k?",
  "content": "",
  "metadata": {
    "root_comment_id": "jlj5rkj",
    "post_id": "13r8ntg",
    "author": "AdAlternative11",
    "url": "https://www.reddit.com/r/PESU/comments/13r8ntg/got_284_in_boards_and_getting_around_81_in_kcet/",
    "permalink": "https://reddit.com/r/PESU/comments/13r8ntg/got_284_in_boards_and_getting_around_81_in_kcet/",
    "score": 4,
    "upvote_ratio": 1,
    "created_utc": 1684991636,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jlj5rkj",
      "body": "You \"May\" get ig cuz I saw a vid where that guy showed how to calculate the overall %tage and if its above 70%, there is a good chance you are under 10k rank\n\nYours is 69.83% so good chance you get it, however 40k more applicants sat for KCET this time than last year\n├── I really believe the surge in applications this year was because more children passed (almost 10%+ increase)\nThis year is really unpredictable :/\n│   └── Ikr sucks same thing happened in jee lol so the cutoff increased by 2.3%tile \n\nI wish the rank estimates from last year are valid this year lol\n│       └── And this year paper was tough so if anything the rank should be better compared to last year for same score..... but who knows.... comedk is also highly competitive this year,  my last hope is pessat 😭\n│           ├── Ikr   \nSame lol my last hope is PESSAT too got it on 28th May.\n\nDid you tally your KCET score? How much are you expecting?\n│           │   ├── My % is 76.9... according to the analysis video and previous year cutoff I should be getting below 5k. \nBut I really don't know at this point . Some say I should expect till 8k so im hoping for the best 😭\n│           │   │   ├── That's good congrats\n│           │   │   └── DM me your marks, I will help you predict your rank\n│           │   │       ├── Can I DM you too? If that's ok\n│           │   │       │   └── sure np!!\n│           │   │       └── 277 pcm, 123 kcet, whats it gonna be brudda\n│           │   │           └── 3k-5k brudda\n│           │   │               ├── mate i got 2306, what you on about\n│           │   │               └── mate i got 23xx what you on about\n│           │   │                   └── Congrats.. I love it when people prove me wrong/ when I prove people wrong :)\n\nProlly ur kcet marks saved you..\n│           │   └── how much are you expecting?\n│           │       └── 110-115\n\nbut only 250 in boards CBSE\n│           └── trust me, pessat seat will drain out your pockets\n└── hopefully you're right :("
    },
    {
      "id": "jljdomg",
      "body": "We're in the exact same position homie..hopefully it goes down because the papers were tough this year\n└── fr. comedk and pessat is our only hope :')\n    ├── Comedk has the highest competition this year man 😭😭 70% applicants outside karnataka ffs 😭😭😭\n    │   └── at this point, I should just settle for dayanand sagar man. sucks.\n    │       └── DSCE bhi nahi milega aisi situation hai meri 🙂 (it's a decent place tho)\n    │           ├── 76.9 is pretty good mate, you'll get aiml at least with those marks\n    │           └── Bro you getting like 3.5k rank you'll get in PES or BMS atleast so chill\n    └── Welp I forgot to register for COMEDK so pessat is the last hope lol"
    },
    {
      "id": "jloh7l1",
      "body": "bro how much u getting (provisional answer key released)\n└── 78:( wbu\n    └── 84"
    },
    {
      "id": "jltbvot",
      "body": "hopeless"
    },
    {
      "id": "jo34v25",
      "body": "Im screwed. 274 and 90 in kcet. 70% total. Any hope for under 10k?\n└── What was your rank\nTomorrow is kcet for 2024:)\n    └── Around 16k oof. All the best for Tom!\n        └── bro can i consider taking drop  plz reply bro next year i want to go in top 5 clgs in blr this year even i got 70% total"
    }
  ]
}