{
  "id": "13rrjas",
  "title": "Want to know about AIML",
  "content": "So I'm trying to get into PESU this year and initially I wanted CSE but this year KCET was tough and there's no way I'm getting CSE here so I wanted to know if AIML is a good alternative or not. Any advice would be appreciated :)",
  "metadata": {
    "root_comment_id": "jlnpj50",
    "post_id": "13rrjas",
    "author": "No-Independent-9209",
    "url": "https://www.reddit.com/r/PESU/comments/13rrjas/want_to_know_about_aiml/",
    "permalink": "https://reddit.com/r/PESU/comments/13rrjas/want_to_know_about_aiml/",
    "score": 9,
    "upvote_ratio": 1,
    "created_utc": 1685044508,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jlnpj50",
      "body": "The general advice is - if you get CSE prefer that over AIML , I'm not sure how valid it is , but it should more or less be the same.\nHow much are you expecting rank wise? If cet was tough,  it will be tough for everyone brother , so your rank might increase.\n└── Bro I'm expecting 110/180 and I've got 298/300 in boards. I could've easily scored 120+ but I messed up so bad. I think I may get a rank around 3k based on previous year trends\n    └── Bro paper was really very tough , keep your hopes up. Based on rh chemistry analysis (he's a very experienced teacher) you should get below 2k.\n        ├── Let's hope I do get somewhere around 2k. Even then CSE is impossible so can I go ahead with AIML or will I regret it?\n        │   ├── Based on previous year cutoff , you won't get CSE in RR campus , but you'll get It easily in EC campus even if your rank in 3k. \nAs rowlet-owl said , CSE>>>>AIML , that's the general preference (because with CSE you have more freedom of exploring other CSE fields like blockchain- with AIML youre locked down to AI stuff) . It really depends on what you want , and AIML branch is new so there have been no placements yet. If you get CSE in some other decent college or EC I'd say prefer that,  unless you really want to go to PES.\n        │   │   └── I'm a Bangalore resident and ec campus is not an option so it's either AIML here or CSE in BMSCE\n        │   │       ├── EC Is still in Bangalore no?\n        │   │       │   └── Yeah bro but too far it's in Bangalore but also not in Bangalore lol. Basically very far into the outskirts\n        │   │       └── If you have CS in BMSCE as an option, you should do some research into the course structures and see what fits you better. Ask current students about BMS, you've already read on this subreddit what a shitshow this place is\n        │   └── If you know what AIML is and can foresee what you're signing up for? Moderately okay choice - CSE is still a safer option but hey atleast you know that this is what you want.\n\nIf you're choosing it because of the current AI hype without any idea what it is, worst possible choice lol\n\nIf you're choosing it because except PES you don't have any option, we'll you don't really have any choice so might as well take it\n        └── Bro I got 257 in boards and 71 in cet (PCM). It's really bad ik, but what's my expected rank?\n\nI want to choose ECE in a college that's at least somewhat decent.\n            └── Based on an analysis list a teacher made , youll get below 30k~ but really can't say for sure. Might be much lesser, might be much higher. Paper was difficult this year but applicants were more.\nBest of luck man , hope you get a good rank and college"
    },
    {
      "id": "jlnr5xw",
      "body": "You can search for \"AIML\" on this subreddit and read what everyone has to say about it. I've posted my own views multiple times as well. \n\nTLDR is, don't pick it, pick CSE.\n└── Okay thanks"
    },
    {
      "id": "jlo3z57",
      "body": "AIML was introduced in 2022-23, infact no one knows how good it is yet as first years are yet to finish second sem and go to the third sem. From what I have heard, the key difference is that for electives, CSE ppl have a very wide range of choices (like cybersecurity, block chain,etc) whereas AIML ppl can only choose AIML electives.\n└── I'm not aware of what electives are. Tbh I haven't done much research about what I'll be doing in engineering so I'll give it a thought once I learn about it. Thanks a lot\n    └── If you haven't done your research then you *should*. Don't take branches without knowing what you'll be signing up for. AIML is a major hype train that everyone is joining now. Once they realise it's all math, calculus and probability more than CS, that's when it's too late. Always do your research dude."
    },
    {
      "id": "jlr0pvn",
      "body": "Guys I've enrolled in CSE aiml is it good \nAnd about pes University\nIs it really good?\nOr is it a torture house?\n└── wait what how already?\noh wait management kid aren't ya?"
    },
    {
      "id": "jlt3iz0",
      "body": "2020 Grad, doing PhD at the moment. \nGo for it, AI ML basically means, CS for first 2 years and the electives of AI ML offered to CS grads will be your compulsory courses.\nYes CS gives you a option to go for other domains but trust me, PES + AI/ML is a great combination. \nSpecially if you get through KCET, I was a Comed-K guy.\n\nYou'll get all you need from some good faculties, bangalore StartUps for internship, great seniors*, pesu-io type initiative. You'll love+hate the 4 years and after getting a 20+lpa package and joining corporate only love remains with nostalgia \n\nAll the best\n└── I’m curious how can you be a comedk guy? PES stopped accepting comedk students post becoming a University. I graduated in 2019 and there were no comedk students\n    └── No sir/Mam, I admitted in 2016 and graduated in 2020. I had I think some of my juniors coming through the same in 2017 as well. From 2018 admissions the college came under PESU so people admission in June 2018 onwards were all KCET and PESU admits\n        └── Ah okay the south campus. I thought you were from RR campus"
    },
    {
      "id": "l0uo61l",
      "body": "  \nAbsolutely, considering the challenging scenario with CSE admissions, AIML (Artificial Intelligence and Machine Learning) can be an excellent alternative at PESU. AIML is a rapidly growing field with vast opportunities in various industries like technology, healthcare, finance, and more. It involves creating intelligent systems that can learn from data and make predictions or decisions autonomously.\n\nAt St. Mary's, [AIML programs](https://stmarysgroup.com/cse-aiml) are designed to equip students with the skills and knowledge needed to excel in this dynamic field. You'll learn about cutting-edge technologies like deep learning, natural language processing, and computer vision, preparing you for exciting careers in AI research, data science, software development, and more.\n\nMoreover, AIML is not just a trend but a transformative force driving innovation and shaping the future. With St. Mary's strong focus on practical learning, industry collaborations, and research opportunities, you'll be well-prepared to thrive in the ever-evolving landscape of AIML."
    }
  ]
}