{
  "id": "13s58q9",
  "title": "is pes strict?",
  "content": "[deleted]",
  "metadata": {
    "root_comment_id": "jlo6k55",
    "post_id": "13s58q9",
    "author": "[deleted]",
    "url": "",
    "permalink": "https://reddit.com/r/PESU/comments/13s58q9/is_pes_strict/",
    "score": 9,
    "upvote_ratio": 0.9200000166893005,
    "created_utc": 1685082244,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jlo6k55",
      "body": "1. Dress code is taken seriously for courses that have been given a uniform (like bba, law and Hotel management). \n2. Bouncers are out there in the campus to catch you red handed for PDA\n\n(Edit)\n3. My professors are cool when it comes to attendance. I guess it depends on the prof and the reason for your absence\n└── Are the uniforms everyday ones?"
    },
    {
      "id": "jlohmpt",
      "body": "Is water wet?\n└── Technically Water by itself is not wet. It has the property of wetting things.\n    └── And it perpetually wets itself.\n        └── By your username I assume your expertise is not in water but a different kind of liquid."
    },
    {
      "id": "jloldh8",
      "body": "i know a senior who went through to pes, he says the entire college is shit\n└── That would be *every* senior lol. To be more accurate, that's every PES student the moment they finish their honeymoon period of joining the University, about 4-8 weeks\n    └── he told me the only plus is bangalore and nothing else, he begged me to not join it   \ni was spectical at first but browsing through this sub i think its true lol"
    },
    {
      "id": "jm6iyy1",
      "body": "Dress Code: Official dress code for all genders is shoes, shirts or collared t-shirts, any type of trousers. They don't really care though. As long as you're not wearing clothing that are really revealing, they won't do anything, whether it is Western or Indian. You can dress like you're coming to a fashion show or you could come in like you just woke up, in a round neck t-shirt and track pants. They don't care, although they would prefer you to come in dressed like the latter. Your professors don't care. They barely pay attention to it. As long as it covers the entire length of your leg, any trouser you wear is fine. Even ripped jeans are allowed. You'll only be in trouble if you're taking a course that has uniforms. Engineering students don't have uniforms.\n\nAttendance: 80% official but they're a bit lax in it too. There are ranges of attendance for which there are different punishments. If above 80%, you're good. Below that, you'll have to write an apology letter to the Chairperson of your department and also meet her and explain why your attendance is low. If your attendance still worse, your parents will have to write it instead. If it is below 60% or 65%, and you do not have any medical or any reason to explain, you won't be allowed to write the end sem exam for that particular course. You'll be asked to drop it and take it next sem.\n\nMoral Policing: No moral policing happens here. Honestly, nobody cares about others and their opinions or whatever others do. PESU professors and management has better things to do than moral policing. It's a fairly liberal college, to be honest. PDA is not allowed. Just don't make out in public or do anything above it. No smoking inside the campus. Don't bring alcohol to the campus or come to college drunk. Just treat others how you'd like to be treated and nobody will have a problem with you.\n\nPESU is fine with all these things. Only place where they are fucked up is when it comes to academics."
    }
  ]
}