{
  "id": "13t36ts",
  "title": "How is scholarship availed ?",
  "content": "[deleted]",
  "metadata": {
    "root_comment_id": "jlt1f8t",
    "post_id": "13t36ts",
    "author": "[deleted]",
    "url": "",
    "permalink": "https://reddit.com/r/PESU/comments/13t36ts/how_is_scholarship_availed/",
    "score": 4,
    "upvote_ratio": 0.8399999737739563,
    "created_utc": 1685180783,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jlt1f8t",
      "body": "U will get in second sem. They will send across a list of ppl who qualified where u will need to put ur UBI account number. After everyone's submitted, they will transfer the amount to ur account.A no balance UBI account is compulsory to get ur scholarship money. So don't forget to open one.\n├── During branch change ... Am I pay entire years fee ?? \n\nOne last q bro ... If I plan to transfer to other college during my 3rd sem am I supposed to pay the full fee of 4 years ???\n│   └── See basically u will be paying full fees every year, if u get good sgpa, they will deduct the amount from ur fees and give u. U won't be paying any lesser fees. \n\nNow changing branch is something based entirely on your cgpa and seat availability. If u change from let's say a EEE to CSE seat, u will need to pay the full fees,  based on the kind of seat u get. I don't know about KCET , but from a PESSAT perspective, if u change from something like EEE to CSE and get a PESSAT seat, u pay the entire PESSAT fees. If u get a management seat, u pay the management fees. \n\nIm not rlly sure if u r supposed to pay the full fees if u change in third sem, as some of my classmates in second sem changed their college after writing JEE in Jan and April. It's supposed to be illegal to charge full fees like that according to UGC. So I think it will be better if u enquired about it in the clg office.\n│       ├── I appreciate your patience for writing this answer after going through my question .. thank you.\n│       ├── Since 1st semesters result  gives scholarship to  2nd semester ... Is there any way i can get scholarship for 1st semester ??\n│       │   └── First sem results are announced in first week of second sem, after a few weeks the rank list will be announced where u can see for which kind of scholarship u have qualified for , and u will need to enter ur details there itself. U get the previous sem's scholarship in the successive semester, after the results of the previous semester are announced.\n│       │       └── Bro last question... Does EC and RR famous have same amount of holidays and exam dates?? \n\nSorry I'm ameture\n│       │           ├── Ya, everything is same for rr and ec. Only the campus infra is different 😂\n│       │           │   └── Then having 3 weeks holiday during winter and 2.5 months holiday during summer and every Saturday as holiday should be  quite a peacefull schedule...\n│       │           │       └── No we don't have 3 weeks in winter. 2.5 months are given for summer internships, but I don't know if u guys will have it after second sem, as we don't have it. Weekends are off. The internal exams pattern has been changed to make it less stressful, so it could be more relaxed for u ppl.\n│       │           │           └── Hey bro ... Is there anyway I can make the fee payment per semester ?? But not as whole the year ?\n│       │           └── Ya, everything is same for rr and ec. Only the campus infra is different 😂\n│       └── Were your friends charged to pay full 4 years fee when they changed college after jee mains after their attempt like your told?\n└── Thanks"
    },
    {
      "id": "jlwc8c3",
      "body": "Whatever you do, end of the semester, everything will be sorted out. I wouldn't worry. Just talk with the office and inform them of your situation."
    }
  ]
}