{
  "id": "13usitm",
  "title": "Selecting electives and specialisation",
  "content": "[deleted]",
  "metadata": {
    "root_comment_id": "jm2c4v9",
    "post_id": "13usitm",
    "author": "[deleted]",
    "url": "",
    "permalink": "https://reddit.com/r/PESU/comments/13usitm/selecting_electives_and_specialisation/",
    "score": 7,
    "upvote_ratio": 0.8999999761581421,
    "created_utc": 1685360620,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jm2c4v9",
      "body": "I'm from CS, but people tend to have similar questions. My suggestion would be picking the course over the specialisation. There is no concrete proof that the specialisation has helped, and at the same time there is no proof that the specialisation has not helped. If all your elective choices are from a specialisation, then well and good, else no harm done. Pick the course you want to study and go forward with it."
    },
    {
      "id": "jm2g6hu",
      "body": "In sem 6, you sometimes get preference based on your specialisation in picking your electives. But most of the time, I'd recommend juat taking what subject you enjoy. If you enjoy riscv and dvd and stuff go for VLSI electives and go for communication electives if you like communication subjects better. Don't worry too much about specialisation and all. Because some electives are like really hard and lack proper study material. Do some research on the portions and see if you like it and don't worry too much because even if u make a wrong decision, your electives change again next sem\n└── What are these electives which are harder than the rest ?? Are subjects like DSD,FFVDD,OR easier than the rest ?\n    └── yes they are raking in order of easiness\n\nor most easy\n\nDSD\n\nFFVDD  hard among the 3 still easier than  ann"
    },
    {
      "id": "jmmg9wg",
      "body": "short answer no specialization dose not have much importance \n\nconsider your cgpa first take something that boosts it specialization is a subjective topic but if u are low on cgpa i say stay safe take operations research its v easy its from winc domain and take dsd also easy subject \n\nif u are sorted on cgpa by which i mean 8+ try specialization in space domain its hard but it is helpful \n\nquantum is taken by bhaumik  u will have projects its fine but i feel or is a better option for E2 its scoring and your marks are in your hands with bhaumik is v random and there is no method to his correction so u will score fine but u wont be in a position to argue your marks in case u happen to disagree with his marking . That is my personal take on it i have taken in subject in 6th sem so am speaking with personal experience\n└── Specialization is important for certain universities abroad. it does have importance in *masters/MS Case*"
    },
    {
      "id": "jna0keq",
      "body": "I will try to give you some insights.\n\nFirst off, specialization is something that is very useful from both a *Masters/MS/MTech/PhD* and *placements* perspective. Whether or not you want to do it in NiCE Domain is up to you.So, your main confusion is about Quantum Computing Elective and E1 Electives.\n\na. Quantum computing & Quantum entanglement elective -*This is taken by Prof. Kaustav Bhowmik, and it has only 3 ISAs and ISA4 - project & ISA5 - project and ESA - Project. But project may not be so easy, as ESA project would be individual, not a team-based project.*\n\nb. E1 elective NiCE Domain - Digital system Design*Taken by Sudheendra Kumar, the subject is very easy for scoring and there are rumors that papers are leaked, but I think he has stopped leaking papers since last year.*\n\nc. E1 elective SPASE Domain - Digital Image Processing - 1   \n*subject is math heavy, but it is not as easy as Digital system design elective.*\n\nSo, in the industry/for placements, doing specialization in a particular domain will depend on your goals primarily.\n\nFinally, do Specialization if you like the domain as a whole."
    }
  ]
}