{
  "id": "13v40t7",
  "title": "Seniors pls help me choose sem V electives (context: I don't really care about subject passion and stuff and I'm an avg student) I need to choose a combo which is balanced scoring as well as something which helps me for my career in the future. (I have plan of persuing MS after clg)",
  "content": "Feel free to comment and give your 2 cents.. it would be welcome.. and thx guys.. PS I've heard that taking DA and BD together is not wise.. y is it the case..\n\n[View Poll](https://www.reddit.com/poll/13v40t7)",
  "metadata": {
    "root_comment_id": "jm3z7d1",
    "post_id": "13v40t7",
    "author": "Salty_Cook_777",
    "url": "https://www.reddit.com/r/PESU/comments/13v40t7/seniors_pls_help_me_choose_sem_v_electives/",
    "permalink": "https://reddit.com/r/PESU/comments/13v40t7/seniors_pls_help_me_choose_sem_v_electives/",
    "score": 10,
    "upvote_ratio": 1,
    "created_utc": 1685388369,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jm3z7d1",
      "body": "DA + BD is a heavy combination and frankly not for everyone. You'll definitely get to learn a *lot*, but you'll also be expected to put in the work for it and it won't come easy or straightforward. The courses are good and cover quite a lot of things you'd use in the industry (I literally work in Big Data Analytics and use most if not all of what I learnt in these courses). \n\nOn the other hand if you want an easy way out then these aren't the courses for you. I've heard that graph theory is relatively easy (and interesting as well). HCI used to be a pretty easy and straightforward course but apparently in recent years they've turned it into a nightmare.\n\nOverall, it also depends on the anchor prof, your assigned prof, and the syllabus along with your interest. If all of them align, the course will be easy. If they don't, it'll be difficult. Take a call after knowing who will likely be your prof and the syllabus and deliverables.\n└── Hey ... Yeah so If I had to pick one out of BD OR DA.. which is more fundamental... And what is in demand in the market\n    └── Instead why don't you pick something you're actually *interested* in? DA is a 90-95% mathematical course, it's mostly statistics, probability and algebra. There's a bit of theory here and there but it isn't much, most of your ESA paper will be numericals. BD has a fair bit of theory, but the hands-on components are unmatched and far better than any course in your entire curriculum. To answer your question - both are hot in the market, but that shouldn't ideally be your benchmark of comparison."
    },
    {
      "id": "jm459jf",
      "body": "You can take up GT and HCI….. not sure if they’re both in the same E2 bracket or not. Also, did they remove IOT option??\n└── Nah.. they had IOT last year, but I am not interested for sure\n    └── What are your options this time?\n        └── Haven't received the list yet.."
    }
  ]
}