{
  "id": "13xja1l",
  "title": "what’s the social life like?",
  "content": "[deleted]",
  "metadata": {
    "root_comment_id": "jmhvqyn",
    "post_id": "13xja1l",
    "author": "[deleted]",
    "url": "",
    "permalink": "https://reddit.com/r/PESU/comments/13xja1l/whats_the_social_life_like/",
    "score": 7,
    "upvote_ratio": 1,
    "created_utc": 1685630320,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jmhvqyn",
      "body": "Every time I read the word \"party\" in the same context as PESU I get reminded of that email the management sends out every year lmao\n\nFYI for those who don't know, every year just after freshers join parents are sent an email saying their kids are taking part in illegal activities on campus by taking part in parties and doing dangerous things thus making quite a few home environments chaotic. They also ask parents to keep a closer watch on their children xD.\n\nAlso, college isn't like what's depicted in movies/shows, atleast here. Get that image out of your head before your expectations get smashed to pieces in the first month. Nobody's throwing parties every other week - people are struggling to find time to breathe and relax here from the constant stress.\n\nFests have been discussed before on this subreddit, search and you shall find out more.\n├── 😭😭😭😭 i had too many expectations\n│   └── Read through the comments here, especially the rants. Yes some of them might be a little exaggerated, but they are still an accurate representation of the college to a good degree\n└── People in BMS enjoy their college life to the fullest. PES is just managed badly"
    },
    {
      "id": "jmidg8h",
      "body": "just go through this subreddit bro 😊"
    },
    {
      "id": "jmla2r6",
      "body": "It was nice because campus is pretty empty since most of us have summer break going on . Wait till once the full strength arrives ."
    },
    {
      "id": "jmmd32d",
      "body": "u dont enjoy in pes bro it is a lot of academics fest is decent at best if u wanna enjoy u either a chilled out boys group who is down for anything or need a gf"
    }
  ]
}