{
  "id": "13y9wvs",
  "title": "Guys wtf pesu has offline counselling?",
  "content": "Can someone answer a few questions?\n\nHow much money do you need and by when?\n\nWhat is the counseling process?\n\nAnd what are the cut offs for the last round of last year(feels like they are going to drop because who is traveling to blr for this)?\n\nHow long do I have to stay at pesu during counselling?",
  "metadata": {
    "root_comment_id": "jmlns0v",
    "post_id": "13y9wvs",
    "author": "Character_Visit_705",
    "url": "https://www.reddit.com/r/PESU/comments/13y9wvs/guys_wtf_pesu_has_offline_counselling/",
    "permalink": "https://reddit.com/r/PESU/comments/13y9wvs/guys_wtf_pesu_has_offline_counselling/",
    "score": 4,
    "upvote_ratio": 0.8399999737739563,
    "created_utc": 1685704927,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jmlns0v",
      "body": "On the day of counseling, you need the first year's pessat fee in two different DDs, the details of which will be emailed to you\nCut off for CS last year was around 1.2k in RR and around 3.5k for CS in EC\nYou will need to spend almost one full day at the campus\n├── Ah man are all counsellings this way? \n\nNot often have I seen colleges ask for money in the first round itself\n\nIg I'll apply for counselling if I have 3.5k in Pessat or something\n\nMy other options are Manipal Eni and Mechatronics and Manipal Blr IT and Ece and I feel like it'll be a better place to grow than PES tbh with how hectic the acads here are\n\nI want to pursue a master's abroad regardless so I don't think branch will matter alot \n\nI had a rather hardworking cousin whose cgpa plummeted so hard that he wasn't even getting a placement by the end of it despite being fairly bright\n└── They are asking in 4 different DDs this year though.\n\nDamn but 4.5L at once seems like a lot though I thought fees were to be paid semester wise.\n    ├── Man I really don't think I'll be taking Pesu up tbh \n\nThis straight up seems like scalping us for all we are worth had it been month or two's notification then we'd have been able to arrange the funds but it's impossible to gather 4 lakhs in 16 days\n    │   └── Yeah same here....  \nI think I will settle for ECE via KCET marks. At least total 4 years fees will be around 4L ish and here almost 5 L per year lol\n    │       └── Man in my next life I'll take birth in Karnataka lmao \n\nEverything is so expensive for above average not quite god level kids from other states lmao\n    │           └── Well I live in Bengaluru itself and trust me everything is still expensive. Be it food , vegetables , rent etc\n    │               └── Ah man Mit Blr will bankrupt me too now?🗿\n    │                   ├── >Ah man Mit Blr will bankrupt me too now?🗿\n\nSeems so  \nMIT fees were higher I think like around 6L per year ( CSE)\n    │                   │   └── Nope 18L for tuition throughout four years and 8L for food and hostels which could be 14L and 4L depending on hostel and campus\n    │                   │       └── oh okay\n    │                   ├── take pg near campus bro, plenty cheap ones available\n    │                   └── U wrote COMED-K ? Clgs like BMS will be cheaper as it is govt aided, it's a pretty sort after clg,check those out if u wrote it.\n    │                       └── Hoping Coping results go well\n    └── Year wise not semester wise"
    },
    {
      "id": "jmly5am",
      "body": "Guys don't have enough karma therefore writing here \nPlease help ai msrit vs ise uvce vs cse dsce vs ece pes(rr) . Not interested in any branch just want good placement. Thank you\n├── Uvce is very bad, the fees is shit cheap, but the quality is terrible. The professors don't even teach. Pick ai msrit or ece pes(rr) if u can afford. Cse at DSCE is also decent, if u prefer branch over clg u can go for it.\n│   └── What in your opinion is best according to placement only\n│       └── dsce cse\n└── Uvce is very bad, the fees is shit cheap, but the quality is terrible. The professors don't even teach. Pick ai msrit or ece pes(rr) if u can afford. Cse at DSCE is also decent, if u prefer branch over clg u can go for it."
    },
    {
      "id": "jmn6cp5",
      "body": "They seem just a bit insecure asking us to come there, like Nah I can't fly half the country just for counseling for which am not even sure I may go to...like, Banglore is FAAAAR WAY TOOO FAR from where I live, atm. Is it always like this Every year?\n└── Definitely lmao I am a northie too and planning on skipping it tbh \n\nJitne me yahan Ece leke aaunga(worst case) utne me Manipal even if it's Mech me grow karke Germany chal jaunga lmao"
    },
    {
      "id": "jmpfli6",
      "body": "How important is it for the student to be present? Is it the same if only the parents go?\n└── Nope I'm guessing both need to be present\n    └── What if you say the student is severely sick"
    }
  ]
}