{
  "id": "13yasge",
  "title": "PES Counselling",
  "content": "Hey guys so today I got an email stating pes counselling will be on 17th and 18th and it is ONLY OFFLINE at RR campus.\n\n&#x200B;\n\nSo to the guys who wrote PESSAT - At what rank will you consider going for the counselling? ( gotta pay FULL 4.5L fee)\n\n&#x200B;\n\nAnd to the seniors : Can you please tell how much time it takes? And how are these seats allotted? Like first come first serve or..? Like if I have 2k rank and i want cse will they give it to me just cause I am first there or nah?",
  "metadata": {
    "root_comment_id": "jmlwi0c",
    "post_id": "13yasge",
    "author": "InterestingHamster56",
    "url": "https://www.reddit.com/r/PESU/comments/13yasge/pes_counselling/",
    "permalink": "https://reddit.com/r/PESU/comments/13yasge/pes_counselling/",
    "score": 6,
    "upvote_ratio": 1,
    "created_utc": 1685707439,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jmlwi0c",
      "body": "No it's not first come first serve. U should get ec campus cse easily or maybe even rr campus ai/ml though.Your participation imo would depend on what other colleges you are getting\n└── Oh okay thanks  \nAnd did you have to fees beforehand to just sit for the counselling like VIT does or no?\n\nAnd when the assign you a seat you can accept/decline it right? ( After attending the counselling I mean)\n    └── For last year we had to pay it beforehand. U can accept or decline the seat and if u decline they provide refund\n        └── oh okay thanks\n\nSo before sitting for counselling gotta pay full money then?\n            └── Yes"
    },
    {
      "id": "jmlyilu",
      "body": "Not enough karma therefore writing here \nWhich one to select ai msrit vs ise uvce vs cse dsce vs ece pes (rr) . Thank you\n├── msr (I'm assuming it's cse ai and not jusr btech aiml)\n│   └── No its aiml branch I am talking about\n│       ├── if you are really interested in ai and absolutely sure of it then it's fine otherwise dsce cs is also a good option\n│       └── if you are really interested in ai and absolutely sure of it then it's fine otherwise dsce cs is also a good option\n├── CSE > ISE > AI >> ECE\n DO NOT do ECE if thats not your interest. Every person I know who has gone this route has severely regretted it.  Especially in pes lmao.\n├── Comedk marks?\n│   └── No kcet 110\n│       └── Accha\n└── Take ise uvce.\n    └── Can you tell the reason please ?\n        └── Well ise is mostly cse. Just a few topics will be diff in final year. So you shouldn't be losing anything if you take ise over cse. I have heard uvce to be a good college but tbh I don't know if it's that good rn.\n            └── Thanks"
    },
    {
      "id": "jmlzkyz",
      "body": "Tbh I think cutoffs will fall heavily. Aint no way people will be paying 5L man , I'd rather take a kcet seat in some decent college myself.\n├── Yeah thinking the same lol like via KCET max fees will be a little more than 4L for 4years whole years lol\n│   └── Exactly. Plus its not worth the fee for a CSE seat. If I'm getting some other college like uvce or dsce I'd prefer that over a pessat seat.\n│       └── Yep  \nWhat is UVCE now?\n│           ├── Bangalore oldest college usually comes after rv pes bms msrit\n│           │   └── oh okay\n│           └── University of Vishveshwariah College of Engineering or sumn like that\n└── i would take ece through kcet even if i knew I'm not really interested in it rather than paying 5 lakh out of the blue (if i couldn't afford it)"
    },
    {
      "id": "jmmfwcz",
      "body": "It will mostly be like 3-4 hours max, from start to finish. Yes, it is on FCFS basis. If someone has achieved a lesser rank than you and they don't show up when called, their name will be omitted and the next person will be called upon. There will be a screen that displays how many seats are available per branch in each campus and once a student is called, they will have to go upto the desk near the podium and you'll have to tell them what branch and campus you're opting for.\n└── oh okay thanks a ton man !!"
    },
    {
      "id": "jmmjrkk",
      "body": "Few notes about Counselling  \n1) Mostly an entire day event  \n2) They will call out people as per ranks, rank 1,2,3,.... (No first come first basis)  \n3) There is a live visibility on how many seats are remaining in each dept, as your name/rank is called, you get to choose your department o choice  \n4) There's some post booking formalities (they will explain it during counselling)  \n\n\nGood Luck :)\n├── Sounds like a tensed situation\n│   └── Yup\n└── Thanks man , Also sorry I forgot to reply before..."
    },
    {
      "id": "jmpilsa",
      "body": "If you have a pessat rank of 2k, you'll probably get cs in ec campus. The cutoff for my year was around 2700 for cs ecc. Pay the fees only if you're sure as it's non-refundable. Idk if they've changed it now, but for me, you could see the seat you got, then confirm it and then pay the fees. So if you got a bad seat you could just leave. Ec campus cs isn't as good as rr cs but it's still way better than ece. Usually counseling takes like 3-4 hrs. Seats are given on a rank basis and by the time your rank comes, you can choose a seat from whatever seats are left. It's a very transparent and simple system. After choosing a seat you need to submit your documents and pay the fees and they'll give you a welcome kit and you'll be done. Good luck :)"
    },
    {
      "id": "jmu54m3",
      "body": "pes mfs conveniently put the dates on iiser's iat and bitsat exams\n└── lmfaoo real  \nalso do the students need to be physically present in counselling or just parents is enough?"
    }
  ]
}