{
  "id": "13ygg68",
  "title": "General Discussion - PESU PROs and CONs",
  "content": "I have seen and received some feedback from redditors that \"PESU subreddit\" is a little \"Too Negative\" about PESU  \nAs an alumni, although i do agree on most of the cons people have listed out, there are multiple good things i have seen in PESU (especially as compared to other colleges)  \nAs i am out of touch with the current 5 ISAs BT and Club Culture in PES, can we turn the comment section of this post as a PROs + CONs of joining PES  \nMy request is for all alumni/peeps studying in PES to listing down both \"PROs\" and \"CONs\" about PESU (Both, not only 1)  \n\n\nThis post is going to be Pinned, the idea is to show both sides of PES to the world; to help people make an \"Informed Decision\" before joining PES  \n\n\nThank You to everyone who contributes <3",
  "metadata": {
    "root_comment_id": "jmmro6e",
    "post_id": "13ygg68",
    "author": "ChromaticChaos",
    "url": "https://www.reddit.com/r/PESU/comments/13ygg68/general_discussion_pesu_pros_and_cons/",
    "permalink": "https://reddit.com/r/PESU/comments/13ygg68/general_discussion_pesu_pros_and_cons/",
    "score": 25,
    "upvote_ratio": 1,
    "created_utc": 1685721157,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jmmro6e",
      "body": "As the friendly neighbourhood redditor on this sub, let me share my views:\n\nLast updated: 3rd June 2023.\n\n**Pros**:\n\n1. **Great placements if you are in CSE** \\- major MNCs visit every year and the packages are great and increase every year. Back in 2018 when I joined it had one of the best placements for CS, probably is the same now too. A good number of companies come for summer internships between 3rd and final year as well.\n2. **Updated syllabus** \\- the syllabi for all courses is more or less pretty up-to-date with recent advancements, but there are 2 sides to this.\n3. **Great crowd** \\- the crowd here has always been top-notch, you will find really great people here who are competitive and will push you to do better. PES has always been known for this. There are a lot of people who will inspire you with their achievements. The seniors are great as well, [there is a discord server which contains over 3000+ members from all the recent PESU batches](https://discord.gg/pesu-discord-742797665301168220). This is probably PESU's saving grace.\n4. **Location** \\- kind of self-explanatory, being in Bangalore has its advantages by bringing in more opportunities. Additionally, if you live near any metro line you have connectivity as well (EC campus apparently will get connected soon too).\n5. **A lot of clubs and a lot of hackathons** \\- there is a hackathon happening every other week here, plus there is a large assortment of clubs to choose from: so you get enough opportunities to take part in events. While this might seem like a nice advantage, it comes with its own share of problems.\n6. **Scholarships** \\- there are many scholarships every semester for multiple ranges of performers, giving you a lot of opportunities to get some financial returns, including top performers in the entire batch, top performers per branch etc. Although you will be eligible for only one scholarship at a time, it's nice to have these options.\n7. **Alternative choices to hostel** \\- PES RR campus is surrounded by affordable PGs and apartments. If you don't like the hostel or were late to get a room, there are a lot of backup options at arm's length.\n\n**Cons**:\n\n1. **PESU's only reputation comes from CS** \\- the other branches are ignored and even the management does nothing to promote them. If you are in these other branches, you will miss out on a lot of the benefits PESU has.\n2. **Placement stats are skewed in favour of CS** \\- building on the first point, the advertised placement stats are always for CS. This is a misrepresentation because people from other branches do not get packages even half of what CS kids get.\n3. **The updated syllabus is superficial** \\- the syllabus although updated, is in name only. Most courses will dedicate only 5-10 slides of a PPT to the \"recent developments\", glancing over these topics. Some courses will just mention their names. It is nowhere close to covering the amount to justify the syllabus being \"updated\". For a majority of the courses, the syllabus is the same as what it was 7-8 years ago. Additionally, if you are in CS at least, most of what skills you need to get a job in the industry aren't covered. You will need to spend extensive time apart from the syllabus to make yourself qualified for a job.\n4. **Campus is tiny** \\- If you are a fan of large open spaces, this place believes in the opposite (at least for RR). It is like a concrete jungle with buildings all around and construction happening most of the time. EC campus on the other hand is beautiful but I am not sure what is the state of it currently.\n5. **Crowded and packed** \\- self-explanatory again, the sheer number of people makes it packed all the time, and competition for CS placements increases exponentially. Other things get affected as well such as chances for opportunities at clubs, etc.\n6. **Faculty is mediocre** \\- Biggest issue here, professors have been leaving left, right and centre. Issues such as dissatisfaction with the management, too much work etc. All the good profs have left long ago, leaving the bad ones. Profs who made the Uni what it is today, ones who headed research clubs etc have all ditched. The bad ones are leaving now too. Additionally, there are rumours of profs of axed branches (such as the old Civil branch, etc) are still being tied down to PES by the management. They are being trained in introductory courses of different branches so they are still useful (and the acute shortage of faculty). Here, you will find a single faculty member teaching a wide array of courses across different fields, even if they do not specialise in them. A good number of research labs have even shut down.\n7. **Management is poor** \\- Even a rock is more intelligent sometimes. They take illogical decisions that do not make sense, screw around and experiment on batches and then pin the responsibility on you. The management is a mockery of what it should be. From placements to examination stuff, a lot of it needs improvement.\n8. **Stressful environment** \\- Mentioned multiple times here, the biweekly ISA system leaves you no room for working on your skills and interests. You have tests every 2 weeks, and between those tests multiple labs, assignments, project(s) etc. It is very hectic, and you are constantly jumping from one deliverable to the other. The only relief that kicks in is at the end of the semester. There are some floating rumours about them moving to a 3-ISA system, but no confirmation on that yet. In some cases, it might feel like a school, sometimes worse. It is academically it is so rigorous that I currently feel my job functionality at my office is barely anything that I went through here.\n9. **Facilities are okay at best** \\- Infrastructure in the labs is okay at best. It is nothing world-class, it only gets the job done. You also need to jump through multiple hoops to gain permissions for things and is a cumbersome affair. Simple things such as the WiFi have multiple restrictions and you'll even ironically find unblocked porn sites but blocked educational videos on YouTube.\n10. **Fests are yet to return to their pre-COVID capacity** \\- they are around 80-90% back, but not all fests have returned yet. But this is pretty much a transient issue and should be resolved in a year or two. Fests apart from that aren't too many, however, so do not expect ground-breaking fests to happen every other month. They're great, but nothing extraordinary. This is subjective, so I am not going to comment more on this.\n11. **Club and Hackathon quality are severely diluted** \\- Having 15 clubs with quality events is way better than having 45 clubs in which most of them do not do anything. In fact, there are so many at this point that you would not recognise a few anymore. Clubs in CSE are also being run under some weird \"vertical\" concept, with less student management and more teacher involvement. This has been explained in detail before but the summary is that the old clubs that used to exist have mostly died because of the CSE management and been replaced by shoddy replacements (which have also died kekw). Hackathons happening every week do not make sense: the quality of projects being displayed has gone down drastically. People at these hackathons now build anything that was planned over a few days, instead of spending weeks/months like before to plan a good product (back when hackathons were at most twice a semester).\n12. **Insanely high fees** \\- this keeps increasing every year. It isn't really worth it if you are joining through management (which is 11 LPA now). KCET/PESSAT fee is a little high but is expected knowing them. Since this is again subjective, not commenting more.\n13. **Stringent attendance policy** \\- pretty strict at 80% (it used to be 85% before), combined with the constant workload it doesn't give you much room to do things beyond prepare for the tests and attend classes. If your attendance is low, they'll make you attend extra classes to cover up. If it's too low for even extra classes to help, you won't be allowed to write the semester exam for that course.\n14. **Weird hostel rules** \\- I cannot comment in detail about this since I didn't personally stay in the hostel, but there are some stringent rules regarding the dress code (no shorts allowed) and curfew timings. Back when I was there, the curfew time for boys was 8 pm and for girls was 7 pm. There are also regular checks every week. Additionally, the girl's hostel isn't on campus and is about 2km away. There is more to this point, preferably ask someone in the hostel right now.\n├── The best subredditor <3\n├── Umm...Thats a lot of Cons XD\n│   └── First time on this subreddit?\n│       └── Haha no but looking at the sheer number of Cons ppl will run away without even reading all that...Plus many of this cons are true for other good clgs (especially the first 2 points )as well..also with the introduction of 3 isas I feel some of these cons will not be a issue for much longer.\n├── Hey, I have put 3 choices for counselling, 1) aiml,ece and cs\n\nI'm interested in ece at RR campus, but I have put first preference as aiml, would I be able to select ece at counseling even if I get aiml ?\n│   ├── You can select during counseling\n│   │   └── Thanks mate alot\n│   └── Hows the ECE going brother?\n├── woah\n├── We need a updated one\n│   └── It is updated. I updated it a few months ago. If you'd like to add points, let me know and I'll update the comment\n│       └── Infrastructure has developed a lot in past few years\n│           └── By infra, I am referring to labs. Most students (event those passing out last year) have complained about the ineffective labs for most reasons. Unless that changes, the point is still correct.\n│               └── Yes labs are the same I was talking about the new gjb with all sports facilities\n├── pesu cse vs mit manipal cse purely on basis of placements?\n└── Would be great if someone would have written the same for bmsce"
    },
    {
      "id": "jmp0wkw",
      "body": "The 5 isa system is longer there from this year btw. It has been replaced with a 3 isa system, something similar to the older 2 isa system. For our batch rn two exams have been merged to mark the formal begining of this system. But we have to see how it works out. I suspect that the academic workload might go down significantly due to this.\n└── What are tge benefits of a 3 isa over 5 isa system?\nAre the exams harder and how much time will we have after 1 isa to the next"
    },
    {
      "id": "jmp1ojb",
      "body": "Pros:\n1.Good placements\n2.lots of Hackathons (one every week) \n3.updated curriculum (compared to other Karnataka colleges) \n4.Good amount of scholarships\n5.Larger alumni base compared to other colleges\n\nCons:\n1) Extreme workload ( lots of internals and assignments) \n2) Very few cultural events \n3) Attendance policy (pro or con depending on teacher) \n4) High fee if not through kcet\n5)Campus is overcrowded\n6) Teaching quality is low\n└── What are the benefits of a 3 isa over 5 isa system?\nAre the exams harder and how much time will we have after 1 isa to the next\n    └── When there are 5 isa's you only get 2 weeks between them so, no time to pursue other interests, club activities, coding etc. Only good thing of 5 isa was it will increase marks if you just study one day before isa , which is harder in 3 isa\n        └── now in the orientation of this year batch, they announced the 2 isa system, will it be helpful ??\n            └── Yes it will allow time to develop skills as well as have enough time to have fun in college\n                └── Thanks for the reply, btw which sem are u in ?\n                    └── 5th sem"
    },
    {
      "id": "jnng33d",
      "body": "Hey seniors, is there a senior at EC campus I can talk to? I've got a few questions regarding EC campus so would be very helpful talking to seniors there\n└── Hey, I'm in my last year at EC campus. Ask away.\n    └── Hey man, thanks for the gesture but I got the answers to my questions from the discord server!\n        └── Ahh good np."
    },
    {
      "id": "jtmorjo",
      "body": "Reading all this puts me in a dilemma. I really wanted to join pesu, for which i worked hard and got a decent rank in kcet. But due to the recent issue happened in the rr campus, I'm rethinking my plan of joining there. It is also said that the curriculum is so hard that we are left with no time to work upon our skills. I recently visited BMSCE and MSRIT. When I asked students there, how good is their clg compared to pesu, all I got were negative comments. I even met a few seniors who left pesu and joined other clgs.\n└── I will reply personally to this"
    },
    {
      "id": "kvyu84z",
      "body": "Pros  \nGuest talk  \nHackathon  \nCampus infrastructure\n\nScholarships\n\n  \nCons  \nTeaching: The majority of teachers there are not fit for teaching\n\nManagement: Management makes good decisions but implementation never happens according to management\n\nISA: the main exam consists of marks from internal as well as final exam faculty won't give marks fully although you have made a 100% attempt in doing your research paper or case study and ISA questions are different from what was there in the syllabus \n\nThe faculty are limited so even if we complain they will just warn them and the faculty won't change at all\n\nThey keep on trying trial and error methods of any implementation of rules  by using student life \n\nALTHOUGH WHATEVER THE MANAGEMENT SAYS OR BRINGS RULES THE FACULTY WON'T CHANGE \n\nTHE INSIDE PES AND OUTSIDE IT IS DIFFERENT\n└── The faculty for BTECH is Strict? if yes how?\n    └── acc to you what is strict\n        └── 1) Targeting students   \n2) Strict in academics\n\n3) Do they involve parents in every silly matters. like missing the classes. \n\n4) Mental harassing students.\n\n5) There has been an allegation that if a boy n girl talk, they suspend them or any other punishment is given, is that true?"
    },
    {
      "id": "lb93iby",
      "body": "Bhai koi pes ke baare mein detail se bata skta h ? Admission mode, Total fees, attendance criteria, hostel mess"
    },
    {
      "id": "lrp5x8z",
      "body": "CSE is the only course which gets all the attention than any course in pes, what about Biotech ? What are the pros and cons for Btech. Biotechnology Eng. ?"
    },
    {
      "id": "m8j05ym",
      "body": "Can someone tell me how it is for bsc psych hons?\n└── The course is beautiful"
    },
    {
      "id": "mbn6wxr",
      "body": "hello , please suggest me over , IT at RV vs CSE at PES vs CSE at MSRIT"
    },
    {
      "id": "meoy40b",
      "body": "CONS- 1) SAVE PSYCHOLOGY DEPARTMENT 😭they bring in meaningless rules.\n2) Recently their new drama started 'cannot use laptop to make notes' this was also fine.\n3) But, every student will get their name cards and they are supposed to get it everyday and sit in the class according to srn. Like wHY?  I mean who really gives a damn about which student will sit where. Like its gonna slove the problem of using phones etc. \nThey couldn't even go an extra step to make a decent name card, they used 'already  used' paper to make them. And the names are written in such huge bold font. we are supposed to bring it and keep it everyday on the table like cattles! But if thats what you want, why have id cards???Are they just stupid at this point? It literally just a laminated A4 SHEET cut in half thats already been used! And bring that shit everyday college.  The management really needs to get a life.  And not make our lives a living hell! \n4) Already we are over worked. They don't leave us early even when the prof is not teaching anything, WE STAY IN COLLEGE EVERYDAY TILL 4' .The psychology department is a disaster.\n 5) We have 3 huge research paper to finish,  assignments, case studies,  case reports. And they wont let us go home early and when we mention how much work we have, they say to do it in college,  but for that we need a goddam laptop.  Who in their sane mind would carry laptop everyday while using public transportation!? And even if we do carry laptops, whats the bloody use? We can't make notes in our laptop in class anymore. \n6) Keeping eyes on students through camera 24/7 , isn't that creepy, like get a life! Not just that, they from what i hv heard they can ultra zoom into phones and get a nice look of whats going on in the phone.  \n7) They make a HUGE deal about SLEEPING IN CLASS. I agree its not a good thing to sleep in class.  But how much can the students take!? Everyday wake up at 5, to reach college at 8 and then return home around 6pm. And then stay up all night working on research papers! Its impossible to not put our heads fown for just 2 mins! 8) IN ALL OF THAT THERE WAS 1 GOOD THING, WE COULD ATLEAST SIT NEXT TO OUR FRIENDS IN THE CLASS AND RELAX A  BIT, AND SIT ON THE BEACHES WE WANTED TO SIT ON.  BUT THESE PEOPLE TOOK THAT AWAY FROM US, MADE US SIT IN THE ORDER OF OUR SRN LIKE MINDLESS ZOMBIES! Many people cant sit in the back bench because they cant see the ppt properly from the back, many cant sit in the front bench because they are very light sensitive. Many of us get migraines etc, we could choose where we wanted to sit before BUT THEY WONT LET US SIT COMFORTABLY IN THE CLASS FOR 3 BLOCK CLASSES! \nSOMEONE FROM THE MANAGEMENT IS READING THIS, PLEASE TELL  ME WHATS THE POINT OF THIS????\n\nif anyone could please save the psychology department before i cry tears of blood and die. I feel like since pes loves to give us exposure about future so much, they are giving exposure of 'after life hell' at this point. \n\nWasn't clubbing all 3 sessions into 1 class not enough? Wasn't not giving attendance for people who came after the 1st session got over for they second session not enough? Wasnt not  letting us even keep our heads on the table even  for 2 mins not enough? They should draw the line with the rules at some point. \nThey made the guest lectures and the club hours in between the short and long break,  so no matter what, the students stay till 4 everyday. All other departments have their departmental clubs hours in the afternoon, but here, its only us that has it in between classes. \n\nEverything was fine. Why sit in the order of srn? Why make it so hard on us? And then expect 75%, for what? Ruining our mental health? Irony of the situation , its THE PSYCHOLOGY DEPARTMENT \nI wouldn't be surprised if they introduced the rules that 'the profs would sit in our class during the lunch time and we need to take permission from the professor to go out of the class during the lunch time'. Like seriously when will this stop? \n\nPros- the course design is good, the subjects are good"
    },
    {
      "id": "mss6c9f",
      "body": "How is BCA in rr campus? planning to join very soon."
    },
    {
      "id": "mym588a",
      "body": "Hey I am fresher this year can I get the link of WhatsApp group of pes of freshers"
    }
  ]
}