{
  "id": "13z947y",
  "title": "PESSAT Momint",
  "content": "Was I the only one who didn't know that there might be numerical-type questions in PESSAT?\n\nAs I was sitting there in front of the computer and saw the question with a mini keyboard and with no options my cranial capacity to generate a thought became minimal and all my neurons deactivated in an instant.",
  "metadata": {
    "root_comment_id": "jmqbq3i",
    "post_id": "13z947y",
    "author": "Master_Beast_07",
    "url": "https://www.reddit.com/r/PESU/comments/13z947y/pessat_momint/",
    "permalink": "https://reddit.com/r/PESU/comments/13z947y/pessat_momint/",
    "score": 14,
    "upvote_ratio": 0.8999999761581421,
    "created_utc": 1685789545,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jmqbq3i",
      "body": "well i didn't know until i saw this post  \nhow did the rest of the exam go?\n└──  the ones who wrote before didn't tell me anything shm 🗿...English had fill in the blanks and asked the synonyms of words I've never heard before..Maths doable but lengthy..physics mid as always..chemistry weird( random ahh chapters)\n    └── ah man mine is tomorrow and i dont know shit\n        ├── Atb..random bullshit go!! (except numerical type)\n        │   └── yup fr  \nthanks a lot\n        └── Lmfao same bruh\n            └── all the best man  \nwhat's your shift?\n                └── 4.30 wbu\n                    └── ayyy same"
    },
    {
      "id": "jmqiakx",
      "body": "In my shift (28th Morning) , they even asked fill in the blanks wherein we had to \"type\" the answer and it wasn't MCQ.\n└── Bro could've told us earlier :'(\n    └── Mb , but there were only 3-4 questions that way."
    },
    {
      "id": "jmrgd54",
      "body": "Was it only me or was the English part super fucking hard????\n├── yeah english was mad hard.. i had never even seen those words in ma life holy shit\n├── Fr mfs thinking I've done my masters in English literature\n└── yes every other english exam is so easy\n\nidt any person ever has used such words"
    },
    {
      "id": "jmrqhlq",
      "body": "All are numericals"
    },
    {
      "id": "jmvl3vf",
      "body": "one of the answers required a space between words but my virtual keyboard didn't even have a space option and the invigilator didn't know what to do\n\nthere was no info on till what decimal place the answer has to be entered"
    }
  ]
}