{
  "id": "1429ews",
  "title": "Electives for 5th Sem",
  "content": "What should be our basis for choosing electives and which combos are most sought after/actually useful (for CSE) ?",
  "metadata": {
    "root_comment_id": "jn3lo2r",
    "post_id": "1429ews",
    "author": "Illustrious-Egg-3183",
    "url": "https://www.reddit.com/r/PESU/comments/1429ews/electives_for_5th_sem/",
    "permalink": "https://reddit.com/r/PESU/comments/1429ews/electives_for_5th_sem/",
    "score": 3,
    "upvote_ratio": 1,
    "created_utc": 1686041698,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jn3lo2r",
      "body": "Choose the electives that you find interesting. Ideally that should be your primary method for choosing electives any time. Go through the syllabus of the courses and see which one catches your eye. Electives depend a lot on who is taking the elective. We've had good courses being taken by bad profs and vice versa as well. Choose whichever one you like the most, and ask the seniors for what the courses are about."
    },
    {
      "id": "jn3qaxl",
      "body": "What are your current options?\n└── E1\nAdvanced Algo,Data analytics, IoT, cryptography,ARVR, HCI\n\nE2\n\nBig Data, Graph theory, Bio inspired computing, Networks & security\n    └── If you’re into security, cryptography and CNS are great. Cryptography is very very easy as well and has industry applications. Moreover, you can take up blockchain and IS in your next sem, which are again very similar, hence easy to score. You’ll also get a cyber security specialisation. \n\nIf you’re into data science, take up DA and BD, but I warn you, DA is a lot of math and BD project will be tough. But probably the most useful project work you’ll ever get. \n\nI had taken IOT and GT, both were great and not the hardest to score. GT has its applications everywhere and I found that to be very fun. IOT project was also a fun trip. So if you’re interested, I’d suggest this as well. \n\nHCI and Bio inspired computing, I don’t have much insight on, so I’m not sure about those…\nHope this helps\n        └── Thanks for the insights, I'm confused between DA and advanced Algo and I've no particular passion or interests , I'll prefer whatever is more relevant for placements and further employment.\n\nPS : I'm choosing BD as E2.\n            └── If you’re going with BD, you might as well take DA. You may develop an interest in the subject of data science. Advanced algo is great and will definitely help with placements, but make sure your DS is strong before you take up this course. \nIf you have strong DS knowledge with C++, taking advanced algo now and GP next sem will make your concepts for placements, competitive coding very very strong. \nIn the end, it’s left to you. \nIrrespective of what you choose, you’ll have to put in work. \nAll the best!"
    }
  ]
}