{
  "id": "142c6wl",
  "title": "Help Me Choose!!",
  "content": "[deleted]\n\n[View Poll](https://www.reddit.com/poll/142c6wl)",
  "metadata": {
    "root_comment_id": "jn3uf58",
    "post_id": "142c6wl",
    "author": "[deleted]",
    "url": "",
    "permalink": "https://reddit.com/r/PESU/comments/142c6wl/help_me_choose/",
    "score": 1,
    "upvote_ratio": 0.6700000166893005,
    "created_utc": 1686049064,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jn3uf58",
      "body": "PES CSE >> SRM anyday\n└── PES is Better I Know. But is it that much Better?\n\nGiven that I will have to Pay 4.5 lakh Each Year Extra for studying in PES whereas I will study for quite literally Free in SRM (It may also get renewed if I performed decently in 1st year) !!\n    └── Good Question, i don't think i can give you an answer here, however, here are few points that may allow you to decide  \n1) College Culture and Crowd: Not to throw shade, but PES has a really good crowd (both nerdy and fun) as compared to SRM  \n2) City and Opportunities: Bangalore :)  \n3) Placement History: PES CSE has a really good history for placements, especially in bangalore, so that's a big plus  \n\n\nIf money is a deciding factor and nothing else, then depending on where you stand, maybe SRM seems like a good choice, however, if it isn't then, maybe these 3 points may help in deciding  \n\n\nGood Luck :)"
    },
    {
      "id": "jn49iub",
      "body": "almost same problem but it's pes ece or srm ktr cse? (I might get pes ece through pessat itself) and no scholarship in srm.\n├── Same lmao\n└── Only take ece if u actually like ece don't.jump.into.the pes bandwagon like a idiot, core subjects need passion, that's the truth, and i am a. Ece student myself i didn't like.or.hate ece , isn't doing me any good meanwhile ppl who are passionate are excelling so take your call based on what you like not based on college \nBranch> college sometimes, especially for core\n    └── Yeah obviously not jumping like an idiot, I've been working on projects with c, c++ and assembly along with Arduino and other micro controllers since I was 11 so I am definitely interested. but also having learnt python, web development and ml I have passion for it too. Or is PES CSE management quota worth it? but it's a shame to take management quota so I'm not going to do that\n        ├── Don't pay management bro too expensive if you like ece go ahead and take it , teachers are good only, there's ample opportunities but it's in no ways easy\n        │   └── What About CSE?\n\nI Heard that PES is Academically Very Very Rigorous even for CSE Students!\n\nIf Someone is Average in Studies would He able to manage it?\n        │       ├── Dunno about cse i am a ece dude i can assure u ece is not a cake walk, cse the cse dudes can only answer, if u mean in general the college is indeed a pain in the ass so yeah cse or ece we are all taking the same Ls\n        │       └── Dunno about cse i am a ece dude i can assure u ece is not a cake walk, cse the cse dudes can only answer, if u mean in general the college is indeed a pain in the ass so yeah cse or ece we are all taking the same Ls\n        └── If I had been in Your Shoes I would have Definitely Chosen SRM CSE since I know ECE is Hard AF.Moreover, You will not get much Time to Practice Programming in PES because of Rigorous Curriculum and Ultimately You will get Placed in IT Company only."
    },
    {
      "id": "jn4cby0",
      "body": "This is after a long time I'm seeing PES Cs getting majority in the pools"
    },
    {
      "id": "jn4lw0k",
      "body": "hmm unless there is some major Financial issues PES is better,  \nchoose SRM if fee could an issue(100% is attractive tbh)\n└── Imagine You do not have to Pay a Single Penny to College and Now Imagine You have to Pay 4.5 Lakhs when You don't really have that at this moment and You might need to take a Loan for that. \n\nMy Condition in a Nutshell :(\n    └── >You might need to take a Loan for that.\n\nSRM lele  \nthis is PES sub ig downvotes aayenge  \nbut if that is the condition its a no brainer to take SRM!"
    },
    {
      "id": "jn4p5k1",
      "body": "Even in PES if you come in the top 20% percentile of your batch you get 40% back of your semester fees .\n└── Top 20% Must be really Hard here because of frequent ISA and such Exams. Heard from Someone that PES is very very Academically Rigorous!!"
    },
    {
      "id": "jn4snf1",
      "body": "why wud u ask this in the pes subreddit\n└── Just wanted Opinion of PES Students also since Mostly(Not Always Just Most of the Time) I see People Bashing their own College in this Subreddit!!\n\nYet, PES won by a Major Margin!!"
    },
    {
      "id": "jn8g4ow",
      "body": "If you are sure of scholarship great go for SRM, if it's not then 100%PES.\n└── You'll get more than 20lpa for sure in PES I'd you are good enough to get SRM scholarship. \nYou can get PES scholarship as well, again if you are that good.\n\nMake sure you work hard, and apart from college and package \n\nYou'll be in bangalore, don't miss a day of it. Go to PES no doubt."
    }
  ]
}