{
  "id": "144xdwb",
  "title": "AI&ML vs CSE",
  "content": "Good day seniors, I secured a rank of 10xx in pessat and judging by the previous year cutoffs I may end up getting AI & ML at rr campus or have to go for cse in ec campus. So what is the difference between CSE and AI&ML are the 2 courses entirely different or just a few electives here and there? Looking forward to join PES.\n\n Thank you :)",
  "metadata": {
    "root_comment_id": "jni1zes",
    "post_id": "144xdwb",
    "author": "Trivial_Panda",
    "url": "https://www.reddit.com/r/PESU/comments/144xdwb/aiml_vs_cse/",
    "permalink": "https://reddit.com/r/PESU/comments/144xdwb/aiml_vs_cse/",
    "score": 5,
    "upvote_ratio": 1,
    "created_utc": 1686292128,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jni1zes",
      "body": "From whatever we know, CSE+AIML is the rebranded MIDS (Machine Intelligence and Data Science) specialisation that used to exist. For the first two years, you'll have the same syllabus as CS, but in third year the electives you choose will be strictly from ML related coursework (unlike normal CS which will get to pick from all courseworks from cybersecurity, to systems etc). \n\nMy advice? Pick CS. There are multiple reasons why\n\n1. It's an untested branch - it was introduced last year only and nobody knows how it'll turn out\n2. The profs here are too capable to teach this, they're barely qualified to teach core CS concepts\n3. You'll be restricted. What if you don't like ML? Have you thought about that situation? Taking CS will allow you to choose whatever you like, include ML related coursework if you are interested\n4. You won't get ML related jobs right out of undergrad (mostly only startups), so the advantage doesn't exist. They all require atleast an MS/PhD, which brings me to my next point -\n5. ML is a purely mathematical field with focus on calculus, probability and algebra (you need a good grasp of these). It's more of an academically oriented field than an engineering one with most people taking this only in their Postgrad than BTech so they can go into research. There is not much engineering marvel here. Unless you know what a branch is about, don't pick it.\n\nI'd be happy to answer more about AIML.on DM since I work in this field.\n└── Thanks for the response man :) , I will DM you."
    }
  ]
}