{
  "id": "145xz0s",
  "title": "Counselling",
  "content": "Very confused over what all we have to fill up for counselling, can someone please please please give the links to all the things we're supposed to do for counselling?",
  "metadata": {
    "root_comment_id": "jnngiuw",
    "post_id": "145xz0s",
    "author": "Irdkwhatnametogive",
    "url": "https://www.reddit.com/r/PESU/comments/145xz0s/counselling/",
    "permalink": "https://reddit.com/r/PESU/comments/145xz0s/counselling/",
    "score": 5,
    "upvote_ratio": 1,
    "created_utc": 1686396910,
    "flair": "PESSAT",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jnngiuw",
      "body": "COUNSELING PROCESS\n\nPlease carry the following items to the Counseling.\n\nFour DDs in favour of PES UNIVERSITY GENERAL FUND, payable at Bangalore:\n\nFor Rs. 3,60,000/-\n\nFor Rs. 40,000/-\n\nFor Rs. 50,000/-\n\nFor Rs. 10,000/- \n\nCandidates who have already blocked their seat in higher fee quota need not get any DD's, but should get original fee receipt for the amount paid along with photocopy of the original fee receipt. If the original fee receipt has not been collected yet, it needs to be collected from the Office of Admissions at PES University Ring Road Campus before attending the counseling.\n\nDDs for partial amounts will not be entertained/ accepted by the University and such candidates will not be allowed to participate in the seat selection process. Please understand, all four DDs as mentioned above are mandatory\n\n \n\nIf a candidate selects a seat in Computer Science Engineering (either at ring road campus or electronic city campus)/ Computer Science Engineering (Artificial Intelligence & Machine Learning) (either at ring road campus or electronic city campus), then the candidate should submit all four DDs of Rs. 3,60,000, Rs. 40,000, Rs. 50,000 and Rs. 10,000 to the University\n\n \n\nIf a candidate selects a seat in Electronics & Communication Engineering (either at ring road campus or electronic city campus), then the candidate should submit only three DDs of Rs. 3,60,000, Rs. 40,000 and Rs. 10,000 to the University. They can retain the DD for Rs. 50,000 with them\n\n \n\nIf a candidate selects a seat in Mechanical Engineering/ Electrical & Electronic Engineering/ Biotechnology, then the candidate should submit only two DDs of Rs. 3,60,000 and Rs. 10,000 to the University. They can retain the DDs of Rs. 40,000 and Rs. 50,000 with them\n\n \n\nNo other payment options are accepted. For the registration process to be complete, candidate should produce all the four DDs. Without the proper DDs, seat selection will not be allowed.\n\n \n\nThe DD's will be collected from the candidate only if the candidate avails a seat in the seat selection process. If the candidate rejects the seat or chooses to attend the second round of counseling, then the candidate can take back all the DD's with them\n\n \n\nPlease bring the PESSAT Hall Ticket & Rank Card (Very Important) Print your rank card\n\n \n\n10+2 Marks Card (PUC) (If original not available, provisional marks card with original signature of the college authority to be produced for verification)\n\n \n\n10th Marks Card (SSLC)\n\n \n\nTransfer Certificate / College Leaving Certificate (if applicable)\n\n \n\nMigration Certificate (If other than PU Board) (if applicable)\n\n \n\nPassport & Stamp Size Photos 6 Copies each\n\n \n\nAadhar card\n\n \n\nPan card copy of the parent and candidate (for opening a bank account)\n\n \n\nIt is mandatory for the candidate to be present in person at the prescribed reporting time. A candidate will be granted an exception to allow his guardian / parent to represent the candidate only in the case of the candidate attending the CET Verification Process the same day / session. In such a case, please take prior approval by downloading the < Authorization Letter > - and getting it attested from PES University in person before the day of counseling. This has to be submitted with the proof document of the candidate attending the CET Verification Process.\n\n \n\nNote: Original + 2 Sets of Self Attested Photo copies should be provided in the above-mentioned order. Only candidate + 1 Parent / Guardian will be allowed for counseling / seat selection process.\n├── Btw what about the document submission? Its copies only right?\n│   └── Nah mate its originals better to carry both\n│       ├── Oh rip\n│       └── Carry a high res colour photocopy and submit that lmao\n└── Thanks a lot and what all has to be done online?\n    └── Just confirm your attendance"
    },
    {
      "id": "jnngl6h",
      "body": "They should have sent a mail to the give mail id you can check it up there also"
    }
  ]
}