{
  "id": "147fzsq",
  "title": "Credits for 6th sem internship",
  "content": "Will the 6th sem internship fetch you credits? If yes, how many?\n\nOr are credits given only for summer courses, special topics, and research internships under clubs? Thanks.",
  "metadata": {
    "root_comment_id": "jnve0y6",
    "post_id": "147fzsq",
    "author": "MDPS2000",
    "url": "https://www.reddit.com/r/PESU/comments/147fzsq/credits_for_6th_sem_internship/",
    "permalink": "https://reddit.com/r/PESU/comments/147fzsq/credits_for_6th_sem_internship/",
    "score": 7,
    "upvote_ratio": 1,
    "created_utc": 1686548121,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jnve0y6",
      "body": "By 6th sem you mean the summer after right? If yes then 2 credits will be given once your internship gets approved by the department (this is for off campus ones, on campus internships are by default approved for credits).\n├── Thank you!\n└── only paid off campus is credited no?\n    └── Yes, that's why - approval. Some paid off campus ones can get disapproved as well\n        └── What about sem 8 ones if it's unpaid no approval?\n            └── Usually unpaid internships aren't given approval unless it's from any tier 1 institute like IITs. You'll need to submit your internship details for approval, it's upto your department\n                ├── I see , thanks\n                └── what if it's unpaid internship from a tech company? Just want to know.\n                    └── In almost all cases, unpaid internships from tech companies cannot be redeemed for credits.\n\nBut as I said - submit for approval to your department since only they decide if it can be approved. There are a lot of factors that affect the approval decision like the tier of the company, what is the role you will be recruited for, other clauses in the offer letter etc. You never know, you might get lucky - although this is a long shot."
    },
    {
      "id": "jnvhz2q",
      "body": "Thank you"
    }
  ]
}