{
  "id": "148aukx",
  "title": "Is PESU honestly worth the money?",
  "content": "Is it wise to spend 4/4.5Lpa here? Obv excluding the hostel expenses. Give me your opinions.",
  "metadata": {
    "root_comment_id": "jnz7s7y",
    "post_id": "148aukx",
    "author": "myhonestreactionL",
    "url": "https://www.reddit.com/r/PESU/comments/148aukx/is_pesu_honestly_worth_the_money/",
    "permalink": "https://reddit.com/r/PESU/comments/148aukx/is_pesu_honestly_worth_the_money/",
    "score": 10,
    "upvote_ratio": 1,
    "created_utc": 1686647194,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jnz7s7y",
      "body": "In my opinion , Not at all.\nIncluding hostel, fee will be around 6-7L. There is nothing that justifies that fee , I'd take any other decent college i get in the blink of an eye , because I will 100% regret spending 30L+ at the end of 4 years.\n├── How much do the hostels cost? 💀\n│   └── It's one of the most expensive hostels in bangalore ig , 1.5L-2L depending on the kind of room you take\n│       └── I think MIT banglore Beats it. Goes upto 4L for a suite room. Anyways I'm sleeping in the library.\n│           └── No fucking way lmfao , 4L!!!! Man fuck engineering , I'm joining my dad's business lmao\n└── Thank you for the input\n    └── tbf don't take their advice, cause they haven't even studied in the college and are just students entering college like us. so they haven't experienced what it is like to be a student of PES ig.\n\nMy brother studied there and he says it's worth it because placements are good and he had a relatively low CGPA (between 7 and 7.5 i think) and he got 8 lpa job (10 lpa CTC) so assuming you also get 8 lpa (and I'm sure you can do better if you wanted to) and you also get an 8 lpa salary, you would earn the money back in over 2 years. I personally think you could take it if your parents can afford it. (that is, if it's your only option)\n        ├── Will take this into consideration, thanks!\n        │   └── i was talking about cse though, forgot to mention. Don't know how it is for other branches.\n        └── Placements are only one aspect dude. Yes I agree the placements are solid but you can't ignore the other aspects which don't justify the fees you pay. You need to take a holistic viewpoint when you justify the fees, not just the end goal. Additionally, OP's end goal might not be placements at all - what if they want to pursue a Masters post BTech? Then the other options they have will hold weight as well.\n            ├── Yes, there's a high chance I might wanna do masters abroad.\n            │   └── What options do you have at the moment? I've been out of touch with current placement and other stats of Uni's since I last went through this in 2018 lol, but if you've done well in the other tests you could assess your options. There is a pros and cons post on this subreddit - you can see for yourself what PES will offer.\n\nAlso if you want to do MS, then it goes without saying that your Bachelor's degree should be relevant to what you'd like to pursue\n            │       └── I managed to mess up every entrance test I gave. I can get circuital branches in Manipal main campus, and then there's PES. Apart from these two, a drop year. These are my options.\n            │           └── I didn't ask - which branch are you targeting? If it's ECE at PES vs ECE at Manipal, I'd recommend Manipal. If you take placements out of the equation, Manipal is still a very strong choice with good opportunities and facilities which will help you build your profile for MS. And even if you do target placements, last time I looked into stats they had a great record as well. PES is *extremely* biased towards CS and with the large disparity that exists between CS and non-CS branches (mainly due to the large difference in number), you might miss out on things. IMO Manipal should be your first choice, unless other subjective parameters like travel, costs etc come into play.\n            │               └── No preference as such, but I prefer cse and then ece next. And no, I'll get eee or something at manipal which I don't think is worth it to be honest.\n            └── True, didnt think of that. But I don't think it's bad to take PES (if its your only option), mainly only if the parents can afford it though. But yeAH, I dont really know what I'm talking about. The reason I talked about placements cause it's sort of like earning the money back ig."
    },
    {
      "id": "jnz8r6j",
      "body": "Not particularly. The placements are good but only for a small subset of the students. Even for the CSE branch the majority of the students get placed in mediocre jobs and positions.\n\nI could have had justified it at the older fees of 2.8L (which I paid) and the chance of getting 25% scholarship.\n\nBut right now if this costs almost 25L for a btech degree the better alternative would be to save some money and maybe for a MS later. The college does not have the faculty or facilities to justify the fees\n├── Yeah, my partners were confused about sending me to pes via pessat. Well, not anymore then.\n│   ├── Man I used to suggest PES very happily. But at this fees it’s definitely not worth it. \nIf you enter the corporate world you can always switch and improve salaries. No one looks at degree and college later\n│   │   └── I can see why\n│   └── ...partners? 👀\n│       └── fu- this is embarassing.\n│           └── Go on..\n└── \\[NOT RELATED\\] But how does the hard grading system in pes affect when you apply for masters ?\n    └── Same q"
    },
    {
      "id": "jnzwxt9",
      "body": "All depends on your Outlook fees definitely are ridiculous, if you want a true college experience then don't even think about going to pesu, if you want good acads and a good curriculum along with a nice resume for a master's abroad you can definitely go for it, also i would suggest not going for a hostel and instead share a flat. Placements are good if you can stand out in the crowd, the student intake for cse is extremely high so keep in mind to get a good placement you have to keep a good cg, if you work hard you can grab packages above 25-30 lpa easily which is still good roi, so depending on how much you'd like to spend on acads make your decision\n└── I'm from Bangalore only so I wouldn't need a hostel. Apart from that, thank you, will take this into consideration"
    },
    {
      "id": "jo0h6rj",
      "body": "I will give you some insights.  \nPersonally, a fee of 3.5 - 5.5L per year + 1.5 - 2.5L for hostel/mess, isn't as *worthy as it seems.* It is very hefty fees and no other college afaik provide such a high paying fees in India.   \n\n\nSo, coming to the scenario assuming you are financially able to pay the hefty amount of 25L+ \\[for your Btech degree. In this case, I suggest you go to some Ivy leagues in the US to pursue Btech as it more than or equal to this heft fees.   \n\n\nAs for the case when you are financially unstable, I suggest you try other colleges that align with your ranks in CET, COMEDK or other exams.\n├── Fair enough\n└── studying in the usa for btech won't be less than 80 Lakhs atleast\n    └── Yes yes. True"
    },
    {
      "id": "jo4hw4n",
      "body": "Honestly no ! Not worth Pessat money . If you are from kcet , then the fees makes sense but 4.5lpa is too much \nCampus facilities are okish \nEC campus is not well maintained tho\n└── Any college through kcet is a steal."
    }
  ]
}