{
  "id": "14904zf",
  "title": "MCA from pes worthit ?",
  "content": "Anyone who is studing mca from pes, hows the coding culture, faculty, placement etc?",
  "metadata": {
    "root_comment_id": "jo2rzqg",
    "post_id": "14904zf",
    "author": "Automatic-Ad-6540",
    "url": "https://www.reddit.com/r/PESU/comments/14904zf/mca_from_pes_worthit/",
    "permalink": "https://reddit.com/r/PESU/comments/14904zf/mca_from_pes_worthit/",
    "score": 5,
    "upvote_ratio": 0.8600000143051147,
    "created_utc": 1686722972,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jo2rzqg",
      "body": "Yes\n├── do we have to give interview or exam? few people on youtube is saying there is no written exam and they select you on the  basis of intervew but in there website it says pessat exam is mandatory\n│   └── Pessat\n└── Can you elaborate if you don't mind\n    └── It's worth it you asked if it was,I don't know faculty,culture etc.\n        └── Lmao my bad , I meant how is the placement opportunities do most companies open for MCA ? Is curriculum hectic ? Are there any scholarships?  How was the placement of mca this year ? And also is the college strict in rules and regulations?\n            └── Most companies go for communal hiring. Curriculum is hectic. You have to ask about scholarship. College is strict. Placement must be nearly 100.\n                └── For MCA all the students gets placed ? This is much better than most of the NITs if I'm not wrong . And what is Communal hiring\n                    └── I think I don't know\nI meant all btech mtech mca are hired together"
    },
    {
      "id": "jo700sk",
      "body": "can someone tell the fees for mca through pgcet. through pessat it's 250000/year, which is too much. would it be less through pgcet?\n├── Its same\n│   └── you sure?\n│       └── There website doesn't mention other mode  fees so ya I'm pretty sure\n└── I think there are no seats through pgcet"
    }
  ]
}