{
  "id": "1496vzi",
  "title": "choose",
  "content": "pessat 11XX\ninterested in AI and data structures and would pursue that for masters or pursue an MBA to get into finance\n\n[View Poll](https://www.reddit.com/poll/1496vzi)",
  "metadata": {
    "root_comment_id": "jo3x2jy",
    "post_id": "1496vzi",
    "author": "DragonBarbeque",
    "url": "https://www.reddit.com/r/PESU/comments/1496vzi/choose/",
    "permalink": "https://reddit.com/r/PESU/comments/1496vzi/choose/",
    "score": 4,
    "upvote_ratio": 0.8299999833106995,
    "created_utc": 1686746508,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jo3x2jy",
      "body": "Now normally choosing PES over NITK is a brain-dead move. I am not going to suggest here, but I can help you decide:\n\n* If you pick CS at PES now, you will not only be able to pursue an MS in CS later, but you will also have the option to pursue an MBA in case your interests change. So both your current interest as well as backup interest will remain.\n* If you pick NITK now, your choices of higher education will get confined to fields related to civil/metallurgy. You will close almost all doors for an MS in CS and CS-related degrees completely and It is extremely unlikely you will get accepted into such programmes An MBA will still be open to you, however.\n\nNow you will need to decide what matters more to you. There is no denying that an NIT is an NIT at the end of the day, but if you are really passionate about CS, then you will have to sacrifice college for branch.\n└── thank you so much, does pes offer me enough time to work on AI related projects\n    └── There is time if you make time :)\n\nCoincidentally, I also work in ML and spent a lot of time working on research (I prefer pursuing research more than building projects). By the end of my final year, I'd published 3 papers, one of them at one of the highest ranked symposiums in the world :). So as I said - there is time, if you make time.\n        └── thank u for replying sm"
    },
    {
      "id": "jo466w6",
      "body": "I was in a similar situation 4 yrs back, I went with my interest of branch over college... So ended up taking cse at pes.\n└── how do u like ur decision right now\n    └── I mean branch wise I have no regrets at all... Coz cse was always what I wanted...I think I could have easily got a better college for cse like rvce... But yaa no regrets for taking cse."
    },
    {
      "id": "jo6xup8",
      "body": "Usually I say branch over college . You got to still consider other metrics before joining PES like finance , hectic schedule, below average faculty etc \nI hope you have better options for CS available if you are really into CS."
    }
  ]
}