{
  "id": "14anjmd",
  "title": "Confused",
  "content": "Got a rank of 1718 in pessat 2023 which is better ece in rr or cse in ec campus",
  "metadata": {
    "root_comment_id": "jobeq5r",
    "post_id": "14anjmd",
    "author": "_hg_08",
    "url": "https://www.reddit.com/r/PESU/comments/14anjmd/confused/",
    "permalink": "https://reddit.com/r/PESU/comments/14anjmd/confused/",
    "score": 4,
    "upvote_ratio": 0.8399999737739563,
    "created_utc": 1686891493,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jobeq5r",
      "body": "Bro you might get ai ml in main campus in 2nd round\n└── 2nd round is risky\n    ├── I understand but not that risky considering, seats have been increased,  and fees also with offline counselling\n    │   └── I might be having a chance in bms ece or msrit ece so..\n    └── How is second round risky? It happens after KCET first round is done\n        └── Bro we talking about 2nd of pessat\n            └── Pessat second round happens after KCET 1st round and before 2nd round kcet"
    },
    {
      "id": "jobgaph",
      "body": "Which branch are you more interested in? Picking your desired branch goes a long way in making things easier and also enjoyable. Plus both campuses are nearly the same. So go for branch.\n└── Dude thats the problem na i am confused between cse and ece. And both the campuses are NOT the same, i spoke to  2nd year in pes rr and he said rr is 100000 time better in terms of facility and infrastructure.\nThat why i am confused, because i want to choose a branch which is actually good at the university on which the university actually focuses on.\n    └── If you absolutely want PES, then CSE is best here. But you shouldn't go for this route. Branch matters a lot, especially if you intend to pursue higher education. I have a couple of points regarding the campus:\n\n- Trust me, the campuses *are* the same. I graduated last year and I've seen the two campuses being almost the same. RR has more fancy buildings, EC has a spacious and open campus. RR feels very crowded, dense and packed, and the campus is essentially roads between buildings. But yes, the buildings at RR are newer and are very fancy. \n\n- Facilities wise, tech clubs (assuming you'll be interested in these) are currently much better at EC campus - so if you're focusing on CS/ECE, you'd want to be part of the club culture at EC. RR has probably 10x the number of clubs compared to EC, but over 80% of them are dead and almost all of them are mediocre. EC has fewer clubs overall, but the tech clubs at EC are currently unmatched. A few people will say that RR has weekly Hackathons - this is actually a *bad* thing. The quality of these hacks are severely diluted and most of them are poor. On the other hand, Hackathons at EC might be sporadic, but they always promise quality. \n\n- Research clubs at both campuses have gone to shit so it isn't a discriminator anymore. As a student you can take part in clubs at both campuses and internships at these research clubs are open to both. So again, not a discriminator.\n\n- The **only major difference** are the fests. RR fests are significantly better than EC, no denying. But as a student, you're open to take part in either. So you may not get to organise the bigshot fests, but you'll definitely get to take part in them.\n\n- Placements are pooled, so again not a discriminator. Placements take place together for both RR and EC campuses, EC campus kids need to come to RR campus and give interviews during placements. Companies don't know which campus a particular student is from so they can't really distinguish between candidates. \n\n    - Now, some people online will claim that companies prefer RR campus more and that these companies \"somehow\" know which campus a candidate is from. These claims are false and the reason for more RR campus kids getting selected is simple statistics. RR campus has double (if not more) the number of students than EC campus. My batch (2022) had 600 CS in RR and 300 CS in EC campus. Which meant, that the probability of an RR campus student getting selected is ~67%, which is double the probability of an EC campus student getting selected at ~33%. Because of the large difference in number of candidates at both campuses, it will obviously look like favouritism and partiality to the naked eye. Each campus' student has an equal shot at placements, it just appears to be one sided because of the skewed distribution.\n\n- Faculty is equally unqualified at both, profs leaving both campuses and the remaining ones are mediocre. So again, can't really compare. I'd say profs at RR might be marginally better, but it's barely enough to call it a difference. \n\n- Finally, your campus at the end of the day will mean nothing. It will matter only to you for exactly 3 years (Final year nobody comes to college). Neither your degree, nor any official documentation from PES at the end of your 4 years will contain the campus name. When you apply for jobs, or go for higher education, your campus won't mean anything. It's a choice that will only support your education for 3 years - after that it's irrelevant.\n\nIMO, the main comparisons that you should make are very subjective parameters such as travel costs, distance from your place, etc. Apart from that, if fests are a dealbreaker for you and you're someone who has a wide range of interests beyond tech clubs, then RR. If you're okay with not *organising* (because you can always take part) the largest fests, and would like to only take part in tech related clubs, then EC. But as I said - these differences will only exist for 3 years: after that the campus you graduate from is irrelevant.\n\nIf you have more questions, I'd be happy to answer. As I said, I graduated in 2022 so I'd say I know quite a bit about both campuses. Feel free to DM.\n        ├── Thanks a lot man i guess i am getting clearer in my decision now.\n        ├── Anna I got into Cse at ec campus , so finally which one is better ? Fests of course every student expects something from the college right?\n        │   └── Which one is better depends on you. You can only make subjective comparisons and decide since all objective parameters are same. Although fests at EC aren't great, I would still prefer it myself because of a better club culture. At the end of the day, you need to decide which parameters are important to you and select which campus fits you best.\n        │       └── Thank you\n        ├── Hi brother,I'm from Karnataka and I'll probably get ece in RR and cse in EC.What would you suggest to take?\nAnd how's the placements for ece?\n        │   └── what did you take   \nim literally getting the same thing\n        │       └── I took cse bro ,it's better fr ,that's what I feel\n        │           ├── How is campus life at ec?\n        │           └── heyy im taking cs in the ec campus as well, can i dm you?\n        ├── Is this still relevant since this was a year ago? \nNot being rude sry just that I'm getting pressure from friends to join rr ai ml over ecity cs\n        │   └── I am in the same situation, btw is there any difference in the syllabus of ec cse and rr cse in any semester?\n        │       └── Nope\n        └── So, from.my personal experience every place has a set of degenerate corrupts, coyld you please throw light on it?? Whoch has lesser number of such students??(degenerate not in terms of academics ,ofcourse all around us might be equal or better than us, but in terms of deceny and maintaining order)"
    },
    {
      "id": "joc943o",
      "body": "As many people have already pointed out, if you want cse then stick with it. The college will not matter once you graduate. If you are okay with both ece or cse, people lean more towards the rr campus."
    }
  ]
}