{
  "id": "14ataui",
  "title": "Total credits clarification",
  "content": "EC campus: I have completed 4th sem and now getting options to do the summer course but due to some reasons I cannot travel to Bangalore rn. So will my 160 credits which is required for the BTech degree will not be completed in any way if I don't do the summer courses ?",
  "metadata": {
    "root_comment_id": "jock7le",
    "post_id": "14ataui",
    "author": "Wide_Result_9883",
    "url": "https://www.reddit.com/r/PESU/comments/14ataui/total_credits_clarification/",
    "permalink": "https://reddit.com/r/PESU/comments/14ataui/total_credits_clarification/",
    "score": 5,
    "upvote_ratio": 1,
    "created_utc": 1686911428,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jock7le",
      "body": "You will be able to complete the degree requirement before you graduate. There will be special topics to take up in the final year. The difference being that people taking up these courses now will gain 2 advantages: 1. They get to reduce workload in the final year and focus on placements, Capstone, prep for higher education etc and 2. In case they receive a poor grade in the summer course, they will be able to swap it (with great difficulty and lots of visits to the department) out with something extra they take up in the final year, so there is a backup option available in case they don't do well. But you'll not have this backup, you'll have to do well in the later courses.\n├── Thanks for the help!\n└── How's marking done in summer courses? Is there any chance i can improve my cgpa if I take up a few courses and do well ?\n    └── Have you had 2 credit special topics? It's the same. 50 marks, 10 marks per unit and totally units. There may or may not be project/assignment. If there is, it scales automatically.\n        └── Thanks and no i haven't had any 2 credit courses as we EC campus peeps don't have any unless they travel to RR campus on weekends i.e for CIE."
    }
  ]
}