{
  "id": "14bjt0d",
  "title": "couldn't make it to counselling",
  "content": "so uh i got 745 rank in PESSAT but i was unable to attend counselling today because an emergency came up and we couldn't travel to bangalore\n\nwill i still get cse in the second round of counselling in july??",
  "metadata": {
    "root_comment_id": "jog2jky",
    "post_id": "14bjt0d",
    "author": "spicayyyweirdolol",
    "url": "https://www.reddit.com/r/PESU/comments/14bjt0d/couldnt_make_it_to_counselling/",
    "permalink": "https://reddit.com/r/PESU/comments/14bjt0d/couldnt_make_it_to_counselling/",
    "score": 3,
    "upvote_ratio": 1,
    "created_utc": 1686984562,
    "flair": "PESSAT",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jog2jky",
      "body": "You mostly will, unless a anomalous number of people ranked higher than you turn up for counseling which ideally does not happen.\n├── i see... i just really dont want to lose this chance because it looks like i wont get cse anywhere else 😭\n│   └── You mostly will not, don't worry\n│       └── tysm for the reassurance :))\n├── Imo usually a lot of people don't come as if u r attending R2 you HAVE to take a seat. So yeah I doubt people would risk it.\n│   └── The demographic of the round 2 candidates changes. You'll find people who didn't get anything anywhere else or people looking to upgrade their seats.\n│       ├── Let's see how it goes.\n│       └── so a rank of 740 would definitely get cse in the 2nd round right?\n│           └── Yes\n│               └── i see :) thank you for taking the time to respond dude\n│                   └── No issues :)\n└── I have 75xx rank. Any seat I can get tomorrow ? Please help."
    },
    {
      "id": "jog5s5z",
      "body": "Any chance for cse at 3.6k ?\n└── ah nahh dude cse cutoffs for the ring road campus are around like 900 :( sorry\n    ├── Okk. :(\n    │   └── best of luck mate <3 im sure everything will work out :))\n    └── just finished the first shift, core cse finished at 1041 rank\n        └── soo uh in 2nd round counselling 740 will still get me cse right?\n            └── man id say 50-50, theres a lotta people who want to upgrade second round from aiml/ece to cse\n\nyou may or may not get, i really dont know and definitely dont want to spoil your mood\n\nbe optimistic though\n                └── ah yeah makes sense, thank you anyway for taking the time to respond :))"
    },
    {
      "id": "jog6k77",
      "body": "Can i get ece at 3.2k round 1?\n└── well i really dont know but as counselling is today and tomorrow im sure you will find out soon! best of luck man :)\n    └── Got ece bro \n>well i really dont know but as counselling is today and tomorrow im sure you will find out soon! best of luck man :)"
    },
    {
      "id": "jogs182",
      "body": "Will I get ece in July ( 2802 ) rank ... I couldn't attend counseling today\n└── ahh im really not sure about any other branches other than cse, i hope you get the branch you want though!! good luck dude <3"
    },
    {
      "id": "johk2c8",
      "body": "Yeah mostly you will get cause 30-40 people from top 100 ranks took seats(including 5 or something in top 10) and in 2nd round they will do it rank order wise, so people who took AIML also won't be able to upgrade before you choose the seat.  \n\n\n  \nDon't worry too much you'll easily get in"
    }
  ]
}