{
  "id": "14bvo01",
  "title": "Which laptop should we buy? Do we need laptop in 1st sem?",
  "content": "",
  "metadata": {
    "root_comment_id": "jojnw8a",
    "post_id": "14bvo01",
    "author": "Timely_Comment_785",
    "url": "https://www.reddit.com/r/PESU/comments/14bvo01/which_laptop_should_we_buy_do_we_need_laptop_in/",
    "permalink": "https://reddit.com/r/PESU/comments/14bvo01/which_laptop_should_we_buy_do_we_need_laptop_in/",
    "score": 4,
    "upvote_ratio": 1,
    "created_utc": 1687020300,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jojnw8a",
      "body": "Any laptop with min 8 GB RAM and i5 would be enough for what ever is done in first year. But if you plan to go explore some more demanding task like Android dev then prolly upgrade the RAM a bit more. Tailor it according to your needs."
    },
    {
      "id": "jojtpzm",
      "body": "Gaming laptop or engineering won't happen 😈👌"
    },
    {
      "id": "jok0qhh",
      "body": "MacBook if you have the budget or else any decent laptop with minimum 8 gigs of ram and SSD should suffice. Don't go for gaming laptops(they tend to have good specs for the cost ) , they have very less battery backup and are very heavy to carry unless you are into gaming .\n├── Some were telling me macbook couldnt run certian apps? Is it true?\n│   ├── Macs not really ideal for pes curriculum. Mfs keep giving MS/DOS apps(windows) especially in first year .\n│   │   └── We had a course called computer Networks in 4th sem, none of the Mac students could complete their labs.. it was ridiculous. Also getting vms to run on windows is a breeze compared to mac\n│   └── I haven't come across any applications as such in my three years here .\n└── Please don't buy MacBook, especially for cse , getting some programs to run on it is an absolute pain. I would suggest Lg gram or Asus vivobook pro."
    },
    {
      "id": "jok6vd3",
      "body": "Get a light and portable laptop, I made a big mistake of buying a heavy gaming laptop which was never used to the fullest and carrying it along with the charger was a pain.\n\nAs far as ML DL stuff goes, always use Google Collab and never fry your PC chip for those tasks and everything else can be taken care by an ultrabook.\n\nIf you are particular about gaming and you are 100% sure you will do heavy gaming get a solid PC setup or get a Gaming laptop or else extend the budget to get a MacBook Air or HP envy or Dell XPS,but having a light and portable machine is very important and i realised this in the middle of engineering \n\nMy preferred choice would be M1 MacBook air, buy it before it is off the shelf in a few months,M2 ain't the perfect machine except for a little longer support cycle.\n└── My parents don’t have money for mac book pro, tell within 50-55k bro\n    ├── Get whatever ultrabooks you get in that range, best bet will be Asus or acer ones\n    └── Well if you wait a bit you could certainly get the M1 MacBook Air around 60k which is a slight stretch of the budget but it might be worth it\n        └── Till when?\n            ├── MacBook Air M1s will most probably be off the shelf once the new apple lineup is introduced this September/October and M1 is the perfect machine apple ever made,not even M2 is as perfect as the M1 and the launch of the new 15 inch MacBook M2 will probably be the last time the price dropped.\n\nLook out for festive deals \nThis is probably the lowest it will go imo, if they retain M1 again after new launch then it might drop but very very unlikely.\nGet a GST invoice and avail card discounts if you have a business.\n\n\nBut at the end Make a wise choice based on your consciousness and budget because you will spend on it and use it....\n            └── I'm also thinking about getting the M1 Air sometime in August based on festive deals... Anyways if you're buying Apple, wait till you get your student id and make sure you avail student discount"
    },
    {
      "id": "jolhejq",
      "body": "Most of the study materials are in electronic form, and u have to learn two programming languages in first year. \nSo if u can afford , it would be helpful to a great extent. \nIf u stay in hostel Or in near by pg, u can use library computers untill 7:30pm."
    },
    {
      "id": "jp3z2oi",
      "body": "Get a laptop with 8gb and 1TB HDD. Get a windows laptop since you cannot run a lot of stuff in Mac natively. Eventually replace windows with Ubuntu\n└── Do we need graphic card"
    }
  ]
}