{
  "id": "14byypw",
  "title": "Doubts about counseling :)",
  "content": "[deleted]",
  "metadata": {
    "root_comment_id": "jokyj8d",
    "post_id": "14byypw",
    "author": "[deleted]",
    "url": "",
    "permalink": "https://reddit.com/r/PESU/comments/14byypw/doubts_about_counseling/",
    "score": 3,
    "upvote_ratio": 0.8100000023841858,
    "created_utc": 1687028739,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jokyj8d",
      "body": "Reach"
    },
    {
      "id": "jol08c4",
      "body": "I got 3400 rank in pessat...couldnt join ctinseling due to bitsat today( which sucked got 220 will get nothing in bits) \nNow to answer your questions,\n\n1) I dont think you have to surrender this seat to take part in round 2 , you can still participate and if you get a better option take it otherwise your ece will be secured whatsoever.\n\n2) My relatives in bangalore said ec campus was just taken over by pesu so no doubt it follows the curriculum of pes rr but the campus and hostel is not as good as rr. I am not saying its bad but I think we deserve better than that.(Whats your comedk rank tho?) As for the placements, they are almost as good as pes rr but still pes rr has a upper hand. Also from the past alumini on linkedin, I got to know that take rr only fot cse..rest branches are neglected there. Ec campus is also far from city with difficult means of transport so there is that.\n\n3( i had a pdf somewhere with last year official pes cutoffs I will upload it again aa soon as I find it.\n\nThis all I said is the info I got from mainly the students of pes I contacted on linkedin so please do correct me if I said anything wrong. And if you find anything good worth noticing about second round mention me there too.\nI am prefering mit pune cse over pes ece as I want to do ece and pes is mostly only good for cse. Message me if you have anyother dohbts.\n└── Appreciate the info.. thanks 👍\nComedk 10k (praying for the cut-offs to be as anomalous as the previous year 😂)"
    },
    {
      "id": "jol0wm1",
      "body": "I have cutoff list Maybe you could DM me"
    },
    {
      "id": "jolb0qc",
      "body": "Your seat is pretty much confirmed. You don't have to surrender it or anything. You can attend second round and if you get something better u can take it and your seat will now become free for someone else to choose.\n\nAs for how good it is, I'm in 7th sem ECE in EC campus and I wouldn't recommend it at all unless you actually enjoy ece or have a passion for it. It's really strict, the teachers make you feel like you're in a strict school and most of our subjects are really hard and not fun. But if you enjoy VLSI or communication you might do fine. Just go check the portions and do a bit of research and see if ece is for you. Also, rr campus ece is a bit less stressful and the teachers are way more chill and nice.\n\nFor my year, the cs ecc cutoff was around 2700 and ece cutoff was pretty high. Like I think 5000 or smtg, but I'm not sure. With 3.6k you could get cs in ec campus but you'll mostly end up with ece itself\n└── Thanks boss🫡"
    }
  ]
}