{
  "id": "14c1jiw",
  "title": "How to ask a question on r/PESU?",
  "content": "Since this subreddit has grown to a large number of Redditors, it is imperative that some rules be followed while asking questions so that we don't clutter this space with duplicate posts, and you get your answers quickly and effectively and most importantly, we can together keep this subreddit clean and organised for our fellow PESsants and PESts.\n\n*Note*: This mainly applies to questions that are posed to this subreddit. However, it is expected that you follow basic etiquette while posting other content as well.\n\n# Step 1: Check the FAQs\n\nThe moderators of this subreddit have done a phenomenal job of cleaning it organised and to help everyone, have curated [an FAQ post which can be found pinned on this subreddit](https://www.reddit.com/r/PESU/comments/14c1iym/faqs/). This post will be updated regularly with new helpful posts and will offer content catering to both current as well as prospective students. So if you are a current student and want to find out when clubs recruit, or are a current 12th grader looking to find out the pros and cons of this University, you can head to this post and obtain all the information you need.\n\n# Step 2: Search\n\nThis subreddit has existed for years and has become increasingly popular over the last 2-3 years. Over this time multiple questions have been asked with respect to common problems, grades and credits, coursework, links to resources and so on. \n\n**Next time you are about to post a question, stop, click on search, and search using relevant keywords**. You will be surprised to find that most generic queries have been answered multiple times over the years by multiple people. So the next time you are searching for how to calculate your CGPA, hit the search bar.\n\n# Step 3: Keep your Question concise\n\nIf you absolutely need to post a question here and would like useful answers, you will need to ask questions with useful details as well. Here is a list of TODOs while asking a question:\n\n* **Do not ask questions without a content body**: always explain the problem you are facing in the content. If you are finding out when a club holds recruitments, it will greatly help if you mention which year you are in and which clubs you are targeting because many clubs recruit at different times during the semester for different batches.\n* **Keep the title short, crisp and to the point**: Ask your question in the title and keep it short. This is what everyone reads first, so if you want maximum engagement, remember to make it relevant and small.\n* **Keep the content relevant but detailed**: While explaining the details of your problem, ensure you cover all aspects of the matter. Do not skip details, or worse, assume we know something, and post everything you have tried, done, etc. Do not mislead with irrelevant facts or rumours, and definitely [avoid the XY problem](https://xyproblem.info/).\n* **Add attachments if needed**: Some things are better explained or supported with media like a PESU announcement, course requirement, etc. Feel free to attach media if you think it is necessary to add further details. Remember to mask personal information before doing so to avoid revealing your identity. \n* **Mark with appropriate flairs**: Add the appropriate flair to your question so it can be filtered. Additionally, remember to add the spoiler or NSFW tags if necessary.\n\n# Step 4: Wait for Answers\n\nAfter asking your question, sit back and wait for responses. People here are active, but they also do have busy lives. Make sure you follow these steps to avoid getting banned due to misbehaviour.\n\n* **Do not comment \"CFBR\"**: Commenting this does not increase the likelihood of someone seeing your post on Reddit, because it simply does not work that way. Instead, upvote the post or any of the comments. Doing the former counts as spam and will lead to your post getting deleted.\n   * *Note*: **If you need** ***immediate*** **answers, you are better off asking on** [**our Discord server**.](https://www.reddit.com/r/PESU/comments/142gani/pesu_discord/)\n* **Be courteous**: Once people answer your query, remember to thank them. There are humans under their secret and cryptic Reddit usernames. Also, be kind and **ask them before you slide into their DMs**.\n* **Verify and validate**: Remember that you are reaching out for help on a public forum. The information presented to you may not be accurate and the **ultimate responsibility will lie on** ***you*** **to verify** the details. Listen to what everyone offers, but trust no one without proof. \n* **Return the favour**: Remember to help others out! Additionally, if you figure out the answer to your question and nobody has answered, remember to add the answer as a comment below so it helps out any other Redditor who comes across a similar situation.\n\n# Bonus: How to answer a Question\n\nPeople are more likely to answer your questions if their questions receive quality answers as well. While it is encouraged to answer all possible queries, please keep in mind a few basic rules before doing the same.\n\n* **Fact check**: Always, and I repeat, always, **fact-check what you are posting**. Do not go based on rumours, and if you are not sure about your answer please do mention the same. Some of the questions posted here possess critical importance such as those related to credits and dropping of courses. If possible, also refer to and cite the source of your content. If you are not sure of the answer, skip the post and move on.\n* **Spill the details**: Provide all the details and do not hold back information for future conversation. Structure out your answer, use appropriate formatting and always elucidate all the intricate details. If you have answered a similar question before, you may link to your previous answer.\n* **Be respectful and civil**: Goes without saying, please be kind to the author of the post. They may be new or might not have the required information for valid reasons. There is no need to judge a person for the same.",
  "metadata": {
    "root_comment_id": "nfyjfe8",
    "post_id": "14c1jiw",
    "author": "rowlet-owl",
    "url": "https://www.reddit.com/r/PESU/comments/14c1jiw/how_to_ask_a_question_on_rpesu/",
    "permalink": "https://reddit.com/r/PESU/comments/14c1jiw/how_to_ask_a_question_on_rpesu/",
    "score": 8,
    "upvote_ratio": 1,
    "created_utc": 1687035441,
    "flair": "ANNOUNCEMENT :snoo:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "nfyjfe8",
      "body": "(askPESU is free btw)"
    }
  ]
}