{
  "id": "14cg1ax",
  "title": "Is EC campus *stricter* than RR campus?",
  "content": "I have zero idea where they're getting it from but all my friends (they're going cse at RR campus) are going on and on about how EC campus is like a school? And RR has \\*college\\* life? They apparently don't let you have any fun in EC campus and in RR no one cares what you do it's all chill?\n\nI looked around this sub there's literally so many posts and comments and I can't find anything remotely saying this.\n\nI think i can get AIML in RR in next round but i seriously can't take that risk that comes with AIML.",
  "metadata": {
    "root_comment_id": "jokgw3x",
    "post_id": "14cg1ax",
    "author": "SikeKid",
    "url": "https://www.reddit.com/r/PESU/comments/14cg1ax/is_ec_campus_stricter_than_rr_campus/",
    "permalink": "https://reddit.com/r/PESU/comments/14cg1ax/is_ec_campus_stricter_than_rr_campus/",
    "score": 7,
    "upvote_ratio": 0.8899999856948853,
    "created_utc": 1687080271,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jokgw3x",
      "body": "Bro both campus are strict if you want to change to rr you need not forfeit your seat you can upgrade you seat in the 2nd councelling if you get it.\n├── I won't get cs core in RR so yeah i don't think I will\n└── No we will have to forfeit our 1st round seat to get into 2nd round. The director said about it clearly many times in the session. Please dont spread rumours they are very harming\n    ├── NO he was misunderstood I stayed for a while he said later that there's been a confusion.\n\nIf you want to upgrade you can in second round but you can't leave that first seat by then if you don't take another seat in the second round.\n\nLast day to leave is July 12 if you want full refund\n    │   ├── Were u there at the counselling?\n    │   │   └── brother what? \n\nObviously I was why wud i ask these questions in the first place and tell you all that without being there?\n    │   └── July 12 right?\n    │       └── Oh yeah sorry about that\n    └── Nah mate we can upgrade the seat in 2nd round cant forfeit the seat if we do forfeit bro gonna hit us with a fine :)\n        └── Wahan jakar he pata chalega yaar woh takla bahut kuch bool raha tha aur usne yeh announce karke bola tha\n            └── Hahaha,haa bhai jab welcome kit lene jaa rahe tha tab papa ne pucha unhone bola ki 2nd round me seat upgrade kar sak the hai. Takla ne theek se info nahi diya\n                └── If there's an upgrade option provided for folks with a higher rank but already opted for another branch, would they be given preference over someone who has a lower rank but chose to reject an allotted seat after coming for counselling or didn't show up?\n                    └── Yes higher your rank more the preference\n                        └── Gonna be a busy week I reckon, what with the MIT counselling underway among other things..Hope you all get your desired seat in a college of your choice."
    },
    {
      "id": "joki8l3",
      "body": "You're friends are taking the piss\n└── 😭"
    },
    {
      "id": "jokv62p",
      "body": "No,I guess it's not strict since it's new.\n└── Technically it's been there for a while it just switched to being autonomous in 2018\n    └── Oh"
    }
  ]
}