{
  "id": "14coe1z",
  "title": "BACKLOG",
  "content": "I know what backlog means, but a few people told me \"if  you fail in the first sem pesu will conduct a  re-test in the other sem and if you somehow manage to fail that only then you get a backlog title on your resume. Is this all true??    ",
  "metadata": {
    "root_comment_id": "jolnby2",
    "post_id": "14coe1z",
    "author": "[deleted]",
    "url": "https://www.reddit.com/r/PESU/comments/14coe1z/backlog/",
    "permalink": "https://reddit.com/r/PESU/comments/14coe1z/backlog/",
    "score": 6,
    "upvote_ratio": 0.8799999952316284,
    "created_utc": 1687105123,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jolnby2",
      "body": "I'll just explain from the beginning to make things clear for everyone.\n\nIf you fail (or withdraw) a course, you will need to pass it to get your degree. If you do not clear it, you won't be given your degree, your transcript will always show that you have a pending backlog (only if you fail, not withdraw), and you will not be allowed to sit for placements. Now, you can clear backlogs during two specific moments in the year: \n\n1. Summer backlog exam: If you choose to do this, then in the next summer break between the even and the odd semesters, you'll have to give the backlog exam again. \n2. Normal course exam: If you choose to do this, then you'll have to take up the exam for this the *next time* the course is again held. In most cases this is the next year with the next batch (so if you fail a course in 3rd semester, you'll have to take the course again the next 3rd semester kids take it, so you'll be in 5th semester). \n\nOnce you pass via any of the methods, you've passed the course. One thing to note is, regardless of the option you choose, if you need to give a backlog you will only be evaluated on the exam: all 100 marks for the course will be taken from your ESA paper, you will not have any ISA, assignment or project components. Additionally, you can take backlog exams as many times as you need to pass a course, but do remember that each backlog exam costs money.\n\nAlso if I'm not wrong, you will always have an indication that you had a backlog but it was cleared on your transcript.\n\nPS - Backlog exams apparently tend to be easier in the summer. No concrete proof to support this though - just PESU lore \n\nPPS - Funnily, I've heard of some people who know they are going to screw up their ESA withdraw from their exam and instead choose to give a backlog exam in the summer to pass it. This has 2 advantages: you haven't failed the course so it doesn't count as a \"backlog\" so you don't end up with a mark on your transcript, and it doesn't consider your ISAs or other deliverables, so if you've screwed up in those it doesn't affect your overall score anymore. Now whether people actually went ahead with this, I'm not sure. Do this at your own peril - I don't hold any responsibility for exploiting this loophole.\n├── Does backlog affect placement\n│   └── I mentioned it - if you have a backlog you will not be allowed to sit for placements.\n│       └── In the sense if we clear it\n│           └── Then no issues.\n│               └── If we have a pending backlog, is there any semester that we will not be promoted to?\n│                   └── Nope, you will be promoted to the next sem. Just that you won't get your degree if you won't clear\n│                       ├── thanks for clearing that up\n│                       └── Is there a total number of backlogs you can have at any given moment beyond which they stop promoting you?\n\nAlso what happens if instead of a backlog you just have low attendance in one or multiple subjects?\n├── Is it going to show in the marks card as a backlog\n│   └── Yes. As long as you have the backlog.\n│       └── As in if we clear the backlog exam and get a good grade will it show in the original marks card as a backlog for a BTech student\n│           └── And does it matter for placements if we cleared it but not in the first attempt and it’s not a main subject\n└── In a 5 credit course will the lab component be considered while giving the backlog exam or is it only the 100 marks ESA paper?"
    },
    {
      "id": "kb9lfg0",
      "body": "Do we get a new marks card after clearing the withdrawn paper or a seperate marks card is given for the cleared one?"
    },
    {
      "id": "m4hqaif",
      "body": "what is the passing marks for backlog paper"
    },
    {
      "id": "m9vvnjc",
      "body": "Hello can u plz tell me wt will the clg do wen u get backlog for more than 3 subjects in ur first sem. Will i be allowed to go to my next cycle or will be made to wait one year and re write all the subjects and attend classes with juniors\n└── U will be allowed unless u have more than 24 pending credits\n3 subjects is fine"
    }
  ]
}