{
  "id": "14ded0b",
  "title": "CSE in Pes EC vs CCE in Manipal main campus",
  "content": "I'm not sure which one to choose. I would prefer the one which provides both academic and a college life. I would really appreciate your thoughts on this. Also how are the placements in pesu? ",
  "metadata": {
    "root_comment_id": "jop9kkq",
    "post_id": "14ded0b",
    "author": "fuckingawesomebitchs",
    "url": "https://www.reddit.com/r/PESU/comments/14ded0b/cse_in_pes_ec_vs_cce_in_manipal_main_campus/",
    "permalink": "https://reddit.com/r/PESU/comments/14ded0b/cse_in_pes_ec_vs_cce_in_manipal_main_campus/",
    "score": 4,
    "upvote_ratio": 1,
    "created_utc": 1687180433,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jop9kkq",
      "body": "I think, both for academic and college life, you should prefer Manipal Main campus.\n└── Thank you:)"
    },
    {
      "id": "jopawcj",
      "body": "Manipal IMO, although I dont know stat wise how PESU compares to it now\n└── \nI really wished there were stats for this. It's sort of difficult to choose without them:')\n\nThank you btw\n    ├── As far as I have heard, both branches are identical (although you should confirm once). As for choosing - if you know what you want to pursue later (placements or higher education), it streamlines the process. Manipal will be a more conducive environment to develop your profile for Masters, they do provide a lot of opportunities for the same, and will definitely give you more free time than what you will get here. I don't think placements at Manipal are worse than PESU for CS, they will be at least on par.\n\nAs for branches, both branches are identical (although you should confirm once). You should ask seniors at both places about the opportunities you will gain at both campuses and pick wisely. PESU has a main discord server where you can contact current students, I am not sure about Manipal.\n    └── CCE has avg of some 16.5L"
    },
    {
      "id": "jopdntu",
      "body": "Manipal has better campus life and more extra curricular activities. In terms of academics, both are very well updates and have pretty good teaching staff. \n\nManipal offers more exposure, but lesser internship opportunities. \n\nPES has much better placement statistics and it is easy to get internships when you’re in Bangalore."
    },
    {
      "id": "joq3znk",
      "body": "pes has better stats, manipal for college life"
    },
    {
      "id": "joqjrx8",
      "body": "cce is the best comp course in manipal in course structure and median package was higher than pes this year (though average was lower)"
    },
    {
      "id": "jou8yu6",
      "body": "please check your dms\n└── Can't seem to reply there but I got 3.3k in Manipa"
    },
    {
      "id": "joxfkr3",
      "body": "Go for manipal"
    }
  ]
}