{
  "id": "14dnbes",
  "title": "risk",
  "content": "can i get cse or aiml in rr campus in second round of pessat counselling at 1718 rank? Right now i have blocked ece in rr campus. ",
  "metadata": {
    "root_comment_id": "joqzch4",
    "post_id": "14dnbes",
    "author": "hg_08",
    "url": "https://www.reddit.com/r/PESU/comments/14dnbes/risk/",
    "permalink": "https://reddit.com/r/PESU/comments/14dnbes/risk/",
    "score": 2,
    "upvote_ratio": 1,
    "created_utc": 1687201181,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "joqzch4",
      "body": "Did you not get the option of CS at EC campus? Or are you preferring RR campus over EC? If so, why?\n└── tbh i didnt wanted the ec campus as the hostel is not in the campus which is a very big drawback. There would be bus facility for ec campus student which just seemed like living a school life again.\n    └── Honestly, even day to day life will be like school. You'll have regular classes from 8:15-3:30 on most days. A bus journey isn't going to make a big difference IMO.\n\nAlso, campus isn't something you should compare on. It will be irrelevant in 3 years but your branch is forever.\n        └── Bro but the hostel is not in the campus, isnt that a very big disadvantage ? See i can obviously get cs in ec campus in next round of counseling but in future i want to take over my father's business which is producing lighting products which is purely electronics.\n            └── I don't see how hostel not being in campus is a *very* big disadvantage. An inconvenience yes, but shouldn't be a big issue. Secondly, if you're interested in electronics then stick to ECE. I was under the impression that you wanted CS because of the way you had phrased your question"
    },
    {
      "id": "josfjx4",
      "body": "Very high chance , cutoff was close to 1.7\n├── And what about ai/ml in ec campus?\n│   ├── I heard it closed after rr ece , so around 3k mostly\n│   └── Closed at 3.5k\n│       └── Is there any chance i can get ai/ml in second round (5k rank)\n│           ├── If you're in bangalore , attend 2nd round regardless. I'm guessing many people will leave the seat and most people won't opt for aiml in ec in 2nd round\n│           └── Really doubt it, you can maybe get ece\n└── nice man thanks"
    }
  ]
}