{
  "id": "14dqo02",
  "title": "Mess Quality in EC Campus",
  "content": "[deleted]\n\n[View Poll](https://www.reddit.com/poll/14dqo02)",
  "metadata": {
    "root_comment_id": "josdd5b",
    "post_id": "14dqo02",
    "author": "[deleted]",
    "url": "",
    "permalink": "https://reddit.com/r/PESU/comments/14dqo02/mess_quality_in_ec_campus/",
    "score": 4,
    "upvote_ratio": 1,
    "created_utc": 1687208735,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "josdd5b",
      "body": "The mess food will obviously not be as good as your home's food.\n\nBut comparing to a pg, the mess food quality is great, hell you get chole bhature and Manchurian at times."
    },
    {
      "id": "josx8hn",
      "body": "The only thing this poll proves is that most people who have responded are from RR campus 🥲"
    },
    {
      "id": "joxtbh8",
      "body": "EC campus hostel food is good. Even I as a day scholar tasted the Chole , Paneer , Mushroom ,etc. in lunch break with my hosteller friends. Gotta say it was pretty decent"
    },
    {
      "id": "jpm86wi",
      "body": "RR campus have 3 messes\n\n**Food court**: Its the best among the 3. There's a booking system for mess in which you'll have to book your respectable mess by providing a priority order. Food court usually fills up the fastest there's might be a change you won't get food court if you book late.\n\nThe breakfast, dinner and snacks are usually good. In dinner you'll 2 times chicken in a week and the food is north indian. You'll get eggs 2 times a week as well. But the food here is repetitive usually.\n\n**Namdhari**: Here also the food is north indian here and it's pure veg. The food here isn't that much repetitive as compared to food court but the food taste is like a typical mess. It's manageable not that good not that bad.\n\n**Hostel mess**: It's basically the south indian version of namdhari. Here you'll get chicken 2 times a week in dinner as well. It's usually is the least in demand. The breakfast here though is the best."
    }
  ]
}