{
  "id": "14e99yt",
  "title": "Uploading kcet marks",
  "content": "I received a message from pes telling me to upload kcet marks or indicate if i haven't taken the exam. I wrote kcet but didn't get the rank because of some issue with my board marks and honestly didn't care to follow up with it because my scores were bad anyways. Should I just say i didn't write kcet or is there a specific reason why they ask people this",
  "metadata": {
    "root_comment_id": "jott6cj",
    "post_id": "14e99yt",
    "author": "bmakhz",
    "url": "https://www.reddit.com/r/PESU/comments/14e99yt/uploading_kcet_marks/",
    "permalink": "https://reddit.com/r/PESU/comments/14e99yt/uploading_kcet_marks/",
    "score": 8,
    "upvote_ratio": 1,
    "created_utc": 1687262554,
    "flair": "PESSAT",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jott6cj",
      "body": "Cfbr"
    },
    {
      "id": "jotw9fc",
      "body": "I see even you went through that problem. I still uploaded my shitty kcet rank.\n├── The question is why. What reason could they have to make us upload it\n│   └── Probably to estimate how many people might try to change the admission mode, I mean if ur cet rank gets u a seat instead of via pessat, wouldn't u take it?\n│       ├── Ahhhh makes sense\n│       └── I probably just wont fill it then\n│           ├── I mean even I am not sure, but just in case do fill it, if u get ur cet rank that is.\n│           └── I mean even I am not sure, but just in case do fill it, if u get ur cet rank that is.\n└── bro could you please tell me what they mean when they asked for KCET registration number in the PES website to enter marks?\n\ndo they mean the application number or roll number of KCET ?\n    └── I have put kcet roll number idk. I might be wrong so don't trust my answer.\n        └── bro i dont blame you but how does nobody know the answer to this ;-;"
    },
    {
      "id": "joxsp3t",
      "body": "Maybe they ask it in case u get PES through cet. I didn't bother giving my cet marks and it didn't really make any difference so you should be fine if u say u didn't write it"
    }
  ]
}