{
  "id": "14f09l3",
  "title": "How does the course work?",
  "content": "Hey, I'm going to part of the 2023-2027 batch for CSE in EC branch. I've been trying to look for course material or timetables and text books and more but I'm not able to find anything straight forward, the syllabus and other stuff on the website doesn't tell me what is there in the first 2 sems other than python and C\n\nI also wanted to know how hectic the entire 4 year course can get, and if I'd be able to actually do or learn anything on the side and also about the difficulty of the exams and assessments that take place\n\nAlso, the capstone project, i keep seeing and hearing about it, but i haven't found anything that tells me what it is ;-;\n\nIt'd be great if y'all could help me with all these, thanks!\n\n\n\nTLDR : help with course material, difficulty of course and brief of capstone project",
  "metadata": {
    "root_comment_id": "joxmm43",
    "post_id": "14f09l3",
    "author": "Prenji",
    "url": "https://www.reddit.com/r/PESU/comments/14f09l3/how_does_the_course_work/",
    "permalink": "https://reddit.com/r/PESU/comments/14f09l3/how_does_the_course_work/",
    "score": 9,
    "upvote_ratio": 1,
    "created_utc": 1687330936,
    "flair": "Study Help :table:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "joxmm43",
      "body": "U can find the courseware on PESU discord \n\neven on https://better-pes.vercel.app\n\n&#x200B;\n\nHere you go:\n\n[https://discord.gg/3AYFSp55](https://discord.gg/3AYFSp55)\n└── Thanks a lott!!"
    },
    {
      "id": "joxrlb1",
      "body": "Have you looked at the PESU FAQs? \n\nTake a look here, you'll find the link to different threads that answer most of your questions. As for resources, as someone said join the discord server. Syllabus keeps changing every year, your best bet is to ask someone who recently finished that year.\n\nhttps://bit.ly/pesu-faq"
    },
    {
      "id": "joxt0f7",
      "body": "Don't worry syllabus will soon be uploaded for you.\n\nAlso nothing much could be done in the first year cuz of the 5 ISAs , 5 supervised assignments , etc. But for you guys(and us) it's better cuz we will be having 3 ISAs from now on. Bit of extra time to do something else will be there!\n\nFirst sem you might find it easy. Python and Engg Maths-1 are good scoring subjects do capitalize on that cuz next sem C and Maths-2 will be tougher. Faculty for both Phy and Chem cycle is decent.\n\nCan't tell about the capstone project as I am still in 2nd sem."
    },
    {
      "id": "joy76s7",
      "body": "Capstone project is nothing but your final year project.  You need to do it under a guide. It's a group project. It includes selecting a problem statement, it's literature survey, implementation, results, publication of a paper based on that topic.\n\nWe had Capstone project from our 6th sem to 8th sem. It also includes regular reviews with your guide and panel members.\n\nHope this clears your doubt. Feel free to dm for any doubts :)"
    }
  ]
}