{
  "id": "14gb7kf",
  "title": "Got Not So Great Rank in BITSAT and wondering which one should I choose!",
  "content": "[deleted]\n\n[View Poll](https://www.reddit.com/poll/14gb7kf)",
  "metadata": {
    "root_comment_id": "jp4k8bl",
    "post_id": "14gb7kf",
    "author": "[deleted]",
    "url": "",
    "permalink": "https://reddit.com/r/PESU/comments/14gb7kf/got_not_so_great_rank_in_bitsat_and_wondering/",
    "score": 4,
    "upvote_ratio": 1,
    "created_utc": 1687459115,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jp4k8bl",
      "body": "> I have to get 8.5 CGPA in First Year then only it's Possible\n\nFirst, from what I know, crossing an 8 in BITS is extremely difficult. How confident are you of your chances? And second, if you *don't get a branch transfer*, are you okay with studying what you have? Third, you mention about switching to CS/ECE so I am going to assume that you are interested in this field. Now, if you do have plans of higher education, and you cannot switch, then you will not be able to pursue CS later on. So will you be okay with this?\n\nIf you can answer these three questions, you will have your answer.\n└── 1.I am not very confident about getting 8+ CGPA in BITS\n\n2.No....I hate Chemistry\n\n3.I as of now don't have any plans of pursuing Masters\n    ├── Okay given that you aren't confident of an 8+ and dislike chemistry, why would you want to graduate with a degree in chemistry? That does not add up - your branch is something that will be there forever. Second, I am not sure about policies at BITS and other Uni's, but atleast at most places and even what I've seen online, companies restrict candidates for jobs based on branches. A lot of companies only allow CS and circuital branches to sit for placements. This *might* not happen on campus, but definitely happens off campus. Are you willing to take that risk?\n    │   └── I think it will be best if I take PES instead of Bits for the last Point alone!\n    └── I think you are misunderstanding the way BITS works. Even if you get a low CGPA, Chemistry will not be your main subject, because you will have to take a BE degree based on your first year marks no matter what. The Msc only takes one year of the five, the remaining is your BE. You can drop the Msc as well, but will need a good CGPA for that.\n        └── Is it like this doe?\n\nYou can't drop chemistry at any cost until and unless you go for branch change in first year\n\nIts your first degree otherwise no one would have done dual degree everyone would have dropped it even if you get high CG(CS dullas)"
    },
    {
      "id": "jp6j46q",
      "body": "How many marks did you get? I got 165 and I have the same doubt, can you choose masters for now but change into a bachelors degree later on? And how difficult will the first year be in BITS?"
    }
  ]
}