{
  "id": "14grm0l",
  "title": "I'm really confused between bits msc eco and Bangalore colleges (Mainly PES)",
  "content": "I got a 264 on my bitsat and got rank 449 in kcet, I think I get everything but I'm not sure about RV cs.\nI'm only interested in cse and not at all in ece/eee\nAnd funnily enough those are the only things I get from bits.\nIf I consider bits, I'd have to take a 35 lakh education loan because my parents don't have anything to finance this.\nMy other choice is probably go to pes and just hope that I get a decent placement later so I can try to study abroad for a masters. If I do choose that I wanted to know if pes is a decent option, how is academic workload, free time hostel etc\n(I also want to try to do the iit Madras online degree so I want to know if pes leaves you with enough time for that)\nThoughts?",
  "metadata": {
    "root_comment_id": "jp7a37s",
    "post_id": "14grm0l",
    "author": "[deleted]",
    "url": "https://www.reddit.com/r/PESU/comments/14grm0l/im_really_confused_between_bits_msc_eco_and/",
    "permalink": "https://reddit.com/r/PESU/comments/14grm0l/im_really_confused_between_bits_msc_eco_and/",
    "score": 4,
    "upvote_ratio": 0.75,
    "created_utc": 1687504083,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jp7a37s",
      "body": "Yes, definitely you will get PES. Also KCET fees very less"
    },
    {
      "id": "jp7ctby",
      "body": "My man , it depends on what you want to do , MSc dual is a risky thing to take if you're NOT interested in economics. As you've clearly stated you don't like ece / eee , there's a big chance you'll end up with that branch during the dual degree , and you'll have to come in term with that.\nIf you are okay with pursuing economics and possibly giving up on CS (which will close your doors for an MS in cs abroad too) then go for BITS eco. They have good placements for EEE/ECE.\nBut if you like cs , no questions asked , take PES, fees is much much much lower.\n└── Yeah I might end up going to pes, do you think I'd have enough time to manage the online degree at the same time?\n    └── I'm not sure about that , some manage and some don't,  I know a guy doing the IITM online degree and they take their exams very strictly. Totally depends on you but if you can prioritize stuff you'll manage."
    },
    {
      "id": "jp83hr6",
      "body": "[Here is a similar post from yesterday which might help you conclude what to pick.](https://www.reddit.com/r/PESU/comments/14gb7kf/got_not_so_great_rank_in_bitsat_and_wondering/?utm_source=share&utm_medium=web2x&context=3) \n\nTLDR: Pick PES."
    },
    {
      "id": "jpcn4og",
      "body": "I was in a similar boat like 6 years ago and I decided to go with PES. I was apprehensive about my decision till second sem when I realised that I'd probably flunk if I was doing something that wasn't CS, which is what I was interested in doing. I ended up doing exactly what you're hoping to do (good placement, and then currently in grad school), and being from PES didn't really hamper either. \n\nIf you're going the MSc eco route, either make sure you like what you're doing , or you don't need to like what you're doing to do well in it. Your GPA is actually incredibly important if you're considering applying to a good university in the US. Most MS programs will cost you a fair bit as well, so your entire education might be really expensive if you choose to go that route. \n\nI personally don't think you'll gain any extra value from the online IITM program.\n└── Thanks a lot for sharing, I think I'll choose to save the money and put in some work at pes. I'm still gonna consider the iitm degree just because you can call yourself an iit alumni which might be useful in placements, thanks again"
    }
  ]
}