{
  "id": "14guirk",
  "title": "need help w admission",
  "content": "so i’m getting cs(aiml) in ec campus but the RR CAMPUS LOOKS better in infrastructure, but both somehow are still under construction, i just wanna know how the teaching is in both the campuses and placements, can some senior from ec campus dm me thank you",
  "metadata": {
    "root_comment_id": "jp7ei3s",
    "post_id": "14guirk",
    "author": "slippedandfell018",
    "url": "https://www.reddit.com/r/PESU/comments/14guirk/need_help_w_admission/",
    "permalink": "https://reddit.com/r/PESU/comments/14guirk/need_help_w_admission/",
    "score": 1,
    "upvote_ratio": 0.6000000238418579,
    "created_utc": 1687514609,
    "flair": "PESSAT",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jp7ei3s",
      "body": "Message VASTY_NEO on instagram he will help you out\n└── aaaa i’m not on insta 😭😭😭😭"
    },
    {
      "id": "jp7fpt8",
      "body": "Bro said ECE campus 💀\n├── say what 😨\n│   └── Bro edited 👌\n└── Lmao happens. \"Took ec in ECE campus\""
    },
    {
      "id": "jp7hwlr",
      "body": "RR campus has lot more facilities to offer but I feel the EC campus is not as crowded as RR. Teaching wise both campuses have below average faculty. Placements are gonna be pooled for both the campuses."
    },
    {
      "id": "jp8ilmb",
      "body": "Hey.. I'm sure the experience will remain the same in both campuses.. a lot of focus is there on the ec campus these days as well.. As far as faculty is concerned.. there are good people and bad ones everywhere.. just because you are in rr campus doesn't necessarily mean u will get the best teachers... In the end most of us use yt and other mediums to understand.. it's like.. if someone tells.. Allen is better than base or vice versa ... It's all based on the individual... \nThe main rr campus is kind of a pain.. the traffic is insane.. and in general.. I feel both campuses are good.. yes rr may have a bigger building.. but how does that matter...\nMoral: go for ec campus.. if it's close to your home or u want to stay in hostel/pg.. \nU will get the same opportunities in both campuses...don't worry"
    }
  ]
}