{
  "id": "14h7m5j",
  "title": "Does PES Really have 18LPA as Average and 10LPA as Median For Cse!!",
  "content": "[deleted]",
  "metadata": {
    "root_comment_id": "jp9muu4",
    "post_id": "14h7m5j",
    "author": "[deleted]",
    "url": "",
    "permalink": "https://reddit.com/r/PESU/comments/14h7m5j/does_pes_really_have_18lpa_as_average_and_10lpa/",
    "score": 54,
    "upvote_ratio": 0.949999988079071,
    "created_utc": 1687549096,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jp9muu4",
      "body": "Fake"
    },
    {
      "id": "jp9pyex",
      "body": "Seems about right. Maybe the average is a little high, I'd say about 16-17 should be right. The median a few of us had computed was a little higher, around 11-12 tbh. As for the stipend and highest compensation - they're accurate too. \n\nBut beyond these numbers, I am not sure of the rest.\n└── Do you mind sharing the stats which your calculations are based off of??\n    └── The calculations were posted by someone on our discord server who used the spreadsheet that was attached on this subreddit."
    },
    {
      "id": "jp9r2kg",
      "body": "Yes its correct"
    },
    {
      "id": "jpb3qt2",
      "body": "Seems correct. But do note the number of students unplaced.\n\nAlso average is not a good metric. It gets skewed easily by a few very high offers which are usually super rare. And those offers also are stock heavy.\n\nFor example: 65LPA might be 15 LPA basic + stock + gratuity + PF + relocation \n\nHence I would say expect a majority of people to get 8-10 LPA basic. But yea this looks right"
    },
    {
      "id": "jpb4zc5",
      "body": "I think all tier 2 colleges are doing good , Manipal Rvce also have avg around of 17-20L and median 14-15L"
    },
    {
      "id": "jpbi15e",
      "body": "Obviously not true"
    },
    {
      "id": "jpbj1oz",
      "body": "I graduated at 2018. Average is bit skewed.\nMe and most of my friends were doing okiesh in college (8-9cgpa).\nWe all got placed around 14L-30L CTC.\nFast forward to 2023, we are doing good at 50L-1CR CTC.\n└── Can I dm you I'm in some big trouble\n    └── Yea sure\n        └── Hi I did dm you"
    },
    {
      "id": "jpbkkpv",
      "body": "Wait what happened to the recession?\n└── Recession came this year. It might've affected the placements at the very end\n    └── Yup, it is currently affecting the 2024 batch. The people in the 2023 batch have not been affected too much\n        └── What do you think will happen if the only thing PESU is known for gets hit badly? Just curious.\n\nI can already see the management making some absurd decisions for the batch coming next for placements."
    },
    {
      "id": "jpbtozf",
      "body": "65 Seems to be 15+ (50/4 years), don't know why these colleges represent the total this way.\n└── I don't quite get what you're hinting at, but the 65 lpa offer is indeed right. If I remember correctly it was offered by Palo Alto I think\n    └── It's definitely not 65 LPA per year, right? (Irrespective of what those components are, it's not for a single year, right?)\n        └── Nope, that's the CTC. The compensation mentioned and used for calculating average is all on the CTC. Yes it's flawed, but that's what all Uni's unfortunately use as the basis of comparison\n            └── Right, that's what I was stating in the original comment, that this number is clearly misleading, and not just flawed it's nonsensical. I've seen it getting used recently, and colleges and students (and companies) all are using these terminologies for freshers"
    },
    {
      "id": "jpd0xr0",
      "body": "Are you sure this is CSE only or all branches combined and is it only RR or EC also combined?\n├── The image seems to be from the pessat counselling so ig it is combined for all the branches and both campuses\n└── The Guy who shared it with me said that this data is of CSE Branch (RR+EC)\n    └── Hmm...But acc to this [https://drive.google.com/file/d/1tvdfHXMPP\\_JjSB5h55VneBZoSAvMKCdv/view?usp=share\\_link](https://drive.google.com/file/d/1tvdfHXMPP_JjSB5h55VneBZoSAvMKCdv/view?usp=share_link) it looks like these stats are combined for all branches in both campuses...Thats why the median is 10....If we include only CSE median should shoot upto around 12"
    },
    {
      "id": "jpf8tz4",
      "body": "OK PES or IIIT Dharwad plzzzzz\n└── PES lol....Have a look at this https://www.reddit.com/r/JEENEETards/comments/1453fru/iiit\\_dharwad\\_placement\\_statistics/"
    },
    {
      "id": "jpp64ux",
      "body": "Yeah sounds about right.\n\nBut I’ll add one thing. So it says highest compensation is 65LPA, that’s not what you think it is. So the company approaches the college and says CTC is 65LPA but what that really means is for example 20L base + 45L stocks over 4 years. That means 11.25L of stocks per year effectively which would make the annual income 31.25L"
    }
  ]
}