{
  "id": "14jbpmp",
  "title": "mechanical engineering",
  "content": "RNS or PES for Mechanical engineering, the RNS HOD sounded very promising , but I want to know the reality , I dont know where to source the information about RNS , PES I have an idea",
  "metadata": {
    "root_comment_id": "jpl7txs",
    "post_id": "14jbpmp",
    "author": "Ok-Pear-3145",
    "url": "https://www.reddit.com/r/PESU/comments/14jbpmp/mechanical_engineering/",
    "permalink": "https://reddit.com/r/PESU/comments/14jbpmp/mechanical_engineering/",
    "score": 1,
    "upvote_ratio": 0.6700000166893005,
    "created_utc": 1687769118,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jpl7txs",
      "body": "Which college is RNS?\n└── It's in Rajarajeshwari nagar"
    },
    {
      "id": "jpmjje3",
      "body": "PES bro 100% if we're talking about mech in both. RNSIT is the type of college u go to when u have no other option. PES is the second best in Bengaluru at least in terms of academics so it should be the choice. But if you really want to have fun and  are not really serious about your course then go with RNSIT\n└── I spoke to a student of PES and he said the HOD of Mechanical branch of PES is a crack head , the good lecturers are leaving and the students are trying to keep the mechanical branch alive . Which branch are you from?\n    ├── I'm joining pes this year but I know people from both colleges. Mech at any college whether pes or rns is mid at best. So you'll have to decide based on other things, which one has better name, which one trains you for tech placements, which one will give you better opportunities etc and I feel PES is the clear answer for these questions. Management and HODs will be shitty in most colleges (usually for core branches) so look for other things. Again I don't study here so if you want to hear from someone at PES then I'm sorry I can't help\n    └── I can vouch for that.. rns hods and the principal are very nice PPL.. most hods and the management at pesu are crack heads.. but for any non cs,is,aiml subjects take pesu.. jobs are tough if you take mech let alone in small clgs... But RNs for mental peace is much better.\n        └── Thank you very much for the suggestion ,I truly appreciate it !!!"
    }
  ]
}