{
  "id": "14jorr3",
  "title": "How does CGPA play a role in placements?",
  "content": "Do all the 9 pointers get a greater package than all the 8 pointers? Do all 8 pointers get a greater package than all the 7 pointers? How does all this work? If I have a good grade in CS (1st Year) but below average in the rest will it have a drastic effect on my opportunities 3 years from now?",
  "metadata": {
    "root_comment_id": "jpmvz1r",
    "post_id": "14jorr3",
    "author": "Different-Horror-417",
    "url": "https://www.reddit.com/r/PESU/comments/14jorr3/how_does_cgpa_play_a_role_in_placements/",
    "permalink": "https://reddit.com/r/PESU/comments/14jorr3/how_does_cgpa_play_a_role_in_placements/",
    "score": 4,
    "upvote_ratio": 1,
    "created_utc": 1687803325,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jpmvz1r",
      "body": "Contrary to what you said, it's mostly the 8.5-9 pointers who always get placed first and also usually get the biggest packages. There are multiple factors that are the reason for this, I'll break it down slowly. Also note that my answer is strictly for CS only, since the question is for CS. \n\n* PESU keeps a cutoff CGPA of about 6.5+ to be eligible to sit for placements. Anyone below that is simply not eligible to sit\n* When companies visit, they also set a minimum CGPA requirement. Over the years, we've seen companies range this threshold from as low as 7 to as high as 9. So the safest bet to be eligible for *all* companies is a 9+. But an 8.5+ is considered a safe bet. **But, this isn't the end of the story**. \n* Companies filter out candidates using a placement test that comprises programming and sometimes theoretical questions. Usually, companies filter out only about 20, at most 30, people to interview. There are multiple parameters that affect the selection process, one of them being your CGPA. \n* So it is possible for you to solve every question correctly and still not get shortlisted if everyone who performed as well as you on the test has a higher CGPA than you. \n* Usually the CGPA stops mattering after this point *directly*. Why would I emphasize the word? Because there is a consistent distribution that repeats every year during placements. *Usually*, the candidates with the highest CGPAs (9.7+) do not always have the best profiles beyond the \"required\" academic sense to steer them through the interviews. On the other hand candidates with slightly lower CGPAs tend to have significantly better profiles when it comes to projects, research and work experience, so they have a balance of both CGPA and other activities which boosts their chances of clearing the interviews. Which is why (as I stated earlier), it's always the 8.5-9 pointers who get placed first with the biggest packages. \n\nIf I were you, I'd suggest you to ensure your CGPA is atleast an 8.5 in CS. Also start figuring out what you're interested in and start building a good profile. A balance of both is what will give you the best chance at placements. Good luck."
    }
  ]
}