{
  "id": "14kif59",
  "title": "Please assure me that I've made the right choice.",
  "content": "[deleted]",
  "metadata": {
    "root_comment_id": "jpqo4hc",
    "post_id": "14kif59",
    "author": "[deleted]",
    "url": "",
    "permalink": "https://reddit.com/r/PESU/comments/14kif59/please_assure_me_that_ive_made_the_right_choice/",
    "score": 2,
    "upvote_ratio": 1,
    "created_utc": 1687883555,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jpqo4hc",
      "body": "If you want you can shift to aiml in 2nd round"
    },
    {
      "id": "jpqokkt",
      "body": "U are wrong imo, ec and rr no big diff tht you compromised on such big thing called branch\n└── I would have chosen CSE, at any campus. But the people at counseling that day, had be scared about how ec campus is so new and AIML is an extremely new branch for them.\n    ├── Yeah I remember, not even single seat was taken in any branch at ec campus atleast till the time I was there, it gave huge negative precption about that campus, but all other guys online on discord and reddit say otherwisr.\n    │   └── Yeah it's not like I can change much now. I had anyway liked ECE's syllabus. If coding is gonna get me a job, I'll learn it elsewhere. Thank you for answering:)\n    │       └── Ohh, if you have interest in ece then that’s great, but bro do try to change it in second round, in pesu ece facilities(labs etc.) are not great i hv heard from many. But again Rr do have some advantages\n    │           └── Thanks mate. I don't think I'm gonna leave RR campus tho. And I don't think I'll get CSE or AIML at RR campus even in the second round with my rank. I'll still attend the second round tho. Thank you!\n    ├── Always choose the branch over the campus. There's a link in the FAQs post which talks about the comparison\n    └── AIML was just introduced last year and since all first years have common syllabus no one really knows how the course is structured. AIML will have all core CS subjects for sure which have been taught for many years . Choosing AIML will restrict you to one domain and you may not get to choose electives from other domains like cybersecurity, systems etc in your third year."
    },
    {
      "id": "jpti3ho",
      "body": "Do not choose ECE just because you didn't get CS , take ECE only if you have interest in it . ECE is prolly one of the toughest branches and without interest you are gonna suffer . If you are truly interested in programming try going for CSE in EC campus or take AIML in EC campus . There's not much difference in RR and EC campus , RR has a slightly better campus that's it imo.\nView other posts on this sub regarding RR vs EC campus to get to know more"
    },
    {
      "id": "jpudl3n",
      "body": "You've messed up dude.. good luck."
    },
    {
      "id": "jpz6cve",
      "body": "Dude you messed up big time but dw , apply for AIML or CSE(CSE is preferred)  during second round which I am sure you will ."
    }
  ]
}