{
  "id": "14m55c5",
  "title": "Do I need a need to buy a new laptop?",
  "content": "My laptop is hp 11th gen, i3, 8GB RAM, storage 237GB(OUT OF which only 100 is free).Its 1.5yr old and it costs around 30 to 40k, my course is aiml. And do we need a graphic card for later sems?",
  "metadata": {
    "root_comment_id": "jpzq04v",
    "post_id": "14m55c5",
    "author": "CarpenterMysterious6",
    "url": "https://www.reddit.com/r/PESU/comments/14m55c5/do_i_need_a_need_to_buy_a_new_laptop/",
    "permalink": "https://reddit.com/r/PESU/comments/14m55c5/do_i_need_a_need_to_buy_a_new_laptop/",
    "score": 5,
    "upvote_ratio": 0.7799999713897705,
    "created_utc": 1688045537,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jpzq04v",
      "body": "That will be fine\n└── So i can use it for all the 4 years?\n    ├── See it depends on what you are doing, but you can always get the RAM and storage upgraded. That's what I did. I have Dell with i5, 8th Gen, 12GB RAM (previously was 8GB, but got upgraded recently along with SSD).\n    │   └── But apparently u need graphic card fron 2nd year for some subjects\n    ├── See if you can get it upgraded instead of investing in a new laptop, it would save your money\n    └── I suggest you ask the same question in Btechtards as well. It has a more significant community response than the PESU sub\n        ├── Okay thank you\n        └── Oof 🥲\n            └── ?"
    },
    {
      "id": "jpzqruy",
      "body": "Yes you do, but its also fine\n└── So i can use it for all the 4 years?\n    └── Nope, you need to buy, for aiml i hv heard you need a mid gpu as well\n        ├── Oh ok\n        └── 3060 is enough?\n            ├── Is 80lpa enough to survive in Bangalore ?\n            │   └── Nah you need much more than this bruddah\nAt least double\n            └── More than enough to be fair"
    },
    {
      "id": "jq074ox",
      "body": "I would suggest you buy a better laptop eventually, but not right now. You can easily finish first, and maybe even second year with this laptop. If you are in AIML, it is beneficial to have an Nvidia GPU on your laptop, but it is not a must (there are workarounds). Wait for a year, by then you will realise your interests, what kind of hardware is required etc and you will be able to make a more informed decision."
    },
    {
      "id": "jq11bzx",
      "body": "You're good for the first two years. Consider buying a new one later."
    },
    {
      "id": "jq33ph8",
      "body": "Get 16GB RAM (upgrade your RAM kit) and a good external storage\n\nWould be cheaper than buying a new laptop"
    },
    {
      "id": "jq9a6im",
      "body": "Broke ass\n└── Am richer than ur whole family tree lol"
    }
  ]
}