{
  "id": "14mm0mn",
  "title": "Hostel and Mess Fees of PESU",
  "content": "[deleted]",
  "metadata": {
    "root_comment_id": "jq32tdb",
    "post_id": "14mm0mn",
    "author": "[deleted]",
    "url": "",
    "permalink": "https://reddit.com/r/PESU/comments/14mm0mn/hostel_and_mess_fees_of_pesu/",
    "score": 2,
    "upvote_ratio": 0.75,
    "created_utc": 1688086793,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jq32tdb",
      "body": "Hostel and mess fee collectively is 1.53L if you got NBX, If you got IT Block then it's 1.38L\n└── Which one Should one Take(Pros/Cons) and This for RR Campus. Right?\n\n(Thanks for Responding because Even though I asked this Question many more would likely see it and It will Help them also)\n    └── IT Block:-\n\n    Triple Sharing, Common Washroom\nPros:-\n    The rooms are designed in such a way that every student gets a personal corner of it's own which is quite spacious\n    You'll be able to socialise with people on your floor as you'll be seeing them every other day.\n     Has a small garden which is kinda good\n     Cheaper. \nCons:-\n  Leeches and other insects might crawl up to verandas on the Ground floor.\n  Might take you some time to get accommodated to the Common Washrooms. \n\n\nNBX Block:-\n   Triple Sharing, Attached Washroom.\nPros:-\n  Cleaner and better tables, shelves, doors.\n   Wi-Fi works kinda better than IT Block.\nCons:-\n  The rooms don't have any segregation. You'll be aware what your roommate is doing at all instances. No privacy.\n        └── >Leeches and other insects might crawl up to verandas on the Ground floor\n\nBruh!!\n\nThis Reason alone will most Probably be a Huge Turnoff for Many People thinking of Opting IT Block Hostel!!\n            └── Nobody opts for IT Block willfully 🤣🤣.It only mattered for a half a month at max.\n                └── So like is there any First Come First Serve scene in case of Hostel Allotment?\n                    └── Yes. You have to pay first.\n                        └── When do we have to usually Pay for Hostel?\nLike Just before Class Commencement or like 1 week before it or something like that?\n                            └── If you still haven't paid. Start searching for a pg already. Many parents book hostel on the day on offline councelling itself.\n                                └── Ahh Shit!!\n\nI could have got CSE in Round 1 but choose not to attend Round 1 and instead wait for Round 2.\n\nI did not knew about this thing like AT ALL!!"
    }
  ]
}