{
  "id": "14mxk5l",
  "title": "Running low on my gpa, need project help",
  "content": "So i have heard ppl say they compensated  their cgpa by having good projects, but i still have no clue what \"good projects\" exactly mean. If anyone knows what type of project to do for running a low gpa pls help. Thanks",
  "metadata": {
    "root_comment_id": "jq4st0k",
    "post_id": "14mxk5l",
    "author": "Fun-Understanding862",
    "url": "https://www.reddit.com/r/PESU/comments/14mxk5l/running_low_on_my_gpa_need_project_help/",
    "permalink": "https://reddit.com/r/PESU/comments/14mxk5l/running_low_on_my_gpa_need_project_help/",
    "score": 10,
    "upvote_ratio": 0.9200000166893005,
    "created_utc": 1688123820,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jq4st0k",
      "body": "First, you cannot really offset a low GPA too much, that is why GPA is very important. Your CGPA is used as a filter for placements as well as Masters abroad. Its a very objective parameter that is used to filter out people, unfortunately you cannot do much if your CGPA is already low.\n\nFirst, you cannot really offset a low GPA too much, that is why GPA is very important. Your CGPA is used as a filter for placements as well as Masters abroad. It is a very objective parameter that is used to filter out people, unfortunately, you cannot do much if your CGPA is already low.. clubs here and so on."
    },
    {
      "id": "jq8i91j",
      "body": "cfbr"
    },
    {
      "id": "jqh4432",
      "body": "Since you didn't mention your branch, im assuming it's cse.\n\nI think the projects that you do under each subject every semester should be fine which are group projects.\n\nOther than this, 1 or 2 individual projects should be fine. (These are important during placements as companies would like to know on which projects you have worked individually)\nFor individual projects, I would suggest you to do them under the domain that you are interested in (eg: ML, networks, IoT) Look out for ideas of some cool projects in internet."
    }
  ]
}