{
  "id": "14n5ard",
  "title": "Need some guidance on the condition of EC Campus' hoste",
  "content": "It would be great if someone from EC campus could help me out with a problem I had. I'm hoping to secure a CSE seat at EC campus through KCET and am wondering if hostel would be better or a PG. I have noticed a lot of people with quite mixed opinions  when it comes to the hostel conditions. Some say that the hostel is well maintained, clean and fairly spacious while a few others say that the warden is a bit strict, the food becomes staler and staler as time goes on, and the management is ignorant towards problems faced by students in hostels. What would you guys suggest I choose, the hostel or PG. And what are some good PGs near the campus. (Please also consider the first year hostel which is not in campus.... Like taking up a PG in first year and then hostel for the remaining 3 years, or any such variations are appreciated.) I'm hoping to to get a perspective on the condition based on your suggestions, so it would be great if you guys could give me a thorough status of the hostels and PGs. \nThank you.",
  "metadata": {
    "root_comment_id": "jq6135q",
    "post_id": "14n5ard",
    "author": "Ariiii_10",
    "url": "https://www.reddit.com/r/PESU/comments/14n5ard/need_some_guidance_on_the_condition_of_ec_campus/",
    "permalink": "https://reddit.com/r/PESU/comments/14n5ard/need_some_guidance_on_the_condition_of_ec_campus/",
    "score": 3,
    "upvote_ratio": 0.8100000023841858,
    "created_utc": 1688142986,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jq6135q",
      "body": ">Some say that the hostel is well maintained, clean and fairly spacious\n\nThis is true, amaatra rooms(1st year) are pretty decent. If you get along with your roommates, it'll be great. \n\n\n>the warden is a bit strict\n\nPanduranga won't be a dick to you specifically unless you're a dick to him, he needs to be strict otherwise there'd be chaos in the hostel. Get to know him and he's a decent and helpful guy. \n\nMeanwhile, the girls hostel warden is the devils incarnation...\n\n\n>the food becomes staler and staler as time goes on\n\nThat happens in every hostel, the food is better than what you'd get in a Pg. And your other option would be either to cook it, or to eat out everytime.\n\nThe food is not perfect, sometimes for breakfast they just give bread-jam(2 slices of bread) :(\n\nOther times they have unlimited masala dosa, it tastes great especially if you're able to get it fresh and crisp.\n\n>and the management is ignorant towards problems faced by students in hostels\n\nWelcome to PES\n:)\n└── I know that the campus hostels do have a gym but does the amaatra hostel have one?\n    └── You get a small room with some dumbells, treadmill etc, it's useable"
    },
    {
      "id": "jqmpkvk",
      "body": "hey I'm also hoping to get a cse seat thru kcet, tho I already have taken cse thru pessat. can I pm you?\n└── Yeah sure, go on."
    }
  ]
}