{
  "id": "14r5blx",
  "title": "RVCE Comed K ISE vs PESSAT CSE",
  "content": "Hello Friends- another help based on admission mode\n\n[View Poll](https://www.reddit.com/poll/14r5blx)",
  "metadata": {
    "root_comment_id": "jqqu3cc",
    "post_id": "14r5blx",
    "author": "Sad_Bed7528",
    "url": "https://www.reddit.com/r/PESU/comments/14r5blx/rvce_comed_k_ise_vs_pessat_cse/",
    "permalink": "https://reddit.com/r/PESU/comments/14r5blx/rvce_comed_k_ise_vs_pessat_cse/",
    "score": 4,
    "upvote_ratio": 0.75,
    "created_utc": 1688548449,
    "flair": "Study Help :table:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jqqu3cc",
      "body": "Additional info - I have already paid Rs 4.5L for PESSAT seat and ComedK rank in 1024. ComedK 1st round counselling is only starting July 18 and the last date for seat surrender for PESSAT is July 17"
    },
    {
      "id": "jqra2jn",
      "body": "rv ise ofc, it is 95 per cent the same as cse with less workload. The highest package last year was from ise and if I'm not wrong the ise average in rv was more than their cse. Add to that the fact that pessat fees will be 1.5 times the comedk fees, that too for no offense an inferior college (at the moment)\n└── No offence taken, we know the state of our college kekw. u/Sad_Bed7528 don't come here unless you don't get ISE at RV, or CS at BMSCE/MSRIT).\n    └── Wouldn't you rate PES CS above that of MSR and BMS? With that mindset I have already spent an year here xD\n        ├── PES > BMS,MSRIT as far as I know!\n\nSince I asked from 4-5 people who have knowledge about all this College and Stuff and all of them except one said that PES is better.\n        └── Placements wise, yes. Not too sure about the other parameters. If it had been PES with PESSAT vs the others with CET, I'd spend more time thinking about BMS/MSRIT before deciding"
    },
    {
      "id": "jqrhdof",
      "body": "what's the order in cse?\nrvce, pes, bms, msrit??\n└── Depends on fee imo , kcet rv > kcet pes > kcet bms > kcet msrit > pessat pes\n    └── biscuits ji, what about kcet pes vs comedk rv?\n        └── If you can *easily* afford fee (without taking a loan) go for rv no doubt. Rv has slightly lax management and better overall club culture and opportunities and RV has less overall intake for CS so less competition. (ofcourse it might still be disappointing but that's every college) but if you don't want to spend a lot pes is also a fine choice , it's not like this is the *worst* college.\n            └── Hmm thank you.. another doubt.. the comedk fees (which they have released as of mock allotment) is 2.6 L.. how much will the grand total be adding all the vtu skill fees anoll?\n                └── Skill fees and all is negligible (max 20k I've heard , depends on college) so around 3L~ for degree and hostel fee varies , rv hostel+mess is around 1L. So expect to pay a fee of 4L~ for RV per year with hostel (with the exam fee and stuff you'll have to pay make sure you have +1L ready)\n                    └── Oh thank you sm.. Im from blr so ig I'll have to spend around 12 L if I go to rv for cse but 4L for PES.. I'm still thinking and thinking lmao\n                        └── 12L an year?bro take pes , rv is not that great either.\n                            └── Nooo I mean 12L total for 4 years. Same way, pes total 4L"
    }
  ]
}