{
  "id": "14wxpzd",
  "title": "Hostel rr campus",
  "content": "Title. I wanted to know about the hostel in rr campus. I've heard and one of my friends attended the briefing session where the hostel director says that students will not be allowed to go outside after 7 30 pm on weekdays and after 9pm on weekends. Also, they can invade the room anytime between 3 30 to 7 30 pm and check for cleanliness and if isn't clean they'll call the local guardian. No trips allowed outside hostel and all that shit. \nIf there's an hostellite here please tell me about the hostel constraints and also please tell me the we can go out in nights in weekends without seeking permission from local guardian.",
  "metadata": {
    "root_comment_id": "jrki2iw",
    "post_id": "14wxpzd",
    "author": "wtfabcd1234",
    "url": "https://www.reddit.com/r/PESU/comments/14wxpzd/hostel_rr_campus/",
    "permalink": "https://reddit.com/r/PESU/comments/14wxpzd/hostel_rr_campus/",
    "score": 3,
    "upvote_ratio": 1,
    "created_utc": 1689096633,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jrki2iw",
      "body": "Avoid campus hostel if you want to have fun ! 3 years ago , we were allowed only until 9pm on weekdays and weekends.\nBetter to stay outside with your friends\n├── But I do not have any friends in pes I'm new\n└── You can have fun in hostel my dude \n\nGet the right set of friends in hostel xD\n    └── True..having fun inside hostel is fine but if you want to go out and have fun , then it’s very troublesome\n        └── True"
    },
    {
      "id": "jrn0zpn",
      "body": "Hey! I’m just finishing my first year in hostel and I can tell you they don’t enforce any of that shit. Weekday and weekend they will let you in until 10. If you wanna stay out more than that also, you can just take parent permission and go, and when u come back, if you have your lgpo diary, u can enter whenever you want. They also never come check the room. In the entire year, the warden came once. That too in the night. So basically you can go out wherever you want till 10 pm but you will need parent or local guardians permission for after 10.\n└── How's your hostel experience? Are you gonna continue in hostel?\n    └── I had a really good experience till now, got the right friend group and I minimise interaction with the hostel staff/ warden. They are rude for no reason and inefficient. And yes I’m continuing in hostel this year also.\n        └── Okay, thanks!"
    }
  ]
}