{
  "id": "14y1sc1",
  "title": "is pes good in terms of building a profile for ms from ivy leagues?",
  "content": "in comparison to other colleges in bangalore",
  "metadata": {
    "root_comment_id": "jrr2el3",
    "post_id": "14y1sc1",
    "author": "caffeinatedcynic234",
    "url": "https://www.reddit.com/r/PESU/comments/14y1sc1/is_pes_good_in_terms_of_building_a_profile_for_ms/",
    "permalink": "https://reddit.com/r/PESU/comments/14y1sc1/is_pes_good_in_terms_of_building_a_profile_for_ms/",
    "score": 8,
    "upvote_ratio": 1,
    "created_utc": 1689198527,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jrr2el3",
      "body": "Same question"
    },
    {
      "id": "jrr8u45",
      "body": "See, getting admitted into MS at Ivy Leagues takes *years of hard work and determination.* So, Coming to ur question, I feel PES  Can be a good choice if you are planning for an MS from any of the Ivy leagues."
    },
    {
      "id": "jrrht9t",
      "body": "TLDR, yes it's possible. I myself know a few who have gone to Ivy's. But whether PES helps in building that profile - honestly it depends on you. It won't be offered on a plate and spoonfed. You'll need to put in effort on your own to build that profile. There are a few opportunities here, but you'll need to make the most on your own.\n├── Hey dude, I'm a freshman at MSRIT. I've seen that you have a very good profile. How do I start preparing for applying to MS degrees? Can you please give me some pointers?\n│   └── Sure, my DMs are open\n├── i’ve heard that its easier to score a high cgpa in vtu as compared to pes. do most top universities only accept 9+ cgpa??\n│   └── No. Abroad, it's not your GPA or GRE score that have the final day. It's a subjective approach taken that looks at your entire profile. An 8 pointer with multiple things on his profile will stand a significantly higher chance than a 9 pointer with nothing\n└── Why “few”????\n    └── Because quite honestly a lot of facilities at PES aren't up to the mark. There are better opportunities to build your profile at RV and the like. It's not all about CGPA. Research and other experience counts a lot\n        └── Can we do job for few years and then go for ms, will that make a good profile provided facilities are not good/limited at PES.\n            └── That's a possibility regardless of your Uni. You still need some form of academic experience to show (since the point of an MS is academic growth)"
    }
  ]
}