{
  "id": "14ydf5e",
  "title": "seniors help please thanks:)",
  "content": "\n\n[View Poll](https://www.reddit.com/poll/14ydf5e)",
  "metadata": {
    "root_comment_id": "jrrynid",
    "post_id": "14ydf5e",
    "author": "Student535",
    "url": "https://www.reddit.com/r/PESU/comments/14ydf5e/seniors_help_please_thanks/",
    "permalink": "https://reddit.com/r/PESU/comments/14ydf5e/seniors_help_please_thanks/",
    "score": 5,
    "upvote_ratio": 1,
    "created_utc": 1689231515,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jrrynid",
      "body": "General rule is CS >>> CS + Spec >>>>> Spec. So strictly looking at it branch wise I would suggest CS, then CS+AIML, then BMS/MSRIT CS+spec. But if you have financial concerns, then pick PES CS+AIML\n├── I don't have financial concerns, however I   have recently heard that students through PESSAT are usually those who've done pretty bad in kcet (as in over 5k rank) and hence settle for this... since I do have an option through KCET I was just wondering whether I was making a mistake.\n│   └── Boss once you go to college who will ask pessat kcet management and all everyone will be in same batch XD. I've talked to smart management kids and absolutely retarded kcet kids so don't be biased like that , otherwise you'll have a hard time making friends.\nPick what's best for you\n├── If OPs goal is just  good placement hardly any of this matter. CS or CS AI/ML its all the same.\n\nJust have good cgpa (>9 to be absolutely safe)coz competition will be intense and master dsa and have few projects on resume. \n\nThats it your placements are sorted.\n│   ├── I would like to do an ms in the us though, would a specialization be unfavorable then?\n│   │   └── Afaik pes claims their aiml degree is CS + AIML not just aiml so you should be better off (in slight cases you might have to explain why you're switching domains from aiml in case some uni demands an explaination)\n│   └── Dude the intake in pes is scaring the living shit out of me should I consider bms or msrit for majoring in cse or aiml for better placements???\n└── but arent both almost identical and all companies allow both?\n\ni dont think cs or cs aiml should be a deciding factor\n    └── Placements wise, you won't get AIML jobs right out of BTech. It's a very domain heavy field, requires a strong grasp of fundamentals, requires you to know in depth concepts (the breakthroughs in AI are because of mathematical breakthroughs, not engineering). Plus, it's a very academic and research oriented field. These jobs are reserved for only MS and higher levels, and a quick Google search will show you that. \n\nSo at the end of the day, you'll end up with an SWE job itself. But the issue isn't with placements tbh. The issue is with higher education, and also with restricting yourself to a field you may not end up liking. What if OP doesn't like AIML? What if they want to pursue something else? If you're in CS, you get to make that choice. You get to pick which field you're interested in. I made that choice, and yes I did choose ML. But I know a lot more people who blindly jumped into AIML and then quickly dropped out because they realised it's calculus and math. If you pickup a specialisation, this choice is taken away from you. \n\n[here's a link to why CS+spec isn't a good option for Masters](https://www.reddit.com/r/PESU/comments/14ydf5e/seniors_help_please_thanks/jrwfebg?utm_source=share&utm_medium=android_app&utm_name=androidcss&utm_term=1&utm_content=2)\n        └── >Placements wise, you won't get AIML jobs\n\ni didnt meant ai ml jobs, i was saying the aiml is just a gimmick and its the same degree in the end\n\nabout the post you linked, yeah thats prolly true i dont know much about unis abroad\n            └── If OP is aiming at placements only, then yep it's not a very bad thing. Yes they will be restricted but it's not going to affect them too much in the future. \n\nIf it's MS (which OP has said), then it's best to always pick core CS. You can naturally explain how you went from a broader field to a narrower one but it's tough to sound convincing when you go from one narrow field to another."
    },
    {
      "id": "jrsexkx",
      "body": "Option 2 or 3, don't waste your money. I would argue with u/rowlet-owl and say that cse spec is not that different from cse core apart from few subjects here and there, these courses are introduced to increase student intake and earn more $(for the college ofc) . Suppose you take cse + aiml it doesn't mean you're going to be stuck with aiml for the rest of your life. It's better to take cse spec in a better college than cse in a worse college imo.\n├── oh ok thanks! so what's better among these- pes rr, bmsce, msrit?\n│   ├── I would like to do ms in the us\n│   │   └── If you'd like to do an MS, then it's still safer to pick CS core because Uni's don't see much sense in specialised branches at undergrad, and secondly it's harder to narrate your story in your statement if you're trying to switch fields. \n\nRegardless, pick PES among your options. Via CET or PESSAT, PES is your best option for CS.\n│   └── Depends on your personal preferences. Pes rr is known for studious people and has better placements, bmsce is supposed to be the chill college and it's easy to get a good gpa, I don't know anything about msrit.\n└── A dentist cannot diagnose a non-dental disease.. even though he is a doctor his specialisation is dentistry.. same for surgeon.. his specialisation is surgery..\n    └── Lmao this is just a btech, and even someone from a non tech background can get into the tech industry. How can you compare this with dentistry/surgery. Dentists have a completely different degree when compared to other doctors.\n        └── Mate I am trying to explain how specialization works..."
    },
    {
      "id": "jrtyusb",
      "body": "As others have said don't waste your money on option 1. \n\nSpecialisation at bachelors level is just bs.\nCS AI/ML or Normal CS its all the same. Its just tactics used by University to increase cs seats.\n\n\nEnd of the CS AI/ML or Normal CS you will have exactly the same no of opportunities in terms of placements. At the end thats the only thing that matters.\n└── cool thanks.\nwhat about an ms in the us? will a specialization be unfavorable then?\n    └── I 'm sorry I have very little idea about it.\n\nBut it shouldn't be a problem I guess coz I have seen relatives pursue cs ms after a btech in EC and EE so it shouldn't be a huge problem but do check around.\n        └── 1. Uni's abroad don't favour specialised branches in undergrad. When Uni's abroad itself rarely have completely specialised degrees (such as MS ML, most have MS CS+AI), then what sense does it make to specialise in undergrad\n2. If OP doesn't end up liking AIML and wants to shift to some other field (say cybersec), then it's not easy to explain that in your personal statement. It comes off as being unsure of what they want to pursue, and that their undergrad was chosen solely based on what was available to them. Uni's abroad pick the people that fit best with their programme - these are people who know exactly what they want to study, what courses they want to take, and which labs they want to work at. It's a lot deeper than picking whatever is available.\n            └── But how come many people switch branches and study MS in foreign universities?.\n\nI know people who studied ECE and took CS. \nHeck I even know a guy who studied ECE and did MS in physics in Sweden  and is having a excellent career.\n                └── I did not say switching is impossible. There are few things to keep in mind. \n\n1. Switching requires you to show that you have relevant experience in the field you're switching to. If you're an ECE grad and don't have any experience in CS, you won't be even worth a shot at top Uni's. You need coursework, projects, work experience, research experience, TA and RAships to count. Being in ECE, and building all these aspects in CS, is not an easy task and I have the utmost respect for people who pull it off. Top Uni's also have very specific course and credit requirements. These requirements are more relaxed at lower ranked Uni's. Top ones have specific courses mentioned, required number of hours to have been completed, and even grades sometimes. It's usually difficult for an ECE grad to have both the course requirements + the profile for a CS background, unless they start building their profile in CS from day 1. \n\n2. Switching between non specialised fields is easier than switching between specialised fields. At a broader level, it's easier to find common ground in both fields. You can always explain that your interest slowly changed from ECE to CS. But if you're diving into a very narrow and pedantic field for undergrad, and then take an UNO reverse and say hey you know what turns out I was actually interested in something else which is another narrow field, it looks like you don't know what you are trying to achieve and are just aimlessly trying.\n\n3. The example you provided is actually *very* common. ECE as a field is related to Physics quite a bit. A lot of people also switch from CS fields to Applied Math, Stats and Analytics fields (I'm actually in the process of this). People also switch the other way round: between Physics and ECE because there is common ground. What I'm trying to say is, there is a natural progression here which is possible. \n\nAgain, I'm not saying it's impossible. It definitely is, I know people who have done it. But you're looking at the minority while making your statement, and you're also abstracting a lot of the effort, time and other aspects that are needed to make this switch. It's not as easy as turning on a light bulb. It goes a lot more."
    },
    {
      "id": "jru7ehs",
      "body": "CS > CS + Specialisation > Specialisation"
    }
  ]
}