{
  "id": "14zaqur",
  "title": "please help me choose",
  "content": "\n\n[View Poll](https://www.reddit.com/poll/14zaqur)",
  "metadata": {
    "root_comment_id": "js15pti",
    "post_id": "14zaqur",
    "author": "Emergency-Addition50",
    "url": "https://www.reddit.com/r/PESU/comments/14zaqur/please_help_me_choose/",
    "permalink": "https://reddit.com/r/PESU/comments/14zaqur/please_help_me_choose/",
    "score": 3,
    "upvote_ratio": 1,
    "created_utc": 1689323761,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "js15pti",
      "body": "If pes is through pessat , no.\nIf not then core cse > cse+spec , pes is strict and the management is a huge L but the college is not that bad , bms has an active social life too , almost 0 in pes.\nIf cse+spec isn't an issue for you take rv tho.\n├── If i choose bms over pes what will i loose\n│   ├── I suggest asking a bms senior what bms offers , from word-of-mouth I've heard bms is more lax and lot of fests , but pes has better placements and an ok syllabus with strict management.\n│   │   └── Which branch are you from pes?\n│   │       └── CSE+AIML\n│   │           └── Can i dm you?\n│   │               └── Sure\n│   │                   └── How are the professors at PES for aiml are they any good(in maths and stuff) does it feel like they are actuall professors?? And what about the placements???\n│   ├── Bro listen, in bms i heard that all the students can't fit in the classes, so theres a shift system, so that's kind of thing to consider\n│   └── So what have you decided?? Even I want to major in cs at PES but I hear that the professors at PES are really dumb so I'm thinking of considering bms or msrit.\n│       └── I've chosen bms as pes is very strict which will not allow me to do other stuff than studying i don't think so the professors are dumb though\n│           └── Are the placements stats similar to that of PES I mean do companies like Walmart etc visit bms??\n│               └── Nope if placements are your concern and you can handle the pressure and have interest in cs then go with pes\n└── So what have you decided?? Even I want to major in cs at PES but I hear that the professors at PES are really dumb so I'm thinking of considering bms or msrit"
    }
  ]
}