{
  "id": "14zml0c",
  "title": "Is taking ai and ml worth it!?",
  "content": "Is taking only ai and ml worth it that too at undergraduate level since it's very new branch and doesn't have that much data for placements and all..also i personally think that taking cse in msrit (for example) is better than taking ai and ml in say bms or other clg above it since in cse they will cover more as compared to focusing or very specific nieche which will be the case in ai and ml.\nYour opinion!?",
  "metadata": {
    "root_comment_id": "jrykjqq",
    "post_id": "14zml0c",
    "author": "False_Bother8783",
    "url": "https://www.reddit.com/r/PESU/comments/14zml0c/is_taking_ai_and_ml_worth_it/",
    "permalink": "https://reddit.com/r/PESU/comments/14zml0c/is_taking_ai_and_ml_worth_it/",
    "score": 3,
    "upvote_ratio": 0.7200000286102295,
    "created_utc": 1689355640,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jrykjqq",
      "body": "Cfbr"
    },
    {
      "id": "jrytdv5",
      "body": "The right person to answer : u/rowlet-owl"
    },
    {
      "id": "jrywele",
      "body": "No. Depends on your choices. Cse+ aiml is what pes offers but that's still not as good as cse core."
    },
    {
      "id": "js10xle",
      "body": "I'd say it depends on what you want to pursue. If placements is all you care about and you don't really care as long you get some sort of a CS degree, then no, it won't make a difference because in all likelihood the CS+AIML kids will be considered to be part of the CS branch. But from a higher education point of view, it does not make sense because specialised branches don't make sense at the undergrad level. Specialisations only take place at the Masters or higher level (and even there, is is uncommon to find something like MS AI, most of it is MS CS+AIML). Universities also don't see the point of a specialised undergrad, and your personal statement also becomes an issue if you try to switch fields. Additionally, as mentioned before, you're talking about an untested branch, no placement records, no data. And if you're referring to AIML at PESU then you should also know that majority of the faculty here barely knows the concepts, teaching is a different question altogether. It's also very restricted, and the choice of a field is made for you, which will backfire if you don't happen to like the coursework, which most people enter to realise that the field is very academic in nature. \n\nTo summarise, I'd suggest you to avoid any form of specialisation. CS > CS+spec > spec always. I went over a lot of this in my previous comments too, if you would like to view them, you can go through my profile\n└── Thanks bro that's what i was also thinking!"
    }
  ]
}