{
  "id": "150cgky",
  "title": "Can anyone tell me what is eligibility for management quoata?",
  "content": "",
  "metadata": {
    "root_comment_id": "js2f0ng",
    "post_id": "150cgky",
    "author": "EconomyAd1574",
    "url": "https://www.reddit.com/r/PESU/comments/150cgky/can_anyone_tell_me_what_is_eligibility_for/",
    "permalink": "https://reddit.com/r/PESU/comments/150cgky/can_anyone_tell_me_what_is_eligibility_for/",
    "score": 4,
    "upvote_ratio": 0.8299999833106995,
    "created_utc": 1689428729,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "js2f0ng",
      "body": "Everything is allready gonna be booked by now tho. You'll have to contact admissions office\n└── Any minimum 12th percentage requirement.\n    └── Hm it also depends on your performance in pessat also apparently ,  but as long as you rich you can do anything to be fair but people say 80%\n        └── I have 69% in 12th 🤡 and 66xx rank in pessat. And comedk rank is 36xxx .  I am looking for EEE branch\n            └── Try for rvce eee maybe? Contact their office ik pepp who joined recently however fees might be steep and probably bms and MSR also cus usually lower branches don't get filled fast under management and many will surrender their seats also.\n\nAlso I think 69% is difficult to get into pes mq💀 cus people say that since they want to keep a good reputation they ask for minimum 80%\n                ├── Rvce and msrit\n                └── Should I join bit or dsce BMSIT EEE THROUGH COMEDK  if u can plz name other good college in blr\n                    ├── Honestly go for colleges like BMS , RV , MSR for eee some other decent colleges \"in my opinion\" jss and nie\n                    └── bmsit is worst college\n                        └── I am talking about BMSCE"
    },
    {
      "id": "js2g3ww",
      "body": "Eligibility? You should be rich."
    },
    {
      "id": "js2jo1r",
      "body": "80% in 12th thats all"
    },
    {
      "id": "js2rua2",
      "body": "I doubt if it is available now \n\nBooking have started since January if I remember"
    },
    {
      "id": "js2sdqc",
      "body": "You should have passed 12th or equivalent standard.   \nAlso, you should be damn rich xD\n└── Any minimum requirement?\n    └── This is all is the \"minimum requirement\" !!\n        └── No 80% criteria"
    },
    {
      "id": "js3gd29",
      "body": "Paisa"
    },
    {
      "id": "js5ry1n",
      "body": "Minimum 80% in 12th I think, I doubt anything good will be left, I heard that RR CSE was sold out in January itself, they started management from last year itself apparently for this year\n└── Want EEE\n    └── I saw you got 3K rank in COMEDK, then why don't you go to RV, BMS or MSRIT for EEE, they're way better than PES when it comes to EEE, PES is good for CSE and ECE to an extent, RV, BMS and MSRIT are much better for EEE\n        └── 36xxx 🥲\n            └── Good enough\n                └── Wbu Bit ?\n                    └── Why are you asking about lower tier colleges when you have top tier colleges like bms and msrit😭\n                        └── Bms and msrit already booked 😔\n                            └── Then idk"
    },
    {
      "id": "js5sorw",
      "body": "80% in pcm or maybe 80% overall not sure\n└── Is BIT good college?\n    └── It's not terrible but not amazing either lol ik an alumni and they hate it so maybe I'm biased, better to ask someone currently studying there."
    },
    {
      "id": "js7haez",
      "body": "I joined through management quota. There are no eligibility requirements other than finishing school.\n└── How does it work could you dm\n    └── Sure"
    }
  ]
}