{
  "id": "150wh6b",
  "title": "mechanical in pes",
  "content": " I am interested in cse/ise only but I won't get that in pes through pessat with my rank of 5732 and through comedk if I wait till 3rd round then I can get cse in rnsit (25k rank). \n\nPes is far better than any colleges I can get through comedk so is it better to take mechanical in pes through pessat and prepare for cse side by side than taking cse in rnsit?",
  "metadata": {
    "root_comment_id": "js5oknk",
    "post_id": "150wh6b",
    "author": "isheepolice69",
    "url": "https://www.reddit.com/r/PESU/comments/150wh6b/mechanical_in_pes/",
    "permalink": "https://reddit.com/r/PESU/comments/150wh6b/mechanical_in_pes/",
    "score": 8,
    "upvote_ratio": 1,
    "created_utc": 1689481586,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "js5oknk",
      "body": "You probably already know that there is no correct answer to this. I can only opine on this. Taking cse in rnsit is better than taking mech and hoping to change course to cse. Usually, many people plan to make this move, so it's going to be tough. If the plan fails, are you ready to continue in mech and complete it?\n\nThe colleges are important only for placements, other than that the differences you find between rns and pes would not impact your skills.\n└── I didn't say that I want to change my branch to cse in pes ik that it's really difficult. Okay then I will just take cse in rnsit\n    └── What do you mean when you say 'prepare for cse side by side'? Do you want to study on your own parallelly?\n        └── Yes I meant I  would  prepare for cse placements on my own\n            └── Yes, it will work during placements if you have already learnt coding. Most of the service based companies allow non-cs students to take part in the placement process. Overall if you have thought of all this and made a decision, well and good. All the best!\n                ├── What about the product based companies which visit pes do they allow non-cs students to take part in the placement process?\n                │   └── Some may allow, but it's rather rare. Product based companies prefer cs profiles (mostly while hiring a fresher). The knowledge gained by studying cs for the whole of four years is at a very different level. I am being honest here.\n\nA startup would give a chance to any good coder/thinker with a good attitude.\n                │       ├── Okay\n                │       │   └── Just clarifying, if you pick mech with the intention of CS placements not only will it hurt your chances at a Masters (if that is your eventual plan), but your placements will also be affected. >90% of companies only allow CS and ECE students to sit for placements. Only a few handful allow other branches to sit.\n\nMake sure you know all the facts before taking a call.\n                │       │       └── Okay thanks for telling that.\n                │       ├── Can you share the syllabus of mechanical engineering, I can't find it on the discord server .\n                │       └── Not some, its rare - probably a handful at most. And even if they do allow, its mostly a formality since they are biased towards CS grads all the time. Even people with a CS Minor struggle\n                │           └── Then I will take cse in comedk college only\n                └── Uhm not completely accurate. Last time I checked they allow at most till EEE students. OP will probably be eligible for at most 10 companies. Choosing mech with the intention of CS placements is a \\*very\\* bad decision"
    },
    {
      "id": "js5zu0e",
      "body": "3rd round if you leave college you'll have to pay hefty fine so don't make rash decisions\n└── ik that"
    },
    {
      "id": "js6ouzp",
      "body": "Mechanical engineering in PES regularly features in QS top 500.\n├── Okay\n└── FYI mechanical engineering at PES is also being shut down. There are plans in motion to convert the branch to mechatronics.\n    └── Will it begin this year?\n        └── Nope, it's a distant plan, but the branch in itself is being shut down. Every year they reduce the seats to make room for more CS seats\n            └── Okay"
    },
    {
      "id": "js6rdvi",
      "body": "From batch 2012, most of my friends who did mech pivoted into it in some or the other form. Go for CS in another (top 10) instead of going to mech in PES\n└──  It doesn't  matter to me though as I want an it job only.I am considering pes mechanical due to its brand value compared to the colleges I can get through comedk.\n    ├── That brand value won't really help too much if you are comparing with other Bangalore colleges for placements. And if you want IT jobs, then choosing mech should be the last thing you do. As I commented earlier - both placements and your higher education plans (if any) will suffer. Besides, why would you sacrifice your passion?\n    └── Brand value my foot. I was being sarcastic up there in the other comment.\n        └── lol oke"
    },
    {
      "id": "jsladi8",
      "body": "are you even interested in mechanical. you can check my comment history for details on the branch, but things may or may not be changing\n└── No I am interested in cse/ise"
    }
  ]
}