{
  "id": "1520u2w",
  "title": "A student just committed suicide in college today. Please reach out to people who can help you.",
  "content": "A 1st year student (not sure which branch) committed suicide today. Most likely the college will try to cover up, if you feel depressed or anything, please reach out to others. We are just 19-21 year olds, this is not the end.",
  "metadata": {
    "root_comment_id": "jsbc7p2",
    "post_id": "1520u2w",
    "author": "mac216to166",
    "url": "https://www.reddit.com/r/PESU/comments/1520u2w/a_student_just_committed_suicide_in_college_today/",
    "permalink": "https://reddit.com/r/PESU/comments/1520u2w/a_student_just_committed_suicide_in_college_today/",
    "score": 152,
    "upvote_ratio": 1,
    "created_utc": 1689597574,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jsbc7p2",
      "body": "RIP 😓 what happened ?"
    },
    {
      "id": "jsbcanj",
      "body": "u/rowlet-owl something that the Discord server can have?\n└── You'll have to talk to Han about it, but the feature already exists in some capacity."
    },
    {
      "id": "jsbf0d4",
      "body": "Can u elaborate?\n└── [here](https://www.deccanherald.com/city/top-bengaluru-stories/btech-student-jumps-to-death-after-being-caught-using-phone-during-exam-in-bengaluru-1237942.html)"
    },
    {
      "id": "jsc4eay",
      "body": "RIP 😞"
    },
    {
      "id": "jsc6r6h",
      "body": "Just saw in news. He was caught using mobile during the exam (afternoon shift)... After counseling and shit, he was booked MPC. And due to that he committed suicide. I don't know how much of this is true. May his soul rest in peace!\n└── He didn't cheat in today's exam , he got caught using his phone during the eee exam , and his parents were summoned today for MPC . To avoid the embarrassment, he jumped off the top floor ."
    },
    {
      "id": "jscwjbn",
      "body": "This fkin college will never change! \n2011 a similar thing happened. Is the pressure in college still crazy and the teachers teaching standards not upto the mark? \nTerrible terrible stuff. \nTo all the students out there. Work hard but don’t let your life be defined by your grades in Engg. I was a second class student and today lead a vertical for a major consulting firm in the UK (10 year career growth path). Was told I was unfit to do any degree by a lot of the teachers at PESIT, but I didn’t let it effect me! \nStay strong my brothers and sisters and reach out for help before you take any drastic steps.\n└── Chill bro\n\nThat guy was using his phone to copy and they caught him\n\nTo avoid punishment he jumped off a building"
    },
    {
      "id": "jset183",
      "body": "He was my first friend in college.. I am heartbroken.. I can't figure out why he had to take such a step. He was excellent in academics, overall a very calm person. RIP my friend"
    },
    {
      "id": "jsfb318",
      "body": "RIP. What campus this was of ?\n├── RR\n└── PES College, Girinagar, Bengaluru"
    },
    {
      "id": "jsfmtf4",
      "body": "RIP . It's really sad to see such news . That too being in the first year of college"
    },
    {
      "id": "jshg4ky",
      "body": "If a student is caught cheating in the exam, the college authorities must only send him/her out and not allow the student to write further. What was the need to bring in parents or others and insult the student.? What could they have done anyways?\n\nShitty college man. Glad I'm out."
    },
    {
      "id": "jshotiu",
      "body": " A similiar incident happened to me last year,I was threatened by the college that I'll be failed in all the subjects,not eligible for placements/lor,although I had a 8.6 gpa in cs till 5th sem, ultimately they failed me in that particular subject.I am pretty sure they would have threatened the student with all these things(even i was suicidal at that time) ,they threaten a lot and I feel we should stand up against them for all these threatenings\nP.S: I got placed at 22 lpa (18 base)at a gaming 🦄 (can't reveal the name) but i was very suicidal in that period and i know how that student would have felt when he had been shamed for cheating by this shitty college which led to his suicide \nI heard his father registered an fir against the college,I hope he reads my text or someone conveys that it wasn't his sons fault rather the colleges shaming students\nIf any of u have his father's contact please comment so that I can contact him and help him in this case\n├── Thank you so much. I am his mother.  Aditya just forgot his phone in his pockets. He remembered it halfway thru the exam and himself took it and kept it away from him either on the bench or the floor(I can't remember his words).  And the phone was in airplane mode throughout . This Aditya told me in his last phone call. The invigilator saw it when only 10mins were remaining for the end of exam. This was told by others in the exam hall.  His honesty led to all this. Perhaps if he hadn't kept it out , this wouldn't have happened.  \nAditya also told that they r harrassing him, they told him it's better to die than do such things. By the time I reached there, he had jumped. \nThey left him alone after detaining for MPC.  No one was with him. The counselor just walked away. Such negligence of the college.\nThey had found his  body half an earlier itself before I starting demanding to find him. The police, ambulance were already there. They were telling  the police that he isn't their student and to take the body away.  Some random person has entered their campus and jumped. They were trying to hush it up. And when I reached they told me I need to sign something ( mostly something that keeps them out of this) , only after that they will take him to hospital and try for  revival. \n\nCollege is only bothered of their reputation.  Life of a student doesn't matter to them at all.\n\nThank you for sharing ur experience and grateful to God that you were strong at that moment. \n\nMy number is 9986871691. We will fight  this. FIR has been lodged.  Ur support will give ur more arsenal.  Pls contact me . Thank you so much\n├── Thank you so much. I am his mother.  Aditya just forgot his phone in his pockets. He remembered it halfway thru the exam and himself took it and kept it away from him either on the bench or the floor(I can't remember his words).  And the phone was in airplane mode throughout . This Aditya told me in his last phone call. The invigilator saw it when only 10mins were remaining for the end of exam. This was told by others in the exam hall.  His honesty led to all this. Perhaps if he hadn't kept it out , this wouldn't have happened.  \nAditya also told that they r harrassing him, they told him it's better to die than do such things. By the time I reached there, he had jumped. \nThey left him alone after detaining for MPC.  No one was with him. The counselor just walked away. Such negligence of the college.\nThey had found his  body half an earlier itself before I starting demanding to find him. The police, ambulance were already there. They were telling  the police that he isn't their student and to take the body away.  They were trying to hush it up. And when I reached they told me I need to sign something ( mostly something that keeps them out of this) , only after that they will take him to hospital and try for  revival.\nThank you for sharing your experience and grateful to God that you were strong at that moment. \nThe college doesn't care for the life of a student. They only care about is reputation.\nWe have filed FIR against the college. Any help from your side or anyone else  will give us ammunition. My number is 9986871691. We are talking to TV channels too.\n│   └── u/St_Broseph can you help?\n├── \nAditya & family should get justice.. Kid will be out there alone under pressure & will be torched as usual by School authorities as always.. he would be threatened to ruin his future.. it’s always been like this. Kid bringing phone by mistake in hall & using it are two different things. End of the night .. what were school authorities doing till parents arrived. Kid was still in there premises. Now school will destroy all evidenced that parents or any one can get there hands on to clear there name & continue there cruel business as usual. Life of anyone’s child does not matter to this abusive authorities. There should be protest against this. Why the kid was not escorted to hospital & was left in premises to die. So many suicide cases are happening because of schools & facilities carelessness .. why this is tolerated & accepted like nothing ever happed & life goes on .. one after another child’s life is taken away each year by this system. Speak Up & Protest .. it could be your child next. Have never heard in 50 years that any high society or powerful persons child have ever committed suicide  because they are given separate rooms to sit & cheat as this facilities run by favoritism & donations. \n\nCommon Community need’s support of parents, children’s, lawyers, news writers & Ethical teachers & facilities have to protest against & protect our kids. \n\nGrow up.. Wake-up.. if u have seen something then say it .. & Gather the strength to help parents. They need help 🙏🏼\n└── https://youtu.be/FdQ8lAx75YE"
    },
    {
      "id": "jsjnges",
      "body": "Sold Media : https://www.deccanherald.com/city/top-bengaluru-stories/btech-student-jumps-to-death-after-being-caught-using-phone-during-exam-in-bengaluru-1237942.html\n└── the worst part is that they say **13** floors but from what I'm hearing it was 7 floors + terrace. The way DH has twisted this is insane."
    },
    {
      "id": "jsjp5mc",
      "body": ". I am his mother.  Aditya just forgot his phone in his pockets. He remembered it halfway thru the exam and himself took it and kept it away from him either on the bench or the floor(I can't remember his words).  And the phone was in airplane mode throughout . This Aditya told me in his last phone call. The invigilator saw it when only 10mins were remaining for the end of exam. This was told by others in the exam hall.  His honesty led to all this. Perhaps if he hadn't kept it out , this wouldn't have happened.  \nAditya also told that they r harrassing him, they told him it's better to die than do such things. By the time I reached there, he had jumped. \nThey left him alone after detaining for MPC.  No one was with him. The counselor just walked away. Such negligence of the college.\nThey had found his  body half an earlier itself before I starting demanding to find him. The police, ambulance were already there. They were telling  the police that he isn't their student and to take the body away.  Some random person entered the building and jumped is what they told. They just wanted the body out of their campus. They were trying to hush it up. And when I reached they told me I need to sign something ( mostly something that keeps them out of this) , only after that they will take him to hospital and try for  revival.\n\nThe college doesn't care for the life of a student. They only care about is reputation.\nWe have filed FIR against the college. Any help or information regarding the incident  will help us.\n├── This is true, PES teachers truly harass a lot!\n├── It's clearly a parenting error. Should've raised him better. Who even ends their life for getting caught in an exam. I've taken my phone once by mistake too. When I remembered, I called and told the invigilator I have it by mistake. He just told me to keep it in my bag. Also your child is a nobody, no faculty is interested in harassing a student. I'm sorry but you have to accept your child was weak and you shouldn't be blaming the university.\n│   ├── You can't blame the parents on this\nBeing registered for MPC puts a black mark on your profile when it comes to placements and scholarships\nHis parents raised him to be a better person\nAnd you never know how he was feeling at the moment\nbeing an honest person and being accused of something like this does scare a person\nHe probably had a weak moment\nThe management is to blame in this, they are very careless and harsh. Quick to come to conclusions without hearing the full story, merciless is the word.\nThe parents would have anyday preferred having a son with a malpractice case to a son who is dead and the parents have absolutely no part to take blame\n│   ├── get a fucking grip over yourself my dude\n│   ├── Bro just shut the fuck up. Don't even bother to come out of whichever hole you're hiding yourself in. Nakkan college nalli sigu.\n│   ├── how old are you man? is a human life just a number and a game of strength for garbage people like you? . i know at this point you're not fixable but please dont spread around your garbage around , do us and yourself a favor and stop talking. fucking retarded people would type all they want in their keyboards about life being \"weak\". touch some grass please\n│   ├── Come to pes and experience yourself before even you write those words. You think professors will believe your shit and ask you to keep it in your bag?! They'll take it away and won't give it to you until you and ur parents beg them to give it back. Show some sympathy you motherfucker.\n│   ├── Weak? Man you must be dumb to think that ending your life is a decision a weak person makes. It is vulnerable situation, yes. But to dismiss him as a weak person is so fucking tone deaf. Have some fucking empathy man, damn. You're addressing this god awful message to a person that claims to be the victim's mother.\n│   ├── The person who can write such shit to a grieving parent is a \"parenting error\", period. \nSorry , but please go home today and ask your parents where they went wrong and why they did not teach you basic human decency. Once done, go take a walk.\n│   ├── I don't know if u r from this college or what, and if u were what kind of a delusion u r living in... Such an incident has happened last year too, a friend of mine was given a backlog in the subject along with mpc case filed. Before blaming the parent of an innocent kid do think once.\n│   ├── I think you are the reason behind his death 😳\n│   └── This is probably a management account but yeah if you're a management account, I hope all of you motherfuckers get lined up and shot. You literally sell the college for something it isn't. If mediocrity had a fucking mascot it would be PES. I honestly would've regretted the entire experience if it weren't for the people. I hope all of you face the consequences for this absolutely disgusting immoral act.\nI thought initially that maybe the guy was soft. But talking to other students and the account of his OWN MOTHER, I realized that it's you fuckers who have to be thrown off the building.\n\nI'm so sorry for your loss Ma'am. I sincerely hope it gets better for you.\n├── My condolences to you. I cannot even begin to imagine your pain ma'am. For 19 years you had raised him with all of your love and adoration. Sent him to a reputable institute with all your dreams of sending him for his first job, seeing him get married and much more.\n\nI really wish you all the strength that God can give you. I hope that you know that even in heaven Aditya loves you and will always will. If you ever need anything from us students ever, you can reach out to us anytime. \n\nWe will try our best to be of any help.\n\nRest in peace Adithya 🙏. Om Shanti\n├── u/St_broseph please get their family the justice they deserve.\n├── 8892542350 please do call this number. He’ll be able to help you. NSUI National Coordinator\n├── Aditya Prabhu was a perfectionist , he was one of the brightest students of us all . To have known him for almost 3 years , he wasn’t someone who’d give up . he was organized focused and level headed . we strongly believe that the management has been careless about how they’ve approached the whole situation . Mentally abusing a student , telling him that his life isn’t worth living and leaving him unattended cannot be accepted . So much could’ve changed if the counselor was responsible enough to guide  him . In a generation where everyone is trying to pay attention to one’s mental health , how could the management of a prestigious college be so irresponsible? we strongly believe that the right guidance could’ve saved his life . He deserved better and his family deserves better .\n#justiceforadityaprabhu\n└── According to me, the idea was to not get caught until he got caught. \n\n\nIt happened to me too, I told them within the first 10 minutes that I had mistakenly carried the phone and everyone was chill.... I am a 2023 graduate btw. \n\nTeachers kind of know about students they teach. They have a very good idea about who all can, and who all cannot cheat in exams. Teachers are not dumbazz-es. I wasn't harassed even once in my career. Probably teachers just do that to tough peeps. \n\nIt's parents' fault. They should teach their kids that the other name of life is problems. If you can't face problems, then you have no reason to live. \nEg- Tomorrow, if you don't get a job for say 6 months, should you die?? No, right!! You have to keep fighting with life's problems. \n\nIk, I am gonna get a lot of down votes here."
    },
    {
      "id": "jsjs9m7",
      "body": "I'm a friend of the student. When I joined my new school in 6th grade, I'd found a friend I was sure would be my brother for a long time.\n\nI know him longer than the college, longer than everyone discussing the case for the sake of gossip and long enough to know for a fact that he would not be dishonest. \n\nHe is one of the smartest and most honest person I have met in my life. Not only that, he is a very strong boy too. Which is why the action he took surprises me. \n\nWe as school students always copied from the guy next to us but in the 8 years I've known him, he has never relied on such practices. I'm not even exaggerating. \n\nThere is something the college is hiding. Something the counselor is hiding. Something wrong in the way the college deals with such cases. Because I for one know how honest and strong he is. \n\nI personally know many students who have been threatened by this college and I am not surprised to see that the college suggested that 'its better to die than to do this'.\n\nThey can't get away with this all the time."
    },
    {
      "id": "jsjsocu",
      "body": "I'm a friend of the student. When I joined my new school in 6th grade, I'd found a friend I was sure would be my brother for a long time.\n\nI know him longer than the college, longer than everyone discussing the case for the sake of gossip and long enough to know for a fact that he would not be dishonest. \n\nHe is one of the smartest and most honest person I have met in my life. Not only that, he is a very strong boy too. Which is why the action he took surprises me. \n\nWe as school students always copied from the guy next to us but in the 8 years I've known him, he has never relied on such practices. I'm not even exaggerating. \n\nThere is something the college is hiding. Something the counselor is hiding. Something wrong in the way the college deals with such cases. Because I for one know how honest and strong he is. \n\nI personally know many students who have been threatened by this college and I am not surprised to see that the college suggested that 'its better to die than to do this'.\n\nThey can't get away with this all the time.\n└── Even my classmate was harassed and abused in the same way in front of the whole class. He was crying and wanted to end his life, but we were there to support him 🙏"
    },
    {
      "id": "jsjv90p",
      "body": "RIP😞 May his soul rest in peace ..."
    },
    {
      "id": "jsjvt5y",
      "body": "If someone raises their voice against the teachers/staff, either they get bullied or they will lose their internal marks! That's why everyone is scared\n└── I can attest to it as during a course i had to show a project for my final grades and when i showed the project the prof didnt like me because apparently i corrected her in class too many times.. and so she cut my marks for the finals which really brought down my GPA. PES is jus a shit place man\n    └── Exactly the same things have happened to me, one teacher just hated me ... So she cut my internal marks, and due to that I lost MRD by such 0.5GPA .... She used to insult me everywhere and every time because she couldn't scold a management girl, so she used to take all her anger on me."
    },
    {
      "id": "jsk5bo4",
      "body": "Regarding this news I am his friend who has been studying with him since 5 th standard . I know him well and have spent a lot of time with him . He was one of the brightest and best students in my school . It’s hard to believe that the college has pushed him to such extent . He was a brilliant and organised fellow in all matters and was excellent in academics too . But booking him in such acts without proper inspections , accusing him and harassing . Worst acts by the college and management . I stand for him till the end and fight for him he is one of the best to ever be around . JusticeforAdithya"
    },
    {
      "id": "jsk9jzt",
      "body": "I have known the deceased student for the past six years. A very level-headed person and an honest friend who almost always sported a smile. Being, academically inclined, he topped in most exams. Having sat right beside him at school examinations due to alphabetically being next in order, I can confidently ascertain he was never the one to copy/cheat or involve in malpractices.\n\nHaving read his mother's comment to the post, I seriously hope Girinagar Police conduct a deep investigation into the matter. The behaviour of the college administration to hide his whereabouts to the family and the malicious attempt to cover-up is scandalous at its best.\n#justiceforaditya"
    },
    {
      "id": "jskpw5e",
      "body": "I have known Aditya from my high school days, he was always studious and scored well in all exams. Knowing him I can confidently say he never attempted to cheat in any of the exams.\n\nThe negligence/harassment and later the attempt to hide the news from his parents by the college is really worrying to hear.I hope police conduct a proper investigation."
    },
    {
      "id": "jslfivg",
      "body": "It truly is shameful of the college to attempt to hide such a case and make the mother sign an agreement to see her own son.\n\nThey accused me also for malpractice and did not budge even when all the invigilators and the vigilance squad person herself said I was innocent.\nThey didn't even allow me to support myself and demanded I end the test immediately and walk out of the hall with them for the further protocol.\nThe exam committee and management is so petty and shallow that all they care about is saving their reputation and face.\n\nThey have installed CCTV cameras in all the in assesment centre rooms and when demanded to check the footage for proof, they claimed the cameras were not functional.\n\nThis happened to one of my friends too and they were merciless with her despite her crying and begging.\n\nThe management really needs to get their shit together before another tragedy like this happens."
    },
    {
      "id": "jslncjv",
      "body": "You should have slapped the person who told you to sign something and spat of their faces. Bloody fellows."
    },
    {
      "id": "jsm1xf1",
      "body": "This is so disheartening :( he is a bright intelligent boy and painting such a wrong picture of his and calling him out for malpractice in the media is the worst this institution could do to him. I hope the college comes around and atleast takes action to ensure this doesn't happen to any other student in future. Praying for a lot of strength to the parents to deal with this and really hoping for JusticeforAditya!\nAlso, 18-20 is a very critical age and I truly hope all of us can try our best and seek help if necessary in dealing with our emotions."
    },
    {
      "id": "jsock5i",
      "body": "The truth is finally out :\n\nhttps://www.edexlive.com/news/2023/jul/19/bengaluru-student-suicide-invigilator-college-management-accused-of-abetment-36489.html"
    },
    {
      "id": "jsp4bgy",
      "body": "Its disgusting to see how our college is trying to cover up this. All they care about is our money and money alone. I really feel bad for his parents..they dont deserve this. I truly hope the college management gets held accountable for this."
    }
  ]
}