{
  "id": "152dklg",
  "title": "What is the procedure to be a teaching assistant? in ECE department",
  "content": "",
  "metadata": {
    "root_comment_id": "jsen4jv",
    "post_id": "152dklg",
    "author": "AdeptnessExtension91",
    "url": "https://www.reddit.com/r/PESU/comments/152dklg/what_is_the_procedure_to_be_a_teaching_assistant/",
    "permalink": "https://reddit.com/r/PESU/comments/152dklg/what_is_the_procedure_to_be_a_teaching_assistant/",
    "score": 10,
    "upvote_ratio": 1,
    "created_utc": 1689626953,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jsen4jv",
      "body": "I can answer for CS, but I think the process will be nearly the same for all branches. \n\n1. Firstly, you can only be TA for a course that you've taken up in the past. You obviously can't TA for a course you are currently taking up or you will take up in a later semester. \n2. You can reach out to the faculty you want to work with for the course, tell them why you want to be the TA, what you learned from the course etc etc. It's more like a personal statement about how you can contribute as TA and why you should be given that role. The teacher you reach out to might also ask for other details like your CGPA, the project you did in that course and so on. \n3. Alternatively, the CS department in the past has also sent out a Google Form to the entire batch to collect the same info as above from interested students. As far as I know they send it out only at the beginning of your 7th semester. IMO it's better and honestly far more effective to directly approach the teacher you want to work with. \n4. Based on the details you give the prof (or the responses from the Google form), they'll evaluate their options and reach out to the students they think are suitable. \n\nGood luck!\n└── Can confirm it's almost same  except that,  \nNo Google forms as such are sent out, students are supposed to approach teachers in case they want to be TAs and usually its the higher semesters who get the preference.\n\nOfcourse, TAs jobs will depend on the teacher"
    },
    {
      "id": "jsobyiq",
      "body": "I was a TA under Rajasekhar sir. It's very straightforward in the ECE department, you've gotta just go and approach the professor and if you have decent grades in the subject and if you can speak well, they will most likely pick you cause not too many people apply for a TA position in our department. And yeah, TA looks really good on the resume so go ahead and do it. And yeah approach them early\n└── Thank you!"
    }
  ]
}