{
  "id": "154g30e",
  "title": "do pes teachers cut marks just because they dont like you?",
  "content": "i've seen some seniors here say that teachers cut marks just because they dont like you. does it happen to quite a number of students? (pes is my backup in case i dont get msc at bits but this has made me skeptical about joining)",
  "metadata": {
    "root_comment_id": "jsoqbbx",
    "post_id": "154g30e",
    "author": "Weak-Willow8230",
    "url": "https://www.reddit.com/r/PESU/comments/154g30e/do_pes_teachers_cut_marks_just_because_they_dont/",
    "permalink": "https://reddit.com/r/PESU/comments/154g30e/do_pes_teachers_cut_marks_just_because_they_dont/",
    "score": 4,
    "upvote_ratio": 0.699999988079071,
    "created_utc": 1689825003,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jsoqbbx",
      "body": "PES faculty might be a lot of things, but I have personally never faced any kind of sadistic behaviour, and I've only *extremely* rarely heard about incidents where profs deduct marks without reason. \n\nMost of the profs I've encountered might not be the greatest or most qualified, but you don't usually hear about such situations happening because just like us, most profs also dislike the pressure and workload the management dumps on them. I've even worked with a few profs personally at research labs, internships, projects as well as being a Teaching Assistant and can vouch that there are few really nice ones. \n\nI understand that people are on the edge right now with the recent events and that people are jumping the gun to put out a blanket statement labelling *all* profs are heartless and sadistic, but that is definitely not the case. As with everywhere else in the world, there are a few bad apples.\n└── oh ok got it thank u! also i've heard this everywhere but what does it exactly mean by saying that the management is bad ??\n    └── For this, just scroll through the rants on this subreddit. Its a repeated topic\n        └── check this post out:https://www.reddit.com/r/bangalore/comments/154qmcy/very\\_serious\\_matter\\_posting\\_here\\_for\\_maximum\\_reach/\n            └── That's the incident I was referring to in the last paragraph. But as I said, there are a few bad apples. Can't throw everyone into the same basket."
    },
    {
      "id": "jsovvxy",
      "body": "This has happened a few times for me in the case of assignment marks where the teacher had shown partiality towards me because I had a few arguments with the teacher . Be on good terms with the faculty and don't mess around with them.\n└── Which course? Cse?\n    └── Yes , but afaik one of two of the professors left college ."
    },
    {
      "id": "jsp34ez",
      "body": "Pes doesn't do this shit\nBut big companies like apple, natwest,adobe,Tesco hire dumb girls who don't even know how to git just on the basis of gender in placements\n└── How is this even relevant to the discussion? And if you consider yourself to be a hotshot at git and other things, why not try getting into the same companies off campus. They might have diversity hiring policies, but they never stopped you from giving their test as well. Don't be salty just because you didn't clear it.\n    ├── Forgot to mention they don't know basics of sorting searching algorithms \nThere interviews very mostly based on conversation around hobbies and no. Tech skills\nPlease don't be a snowflake \nAnd yeah yesterday akamai shortlisted 8 girls and only 2 boys for the interview and i didn't get shortlisted even though I solved all correctly and have a 9.2 gpa in cs\nYeah it's not relevant but this is the only unfair thing i felt in pes ( as there is lesser diversity hiring in bits/top iits) apart from careless management\n    │   └── Life is unfair dude, get used to it. This happens in colleges across the country, PES is not alone. Stop making excuses when it is literally the same everywhere. You will find companies have diversity hiring drives more often as well. This is happens in all companies to empower and encourage more diversity. Just because you are entitled and in a generation where both men and women are slowly trying to have equal rights, does not mean you forget that the roles you are applying for used to be previously dominated by our gender alone.\n    │       └── Not making excuses but the guy who posted is expecting to get into bits so I was suggesting him in a way to take bits bcz there is lesser diversity hiring in top 7 iits ,bits,iiith\nSome Companies.literally come to pes only for hiring girls just bcz they couldn't  get girls from top iits /bits like apple,natwest,adobe\nPeace out!\nAlso if u want equality ,educate and train the girls with skills but don't give reservations like jee for sc/st\n    └── Also there is no off campus hiring for sde-1 in apple,natwest or similar companies\nThey only do on campus hiring\nJust bcz there is no diversity hiring in cisco doesn't means other companies don't do\nAtleast think before typing bs with ur dumb brain\n        └── Cisco does have :)\n\nAnd after being here for a year, I have witnessed the various events/activities/etc conducted by Cisco to encourage and empower women. Stop being a misogynist. Your comment reeks of ignorance and hatred. Please get some help, understand and change your views. You might be academically smart, but that means nothing if these are your true colours."
    },
    {
      "id": "jsp50lh",
      "body": "Their correction is very inconsistent, but there is no proof of favouritism."
    }
  ]
}