{
  "id": "1588lxu",
  "title": "How are the faculty in RR campus?",
  "content": "Ik it's kinda dum asking this question after completing admissions. \n\nBut people are scaring the crap out of me saying some professors are scary , strict and some bully students.",
  "metadata": {
    "root_comment_id": "jt8u926",
    "post_id": "1588lxu",
    "author": "Escape-Potential-2",
    "url": "https://www.reddit.com/r/PESU/comments/1588lxu/how_are_the_faculty_in_rr_campus/",
    "permalink": "https://reddit.com/r/PESU/comments/1588lxu/how_are_the_faculty_in_rr_campus/",
    "score": 8,
    "upvote_ratio": 0.9100000262260437,
    "created_utc": 1690199892,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jt8u926",
      "body": "(im using a throwaway account to avoid consequences)\nbe prepared to go through literal hell;in pes rr campus you dont have the ideal engineering life(which isn't great to begin with).Keeping aside all the academic pressures put on a student, the faculty will take your bt.From talking in class to pda nothing flies here. You're literally gonna enter a military style college, get ready.With the current controversy I think the faculty is preparing to begin 10x as stringent. All the best man, may our paths cross at pes\n├── Do you have any idea about ec campus?\n│   └── they're not as strict but they're also not as qualified\n├── me casually reading manga in class\n└── Bro plz help me decide whether I should take cs(aiml) at PES or it's better to go to bms or msrit???"
    },
    {
      "id": "jt910ig",
      "body": "I've posted about this before, you can check my comment history. But to summarise it: mediocre at best. Most aren't qualified, some are qualified but cannot teach, and in this chaos, you will find a handful that is genuinely interested in teaching you and can do so.\n└── Any ideas about the other campus\n    └── I am referring to both campuses. You can check the FAQs post on this subreddit for a comparison between the campuses"
    }
  ]
}