{
  "id": "15a2qbn",
  "title": "Pes cse rr vs rvce eee vs bmsce/msrit cse(spec)",
  "content": "I'm getting pes cse core through pessat and rvce eee(ece if I'm lucky) or bmsce/msrit cse with specialization thru kcet (rank 12XX). Which one would be a better option? (Fees is not a problem). I am not sure rn but could go for ms abroad. I have also heard that it isn't easy to get good cgpa in pes as the grading is tough..is that true?? If I join pes will I get no free time at all ? Pls help me decide.",
  "metadata": {
    "root_comment_id": "jtibfas",
    "post_id": "15a2qbn",
    "author": "Lem_on_00",
    "url": "https://www.reddit.com/r/PESU/comments/15a2qbn/pes_cse_rr_vs_rvce_eee_vs_bmscemsrit_csespec/",
    "permalink": "https://reddit.com/r/PESU/comments/15a2qbn/pes_cse_rr_vs_rvce_eee_vs_bmscemsrit_csespec/",
    "score": 5,
    "upvote_ratio": 1,
    "created_utc": 1690369669,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jtibfas",
      "body": "You will get pes rr aiml as well. Imo take this or cse spec in bmsce/msrit. \n\nI have contacts in both pes and bmsce(not just profs, people in the management), according to them these specialization branches, they're just for increasing seats but there's some rule limiting the number of seats per branch so this is a way to bypass that. Only 2 or 3 subjects will differ between these and regular cse core, that too in later sems. If placements are your main concern take cse spec in any of those colleges through cet(your rank is good) over pessat seat. 4.1 lpa vs 91kpa. Totally for 4 yrs it's more than 10 lakhs you're saving in fees. You can go through cet and buy yourself a nice laptop, bike, iPhone whatever guilt free.\n├── I'm in the exact same situation, but I've heard that for ms cs in the us it's best if your undergrad is in core cs\n│   ├── It's your work and project relevance that matters more I feel. When some people who did ece here cam go for an MS cs in us why not cse spec?\n│   │   └── Not completely accurate: your branch plays a very important role. People in ECE can go for MSCS only if they clear the credit hours requirements posted by Uni's. Some even have strict grade requirements as well. Going from ECE to CS is definitely harder if you do not have relevant coursework to support your application. \n\nAs for CS+spec, specialisations mean fuckall at undergrad, that is why they prefer core CS degrees. I've written about this in detail in previous comments.\n│   │       └── Is there any example of people with cs+spec not getting what they wanted because of their degree?\n│   │           └── It's not a question of whether they can or cannot - even people in EEE have shifted to CS. It's about how logically you can present your statement about shifting into a specialised field of study. If you're already from a specialised field and are trying to shift into another specialised field, it either means you had no initial interest in your original field or you don't know what you are trying to achieve. Universities abroad always look for people that fit their programme best and know what they're interested in, right from the undergrad level. They know that specs in undergrad don't make too much sense as well. It's definitely possible, but someone with a clearer idea on what they want to pursue and the steps they've taken to prepare for it will have a stronger statement to offer.\n│   └── Hey so what have you decided?\n│       └── most likely pesu cse rr through pessat only... wbu?\ncause it's anyway > bms, msrit\nand I can't get rvce anyway:/\n└── Hi can you tell me what should I prefer between bmsce and msrit?"
    },
    {
      "id": "jtimk5t",
      "body": "bro im in literally the same situation as you! what are you planning on picking? I want to do ms cs in the us too, so was thinking of taking pes cs core, but I'm still so confused !!\n└── i'm thinking of pes cse core too but i was just confused if taking rvce eee would be better coz of better college reputation\n    ├── yeah sure!\nyeah I was thinking the same but I saw that last year's 3rd round eee cutoff at rvce was 8k😶\n    │   └── Yeah and eee was14k through comedk 3rd round\n    └── If you are interested in CS, pick CS. If you are interested in EEE, pick RV. College reputation for MS is irrelevant unless you are from IIT/NIT/BITS\n        └── and if im getting msc at bits? should i prefer that over pes cse?( there's a 25% chance of msc dualites to get cse based on first yr cgpa)\n            └── And if you don't get CS? If worst case scenario.comes to be and you're okay with studying something you're not interested in, then go for it. Make an informed decision now based on my comments on this thread"
    }
  ]
}