{
  "id": "15are91",
  "title": "biotech- is it worth ?",
  "content": "i am considering btech in biotech , almost all the feedback i have received are negative. but my interest lies here, should i continue with my choice or should i change it ?",
  "metadata": {
    "root_comment_id": "jtmdqjc",
    "post_id": "15are91",
    "author": "Angry_bullfrog381",
    "url": "https://www.reddit.com/r/PESU/comments/15are91/biotech_is_it_worth/",
    "permalink": "https://reddit.com/r/PESU/comments/15are91/biotech_is_it_worth/",
    "score": 3,
    "upvote_ratio": 1,
    "created_utc": 1690430865,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jtmdqjc",
      "body": "Afaik, most branches other than CS are really bad at PES. So if you really want biotech I think it'd be best to go somewhere else"
    },
    {
      "id": "jtrmt3e",
      "body": "If your goal is to get a job through placements, biotech is the worst choice. For this year, only 6 biotech students got placed. 5 in T3 jobs and 1 in T2 job. There were 0 tier 1 offers. If yoi have a passion for biotechnology, I'm sure there are better colleges like Manipal. But if you just wanna do your degree and go for higher studies you can consider it\n└── ooh its really that bad\n    └── Yeah only join pes biotech if you have no other choice at all. I'd suggest you stay away from biotech if you want to have a good chance of getting placed in any clg. If you badly want to do biotech, pes is definitely NOT the clg to join"
    },
    {
      "id": "jvv8vnt",
      "body": "my brother took biotech here. There is literally no scope unless you opt for further studies. My brother decided to go the US for higher studies and is leaving tomorrow he's also changing his course too. I'd say if keep PES lower down on your preference list. The subject itself isn't that good in india unless you're ok with going with higher studies later with all the costs or changing course later\n└── can i know which course he has opted ?\n    └── Data science"
    }
  ]
}