{
  "id": "15e640t",
  "title": "Things to buy before joining college",
  "content": "Guys I'll be joining PESU RR Campus either in CSE or CSE (AI&ML) Branch this year. I'll be staying in hostel. Can you guys please help and let me know what all are the essential items I need to buy or bring before joining college? Thankyou.  ",
  "metadata": {
    "root_comment_id": "ju62ubs",
    "post_id": "15e640t",
    "author": "Rishikesh-Kumar2004",
    "url": "https://www.reddit.com/r/PESU/comments/15e640t/things_to_buy_before_joining_college/",
    "permalink": "https://reddit.com/r/PESU/comments/15e640t/things_to_buy_before_joining_college/",
    "score": 5,
    "upvote_ratio": 0.8600000143051147,
    "created_utc": 1690778012,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "ju62ubs",
      "body": "1. Mattress (suggest ordering from sleepyhead it's good for its price) \n2. Basic toiletries (bucket, mug,etc)\n3. Electric Kettle\n4. Cable extension board \n5. Don't waste your money on buying textbooks , slides and softcopy of textbooks will be provided and you can always borrow from the library.\n\n\nYou can visit Dmart nearby once you'll get most of the stuff you need at discounted prices .\n├── What about notebooks and all? Around how many should I buy?\n│   └── u buy notebooks after u start college, then u will have an idea on how many to buy and which kind to buy, suggested- long ruled notebook is the best\n├── Is Electric Kettle required? Do most people use it? And what do they use it mainly for?\n│   ├── Maggi\n│   └── I mainly used it for making coffee and maggi.\n│       └── Is it allowed?\n│           └── It's \"technically\" not allowed but most of the people still use it and during your initial days just hide it or don't use it when some official from hostel comes to check. Once the things settle down after like 1 month, and the hostel people are not uptight anymore, ig it won't be a problem to use it. But yeah kettle is useful for boiling water, coffee or maggie. Gotta satisfy those late night cravings.\n└── How much did you pay for hostel+mess for an entire year??\n    └── The prices keep increasing every year . Afaik it should be around 1.6L (including 30k deposit) this year .\nThis includes hostel , mess , laundry etc."
    },
    {
      "id": "ju6bogq",
      "body": "Don't buy anything, just go there and figure out yourself what is necessary and what is not, either by asking seniors or friends or by self realisation"
    }
  ]
}