{
  "id": "15h89as",
  "title": "Which of these companies hire engineers from pes university cse branch through on campus placement?",
  "content": "Meta\n\nApple\n\nMicrosoft\n\nAmazon\n\nNetflix\n\nGoogle",
  "metadata": {
    "root_comment_id": "junbe69",
    "post_id": "15h89as",
    "author": "iopjhugyvju",
    "url": "https://www.reddit.com/r/PESU/comments/15h89as/which_of_these_companies_hire_engineers_from_pes/",
    "permalink": "https://reddit.com/r/PESU/comments/15h89as/which_of_these_companies_hire_engineers_from_pes/",
    "score": 13,
    "upvote_ratio": 1,
    "created_utc": 1691078601,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "junbe69",
      "body": "Apple has been hiring for the last few years, but I think they only select  women from pes\n└── They took 1 dude from my batch if I remember, rest women\n    └── Sounds about right. If you look up Apple employees on LinkedIn who are PESU alumnus fewer than 20% are men\n        └── Why is that tho\n            └── Diversity hiring\n                └── Hey If you can answer the following Questions\n1) I went through a spreadsheet(of the 2023 placement companies tier and ctc's offered\") posted by a PES student. \nI calculated the tier 1 offers (FTE +(FTE+intern)) and saw that there were 500 offers above 15 lpa CTC  (a few being around 13) \nSo are all these on campus ? 💀 Because then the college is great tbh \n\n2) i fucked up my drop year \nSo does age matter ? I will be 23 by the time I sit for placements ?\n                    └── 1. Yes the sheet contains only on-campus placements. The reason the average/median is lower is because there are many more Tier 2/3 companies that bring down these stats. However, I would not suggest using it as a benchmark because 2024 placements have been very poor this year because of the market\n2. Nope. Not relevant. One of my friends is a dropper, did not face issues.\n                        └── 1) It's because of recession right ? \nI mean the tier 1 companies are offering 500+ packages of CTC more than 15 LPA So like the rest 500 people go to tier 2/3 \nThe median will  be somewhere around 15 ig the average 17 ?"
    },
    {
      "id": "juncigx",
      "body": "Only Amazon and Apple visit PES. And I don't think Meta recruits from any college in India, Netflix either xD\n└── Microsoft came to PESU a few years ago to hire interns, a couple of my batchmates got PPO from them.\n    └── Yup, I'm assuming you're from the 2021 batch? They stopped visiting since then. Not sure if you know, or if it's even related, but even Microsoft Innovation Labs has been rebranded.\n        ├── Yup, 2021 here. Damn, didn't know that.\n\nI think my batch had one of the best placement seasons 😅\n        │   └── Ah I'd beg to differ. Our average and median was much higher than your batch, and as is the case with every subsequent batch, the 2023 batch did significantly better than us. It's the current 2024 batch that is suffering.\n        │       └── Alright that’s great to hear. I remember back in my day interviews were relatively easy. Everyone got great placements without much trouble\n        │           └── As a current 2024 batch person,Man I wish I was born earlier ;(\n        │               └── Hey, expecting to join PES soon. Can i know, how the 2024 batch is suffering in placements?\n        │                   ├── Our Placement Season has just begun so its going well as of now...but I am not sure I can say the same after a month or so\n        │                   │   └── Hey If you can answer the following Questions\n1) I went through a spreadsheet(of the 2023 placement companies tier and ctc's offered\") posted by a PES student. \nI calculated the tier 1 offers (FTE +(FTE+intern)) and saw that there were 500 offers above 15 lpa CTC  (a few being around 13) \nSo are all these on campus ? 💀 Because then the college is great tbh \n\n2) i fucked up my drop year \nSo does age matter ? I will be 23 by the time I sit for placements ?\n        │                   │       └── 1) Yeah it is true that around half the CS batch gets around 12+ ctc atleast..so like the median is around 12 ish.\n\n2) I have heard that one year gap is fine but 2 year gap is frowned upon altho i am not 100% sure on this\n        │                   │           └── How is this year's placement ? Any idea on average/Median/highest and the companies visited this year i.e 2024\n        │                   │               └── As of Jan, average was 13.85,Median was 12 and Highest was 52 (For CSE)and Number of Companies visited were around 150 ish(For all branches combined)\n        │                   │                   └── It's pretty decent considering recession College is strict as far as I have heard but the placements are good\n        │                   └── Its too soon to say if they might actually *suffer*, but due to hiring freezes companies are definitely recruiting way lesser than they used to last year and the year before. For example my company took in close to 20-25 people for my batch, they took 10 for the next batch.\n        └── The innovation lab was rebranded before Microsoft showed up for even internships for my batch if my memory serves me right. It was originally set up with funding from Nokia for a fixed number of years so it was the Nokia Innovation Lab, which was then rebranded to the Microsoft innovation lab after the acquisition. \n\nMicrosoft slowed down campus hiring in 2022 but it's sad to hear they still haven't come back to hire. It might just be the usual IIT-BITS preference for a bit since most of the folks who were placed with them are still there. I wouldn't be surprised if management did something to tick them off though."
    },
    {
      "id": "juposhp",
      "body": "For the ‘23 batch. Apple did come, but only offered internship. They did resume shortlisting and favoured people with strong ML background. But then again they ended up picking all girls and one dude.\n└── They didn't have any test? Weird. For my batch they took a test. If it were resume shortlisting I would have stood a decent shot xD\n    └── Yeah, but the JDs weren’t too exciting. They hired for wireless tech, IS&S and IS&T. The last two are basically testing and tech support\n        ├── Alright. Also, I've DM'd you, please do take a look :)\n        └── Any idea about the fte ctc and base"
    },
    {
      "id": "jwqq9g3",
      "body": "Hey! I have a question. Apart from the CGPA cut offs Companies set, does the college / department set any CGPA cut offs for diff tiers of companies ? If yes , pls mention the cut offs for this season.\n└── There is a spreadsheet where everything is written  just search \"PESU PLACEMENT STATS 2023 REDDIT \""
    }
  ]
}