{
  "id": "15htkgd",
  "title": "Laptop recommendations",
  "content": "Cse student here..sem 3. Any laptop recommendations to buy? Lightweight laptops..",
  "metadata": {
    "root_comment_id": "juqfamp",
    "post_id": "15htkgd",
    "author": "DaikonEmbarrassed147",
    "url": "https://www.reddit.com/r/PESU/comments/15htkgd/laptop_recommendations/",
    "permalink": "https://reddit.com/r/PESU/comments/15htkgd/laptop_recommendations/",
    "score": 3,
    "upvote_ratio": 1,
    "created_utc": 1691135526,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "juqfamp",
      "body": "Zephyrus"
    },
    {
      "id": "juqisph",
      "body": "Lightweight laptop comes in 30k to 3lakhs what's your budget range specify that\n└── Around 50k...not above 60k\n    ├── Try for a m1 air or Samsung evobook\n    └── M1 Air could be a good choice.. provided the price keeps on dropping.. and you can exchange your old laptop for it too.. check the prices in store.. sale prices are bs as offline prices are lesser.."
    },
    {
      "id": "juqk8co",
      "body": "MacBook M2"
    },
    {
      "id": "jusodwj",
      "body": "Thinkpad E14/E15. Built like tanks and great linux compatibility."
    },
    {
      "id": "juvfooe",
      "body": "HP Pavilion the Ryzen 7 one"
    },
    {
      "id": "jv70zb3",
      "body": "Latest to Last Gen processors (try for i5/i7 10th gen+ or Ryzen 5/7 5000 series and above)\n16GB ram or 8gb with extra RAM slot\n500GB SSD\n14 Inch FHD display. \nOr if you feel 1.7kgs is also light for you then look for 15inch also\nSwappable RAM and SSD modules\nType C Charging can be a added advantage\nIncase you forget your charger. \n\nThese specification can easily help you keep laptop for good 6+ years. \n\nIf you intend to use it for about 3 years then look into the used market.. and also looking to buy in full cash..\n\nLenovo Thinkpads T series great build and best keyboard \nDell Latitudes or Inspirons (similar as HP pavilions)\nHP pavilion have great displays but can miss on TypeC charging in some models. \n\nIf my suggestion did not help it then my only suggestion is to curate a proper specification list and shorlist the laptops available and try it out in retail stores.\n└── Which processor is good for coding? Intel or ryzen?\n    └── I dont think there will be any difference for both the processors. Which ever you could find in your budget."
    }
  ]
}