{
  "id": "15jo4q0",
  "title": "Why does PES university has a reputation of being too hectic or \"School- like\"?",
  "content": "Is it because of 75 percentage attendance criteria?",
  "metadata": {
    "root_comment_id": "jv0swka",
    "post_id": "15jo4q0",
    "author": "iopjhugyvju",
    "url": "https://www.reddit.com/r/PESU/comments/15jo4q0/why_does_pes_university_has_a_reputation_of_being/",
    "permalink": "https://reddit.com/r/PESU/comments/15jo4q0/why_does_pes_university_has_a_reputation_of_being/",
    "score": 6,
    "upvote_ratio": 0.800000011920929,
    "created_utc": 1691323979,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jv0swka",
      "body": "Think of all the differences between a school and a university life,\n\nThe life you thought of as school life will be your university life here."
    },
    {
      "id": "jv0xe8w",
      "body": "80%-85%, 75 is hard limit. ppl prolly expected more freedom and way less work"
    },
    {
      "id": "jv1dib8",
      "body": "This isn't a university experience. It's 4 more years of school.\n└── then what is university experience???\n    ├── Something which is not like school .....\n    │   └── like what?\n    └── I'd say something where you have more choice and freedom. Let's say we can choose 4 or more subjects rather than just 2. Not having 80% min attendance, daily assignments etc. \n\nMainly having time to branch out and spend real time on doing extra curricular activities."
    },
    {
      "id": "jv1ea9w",
      "body": "To be frank I've jeard similar things of rv ramiah and bms. Usually pes kids are more vocal (pes kids seem to be the only kids aware of discord and reddit lmao)\n├── I've heard that RV is pretty hectic, yeah, but I always thought Ramiah was really chill lmao\n│   └── From what I've read management wise they're very lax but still not as chill as some college in the north. All colleges are disappointing in some way lol\n├── I wouldn't compare ramaiah and pes with school like structure tbh\nThey are world's apart in that sense\n│   └── why? elaborate?\n│       └── For starters, msrit is way more chill than pes atleast according to me\n└── Yeah you're right, MSRIT is almost like school all icer again academics-wise. It's coming from someone who was in PESU for about a month and a half. I feel like PESU timetable was at least a bit chill in the first semester but this place (MSRIT) is crazy. Class on Saturday (half days till 12:50) and full day classes 3 out of the 5 weekdays (till 4:30). I'm in my second semester and I feel like MSRIT isn't chill at all, it's probably just a random rumor. And yes, it's very much school-like, we didn't even have our annual fest due to random academic reasons (ig)."
    },
    {
      "id": "jv1kmu5",
      "body": "Honestly, PES is doing much better compared to other colleges, especially academics wise\n├── at the cost of student's lives???\n│   └── The student's life has got nothing to do with the syllabus, looks like u aren't aware of what's happened,if u did then u wouldn't tell this nonsense here, please educate urself first\n│       └── well I did know, that he was caught with phone etc. etc; I just said the above rant like cuz it was pretty common to bash pesu every now and then, sorry if I offended you should've added /s i guess\n└── I don't about your honesty but you sounds like some faculty or member of this organization, if you're remember you're nothing more than NPC"
    },
    {
      "id": "jv28jf6",
      "body": "Note' attendance criteria is 80-85%, it varies every semester"
    },
    {
      "id": "jv4prd7",
      "body": "If you have seen this and looking for a clg for graduation\nThen here's God tip don't join this clg if not they'll teach slavery in practical\n\nEven after knowing every shit about this clg i can't help new joiners inside clg becoz , most of the time we might get harassed in our semesters and also we can't complain legally becoz of lack of time and money also clg is good at bribing media and law"
    }
  ]
}