{
  "id": "15k92dv",
  "title": "Which college to choose ?",
  "content": "1. RV University - CSE\n2. BMSIT- CSE \n3. BIT - CSE \n4. MS Ramaiah University of applied science - CSE\n5 . PES - ECE",
  "metadata": {
    "root_comment_id": "jv48xj0",
    "post_id": "15k92dv",
    "author": "Total_Balance_6150",
    "url": "https://www.reddit.com/r/PESU/comments/15k92dv/which_college_to_choose/",
    "permalink": "https://reddit.com/r/PESU/comments/15k92dv/which_college_to_choose/",
    "score": 0,
    "upvote_ratio": 0.5,
    "created_utc": 1691378781,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jv48xj0",
      "body": "Are RVCE and RV University the same? How are they different? \n\nEither way, branch > college so pick whichever branch you like most in the best college you can get for it.\n└── As far as i have heard the placements of RVCE and RV University will be merged\n\n\nThe buildings are different. But the campus is same both are in the same boundary. \n\nNow this why i am struggling to decide ;-;\n    ├── So objectively, what are the differences? If your future plan only includes placements, and if as you say the placements are pooled, then pick RV.\n    └── Afaik RVU does have the same campus separated by a boundary as RVCE , but logically a college which offers CS without any entrance exam or for that matter anyone who passed thier private RVSAT ( its just a gimmick to show they have many people applying there ) cannot have the same placement as someone toiling so hard to get a rank of under 1k in kcet. It's just the image they're trying to build in the kids and thier parents to take 4L a yr and just giving a free CS seat. IMO ECE core In good college is better than these institutes ehich come under the main colleges.\n        └── Also consider BIT CSE , don't pretty sure about its current scenario but 5 years back it used to be a very good college especially for CS and compared to the other options you mentioned this seems a better one. But in the end it's you're choice and you're 4 years so al the best!!"
    },
    {
      "id": "jv4ljwe",
      "body": "PES ECE if you have interest in ece, else rv uni cse seems the best option as it is associated with rvce and its within the same campus \n\nif not rv uni for cse , bmsit is the next one as its associated with bmsce ( few students from bmsit sit for bmsce placements)"
    }
  ]
}