{
  "id": "15lcukw",
  "title": "Guy's help me out here with this plzz",
  "content": "I'm decent in calculus and Little average in algebra.... I'm going through kcet.\n\n[View Poll](https://www.reddit.com/poll/15lcukw)",
  "metadata": {
    "root_comment_id": "jva0cz2",
    "post_id": "15lcukw",
    "author": "ReachWooden531",
    "url": "https://www.reddit.com/r/PESU/comments/15lcukw/guys_help_me_out_here_with_this_plzz/",
    "permalink": "https://reddit.com/r/PESU/comments/15lcukw/guys_help_me_out_here_with_this_plzz/",
    "score": 3,
    "upvote_ratio": 0.800000011920929,
    "created_utc": 1691486142,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jva0cz2",
      "body": "I'm getting through kcet too. What's ur rank bro ?\n└── Mine is 4965..and yours?\n    └── you wont get AIML at RR with that bro\n        └── I have 2Ag(I don't feel proud to say this ngl)\n            └── nothing to feel bad about. If you're given something, it would be stupid not to use it lmfao\n                └── Exactly"
    },
    {
      "id": "jva0nm9",
      "body": "Nice. Mine is 2029. Btw according to last year's cutoff, u can easily get into pes ec campus cse. It's good. Not as great as rr campus. Idk about jss.\n├── Alright man...which college have you decided to get into??\n└── There's no difference between the campuses\n    ├── I donno. From what I've heard PESU EC 's faculty isn't that great.\n    │   └── The faculty at both campuses are mediocre tbh. There is no discriminator.\n    │       └── 😂\n    ├── actually there are differences. i have heard there are better placements from rr campus and all the toppers chose rr campus during counselling\n    │   ├── Placements are common for both campuses, they do not check which campus you studied in.\n    │   │   └── Which campus has better professor's??\n    │   │       └── It honestly depends. EC campus teachers can be quite strict, but they all teach from the same set of slides. I'd advise you to pick the campus that's closer to you.\n    │   └── Please dont share half baked knowledge. Both campuses are the same - you can check the pinned FAQ post for more info. Recruiters don't even know which campus you are from.\n    └── asli account se aao chancellor\n        └── You can view my post/comment history to know that I'm a graduate :)\n            ├── All that help just to hear this lmao\n            └── You are doing a great a lot of us appreciate you."
    },
    {
      "id": "jva14qb",
      "body": "PES RR or BMS"
    },
    {
      "id": "jvef6jz",
      "body": "U may not get cse at jss(acc to ur rank)... But there is a little possibility of getting AIML in pes rr\n└── What is the cutoff for cse at rr campus?\n    └── No idea about that, u can check in kea website"
    },
    {
      "id": "jvlq3bh",
      "body": "ec campus and rr campus has same teaching same placement"
    }
  ]
}