{
  "id": "15mf9va",
  "title": "When Is round 2 counselling going to start",
  "content": "They just keep delaying the dates?  any idea when it will start?",
  "metadata": {
    "root_comment_id": "jvg3b3l",
    "post_id": "15mf9va",
    "author": "SuperSan009",
    "url": "https://www.reddit.com/r/PESU/comments/15mf9va/when_is_round_2_counselling_going_to_start/",
    "permalink": "https://reddit.com/r/PESU/comments/15mf9va/when_is_round_2_counselling_going_to_start/",
    "score": 3,
    "upvote_ratio": 0.6700000166893005,
    "created_utc": 1691587533,
    "flair": "PESSAT",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jvg3b3l",
      "body": "After 16th prolly \n\nBut dumb pes management could not even send one email informing about the delay\n├── They sent it today that 17th is the last date for surrender of seats\n│   └── earlier it was 10th august and before that 29th july god knows when round 2 will start\n│       └── But this time they've written final so I think this may be final coz cet round 1 would also complete by 16th so yeah most prolly 19th or 20 would be round 2 of pes\n│           └── I really hope so buddy\n└── it says 17th is the last date, earlier it said 10. every time the date nears I check the website and see that it has been delayed. Its getting frustrating now"
    },
    {
      "id": "jvgo4g5",
      "body": "They ll keep postponing both the last date for seat surrender and 2nd round round pessat counselling until kcet 2nd round counselling are out and this makes sense because many seats obtained through pessat 1st round counselling will be surrendered if they get a seat through kcet in pes itself or other good Colleges, there is no point in conducting pessat 2nd round counselling before results of kcet counselling as very less seats would be vacant as of now"
    },
    {
      "id": "jvpowj1",
      "body": "I have received a SMS today and it said  2nd round counselling on Aug 20th. I have rank 75xx. Which branch can I get seat for this rank ? Thanks in advance for your help in guidance .."
    }
  ]
}