{
  "id": "15odadj",
  "title": "ECE doubts",
  "content": "Hello a fresher here(ECE) in EC campus , i have few doubts that i would like to clarify.\n\n1) Regarding placements: any idea of average ctc for ece branch and can ece students sit for cs placements( will they have a disadvantage?)\n\n2) can students from ece departments take up cs related projects ?\n\n3) how are the professors? How difficult will it be to get few LORs from them\n\nThanks you",
  "metadata": {
    "root_comment_id": "jvrw31l",
    "post_id": "15odadj",
    "author": "CoolGuyGovind",
    "url": "https://www.reddit.com/r/PESU/comments/15odadj/ece_doubts/",
    "permalink": "https://reddit.com/r/PESU/comments/15odadj/ece_doubts/",
    "score": 2,
    "upvote_ratio": 1,
    "created_utc": 1691770841,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jvrw31l",
      "body": "1. According to last year's stats, it was 24LPA the highest package, for Core ECE. Yes, ECE people can sit for CS placements, although I don't see any cons in that\n2. yes they can, if you mean any random project under a CS professor \\[or even **Capstone** too\\]\n3. Teachers are very good afaik. Afaik 5 LoRs u can get from a teacher whom u know personally and  the teacher knows u personally. I mean u should have worked under the professor for a decent amount of time, need not have taught your class\n└── But i read in the subreddit that in EC campus they do not allow ece students to take on cross branch projects and even the project titles are given by the profs\nCan you conform please\n    ├── Oh, I will confirm wait\n    └── Yes, that's how it works. Your team and guide are decided by the department in ec camping but depending on your guide, you might be able to choose your own topic or they might assign you one"
    },
    {
      "id": "jvuh9eb",
      "body": "ECE students can sit for cs placements too. It depends on the company sometimes as some companies wabt students from cs only. PES offers a minor course in cs and doing that should help you if you wanna sit for cs placements. As for the advantage, it's all about how well you can code and your preparation before the interview.\n\nI'm not sure abt RR, but ECE students in ec campus cannot take up cs projects for their final year project\n\nLORs depends almost fully on you and how much \nInteraction you have with the teachers and the teachers won't give it without thinking unless you're a topper\n├── Also, can you take up minors in computer science in the EC campus\n│   └── Yes. You can take up 1 subject every semester and 1 subject in the holidays\n└── In RR you can take up cs projects for capstone provided u must get a good guide.."
    }
  ]
}