{
  "id": "15otmdg",
  "title": "Doubts about electronic branches.",
  "content": "I would like to know the difference between ece in rr and ec campus in terms of placements, academics and any other differences that are important.\n\nAlso is eee branch worth it?\nAny senior pls respond as kcet counseling has started for our batch.\n\nThanks in advance .",
  "metadata": {
    "root_comment_id": "jvuhlrv",
    "post_id": "15otmdg",
    "author": "qwertyloop_b0i",
    "url": "https://www.reddit.com/r/PESU/comments/15otmdg/doubts_about_electronic_branches/",
    "permalink": "https://reddit.com/r/PESU/comments/15otmdg/doubts_about_electronic_branches/",
    "score": 1,
    "upvote_ratio": 1,
    "created_utc": 1691811162,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jvuhlrv",
      "body": "In terms of placement,course structure, and exams, there's absolutely no difference between the 2 campuses. We'll have placements together, the syllabus is the same and the exams take place at the same time too. Of course teachers are different and there are good and not so good teachers in both campuses. Ec is a bit stricter than rr but you can kinda manage. I wouldn't recommend eee, the placements aren't that good and most people just take eee to have a better chance of ece in round 2\n└── Thanks a lot. Have same idea right now. Choosing between bmsce and pes rn.\nWhat would you recommend?\n    └── Probably bms. Pes has really good placements but that's about it. Bms is a lot more chill and you'll probably enjoy yourself more there. But bms comes under vtu and pes doesn't so there's pros and cons to both. Depending on what you want, you should probably decide. Both are really good colleges at the end of the day and you shhould consider a lot of factors before deciding\n        └── I've heard the syllabus is slightly better in pes and so are the labs from a senior. Thanks a lot dude\n            └── Hahaha. No. Our syllabus (for ECE) keeps changing and they keeping adding, removing and modifying subjects almost every year. It's just a bit easier to study because we have slides,notes and question banks that are prepared by the teachers. The labs are a joke lol and nobody even cares about them. Since pes is a university, it can change it's syllabus to a certain extent. Until 5th sem, the subjects will be pretty hard compared to the subjects that vtu ppl have. After 5th sem you can actually choose your subjects and you can choose some easy ones to make your life easier. But in sem 3 and 4 the subjects are aids and in my batch more than half of them failed at least 1 subject lol\n                └── Oh wow thanks for the insight really helpful. And also can you check DM?"
    },
    {
      "id": "jvyq6yk",
      "body": "Please check the FAQS pinned on this sub for a comparison between the campuses\n└── Thanks"
    }
  ]
}