{
  "id": "15p1p0b",
  "title": "Dress Code for Boys at PES University",
  "content": "Do we have to follow any specific dress code at PESU (RR/EC) Campus or in hostel? Can boys wear shorts, tshirts and all to class? I wanted to buy some clothes and other items for college so it'd be very helpful to know if there are any restrictions in the type of clothes/accessories allowed in campus/hostel. Please help. ",
  "metadata": {
    "root_comment_id": "jvuwvrn",
    "post_id": "15p1p0b",
    "author": "Rishikesh-Kumar2004",
    "url": "https://www.reddit.com/r/PESU/comments/15p1p0b/dress_code_for_boys_at_pes_university/",
    "permalink": "https://reddit.com/r/PESU/comments/15p1p0b/dress_code_for_boys_at_pes_university/",
    "score": 3,
    "upvote_ratio": 1,
    "created_utc": 1691838180,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jvuwvrn",
      "body": "There is no \"specific\" dress code in college . Shorts are obviously not allowed .\n├── Can I bring an Office type chair to hostel?\n│   └── You got to ask wardens permission for that\n└── Will we atleast be able to wear 3/4ths in Hostel or do we have to keep wearing pants all the time in hostel?\n    └── You can wear shorts in your room and floor , you just can't wear it outside your block.\nI'm not sure about 3/4ths ."
    },
    {
      "id": "jvuwwbn",
      "body": "No shorts allowed in college or hostel.\nWhen you go to hostel attendance, you're not supposed to be wearing shorts. When you collect and give laundry, you shouldn't be wearing shorts.\n\nSo it's better not to bring shorts.\n\nBesides that, any shirt any pant is allowed.\n├── Can I bring an Office type chair to hostel?\n│   └── Yes mostly\n├── You sure about the shorts? I've mostly worn shorts in the EC hostel.\n│   ├── Yeah\n│   └── For ec campus hostel, shorts are allowed\n└── Will we atleast be able to wear 3/4ths in Hostel or do we have to keep wearing pants all the time in hostel?\n    └── 3/4ths are allowed"
    },
    {
      "id": "jvv64l9",
      "body": "Don't show knees and below knee to hostel authority and you will be fine :)"
    }
  ]
}