{
  "id": "15sk4eq",
  "title": "Which college is better in terms of education quality & placement.Location/Crowd doesnt matter.I got 2700 rank and I have a choice between ISE at Ramaiah or CSE at PES Electronic City campus and ISE BMSCE.Plz help and give your reason as to why THAT college..Does taking Pure CSE matter,is it better",
  "content": "\n\n[View Poll](https://www.reddit.com/poll/15sk4eq)",
  "metadata": {
    "root_comment_id": "jwenmg9",
    "post_id": "15sk4eq",
    "author": "knownoonefromhere",
    "url": "https://www.reddit.com/r/PESU/comments/15sk4eq/which_college_is_better_in_terms_of_education/",
    "permalink": "https://reddit.com/r/PESU/comments/15sk4eq/which_college_is_better_in_terms_of_education/",
    "score": 5,
    "upvote_ratio": 0.8600000143051147,
    "created_utc": 1692175376,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jwenmg9",
      "body": "Same bro. My rank in kcet is 2k and I can get IS in bms. But my parents want me to join cs in pes ec campus.\n└── \\+1 same rank bruv parents insist on me taking pure cs.. ecity appears to be the only available college at that rank (uvce and jss are unpreferred, by family)\n    ├── I think you should prefer PES ecity because both campus have placements together\n    │   └── Yup..\n    └── Exactly. I got uvce in mock. But my parents don't want me to join it.."
    },
    {
      "id": "jwepja2",
      "body": "If placements is your only goal go for PES .\nIf you want balanced college and academic life I would suggest BMSCE . BMSCE too has good placements but not upto the mark of PES yet but it is catching up.\nMy friends in bmsce say companies which come for hiring allow both cse and ise students. Syllabus wise there is a difference of few subjects and electives but the core remains the same. Overall I would suggest BMSCE(don't know whether you'll get it at 2700 rank in kcet)\n└── Placement bro,college life,not interested at least now,let me repent later lol\n    └── You're probably gonna regret that after 4 yrs\n        └── i know😭😭"
    },
    {
      "id": "jwg2nv0",
      "body": "I will recommend PESU CSE EC Campus. I mean they've improved the campus's infrastructure according to our needs. Recently they've brought back the 2 ISAs system so now most of us have ample time to do other stuff. Placements & updated syllabus is also a perk.."
    }
  ]
}