{
  "id": "15tvey7",
  "title": "seat surrender",
  "content": "I am actually getting a different college through kcet and i currently have seat at pes rr (aiml).But the kcet first round results are not out yet and the last date to surrender seat is apparently  tomorrow(18/8). I was wondering if i can surrender at later date (19/8) or after pessat 2nd round counselling(20/8). Also wondering how much will they refund if i surrender at a later date?",
  "metadata": {
    "root_comment_id": "jwm0d3q",
    "post_id": "15tvey7",
    "author": "noo_lyfer",
    "url": "https://www.reddit.com/r/PESU/comments/15tvey7/seat_surrender/",
    "permalink": "https://reddit.com/r/PESU/comments/15tvey7/seat_surrender/",
    "score": 2,
    "upvote_ratio": 1,
    "created_utc": 1692296642,
    "flair": "PESSAT",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jwm0d3q",
      "body": "First round results will be out by Tom morning( technically it's out now but the servers ain't responding)"
    },
    {
      "id": "jwm8loe",
      "body": "\nIt would be best to surrender tomorrow, that's rhe safest option.  They were pretty clear in the counselling session that there would be no refund for non NIT/IIT students\n└── due to some reasons i cant surrender on 18/8(last date). is it okay to surrender before pessat counselling?\n    └── It'd be best to contact the college and confirm. But afaik they were very strict about not giving a refund beyond the last date for non-IIT/NIT people"
    },
    {
      "id": "jwm8ue3",
      "body": "im sorry i cant be of help since i surrendered a while ago, but which college and branch are you joining via kcet now\n├── Cs in dsce\n│   └── olay atb man\n└── Hi, can you please tell the process of how you surrendered your seat? Like what docs, where to go in the college etc...\n    └── bro the green building on top in rr campus is where you go\n\nfor more details check their website about seat surrender , they have their own surrender form and youve to print that and it mentions all the required documents needed for it"
    }
  ]
}