{
  "id": "15uccxo",
  "title": "College selection confusion",
  "content": "In first round I got allotted cs in ec campus.. I'm not sure what to do😬\n\n[View Poll](https://www.reddit.com/poll/15uccxo)",
  "metadata": {
    "root_comment_id": "jwouyf0",
    "post_id": "15uccxo",
    "author": "ReachWooden531",
    "url": "https://www.reddit.com/r/PESU/comments/15uccxo/college_selection_confusion/",
    "permalink": "https://reddit.com/r/PESU/comments/15uccxo/college_selection_confusion/",
    "score": 2,
    "upvote_ratio": 0.75,
    "created_utc": 1692339779,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jwouyf0",
      "body": "Ur rank??\n└── 4965\n    └── how will you get ise at msrit at 5k rank bro tf, im at 2.3k and didnt get it\n        └── Maybe in third round and I'm not from general category so yeah 😂\n            └── oh okay 😭\n                └── I'm sorry bro....i feel you:("
    },
    {
      "id": "jwovgvd",
      "body": "Are u talking about kcet\n├── Yes\n└── What do you think I should do??is it worth to take cs in ec campus or should I consider information science in ms ramaiah?\n    ├── I think the order is\n\nRV\nPes rr\nBMS \nMSRIT\nPes ec\n \nPlacements are almost same for ise and cse in msrit  so try to choose msrit\n    │   ├── I even have aiml in PES rr campus ahead should I delete it?\n    │   │   └── Then it is the best option u have \nScope of aiml is huge in upcoming years and campus is situated in perfect place good peer group\n\nI think pes rr aiml is perfect for u if over crowd is not ur problem\n    │   │       └── Incorrect - there are no AIML jobs for undergrads. It's an academic and research oriented field that recruits primarily from people holding atleast a Master's degree. Besides, the AIML degree isn't a good option anyway (multiple posts on this subreddit discuss it)\n    │   └── PES RR and EC are the same, there is no difference between the campuses. Please don't share misinformation on this subreddit.\n    └── PES EC CS is the best option here. Don't pick AIML. There are multiple posts on this subreddit that discuss why\n        └── Dude I'm getting information science in msrit in later rounds should I go for it?(considering the peer group and infra)what do you think?\n            └── PES is a much better option compared to MSRIT. Any reason for preferring MSRIT?\n                ├── Tbh the people from RAMIAH and even the campus feels lively wheres I cannot say the same about PES ec campus but the main reason is msrit has a better nirf ranking than pes plzz correct me if I'm wrong (do you have any idea which college has the better infra)\n                │   └── I agree about the campus being lively, I've been to MSRIT and I loved the campus. You should know by now that NIRF rankings are extremely flawed. Colleges like Amrita and SRM have better rankings than PES. \n\nHowever, I think the decision of college will depend on your future goals. If your goal is to get a placement, then PES has the best placement stats for CS in the city after RVCE. If your goal is to go abroad for MS, then you should probably pick MSRIT - not because it's better ranked (rankings are irrelevant abroad if you aren't from an IIT), but simply because it's a much less stressful environment and easier to score a better CGPA.\n                │       └── Is msrit's syllabus compared to PES 's really that lame(I don't wanna study that doesn't really contribute to my knowledge)? My only concern with PES is that many good companies come with a cut-off CGPA of 8.5+(that's what I've heard)so I think it will be really tough to maintain that kind of CGPA in PES compared to ramaiah... anyways I really appreciate your answers man you are literally the best.\n                └── As the person said about the campus, I have to add that Ramaiah is overall better in reputation and is pretty well known as well. Most people I've talked to recognise the name whereas PES certainly lacks in the recognition department overall as most people wont know about the college outside of Bangalore. In terms of placements it isn't too far imo since the college submitted data to NIRF shows a difference of about 1L in average so I won't stress much about it. MSRIT also has a better campus and social life and is comparable in fees too iirc (not sure about the fees tho).\n                    └── MSRIT fees are significantly lower xD. Also yes, definitely better social life and campus. \n\nI'd like to add that PES is known for being a \"Bangalore college\" ie the demographic here comprises mostly kids brought up in the city. Although I'm not sure on what parameters you say MSRIT is better because the NIRF rankings are really flawed to depend on."
    },
    {
      "id": "jwoy6tu",
      "body": "I had written [this](https://reddit.com/r/PESU/s/WI65qVI48h) comment comparing CS and AIML before.\n└── Please tell me this, In third sem CS core students have a choice between AIML/Cybersecurity/Networks or something I heard and these other branches are the same portions except that the choice is already made for us..if that's the case we can go with AIML right?...There are a few colleges which have CSE (IOT & Block chain Technology) what of them?\n    └── Third year, not third sem. And no, it's not the same. Core CS will get the *choice* to select which *electives* to take up. They aren't skipping any of the core CS fundamentals, which CS+AIML is (they've replaced one of the core courses in 4th sem with an AIML course, and more to follow). I can't answer for the other colleges questions, but it's the same logic - why restrict yourself and let college make the choice for you?\n        └── My bad I meant third year..only reason I'm doing this because according to my rank I can't get CSE in top colleges but only the spec courses."
    },
    {
      "id": "jwp0y6f",
      "body": "Hlo bro ! I got cs in pesu ec too. Are u planning to join or are u gonna appear for further rounds of counseling?\n└── Dude I'm going to see if I might get cs in rr campus..what about you?\n    └── But isn't the cutoff low in rr campus ? Or are u trying to get in through a different counseling?\n        ├── I am holding on to the seat and gonna go through the nest round.\n        └── I know but I just wanna try out my luck ....no I'm going through cet.\n            └── All the best then bro ! If luck permits, let's meet at pes rr campus!"
    },
    {
      "id": "jwpwoqz",
      "body": "I got 7.8k rank with 2AG category, got ECE in JSS Mysore in the first round, saw bms ece cutoff reach 7.2k in this round, any chance I'll get msrit or bmsce in the subsequent rounds?\n└── Bro you can even get aiml at PES rr campus and cs(aiml) in msrit in the last round and maybe cse at jss Mysore\n    └── Thats good to know! But brother I'm seriously into ece so uk, would love to know your thoughts about my chance of ece in bms or msrit. Also i had put pesu in my top 5 but then removed it cos everywhere i see, i read that pes teachers are rude whatnot and facilities for everything except cs sucks there...\n        └── Yeah with your category you can easily get ece in bms and ramaiah..."
    },
    {
      "id": "jwq09y6",
      "body": "Is AIML worth it if I'm already mostly interested in AIML? i have a similar choice and could go with cse in EC campus if not.\n└── It is great but apparently you won't be hired with just a btech degree you have to get your masters done well that's what rowlet has been telling me and machine learning is completely a mathematical domain and you know how difficult maths get's sometimes(unless you are really good in maths ) so it's your call choose it carefully.\n    ├── I'm not sure that is true. There are a lot of companies that recruit aiml graduates.plus there is no rule that aiml students can't sit in placements for a particular company.when any other branch students can sit in cse placement with proper skills.why would placements be bad for cse+aiml students?I'm not a graduate but i have a lot of cousins who come from engineering background (cse mostly).my older sister itself is a cse+spec graduate and she landed a job at a reputed company. I don't wanna mislead you this is just my opinion! I believe aiml is a pretty good choice. But one thing is true that aiml sure does reduce the amount of electives u can pick. I choose aiml by choice! Math is hard but aiml has super interesting applications. Sorry for the long message I'm just sick and tired of people telling bad things about the branch 😞.\n    │   └── I am incredibly confused right now, I don't know what to do. I was pretty excited about the indoor basketball courts in RR ngl but if it's a disadvantage over normal CSE I should probably just stick to EC.\n    │       └── I don't know if it'll be a disadvantage or not yet cause according to a lot of people the curriculum is not fully drafted?, The college is not going to spoon feed us anyway so the skills have to be developed by us. Plus there are lots of resources for you to learn from outside as well and get certified, certificates sometimes cost money though. No one knows what'll happen with aiml.Cse is tried and trusted but aiml is called the new future.as far as I know taking cse+aiml should not affect masters or placement offers as much. Again there's no placement statistics that would suggest that aiml is bad or good. I developed a keen interest in  aiml, big data etc during 12th grade. Don't be confused you'll succeed no matter what you do. I'm sorry if the reply is all over the place! DM me if you want to discuss more about this! (FYI I'm not a graduate I'm a fresher but my sister is a graduate and has a lot of connections so i usually rely on her for advice and then research on my own)\n    └── No Job without masters? What's the placement statistics like for aiml graduates from pes then?\n        └── There are no graduates from cse aiml 😬. The oldest senior in cse+aiml is a second year.\n            └── oof, i think ill stick to EC campus then? seems real iffy to go with aiml\n                └── Nicee!"
    }
  ]
}