{
  "id": "15umejp",
  "title": "college selection kcet",
  "content": " \n\n**hey guys just got my first round result from kcet i got alloted pes computer science this is my 6th preference my order is rv cs is ds cyber and bms cs. My question is i might get rv cs ds or cs cyber in 3 round is it worth taking a specialisation cs branch if its from rv given that i have the option of getting core in pes cs and bms cs .**\n\n**what are your thoughts on this?**\n\n**\"educational\\_info: kcet rank 15xx with hk qouta\"**",
  "metadata": {
    "root_comment_id": "jwq7wxs",
    "post_id": "15umejp",
    "author": "Emergency-Addition50",
    "url": "https://www.reddit.com/r/PESU/comments/15umejp/college_selection_kcet/",
    "permalink": "https://reddit.com/r/PESU/comments/15umejp/college_selection_kcet/",
    "score": 2,
    "upvote_ratio": 1,
    "created_utc": 1692369639,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jwq7wxs",
      "body": "I'd suggest sticking to core CS if you look at only the branch. As a college, RV is ofc better. You'll have to take a gamble on this one.\n└── yup thank you should see"
    },
    {
      "id": "jwq817b",
      "body": "If you are going get your masters done then it's better to go for PES CSE.\n├── thank you will keep that in mind\n└── disagree , rvce is better in every way for masters\n    └── Yup, although both Uni's will be treated the same, you'll get many opportunities to build your profile at RV at probably a much less stressful environment. PES will guarantee a good placement at the end of 4 years but building your profile will be an uphill battle amidst the poor management, mediocre faculty, lack of research outcomes and rigorous academic coursework. The branch however might lead to minor issues but it won't be too big if you can build your profile right.\n        └── Are the place ments for AIML/DS branches done? \nOr are the first batch placements next year?\nWhat are the stats?\n            └── The first AIML branch is still in 3rd sem lol\n                └── 💀💀"
    },
    {
      "id": "jwtwhu3",
      "body": "What about RV IE(information science and engineering)?\nNo chance for that? \nI heard PES is bit strict, but help you a lot academically \nSo choose wisely before deleting or reordering\n└── The chances are pretty low, thanks though btw which college are you from?\n    └── Same batch as you, I got seat in msrit cse\n        └── Did you take admission or waiting for r2?\n            └── I got seat through comedk bro, im trying for kcet also but didn't get any seat in kcet (I want msrit cse or ise only) \nBut my rank is 5700 so I can't get them in my category"
    }
  ]
}