{
  "id": "15vcy0p",
  "title": "Pessat 2nd round",
  "content": "",
  "metadata": {
    "root_comment_id": "jwudafs",
    "post_id": "15vcy0p",
    "author": "Broken_Broccoli5",
    "url": "https://i.redd.it/z4o689vtq1jb1.png",
    "permalink": "https://reddit.com/r/PESU/comments/15vcy0p/pessat_2nd_round/",
    "score": 13,
    "upvote_ratio": 0.8799999952316284,
    "created_utc": 1692441945,
    "flair": "PESSAT",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jwudafs",
      "body": "I might actually kms tomorrow\n├── What's your rank?\n│   └── 2.2k rank, i hadnt done well in both cet and comedk and had hopes that i would atleast get ece in rr campus, now i dont have a college\n│       └── According to previous ear cutoffs you might atleast get ECE in EC campus.\n│           └── Hopefully, but only 5 seats left, im crying rn and idk how to break it to my parents\n│               └── Chill man..just hope for the best. Your rank is pretty good..Do you have any backup colleges atleast?\n│                   └── Thats the worst part, no, same thing happened to me in bitsat this year too, idk what to do\n│                       └── You haven't registered for kcet and comedk?\n│                           └── No because my rank was rly bad in them, and pes ece in rr and pes cs in ec were by far the options i had easily, i didnt know it would be this messed up.\n│                               └── And this is completely my fault 100% and im not blaming anyone, but i just wanted to vent, sorry guys\n│                                   ├── Nah man it's chill...Stay Positive and hope for the best..I know it must be hard.\n│                                   ├── Don't worry man chill now, everything will be alright\n│                                   └── If pes is ur only option, I suggest you take whatever seat that is available. Cus u can apply for a branch change once ur first year is completed and you have a good enough cgpa (1st year is common for all branches) you can easily get ece(RR) in ur second year if you have a cgpa above 8 cus imo first year is easy as shit.\n│                                       └── Hey what was this year cs at ec cutoff?No seats for round 2 right?\n└── Same bro \n\nI thought I'll get pes:(\n\nI could not attend 1st round"
    },
    {
      "id": "jwugmhl",
      "body": "Im totally fucked. I got 14XX rank and surrender my seat. Idk what to  do now.\n├── What are your options?\nLike backup\n│   └── None\n│       └── Same here\n└── im gonna take a drop year ez dubs\n    └── Bhai agar koi bhi college hai toh lele. Drop year fucking sucks. Dimaag ghum jaayega isse accha college leke chill kar abhi"
    },
    {
      "id": "jwullpe",
      "body": "I was waiting for so fucking long just so I could attend round 2 counselling man, only to realise there are no fucking seats left. Highly regret not going first round.\n├── Your rank?\n│   └── 3051\n│       └── Almost same rank I got had planned to ditch pes with comedk rank 75xx but thankfully I didn't\n└── Same ughhhhh"
    },
    {
      "id": "jwviqpn",
      "body": "What the actual fuck??   \nDid ECE Fill so much (faster) compared to CSE?\n└── I guess most of the toppers took CS. These people would've done well in other exams as well, so they would've withdrawn. So RR CS has the most seats left"
    },
    {
      "id": "jwym58w",
      "body": "sounds fishy....I myself know 8 candidates who have surrendered CS seats in RR bcos they got in KCET"
    },
    {
      "id": "jx0nmrw",
      "body": "Where tf is the seat that I left in ec campus cse\n└── Sold off through management\n\n![gif](giphy|67ThRZlYBvibtdF9JH|downsized)\n    └── Yup that's what I was thinking too.\nI left it on 18th and that's like day before yesterday,"
    },
    {
      "id": "l54u7e4",
      "body": "can we change our preferences during registration?\n\nalso will they not allow us to register if we dont have DDs?because my rank is 4k and i want to wait for 2nd round to get ECE.\n\n  \nalternatively can we go directly into 2nd round?"
    }
  ]
}