{
  "id": "15vcz49",
  "title": "Yeah guys, saw the number of seats remaining and I have fucked myself rly badly, idk what to do",
  "content": "# Its so over",
  "metadata": {
    "root_comment_id": "jwud9sv",
    "post_id": "15vcz49",
    "author": "Firo__Prochainezo",
    "url": "https://www.reddit.com/r/PESU/comments/15vcz49/yeah_guys_saw_the_number_of_seats_remaining_and_i/",
    "permalink": "https://reddit.com/r/PESU/comments/15vcz49/yeah_guys_saw_the_number_of_seats_remaining_and_i/",
    "score": 11,
    "upvote_ratio": 0.8700000047683716,
    "created_utc": 1692442039,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jwud9sv",
      "body": "Same. My rank was good enough to get me a CSe seat. Not anymore ig\n└── im not even bothering to go to the counselling at this point\n    └── Fair enough. This is just another reason to shit on pes ngl"
    },
    {
      "id": "jwudmi6",
      "body": "It looks really fishy tho. One of my friends surrendered an AIML RR seat, but they're showing 0 AIML seats left. Maybe they're offering a lot of the surrendered seats through management quota, who knows. But having only 26 seats left over in total is ridiculous lmfao\n└── They 100% overbooked, they would have offered 200 seats for every 100 seats available\n    └── Ahh...Makes sense now\n\nPES also moving like BITS lmfao\n        └── Like what does bits do?\n            └── BITS also overbooked this year, but they overbooked massively to the point where cutoff was stagnant for 3-4 rounds\n                └── Why does this happen? \nDon't computers do the counselling and seat allotment process?\nOnly possible if bits administration enters wrong number of seats\n                    └── yep, that's what is meant by overbooking. They input a higher number of seats on purpose\n                        ├── And say no one withdraws seats? Then? So much risk eh??\n                        │   └── They have the necessary data and stats from previous years to have a safe approximation about how many people will leave and how many will continue counselling. Worst case scenario that people dont leave, they will be forced to accomodate as they have already given them the admission letter, because if they cancel it there will be a huge scandal and their reputation will get hit.\n                        │       └── Yeah, that is so wrong, you literally are playing with children’s expectations in this case. As they also see previous rounds and speculate; This should be highly discouraged and criticised.\n                        │           └── That is true, i might be forced to take a drop so late into the year, ive been crying all day and idk what is going to happen now\n                        │               └── You shouldn’t have taken risk in the first place, and as far as I remember they offered around 432seats for CS RR and CS EC for every branch they almost doubled the seats; \nbut in the official website it only showed 233 some seats through pessat; they definitely doubled intake at that time, and so many withdrawals did happen but it didn’t matter anyway, now I am understanding what happened. \n\nAnd when I went to meet seniors they were all saying it cannot be 432 some seats, and now it all makes sense.\n                        │                   └── You've got it right. I am in second year CSE and last year in our PESSAT counselling they offered 360 CSE seats in both campuses even though the seats matrix indicates only 288 seats are there for CSE in both the campuses.\n\nBut the second round was different from this year's. RR CSE, EC CSE , RR AIML ample seats were there for the 2nd round as far as I remember.\n                        └── Bruh wtf"
    },
    {
      "id": "jwufjln",
      "body": "Bro, seats will be surrendered after this round. So u will be having a chance. That is if u enter through kcet..\n└── The seat that will be surrendered henceforth will mostly go for management.\n    └── If u are talking about kcet, then no. The surrendered seats are allotted in the second round. And further in the 3rd round. If seats are surrendered after the 3rd round, then they go to the management. So, if u are getting in through kcet, u still have a chance.\n        └── Oh yes, that's true. I was talking about pessat."
    },
    {
      "id": "jwufyl8",
      "body": "I went and gave back my biotech seat yday, looks like I was the only one to do so😂"
    }
  ]
}