{
  "id": "15w9wrm",
  "title": "any chance of legal action on PES for the second round scam?",
  "content": "this seems a bit extreme in my opinion but I think it's necessary, this is a clear scam where the college has fooled it's people, if they are somehow audited for all the DD's they won't have an escape and they'll sure get caught.",
  "metadata": {
    "root_comment_id": "jwzlica",
    "post_id": "15w9wrm",
    "author": "musicbyr1shi",
    "url": "https://www.reddit.com/r/PESU/comments/15w9wrm/any_chance_of_legal_action_on_pes_for_the_second/",
    "permalink": "https://reddit.com/r/PESU/comments/15w9wrm/any_chance_of_legal_action_on_pes_for_the_second/",
    "score": 15,
    "upvote_ratio": 0.8600000143051147,
    "created_utc": 1692533859,
    "flair": "PESSAT",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jwzlica",
      "body": "ps: I'm not suicidal so if anything happens to me yk who to blame"
    },
    {
      "id": "jwzp0t0",
      "body": "I'm sorry but could you please elaborate on what the scam is, i have seen many people talk about in the sub\n└── they overbooked the seats and then sold the actual surrendered seats for management quota"
    },
    {
      "id": "jwztx0i",
      "body": "I don't think you can , unfortunately all of the pessat/management seats are directly in their hands ..... they can do literally whatever they want to do with them lmao.\n\nIt is quite infuriating , I understand .....but most private colleges work like this in a money- hungry fashion.\n\nYou cannot sue them unless they somehow try to manipulate the kcet(government) seats , however this is not the case."
    },
    {
      "id": "jwzvocd",
      "body": "Is it confirmed that they converted the pessat seats to management quota??\n└── even i wanna know whether its confirmed or not"
    },
    {
      "id": "jx0rwt2",
      "body": "bro go touch grass man"
    },
    {
      "id": "jx0s7bs",
      "body": "PESSAT seats are purely under pes management they can do WT ever they want with it idts you can take legal action.\n\nYou could have done if they had done something to kcet seats but they didn't so you can't really do anything.\n└── so, it means, this is true that 2nd round PESSAT seat surrenders are converted into management?\n    └── I mean nobody can say for sure but you can't really question pesu on this"
    }
  ]
}