{
  "id": "15y2c0c",
  "title": "Rant about college",
  "content": "It's been three weeks since I started college, and I've hardly been to any classes. I have this tendency to avoid things when they get stressful or when I doubt myself. This is what happened throughout my school years, leading to poor attendance. I really wanted to change that pattern in college, make a difference, and find genuine friends who would inspire me to improve and guide me onto a better path. I've never had that in my life before. In the past, I even bullied people I didn't like just to fit in with the popular crowd. It resulted in ruining my grades while my friends excelled academically. I was compelled to hang out with them, and yes, it was terrible. Inside the group, belittling others seemed to be how they expressed their affection, so I had to leave them behind.\n\nI hoped things would be different in college, but it feels like déjà vu from high school. I've ended up with similar types of people here, and I can't stand it. I feel like I'm just tagging along. I wonder where you guys even found friends who are positive influences and not toxic. The friends I've made in college know that I'm queer, yet they casually throw in homophobic remarks and disregard my preferred pronouns, all in a so-called 'friendly' manner. It makes me feel foolish. I was really looking forward to having friends here who would help me grow academically and personally. But no, it's not that simple to just make new friends, because many students are prejudiced against weight or already have established groups. I see stories of people hanging out after college, something I never knew about because I was never included in those things. I can't even bring myself to attend classes without having a panic attack about how inadequate I feel. And there's no one I can turn to for help. I struggle with so many things which may come to someone so easily and i just needed someone to support me.",
  "metadata": {
    "root_comment_id": "jx99ao8",
    "post_id": "15y2c0c",
    "author": "anxiousmfforW",
    "url": "https://www.reddit.com/r/PESU/comments/15y2c0c/rant_about_college/",
    "permalink": "https://reddit.com/r/PESU/comments/15y2c0c/rant_about_college/",
    "score": 4,
    "upvote_ratio": 0.6700000166893005,
    "created_utc": 1692701801,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jx99ao8",
      "body": "I hope you'll find friends who value you and help you grow, stay positive! Things will be better.\n└── I hope your words come true someday\n    └── They will soon duhh! There are like 1000 people coming to uni this week I'm sure you'll find someone you vibe with\n        └── I really appreciate it 😭\n            └── If you feel that it's getting real hard feel free to pm me!"
    },
    {
      "id": "jxcw9du",
      "body": "Take deep breaths, I know everything feels super overwhelming now but it'll ease out when you get used to college okay just give it some time. Till then try to make yourself think of interactions like achievements, the more you interact with new people, the better you'll feel about yourself for achieving something, it really helps. It'll be exhausting in the beginning but soon you'll get better at reading people and finding your crowd, all the best!\n└── Thanks! It's kinda hard to socialize being an introvert with anxiety but sure I'll try to open up more\n    └── Just try familiarizing yourself with a couple of people for now, I'm sure it'll ease up with time and confidence, you should probably contact a therapist for better suggestions tho"
    },
    {
      "id": "jxe488t",
      "body": "Hey there , I just wanna say I was going through a similar situation and I did the same this ( posted about it on reddit) honestly it did go well made few friends , although they are seniors they are super nice and few other peps , and if you like we could be friends 😊\n└── Sure, I'll send you a DM"
    },
    {
      "id": "jxeel7g",
      "body": "Hii. I'm sorry that you have to go through this. If you ever wanna chat DM.\n└── I'll send you a dm\n    └── K"
    }
  ]
}