{
  "id": "161lrj6",
  "title": "COLLEGE SELECTION",
  "content": "I have a choice between MSRIT,BMSCE AND PESU RR campus All CSE CORE\nThe most important thing for me is placements.\ngotten pes through pessat and msrit BMSCE through cet \nPlease guide me and give your thoughts\nI'm more inclined towards pesu",
  "metadata": {
    "root_comment_id": "jxspuc6",
    "post_id": "161lrj6",
    "author": "BroSubZGamingYT",
    "url": "https://www.reddit.com/r/PESU/comments/161lrj6/college_selection/",
    "permalink": "https://reddit.com/r/PESU/comments/161lrj6/college_selection/",
    "score": 3,
    "upvote_ratio": 0.6700000166893005,
    "created_utc": 1693026255,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jxspuc6",
      "body": "If money is not a problem pes>BMSCE>msrit\nElse if you want best ROI\nBMSCE>MSRIT>PES"
    },
    {
      "id": "jxsq0g4",
      "body": "What is your kcet rank?\n└── 78xx with 2AG Category, aiming for ECE, got JSS in r1, you think ill get bms or even msrit in r2?\n    └── Last year the unaided seat cutoff for ece at bms was 7900 so the odds are you could get it.\n        └── First round cutoff for 2022 was 6.4k but in 2023 its 7.2k. Maybe my chances are high but im anxious always\n            └── And I'd say to remove ece from PESU cuz I've heard not soo polite things about it's department.\n                └── I've never even added PESU for the same reason. Also any idea about if i should take BMSCE or MSRIT for ECE\n                    └── I'd suggest BMSCE."
    },
    {
      "id": "jxsq6i0",
      "body": "Imo bms is a better option for you.PESU kind of looks shady to me and talking about placements bms and pes both give equal opportunities.\n└── Pesu only got sketchier after their round 2 shit."
    },
    {
      "id": "jxstdmn",
      "body": "Bms cs has a higher cutoff than pes if you are getting bms u also must be getting pes through cet\n├── exactly wtf, even i was surprised\n│   └── I think its because of the suic*de incident\n│       └── How is this related?\n│           └── It severely impacted the college's pr\n│               └── I see, but it should be easier to get in then\n└── Can you share the cutoff pdf?"
    },
    {
      "id": "jxt5u2h",
      "body": "Bmsce> msrit... Don't consider pes... Especially since it is via pessat too\n├── Is bms better than msrit?\n│   └── Yes , BMS is better than MSRIT\n└── Are tier 1 companies offer at BMSCE better than msrit for ise???? I got cse at PESU ec in kcet 2nd round, what should I do??\n    └── Number of T1 companies visiting BMSCE are more than MSRIT.\n        └── What's your source?U from bms?\n            └── I have friends from both BMSCE and MSRIT . Although many companies do visit both .\nI'm a final year student in PESU\n                └── PES cse in ec campus or msrit ise.\n                    └── If placements is your only goal join PES , if you want a balanced college life better join MSRIT .\n                        └── Yeah placements are my only goal but my social skills are kind of shit,so yeah."
    },
    {
      "id": "jxtjpp7",
      "body": "Bms>pes>msrit is prolly your best bet."
    },
    {
      "id": "jxyvah4",
      "body": "If a balanced college life is your goal I would suggest BMS>MSRIT>PES . If placements is your only goal then PES>BMS>MSRIT\n└── Bro what percentage of tier 1 offers in ise for bms and msrit? Is it a better option than cse at PESU ec campus?"
    }
  ]
}