{
  "id": "162ht2u",
  "title": "Some Questions before first day",
  "content": "Before my first day in pes rr campus, I have a few questions regarding what to bring and what not to.\n1.Should I bring a laptop to college and books and if so, which ones? The faculty haven't really told us anything so I've just been confused as to what I should bring?\n2.For our first week, do we just bring a water bottle to the campus?\n\nI'm just really confused and I don't know what to do. Any answers would really help me out.",
  "metadata": {
    "root_comment_id": "jxxbpx0",
    "post_id": "162ht2u",
    "author": "Aggravating-Word-999",
    "url": "https://www.reddit.com/r/PESU/comments/162ht2u/some_questions_before_first_day/",
    "permalink": "https://reddit.com/r/PESU/comments/162ht2u/some_questions_before_first_day/",
    "score": 6,
    "upvote_ratio": 1,
    "created_utc": 1693114548,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jxxbpx0",
      "body": "Firstly, welcome to PESU. If you've managed to make it here even after the countless warnings on this sub then it must be fate.\n\n>1.Should I bring a laptop to college and books and if so, which ones? \n\nFor the first day, just get a notebook and stationery, along with your water bottle and anything else you think you might need. Most profs don't tend to allow usage of laptops in first year (since you have only 1 CS course per sem), so it does not really make sense to carry unless they ask you to. In higher semesters profs seem to be more relaxed with usage of laptops. Some profs might even allow you to take notes on a tab/iPad, although you need to check with them first.\n\nAs for books - everything is online. There are discord servers set up to help people out (check the FAQ post on this sub). You do not need to buy any books, a soft copy for everything is available and it is not advisable to buy anything since you will need each book for at most 4 months and each book is pretty expensive. Buy a calculator though - the Casio 991EX model is the preferred one here. \n\n> I'm just really confused and I don't know what to do.\n\nAlready a true PESt!\n├── Thanks!!\n└── Thanks bro"
    }
  ]
}