{
  "id": "163krd9",
  "title": "How \"updated\" is PES syllabus?",
  "content": "Ppl on yt who are in pes say it is regularly updated and all, but this rowlet-owl guy says that the updated syllabus is mostly superficial. Can someone tell me about it?",
  "metadata": {
    "root_comment_id": "jy34vnd",
    "post_id": "163krd9",
    "author": "machinegun2187",
    "url": "https://www.reddit.com/r/PESU/comments/163krd9/how_updated_is_pes_syllabus/",
    "permalink": "https://reddit.com/r/PESU/comments/163krd9/how_updated_is_pes_syllabus/",
    "score": 13,
    "upvote_ratio": 0.8799999952316284,
    "created_utc": 1693225684,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jy34vnd",
      "body": "I guess I'm not allowed to answer this question 💀\n└── What's this sus knowledge you are sharing"
    },
    {
      "id": "jy3b5cm",
      "body": "welp :P"
    },
    {
      "id": "jy3ghul",
      "body": "dude just enjoy the orientation for now, you will get it after 1 week dont stress too much. also rowlet anna is the TOP G of pes\n└── Who is Rowlet anna?"
    },
    {
      "id": "jy3hrwa",
      "body": "Bro, calm down. Yo just chill... Enjoy pes atleast till it gives torture"
    },
    {
      "id": "jy3mwxr",
      "body": "You joined PES already, there's no going back . \nCompared to all other private colleges in blr , I would say PES has the best syllabus."
    },
    {
      "id": "jy3rseg",
      "body": "Bruh enjoy your bootstrap gosh"
    },
    {
      "id": "jy44ex8",
      "body": "When you compare it to VTU's syllabus , it is updated."
    },
    {
      "id": "jy6ws3g",
      "body": "guys btw i havent joined pes yet, waiting for kcet 2nd round. just wanted to know abt the syllabus\n└── I know you did not want my opinion but here are my 2 cents anyway:\n\nThe overall syllabus is excellent, yes. It's definitely better than most CS curriculums in other Bangalore colleges, which are incredibly outdated. \n\nHowever, is the syllabus *updated*? Barely. PES sacrifices quality for quantity when it comes to putting the latest topics in the syllabus - a lot of courses will contain a slide or two at max of the \"updated\" concepts. So yes, although the syllabus is great, it barely passes to be called updated since it just introduces the concept's name and does not go into its details, hence why I called it superficial in nature.\n\nIf you have doubts regarding the credibility of my answers, the other comments on this thread and sub should be enough to settle your doubts about it.\n    ├── oh thanks man, i had made the post just to confirm your point with others\n    └── Downvoted"
    }
  ]
}