{
  "id": "1659tim",
  "title": "Capstone",
  "content": "Currently in third year, can seniors give reviews about different professors in computer science department for capstone. \nWould appreciate if you can list good teachers as well as the ones to avoid",
  "metadata": {
    "root_comment_id": "jycsamx",
    "post_id": "1659tim",
    "author": "depatud0",
    "url": "https://www.reddit.com/r/PESU/comments/1659tim/capstone/",
    "permalink": "https://reddit.com/r/PESU/comments/1659tim/capstone/",
    "score": 9,
    "upvote_ratio": 1,
    "created_utc": 1693387555,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jycsamx",
      "body": "It depends on the field you are interested in and want to pursue your capstone on. Its not possible to give feedback on profs without knowing the parameters\n└── Currently we are looking into nlp as one of my teammates has some experience in it. We know for now that BJD, KSS have full teams. Any suggestions would be appreciated\n    └── Contact Gowri, Mamatha, Rammoorthy and Ashwini for NLP related research work.\n        ├── Is it true that gowri mam and mamatha mam look for high cgpa as we don't have high cgpa, as for rest will try approaching them . Thank you\n        │   └── Gowri - yes. She is highly selective and picks only the teams that have students with good profiles (even if you approach her way in advance). \nMamatha - nope, but a lot of people try to get her as Capstone guide plus given the fact that she's HoD now a lot more will be trying for the same. So unless you contact her early on you might not get a chance.\n        │       └── What about rammoorthy and ashwini, I know ashwini mam as I had her for one of previous sems and did good in that subject as well, will it help in some way. \nThank you\n        │           └── No harm asking. My suggestion would be to reach out to everyone I listed and ask them in that order.\n        │               └── Ok thanks so gowri>mamatha>rammoorthy>ashwini in that order thanks for the info\n        │                   └── Assuming you've already asked BJD and KSS, yes\n        │                       └── BJD already has taken max possible teams  and KSS already has  a huge number of applicants but will try asking him\n        └── Yes I did a project under Mamatha ma’am. She’s easy to work with for as long as you deliver on time. But I’m not sure if she’ll be taking too many projects this time as she’s become the HOD for CS.  So contact her immediately\n            └── Thanks will try contacting her"
    }
  ]
}