{
  "id": "16at0gv",
  "title": "advice needed",
  "content": "how do hackathons and doing external  courses like pesu io contribute to our resume and placements??like do they play a major role?or is it the projects that we do in 3rd and 4th year  and cgpa that actually matters",
  "metadata": {
    "root_comment_id": "jz9dd2x",
    "post_id": "16at0gv",
    "author": "AlternativeGood9237",
    "url": "https://www.reddit.com/r/PESU/comments/16at0gv/advice_needed/",
    "permalink": "https://reddit.com/r/PESU/comments/16at0gv/advice_needed/",
    "score": 17,
    "upvote_ratio": 1,
    "created_utc": 1693931710,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jz9dd2x",
      "body": "Not sure about pesu io courses but hackathons do add to your resume if you win. Apart from resume building, you can network with a lot of people and can get to learn many things. I would totally suggest you to take part in hackathons."
    },
    {
      "id": "jz9fp4f",
      "body": "There's a simple answer to this\n\n\\> Having it in your resume is going to boost your profile\n\n\\> Having too many hackathons in your resume may not seem credible\n\nSo go for a few, build some amazing solutions, and you can put it on your resume, but don't overdo"
    },
    {
      "id": "jz9ww81",
      "body": "Only knowing python and C learnt in 1 st year, can we attend hackthons  Or we need to know more?\n├── Depends on how much of Python and C you know. Just knowing these, maybe you can learn Machine learning and do something out of it.\n└── I highly recommend you to just participate in it. Hackathons are really fun because you figure out solutions as you move forward in the competition and even if you don't even come close to winning, you'd have learnt something new"
    },
    {
      "id": "jz9y1gt",
      "body": "Honestly, whatever project you do at end of PESU I/O Course or Hackathons, please upscale it to **resume-level.** Do not stop there. :)"
    },
    {
      "id": "jzbxm5d",
      "body": "I've always seen this to be a boost for your personal skills rather than a boost for your professional image. Sure, winning hackathons and doing new projects from skills you learnt in IO give you an edge over people only in terms of knowledge. Work on building your knowledge: whether that be through IO, hackathons, certifications. CGPA is only necessary to clear cut offs of companies. Currently (batch of 2024), 90% of the companies that have come to the campus have had a CGPA cutoff ranging from 6 to about 7.75. There are a few companies that have asked for only students with a GPA of 8.5+ but they are few and far between. \nWork on building your skills, work on projects with those new acquired skills, participate in hackathons and try to win them, actively look for internships in your field. These things will definitely add some flavour to your resume but won't carry it. Having a deep knowledge in the subject is always preferred. \n\nP.S.: If you're looking to crack an IT role, please educate yourself extensively in Software Development as at least 75-80% of the companies that have visited so far are looking only for software devs. This may vary for your batch but just keep that in mind. Good luck!"
    },
    {
      "id": "jzcyejh",
      "body": "People with and without any doubt these are doing extremely good.\nOne thing which I found very common between those who are doing exceptional is that they were focused on real stuff.\nNot so much as hackathon (i did got through 2 Inside 5 outside) or IO (I have been 4 time SME so I get the setup) what you need it to focus on making yourself valuable for the firms for instance I ll give a EC example (there are far too many in CS already) I knew a few 2023/24 batch juniors and they were enthusiastic enough to join me in doing some tiny ML projects in 2021 (their 2nd year) while the projects were decent to good they  in a group group 4+4 worked towards coding ML program using same tenserflow libraries used to run Ml on mobile mobile low compute. \nI knew a few a final year project team, they asked me to guide a bit (couldn't do a lot at the time) but they did presented their work at CERE IIM Indore. Not the just presenting their was big deal but that they actually worked on marketing insights some marketing research companies will like to use.\n\nFocus on new technologies, new area of problems firms have talk to your seniors for that who are outside.\n\nMost important: DONT SPEND TOO MUCH TIME ON DOING PROJECTS AROUND MADE UP PROBLEM. Thats something that is a huge difference between ours (atleast till 2020) and top technical universities outside India and few india.\n\nIf you want to impress or solve problem for industry [or atleast signal that you do] ask them the problem do make it up. For those who dont have connects  send random LinkedIn or reddit post like this, if you are too shy read IEE transactions (not explorer)\n\nTry you best and PES will do rest.\nAll the best"
    },
    {
      "id": "jzo6n4w",
      "body": "Networking, Experience, and Skill Building.  \nIf you feel you are getting these three things from anything, be it hackathon, project or a course, it matters."
    }
  ]
}