{
  "id": "16b897j",
  "title": "2024 Placements",
  "content": "Could someone pls share the spreadsheet for the 2024 placements",
  "metadata": {
    "root_comment_id": "jzc7dc5",
    "post_id": "16b897j",
    "author": "Pitiful-Car-9475",
    "url": "https://www.reddit.com/r/PESU/comments/16b897j/2024_placements/",
    "permalink": "https://reddit.com/r/PESU/comments/16b897j/2024_placements/",
    "score": 12,
    "upvote_ratio": 0.9399999976158142,
    "created_utc": 1693967754,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jzc7dc5",
      "body": "[placement record](https://docs.google.com/spreadsheets/d/1YZ7HtUcvA9jqWZ04DuwTT66aTV7gU7DUlXyO2BewpII/edit?usp=sharing)\n└── Can you share MCA placement records as well?????"
    },
    {
      "id": "jzrn11f",
      "body": "Only one company shortlisted based on boards. Is that true?\n└── No every company has a boards cutoff varying from 60-80%,but this company stood out for putting it at 90%\n    └── Are there any tier one companies who don't shortlist candidates based on boards?\n        └── Almost all companies ask for atleast 65-70% in boards,Tier 1 usually ask for 75-80%\n            └── I have 74.8% In 10th boards (our final exams were cancelled due to covid) and 92% in 12th.Do I have any shot at getting a tier 1 job?\n                └── U will have chances in some T1 companies\n                    └── So the chances are quite slim huh, great.Thx for the info.\n                        └── not slim exactly i would call it 50% ish...like u will get rejected by companies having 75-80% but above 70% also are quite good in number\n                            └── Tier 1 companies offer 12lpa+ right, is that CTC or the actual in hand salary? Same question involving average package in PESU being 8lpa."
    },
    {
      "id": "jzu8v7e",
      "body": "How are the placements going compared to last year ??\n└── Bad really bad\n    └── T1's have dried up substantially in the peak month of Sept...only around a third of CSE branch has been placed till now\n        └── one third as in of RR+EC comnined or you talkin only bout RR?\n            └── combined...total eligible ppl might be around 900ish (above 6.75 gpa) and some ppl go for masters so dont apply for placements\n                ├── 900 ? \nBruh that's the size of cse batch in each campus rn 💀😂\n                └── Approximately what percentage of people are not eligible for placement or take masters ?"
    },
    {
      "id": "le2afty",
      "body": "Can anyone share ECE placements in 2024?"
    },
    {
      "id": "lezszpk",
      "body": "How about the placement AIML students?"
    },
    {
      "id": "loj2524",
      "body": "As I've heard from my lecturers it is said that this year 2024 the highest package right now is 60 lpa."
    }
  ]
}