{
  "id": "16ewhyt",
  "title": "Decision making",
  "content": "\n\n[View Poll](https://www.reddit.com/poll/16ewhyt)",
  "metadata": {
    "root_comment_id": "jzxzy7i",
    "post_id": "16ewhyt",
    "author": "Lem_on_00",
    "url": "https://www.reddit.com/r/PESU/comments/16ewhyt/decision_making/",
    "permalink": "https://reddit.com/r/PESU/comments/16ewhyt/decision_making/",
    "score": 6,
    "upvote_ratio": 1,
    "created_utc": 1694340291,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "jzxzy7i",
      "body": "Which campus of pes did u get\n└── Rr campus will get in 3rd round\n    └── From what I learnt, taking core cs is better than taking any other it branch. So, I would suggest u to take core cs if u have a chance."
    },
    {
      "id": "k004p30",
      "body": "Both good. Go to the one near to your house lol"
    },
    {
      "id": "k00daty",
      "body": "PES alumni, 7 years of experience in software industry. From my experience\n\n* Branch matters only during placements. Once into the software industry, branch does not matter.\n* PES has amazing placement opportunities with good academics while the college life is very poor.\n\nBased on my learnings, I would suggest you to go with BMS if you are academically sound. 4 years of my college life sucked and I regret it to this day. One should definitely enjoy his/her engineering days. On the other hand, if you think you need more opportunities to earn more from day 1 of your job, PES is fits well."
    },
    {
      "id": "k02hcbw",
      "body": "Doesn't cse and ise have 95 percent overlap in syllabus?? If so then , choose the one nearer to you. If you really want college life try BMSCE.\n└── yes both the branches have almost same syllabus ..."
    },
    {
      "id": "k02hxbz",
      "body": "i would suggest you to take BMS ISE ............. if you want to enjoy you college life and also have a good placement then BMS is only option . BMS has way too many Fests and basically you can enjoy you engg college life to fullest\n└── Username checks out"
    }
  ]
}