{
  "id": "16nkjf4",
  "title": "Pls help me choosing college",
  "content": "Waiting for the kcet 3rd round and I might get cse core at PES rr campus, but some of my friends hv already joined RVU in 1st round and asking me to join there too, is it would be a wise decision to leave pes cse for RVU cse btech(hons) ?\nHad got pes rr campus aiml in 2nd round, should I keep RVU cse above pes aiml ?",
  "metadata": {
    "root_comment_id": "k1eu9yw",
    "post_id": "16nkjf4",
    "author": "rakesh9663",
    "url": "https://www.reddit.com/r/PESU/comments/16nkjf4/pls_help_me_choosing_college/",
    "permalink": "https://reddit.com/r/PESU/comments/16nkjf4/pls_help_me_choosing_college/",
    "score": 10,
    "upvote_ratio": 0.8199999928474426,
    "created_utc": 1695214314,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "k1eu9yw",
      "body": "If you're talking about RVCE go ahead and join it no second thoughts in that\n\nbut if its RVU then just  think about it once \n\nI dont know much about RVU but PES just has had consistent placements for some time now"
    },
    {
      "id": "k1f2ex9",
      "body": "RVU is a new college with no placement data available. On the other hand, PES RR campus is recognized campus with a great placement data and is ranked pretty well in Bangalore. You should also refer to cutoffs with what's better.\n└── People say rvce and RVU will be having placements together,how about considering this\n    └── They say that, but what they dont tell is, that they put a CGPA cutoff as of now. That is, only students above a certain cgpa (7-8) can sit with RVCE students. Below that, I cant vouch for.\n        └── Ohk thanks, btw r u a pes senior\n            └── Nope, rvce fresher\n                └── Heyy, waiting for round 3\nHow is the EIE/ETE departments?\n                    └── For RVCE, pretty decent I'd say-\nEIE min=4 max=30 median=10.5 avg=11.93\nETE min=5 max=22 median=8.5 avg=10.62"
    },
    {
      "id": "k1f2pki",
      "body": "Go for PES RR"
    },
    {
      "id": "k1fgzf5",
      "body": "PES 💯,  for RVCE it's a coin flip if you put you head to it PES by 2027 will get you the best results you want if it's placement a 25lpa is  ery reasonable from PESU with good work. Beyond that need a bit luck too"
    },
    {
      "id": "k1fh5e0",
      "body": "Pes rr anyday, if it was rvce could have considered it. But rvu is too risky to take"
    },
    {
      "id": "k1imaqy",
      "body": "Yes. Goto RVCE if you get it."
    },
    {
      "id": "k1inzir",
      "body": "RVCE and PES both have toxic cultures. I passed out from RVCE back in 2016, it was such a shit show. RV cse placements are better though, but luck plays a huge role in it. If you're planning on joining any of these two colleges be prepared to be a sheep whose ready to be slaughtered any time. The slaughtering happens multiple times a year.\n└── Sheep?"
    },
    {
      "id": "k1j81zo",
      "body": "Yellamma dasappa institute best\n└── No cap"
    },
    {
      "id": "k1p24s3",
      "body": "Don't take rvu\n├── Are u at RV UNIVERSITY ?\n│   └── No\n\nI just think it's too new and not worth it when you have more established choices\n│       └── Ohhk btw which clg u in?\n│           └── I'm in pes\n\nWhich i also don't really recommend\n\nIdeally I'd pick bms or msrit over\n└── Bruhh I'm getting dsu in kcet I don't have any good choice ig so should I smash it ?? 😭"
    }
  ]
}