{
  "id": "16q6d2k",
  "title": "Regarding the top colleges for cse",
  "content": "I am a diploma student who will be joining 2nd year lateral entry.\nand my main focus is based on placements\nand I don't care about social life.\n\n\nso I have gotten seat in pes rr campus cs \nnow through my dcet I might get\n\n\n rv ise\n\npes rr cse\n\nbms cse\n\nwhich would u choose",
  "metadata": {
    "root_comment_id": "k1v5se7",
    "post_id": "16q6d2k",
    "author": "BroSubZGamingYT",
    "url": "https://www.reddit.com/r/PESU/comments/16q6d2k/regarding_the_top_colleges_for_cse/",
    "permalink": "https://reddit.com/r/PESU/comments/16q6d2k/regarding_the_top_colleges_for_cse/",
    "score": 13,
    "upvote_ratio": 0.9399999976158142,
    "created_utc": 1695480402,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "k1v5se7",
      "body": "Unrelated but will students who join through lateral entry duty for placements together with btech students? Will they study in common classrooms?\n├── yes , they will have combined placements with regular pessat / kcet students  , but they will have some extra courses specially in maths and python in order to cover up for first and second semesters\n└── firstly in the 3rd sem,we might be separated from kçet students as we join late but nevertheless\nwe are combined together in the further semesters\n\nRegarding the placement, it is pooled so no discrimination in that either\n\nAnd we have the engineering maths 1,2 as our external subjeçt which we parallely learn with our main subjects in 3rd and 4th sem"
    },
    {
      "id": "k1v6byp",
      "body": "Rv"
    },
    {
      "id": "k1va7pb",
      "body": "i would choose rv ise any day brother , RV ISE is definitely better than PESU RR cse in my opinion.\n\nlet me try to justify myself.\n\nthe student quality has been severely diluted in PES RR campus owing to the sheer number of students in cse (somewhere around 900 if im not wrong). there was a time when pes rr campus was compared to BITS Pilani in terms of placements, now with the increase of seats by a drastic amount, the future does look kind of bleak. \n\nRV on the other hand hasnt increased the seats considerably , thereby maintaining the student quality since ages . dont miss out on the opportunity of joining RVCE , the college which is still compared to the likes of NITK.\n└── I'm sorry but when has rv EVER been compared to nitk? And pes compared to BITS?\n    └── Paper kabhi kabhar padha Karo Bhai"
    },
    {
      "id": "k1vemrg",
      "body": "RV Ise"
    },
    {
      "id": "k1y5729",
      "body": "Iiith"
    },
    {
      "id": "k1ynn07",
      "body": "Christ cse. Placements are good and wayyy too easy\n└── bro weren't u the one who was ranting about management has RAGI MUDDE in their brains\n\nLMAO\n    └── Just gotta put up with their shit for while. I'm seeing people who are so open-minded that their brains fell out get placed for 10-12 LPA."
    },
    {
      "id": "k1zod9f",
      "body": "If u prefer core cs, prefer pes rr or bmsce.\n If u prefer less competition for literally everything, choose bmsce.\n          \nIf u don't really mind taking ise, don't ever leave rvce.\n└── yeah but I have too many confusions\n\ncuz I saw somewhere that cs and ise is same\n\nbut I'm more skewed towards the placements\n\nWhichever gets me good placements make me haps\n    └── It's the same if u join pes or rv in that case. But beware of the humungous competition u will be having in pes.        \nGood luck !\n        └── there are just 75 students in ise rvce and the highest local package given was 62 lpa and avg is 18\n\nbut I'm thinking that will ise affect me from getting jobs in the future as people usually select cse core students\n            └── That is the reason why I selected cs core"
    },
    {
      "id": "k76vtxq",
      "body": "Yoyo \n\nIm dcet guy too, how did u do in dcet? \n\nAnd what have you decided?\n└── I'm writing dcet tomorrow \nWhich college you got and with which rank?\n    └── BMSCE AIML high 300's rank\n        └── Any last minute tips dude? Haven't even finished the syllabus"
    },
    {
      "id": "l974842",
      "body": "Which college you got???\n└── Rv\n    └── What was your rank ?"
    }
  ]
}