{
  "id": "16r4l2d",
  "title": "Best class lecture video to watch for each subject for 1st year cse students in pes both ec and rr. Campus",
  "content": "",
  "metadata": {
    "root_comment_id": "k236vmw",
    "post_id": "16r4l2d",
    "author": "Hour-Still2441",
    "url": "https://www.reddit.com/r/PESU/comments/16r4l2d/best_class_lecture_video_to_watch_for_each/",
    "permalink": "https://reddit.com/r/PESU/comments/16r4l2d/best_class_lecture_video_to_watch_for_each/",
    "score": 6,
    "upvote_ratio": 1,
    "created_utc": 1695579338,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "k236vmw",
      "body": "It's actually needed. It feels like people in the recorded videos on the academy website just read the contents of slides."
    },
    {
      "id": "k23e08m",
      "body": "For  chemistry and physics, there is almost no concept, just close your eyes and mug up\n\nElectrical and epd can be learnt from neso academy on YouTube\n\nMechanical and mechanics are again just mostly mugging up theory and in the latter it's mugging up the thought process to solve\n\nC and python are more fun to learn and i suggest you give maximum priority to these. You can get good content from Corey Schafer, neso academy and endless options on YouTube.\n\nMaths, i just took somebody's class notes at the end of each unit and try learning from it. Never really needed anything extra"
    },
    {
      "id": "k241yov",
      "body": "neso academy is GOD"
    },
    {
      "id": "k24c5uy",
      "body": "Honestly stick to Neso Academy for Electronics \n\nPython and C can be learnt directly from Youtube (just go through the topics in PESU academy and try to find them and learn)\n\nI recommend you pick up any language in your 1st year and start learning its fundamentals properly (Go for C imo as it also helps in your 2nd year)\n\nFor Maths don't rely on notes as much and try solving a lot of problems \n\nFor Mechanics try to solve problems from the textbook and Mechanical is just mugging up the slides  \n\nClasses can be important for Maths and C/Python and EPD others can be managed\n└── I should listen to class and what all concepts finished in class I should find it in neso academy and go through it or reading pesu slides and notes enough na\n    └── Only if you dont understand something look it up in neso academy \n\nif you understood it try solving problems on it to kinda solidify the topic\n        └── Pes will not provide questions to practice\n            └── There are Assignment and Question Bank questions for you to practice\n\nSome teachers also give you assignments and homework problems\n\nyou can try solving them"
    }
  ]
}