{
  "id": "16slta5",
  "title": "Switching to Mech",
  "content": "Hi, currently a Y1S1 student in the RR campus and as of now my branch is ECE. But I'd like to switch to mech at the end of the year. I did talk to a professor about this and he said it shouldn't be too much of an issue, but I would like to confirm this with the folks here.\n\nI know switching \"up\" to something like CSE requires an egregiously high cgpa and all of that, but what is the scene for those of us switching \"down\"? Help and/or input from anyone who has done this sort of thing before or has any information about this at all would be immensely helpful.\n\nCheers!",
  "metadata": {
    "root_comment_id": "k29t1b4",
    "post_id": "16slta5",
    "author": "ProfessionalBit7089",
    "url": "https://www.reddit.com/r/PESU/comments/16slta5/switching_to_mech/",
    "permalink": "https://reddit.com/r/PESU/comments/16slta5/switching_to_mech/",
    "score": 8,
    "upvote_ratio": 1,
    "created_utc": 1695729397,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "k29t1b4",
      "body": "Get above 6.75\n\nThat's all you need to be eligible for branch change. And mech wouldn't be a problem ig\n\nJust seriously think about it for the entire year because it might not be what you want. Course wise and future prospects wise\n└── Thank you so much!\n\nI will think about it over the course of the year but I am strongly leaning towards it atm, it just interests me way more. I do not care about placements or anything of that sort.\n    └── I guess if you like it after the first year, go for it. But be very very sure you're actually interested"
    },
    {
      "id": "k2a56kj",
      "body": "wit why do you wanna take up mech tho?"
    },
    {
      "id": "k2akghj",
      "body": "Not an issue at all.. I \"downgraded\" (thats what some say) to ECE from CSE\n\nChose your Branch wisely.. coz will either love it or repent it"
    },
    {
      "id": "k2b76j0",
      "body": "Welcome to the Mech Gang 😎"
    },
    {
      "id": "k2bg2j7",
      "body": "I think it basically depends on the seats available in mech during the branch change process. How it worked for our batch is, they started going in descending order of GPA asking students which branch they want to change to, based on the seats available in the branch at the time. The count is updated accordingly. Students with higher gpa are just asked first, but yeah changing to mech probably wouldn’t be that much of an issue"
    }
  ]
}