{
  "id": "16tc1jv",
  "title": "Sem 3 ISAs",
  "content": "Is it just me or do people feel the first set for the first 3 isas are much tougher compared to set 2? If this is true will they normalise marks?",
  "metadata": {
    "root_comment_id": "k2ee1fj",
    "post_id": "16tc1jv",
    "author": "Previous_Locksmith_1",
    "url": "https://www.reddit.com/r/PESU/comments/16tc1jv/sem_3_isas/",
    "permalink": "https://reddit.com/r/PESU/comments/16tc1jv/sem_3_isas/",
    "score": 10,
    "upvote_ratio": 1,
    "created_utc": 1695792895,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "k2ee1fj",
      "body": "I didn't see the second set so i don't know. Are you sure it's actually easier or are they just the same questions. \n\nBecause in first year all the questions were almost identical but with a value change or something like that \n\nBut i think there's no normalisation or anything\n└── It's rather that set 1 questions are more obscure and things that u wud only get with deeper study of the material where as the other one was basic syntax or things u wud find in the first few pages."
    },
    {
      "id": "k2ejw9l",
      "body": "I personally felt the same after talking to a few friends\nI do not think they have normalisation and they willl not implement it either. \nHopefully next time it is designed to be of similar difficulty levels"
    },
    {
      "id": "k2ey315",
      "body": "You're not alone, even I noticed this thing! DDCO's ISA was very different for 8-9am batch and 9-10am batch.. 9-10am batch's 4 markers were standard questions.. Whereas what we(8-9am batch) got was very different.   \nI talked about this issue with my mentor and she said that I should mail this to the examination department. I think we all should raise an appeal or else it'll continue to be unfair.\n└── I think some more people from 8-9am batch should mail them. If I do it alone then I don't think there will be any changes."
    },
    {
      "id": "k2fclm2",
      "body": "The DSA 4 markers for 8am to 9 am was leetcode level whereas they asked basic functions for the second batch"
    },
    {
      "id": "k2knnn0",
      "body": "We had the same issue with DDCO last year, CRs complained and finally they made it one set (we used to have whole batch exam at same timeslot). Idk why they went back to this."
    }
  ]
}