{
  "id": "16v6z26",
  "title": "Which year in college is the most fun?",
  "content": "How much free time will a cse student have from the 1st year to the 4th year\n\nCan you describe how each of your year went for you and how much fun you did or how much you had to study?",
  "metadata": {
    "root_comment_id": "k2pcvm8",
    "post_id": "16v6z26",
    "author": "Livid_Try_7735",
    "url": "https://www.reddit.com/r/PESU/comments/16v6z26/which_year_in_college_is_the_most_fun/",
    "permalink": "https://reddit.com/r/PESU/comments/16v6z26/which_year_in_college_is_the_most_fun/",
    "score": 16,
    "upvote_ratio": 1,
    "created_utc": 1695979918,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "k2phpns",
      "body": "First year is the least hectic,v comparatively"
    },
    {
      "id": "k2pjlbv",
      "body": "first year => lots of free time"
    },
    {
      "id": "k2pnlnl",
      "body": "1st and 4th\n\n1st year.. loads of free time, new ppl, fun.\n\n4th year.. desperate to leave clg"
    },
    {
      "id": "k2pw53x",
      "body": "Only 2nd year was hectic for me."
    },
    {
      "id": "k2qmad0",
      "body": "2nd year was the best for me, lots of parties and fun. + best performing year, 5 ISA was GOAT. Study for 1-2 hrs and get 17-18 out of 20. Lots of trips also i went, Goa and Pondi both done. \n\n1st year was actually not that intresting. Just bunk everyday and play football.\n\n3rd year most hectic, no football and outing till now. Busy studying and internship prep."
    },
    {
      "id": "k2qt9dr",
      "body": "First year is the most chill fking use to bunk almost all the time and go out with friends"
    },
    {
      "id": "k2tvc51",
      "body": "For me it was 4th year . Hardly went to college . Hooked up a lot"
    },
    {
      "id": "k2ua6e1",
      "body": "4th year definitely. Once I was placed, didn't have to worry about anything. Barely went to class, most classes were easy anyway, so managed to get decent grades.  \nIn the 1st year, you will have a lot of time, but probably won't have a lot of close friends or a girlfriend or won't be old enough to drink etc.\n└── how much free time did u get during ur 2nd or 3rd year to have fun? assuming that u had work harder and internships etc\n    └── Well, it  definitely depends on person to person and how you can manage time. But in terms of going out i would say not more than weekends. The exams, assignments, internships come very quick and there isn’t much time honestly. All this is obviously if you are trying to maintain good grades. If you don’t care about grades then you can have all the fun you want."
    }
  ]
}