{
  "id": "16vz1w7",
  "title": "Excuse shown to Attendance criteria",
  "content": "How strict is the Attendance criteria in PES EC campus. Is it lenient or is it enforced rigorously. Will a little amount of attendance shortage be waivered off?",
  "metadata": {
    "root_comment_id": "k2u93la",
    "post_id": "16vz1w7",
    "author": "Ariiii_10",
    "url": "https://www.reddit.com/r/PESU/comments/16vz1w7/excuse_shown_to_attendance_criteria/",
    "permalink": "https://reddit.com/r/PESU/comments/16vz1w7/excuse_shown_to_attendance_criteria/",
    "score": 8,
    "upvote_ratio": 1,
    "created_utc": 1696053608,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "k2u93la",
      "body": "I'm waiting for seniors to answer. My chem lab attendance is 67% and I can't get it over 85 before isa ༎ຶ⁠‿⁠༎ຶ\n└── Attendance is not considered for giving isas. Try to maintain 80% by the end of the semester, though they are quite lenient regarding attendance in 1st sem\n    ├── What if you don't have any medical certificate?\n    │   └── It's still chill. I think they call ur parents and would cover for ur attendance  by taking extra classes in the last preparaion week before esas.eventually they too let u write the esa .\nI am in 2nd year and didn't see any of my friends/ classmates getting barred from writing esa due to attendance shortage in 1st year.\n    │       └── Adding to this: they're usually a little relaxed towards first years or if you're attendance is only a little below the cutoff. If the cutoff is 80% and you have <70%, then it's an issue.\n    └── Thank you so much for replying !\nI thought I was gonna miss ISA.."
    },
    {
      "id": "k3ambta",
      "body": "sometimes they have asked people to submit affidavit (bond paper) stating u wont get less attendance from next sem.\n\nthis is what one of my friends had to do, but he had a genuine reason so maintain above the cutoff  so u dont have to roam around 100 offices to get ur work done during esa ."
    },
    {
      "id": "k3v5mps",
      "body": "near hosa road there is doctor who gives medical certificate for  100 rs , take that in case of emergency , teachers accept that ."
    }
  ]
}