{
  "id": "16w2cs3",
  "title": "How much time is gone in internships during 3rd year for a cse student? Do we get time to study for exams while also having internships to do?",
  "content": "",
  "metadata": {
    "root_comment_id": "k2y9m5l",
    "post_id": "16w2cs3",
    "author": "Livid_Try_7735",
    "url": "https://www.reddit.com/r/PESU/comments/16w2cs3/how_much_time_is_gone_in_internships_during_3rd/",
    "permalink": "https://reddit.com/r/PESU/comments/16w2cs3/how_much_time_is_gone_in_internships_during_3rd/",
    "score": 10,
    "upvote_ratio": 1,
    "created_utc": 1696065874,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "k2y9m5l",
      "body": "You don't have to do internships in your 3rd year. You are discouraged from doing so. You are allowed to do one in the summer vacation between 3rd and 4th year. \n\nIn the 4th year, 7th semester is mainly placements and capstone project and 2-3 subjects. If you are CSE then all subjects are online. \nIn the 8th semester you can do an interview throughout or take a few subjects."
    },
    {
      "id": "k2yzte2",
      "body": "You can do an internship externally if you want in 3rd year, though it's not compulsory or encouraged. It's better if you do tho, as long as you think you have enough time to study. You can do an internship in 4th year for credits and that time is given just for internships and your final year project. Look for internships that make you work around 20-25 hrs a week and it should be fine\n└── If u work during the semester we were told we won't get credits for it right? I know we can get credits if we work during the summer.\n    └── Yea you can't claim credits for the internships you do during the semester. Talk to your HoD once about the summer internships. In ECE, only a few approved courses and internships are given credits. I'm not sure how it works in CS\n        └── In CS they told us if we work in summer between 6th and 7th we were pretty much guaranteed to get credits."
    }
  ]
}