{
  "id": "16xyen1",
  "title": "ECE PLACEMENTS",
  "content": "hey can any senior tell me about what was the avg an highest ctc  for an ece graduate ...\n\nlike are there good placements for ece branh or is it only cse ppl that end up with good placements? Is it true that ECE students dont get offers more than 10 lac?\n\nIs the ECE placements so bad they dont release anything abt it? pls do respond if anyone knows ... I would be really thankful ,there is no information on the net abt how pes ece placemets are it gives me anxiety",
  "metadata": {
    "root_comment_id": "k3884og",
    "post_id": "16xyen1",
    "author": "MutedBookkeeper780",
    "url": "https://www.reddit.com/r/PESU/comments/16xyen1/ece_placements/",
    "permalink": "https://reddit.com/r/PESU/comments/16xyen1/ece_placements/",
    "score": 14,
    "upvote_ratio": 0.949999988079071,
    "created_utc": 1696257539,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "k3884og",
      "body": "Eagerly awaiting a first hand response"
    },
    {
      "id": "k389hqw",
      "body": "Most students in ECE end up sitting for IT companies and thus get counted as part of CS placements. There is a very small fraction of ECE students who sit for core companies for ECE, and their placement stats aren't very high. Quite a few also decide to pursue Masters.\n└── oh then do ece students also get tier 1 jobs?\n    └── yes...they do.. in my batch(2023 passout)..there were ppl placed in 15 lpa + also..so work on your skills and keep good cgpa..this will help you stay ahead of others..don't give up..\n        └── thank you!!"
    },
    {
      "id": "k39g8x8",
      "body": "I’m an ECE student who passed out recently. As mentioned, most ece students sit for IT companies itself. In my experience, *most* companies allow ECE students to sit and that isn’t directly seen as a negative by them either. But obviously you have to work harder to prove you have the same skill set that a CS student who’s taken the relevant courses for 4 years has and you’ll see ECE students get placed a little later than CS students as well. \nBut ofc there are few companies who understandably give preference to CS kids.\nMany many ECE students also get placed in companies like PwC and Deloitte.\nTbh, only a handful of core ECE companies visit. But I know people who were sure that’s what they wanted to pursue and landed jobs in Samsung, Microchip, Mathworks, etc.\n└── >oh then do ece students also get tier 1 jobs? like what fraction of students inec end up with tier 1 jobs?\n    ├──  work on dsa ...u will definitely crack tier-1 companies and keep good cgpa..as many filter out based on this.\n    │   └── >dsa\n\nthank you!\n    └── Yeah they do. As I said, most companies don’t really seem to differentiate between ec and cs students as such. So it’s kinda upto you to be prepared enough able to make yourself get through the coding and interview rounds to land the job.\nMost tier 1 jobs are software related though. \nSamsung and Mathworks are 2 that I remember that hired for hardware/ece focused roles and were tier 1 with CTCs of 20 lpa+ I think"
    },
    {
      "id": "k6jqn2r",
      "body": "Glad to see this sub is active, was trash when we started it.  Better late than never to this comment section.\n\n&#x200B;\n\nIts probably true that the Batch's typical CTC \\~9LPA. This is at-least what college projects it to be. We have to discount two groups of ppl, one who go for masters and the other who get off campus jobs. Both categories don't contribute to this average. So don't let that be your only yardline. \n\nThis is a list of companies that had turned up for the 2022 ECE batch with a 1Year normalised CTC and offered 20+LPA . (normalised : 40LPA of stock over 4 years is only 10, dumbass HRs and Placement Cell want big numbers to market easily)\n\n/\\* Not exhaustive, just easily gatherable data from our mails, few outliers since i was biased to do HW and not SW; and let them be just in case anyone was interested.\n\nAD - 20  \nSlice - 23  \nZoom - 25  \nNvidia - 24  \nMentor graphics - 16  \nCure.fit - 29.5  \nWalmart - 23  \nVisa - 27  \nClumio - 23 + 2k stocks  \nGoldman sachs - 23  \nCouchbase - 31  \nGameskraft - 32  \nPalo Alto - 29.25  \nNxp -  17.5  \nSamsung - 25  \nAnsys - 23  \nEdgeQ - 22.5\n\n&#x200B;\n\nDont dwell too long on these numbers, it wont do anyone any good. But lets analyse nevertheless. So clearly SW pays more. No doubt about it. But mind you this isnt some Tier 1 Clg. HW/Core engineers are always preferred from Tier-1. Without going into the weeds HW clearly does offer good compensation and far beyond the average. This is again for only perhaps \\~10ppl in a batch. \n\nIndustrious ones will get higher compensation(in their own metrics if not monetary) off campus which which is again off the charts. Just hope this raises your spirits for the HW side. \n\nSure SW pays more initially but the pay curve will slowly tip towards the HW guys after the 3year mark.  \n\n&#x200B;\n\nPS : Alum here and using a burner cause I like my privacy sorry, not sorry. I wouldn't want another to go through the placement phase and have it be as hard. So heres my 2 cents."
    }
  ]
}