{
  "id": "175e895",
  "title": "Guys what should i do i have thought of these options",
  "content": "1.Join new horizon management quota cse 30 lakhs\n2.Study for jee next year i am not confident if getting anything \n3.give comedk/kcet/manipal next year\n4.report to pes mandya and suffer \n5.join bba next year in college like sjcc christ",
  "metadata": {
    "root_comment_id": "k4f28qz",
    "post_id": "175e895",
    "author": "biggestsuicidalidiot",
    "url": "https://www.reddit.com/r/PESU/comments/175e895/guys_what_should_i_do_i_have_thought_of_these/",
    "permalink": "https://reddit.com/r/PESU/comments/175e895/guys_what_should_i_do_i_have_thought_of_these/",
    "score": 5,
    "upvote_ratio": 0.7799999713897705,
    "created_utc": 1697031478,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "k4f28qz",
      "body": "Give bitsat next year. Best option"
    },
    {
      "id": "k4f3fdc",
      "body": "Take a drop and study really hard.\n\nSkip hard jee questions and focus on neet/bitsat level questions. Don't waste your time\n\nWrite private exams like pessat, met and everything else you can think of\n└── Does bots have four year csr courses anymore i dont want to waste rime in 5 year courses\n    └── They do\n\nBut let's be realistic here and not have outrageous expectations\n        └── What rank would i need for cs in bits goa/hyd 4 year degree \nLike in jee terms. I know nothinf about bits\n            └── bitsat gives only marks not rank, 290+ is the cutoff for cs\n\n its hard to correlate bitsat and jee as they have very different patterns, but to be on the safer side if you get 99+ percentile in jee and are good at english/LR, you should be able to get bits cs"
    },
    {
      "id": "k4fjdr8",
      "body": "Dude first and foremost resolve your kcet seat thing, if you don't report to college you'd be in turmoil. Once that is resolved I'd suggest taking a drop rather than bsc or management seat\n└── They don't care same thing happened to my friend last year"
    },
    {
      "id": "k4hdd5f",
      "body": "Aren't you able to get any admits for reasonable fees in other colleges?\n\n\nIf you're truly interested in CS any college is equal to top IITs in India. However like most people if you rely on the college to support you and hold your hand until you graduate you're better off in a nicer college.\n\nIf you're highly independent, motivated and capable of self study, go with literally any college and you'll be good unless the college forces you to underperform.\n\nIf you prefer safety and rely on college opportunities, rewrite JEE, BITSAT, etc."
    }
  ]
}