{
  "id": "176axz0",
  "title": "Capstone",
  "content": "What is the worst that could happen to a capstone project. Not publishing a paper will make us not eligible for a S grade is what I understand. And also I had heard someone say that C is the min grade in capstone. Is that true?",
  "metadata": {
    "root_comment_id": "k4ns9a6",
    "post_id": "176axz0",
    "author": "Top_Sentence2130",
    "url": "https://www.reddit.com/r/PESU/comments/176axz0/capstone/",
    "permalink": "https://reddit.com/r/PESU/comments/176axz0/capstone/",
    "score": 9,
    "upvote_ratio": 0.8500000238418579,
    "created_utc": 1697127779,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "k4ns9a6",
      "body": "Capstone spans across 6th, 7th and 8th semester and is divided into Capstone Phase 1, 2 and 3 and graded individually. The grade for publishing your work is only for the 3rd phase and is worth 2 credits. Worst case, you don't publish and end with a default grade of C in phase 3, best case you get an S. Either way, since it's 2 credits only, it barely affects your GPA.\n└── What about A and B grade?\n    └── Didn't get your question. I'm assuming you already know how credits work here. Ofc getting a higher grade will result in a higher GPA."
    },
    {
      "id": "k4o9g46",
      "body": "I didn't publish a paper, got A in both phase 1 and 2.\n└── What do you think is the reason your paper did not get published?\n    └── I didn't submit it??\n\nWhen I started out project our idea was innovative, but by the time we completed there were 100 other papers on the same topic (online exams and stuff cos of Covid). \n\nOur guide told us it's okay, I've seen your effort so you don't have to write a paper."
    },
    {
      "id": "k4pamrd",
      "body": "No matter what you do do NOT take Ashwini Joshi as a guide in CS.. she is utterly horrible  to work under and will constantly threaten to quit as a guide, not have guide meetings and will in short make your life extremely difficult.\n└── u/rowlet-owl :ha:\n    └── ![gif](giphy|HFcBHO2f9KDM9OkZW7)"
    }
  ]
}