{
  "id": "176b29x",
  "title": "Best books to study for Karnataka cet ?",
  "content": "Hello there. I'm currently studying for Kcet 2024 , i hope to get within 10k ranking so that I might join PES in B.E biotechnology and am confused as to which books to buy. Every site and quora answer lists different books for physics , chemistry and maths. As such , which books did u guys study to get good rank in Kcet ? \n\nAlso can you give me study advice or any other information that may be helpful to me. For example, good coaching centres near nagarabhavi-vijayanagar area ? \n\nPls help me.\n\n Thank you.",
  "metadata": {
    "root_comment_id": "k4l2n0y",
    "post_id": "176b29x",
    "author": "mistborn_feruchemist",
    "url": "https://www.reddit.com/r/PESU/comments/176b29x/best_books_to_study_for_karnataka_cet/",
    "permalink": "https://reddit.com/r/PESU/comments/176b29x/best_books_to_study_for_karnataka_cet/",
    "score": 6,
    "upvote_ratio": 0.75,
    "created_utc": 1697128083,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "k4l2n0y",
      "body": "why do you want PES BT ? , PES is only famous for cse brother , for non CS branches its not that great as fasr as ive heard\n└── But it's a good institution and closeby to my home\n    └── If you're going for courses like bio tech, rv,bms is the best\n        ├── Isn't pes good for biotech ? Also nah i hate programming. So miss me with that cs shit. Oh btech eh ? Ok what exactly is the difference between btech and be ,m?\n        │   ├── No difference between btech and be(like 99% same)\nAnd since rv or bms is the top college, and given you're going to BT why not choose it over pes. It has better placement stats ( if that's your main aim) than pes\n        │   │   └── Nah I'm gonna do masters abroad\n        │   │       └── RV would do good, assuming you need a 'brand' college which may help you in your masters\n        │   │           └── I c. I guess rv is more brand-y than pes\n        │   ├── Be is just the old name.. Both are the same\n        │   │   ├── I c\n        │   │   └── Happy cake day\n        │   │       └── Wow thanks :)\n        │   ├── I'm a first year biotech student and I hate to break this to you but, you're still gonna have to do programming during the first year because it is common across all branches of b.tech...\nAlso I suggest you meet with the biotech HOD to understand exactly what you're signing up for :)\n        │   │   └── Basic programming is fine . It's complicated programming that breaks my mind. Also you r from pesu I assume ? Where and how can I meet the hod ?\n        │   │       └── Yes I am, I suggest you just give a call to the college and ask them if it's possible to book a slot with the hod of the biotech department...\n        │   └── Btech is for universities which offer engineering degree\nBe is for regular engineering colleges which aren't classified as universities .\n\nThere's no fundamental difference between the two degrees , but just the way in which you get these two degrees is what essentially differentiates them .\n        └── >Also aim for rv cs man why TF do you want pes while you can still get better\n\nLol do you have any idea of what the cutoff is"
    },
    {
      "id": "k4lab5c",
      "body": "I've currently taken biotech in bms through cet this year. Don't go to pesu for biotech pls. Rv or bms is better.\n└── I c. So it's good in bms and in rv . What about msrit ?\n    └── MSRIT student here it's good also here for BT Placement wise msrit is on par with bmsce ppl choose bms as it's more convenient for them to travel. But overall I would say aim for rvce bt if not bms or msrit any one of em will do pes I really dts u need to join for BT ESPECIALLY\n        └── Thank you\n            └── Tips I can give is do ur pu properly and solve all kcet pyqs as many as possible. Try doing jee papers also if possible. But the main reference books should be ncert especially for Chem. Math use GK Ranganath and physics exemplar and master the ncert should do\n                └── Thank you"
    },
    {
      "id": "k4lhsyn",
      "body": "Ncert and previous year papers should be sufficient. You can pick up any coaching material if required. Time management is very important and remember to give full syllabus mocks as many as possible."
    },
    {
      "id": "k4lnlc2",
      "body": "Get them pu marks high, idk if its 50-50 or no, if it is, do that."
    },
    {
      "id": "k4oxy4k",
      "body": "First book preference should be NCERT."
    }
  ]
}