{
  "id": "176wxys",
  "title": "College Selection u/wonderwhat7768",
  "content": "Guys I dint attend pessat round 1 (rank 698) counselling(bitsat was on the next day), 2nd round I dint get a seat in rr cs(only 21 seats were left), (also left manipal cce waiting for rr cs) So I had joined cat 2 cse in vit chennai. Once I got pes ec campus c",
  "metadata": {
    "root_comment_id": "k4p494u",
    "post_id": "176wxys",
    "author": "wonderwhat7768",
    "url": "https://www.reddit.com/r/PESU/comments/176wxys/college_selection_uwonderwhat7768/",
    "permalink": "https://reddit.com/r/PESU/comments/176wxys/college_selection_uwonderwhat7768/",
    "score": 10,
    "upvote_ratio": 1,
    "created_utc": 1697197921,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "k4p494u",
      "body": "In my opinion you made the correct decision.\n\n\nChill out and relax. First year is really not very hard. Maybe a little since you joined late, but second sem will be much more chill for sure. Studying a week or two before isa is more than enough to get a reasonable gpa. \n\nFor now I recommend you just grind till you're up to speed and then it's smooth sailing hopefully\n├── Thanks for your reply ,its just that it feels like a school for now the timings are tight and course feels hard btw are u a senior?\n│   └── Yeah not much we can do, it does feel like a school.\n\nI promise the course being hard is because you're on a fast track to catch up with everyone. Trust me, it gets better and much easier\n\nYeah I'm in second year\n│       └── Oh that's a relief\nAlso how good really are the cs placements?\nAre pes bloating their stats , cud you give sm approx number?(coz the grind in clg shud b worth it ri8)\n│           └── pretty good placements for cse..avg was  more than 10lpa(in my batch)..imo u can sit for most of companies ..in fact a lot of tech companies come to the college..so don't worry placements right now and so much..for now just keep focusing on college studies..and keep a good cgpa(it's going to help you get shortlisted in many companies) and do some projects (if u have time) and upload it on github and start learning and practicing dsa..these things are going to give u an edge over others during placements.I suggest you to ask  seniors from cse branch in this sub(like u/rowlet-owl) who are currently working (and have passed out from this college) they can give u valuable insights.Wishing you all the best!\n│               └── Pes claims to have 17lpa avg broo so it's bloated ri8\n│                   └── It definitely is bloated a little, but not by much. For example, here are the stats for 2024 batch: https://docs.google.com/spreadsheets/d/1YZ7HtUcvA9jqWZ04DuwTT66aTV7gU7DUlXyO2BewpII\n└── Bro there is a week and half left for isas to start ,can you please tell me what I should study . I'm in phy cycle and i have literally no idea what I should study.\n    └── I read only slides in all subjects and got 9+\n\nIn physics, don't read the normal slides read fiasal's slides. And do the questions in them\n\nAnd in math take the class notes from someone who writes and study from it\n\nElectrical, solve questions in slides. Most will be very easy. There might be a rare question from question bank so do it if you have extra time\n\nMech is just plain mug up. Sit down with some coffee and mug up for like a day continuously. It's enough for an isa\n\nI don't think i should be telling anyone how to do python\n        └── \nThanks bro helps a lot."
    },
    {
      "id": "k4p4lsu",
      "body": "Vit is no different, it's even more crowded with similar level of academic rigour. Placements wise you will be receiving similar opportunities depends on how you convert them.\n└── I think so but for the 40 days I had been in vit , the course toughness and length felt easier then pes \nThough the teachers and academic system was not good due to which I thought pes is better\n    └── 40 days is too less to judge. The marking scheme is crap in VIT(they have relative grading wrt your class), it's fucked if your class is full of nerds .\n        └── Yeah makes sense so even you would have preffered pes over vit ri8?\n            └── Anyday, nothing can beat Bengaluru.\n                └── Pes over manipal too?\nDoes bangalore factor actually help in placement time?\n                    ├── Yeah\n                    └── I had chosen pes over manipal mainly because of the fees. Yes, blr factor does play a part in placement.\n                        └── Oh okayy\nSo ur preference was\nManipal>pes>vit\n                            └── It was pes>manipal>vit for me.\n                                └── Without the fee factor"
    },
    {
      "id": "k4p8u1e",
      "body": "What part of PES are you finding very hectic?\n└── The toughness and length of syllabus(I felt it's much more harder then vit)but mainly the timings .\nIt's really hard to attend from 8-4 continuously everyday\n    ├── Syllabus eases out after 1st year if you're choosing CS. College ends at 4? Was 3/3:30 when I graduated. \n\nIn 2nd and 3rd year it would end by lunch on a few days because we had lesser subjects (cos we had extra credits in 1st year, don't know how it's now). \n\nBut still, once you start working, it'll be from 9 to 5 or 10 to 7 in most companies. Then you'll miss the peaceful college life. Have fun while you can.\n    │   ├── Oh no actual timings for earlier batches are upto 1pm on 2 days and 3 15 on 3 days\nSince I'm in last batch timings are 8-4 everyday\nHow many credits did you guys have in 1st sem\nAlso I heard it gets harder after each year\nYour saying it gets easier\n    │   └── I don't know which batch you graduated from, but PES has changed drastically in the past 2 years. Some people have class till 4, there's more content to cover per ISA, labs have been integrated into almost all theory courses, summer courses need to be taken to cover up credits etc. Basically, yes things seem a little more stressful right now\n    └── I think only the kcet classes have 8-4 because of them being almost 3-4 weeks behind than the pessat classes and you could slide to RR campus in sliding round if you want to pay pessat fees (sliding round is on rn)"
    },
    {
      "id": "k4pdh0v",
      "body": "Why tf u left mit cce for a mere pes ec?\n└── Ik people who have done that\nThough Idk if it was right choice\nAt that point, I felt placements are same in pes and mit,and 1 of my bangalore friend did the same and advised me to do it\nAs cse core>cce\n    └── Who tf said placements are same in mit and pes? mit placements are better than pes \nAnd if u wanted cse only, u would have got cse core at mit blr.\n        └── Hmm avg cs stats for pes is shown 17.99(verified by seniors)\nMit manipal cce(16.5 verified by seniors)\nDo u have any reliable data or source which proves what you commented\n            └── They themselves dont reveal their avg stats on their website. So how can someone trust a mere senior? Do you have any reliable stats provided by the univ itself where the actual stats are written? \n\nAnyways, average stats are always inflated. Try checking their median stats,which will definitely be lower than that of mit.\n                └── There is an excel sheet and image display at the time of counselling which stated that \nLater on pes seniors in the group said avg around 16-17\nMedian around 11-12 when photo was posted\nBtw which college are you from??( Pes manipal or some other college)\n                    └── But no avg/median stats where written in placement orientation pdf. If their placements were such good,why didn't they mentioned their avg/median stats in placement stats pdf?\n\nOther\n                        └── Your college name?\n                            └── T3 ( wouldn't prefer mentioning)"
    },
    {
      "id": "k4poc3l",
      "body": "Bro I am also in pes ec campus are you in hostel\n└── Yes your name,room?\n    └── What's your name and room no bro"
    },
    {
      "id": "k4q3gk8",
      "body": "I joined from extended round too (rr campus) and yes classes being till 4:00 does feel hectic and school like and also professors giving you homework sums is also school like. But my friends from kcet round 1 and 2 and pessat are chilling. The syllabus is moderately difficult, you just have to give it some time and actually study when ISA gets closer and you'll be fine. The others only have classes till 1:00, 2:30 or 3:15 and it'll be the same with us once we cover up the portions. Just hang on till we get through this phase\n└── Yeahh hopefully it get less hectic"
    },
    {
      "id": "k4t69yk",
      "body": "PES RR CS > Manipal> Vit , i got CSE in all 3 colleges. Trust me PES is the best choice the crowd is really good. PES has the best seniors and opportunities. I am in 3rd year , i already got an internship 80k+ per month + 1 Research paper released . I have friends in IITs, they still didnt get internship offer. I would say bangalore played a major role in my internship offer. Also this research paper publication you dont find in any other college, only in PES people are regularly trying to write paper and publish. \n\nMy only advice is work hard PES is a good college, try to be the topper/best student of your batch. You will get the best MS colleges (like CMU etc) or best placements. Grind hard and dont think about the past. (I was also very sad i didnt get IIT after 12th , i gave up on studies but i got my confidence back) Dont think PES is a bad colleges thats all , if you work hard you will get good results.\n└── Thanks a lot for the detailed reply bro\nDoes this hold true for ec campus too??\n    └── Personally i dont know, like i have never gone to EC campus. But i would say RR campus things are much better. Like the teachers , senior and crowd i feel is much better in RR. We also have multiple Research labs, i am working for 2 labs and i feel they are amazing. So you are currently 1st year, so campus change opportunity you have, i feel you should try for that. Its 100% worth it.\n\nAt last i dont know anything EC, so cant comment on that.\n        └── Ohh even I feel that Ig I will try for campus change \nBut I think 9.5+ gpa would be required\n            └── Yes, cutoff is high but give it a go"
    }
  ]
}