{
  "id": "17j6okw",
  "title": "Do we have relative grading?",
  "content": "I heard from some seniors that we have relative grading, is it true?",
  "metadata": {
    "root_comment_id": "k6yz0t4",
    "post_id": "17j6okw",
    "author": "Meghanaa__v",
    "url": "https://www.reddit.com/r/PESU/comments/17j6okw/do_we_have_relative_grading/",
    "permalink": "https://reddit.com/r/PESU/comments/17j6okw/do_we_have_relative_grading/",
    "score": 7,
    "upvote_ratio": 0.8999999761581421,
    "created_utc": 1698597119,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "k6yz0t4",
      "body": "firstly , there is no relative grading in ISA's for the umpteenth time for gods sake .\n\nrelative grading is only for ESA's and that too if the entireity of the batch does not do well.\n\nsecondly , as far as i know , the 2026 batch (us) did not have relative grading in the first year so just sit tight and study .\n├── I mean, not really. All of the components factor into your final grade, and if the scores are on the lower side, the course is relatively graded. None of it is transparent, but if the whole batch screws the isa's, both of them, it's very possible.\n│   └── Addressing both these comments: No, there is no \"relative\" grading. There is a bit of grade shifting that happens at most. Check the CGPA post in FAQs: https://bit.ly/pesu-faq\n├── 2026 batch 2nd sem phys cycle had for mechanical, physics and math\n└── Your answer is partly correct, but the other half is wrong, we had relative for both sems.. (few subjects like Python, C, Maths 1&2 )"
    },
    {
      "id": "k6z2dts",
      "body": "Nope, there is no relative grading at PESU. However, there are instances where the grade requirements can shift. I've discussed it in detail [here](https://www.reddit.com/r/PESU/s/tCh61yRsIa)"
    },
    {
      "id": "k71sfo8",
      "body": "Happy cake day"
    },
    {
      "id": "k723w9x",
      "body": "No, either PES doesn't have relative grading or it doesn't make a difference because you usually get whatever grade you calculated. But it was different for us in 5th sem for some reason. We all got a higher grade than we were supposed to in all the subjects. Like I needed 104/100 in the ESA to get an S and I got the S even though I got 85 in the ESA. Similar things happened to my friends. Maybe that was because it was relative grading that one time or something else entirely I'm not sure. But in sem 1, the dycoe Sivasankari ma'am(who was our math teacher at the time) did tell us that ESA grading will be relative sometimes depending on how the batch performs"
    }
  ]
}