{
  "id": "17ly7ad",
  "title": "Placement stats (oct-30)",
  "content": "Source : Animesh giri(Ec campus placement co ordinator)",
  "metadata": {
    "root_comment_id": "k7hczpa",
    "post_id": "17ly7ad",
    "author": "Fun-Understanding862",
    "url": "https://i.redd.it/2mx04mte1wxb1.jpg",
    "permalink": "https://reddit.com/r/PESU/comments/17ly7ad/placement_stats_oct30/",
    "score": 114,
    "upvote_ratio": 0.9399999976158142,
    "created_utc": 1698910583,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "k7hczpa",
      "body": "This is for the 2024 batch right?\n└── Yes"
    },
    {
      "id": "k7heen1",
      "body": "Whys ec campus so dead💀"
    },
    {
      "id": "k7hfkr7",
      "body": "Anyone can get mtech stats?\n└── Would you look at that, all of the words in your comment are in alphabetical order.\n\nI have checked 1,830,822,549 comments, and only 346,161 of them were in alphabetical order."
    },
    {
      "id": "k7hkr4p",
      "body": "Is this valid information?? Because PES has good placements all the time\n└── This is 100% valid info , its sent by animesh giri , he teaches big data for 5th sem students and cn for 4th sem students and he is also the placement co ordinator for 2025 batch\n    └── Is this data including ppos? u/Fun-Understanding862\n        └── I asked one of my seniors, he said doreswamy showed 312 total T1 cse, in the stats provided here its given only 300. So i dont think so ppos are included in this.\n            └── okay So do you rate this a Good Placement Session\n                └── Given the  circumstances it can be called decent but in a normal market these are not quite good"
    },
    {
      "id": "k7hpem8",
      "body": "Seniors please give your insights \nIs this due to the recession or is it that the rest of the people could not meet the standards\n└── Recession..\nLast year it wasn't this dead\nEven though visiting companies might not have decreased but the intake per company might have decreased..\n    └── Number of companies have reduced too...Only around 55 T1 companies have come and even in that some 15 are performance based fte and from the remaining soema re yet to come...."
    },
    {
      "id": "k7i06x9",
      "body": "Prolly due to recession even tier 1 colleges are struggling"
    },
    {
      "id": "k7ib3fo",
      "body": "What's the distinction between T1/T2/T3? Not from PES\n└── T1: 12 and above lpa\n\nT2: between 6 and 12\n\nT3: is below 6\n    └── 300 T1 ain't too bad, right? Considering it's only been a few months.\n        └── PES usually reaches this number in late September or early October\n            └── Ah, fair enough. So, it's not too bad unless you're the bottom of the stack, right?\n                └── I mean yeah but stuff gets competitive when you are compeitng with 1000's of ppl unlike other colleges..so tensions are kinda high\n                    └── Understandable. You guys have CGPA based cut-offs? How many of the 300 have a 9+, you think?\n                        └── No idea abt that but i do know that there are a lot of 9 pointers left\n                            └── I've taken enough of your time already. Thank you for answering my queries! Best of luck!\n                                └── Haha np  :)"
    },
    {
      "id": "k7ib8xc",
      "body": "What is the range for t1, t2 and t3?\n└── T1: 12 and above lpa  \nT2: between 6 and 12  \nT3: is below 6"
    },
    {
      "id": "k7il3jx",
      "body": "wait so cs rr campus brags more t1 packages than ec right\n\nso rr campus is a good choice?\n└── RR is almost twice the strength so a candidate from RR IS twice more likely to be in the crowd and with almost all top pessat ranks, EC does surprisingly well in terms of numbers with whatever they have..\n    └── 639 isn't really twice of 501\n\nBut yeah don't worry about campus for placement opportunity both are same, depends only on the student"
    },
    {
      "id": "k7ioio2",
      "body": "I am a 2023 grad, what was the stats for us?"
    },
    {
      "id": "k7iv6mh",
      "body": "Isnt PESU tier 3? Whats is the median for cse and ece?\n└── Tier 2 last year cs avg 17 median 12\nThis year pretty below avg\n    └── Is it tough to get pesu, i mean is there any exam?\n        └── 4 l 80 k next year through pessat(their entrance exam) and through jee quota, and kcet fees if you get a decent rank in the exam which is usually around 1 l 20 k.\n            └── 4.8 lakhs is for one year right?..maybe it is similar to manipal/vit\n                └── Yes.. vit I can't say anyth but pes has way more intake of cs students and its like a rat race all over again."
    },
    {
      "id": "k7jbvns",
      "body": "Does that mean only about 1/3 of the students got placed?\n└── In T1 yes,but any tier means around half are placed..."
    },
    {
      "id": "k7lz28m",
      "body": "Why are there so many students now? In 2017, CSE batch sizes were around 240"
    },
    {
      "id": "k7m80fd",
      "body": "Is this trend for ECE placement common or happening for the first time??\nNot satisfied with ECE placement this year...😓\n└── ECE placements are generally always  inferior to CSE placements in almost any clg but this year has been particularly bad....\n    └── What is the reason?\nWhy placements are so bad for this year?\n        └── Market is bad...."
    },
    {
      "id": "k7mk8us",
      "body": "300 in T1 is good in this market, what else people are expecting\n└── Placement percentage is very low compared to other years...."
    },
    {
      "id": "k7nyfxo",
      "body": "Is this the worst Placement Session of PES\n└── It's pretty bad even compared to last year but given the circumstances its decent....\n    └── You are which Branch and which Year"
    },
    {
      "id": "k7o13km",
      "body": "Is this data True ??\n└── Add 44 further in T1(12 from ppos and 32 from a T1 company which hired 32 ppl en masse).Rest is true.\n    └── So total 344\n        └── yes"
    }
  ]
}