{
  "id": "17rehft",
  "title": "Scoring",
  "content": "so I thought in engineering we have got to do more stuff besides studies like projects and certifications but based on what I see in their exams, one can score well only if they dedicate a good amount of time to it, but that means I won't have time to do a lot of other stuff, so my question is am I not gonna get placed or miss out on good opportunities if my cgpa is around 8 to 9",
  "metadata": {
    "root_comment_id": "k8ilxei",
    "post_id": "17rehft",
    "author": "Meghanaa__v",
    "url": "https://www.reddit.com/r/PESU/comments/17rehft/scoring/",
    "permalink": "https://reddit.com/r/PESU/comments/17rehft/scoring/",
    "score": 13,
    "upvote_ratio": 0.8799999952316284,
    "created_utc": 1699541027,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "k8ilxei",
      "body": "Since when do companies care about CGPA dude. If you wanna get placed cgpa will just be a threshold.\n└── They do when they come to pes... First filter to to remove candidates is cgpa sadly"
    },
    {
      "id": "k8iqytv",
      "body": "I think this is answered before, but your CGPA is just used as a filter. Having a CGPA of 8.5+ is the best bet if you're in CS (although don't let that stop you from aiming for higher). \n\nYour projects, experiences, publications and other work that makes up your profile is what will matter. Once you clear the CGPA cutoffs to sit for companies, your skills and projects are the primary factors that will land you a job. It's a similar story for Masters, although you preferably also want a much higher CGPA since it's weighted more. \n\nSummary, don't spend all your time on your CGPA. Find a balance between the CGPA you want (an 8.7-9.2 for CS is the best possible thing you can achieve without sacrificing too much on either end) and your other activities. Good luck!\n└── I said the same thing got down voted 😭\n    └── Welcome to reddit"
    },
    {
      "id": "k8m7wgo",
      "body": "CGPA is not the only thing that matters! (Assuming CS) 8+ is more than enough and 8.5+ is literally the highest 99.9% of companies might ask. \n\n\nDon't forget people care more about what you know and what you've done, especially how u can market yourself, than gpa. Extra curricular activities are also important!"
    }
  ]
}