{
  "id": "186m2xe",
  "title": "4th Sem (Cse)",
  "content": "Is 4th sem (CSE) easier ? Is it more theory based? How should we study to get 9.8cgpa \nSince the first 3sems have gone very bad I need to score very well in the next three sems \nWhat do we have in 4th sem ( subjects )",
  "metadata": {
    "root_comment_id": "kb8thm0",
    "post_id": "186m2xe",
    "author": "Frequent_Umpire8571",
    "url": "https://www.reddit.com/r/PESU/comments/186m2xe/4th_sem_cse/",
    "permalink": "https://reddit.com/r/PESU/comments/186m2xe/4th_sem_cse/",
    "score": 1,
    "upvote_ratio": 1,
    "created_utc": 1701252537,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "kb8thm0",
      "body": "The difficulty level is almost like 3rd sem only. There is considerable amount of theory. It really depends on whether you like the subjects.  This sem will have algorithms, computer networks and operating systems(all have lot of theory) which are important from placements point of view. Microprocessors and linear algebra are the other subjects. \nSo it is kind of difficult especially theory-wise, but mostly everyone in our year scored better in 4th sem than 3rd sem.\n├── If it is more of theory then it means that it's just rattofying one day before the exam right so it must be easier to score na ?\n│   └── According to my experience, there was a lot of syllabus to mug up the day before the exam so I couldn't finish the syllabus lol (especially for cn and os)\nBut then again this is just my personal experience and I hate most of the subjects in 2nd year\nSo if you're interested in those subjects it'll be easier for you\n│       └── Ahh maybe I'll start studying a lil earlier alsooo what about the relative grading and moderation in 3rd and 4th sem \nMy brother had 34-36 in internals but he got 9.8 sgpa (S in almost all subjects) how did that happen ??\n│           ├── wait how tf is that even possible lol , check again whether he had 34-36 or 44-46 lol\n│           │   └── Checked he had 34,36, 37 etc\n│           └── Maybe he did reallyy well in the ESA\nSince that is 50% of the final grade it obviously matters a lot\n\nDon't really depend on relative grading and moderation, because it was never confirmed when there was relative grading and when it was not.\nWhenever the ESA was very difficult, people used to say it has relative grading.\n└── i thought DAA was supposed to be more of a coding subject  with all the algorithms and stuff . Approximately how much of it is theory and what portion of it is implementation ?\n    └── DAA is essentially a coding subject, like you're supposed to know which algorithm to apply in which question. But there were soo many algorithms. I liked the subject even though I found it a little difficult. I would say there is some 30% theory and rest is concepts which you need to understand really well.\nOur teacher didnt teach properly from 2nd half(which is more complicated lol), so we had to manage using YouTube only"
    },
    {
      "id": "kb985ik",
      "body": "Mugging up in 4th sem is extremely difficult. Try your best to understand in class and don't leave things to the last day, especially for sem 4. \n\nSem 5 and 6 are generally easier to score.\n└── Which subjects do we have and can you tell more about the subjects where to study from and difficulty levels\n    └── One important thing: syllabus and the actual subjects might have changed!!!\n\nDAA: design and analysis of algorithms: Listen to class and search online for vids. Slides were semi terrible. Practice will help a lot. \n\nMPCA: Microprocessor and computer architecture: Easiest to watch a vid/website. Slides and the classes were decent. \n\nCN: Computer Networks: Depends on your teacher. Easy if the teacher is interested in the subject. Otherwise YouTube vids are you friend. \n\nOS: Operating System: Easy if you have an interest in computers, otherwise pure hell. Slides were decent, but if you want to understand things GFG and YouTube are good. \n\nLAA: Linear algebra and applications: LISTEN TO CLASS AND DO PROBLEMS!!! Hard if you are not good in maths. Otherwise not too difficult. Slides were bad (for me)."
    },
    {
      "id": "kb98tls",
      "body": "I honestly found 4th sem to be much more easier in comparison to 3rd sem and 5th sem(currently in it). Just focus regularly on the theory subjects like cn and os. Study from the textbooks for os and cn!!!! \nMpca was honestly the easiest subject for me lol, my teacher was great so all I had to do was study from her slides. \nAlgorithms is also easy, but make sure to pay attention in class , cuz you'll need the concepts later on. \nLA was also really easy, just solve 2-3 questions on each topic and you'll be set. Vibha's notes saved my ass for LA.\n└── could you please share your MPCA teacher's slides\n    └── Hey , I tries searching for the drive link, but the folder seems to have been deleted :/"
    },
    {
      "id": "kb9xj1z",
      "body": "I don't want to demoralise you, but a 9.8 isn't happening. It's good to have lofty goals, but being realistic about them will help you better achieve them. \n\nYou'll get so caught up trying to score a 9.8 it will only add unnecessary stress when you're preparing. Don't worry about cgpa, look to study well for the exam, smartly. The cgpa will follow!\n├── But cgpa is so bad that I need a 12sgpa for it to become normal 🤡\n└── Cgpa is really bad desperately need a 9.8"
    }
  ]
}