{
  "id": "18fcise",
  "title": "Are backlogs usually easy to clear and if we take summer backlog then when is it usually held?",
  "content": "",
  "metadata": {
    "root_comment_id": "kcwa1dp",
    "post_id": "18fcise",
    "author": "Ashamed-Alps5908",
    "url": "https://www.reddit.com/r/PESU/comments/18fcise/are_backlogs_usually_easy_to_clear_and_if_we_take/",
    "permalink": "https://reddit.com/r/PESU/comments/18fcise/are_backlogs_usually_easy_to_clear_and_if_we_take/",
    "score": 5,
    "upvote_ratio": 1,
    "created_utc": 1702240024,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "kcwa1dp",
      "body": "Depends on the subject. But backs are usually a bit harder because you don't have any internals to help you pass. Summer backlogs will be during July\n└── Say in network analysis or math 3rd sem\n    └── I actually had both lol. I cleared both on my second attempt. Ma-3 is doable if you put in like 5 days of effort. NAS is a bit harder. Like way harder. But if u study for a while seriously they shd both be fine. They're not like ACD or anything lol\n        └── Will having a backlog(which you already clear in ur first attempt)  be a problem in any way for the placements?\n            └── No. You'll be in big trouble if you don't clear your backs. But once u clear them, it's like you didn't even have them. They won't show up as backlogs in your final report card and if you study well and get a good grade in the subject, your cgpa will increase too\n                └── what are the possible grade we can get if we like do ok in exam, will they give any grades above E or do they stick to E grade, what did u get after rewriting backlog\n                    └── It's just like a normal exam, just without internals. They give you grades depending on how much you get in the backlog. I got 2 Es and 1 D, but my friend got an A in CADD after clearing the back. There's no cap on your grade, and your grade directly depends on how much you score in the backlog. If you did decent in the exam, expect a D or an E(if you're in ECE). Best case, C"
    }
  ]
}