{
  "id": "18glcnk",
  "title": "Chem lab exam!!!!",
  "content": "I'm in Sem1 and got chem lab exam next week. A little worried, because I don't clearly remember how to perform experiments. Would like to know from seniors (or fellow batchmates who have already completed their chem lab exam) about how strict will the exam be, the viva and stuff. Also, are we supposed to mug up procedure and all?\n\nTIA.",
  "metadata": {
    "root_comment_id": "kd17lsr",
    "post_id": "18glcnk",
    "author": "Subject-Whereas-3221",
    "url": "https://www.reddit.com/r/PESU/comments/18glcnk/chem_lab_exam/",
    "permalink": "https://reddit.com/r/PESU/comments/18glcnk/chem_lab_exam/",
    "score": 6,
    "upvote_ratio": 0.8799999952316284,
    "created_utc": 1702386071,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "kd17lsr",
      "body": "In the chem lab record, there are links given in the index page which have videos of the experiments performed. Refer that and life will be peaceful. Viva depends on teachers mostly.\n└── We have VBS for lab(and theory also)🥲\n    └── wait, what is VBS? lol i don't know, didn't have it ig (or maybe I am becoming old f)"
    },
    {
      "id": "kd1a417",
      "body": "Difficulty depends on your lab teacher\nMostly it won't be that hard"
    },
    {
      "id": "kd1cmnt",
      "body": "The only way you can't copy is if you go to the teacher and tell him you're copying"
    },
    {
      "id": "kd1j0cj",
      "body": "Bruh your batch is so unlucky and messed up lol,our batch didnt even have lab exams , we just had some project shit (measuring water hardness or some shit) and viva was legit free marks .\n└── I dont understand why its evolving backwards again, They dont have it as a seperate 1 credit course also\n    ├── yeah , chem and phy labs make no sense , at least the theory part is sort of interesting , the labs are a complete waste of time . For python and c i can understand that lab exams are kinds important and they do make sense but bruh phy and chem lab exams are just so messed up\n    └── Not only for you sem1 kids, but even sem3 assignments are also just worsening, loads of shit for petty marks, fr we are evolving backward yet again f\n        └── I'm in sem 3 only, True about that."
    },
    {
      "id": "kd55fin",
      "body": "Chem lab exam is the easiest exam you'll have in pes. I don't even know if it counts as an exam lol. The experiments they teach are pretty common and you can find them all on YouTube. Don't worry too much. I gave a blank paper and got A. Nobody takes first year exams seriously and definitely not the labs"
    },
    {
      "id": "kd6vm24",
      "body": "It prolly depends on the teacher cuz i had done absolutely nothing, neither performed experiments,nor gave viva she still gave me full marks.That being said ,dont take the exam lightly and just be prepared as much as you can"
    }
  ]
}