{
  "id": "18tmbik",
  "title": "Missed an assignment",
  "content": "So I'm in 1st sem, Chem cycle. I had missed out on an assignment in Chemistry (I was absent that day). Today was the last day and I forgot to turn it in. Our teacher has extended the deadline to Monday. Thing is that it's a holiday that day and I'll need to be travelling for like 3 hours just for this one thing (we have esas from the next week). So if I don't turn it in, does it matter in the grand scheme of things (afaik each assignment is worth 2.5 marks out of 100 for a subject)? I'm worried  about the fact that Chem is a 5 course credit tho.",
  "metadata": {
    "root_comment_id": "kfeun1m",
    "post_id": "18tmbik",
    "author": "Hairy_Demand_6974",
    "url": "https://www.reddit.com/r/PESU/comments/18tmbik/missed_an_assignment/",
    "permalink": "https://reddit.com/r/PESU/comments/18tmbik/missed_an_assignment/",
    "score": 3,
    "upvote_ratio": 0.800000011920929,
    "created_utc": 1703853816,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "kfeun1m",
      "body": "I think its best if you turn it in even late. max theyll scold you a bit, and then take it and cut some marks for late submission  \n\n\nAnd if you dont want to do it, again its upto how well you think you can score in your esas and isas, I think that should answer the grand scheme question\n└── In both the isas, Chem went pretty decent for me. I'll still turn it in I suppose. Ty for the help!"
    },
    {
      "id": "kff3bde",
      "body": "Your marks depends on the staff now\n└── Wdym\n    └── They might give marks even if you are not attending"
    },
    {
      "id": "kffbhp9",
      "body": "Just submit it late, you can explain that you live far. Because ultimately marks are in teachers hands and if youre able to convince the teacher, he/she will give marks"
    },
    {
      "id": "kfgq1ug",
      "body": "Hey,\nI am a Tutor and I think I could try to help.\nCare DMing?"
    },
    {
      "id": "kfid4nz",
      "body": "There's nothing you could do now marks were already entered and you signed it yourself\n└── So should I not bother giving it at this point?"
    }
  ]
}