{
  "id": "18zcazu",
  "title": "I screwed up and I hate myself and everyone is disappointed in me",
  "content": "So results are out and I fucked up yet again (5th sem). My CGPA is in the high 5s and this se I really thought was THE sem. Fucked up again and got 6.3. Still overall is 5.77, what the fuck do I do now. I want to get my grade close to 7 as possible but I try and try and nothing is happening. I feel like this isn’t for me sometimes, I hate myself so much right now and especially because i feel like im wasting my dads money. Idek what to say or do anymore",
  "metadata": {
    "root_comment_id": "kggmah6",
    "post_id": "18zcazu",
    "author": "throwaway202101324",
    "url": "https://www.reddit.com/r/PESU/comments/18zcazu/i_screwed_up_and_i_hate_myself_and_everyone_is/",
    "permalink": "https://reddit.com/r/PESU/comments/18zcazu/i_screwed_up_and_i_hate_myself_and_everyone_is/",
    "score": 1,
    "upvote_ratio": 1,
    "created_utc": 1704475630,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "kggmah6",
      "body": "It's hard but suck it up and put effort from next sem. \n\nThen going to do a higher study might be something to consider"
    },
    {
      "id": "kggokb4",
      "body": "Hey OP, you got to hang in there. I'm in the same boat as you here. I got 6.18 this time and overall is 6.11. Terrible I know.\n\nFirst of all, 6.3 ain't the end of the world. Might seem like it, but there's definitely more to learning than grades. I'm not going to tell you it's not important to have good grades(in a lot of ways it is) but I can sure as hell tell you it's not important to have **only** good grades. \n\nSecondly, stop beating yourself up about your dad's money. I'm a management student. I know the feeling too well. Trust me, he'd rather see you struggling and learning than giving up and feeling like a failure. \n\nMight sound stupid but it's in the past. Focus on getting your grades up in the next 3 semesters. Don't focus on a specific number like 7. Just do your best. There is this quote by Ernest Hemingway that comes to mind, *\"There is nothing noble in being superior to your fellow man; true nobility is being superior to your former self.\"*\n\n&#x200B;\n\nP.S. I didn't want to make it too long but please feel free to vent or ask for advice.\n└── I guess I really needed to hear something “positive-ish” from someone in a similar situation. The thing is my parents didn’t scold me, but it made even more guilty because it felt like they’ve given up now. I really did study this semester, not hard enough I guess. These sems Ive taken too lightly and now when life kicked my ass, I think it’s finally time to come to my senses and study harder and harder. And the Hemingway quote is just what I needed to hear, love the dude. Anyway thanks again, really needed to get it all out.\n    ├── \"The rain will stop, the night will end, the hurt will fade. Hope is never so lost that it can't be found.\" \\~ Ernest Hemingway  \nHe has a way with words doesn't he?\n\nI guess I have to thank you as well. Never spoken to anybody about this, so good to have it off my back. And yes, just keep working hard. Or start working hard. Whatever applies to u. I guess in the end we only regret the things we didn't do. God, I have to stop with the quotes.\n    │   └── Honestly, the quotes are good. Thanks\n    └── Give it all from now bro, and hone your skills and you'll make it."
    },
    {
      "id": "kggsu2v",
      "body": "Take a breath and calm down. There are so many people who are/had been in the same situation as you.\n\nRight now you have two paths : \n\n1) Stay sad,depressed and blame yourself: This can be very bad for your mental health. You will never improve and maybe 30years down the line you start to regret your college days and start wishing you did something different.\n\n2) Forget the past and move on:  Nothing can be changed now. But you still have a couple of semesters left. You are feeling guilty because your father might look down on you or be angry, but you need to realize that parents are the only ones who love is dearly. Not even your close friends can show the same affection as your parents. Put yourself in your father's perspective. Do you think he will be happy if you continue to stay depressed and become a recluse? No he won't . Maybe in indian society fathers don't show emotions like your mother but deep inside all they want is for you to be happy. Take a day off and sit down for 1-2 hrs and write down, how you are feeling and how things can get better. You need to remember one thing. Do not think of what the future holds and become pessimistic. This will ruin your mental state even more. Instead think one day ahead. From now on, every day you will try to be better than your previous day. Take it slowly one day at a time. Write down your motivation. It could be to see your father's smile during your graduation or repaying the money your father spent on college. Trust me when I say, parents would be willing to go bankrupt to see their child happy. They will never regret spending money on your education. Write down the reason for your low grades. Is it because of social media/games,etc. Once you identify it, you are already 70% better than your previous self. Every night take 10-20 mins and reflect on what you accomplished during the day. Did you meet your target, did you finish what you planned on doing,and so on. If the answer is yes, then reward yourself for max 45 mins social media or games. If no, then write down why you couldn't do it and fix the issue asap. Do this everyday and you will see results very quickly. \n\nDon't lose hope. If you feel demotivated or burnt out, sit in silence and meditate for a while. Make yourself calm and read your motivational line again and again. Take breaks if you must but don't exceed the limit. You can still do it. Good luck.\n└── Thank you so much. This means a lot."
    },
    {
      "id": "kggx6st",
      "body": "Adding to all the suggestions provided, I've 5 years of work experience now and trust me your CGPA doesn't matter once you've a job and experience. Make sure that you are learning and developing skill too\n\nGood luck and make sure to have fun in learning"
    },
    {
      "id": "kggxu8t",
      "body": "Whatever you do, but just dont jump of the building like that 1st year dude"
    },
    {
      "id": "kgh7huw",
      "body": "Hey don't beat urself up. I felt the same in first sem when I got 6.09 gpa. I worked hard and managed to score 8.17 in the last sem i.e my third sem. So from this sem onwards go to class regularly and try to study regularly. Ull get through. STEM isn't easy for most initially, but with consistent work ull get through\n└── Dang.. seems like we are on quite same boat,even i got exactly 6.09 in first sem and felt like shit for over a month and then got 7.77 and 8 in the next respective sems..,prolly could have done better but no problem ,will work even harder in the next 3"
    },
    {
      "id": "kgh7rn2",
      "body": "Hey! \n\nIt just happened to see your post and I don't know if any of this is going to be relevant, but I just had to tell you.\n\nI finished college a few years ago. I was where you are. I thought it was the end of the world, honestly. I couldn't think of anything else but how everytime I make my mind up to be better, I fail. But it's okay. I know that it's okay now. I'm not going to go on this \"not everyone needs to be an engineer\" bullshit. Because there's still a career for you in corporate. No one cares about your GPA after placements. You can get a job that pays well, do courses online easily that'll help you get money and you'll have a good life. Your friends might get there a year or two faster but honestly, that's such an insignificant amount of time in the long run. I'm just saying that you have your whole life ahead of you. Just finish your degree, get out of college.\n\nSomeday, you'll wake up in a nice bed next to someone you love and you'll laugh over something silly like how you put salt in your coffee.\n\nThe best day of your life is yet to come.\nJust hang in there and you'll be fine. \n\nDon't want to come off as overbearing, but I have a little sister who said the same stuff to me the other day. So if you wanna talk, I'll be here."
    },
    {
      "id": "kghd9u9",
      "body": "I had cgpa of 6.12 the cuttoff for a particular company during placement was 6.10, my competitors in that interview were toppers from my batch having 8.5 to 9.2. Out of 15 people only i got selected with the second highest package for my branch.\n\nBecause everyone with high cgpa in my branch just xerox copied whatever is there in tb into their brain and vomited on answer sheet. They were pretty surprised how i even ended up with a job when they didn't and stopped talking to me lol. Cgpa honestly means jack shit in the real world so dont be sad.....these fckers are not making good engineers but mass producing useless xerox copy machines"
    },
    {
      "id": "kghnsf1",
      "body": "Trust me when I say cgpa doesn't matter that much , it is only used to get into good companies early on easily,\n the other way is to work hard and then get in using good experience.\nI m speaking from personal experience."
    },
    {
      "id": "kgiex6w",
      "body": "As much as I hated it, the company that I'm now working in did not even ask which college I went to, let alone CGPA, during my interview/onboarding (despite me having good credentials). Hang on in there. There are always ways to succeed in life\n└── hey can i dm u\n    └── Sure"
    },
    {
      "id": "kgifvwq",
      "body": "Whatever Happened, happened, forget about that , think what to do next"
    },
    {
      "id": "kgj0bxy",
      "body": "Just because no one mentioned it here. Do the self reporting test for adhd. Might be worth looking into. Especially if your performance was good in school but dropped after 10th standard\n└── That is oddly specific but exactly what happened. I will look into it thanks\n    └── That's the latest when symptoms start showing up according to current literature. \n\nAccountability is how you can best tackle it at your stage. Never study alone. Never study with people who have fun while studying. Your study partner should be like your mom who will thrash you if you start slacking. You need to hunker down and solve questions to completion without looking at answers. You need to understand concepts completely. You might be feeling bored by easier questions but that is where you need to have complete understanding.\n        └── Thanks so much for. Especially in telling in EXACTLY what could be wrong without walking around it. I will try your methods. Haven’t screwed up everything\n            └── I've been there man. I didn't realise till three years after finishing mba. I just did good in entrance exams but never knew how to actually study and do good in actual exams. And that's what matters which sucks. But even after fucking up so much it's not so bad. 5th sem still gives you good time. Don't worry even if you fuck up..it will be ok. Speak to your profs also. They can give you alternate ways of scoring marks like papers or projects. Or tell you where to focus more. You have to go all in. But don't bite off more than you can chew in excitement"
    },
    {
      "id": "kgjoud6",
      "body": "Bro, my CGPA was 6.2 when I completed my BTECH in 2018. Now I’m working as a dev in one of the top investment banks. So don’t loose hope just don’t stop working hard in your remaining semesters. Maybe try getting the last semester doing a project so that you score more via project evaluation if this option is available. \n\nYou can DM me for more guidance if you’re from CSE branch.\n└── Thanks a lot! Not in CS so…"
    },
    {
      "id": "kgk9typ",
      "body": "Please stay positive brother. Consistency is the key I think. There are more sems and more chances. I am sure we all will get what we want."
    },
    {
      "id": "kgkx03m",
      "body": "when i graduated..from this college (2023)..i had cgpa 6.72 ..tho i was in ur state and used to regret a lot that my friends were getting more than me  and hated myself for not working hard.. Tho i realised but it was late still..i never gave up..i worked hard and cleared my backlogs in my last year..and  got placed in a sass based startup(on campus) after clearing all elmination rounds and got offer letter..before that i thought that they would reject me for less cgpa..but they didn't even look at my cgpa in my degree certificate..and hired me despite many people having much better cgpa than me and being from CSE branch(i am from ece tho)..i am really grateful to them for that..it was hell of a ride....but i could have avoided it only if i would have shared it with my parents..and my mentor ..when i was getting backlog which lowered my cgpa.. this would have definitely ..helped me understand my faults..could have done better..but it was too late..anyways i overcomed it ...but still it has been biggest regret in my memory..i don't know if my career  has been impacted from it and will it impact in future but still i am slowly recovering from it. I request to share it with your parents and ur mentor..tho ur parents will scold.. but definitely..you will avoid the mistake that i had done..and will give u a plan or solution on how to improve ur cgpa...so talk to them early before it becomes too late.\n└── Thank you, needed to hear this."
    }
  ]
}