{
  "id": "191la9v",
  "title": "Mechanics statics esa",
  "content": "Will the questions be asked directly from the text Book questions given to us ? I was going through pyqs and noticed some questions which weren't there in our textbook questions?",
  "metadata": {
    "root_comment_id": "kgw72ew",
    "post_id": "191la9v",
    "author": "Turbulent-Spinach360",
    "url": "https://www.reddit.com/r/PESU/comments/191la9v/mechanics_statics_esa/",
    "permalink": "https://reddit.com/r/PESU/comments/191la9v/mechanics_statics_esa/",
    "score": 3,
    "upvote_ratio": 0.8100000023841858,
    "created_utc": 1704720687,
    "flair": "Study Help :table:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "kgw72ew",
      "body": "All are Direct and not even very hard. \n\nMost of the questions in the textbook are solvable with basic concepts. The ones which you cannot do, there might be a few per unit, just program the answer in the calculator  as a variable and remember some easy intermediate steps. \n\nWrite the given values. Do the basic things like adding the moments and stuff. Then write another intermediate step if needed. And then the final answer. \n\nDo this only for the very hard ones, which thankfully are very scarce in the papers\n├── Thankyou!\n│   └── the paper is approximately 20 marks theory and 80 marks numericals , that much is confirmed\n└── No theoretical questions right?\n    ├── There actually are some\n\nMy friend who had it in sem 1 marked them in textbook and i read it from there\n\nBut i think theory is also there in slides. \n\nThey'll only ask a few questions maybe like 3 marks per unit\n\nI remember the questions were like \"what are beams. State 3 types of beams. Also solve this numerical on beams\" for 8 marks\n    │   └── Thx alot man\n    └── There is"
    },
    {
      "id": "kgxa304",
      "body": "[for theory statics (use pes mail id to accesss)](https://drive.google.com/drive/u/2/folders/1-uIJy5ElC_X956y7dYtkf_fbDgDPIPms)"
    }
  ]
}