{
  "id": "193ttfd",
  "title": "are errors in ISA correction a common thing?",
  "content": "I'm a first sem chem cycle student and I have scored dismally low in a certain ISA 2 paper, although it was my best exam among all subjects. It looks like only my mcqs were autocorrected and my 4 markers weren't even looked at.  Is there any chance of error in paper correction? I would be aware if I fucked up the paper but that was not the case. I've also considered that I may have marked my SRN incorrectly or made a mistake while bubbling, but that seems improbable because I always cross check. I'm just reallly worried right now.",
  "metadata": {
    "root_comment_id": "khbohd7",
    "post_id": "193ttfd",
    "author": "iwasinmyzone",
    "url": "https://www.reddit.com/r/PESU/comments/193ttfd/are_errors_in_isa_correction_a_common_thing/",
    "permalink": "https://reddit.com/r/PESU/comments/193ttfd/are_errors_in_isa_correction_a_common_thing/",
    "score": 4,
    "upvote_ratio": 1,
    "created_utc": 1704950137,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "khbohd7",
      "body": "I wouldn't say they're *common* but yes they do occasionally occur. That's why I always recommend people to attend the ISA reviews, even if they scored as expected. Wherever there's room for errors, there's always a chance, however small, of some mistake during evaluation.\n└── I see. Some of my friends had their ISA 1 scores increased by a few marks, so im just hoping for the best."
    },
    {
      "id": "khbtpq6",
      "body": "Dude in a \"certain\" paper, I typed a 4marker out, a totally correct answer yet they have put 0 😂😂   \nNot understanding handwriting is fine to an extent, but they dont even evaluate typed answers what is this smh\n└── (I wrote all my answers in the sheet🙃 ) I think you're supposed to bubble even if you're typing the answer into the PC. I'm not entirely sure about it but an invigilator did mention it several times.\n    └── Ohhhh Nothing like this was told to us :/  \nOn another note- what if the teacher looks at the page first, sees it as empty withut checking the typed part and proceeds to check the next question? 😅😅\n        └── AFAIK each teacher is assigned to correct one particular answer across all students' papers, so I believe it's unlikely. Let's just wait for review and hope for the best in this hellhole of a college :')\n            └── Haha yeah fair enough!  \ngl to your re-eval too"
    }
  ]
}