{
  "id": "196h0q3",
  "title": "Branch change second year",
  "content": "so what should my minimum cgpa be if i wanna change my branch from ece to aiml next year??....is it really worth it??\n\n&#x200B;",
  "metadata": {
    "root_comment_id": "khtfsbe",
    "post_id": "196h0q3",
    "author": "That_Ad5856",
    "url": "https://www.reddit.com/r/PESU/comments/196h0q3/branch_change_second_year/",
    "permalink": "https://reddit.com/r/PESU/comments/196h0q3/branch_change_second_year/",
    "score": 7,
    "upvote_ratio": 0.8899999856948853,
    "created_utc": 1705242379,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "khtfsbe",
      "body": "Already answered in FAQs - https://bit.ly/pesu-faq"
    },
    {
      "id": "khtfxu2",
      "body": "Might be something around 8.9 above would be a safe place\n└── ok...thanks!!"
    },
    {
      "id": "khtha5x",
      "body": "Last year it was around 8.3-8.4 ig\n└── any idea on how many seats were there last year??\n    └── Nope, but aim for an 8.5+ to be on the safe side\n        └── ok...thanks!!"
    },
    {
      "id": "khthl6a",
      "body": "Last year was\n\n9.68 cs rr\n\n8.2 aiml rr\n\n7.4 cs ec\n\nIf you're okay with cs in ec i guess it's pretty much guaranteed. But for aiml i would be confident that someone with 8.5-8.7 should get it\n├── k...thanks!!\n│   └── No problem. I just want to ask though. Are you fine with cs or aiml in ec campus\n│       └── ec campus is quite far for me...so i prefer rr campus\n│           └── Yeah that's understandable. i just want to say that you should probably prioritise branch over campus. Campus doesn't matter much at all. But yeah it's your call\n└── Why is ec cs so less\nWouldn't this mean almost every ece guy shifting to cse\nCoz most take ece coz they missed cse\nNo ece peeps wud be left right\n    ├── That's y kept limited no. of seats and cgpa as a criteria to filter\n    └── A lot of people didn't take it. I guess after a year they'd rather be in the same campus\n        └── Ahh so is rr campus still superior quality wise than ec campus\nCutoffs also rr is much higher kcet pessat etc\n            └── I branch changed from ec to rr. Both are identical quality wise. Teachers are shit in both. Golden Jubilee is a bit better than mrd in ec campus i suppose but not enough to care about it. Sure the peer group and professors might be better, but be honest and ask yourself if you're actually going to take advantage of it. \n\nIf you plan on cheating from others in exams, ec campus is definitely better.\n\nOverall I would say the difference is pretty negligible. 12th grade graduates just aren't very smart when they pick colleges\n                ├── Lol I think cheating in pes isn't an option, so basically profs r bettr in rr and events are more\nWhere do u think pes stands w.r.t rv bms msrit\n                │   └── For ESAs it's hard but isas it's really easy to cheat in ec campus. Don't take any chits or anything because it's evidence. Ask the guy in front to enlarge the text and copy from him. Teachers will max ask you to look down if they notice. I've never done it but i know a ton of people who did\n\nProfs should be better in rr but in my experience not really. I've been in ec for the first few weeks of third sem and i don't think there is much different. Listening to classes isn't really beneficial either way \n\nI think the pes is overall pretty similar. Since it's a university and not vtu it's probably slightly better. But  general strictness and attendance requirements are definitely a huge downside.\n                └── does the cutoff for aiml stay around the same every year or does it vary much? and is it also possible that this does not occur at all, like for example after 1st round of pessat, rr aiml, ec cs/aiml  seats were in negative this year.\n                    └── A senior told me that they were roughly the same the year before and the year before that. But yeah it's completely dependent on the number of seats left, so you might not be very lucky."
    },
    {
      "id": "khudf93",
      "body": "9+ and please take CS wherever possible. campus doesn't matter"
    }
  ]
}