{
  "id": "1976zci",
  "title": "Extra Credits",
  "content": "I am in the 8th semester and have an internship to cover the required credits. I am deliberating whether or not to pursue special topics parallelly. I have heard that one can pay for extra credits to be considered. Is it true and are there chances of it increasing my CGPA?",
  "metadata": {
    "root_comment_id": "khyejt5",
    "post_id": "1976zci",
    "author": "Conscious_Morning852",
    "url": "https://www.reddit.com/r/PESU/comments/1976zci/extra_credits/",
    "permalink": "https://reddit.com/r/PESU/comments/1976zci/extra_credits/",
    "score": 3,
    "upvote_ratio": 1,
    "created_utc": 1705319550,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "khyejt5",
      "body": "Unrelated but i just wanted to ask how hard is it to get an internship in final year. I was told the interviews happen in third year, is that true? Also if you could like give me a percentage of how many people get one, I'd really appreciate it. Thanks\n└── If your grades are above 8, for some 8.5 and for rare ones 9.\n\nYou are permitted to sit for the placements and then, it's just a matter of luck, provided you're able to solve the technical round.\n\nIf you can solve mid leetcode, you're good to go.\n\nAnd interviews do happen in 3rd year but they go on in 4th year. Some internship ones are happening now, and for some others, their internship has started.\n    └── Thanks it helps. Do most people get one by the end\n        ├── Depends on what you are looking for. I am an ECE student and wanted one in the core industry, so I had to resort to off-campus. I am presuming that a CS-related opening should be relatively easier to land.\n        └── most people I know got one, but what I can guarantee you is you'll be pretty much depressed until the day you actually get your offer because you'll see everyone getting one.\n            └── Thanks it gives me some peace of mind. \n\nAre the internship offers usually linked to full time?\n                └── They are a \"with maybe fulltime conversation\""
    },
    {
      "id": "ksbkubp",
      "body": "Can someone answer the actual question?"
    },
    {
      "id": "kstu6wx",
      "body": "So I visited the COE today and here are the clarifications\n1.  You gain as many credits as you want the minimum summing up to 160.\n2. Of all the credits earned, the best of 160 will be chosen to calculate the final cgpa. \n3. Extra credits can be earned by paying Rs 2.5k per credit with the maximum credits being up to 168 (Even in this case the best of 160 is applicable)."
    }
  ]
}