{
  "id": "197askn",
  "title": "Want to know the difficulty of PESSAT , is it on par with CET or is it higher? I'm looking for either CSE or ECE",
  "content": "Hi , \n\nAs the title states, I'm applying for PESSAT 2024 for Btech CSE or ECE. The website says the questions are of CBSE type ( PU board student here ). So, I want to know the difficulty level of PESSAT .  Is it harder than CET? ",
  "metadata": {
    "root_comment_id": "khz7moe",
    "post_id": "197askn",
    "author": "Apprehensive-Web1069",
    "url": "https://www.reddit.com/r/PESU/comments/197askn/want_to_know_the_difficulty_of_pessat_is_it_on/",
    "permalink": "https://reddit.com/r/PESU/comments/197askn/want_to_know_the_difficulty_of_pessat_is_it_on/",
    "score": 3,
    "upvote_ratio": 0.800000011920929,
    "created_utc": 1705331032,
    "flair": "PESSAT",
    "nsfw": false
  },
  "comments": [
    {
      "id": "khz7moe",
      "body": "I'd rate PESSAT above CET level\n\nOne factor is it that the questions require some extra thinking. You should be fine if you've prepared well for JEE or atleast NCERT properly\n\nAnother factor about PESSAT is that they don't release the paper so its a big surprise xD"
    },
    {
      "id": "khzagsj",
      "body": "This is a pretty common question on this sub every year - if you search this space you will find multiple posts. But to answer your question, its usually at CET or a bit higher. If you are preparing at the JEE level (which you should, this place should be secondary or even lower when it comes to specific prep), then it should be covered already in your JEE level prep.\n\nAlso there is English in the test, which is usually pretty straightforward. There is no negative marking (as far as I remember) and there are no previous year papers available\n└── Oh I see, my bad didn't search before"
    },
    {
      "id": "khzz5o1",
      "body": "Personally I felt PESSAT is little easier than CET but they're definitely above CBSE board level. Just normal CET prep should be good enough. Questions will be similar to CET only\n└── oh okay , thanks for the reply"
    },
    {
      "id": "ki06zpm",
      "body": "I think pessat dicerolls the ranks as I remember giving the exam for fun and guessing like 40 qs still ending up with a mid rank(12xx)\n└── yep they 100% mess w the ranks, last year i went, slept for half an hour, then just did english and chem properly, marked random for phy and math and came back. ended up getting rank 6xx. i did that because i knew i wasnt gonna take pessat seat.\n\nbut yeah i ended up eligible for aiml via kcet"
    },
    {
      "id": "ki6j3zv",
      "body": "PESSAT is tougher than CET but getting a good rank in PESSAT is easier than CET. Hope this helps xD"
    },
    {
      "id": "ki95983",
      "body": "Well I wrote PESSAT last year, I didn't write KCET because I wasn't eligible, as far as I can remember, the paper was of a pretty decent difficulty, I wouldn't say it was as tough as Mains but it wasn't dead easy either, also there is no negative marking, so just guess if you don't know anything\n\nBut at the end of the day, I think most of us here at PES would agree that the ranks are just completely random and PES just allocates whatever rank they feel like because I wrote the exam for absolutely no reason, zero prep, just woke up and wrote that and I guessed like half the paper and still got a CSE seat\n└── bhai mind if i dm you ?"
    }
  ]
}