{
  "id": "197aspm",
  "title": "How to strike a balance between enjoying life and getting 10 sgpa",
  "content": "",
  "metadata": {
    "root_comment_id": "khz4x8f",
    "post_id": "197aspm",
    "author": "Educational-Bee608",
    "url": "https://www.reddit.com/r/PESU/comments/197aspm/how_to_strike_a_balance_between_enjoying_life_and/",
    "permalink": "https://reddit.com/r/PESU/comments/197aspm/how_to_strike_a_balance_between_enjoying_life_and/",
    "score": 13,
    "upvote_ratio": 0.9300000071525574,
    "created_utc": 1705331042,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "khz4x8f",
      "body": "Study in the last two weeks and get 9 cgpa🤷\n├── doesnt work :)\n│   ├── It depends on your capabilities. It does work for some people. Regardless, listen in class attentively. Make mental notes on how the concept being taught might be useful to you. A genuine appreciation for the subject makes you remember it. Don't let PES teachers destroy it for you. Trust me, they are the best in destroying your interest in a subject\n│   │   └── i'm here writing both lab manuals completely in week 1 lmao. fuck adhd man, doesnt lemme concentrate for more than 10 mins.\n│   └── It would be a piece of cake to get 9 CGPA if you study 2 days before every test & exam.\n│       ├── Lmao no u need two weeks minimum\n│       │   └── Sounds like a personal problem to me\n│       └── You're wrong\n│           └── How can I be wrong if I have done it?\n└── This doesn't work at all! :(\n    └── In the second last week study a bit. In the last week and on exam week study like hell. It'll work\n        ├── Will try this! :) Thanks :)\n        │   └── You're in ec campus? Sec j?\n        │       ├── yep :)\n        │       └── How do you know me?\n        │           └── Magic\n        └── No, this doesn't help at all. I'm telling this from my experience. We are supposed to start studying the concepts as early as we can as a preparation for exams, not the a week (or second week) or a day before the exam. Studying for the exams before a week doesn't help cuz there is too many information to be consumed in a very less time. \n\n In my opinion: \n• We need to have a realistic plan, a strategy for each subjects.\n• We should study those concepts right after it was taught in class by going through whatever study materials we have in our fingertips.\n• Going through previous year questions as early as you can before it's too late. \n\nThis makes it easier and maybe more efficient to go through tonnes of information in a very less time. \n\nAlso, making self notes after going through everything asap (like the study materials in pesu academy, the documents from pes media server, previous year questions etc.) helps too."
    },
    {
      "id": "khz8dis",
      "body": "9 is possible if u r productive in class and study a week or two weeks before isa\n└── Could you elaborate? :)\n    └── Be attentive during classes, learn most of the things during classes. Enjoy rest of the time and then start studying week or two weeks before isa. Even if u dont understand the concepts, keep them aside and learn during isa preparation"
    },
    {
      "id": "khz9xeu",
      "body": "You don't \\*have\\* to get a 10 SGPA. The \"higher GPA the better\" philosophy holds only until a certain threshold. Beyond that, every GPA is the same. Don't worry about scoring that perfect GPA, instead focus on obtaining that GPA which (1) you are satisfied with and (2) puts you in a strong position for opportunities you would like.\r  \n\r  \nIMO, anything above a 9.2-9.3 or so is basically the same. I would not even recommend putting in more time (unless you are willing to and want to) because then you end up compromising on other aspects of your college life. That GPA is enough to get you access to opportunities related to placements, or even for higher studies. At the end of the day remember that CGPA is just a filter - its the rest of your profile and how you build your skills and present them that matter."
    },
    {
      "id": "ki3d4ui",
      "body": "Hypothetical Question"
    },
    {
      "id": "ki8wpkp",
      "body": "As someone who has scored 10 multiple times and I enjoy my life I think I can answer this question. So first see every break I go on trips goa, pondi etc etc I have gone till now. I always maintain 70-75 attendance in all subject. I got to parties and etc etc every weekend. In short I enjoy a lot. \n\n\nSo what I do is study 1 week before every ISA and makes notes during the ISA itself. ESA becomes very eary because of this I just read my own hand written notes. Assignments and projects I give my 100%. At the end this is I really enjoy studying, so I try to understand and enjoy every topic and in exam I am able to answer everything without mugging stuff up. \n└── Cap XD"
    }
  ]
}