{
  "id": "19budmc",
  "title": "Capstone doubt",
  "content": "Ok so i have met my mentor only a few times and we had an idea/title  going on , but on reading few research papers. We somewhat reached a deadend. So we had a novel idea before reading the research papers(once i read 2 of them i found out, our idea practically will never work out).but there is another way in the paper(but since its there in the paper it wont make it novel and its just a loophole kind of way to do it)\n\n\nSo can i just ask my mentor for an idea/topic, since i have just 1 week left for review\n \n\n\n\nOk so i cant explain my entire idea here,\nBut long story short we had an idea to do a memory dump for a certain os in a real system and someone did the same thing on a virtual machine(in the research paper).but also reading another research paper i found out it can never be done on a real system.",
  "metadata": {
    "root_comment_id": "kiue348",
    "post_id": "19budmc",
    "author": "Fun-Understanding862",
    "url": "https://www.reddit.com/r/PESU/comments/19budmc/capstone_doubt/",
    "permalink": "https://reddit.com/r/PESU/comments/19budmc/capstone_doubt/",
    "score": 7,
    "upvote_ratio": 0.8999999761581421,
    "created_utc": 1705809137,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "kiue348",
      "body": "That's ok. This is the first phase of your project right - so the focus is on settling on a topic for the project. You don't explicitly need to come out with a novel idea right at the first review. It's impossible to do that without a very thorough literature survey and some ideation. In fact a lot of teams pivot and slightly change their problem statements, approaches and topics over the course of the study. \n\nThey will primarily check if you have an idea of what has been done, what is possible, and in your field, what topic you want to focus on. They might ask what approaches you might be looking at, but it's not required to have a concrete plan. If your team is interested in a topic, your guide knows about it and you're already able to brainstorm a few ideas, these are good signs."
    },
    {
      "id": "kiuu47y",
      "body": "Is it possible to change our problem statements during the first phase of reviews?\n├── Ideally you shouldn’t change it. However you will have to if it gets rejected in the first review. After that I don’t think so.\n└── Yep, I did. Just have a clear roadmap of why you changed it."
    }
  ]
}