{
  "id": "19c709t",
  "title": "Aiml",
  "content": "I am done with my first sem, and have holidays now I wanted to research about the course (like what languages are better to learn, are there any languages i should start learning, and anything related to the course etc) i don't know where to start my research from could seniors please help",
  "metadata": {
    "root_comment_id": "kiwr42s",
    "post_id": "19c709t",
    "author": "Turbulent-Spinach360",
    "url": "https://www.reddit.com/r/PESU/comments/19c709t/aiml/",
    "permalink": "https://reddit.com/r/PESU/comments/19c709t/aiml/",
    "score": 10,
    "upvote_ratio": 0.9200000166893005,
    "created_utc": 1705854126,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "kiwr42s",
      "body": "Just relax dude. You're not going to lift a mountain in the 6 days of  holidays that you probably have. They're going to be over before you know it\n└── I'm not gonna start on the holidays. I'm way too lazy for that. Just wanted to know about my branch and how to work on it. Just some research so that I could brace myself"
    },
    {
      "id": "kix1fqu",
      "body": "You are the second batch of the AiMl branch. I'd recommend trying to connect directly to your AiMl seniors. \n\nWith regular CS in mind and since first year is common, learning C will help.\n└── Yeah I do have c this sem. Thanks for the advice!\n    └── No problem, enjoy your vacation!"
    },
    {
      "id": "kjhaoeb",
      "body": "Get rewards of $5, $100, $250, $750, $1000 guaranteed but it's only for today (LIMITED)\nLink in profile (linktree)"
    },
    {
      "id": "kji9zhd",
      "body": "I'm not in CS but I took some basic courses on Python for data analytics and visualisation after my first sem just out of interest. Try something simple like that. Learn well about libraries like pandas, numpy, mathplotlib, etc. If want, look up the data analyst boot camp by 365 careers on Udemy, it's a very basic course to start learning skills that will come incredibly handy once you proceed to third sem, although you will learn everything from third sem onwards.\n└── Thank you so much for your reply! I really need to do a lot of research 😭 I come across a new language every day and i don't even know how to start. There's too Many options and it's difficult to choose I have all the 3 libraries done (class12) but i don't even have  basic knowledge in c c++ Java etc should I go for them after sem starts?"
    }
  ]
}