{
  "id": "19crrf5",
  "title": "Learning C before Sem-2 begins",
  "content": "Hey seniors, any tips on where I can effectively learn C ? I've looked online but none of them look worth it.. Also do suggest any textbooks that may help :)",
  "metadata": {
    "root_comment_id": "kj0rucu",
    "post_id": "19crrf5",
    "author": "maze_skull78",
    "url": "https://www.reddit.com/r/PESU/comments/19crrf5/learning_c_before_sem2_begins/",
    "permalink": "https://reddit.com/r/PESU/comments/19crrf5/learning_c_before_sem2_begins/",
    "score": 1,
    "upvote_ratio": 1,
    "created_utc": 1705915375,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "kj0rucu",
      "body": "I have made notes for everything C in sem2. Let me know if you want the pdfs\n├── I do\n├── Can I have them as well?\n├── Hi, can i have them too?\n├── Can I also have them\n├── Yes please!\n├── Can I have them too? Please?\n├── Yess pls\n├── [https://drive.google.com/drive/folders/19wiPYMa-qZraK3TAl\\_ds5mhZO\\_16GQlj?usp=sharing](https://drive.google.com/drive/folders/19wipyma-qzrak3tal_ds5mhzo_16gqlj?usp=sharing)\n\nHere's the link\n└── Thank you so much!"
    },
    {
      "id": "kj0t7ex",
      "body": "A small YouTube playlist will be enough. You don't have too much to learn for sem 2."
    },
    {
      "id": "kj16h7o",
      "body": "Let us c by yashavant kanetkar \n\nA one stop solution to learning c \n\nDon't spend time watching crappy videos on yt this book is more than enuf trust me\n├── Yes, this is best and golden book to learn C\n│   └── Oh ok, what would be your take on the The C Programming Language by K&R?\n\nSorry for butting in in OP's post\n│       ├── That's the college prescribed textbook yeah but yashavant kanetkars is more of a tried and tested method , it's worked for generations trust me\n│       │   └── Oh okay, thank you\n│       └── I havent read, hence cannot give my opinion on that. Sorry\n└── Oh okay, I thankfully have that book with me rn, Thank you :)"
    },
    {
      "id": "kj177up",
      "body": "Bing chill bro, why u want to study during vacations :("
    },
    {
      "id": "kj5vyyj",
      "body": "if you can understand hindi, then i suggest code with harry. His videos helped me a lot."
    },
    {
      "id": "kj6icjl",
      "body": "The C programming language book I heard is good. Written by the creator of C but ig it will be technical.\nI had referred to pesu notes and kept experimenting with the language. I had a very bad teacher but I still managed to get A.\nPlaying around with the language is important and it helped me a lot even for later sems.\nBtw Install gcc \nIt will be really helpful if you understand the syntax of the language and understand the concepts of pointers.\nPesu notes (not slides) should be available in pesu media discord server."
    },
    {
      "id": "kji96yi",
      "body": "Try this app called Sololearn, it teaches you step by step, its free for learning the fundamentals of the language only."
    }
  ]
}