{
  "id": "19f50i0",
  "title": "NPTEL Certification.",
  "content": "Are NPTEL Certification courses valuable? Are the certificates valuable? Should I write their certification exams or is it ok if I just go through their course material?",
  "metadata": {
    "root_comment_id": "kjhcqqe",
    "post_id": "19f50i0",
    "author": "hatter_s",
    "url": "https://www.reddit.com/r/PESU/comments/19f50i0/nptel_certification/",
    "permalink": "https://reddit.com/r/PESU/comments/19f50i0/nptel_certification/",
    "score": 10,
    "upvote_ratio": 1,
    "created_utc": 1706172625,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "kjhcqqe",
      "body": "U had udoshi as ur edp teacher right?\n├── No idea what you're talking about.\n│   └── Fucker spent the entire 1st week of sem taking bout that shit\n│       └── No idea cause I'm a fresher.\n├── Lmao I was just gonna say this\n└── Lol I was thinking the same 😭😭😭"
    },
    {
      "id": "kjhfyvl",
      "body": "Certifications are useless. Skills are valuable. If you can't present evidence (projects, work experience, etc) for the skills you picked up then it won't benefit you in any way."
    },
    {
      "id": "kjhpwsx",
      "body": "I would recommend getting the certificate!\n\nYes, it's obvious that what you learn in the course is more important than the certificate, however, the certificate just puts a seal that you have completed a course...\n\nFocus on learning to the max and also getting that certificate\n\nIf you do not want a certificate, then don't go for NPTEL; you could just learn it for free from Youtube; however, as you are anyways attending a course, just get the certificate too\n└── NPTEL course classes can be attended for free too. They provide a pretty good quality of content so it can be preferred over YouTube at times.\n    └── Agreed!\n\nWhat I meant was, as you are already taking up the NPTEL course, you could also get the certificate (by writing the test)\n        └── Yes, that's the cherry on top."
    }
  ]
}