{
  "id": "1abzwsb",
  "title": "Seeking Insights on MCA Program, College Life, and Placements at PESU",
  "content": " Hey fellow Redditors,\n\nI hope you're all doing well! 🌟 I am currently in the process of exploring my options for pursuing an MCA (Master of Computer Applications) at PES University, and I wanted to reach out to the community to gather some firsthand insights.\n\n1. **MCA Program:** If any of you are enrolled in or have completed the MCA program at PESU, I'd love to hear about your experiences. How is the curriculum structured? Are the professors supportive and knowledgeable? Any standout projects or courses that you found particularly beneficial?\n2. **College Life:** A big part of the overall experience is, of course, the college life. What's the campus culture like? Are there ample opportunities for extracurricular activities? How's the student community – friendly and collaborative?\n3. **Placements:** The ultimate goal of pursuing higher education often includes securing a promising job after graduation. If you or someone you know has insights into the placement scenario for MCA graduates at PESU, please share your thoughts. Are there notable companies that frequently recruit from the MCA program? How effective is the placement support provided by the college?\n\nFeel free to share any additional tips, anecdotes, or advice that could be helpful for someone considering the MCA program at PESU. Your firsthand experiences and perspectives would be immensely valuable in helping me make an informed decision.",
  "metadata": {
    "root_comment_id": "kjs6v0b",
    "post_id": "1abzwsb",
    "author": "Crazy_Maverick_18",
    "url": "https://www.reddit.com/r/PESU/comments/1abzwsb/seeking_insights_on_mca_program_college_life_and/",
    "permalink": "https://reddit.com/r/PESU/comments/1abzwsb/seeking_insights_on_mca_program_college_life_and/",
    "score": 3,
    "upvote_ratio": 0.800000011920929,
    "created_utc": 1706321980,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "kjs6v0b",
      "body": "I am a final year MCA student\n\nCollege life is fun, faculties are decent but some of them are a pain.\nYou will have fun\n timings are from 8:00 AM to 3:00 PM\n\nAnd will get to 4:00 or even 5:00 as you move ahead semester wise (not everyday though) \n\nFor example: in 3rd semester, we had classes from 8:00 to 1:00 \nSince you need time for the capstone project \n\n\nNow coming to the most important part \n\n\n******* PLACEMENTS **********\n\n\nYeah, they are terrible. This year there have very less companies that have come, even those who came prefer B.Tech more \n\nAnd if you have less than 6 CGPA in 10th and 12th\nThen, it's a big problem for you\n\nIt's not like we aren't focused or don't care\nEven if you are well versed with Full Stack, can solve 100s of problems\nThey'd still remove you based on your 10th and 12th marks\n\nOverall, for placement I'd recommend getting referred by someone you know or try off campus since we've lost all hope on this college\n\n\n\nI hope I haven't scared you away\nIt's a good college but the pressure is high the moment you come, you gotta be competitive\n\nAll the best"
    }
  ]
}