{
  "id": "1aet7oz",
  "title": "5th sem electives CS",
  "content": "Hey seniors can you tell what options will we have for 5th semester cs? (Preferably for data sciences)",
  "metadata": {
    "root_comment_id": "kka7z9r",
    "post_id": "1aet7oz",
    "author": "calmmonkee",
    "url": "https://www.reddit.com/r/PESU/comments/1aet7oz/5th_sem_electives_cs/",
    "permalink": "https://reddit.com/r/PESU/comments/1aet7oz/5th_sem_electives_cs/",
    "score": 2,
    "upvote_ratio": 1,
    "created_utc": 1706633954,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "kka7z9r",
      "body": "You'll have quite a few options, the most popular being DATA ANALYTICS and Graph theory for e1 and e2 respectively, I don't know your Gpa, but take easy electives if it's below 7. Easy ones being hci and some other elective. I personally enjoyed Da. Graph theory for me wasn't so enjoyable.\n├── For me easy is being able to score S, so hci is not easy\n├── HCI has not been easy since 2 years now xD\n└── I mean i have a close to 9 gpa and also wanted to dive into data science field as I find it interesting\n    └── Last year a lot of people took big data and data analytics. This year I'm not too sure. Subjects are added and removed every year so don't fix yourself on one subject (unless it's extremely popular)"
    },
    {
      "id": "kkaa72w",
      "body": "Take Applied cryptography and computer network security if you're into cybersecurity"
    },
    {
      "id": "ko93b58",
      "body": "I'm not from CS. But don't choose electives out of interest. Choose the easiest one's will help your grades a lot. Thank me later.\n└── This is not a good idea for CS. Plenty of people do terrible in \"easy\" subjects because they dislike the subject. \n\n\nOP take what you are interested in. Knowledge and curiosity is more important than gpa. \n    ├── Also taking courses you are interested in helps when from a Master's point of view when they assess coursework related to your field of interest.\n    │   └── Yup every bit of relevant experience helps.\n    └── But in the end while placements, GPA is what matters. I have seen lot of people from ECE struggled during placements because of low GPA from these elective subjects.\n        └── ECE has lots of issues with respect to placements. GPA is one among many. Companies don't really need/want electronics nowadays."
    }
  ]
}