{
  "id": "1aisq18",
  "title": "Changing college",
  "content": "I'm currently in my 2nd semester and if I want to go to another college, does PES allow it? If so, please tell me how to go about it. Thanks!",
  "metadata": {
    "root_comment_id": "kowhkk4",
    "post_id": "1aisq18",
    "author": "Virulence2",
    "url": "https://www.reddit.com/r/PESU/comments/1aisq18/changing_college/",
    "permalink": "https://reddit.com/r/PESU/comments/1aisq18/changing_college/",
    "score": 17,
    "upvote_ratio": 1,
    "created_utc": 1707066430,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "kowhkk4",
      "body": "I mean it's not like they'll lock you up, but they'd definitely keep the year's fee i think"
    },
    {
      "id": "kowkr3v",
      "body": "Big decision, think and take. Yep they will allow"
    },
    {
      "id": "kown9mg",
      "body": "Like u want to take lateral entry in some college in 2nd year/3rd sem or starting fresh from 1st year?\n└── Lateral entry"
    },
    {
      "id": "koxfzz5",
      "body": "Just clarifying - your obtained credits will not transfer over and you'll have to clear the first year again at whichever college you choose. You'll also have to pay a hefty fee as fine (which is rumoured to be around 1 year of fees for your seat) for leaving your degree. If you're okay with these consequences, only then make that decision.\n├── Lateral entry doesn't work?\n│   └── This will depend on the college you are entering from 2nd year. But as far as I'm aware, PES does not allow transfer of credits. Some other colleges (like RVCE) do, but there have been similar instances of people leaving PES only to start from the first year again. It's best to speak to both parties before making a decision. \n\nAnd if you don't mind me asking, why are you trying to leave?\n│       └── I mean, I'm kinda stuck now bro. Most of my pre University friends are here but I'm not able to adjust to the environment somehow. I kinda feel left out even though there are people around me. Any advice on how to go about that?\n│           └── when u go to a new college for the 2nd year it'll still be the same because they would have already bonded over that 1year.  \nand also i think lateral entry is very hard to get, so please try to socialise more and adjust to your environment.\n\nif its really not possible and uve completely given up on it, then yea request both the parties for lateral entry  \ngood luck!\n└── Like one year of fees + fine worth fees of one year one will be losing, right ?\n    └── Yes\n        └── Are you sure ?\n            └── As in my original comment: the fine is rumoured to be pretty high. I do know there *is* a fine. I do not know the amount since its speculated to be as much as an entire year."
    },
    {
      "id": "kozg6mc",
      "body": "Lmao,I was changing my college to get in pes,\nThat's Reverse card ♦️\n└── the trade is happening\n    └── A pest for a PESt"
    }
  ]
}