{
  "id": "1aqho59",
  "title": "What is the minimum jee percentile needed for cse?",
  "content": "Basically what the title says.",
  "metadata": {
    "root_comment_id": "kqd0a0r",
    "post_id": "1aqho59",
    "author": "SiRex750",
    "url": "https://www.reddit.com/r/PESU/comments/1aqho59/what_is_the_minimum_jee_percentile_needed_for_cse/",
    "permalink": "https://reddit.com/r/PESU/comments/1aqho59/what_is_the_minimum_jee_percentile_needed_for_cse/",
    "score": 22,
    "upvote_ratio": 1,
    "created_utc": 1707897369,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "kqd0a0r",
      "body": "Just go to another college trust me\n├── Why?is it that bad?\n└── I got 94.74 ,what are my available options. Other pvt exams haven't been conducted yet but why not to consider pes "
    },
    {
      "id": "kqd64y4",
      "body": "Bruvv, now i am in 2nd sem and seniors were right all alongg, clubs are shit, crowd is crazzyy, not worth, i feel sad why’d i come. Go to bits and all wayyy better\n├── Through which quota you came KCET/Management/PESSAT\n├── Wait bro just 1st Year u will see how good it's going to be as you go\n│   └── Lmao\n├── They have to get know BITS if they don't get they have to join PES only know\n└── They have to Get the Colleges Better than PES if not they Have to Join PES only."
    },
    {
      "id": "kqd6yki",
      "body": "Ik a guy who got ece at rr for 95 percentile, so i’m assuming more than that"
    },
    {
      "id": "kqd7b5x",
      "body": "Don't\n├── They have to get the Colleges better than PES First. PES Is a Good College For Karnataka that's it.\n│   └── I don't disagree. I too joined PES because I was left with no better options but I'm just being realistic here. The 4.5 lakh fee is not worth it at all unless you join as a kcet student, the management sucks ass, the student intake is too high, and the academic pressure is a lot worse if you compare it with other colleges in blore. I could go on.\n\nAnyway I'm just saying that people should look at both sides before joining the college.\n│       └── How do you say Management Sucks ??\n│           └── my guy, your entire comment history is just you being extremely defensive about a college that doesn't give a shit about you. go touch some grass\n└── The Capacity in RVCE is 1500 The Capacity in BMSCE is 1800 The Capacity in PES(Main Campus) is 1620 The Capacity in PES(EC Campus) is 1080 Just the Thing is PES is Computer Science Centered College"
    },
    {
      "id": "kqd7jj2",
      "body": "Name your options ,choose PESU only if you have no better option.\n└── Brother  , can you tell priority order for this \n\nRVCE cse >> MIT Manipal CSE > PESU CSE > VIT CSE > Ramiah CSE > BMS CSE \n\nIs this correct ?\n    ├── Um ig RIT CSE > BMS CSE > VIT CSE dont get me wrong here but VIT is messed up cuz of too much intake and competition i would tell to go with VIT CSE only if ur getting category 1 fees anything more than category 1 not worth imo\n    │   └── Lmao ramiah would be the last among all these\n    │       └── LMAO sad truth xD\n    ├── If you are getting in through kcet then I would place BMSCE above PES and VIT at the end\n    │   └── Ohh...thanks ....i m outside karnataka student so will give comedk \n\nAlso Is MIT Manipal CSE better than PESU CSE \n[ Fees not an issue ]\n    │       ├── Mit manipal cs>pes I made a mistake not taking manipal don't do it, clg life ,clubs r much better there\n    │       │   └── Thanks brother\n    │       └── 4 years back I would say PES over MIT but now I’m inclined to say MIT\n    │           └── Ohh i see ....\n\nWhats the avg of PESU CSE ??\n    │               └── Don’t choose college on average, consider other aspects like name, alumni network, campus, batch strength, fees etc\n    ├── Id acrually say RV PES around the same level for CSE (debateable tbh) > VIT > Manipal > Ramiah> BMS\n    └── W Order but bms equal to pes , then vit then ramiah\n        └── Msrit is much better than bms. Crowds better campus is better. Bms is overcrowded in a small campus."
    },
    {
      "id": "kqd8hoc",
      "body": "These 4 years are a golden period of your life, don't go to PES and waste it 💀"
    },
    {
      "id": "kqddsji",
      "body": "Bro PES is best College in Bangalore\n└── um ayo wha\n    └── You are in MSRIT Right ??\n        └── Nahh iiit Bangalore, rvce , iisc , and almost equal to msrit or bms\n            └── iisc,iiitb,rvce,rit=bms=pes roughly this order"
    },
    {
      "id": "kqddxtq",
      "body": "One thing is if you are not getting IIT, NIT, BITS, Manipal, VIT then you choose PES"
    },
    {
      "id": "kqdens7",
      "body": "One more thing don't get misguided by these comments if you're Not Getting IIT,NIT,BITS, Manipal Then Choose PES. PES Is a good College But not as Much as Above Colleges\n└── Bro ru a PR hired by pes?\n    └── Bro no Just seeing what would be the reactions to my comments 😂😂😂. This is not real\n        └── Which college r u from bro?"
    },
    {
      "id": "kqdhin5",
      "body": "How Many ever People are there the Number of people in a Class is Going to be 60-70 Students\n└── But the instake is 1400 odds nd if  u combine both the campuses and this year onwards they have aiml in both campuses too .....just imagine the competition pool for placements\n    └── No cap half the batch would be unplaced"
    },
    {
      "id": "kqdr5t8",
      "body": "So to this argument what I would say is RV , PES , BMS are all almost same in terms of placements(For CSE).So if you want College Life then BMS If you want the Best Placement RV. If your life is Studying you love Studying Like Studying also Get a Good Placement then Join PES.Also One More Point is in PES Is you may get a Little bit more Exposure because First Year is Mixed.Alao There's Minors and all. Anyways Which ever College upskill Yourself for Getting a Good Job. Love Coding, Like Coding,do Coding with most Interest."
    },
    {
      "id": "kqelf1a",
      "body": "SEE I AM A KCET STUDENT AND A DAY SCHOLAR SO I PAY ONLY 1.2 LAKHS PER YEAR FROM READING THIS SUB REDDIT I SEE THAT MY FROM PESSAT HAVE REGRETTED BY PAYING 4.6L PER YEAR PLUS SOME ARE PAYING PESSAT FEES + HOSTEL FEES SO IT WILL MAKE IT ABOUT 6L -6.5L SO OF COURSE THE FACILITIES PES ARE NOT FOR 6L PER YEAR BUT FOR A KCET STUDENT IT'S FINE.\n└── **MANY"
    },
    {
      "id": "kqem2eg",
      "body": "SEE I AM A KCET STUDENT AND A DAY SCHOLAR SO I PAY ONLY 1.2 LAKHS PER YEAR FROM READING THIS SUB REDDIT I SEE THAT MANY ARE FROM PESSAT AND  HAVE REGRETTED BY PAYING 4.6L PER YEAR PLUS SOME ARE PAYING PESSAT FEES + HOSTEL FEES SO IT WILL MAKE IT ABOUT 6L -6.5L SO OF COURSE THE FACILITIES IN PES ARE NOT FOR 6L PER YEAR BUT FOR A KCET STUDENT IT'S FINE.\n├── Meanwhile SC student paying 500 rs💀\n│   ├── Bro they pay 500 to Kea Later to College they pay the rest\n│   └── So they pay same as other KCET students.\n└── bruh I just saw the same exact comment on another post too💀......nd trust me if you are getting pes with kcet rank there are far better colleges to join other than pes with that rank\n    ├── Can you name a few I think you would say rv bms\n    └── Bro everywhere it's almost the same now I don't know whether you know about other College Conditions or are you a Bengalurean\n        └── its just evident you are gonna go to any extent to defend this college....but it wont   do anything to the change the opinion that majority of the students have about this clg"
    },
    {
      "id": "kqivvzz",
      "body": "dont come to pes...telling you from my experience....clubs are shit......teaching of faculty has just a big time low and they dont even have proper materials for some subjects too.Only the infrastructure is good,Another thing,strength is just too much so placements will have a lot of [competition.You](https://competition.You) cant even step outside during break hours that crowded it is\n├── The Capacity in RVCE is 1500 The Capacity in BMSCE is 1800 The Capacity in PES(Main Campus) is 1620 The Capacity in PES(EC Campus) is 1080 Just the Thing is PES is Computer Science Centered College\n│   └── In the above comment I am Mentioning the total Capacity\n└── Yes it has Competition but Never think that even if you are in BMS having Chill Life you can get a Good package everything needs Hard work. If you have around 6 CGPA don't think you will get a Good package understand that first."
    },
    {
      "id": "kqixam0",
      "body": "The Capacity in RVCE is 1500 The Capacity in BMSCE is 1800 The Capacity in PES(Main Campus) is 1620 The Capacity in PES(EC Campus) is 1080 Just the Thing is PES is Computer Science Centered College\n└── In the above comment I am Mentioning Total Capacity"
    },
    {
      "id": "kqiy35f",
      "body": "In Colleges Like RV BMS MSRIT Instead of Keeping only CS Branch they have kept CS(Cyber Security),CS(Data Science) if you add them the Capacity in RV is around 700 Students The Capacity in BMSCE is around 1000 The Capacity in MSRIT is around 600 Students."
    },
    {
      "id": "kqiy956",
      "body": "The Capacity of CS and AIML together in PES(Main Campus)and PES (EC Campus) is around 1900"
    }
  ]
}