{
  "id": "1ayo6c2",
  "title": "Demanding 1 week time before ISA prep and gaps between exams and 3 weeks time to prepare for ESA before ESA starts with more study holidays between the exams",
  "content": "I'm in CS 4th sem and I want 1 week time to prepare for ISA after all of our faculties finish with ISA portions. Also some 1 or 2 days gap I want between the exams for each subjects. If this happens, we will get more time to prepare for the exam and improve our cgpa. And for ISA2, since there are lot of projects and assignments before this exam, the same thing should be done for ISA2. And for ESA, at least 3 weeks time should be given before ESA starts. And more days of gap between the exam for each subjects. So while giving the signature for the FAM thing, let us all write that:\n\n 1. After teachers finish the portions, one week time should be given to prepare for ISA before ISA starts and there needs to be 1 or 2 days of gap between the subjects. \n\n2. Three weeks time should be given for preparing for ESA,  before ESA starts and more number of days study holidays should be given between the exams for each subjects.\n \nWith this almost the entire batch would score a good cgpa, where none of the people would have a cgpa of below 7. So pls let us all write this issue while giving signature in FAM where so much time is required for preparing for exam. I won't be surprised if you call this a skill issue. If you call this a skill issue, then you don't understand the struggle I am going through.",
  "metadata": {
    "root_comment_id": "krw0spd",
    "post_id": "1ayo6c2",
    "author": "Educational-Bee608",
    "url": "https://www.reddit.com/r/PESU/comments/1ayo6c2/demanding_1_week_time_before_isa_prep_and_gaps/",
    "permalink": "https://reddit.com/r/PESU/comments/1ayo6c2/demanding_1_week_time_before_isa_prep_and_gaps/",
    "score": 1,
    "upvote_ratio": 0.41999998688697815,
    "created_utc": 1708757618,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "krw0spd",
      "body": "I'm sure you aren't gonna do dogshit with the extra days you get for ESA. The gap they are currently giving is more than sufficient\n└── No it's not sufficient. And also I would invest in my prep when more time is given.\n    └── Everyone will say the same thing u said and procrastinate up until the end. Also all the points that you put up on the post won't come into effect anyways since they're highly unrealistic."
    },
    {
      "id": "krw2c11",
      "body": "there is no point stretching the exams, in engineering ppl mostly focus on self dev not curriculum exams, the time given for the esa and isa are more than sufficient, no one wants to extend their exams soo much, Rather finish thir exams and do something productive."
    },
    {
      "id": "krw2tg8",
      "body": "Even when there were 3 days between the esa exams most people the day before so giving more days is a waste."
    },
    {
      "id": "krw3994",
      "body": "Your requests have been noted and duly noted - doreswamy\n\nBut seriously though, they've been doing hard relative grading in the past 2 sems so even if on average people write the exam better, grades might be the same"
    },
    {
      "id": "krw4hj5",
      "body": "The college actually doesn't care about whatever cgpa u score as there would always be sufficient  no of people scoring well so I don't think this would ever be implemented"
    },
    {
      "id": "krw4ypx",
      "body": "stop whining and study bro, cse syllabus is so fucking dogwater and you want holidays for that?\n└── Does that mean it’s good or bad\n    └── its much easier than other departments"
    },
    {
      "id": "krw59mb",
      "body": "I agree the gap between ISA part. Doing 2 units in half a day is too stressful"
    },
    {
      "id": "krw5xl4",
      "body": "how about you study just an hour a day eh ?  \nthat works out ?"
    },
    {
      "id": "krw63n5",
      "body": "Sumne odu guru Monday ISA ide ivella dove hodibeda\n└── How am I supposed to know kannada?"
    },
    {
      "id": "krw7eax",
      "body": "Skill issue"
    },
    {
      "id": "krw9emu",
      "body": "ISAs thing is fair, why do you need more gap for ESA? the gap they are providing is more than enough dude"
    },
    {
      "id": "krwds5m",
      "body": "Dude, all this will just make us waste even more time. Everyone is going to study on the day before the exam either way. Also according to you the increase in 6 weeks every semester will be taken from the holidays which absolutely no one wants. People need to go to their hometowns and get internships too. So study instead. Listen in class and the entire day before the internals is good enough"
    },
    {
      "id": "krx59r8",
      "body": " Atleast 1 day gap for ISA of subjects like OS (huge syllabus) should be given.."
    }
  ]
}