{
  "id": "1b07pno",
  "title": "B.Sc Psychology !!!",
  "content": "Hiii, I’m currently doing my a levels but I’m planning to join PESU next year for the psychology course. I actually have my interview this week!!!\nCan someone tell me more about the subject selection and if the college is worth it (p.s. I’m from Mumbai)\nAnd if you could tell me what I should prepare for the interview that would be great tooo :)",
  "metadata": {
    "root_comment_id": "ks66ldi",
    "post_id": "1b07pno",
    "author": "mommyisuues",
    "url": "https://www.reddit.com/r/PESU/comments/1b07pno/bsc_psychology/",
    "permalink": "https://reddit.com/r/PESU/comments/1b07pno/bsc_psychology/",
    "score": 6,
    "upvote_ratio": 0.8799999952316284,
    "created_utc": 1708918420,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "ks66ldi",
      "body": "Username checks out!\n└── You’re the one to talk"
    },
    {
      "id": "ks6pyvh",
      "body": "I'll give you an alternative view on this, I have worked with fee psychology forks (masters and PhD level) as what I found was that while colleges with psychology specialization gives a lot of focus on the subjects they don't have as much of a quality reference to take. Psychology is an applied field and while others might now agree has a lot of parallels to medical areas i.e. those who practice or research in the field are the best to teach.\n\nCurrently I'm at IIM Indore here they have a program called IPM, which is basically a bachelor's but they have a 3 year course with a lot of 12 credits of Psychology, 12 credits of Philosophy, 12 credits of Foreign Language, 24 credits of Research methods and a lot more. You even have dance and skits for credits (optional). I have seen some people leaving the course in 3 years and joining top labs abroad directly or going for a Msc with full scholarship aboard to continue their work in psychology. Psychology is a subject you'll learn best from profs who actively contribute to the field. You can this check TISS or MU or any college where the profs are really good. It's a fascinating degree if you can get a chance. (Don't recommend the same course in other IIMs yet)\n\nBut the best would be go to a college were people actually work in the area and don't just throw the book at you. Rest PES is a good college and i dont have a psychology degree so I can't say much but I feel you'll want more time and mentors for this program it's not something MOOCs can teach you."
    },
    {
      "id": "ks6xw8s",
      "body": "Hey, I'm in my second semester rn. The college is fine but it's wayy more stressful than any other college. About the interview, they'll just ask you basic stuff like why you chose this course and few things about you. It's just a simple procedure, they take in everyone who applies here.\n└── How is the faculty and the job outlook of the department?? Is the curriculum any good? How is the environment for psych students? I see so many reviews for engineering in pes but only a very few for psychology. Could u please let me know how it is since i would most likely to join there for the same course\n    ├── a month late but, the faculty are not it but you shouldn't really be focusing on that. One thing I learnt is to rely on myself and not them. The instructions are not consistent and they are basically a mess with planning. As of now two professors are godly with their subject knowledge, you can learn a lot from them. The others are mid but psych is a self-study friendly field so that's not really an issue.  \nThe curriculum is alright, but I'd recommend to use the textbooks provided and not the slides. But use the class slides as guideline for what to study from the given textbook.  \nThe environment is stressful. The workload is over the line and exams will feel like vacation. You can give up on sleep and most of your hobbies if you are intending to join. I am unsure of the Job outlook as the department only started in PES in 2022. But there is a professor with good enough connections and awareness of what to do so I don't think that will really be an issue.   \nPsych has a bit of the school disciplinary environment which is a problem for many here.\n\nBut I don't really mind all of this even if I do complain at times. The main issue of the students in psych is the way the professors behave. But for me none of this is a big problem so its fine. I'm here for the resources and not for the way they treat me.\n    └── a month late but, the faculty are not it but you shouldn't really be focusing on that. One thing I learnt is to rely on myself and not them. The instructions are not consistent and they are basically a mess with planning. As of now two professors are godly with their subject knowledge, you can learn a lot from them. The others are mid but psych is a self-study friendly field so that's not really an issue.\nThe curriculum is alright, but I'd recommend to use the textbooks provided and not the slides. But use the class slides as guideline for what to study from the given textbook.\nThe environment is stressful. The workload is over the line and exams will feel like vacation. You can give up on sleep and most of your hobbies if you are intending to join. I am unsure of the Job outlook as the department only started in PES in 2022. But there is a professor with good enough connections and awareness of what to do so I don't think that will really be an issue.\nPsych has a bit of the school disciplinary environment which is a problem for many here.\n\nBut I don't really mind all of this even if I do complain at times. The main issue of the students in psych is the way the professors behave. But for me none of this is a big problem so its fine. I'm here for the resources and not for the way they treat me.\n        └── Thanks much mate, rlly appreciate it"
    },
    {
      "id": "ks7566b",
      "body": "https://www.youtube.com/@Otaku-kf1ie \n\n\nSubscribe this channel "
    }
  ]
}