{
  "id": "1b27r9u",
  "title": "Pesu IO",
  "content": "Planning to buy a course (tensor flow) on pesu io is it worth it?",
  "metadata": {
    "root_comment_id": "ksjj4im",
    "post_id": "1b27r9u",
    "author": "Kitchen_Dare_6675",
    "url": "https://www.reddit.com/r/PESU/comments/1b27r9u/pesu_io/",
    "permalink": "https://reddit.com/r/PESU/comments/1b27r9u/pesu_io/",
    "score": 4,
    "upvote_ratio": 1,
    "created_utc": 1709131653,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "ksjj4im",
      "body": "As they've increased the cost, I don't think these courses are worth it anymore. U could find better content on YouTube.\n\nOne thing these courses have going for it is that it fits into ur pes schedule so u will definitely finish the course.\n└── I was looking for a certification too so any input on that?\n    └── Look for certifications on sites like udemy or Coursera, these have more comprehensive content and more worth than pesu io."
    },
    {
      "id": "ksk4wcj",
      "body": "No lmao , you can find better content on YouTube or literally anywhere. Why do you want to pay to learn something from another student when you could learn from professionals online for free?\n\nPesu io only benefits the SMEs cus they can put it on their resume while you recieve mediocre knowledge and a certificate which adds nothing to your profile\n\nPeople might hate me on this but pesu io was just a waste of time for me.\n├── Fair enough\n├── Fair, I took a DIP PESU I/O Course, but I later found better content on Udemy, which covered more than what was covered in this PESU I/O Course \n\nBut what I really liked was only the Flutter Course, I took back in my 2nd sem. It was amazing. I learnt a lot through that.\n\nBut the third course I took (forgot which one xD), wasnt worth it.\n\nWith the increase in price for it now, simply its useless. it only benefits the SME\n├── Hmm. That’s one way to look at it. But PESU I/O SMEs provide peer to peer mentoring. In Udemy and YouTube you will have a QnA forum. Here SME is approachable anytime and things get cleared at a personal level. Also my SME helped me post the course also. I took a course on Sensing with Sensors and the SME helped me with various topics in Hackathons and other Mini Project. My IO SME in another course helped me to publish my paper as well. This personal connect with benefit student a big time. Notes, Placement Prep, ISA important topics etc… my SMEs and seniors were helpful in many ways. \n\nIn a nutshell, don’t just think about the course… That you can buy a textbook and also read. It’s more of a real world exposure with someone who is slightly senior than you and seen horrible things in PES. I think it should be really worth considering these things than only money aspects. \n\nGo for it buddy. You will learn something for sure. \n└── I mean sure you could learn the same courses online on any platform ud like, but whats different about this is that ur own seniors(who know their shit) would be taking the course and that means you have the freedom to treat them as ur own friend which honestly something I loved being an introvert myself.  \n  \nplus its a good way to network and meet people with the same interests too, so it was win win for me.\n    └── It all made sense while it was free tho. Not anymore\n        └── bro their courses are certified you don't seriously expect them to give it for free???\n            └── Lmao wt 🤡 pesu io isn't even recognised by companies you really expect the certification to have any value at all?\n                └── my guy, professional certificate it is 🤡 it gets recognized on your CV just as much coursera or udemy\n                    └── Lmao imagine putting Coursera or udemy certifications on your resume 😭 good luck with that mate\n                        ├── My guy do you understand what the purpose of a certificate is 🤡🤡 \n\nThere are so many people who brag about a certified course they have taken on Udemy or Coursera on their CVs. This the stupidest shit I have ever read fr  🤦🤦\n                        │   └── People who brag about certificates and not projects have an L resume sorry.\n\nSeems like you have never met people who have given or taken interviews don't yap over here\n                        │       └── Gotta tell you this statement coming from a fresher is very convincing.\n                        │           └── Damn bro okay good luck with pesu io hope you enjoy it to the fullest . Hope the certificate adds value to your resume and takes you to new levels in your career.\n\nPesu io is the best peer to peer learning platform on the planet even beating Stanford\n\nHope you enjoy pesu io!!! \n\nCheers lad bye\n                        └── Any certificate is only meaningful if you have some projects related to that. Coursera courses usually dont give you projects at the end of the course, they just end with an MCQ assesment, the answers for which you will find online. All the courses in I/O have a lot of hands on projects ( I believe its one of their USPs). Stuff you can showcase on your github or protfolio. This hands on experience can give your first big break in landing an entry level research internship at CoEs or outside or even a freelance work."
    },
    {
      "id": "ksmdtc5",
      "body": "Wait they charge money for PESU IO now?\n├── Oh lmao yes. Times have changed. For us it used to be free, now it's more than 1k.\n│   └── Disgusting. When I was there, the courses were mediocre at best. I remember the hiring that they had and their unprofessional behavior. Charging just seems greedy\n│       └── why \"unprofessional\" bruh?\n│           └── They held interviews to hire first year students when the year ended, and I got selected to the second round for design. They had me meet the founder of the IO startup and he was interested in my work, and asked me to mail him a few samples which I did, he said he would get back to me, and never did. Through the summer, they had me in contact with somebody from their team and that person kept saying stuff like \"the founder is busy, I'm not sure what he's up to\" blah blah and they basically never told me if I'm in or not or when they would tell me what happened.\n│               └── So, they basically ghosted you?  \nThis is really sad and disgusting\n│                   └── Lol yeah. They did this to somebody else too\n├── Yup and I got scammed hard after choosing webdev io course. I really thought I could learn everything from basics🤡\n└── Disgusting. When I was there, the courses were mediocre at best. I remember the hiring that they had and their unprofessional behavior. Charging just seems greedy"
    },
    {
      "id": "kt9yiwy",
      "body": "Well might be late here but the thing is, it's a gamble. Speaking as an SME and a fellow course attendee as well, I think it really depends on your SME. It's important to know something about your sme before registering for a course, try asking your friends about the course you have in mind or network with seniors for the same. Get feedback and then go for the course. If the SME is good, you would definitely have a great experience like I did back when I took my course !"
    }
  ]
}