{
  "id": "1b39xqa",
  "title": "Degree Certificate / Proof of Conpletion? ",
  "content": "Hello !! \nSo I’m in my 8th sem rn and was wondering an approx date they usually give out a hard copy of the degree certificate ? Or when they give a soft copy of proof that we completed our degree to show employers after graduation in case the degree certificate hard/soft copy has not been generated? \n\nOr do people usually show their final transcript with all the credits n grad date?\n",
  "metadata": {
    "root_comment_id": "kssszoa",
    "post_id": "1b39xqa",
    "author": "WalrusWonderer444",
    "url": "https://www.reddit.com/r/PESU/comments/1b39xqa/degree_certificate_proof_of_conpletion/",
    "permalink": "https://reddit.com/r/PESU/comments/1b39xqa/degree_certificate_proof_of_conpletion/",
    "score": 6,
    "upvote_ratio": 1,
    "created_utc": 1709237364,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "kssszoa",
      "body": ">an approx date they usually give out a hard copy of the degree\n\nThe actual degree is given out only during your convocation ceremony, which happens in July/August. Note that there is no soft copy of the actual degree available until you yourself scan the hard copy, instead you can get something called a \"provisional degree certificate\", explained below:\n\n>when they give a soft copy of proof that we completed our degree\n\nYou can submit a request for a provisional degree certificate (PDC) the moment all your grades for all 160 credits of your degree are available and the department considers you as being eligible for the degree. This means after evaluation of all special topics and internship grades of 8th sem as well, which usually happens by end of May.\n\n>do people usually show their final transcript with all the credits n grad date\n\nFinal transcript with graduation date is only available at the time of convocation too. However you can generate a provisional transcript as well. The timeline follows the same as the PDC - needs to be done after all evaluations are completed, usually by May.\n└── This is really helpful, thank you so much!!! 😃\n\nThey released the calendar of events stating 8th sem results will be announced on June 3rd, if I apply for a PDC the next day, how long will the process take? \nAnd is the PDC a hard copy or a soft copy?\n    └── You can apply for PDC once they release the forms for it, usually it's a few days after the day results release. And once you apply, it takes another few days for them to generate it. The PDC is a hard copy - you'll be expected to visit college and pick it up.\n        └── Alright, and the provisional transcript follows the same timeline but is a soft copy?\n            └── Hard copy as well.\n                └── Alright, thank you so much for the information!!"
    }
  ]
}