{
  "id": "1b3t3c1",
  "title": "Fresher 2024-25 wanna know about pesu!! ",
  "content": "Hey there,  thinking to join pesu for btech, and have been applied pessat. How's college life and hostel food?, I'm from karnataka itself so idts it might be a huge difference.And any important topics that i have to cover for pessat ? Or anything important that I've to know before joining pesu which you really want to share? ",
  "metadata": {
    "root_comment_id": "ksufp1z",
    "post_id": "1b3t3c1",
    "author": "alienofgreenheart",
    "url": "https://www.reddit.com/r/PESU/comments/1b3t3c1/fresher_202425_wanna_know_about_pesu/",
    "permalink": "https://reddit.com/r/PESU/comments/1b3t3c1/fresher_202425_wanna_know_about_pesu/",
    "score": 5,
    "upvote_ratio": 0.8600000143051147,
    "created_utc": 1709296016,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "ksufp1z",
      "body": "Hey, I'm in 2nd Sem right now and college life is really good as long as you select a good group of friends to hangout with, learn to balance both academics and extracurriculars and you'll be good. Initially it will be a difficult adjustment ( It was for me atleast) but eventually you will get there. I can only speak for 1st year subjects and they are pretty good, not that hard if you pay attention in classes and are consistent with your studies. \n\nFor PESSAT, you will be able to do well if you have already prepared well for JEE. In my opinion no preperation is required if you already know and can solve things covered in JEE.\n\nRegardless of what college you decide to join you will have to face new challenges you haven't faces before so be resilient and be mentally prepared for anything. Try not to get distracted and stay focused on your goals. Prioritise and plan for your future. \nAll the best!\n├── Thank you ill consider it\n├── There is kinda information regarding pessat that it will be harder than  jee  . Is that true? Since I got 83% in mains\n│   ├── It will be Tougher Than KCET But it will be Comparatively easy than JEE Mains and BITSAT\n│   └── It WILL be a Mixture of BITSAT,Mains,KCET\n│       └── Cool thanks\n├── Do you have any insights on PESSAT ? how many marks will i require to get a rank of 600 ?\n│   └── Nope I just wrote mains and going to write kcet\n└── Brother , what is avg package for cse in pes ?"
    },
    {
      "id": "ksumhya",
      "body": "Name your options in hand\n└── Pes, Nitte (manglore), or any other banglore colleges if I get it through kcet, ik I can't get into nit /iit\n    ├── Write Comedk Also\n    │   └── I'll try\n    │       └── U can't get into PES through comedk tho\n    ├── PES over Nitte any day, can try for BMSCE and MSRIT as well\n    │   ├── Sure\n    │   ├── BMSCE is a good choice but I really didn't like MSRIT and it's location is also kinda bad (personal opinion).\n    │   └── Is PES packages comparable to RV for cs branch ?\n    │       └── You got to account the batch strength as well, PESU’s CSE is close to 4-5x of RV’s, most of the companies visiting RV visit PESU as well so you won’t be missing out on opportunities.\n    │           └── can I dm you ?\n    │               └── Sure\n    ├── PES over Nitte any day, there is no comparison tbh! If you can get PES CSE then no need to think about other colleges, unless if you can get into RV for CS or IS.\nMy priority in 2018 was RV, PES, MSRIT, BMSCE.\nHope it will give you some insight, Good luck!\n    │   ├── Never understood why people nonsensically hype up PES like it's some CMU, both PES and Nitte are tier 3 colleges afterall and neither one has a substantial leverage over the other.\n    │   │   ├── My views are as an alumni of PES and also having close friends from Nitte. And I don’t know on what basis a random person will ever know the “substantial leverage”.\n\nPretty sure you got no clue about both, and no points for bringing CMU to this convo.\n    │   │   │   └── Haha. I'm about to be an alumni of shitty PES. Packages are up to an individual's skills and capabilities and I stand firmly by my opinion that it necessitates a comparison to CMU and both PES and Nitte are more or less the same.\n    │   │   └── Does nitte give 12+ lpa packages to many people, they have outdated syllabus with shitty student body. \nBy your theory no indian clg has an edge over other coz sm1 in Germany doesn't know any of them\n    │   │       └── It's up to an individual's capability in cracking placement offers.\n    │   │           └── Will individuals bring companies to the college? Your friends grp,teachers ,all play a role. By your logic even iit is tier 3\n    │   │               └── IITs are different, I didn't even bring them into discussion.\n    │   │                   └── IITs r good mainly coz of the placements and peer group , y do u think it doesnt apply for pes vs nitte\n    │   │                       └── Peer group maybe better @ PES but at the end of the day  they are merely teaching universities unlike IITs\n    │   │                           └── That's true , nothing apart from acads happen in pes.\n    │   │                               └── That's exactly what I've been saying. It is just like any other Tom, Dick and Harry university.\n    │   │                                   └── Yeah but again, I don't think every Tom Dick harry uni gets 200 companies to clg\n    │   │                                       └── Well, that's due to location advantage and obsession with comp sci, which won't make it a class apart.\n    │   └── Thanks man\n    └── Not nitte coz I heard that ppl are mass cheating in their exams to get into the college like undeserving ppl {not sure(don't want to get into trouble lol)}"
    },
    {
      "id": "ksv0gma",
      "body": "2022 pass out. Take pes only for CSE. I don't know how AIML is doing. It just started. Mech, EEEand even ECE to some extent are overshadowed by the CSE mammoth. And yes, if you're financially well off (read too rich) then take admission through pessat. Middle class means don't consider pessat or jee. Kcet should do. Else PESSAT fees is not worth it even for CSE. 24 lakhs total fees. Plus hostel if needed. That is almost as costly as IIM Bangalore. Trust me it is good for CSE placement wise. Social life and all, I wasn't lucky to have one. My fault too.\nI recommend speaking to the students about the academics. It's way too rigorous as compared to other colleges.\n└── Basically I can afford through pessat, but I belong to kinda traditional family so dad is looking for strict colleges lol! So he didn't let me write mite (manipal) so whether hostels good? Safety wise\n    ├── From what I've heard the girls hostel is not that great except for one building ig. The girls hostel is also located outside campus and there is a bus facility consider this if you're thinking about safety.\n    │   └── Pg's are they good? Arround 500 meters? Or 1km ?\n    │       └── I don't know much about Pg's for girls. Apparently the food sucks in the boy's Pg's.\n    └── PES is a strict clg and basically no ragging. Idk about RR campus but the girls hostel of EC campus is kinda far. And I heard wardens there are also very strict..\n        └── Coola\n            └── Cool*"
    },
    {
      "id": "ksv8pv5",
      "body": "im an northindian will i face racsim in south india for not speaking kannada??\n├── In PES no one really cares about where you're from. You'll meet a lot of people from all over the country. \nI havnt seen anyone being racist cause someone was from the north.\n├── r/bangalore\n├── Nah, nobody gives a fuck\n└── Look racism is everywhere it doesn't depends on place but on person, and I'm not yet pesu student so I don't know but currently  I'm doing my 12th in XYZ college where some of rajasthani people's are studying and  most of the time we communicate through English aur kabhi kabhi hindi ( and they  know kannada) we share each other's culture , and i have to say those people are really good,we respect each other and I kinda know marwadi because of them. For good local experience it's better to learn respective state language either kannada, tamil, telugu, malyalam. Have a open mind to learn and adjust .I mean why so resistance to learn a language man? and Yes, people of South are really different so you cant expect everyone to know hindi."
    },
    {
      "id": "lr3s7ni",
      "body": "I have got pes(rrc) cse(aiml) through kcet. \nAny advices for me?? "
    }
  ]
}