{
  "id": "1b3xhqy",
  "title": "HashCode 12",
  "content": "Hey guys, I saw a banner of a hackathon called Hashcode. Wanted to see if it's a good event and if it is, would anyone like to make a team to participate in this event??\n\nApparently they give out paid internships during the summer as well?",
  "metadata": {
    "root_comment_id": "ksvdc8v",
    "post_id": "1b3xhqy",
    "author": "AdPublic1057",
    "url": "https://www.reddit.com/r/PESU/comments/1b3xhqy/hashcode_12/",
    "permalink": "https://reddit.com/r/PESU/comments/1b3xhqy/hashcode_12/",
    "score": 8,
    "upvote_ratio": 1,
    "created_utc": 1709308143,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "ksvdc8v",
      "body": "Yes, PIL (PES Innovation Lab) internship.\n\nAnd yes its a really good hackathon , try for it\n└── Hi, I'm actively looking for a teammate or willing to join an existing team. Please DM if you're interested. And, the registration closes tonight.   \nThanks!"
    },
    {
      "id": "ksvluj4",
      "body": "Hello!\nPES Innovation Lab is the organiser of the Hack. We are the oldest technical club of PESU right now and Hashcode is also the oldest Hackathon of PESU still running (and imo the best one). Don’t worry if you are a beginner, this hack is for everyone, the main criteria is innovation! Worst case you’ll learn a lot and have a memorable experience. For winners there’s cash prizes(1.25L prize pool) and top 10 teams get direct interview round for the paid summer internship we offer. Our cloud sponsor E2E networks who is also one of the biggest cloud hyperscalers in India will be providing us with some really good cloud GPUs so you don’t have to worry at all about your ML compute :) We have an extensive alumni network from unis like UCSB, NYU, CMU, ETH and companies like Cisco, Couchbase, etc who’ll be mentors in this hackathon as well as the internship. Please do participate!"
    },
    {
      "id": "kt00sw8",
      "body": "Hi, DM me, I'd like to consider, since I have no team either \n└── Hi, I'm actively looking for a teammate or willing to join an existing team. Please DM if you're interested. And, the registration closes tonight.   \nThanks!"
    },
    {
      "id": "kt43y0y",
      "body": "Can a beginner join? Who just knows basics of python and some languages\n├── i believe so. There are some problem statements that look like they can be done. I think it's also on \\_how\\_ we solve it more than actually solving it. That's what I heard\n│   └── Hi, I'm actively looking for a teammate or willing to join an existing team. Please DM if you're interested. And, the registration closes tonight.   \nThanks!\n└── Hi, I'm actively looking for a teammate or willing to join an existing team. Please DM if you're interested. And, the registration closes tonight.   \nThanks!"
    }
  ]
}