{
  "id": "1b7zzh6",
  "title": "Plz clear my doubt",
  "content": "I have a backlog from first sem and I m a hostelite.If the back exam is during the holidays after second sem,will I have to stay back in the hostel to write it??\n",
  "metadata": {
    "root_comment_id": "ktlzfd3",
    "post_id": "1b7zzh6",
    "author": "Right-Nail-8197",
    "url": "https://www.reddit.com/r/PESU/comments/1b7zzh6/plz_clear_my_doubt/",
    "permalink": "https://reddit.com/r/PESU/comments/1b7zzh6/plz_clear_my_doubt/",
    "score": 6,
    "upvote_ratio": 1,
    "created_utc": 1709732530,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "ktlzfd3",
      "body": "The backlog exams will be together with your second sem exams\n├── Then when do people write their 2nd sem backlogs exams?\n│   └── They can clear it during subsequent semester exams\n└── There's also an option to write it in the summer if I'm not wrong, or there used to be atleast"
    },
    {
      "id": "ktlzoog",
      "body": "Afaik it will be in the middle of the second sem exams. Like in one of the preparation holidays between two second sem subjects, you will have the backlog test. \n\nIt will get real hectic real fast. Study from now\n└── Oh,so are there chances of two exams on the same day?I have a back in mech.Will I have to write it with them while they write their normal esa??\n    └── No. It will be in the preparation holidays. Never will you write two ESAs on the same day\n        └── That's good news\n            └── Can't always depend on that tho. I have seen people write backlogs in the morning and their ESA in the afternoon. You can give it during second sem's ESA or in the summer.\n                └── So there will be two backlog exams.One with the normal esa and the other in the summer.Am I right??\n                    └── Yes. You can take up backlog with your regular ESA or during the summer."
    },
    {
      "id": "ktm1bte",
      "body": "Oh that's good"
    },
    {
      "id": "ktqsz4i",
      "body": "Your wish you can travel up and down and write as well"
    },
    {
      "id": "ktqxl9u",
      "body": "Best if you finish it off during the sem holidays or it may interfere with your next sem exam timetable. It won't overlap but it will eat your time to study for the next paper. Don't stay at the hostel if you can travel just for that day and finish your paper."
    }
  ]
}