{
  "id": "1b8nd63",
  "title": "PES or MIT Manipal?",
  "content": "I'm planning to join either one of these colleges for MCA but, I don't know which one to choose. The Neighbours tell me to join PES blindly but, this subreddit tells a whole different story. MIT Manipal seems really good too. \n\n  \nPlease do shares your opinion's and thoughts, I just want to take the best sensible decision for myself before I regret anything.\n\nI come from a tier 3 college in Bangalore which runs like a school, there are no fests, non existent placements, strict and stupid rules (Can't get out of the campus before 3:45PM and can't go in after 8:45AM etc etc. ",
  "metadata": {
    "root_comment_id": "ktrmaoq",
    "post_id": "1b8nd63",
    "author": "Crazy_Maverick_18",
    "url": "https://www.reddit.com/r/PESU/comments/1b8nd63/pes_or_mit_manipal/",
    "permalink": "https://reddit.com/r/PESU/comments/1b8nd63/pes_or_mit_manipal/",
    "score": 11,
    "upvote_ratio": 0.9200000166893005,
    "created_utc": 1709791979,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "ktrmaoq",
      "body": "I'm pretty sure Manipal is a better college in every single way. You can have more fun, the rules are less strict. Students aren't treated like prisoners and less ppl kill themselves. Pes used to be a bit less expensive but now  that's also not the case. I think everyone who's at least in 3rd year will agree with me when I say PES is 100% not worth it. You won't have a good time and placements are good in both colleges man. But as a university overall Manipal is way better man. Manipal actually cares about its students man. Pes only cares about its image. If you choose PES over Manipal, you'll 100% regret it. Stay away from PES brodie\n└── Thanks for the reply, if it's possible can you ask some of your friends for their inputs as well, I'd really appreciate it. I got to build a solid case to show my parents.\n    └── Ay you decided something?"
    },
    {
      "id": "ktrwaei",
      "body": "Manipal for MCA hands down. \nPES is more focused on solely courses that sell. Most of the good profs have left, and I've not heard of a very significant placement scene for MCA. \nManipal will also give you relaxed rules and a more liberal outlook."
    },
    {
      "id": "ktsi6op",
      "body": "Manipal anyday, I too joined pes over manipal and I think manipal was easily the better choice, not that pes is bad but manipal is just a proper college experience( the one you see in movies)\nPes is like continuation of your school( 8-4 classes torture, not many extracurriculars, L campus, pollution filled area, equally high fee(through pessat))\nManipal has a serene big campus with all facilities and it treats you like adults\n└── manipal bangalore is good ?\n    └── Lmao No , my answer was specific to mit manipal(Udupi campus)\n        └── Yeah right\n            └── Not more, manipal has a much bigger brand name then pes, so that compensates for bangalore factor. Pes intake is just skyrocketing every year so 500 companies required minimum"
    },
    {
      "id": "ktwst0a",
      "body": "Manipal eyes closed"
    },
    {
      "id": "ktwvshi",
      "body": "Im currently in first sem in MCA at PES RR campus. According to my experience you don't have time to do anything else. First of all classes are 8am  to 4pm and they do tell Saturdays are holiday and still end up taking classes uptill 1pm on Saturdays as well. And after you finish your classes your time vanishes in doing assignments and class activities and what not and uploading them into the portal. I don't know how anything about manipal tho\n├── How's the campus life? Is there an any dress code to be followed? What's the minimum attendance percentage and how seriously is it taken? Also how are the faculties, are they chill or like aholes?\n\nSorry for so many questions. I just don't want to make a mistake for my masters.\n│   └── No dress code you can wear what you wish. Min attendance that they have stated is 80% dont yet know how seriously they'll enforce it(my attendance is pretty bad scared af). Faculty most of them are ok cant say about chill. But some of em dont teach on par with how they should , most are mid and some teach pretty good.\n│       └── So how's the current placements and the college manage management behavior? Do they suddenly pop up with a new rule/ follow stupid rules etc?\n│           └── Honestly can't say anything about that rn cuz we're still just dreading the day to day stuff so haven't even tried to get info bout it. On the management behaviour side there's isn't much again, I haven't heard about any new rules popping of as of now.\n│               └── Hi man, I know its been 2 months but, has your views changed? Can you also tell me about the placement scene for MCA students.\n│                   └── Still the same dawg 🗿 also still no deets about placement\n└── Can I DM you please?\n    └── Yes, sorry didn't check the notifications"
    }
  ]
}