{
  "id": "1bo9tve",
  "title": "Is this enough??",
  "content": "My school is organising a kcet crash course,are these lessons enough for pessat? Or do I need to do more?",
  "metadata": {
    "root_comment_id": "kwneykp",
    "post_id": "1bo9tve",
    "author": "ElectricalCash6007",
    "url": "https://www.reddit.com/gallery/1bo9tve",
    "permalink": "https://reddit.com/r/PESU/comments/1bo9tve/is_this_enough/",
    "score": 10,
    "upvote_ratio": 1,
    "created_utc": 1711464750,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "kwneykp",
      "body": "Damn Deeksha? got mild PTSD after hearing that word\n└── Siuchhit Yorsel\nDelevriiwesn tansfai\nMeniuwl tans for\n    └── *He is speaking in the language of gods*\n        └── Satintrane Me re in for encarj\n\n![gif](giphy|l1K9E7DHdZEQqN6s8)\n\nKiyatumhare pashu in lag"
    },
    {
      "id": "kwnl1c5",
      "body": "Rule-1: Never trust Deekshã\nRule-2: Read RULE-1 again\n└── just a quick question.....is deeksha a good institute for coaching?or are there any better institute...?\n    ├── Def Allen, they give countless material and for me tchrs were great and kind\n    └── Bruh anyone who says the words \"Coaching Institute\" is a fuck show through and through."
    },
    {
      "id": "kwnmavi",
      "body": "Which branch"
    },
    {
      "id": "kwnnuk0",
      "body": "it really depends on the teachers\nBeing part of deeksha jee revision program\nSome teachers gave 110% effort did everything to get the best efforts out of us\nWhile some teachers didnt even come to class\nOr even if they would come blabber some formulae and go back to staff room"
    },
    {
      "id": "kwnojv4",
      "body": "Yo I'm sorry but why are there so many kcet posts  on this sub nowadays"
    },
    {
      "id": "kwnp9ce",
      "body": "You should ideally be studying on your own at this point unless you think attending classes will be super productive. Solve all previous year kcet questions once ( buy that mtg Or whichever publication's book), create summary sheets which you will review one day before every exam.\n├── Sorry for the late reply, so if I prepare the lessons given in the spreadsheet, will that be enough?\n│   └── >Sorry for the late reply\n\nMan 38 mins isn't late 💀\n└── Hey my posts get removed whenever I make a post about it but do you think a KEAM crash course would be enough for me to crack COMEDK (CSE/ISE/AIML in Nitte is good enough for me) ? COMEDK is in the second week of May, and the crash course satrted yesterday."
    },
    {
      "id": "kwnrx03",
      "body": "I'm from deeksha as well and what I'm doing is studying on my own (solving all pyqs and crash course manual questions) but attending only the tests"
    },
    {
      "id": "kwqlya3",
      "body": "4 years have passed by and this shit from Deeksha still scares me\n└── Us Bhai us \n    └── That bad?!"
    },
    {
      "id": "kwqzgct",
      "body": "Focus on topics having more weightage, take as many as mocks as possible."
    },
    {
      "id": "kwr5zcn",
      "body": "DCFL '22 here😅\n\nso what I did was PYQs PYQs PYQs\n\n\nI loved chem(org chem was my fav, taught by RP sir) and phy, focussed on that, less so on math.\n\nFrom what I recall kcet gives preference to 12th grade topics so yeah do them first.\n\nAnd boards help, do as good as u can in boards.\n└── Ayy my guy. I liked rega tho, inorganic helped me secure a seat"
    },
    {
      "id": "kwrvx4w",
      "body": "COVID batch of Deeksha here\nI got like 7.5k rank in pessat with not so serious studying. Deeksha's traumatic effects couldn't break me. If you work hard enough ull get a good rank and ull be able to secure at least a eee seat. I was offered one after all the counselling ended because there was a vacancy, but I denied."
    },
    {
      "id": "kwtagtg",
      "body": "You can study this but expect a difficulty a tad bit more than KCET"
    },
    {
      "id": "kx2uor3",
      "body": "Aeddtmie for\n\n![gif](giphy|cNkVchVxFuGwI2LW3v)\n\nRhgome"
    }
  ]
}