{
  "id": "1bqd3j3",
  "title": "Help from seniors ",
  "content": "Hey I'm a first year student i got 7.2 sgpa first sem(chemistry cycle) and ISA-1 results are out and I got between 18-21 in everything. Is there any hope left for me to get 8+ cgpa by third year or should I give up.",
  "metadata": {
    "root_comment_id": "kx1zrx2",
    "post_id": "1bqd3j3",
    "author": "No-Cattle-6304",
    "url": "https://www.reddit.com/r/PESU/comments/1bqd3j3/help_from_seniors/",
    "permalink": "https://reddit.com/r/PESU/comments/1bqd3j3/help_from_seniors/",
    "score": 11,
    "upvote_ratio": 1,
    "created_utc": 1711676546,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "kx1zrx2",
      "body": "To make your cgpa 8+ by the end of this sem you need to score above 8.8 sgpa in this sem . (Just use the calci you'll figure out how ) .\n\nNow one isa is over , one more is left , an 18-21 range is nothing short of disastrous . 8.8 is highly difficult given your first internal scores but definitely you can try to get above 8.5 ish so that your cg is around 7.8-7.9\n└── I really struggle at math any help\n    └── Just focus in class instead of using your phone .\n\nAll the professors in math dept were pretty good at least in ec campus imo\n        └── \nMy second sem math professor was horrible.\nAll she did was use her DSU notes and teach from them.\n\nHowever,there are many good lectures on YT…you could check them out."
    },
    {
      "id": "kx25sm6",
      "body": "You can **easily** get 8+ by 3rd year. Do not worry so early on.\n└── Are further semester easy to score in and how many credits are they of.\n    ├── First year is for total of 48 credits. 2nd and 3rd year are for 46 credits each. 4th year is like 20 credits or something really low. \n\nEssentially 1st year is barely 1/3rd of your final gpa.\n    │   └── Bo first year has total 44 credits 22*2 \n    │       └── I checked my PESU app and it says 24 credits. PES might have changed it for y'all.\n    │           └── Chem-5 \nEpd-4\nMaths-4\nMech-3\nPyth-5\nConst-1 =22*2=44\n    │               └── Here's what my PESU app says:\n\nConst-2\nPyth-4\nPyth Lab-1\nMech-4\nChem-4\nChem Lab-1\nElectronics-4\nMath-4\n\n24*2=48\n\nMy guy PESU can change the course structures. They had said they want to reduce the importance of mech and constitution. Ig they did it for your batch.\n    │                   └── Oh yea mech and const reduced \n    └── Depends, if u are good at the basics of computers, it's okay otherwise 2nd year is tougher than 1st.\n        ├── To add onto this 2nd and 3rd year are easy if u have an interest in computer science. If you are here cuz of hype and money alone you will find it tough.\n        └── Any idea where to gain these skills any online course\n            ├── U should know the basics of python and c thoroughly. No course is needed as such. Just try to develop an intrest in learning the concepts\n            └── Just solve codechef/codeforces/leetcode questions which are of basic level to get good"
    },
    {
      "id": "kx38bxf",
      "body": "You can easily score 8+ by the end of third year if u can make a habit of learning most of the concepts within the class. It is bit difficult for someone to score 8+ if they just study one day before exams"
    },
    {
      "id": "kx6qyiy",
      "body": "Passed out in 2023, here are my 2 cents:\n\n1. Attend classes regularly from now on (incase you haven't ) It's perfectly fine even if you don't understand anything. Atleast you'll be familiar with the topics and won't be surprised one day before the exam. But put in the extra effort of participating in the class. That will involuntarily help you to concentrate. (Don't look like an idiot by using your phone. You will have enough time during breaks and after college hours)\n\n2. First year math exams are supposed to be difficult. Not all professors have passion to teach the subject well (I'm grateful to have attended BMS's lectures ). Fire up YT and look for videos with animations or a better way of explaining stuff. Engineering at PES is 70-80% self learning.The earlier you cultivate this habit, the better. Test your knowledge Unit wise. Solve the question bank problems first and then solve ESA papers unit wise. (I wish I had done this. Not required if you're conceptually strong, but definitely helps you in gaining confidence if you haven't mastered the topics)\n\n3. I don't know how the assignment weightage is distributed for you, but for my batch it was 40 ISA, 10 assignment and 50 ESA. If it's the same, then take assignments seriously\n It's 10 marks up for grabs. Don't miss out on this. \n\n4. Forecasting your required performance to attain a required GPA is simply suicidal and waste of time. It's very unlikely you're going to reach the forecasted GPA. Instead start focusing on subjects you are weak in. That's the best way to boost your confidence and surpass your own expectations. I would say, being thorough with all the 5 units and answering reasonably well in ESA (say you've answered 80 marks correctly and unsure of 20 marks, you're assured of B grade atleast in a particular subject in ESA) \n\nGood luck and may the force be with you!\n└── for math-2, are tb problems necessary in addition to assignment+qb+esa papers? I've gotten mixed answers from seniors and teachers for 2nd sem so far\n    └── I am probably the wrong person to answer this. We had M2 cancelled because of Covid. But for M1,M3 and M4, solving all class work problems + assignment problems + question bank problems is more than sufficient to achieve a grade higher than B. For exam preparation you can look at ESA papers to get an idea on what type of problems are asked from each unit and plan which unit to tackle first"
    }
  ]
}