{
  "id": "1bqvbz8",
  "title": "I don’t know where I’m lacking",
  "content": "I’ve always been a bright student academically since 12th std and even did well in KCET and other entrance exams. But somehow I’m struggling to do well even jn internals in this college. Like I know I can do so much better but I’m unable to achieve my target. In first sem, I got 8.27 SGPA but I wanted to get around 9(to get the scholarship). Now I ’m in Chem cycle and our first internals got over. I got 129/200 but my target was to get around 150-160 since people say Chem cycle is comparatively easy to physics cycle.This has got me feeling like everything I’ve achieved so far academically was just a lie :(",
  "metadata": {
    "root_comment_id": "kx53r55",
    "post_id": "1bqvbz8",
    "author": "Successful_Sorbet286",
    "url": "https://www.reddit.com/r/PESU/comments/1bqvbz8/i_dont_know_where_im_lacking/",
    "permalink": "https://reddit.com/r/PESU/comments/1bqvbz8/i_dont_know_where_im_lacking/",
    "score": 17,
    "upvote_ratio": 1,
    "created_utc": 1711734215,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "kx53r55",
      "body": "same buddy don't know wt to do depressed as fuck this is the lowest point in my academics\n└── It really sucks when you know you can do better but you’re unable to show your potential\n    └── i swear and it is worse for me ur atleast close to 9 mins is a huge drop at this point i want to kma but there is that small beam of hope but it keeps becoming smaller if the mistake ur doing isn't clear i can't fix shit without knowing that"
    },
    {
      "id": "kx55g7v",
      "body": "Dude first year is no doubt easier than 12th. Don't you remember the shit we had to study? This is nothing. Most questions will be direct, either mug up or basic one line numericals. Both math ESAs had almost all questions directly from classwork. \n\nYou probably started studying like half a week before the exams. \n\nWhen I was in first year i studied one week before isas. Now that it's 2 units, maybe start 2 weeks before. I swear once you remove the Time constraint you will see how easy it is\n└── You do have a point but I started studying two weeks ago and still this happened:("
    },
    {
      "id": "kx5thd5",
      "body": "Chill bro, it happens as in college almost all our classmates are more or less at  the same level as most of them have cleared exams just as u have  to study in pes unlike all your school life. Once you stop comparing yourself with others u will be be completely at peace and it would better your performance too. This imposter syndrome haunts me too but I guess I have stopped paying that much attention to it. Just try to perform as well as u can without comparing with others.\n└── Okay thanks a lot for the advice:D"
    },
    {
      "id": "kx7b5a1",
      "body": "Okay thanks a lot for the advice:D"
    },
    {
      "id": "kx7kh7k",
      "body": "Career/education is not a sprint. It's a marathon. You have a slow start. No one said you can't speed up later. Just keep trying.. nothing else to do than that\n└── Okay. Gotta keep trying"
    },
    {
      "id": "kx7oc50",
      "body": "TLDR: Scoring well is a skill and you can improve the skill by quantitatively approaching exams\n\nDeets:\nAs a senior who did go through this during 12th board and college. My advice to you is to make scoring well in exams independent from your actual capabilities and intelligence.\nScoring well in exams itself is a task, you gotta learn how to score well in exams.. it's like any other skill cycling/swimming etc..\nI have met smart people who score less, dumb people who score well etc etc; point being, scoring well is a skill that has to be learnt and acquired \n\nNow coming to what you can do, keep some realistic targets for exams and see how close you are, one exam at a time. I personally extremely lack the skill to score well in exams, so what I used to do is split syllabus into 4 quadrants \n1. I know well and I can score well\n2. I don't know well but I can score well\n3. I know well but I cannot score well\n4. I do not know well and I cannot score well\n\nIn each of the quadrants, keep a target i.e Quad 1 - you must score at least 80% of the questions asked Quad 2&3 50% and Quad 4 just skip. As and when more semesters come, you'll get better and better and more accurate in your quadrant estimation which would lead up to scoring as per expectation, hence you won't let yourself down\n\nIt worked for me in both scoring well and also not being let down by my scores; I think it could help you too\n\nGood Luck and keep trying your best! That's all you can always do ❤️\n└── Thank you so much for such a detailed answer. I will definitely implement this :D\n    └── Gooood Luck :)"
    },
    {
      "id": "kx8cyh3",
      "body": "Man I'll tell you what the problem is , studying till 12th , the structure is well provided to you , shit ton of materials and PYQs , video lectures and whatnot.\n\n pes courses are very unstructured , pesu notes are half written or information is omitted sometimes , and the syllabus is badly structured because of how they keep switching between 5 ISA and 2 ISA. \n\nsome topics you can't even find videos for in YouTube and half the teachers in college are trash.\nIts the same reason why scoring is easier in VTU because they have shit ton of materials and YouTube videos. I still remember there were no YouTube videos for the statics textbook because these geniuses decided to include the latest edition. Meanwhile there are youtube videos for every pyq in vtu colleges.\n\nSo the problem is this is most likely the first time you are studying completely from scratch by yourself and you are trying too hard to understand everything , so you end up studying a lot of useless stuff as well. Focus on only what's important.\nFor chem cycle all you gotta do is pick up the slides/notes and start rote learning that shit. Yes you can understand each and everything in chem/epd but it's not worth it , those subjects dont matter at all from second year. This is not 11/12 , try to spend as less time as possible trying to understand everything, just study efficiently and focus on what matters.\n\nId much rather advice you to start working on improving the skills of the branch you're in and focus on studying for scoring in exams rather than trying to understand everything in first year.\n 8.27 is honestly not bad at all and you still have a majority of your college years left to bring it up. Don't worry about what's done now , keep improving.\n└── Okay man. Thanks for understanding my situation and I appreciate your reply"
    },
    {
      "id": "kx8g3nm",
      "body": "Bro sutta gully is always there for you"
    },
    {
      "id": "kxdosgq",
      "body": "None of this matters eventually in the professional world. Develop long term skills that go along with your passions.\n└── Okay thanks for the advice ❤️"
    },
    {
      "id": "kxodewq",
      "body": "Broo i had got 7.7 sgpa in my first sem 🥲..... It happens to most of us...... We need some time to set ourselves for PESU exams..... But after some rigorous work i am able to manage around 9 sgpa later on in all the semesters. \n\nKeep working bro !! Don't get demotivated !!!\n└── Okay thanks senior :)"
    }
  ]
}