{
  "id": "1brra9c",
  "title": "How is PES for MCA? ",
  "content": "I'm considering PES for my MCA? How is this college in terms of MCA placements ? ",
  "metadata": {
    "root_comment_id": "kxh9ovo",
    "post_id": "1brra9c",
    "author": "Financial-Bat6734",
    "url": "https://www.reddit.com/r/PESU/comments/1brra9c/how_is_pes_for_mca/",
    "permalink": "https://reddit.com/r/PESU/comments/1brra9c/how_is_pes_for_mca/",
    "score": 5,
    "upvote_ratio": 1,
    "created_utc": 1711830046,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "kxh9ovo",
      "body": "please don't. Try RV or BMS or Christ. Not PES. At least not for MCA. \nPoor placements, no support from the University at all. Try Christ University\n├── Bro then why this college is giving MCA degrees.. They called me twice that the registration closes today..n..blah.blah.blah..they were somewhat forcing me to book a slot for interview. But I gave some reasons to escape. How come after reaching on this platform I'm hearing the negative aspects of this college, I mean in quora the answers seemed like \"paid\" One and I saw 2-3 YouTube videos where they were saying \"Why you should join PES for MCA \", best in Bengaluru etc. etc.\n│   └── I've studied here man. I hated every aspect of this place, starting from the fact that we don't get any sort of \".edu\" mail even though this is a university, to the fact that companies don't want to hire MCA when they come for placements. \n8/242 is the placement stats of the current year. \nJust join RV or some other college and do yourself a favour. \nMCA here is just a gimmick to get money for the university.\n│       ├── My friend needs info regarding mca.\nCan I dm you?\n│       │   └── sure\n│       │       ├── Check ur dm\n│       │       └── Check ur dm\n│       └── Can I also DM you? I was also planning to join PES Z for MCA\n│           └── sure man, my dms are open to everyone\n└── which would be the top 5mca colleges in bangalore with better placements ?\n    └── where did you endup joining?"
    },
    {
      "id": "kxiod0b",
      "body": "Bro Can I DM for the same purpose..Please"
    },
    {
      "id": "lkcr62c",
      "body": "Did you take admission in any college??\n└── Why?\n    └── I wanna know which college is best for mca in Bangalore \n        └── I'm a non Bengalurean though but, would suggest RVCE.\n            └── And any other good college outside the Bangalore???\n                └── You can get intu DU, JNU through CUET, NITs through NIMCET. University of Pune through MAHACET."
    },
    {
      "id": "m6kqaud",
      "body": "WHERE DID U TAKE ADMISSION?\n└── I knoww right, every college subreddit I look into, people say the placements are shit, where tf do you go then?\n    └── i will take the entrance of christ or else i will get into alliance or dayananda or reva\n        ├── I've never heard of alliance, my plan is to also try for Christ , bmsce, pes maybe cmr / dayananda\n        │   └── im applying for christ too i contacted a few of the seniors through linkedin and theyre saying the placements are some what ok considering the market is correcting itself mostly internships and ppo offers. Is BMSCE,PES,CMR,Dayananda any better?\n        │       └── Hey can you tell me what is christ entrance is like and some other colleges you are aiming for other than nits.\n\nAnd I heard that PES is not good for mca in another reddit post.\n        └── I am from DSCE/MCA\n            └── How is it?? Can I also consider applying for it"
    },
    {
      "id": "mih3rfk",
      "body": "Hello ... Could anyone suggest me for good colleges for MCA ?"
    },
    {
      "id": "mih3shn",
      "body": "Hello ... Could anyone suggest me for good colleges for MCA ?"
    }
  ]
}