{
  "id": "1buxpxg",
  "title": "Questions about BBA business analytics!",
  "content": "So, I am thinking of doing my BBA in Business Analytics from PES University and have a lot of doubts and questions and many of them are unanswered after reading the website and extensive research. Your input will be helpful! \n\n1) Does IOA(UK) actually play any role in this course or is it there just for name's sake?\n\n2)  Does this course keep you up to date with industry skills, especially with the AI(ML and NLP) stuff?\n\n3) Are the placements decent? I know they aren't that great but are they at least consistent with them?\n\n4)Staff, teachers/professors, are they like super strict... I've seen some videos and I know I shouldn't generalize but does it affect with their teaching capabilities?\n\n5) Also does anybody have a copy of the syllabus? I can't seem to find it anywhere.\n\nThank you!",
  "metadata": {
    "root_comment_id": "ky03e1d",
    "post_id": "1buxpxg",
    "author": "shiro_shiyami",
    "url": "https://www.reddit.com/r/PESU/comments/1buxpxg/questions_about_bba_business_analytics/",
    "permalink": "https://reddit.com/r/PESU/comments/1buxpxg/questions_about_bba_business_analytics/",
    "score": 0,
    "upvote_ratio": 0.5,
    "created_utc": 1712163368,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "ky03e1d",
      "body": "As a soon to join academic and PES Alum, I'll recommend to check TAMPI Bangalore BBAHonors program that is a far more developed and since I know profs teaching their are as good as some of the good IIMs you'll really like that. Plus it gives a option to do your 4th year as MSc in UK, or Entrepreneurship or as Specialization I'm your domain interest with the company you got placed in.\n└── okay, thank you!"
    },
    {
      "id": "l9kwsa6",
      "body": "Bro trust \nI'm a third year studying data analytics \nIt's one bs course don't take it\n└── Just got a seat for BBA, why do you recommend not taking it? I've heard good feedback so far\n    └── did u end up joining pes? if not, then why? also i just got done with my interview and I feel like it went well and from all the reviews that I've gotten so far it seems great so I'm defo leaning towards it\n        └── I paid the seat blocking fee. I'm mostly going to go, I've got good reviews from current students, visiting the campus this Sunday and the program also looks great\n            └── Don't listen to the negative reviews, every college has people crying about it. It's just always people thinking the grass is greener on the other side. PES is definitely a bit more academically focused compared to other colleges, which for some is a good thing and for some it's not"
    }
  ]
}