{
  "id": "1c0apl3",
  "title": "JEE Main cutoff for CS",
  "content": "I can't seem to find any information about the JEE Main cutoff rank. I've gotten 99.008 percentile in session 1 of JEE Main. Will it be enough to get a CS seat in Ring Road campus? I likely won't get CS in any of the good NITs so wanted to know whether it'll be enough to keep PES as a backup.",
  "metadata": {
    "root_comment_id": "kyv9r04",
    "post_id": "1c0apl3",
    "author": "accpg556",
    "url": "https://www.reddit.com/r/PESU/comments/1c0apl3/jee_main_cutoff_for_cs/",
    "permalink": "https://reddit.com/r/PESU/comments/1c0apl3/jee_main_cutoff_for_cs/",
    "score": 2,
    "upvote_ratio": 0.6200000047683716,
    "created_utc": 1712716393,
    "flair": "PESSAT/Admission",
    "nsfw": false
  },
  "comments": [
    {
      "id": "kyv9r04",
      "body": "You sure PES is your best option at 99 percentile 😂?\n└── I know it's not but I just want to keep my options open in case I don't get CS in any of the good NITs or IIITs"
    },
    {
      "id": "kyw5uox",
      "body": "Why not iiit gwalior.. It's the 5th best iiit after hyd, blr, allahabad, lucknow..\n└── I really don't think I can get that with my current percentile, it's cutoff rank last year was 7000.\n    ├── Check csab round 2 cutoffs dude.. You'll be getting mnc or IT at 14k there\n    │   └── Oh alright I'll have a look. Thanks a ton\n    └── IIIT blr was 13k for ECE"
    },
    {
      "id": "kywk671",
      "body": "hey, I got 98.86 in Jan and PES is my backup too, can I dm\n└── Sure"
    },
    {
      "id": "kywk9dr",
      "body": "OP, even I can't find legitimate information or anything listed on the website, please share anything that you find out\n└── last year when my friend went to campus and asked it was 98.7%ile or something, and fees is same as pessat (about 5L per year)\n\nrather join some other college because you'll be paying as much as a pessat kid who gets in with 1/4th of the effort (i had mid 90s in mains and rank 6xx in pessat which gets you CSE in RR campus lmao)\n\nare you sure you want to be a part of the same crowd while being of a higher caliber ?"
    },
    {
      "id": "kz584z2",
      "body": "Bruh, lost potential going to PES fr"
    }
  ]
}