{
  "id": "1c0sxyo",
  "title": "II PUC Multiple annual examinations",
  "content": "\n(For context kseab has decided to hold three annual examinations for grade 12 every year and \nKea has decided to consider the second exam marks as well for kcet \n The mcq's in the physics examination this year were really high level than expected not even 1 person in my college has gotten 100/100 top marks were  97/100)\n\nI was fine with Puc board having multiple examinations in order to increase their pass percentage but today morning after the results were announced they announced that the second exam marks would also be considered for the kcet examination \n\n I dont feel it is right to students who worked their ass off preparing for the first examination to get the same or lesser marks than the people who wrote the second attempt\n(Possibly an easier paper with more lenient correction).\nI am ok with people who failed/ were sick to write the second examination \nBut making it an open option for everyone\nIt will make the purpose of the first attempt useless.\n**This will seriously mount pressure on students to Get 300/300 in science every year on forth in either of the  attempts for a decent chance at kcet.**\n\nMy opinion on what should be done:Either The Second exam marks shouldn't be considered for people who got above a certain percentage say 85% in science in the first attempt or 50% board weightage should be removed from kcet. \n\n\n",
  "metadata": {
    "root_comment_id": "kyyo0ap",
    "post_id": "1c0sxyo",
    "author": "nahbruhbruhhh",
    "url": "https://www.reddit.com/r/PESU/comments/1c0sxyo/ii_puc_multiple_annual_examinations/",
    "permalink": "https://reddit.com/r/PESU/comments/1c0sxyo/ii_puc_multiple_annual_examinations/",
    "score": 0,
    "upvote_ratio": 0.33000001311302185,
    "created_utc": 1712774309,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "kyyo0ap",
      "body": "I ain’t reading all that\n└── Tldr:\nPuc fucks with students lifes.\n    ├── Why? CBSE and ICSE is worse\n    │   └── yeah fr man pu board is like a gods gift\n    └── Na it's pretty Student friendly compared to cbse and isc"
    },
    {
      "id": "kyyx803",
      "body": "You make me not wish that i would be eligible for KCET"
    },
    {
      "id": "kz0fpa1",
      "body": "Are you sure they're counting the best attempt in boards for kcet? I think it's the first attempt itself\n└── They announced that its the best of both attempts that will be considered\n    ├── I am sorry to hear that if it's true that's kinda frustrating to hear they're still pulling this shit. Can you send me the link to the announcement cause I read only first attempt will be counted. \n\nAlso please don't worry about college much. It will only count for like 20% of your career going forward (unless you get some IIT) Focus more on what your interests are and you'll do good\n    └── fr??? whens 2nd boards tho"
    }
  ]
}