{
  "id": "1c2fjvw",
  "title": "Hey guyd",
  "content": "I am a gamer and aspiring to join PESU \n\nDo the hostels have good network connectivity and are there any facilities for gamers in the campus\n\nAll opinions and Responses are appreciated ",
  "metadata": {
    "root_comment_id": "kz9uxgl",
    "post_id": "1c2fjvw",
    "author": "OkFaithlessness6408",
    "url": "https://www.reddit.com/r/PESU/comments/1c2fjvw/hey_guyd/",
    "permalink": "https://reddit.com/r/PESU/comments/1c2fjvw/hey_guyd/",
    "score": 10,
    "upvote_ratio": 1,
    "created_utc": 1712944242,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "kz9uxgl",
      "body": "'Facility for gamers in the campus',bruh what?!                 Jokes aside,apart from gaming If u are into adventurous sports, u have bungee jumping facility(no rope incl)\n└── Hows the internet connectivity in hostels\n    └── Idk much abt connectivity,but I do know that some sites are inaccessible."
    },
    {
      "id": "kz9w4du",
      "body": "WiFi's shit and games are mostly blocked on WiFi."
    },
    {
      "id": "kzamfdg",
      "body": "Games are blocked like u can't play multiplayer like valo but u can use a VPN to open steam and shit . The download speed is pretty good .\nValo with VPN gives high ping too so can't do that but the good thing is u have 5g everywhere in hostel (majority) so u can use that for multiplayer ( i play Val with good ping of 25-30ms)\n└── Alot play Val here\n    └── Yeah I mostly play val"
    },
    {
      "id": "kzcfeq5",
      "body": "Once you join PES, you can watch them play with all your hopes and dreams /s\n└── Dude is it so bad in PES?\n    └── Definitely not as bad as people portray it to be, but also not the sunshine and rainbows that it is supposedly known for. Search through this subreddit, you'll find all the problems. IMO there are much better options like Manipal, RV at similar or lesser costs."
    },
    {
      "id": "kzcrf2z",
      "body": "Idk about rr campus Hostal but amaatra has decent wifi speeds at times but then completely ass wifi other times"
    },
    {
      "id": "kzcvj87",
      "body": "Lmao it's bad . We use warp VPN and get like 100ish ping on valorant to the closest servers which is Singapore."
    },
    {
      "id": "kzeh11q",
      "body": "Focus on getting a girlfriend/boyfriend that is all that matters.\n└── Hawas kam karo sirji\n    └── I would argue having a girlfriend pr boyfriend is kot about hawas or sex or lust more about companionship but okay"
    },
    {
      "id": "kzeje4h",
      "body": "Story games better"
    }
  ]
}