{
  "id": "1c2wtt1",
  "title": "PES University for Engineering? Have some Essential Questions to Ask",
  "content": "- How strong is the alumni network, and are there opportunities for mentorship?\n\n- Are there programs for budding entrepreneurs?\n\n- What student organizations and clubs are active on campus?\n\n- What is the gender ratio at the university\n\n- What percentage of students get placed in their dream companies?\n\n- What percentage of students secure offers from Tier 1 companies?",
  "metadata": {
    "root_comment_id": "kzcx9lo",
    "post_id": "1c2wtt1",
    "author": "i_nithinsudhagar",
    "url": "https://www.reddit.com/r/PESU/comments/1c2wtt1/pes_university_for_engineering_have_some/",
    "permalink": "https://reddit.com/r/PESU/comments/1c2wtt1/pes_university_for_engineering_have_some/",
    "score": 15,
    "upvote_ratio": 1,
    "created_utc": 1712995542,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "kzcx9lo",
      "body": "Most of your questions already have answers on this subreddit, so you can search this sub but I'll answer briefly: \n\n1. Yes. Pretty strong alumni network and everyone's well connected. There's a 4500+ member discord server and this subreddit and everyone actively helps out\n2. Yes, there are specific programs run by CIE. Someone else with more info can expound on this. \n3. There are a lot of clubs on campus but a lot of them are also dead. Unfortunately at PES clubs follow the quantity > quality policy. \n4. Depends on the branch. CS had about 1:5 when I was in college. \n5. Very subjective given that someone's dream category of companies might not match someone else's. But if you want a rough statistic, a lot of people (300+) get into companies offering 12+ LPA. There's a spreadsheet on this sub with the 2024 and 2023 placements. \n6. Answered above. Also you shouldn't use the 2024 batch placements as benchmark since the market is bad. Use 2023 for a better prediction."
    },
    {
      "id": "kzcxb28",
      "body": "+1.. \n\nPlz answer this seniors!!"
    },
    {
      "id": "kzdwcm5",
      "body": "Yes, Alumni network is good but most grads from here are employees not entrepreneurs.\n\nYes , PESU venture labs for budding entrepreneurs but don't expect anything like IITs incubators.\n\nNo student org because college is autocratic but plenty of clubs.\n\nGender ratio is around 65:35 in CSE.\n\n\nLess than 2% in dream companies..\n\n\nAround  40% students got T1 offers this year so far considering PPOs and FTEs, not counting performance based FTEs."
    },
    {
      "id": "kze32do",
      "body": "1) Yes, one of the best seniors.\n\n2) Yes , personally i have no experience in this.\n\n3) Mostly all clubs are active , some clubs are dead and useless but you can join some really good clubs and meet amazing seniors and learn a lot.  \n4) PES has best gender ratio in India probably , comparing to other engineering colleges.\n\n5) Less than 3%, i am assuming dream companies are apple , google , Microsoft etc. But personal opinion is your first job doesn't matter , like you can keep improving throughout if you don't get your dream company initial. Then after 2-3 years after college mostly if you did honest work you will achieve it .\n\n6) Can't tell percentage but a lot of people get T1 and its not that difficult to get it."
    }
  ]
}