{
  "id": "1c3kc5b",
  "title": "Do electronic city campus students get mrd n cnr scholarships or is it only for rr campus students??",
  "content": "As an ec campus student did u get the scholorship?? ",
  "metadata": {
    "root_comment_id": "kzhjeey",
    "post_id": "1c3kc5b",
    "author": "Repulsive-Bar8298",
    "url": "https://www.reddit.com/r/PESU/comments/1c3kc5b/do_electronic_city_campus_students_get_mrd_n_cnr/",
    "permalink": "https://reddit.com/r/PESU/comments/1c3kc5b/do_electronic_city_campus_students_get_mrd_n_cnr/",
    "score": 3,
    "upvote_ratio": 1,
    "created_utc": 1713066698,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "kzhjeey",
      "body": "They do get them"
    },
    {
      "id": "kzhmh5d",
      "body": "Yes EC campus also gets the same scholarships."
    },
    {
      "id": "kznj0on",
      "body": "they get the same scholarships. and the people who get it are the top 5,25 percent students in each campus in each department separately. \n\nSource- I've spent a year in both campuses each\n└── Did you do branch change after 1st year? If yes, can you tell how easy is it to get CS at RR for an above average student who will put in the work?\n    └── >Did you do branch change after 1st year?\n\nyes to aiml in rr\n\nyou will not get cs in rr if you're just above average. based on last year's cutoff you will need to be in like the top 1-2 % of your batch. it's simply too much \n\nbut for the rest, especially cs in ec campus you need like 7.5 gpa. that's very achievable for even below average people\n        └── Thanks for replying. Btw, is CS at EC better than AI-ML at RR? Some said that AI-ML restricts us with respect to electives and CS gives more freedom to choose. So, what is your opinion given that placements are the same (they are same, right?).\n            └── placements and all are the same\n\nbut i would still recommend you take cs in ec campus over aiml. i changed for location\n\nbut they also overstate the difference\n\nupto the second year everything is the same except 3 subjects out of 20. and those three aren't different or anything, they're the same, and then some more. \n\nso as of second year, we are learning the same and more than cs people.\n\n  \ni cannot tell you what will happen in the third year, but i'm hopeful that it will not be very different either\n                ├── Ok. Thank you so much for helping me out.\n                └── will the crowd in rr ai ml be better than ec cs?\n                    └── nope nothing like that. mostly everyone is similar"
    }
  ]
}