{
  "id": "1c5jzyu",
  "title": "A question regarding placements",
  "content": "Considering that the job market is kinda rough right now, combined with the fact that I kinda lost that passion to stick to the grind, will I at least get placed in a Tier 3 company? I am a 6th sem CSE student, my CGPA is 7.72 and I have no backlogs. Also I've seen the placement stats which our CSE HoD showed us during PTM, and according to their stats around 15 people got Tier 3 offers, I wanna know why that number is too less, is it simply because a majority of students don't bother applying because of low pay? Also, do you know of any people who sticked to Tier 3 company offers in CSE? ",
  "metadata": {
    "root_comment_id": "kzulyy6",
    "post_id": "1c5jzyu",
    "author": "Limp-Net8000",
    "url": "https://www.reddit.com/r/PESU/comments/1c5jzyu/a_question_regarding_placements/",
    "permalink": "https://reddit.com/r/PESU/comments/1c5jzyu/a_question_regarding_placements/",
    "score": 13,
    "upvote_ratio": 1,
    "created_utc": 1713283838,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "kzulyy6",
      "body": "i'm second year and curious about the stats. can you send them, or list them, or whatever you did to save them\n├── Unfortunately I do not have them, nor did I take a photo of the slide when it was being displayed, the only thing I can confirm is that there were 15 tier 3 offers and tier 1 offers outnumbered tier 2 and tier 3 offers.\n└── I think [this](https://docs.google.com/spreadsheets/d/1YZ7HtUcvA9jqWZ04DuwTT66aTV7gU7DUlXyO2BewpII/edit?usp=drivesdk) is what you were looking for, if was posted a few days ago on the subreddit\n    └── Is this for the 2024 batch?"
    },
    {
      "id": "kzuxxav",
      "body": "Tier 3 mostly comprIses of mass recruiters like Infy, TCS, Wipro, TechM, Cognizant, HCL etc. Unfortunately due to recession some of these companies had announced during the start of 2024 placements season that that they would not be hiring many freshers this year. These companies have a huge number of people from the 2023 batch on bench due to unavailability of projects and cannot manage to accommodate freshers. Hence people had to apply for most companies falling under T1 & T2 bracket initially.  However few T3 companies came at a later stage and are still coming to the campus but hiring very less people."
    },
    {
      "id": "kzv27i5",
      "body": "Is it that tough for peeps with 7.5 to 8 that u have only tier 3 as an option . I am scared as my cgpa is also in that range rn\n└── Dw, the market will improve when the time for placements comes for you guys, but for us, nothing is certain."
    },
    {
      "id": "kzvj4xy",
      "body": "Im a 4th year student currently holding two offers.\nWe had the same situation as u guys.Keep ur cgpa above 8 for tier 1 companies \nBut i have personally seen my friends get into companies after clearing their backlogs while people with 9+ cgpa have got only tier 2 companies \nIt only depends on luck...even if u put ur heart and soul , in the end it will depend on the interviewer.\nSo guve ur best and dont overthink\nComing to why people dont go for tier 3? Well pes has amazing placement stats...why would u settle for less , companies keep coming and u always have better options than tier 3, i know the recession is hard rn but trust me our college is 10x better than any other clg in this regards \nAim for t1 regardless of ur cgpa , its not that hard and ull get plenty of opportunities, be positive\n└── I'm sorry but I realised now that what I'm studying isn't for me, if it weren't for my parents I would have already quit for now, I just want to get this phase over with and get a job, no matter the pay, as money isn't an issue for me.\n    └── I understand you do not want go into coding or software...you have options to go for higher studies maybe in a different domain or look for roles that dont require coding for example sales...ibm came for 17 L ctc and for sales role, there was scalar, byjus etc for similar roles\nOr another option is to go for consulting companies like kpmg, ey etc all you need is good communication and be street smart. If u dont do either than its really hard to survive in the present scenario. Take what comes and make a career switch after a year"
    },
    {
      "id": "kzy74d1",
      "body": "[https://docs.google.com/spreadsheets/d/1YZ7HtUcvA9jqWZ04DuwTT66aTV7gU7DUlXyO2BewpII/edit#gid=457632655](https://docs.google.com/spreadsheets/d/1YZ7HtUcvA9jqWZ04DuwTT66aTV7gU7DUlXyO2BewpII/edit#gid=457632655)   \nPlacement stats this year. Still better than most of the colleges in Bangalore"
    },
    {
      "id": "kzy7ce6",
      "body": "Placements is so much about luck and timing as well. You still have time, keep grinding. Just do the best you can. You never know. I've seen people with 6 cgpa getting 10L+ offers this year. So just do your part and don't neglet tier 2 and 3 companies, keep applying. ATB\n└── Sorry but you missed my point, I don't really like this field and I have no choice but to continue, backing off is too late and I don't want to be sitting in my home unemployed, I am stressing on the fact that money is not what I am looking for, I just need a job.\n    ├── Companies come to campus with a variety of roles that are not very tech heavy, if that’s what you’re interested in. You can still try for a role you’re interested in\n    │   └── Will look into it, thanks!\n    ├── You're aiming for tier-3. Get placed and then do what? Stay there your whole life?\n    │   └── I'll try to upskill myself from there and try to switch to a different company.\n    │       └── Yes, better. Start upskilling right away. High chances that you'll get tier-1 worst case atleast tier-2. Then you can take care of the rest\n    └── Okay but where does ur interests lie?"
    },
    {
      "id": "kzy9ddl",
      "body": "I’ve seen people with 6.8 gpa get really good companies with great brand names. Gpa is only a filtering factor. It all depends on how you perform in your test and interviews\n└── Well if I'm being honest about myself, in these past 3 years, I've barely learnt anything and I cannot do jackshit when I try to build even a basic project, I'm not good at coding as well.\n    └── That’s okay. Companies mostly test your basics. Keep revising them.\n        └── the tests are pretty much only problem solving or is there anything else \n\nstuff like leetcode should be enough?\n            └── Yeah leetcode and regular practice of basic concepts are enough"
    },
    {
      "id": "l01cfvr",
      "body": "Can anyone tell me regarding PG students placements (For MTech CSE) at PESU?"
    }
  ]
}