{
  "id": "1c69a0o",
  "title": "what is the strength of students from north in pes??",
  "content": "",
  "metadata": {
    "root_comment_id": "kzzcewq",
    "post_id": "1c69a0o",
    "author": "not_your_shawtyyy",
    "url": "https://www.reddit.com/r/PESU/comments/1c69a0o/what_is_the_strength_of_students_from_north_in_pes/",
    "permalink": "https://reddit.com/r/PESU/comments/1c69a0o/what_is_the_strength_of_students_from_north_in_pes/",
    "score": 4,
    "upvote_ratio": 1,
    "created_utc": 1713358955,
    "flair": "PESSAT/Admission",
    "nsfw": false
  },
  "comments": [
    {
      "id": "kzzcewq",
      "body": "U will find ample no of people from north, every year the no of northies is increasing and the people of pes in general are mostly pleasant so there won't be much problem for you. And if u would take hostel, u can find many North Indians there\n└── also college life kaisi hai?? like fests vagarah dhanke hote??\n    ├── pessat ki bhi tips dedo thodi\n    │   ├── Use https://bit.ly/pesu-faq to start off. Remaining tips you can ask once we open the PESU discord server for prospective students.\n    │   └── Do ur regular jee / bitsat prep it should be enough nothing special required\n    │       └── thanks  \ndoing arihant prep guide for bits rn\n    │           └── Yeah that's good only for pessat\n    │               └── only for pessat matlab??  \nis it not relevant for other exams like comedk vit and all??\n    │                   └── Lol no, matlab pessat ke liye bhi acchi hi hai\n    │                       └── bits ke liye ye karna sufficient hai  \nalso doing some jee main moderate pyqs  \nwill start giving bits mocks 10 may se tab tak thoda sa syllabus completion karna  \nguide kardo TIA\n    │                           └── I have forgotten about pessat, jee and all bro. I gave it 2 years back and I don't wish to recall those days also. I just woke up and gave pessat and passed it without any special preparation. It would be better to ask a first year student. And I  flunked bitsat horribly in my time so I wouldn't be the right guy to answer\n    │                               └── damn man  \nyou must be a covid batch student :)  \nonline examss\n    │                                   ├── anyways thanks for all the info\n    │                                   └── Online classes no online exams:(\n    │                                       └── pes vagarah offline??\n    │                                           └── Pessat ? nope\n    │                                               └── yes srm sabka online hota is saal bhi   \ndoes phone come handy srmjee mai ;) ?\n    │                                                   └── I used to be an honest student during my school time so I didn't use it  but it seems u can cheat easily . My friends hot rank <500 by cheating\n    │                                                       └── damn man  \nthanks\n    ├── PES fests are good but don't expect extraordinary things. You can search this sub for fest related stuff. Some fests are yet to return after COVID, but most are back.\n    │   └── so overall is it worth joining or should i keep it as one of the options??  \nnot expecting much from jee  \nvit srm bits are still left  \nheard about the vit scam situation too\n    │       └── PES is better than VIT and SRM IMO. If you don't get BITS then yes it's a good backup.\n    │           └── manipal main campus or pes?  considering i would join pes through pessat most probably\n    │               ├── Manipal.\n    │               │   └── i see\n    │               └── If u are getting cse and related branches in manipal and pes both go for manipal over pes . But pes cse is better than manipal non cse branches. If u aren't getting cs in pes then go for manipal\n    │                   └── ic, ty\n    └── Fests are not that good. Maaya(ec campus fest) is really bad while aatmatrisha(RR campus) is also decent only nothing more. If u don't come with much expectations u would find the college life okay only but if u have come with expectations like a Karan Johar movie u would be utterly disappointed. I would say it's decent but not at the level of other pvt colleges like manipal or a bits\n        └── ohhoo okayy\n\nwhats the gender ratio btw?\n            └── In our class it really sucks, just 9 girls in a class of 61 people, but there must be about 15-20 girls on average in other classes\n                └── wooooo\n\nand most of them are south indian girls right??\n                    └── Yeah, but thats true for boys too. But it's like u wouldn't find North Indian girls. They too mostly are able to find a friends circle\n                        └── ohh so north ki ladkiya kam hai  \n\n\nalso are most of the students hostellers or day scholars??\n                            ├── Day scholars\n                            └── What kind of demographic survey are you conducting 👀\n                                └── Planning ahead maybe? 👀"
    },
    {
      "id": "l0068v7",
      "body": "Northie here. Life's good.  A majority of the people either speak or understand hindi, and no one discriminates against you except for perhaps a few nutjobs here and there lol\n└── and what about pessat, level kaisa hai, someone is saying jee level and mera jee prep to fucked hai 12th aati hai dhang se\n    └── CET aur JEE ke beech mein, but more towards JEE than CET. English bhi hai toh capitalise on that. I'm not sure ki if the rumours about negative marking this year are true or not, but we didn't have that 2 years ago.\n        └── tyy  \nalso could you give me some idea on bitsat ki prep, currently doing jee main ke moderate pyqs and arihant guide  \nkahi kehrhe ki arihant is not sufficient ab jitna tima hai usme yahi hopayega sirf :("
    }
  ]
}