{
  "id": "1c6vc3x",
  "title": "PANICKING FOR PESSAT AFTER PROCRASTINATING!",
  "content": "Okay im prolly gonna receive a lot of hate, toh basically i had my jee exam on 8th or april so i studied very well till then . i was so drained after that i wanted to get away from everytthingggg. i took a ONE WEEK HOLIDAY FROM STUDIES and now i regret it so much i wanna study for pessat so can someone guide me what to do , i have my exam on 28th exactly ten days from now please help. i know i shouldnt hace taken a long break but how do i fix this to some extent , ik time gone is gone and i genuinely want PES IM SCARED",
  "metadata": {
    "root_comment_id": "l03sbzb",
    "post_id": "1c6vc3x",
    "author": "OliveConscious6603",
    "url": "https://www.reddit.com/r/PESU/comments/1c6vc3x/panicking_for_pessat_after_procrastinating/",
    "permalink": "https://reddit.com/r/PESU/comments/1c6vc3x/panicking_for_pessat_after_procrastinating/",
    "score": 0,
    "upvote_ratio": 0.5,
    "created_utc": 1713417355,
    "flair": "PESSAT/Admission",
    "nsfw": false
  },
  "comments": [
    {
      "id": "l03sbzb",
      "body": "> I genuinely want PES\n\n💀\n\nJokes aside, the difficulty is around KCET level. Prepare for that and you'll be able to do well.\n└── ikik the standard is low but i cant do any better than PES :(((((((99"
    },
    {
      "id": "l03wh62",
      "body": "you’re prepped for jee aren’t you; my paper was jee level in terms of hardness and the time management. so just do like a mini 10 day crash course of your jee and class 12 things you’ll be fine\n└── YEa. Okay ill do that thank you so much"
    },
    {
      "id": "l044zix",
      "body": "Bro don't take that much stress. Getting ec campus cse is  quite  easy through pessat  and there is no difference in placements if that's what u are concerned with. But if u study well getting rr cse is also easy\n├── Sorry, no difference in placements?\nWhatttttt?\nNo. There is a big difference.\n-super old senior xD\n│   ├── U can ask recently graduated  people and they will say the same. Now it's under the same University and not vtu\n│   └── Not since 2022. Placements are pooled now because both are under University status.\n│       └── Hey y'all \nI'm happy that it is getting pooled!\nGood for alumini network but that being said : can u check with folks on who actually gets shortlisted?\nI've pretty sure, they give a fuck lot preference to main campus.\nAfaik, it'll be in the lines of : these are the students shortlisted for tier 1 company xyz : ( this will only include main campus)\nCorrect me if I'm wrong but instead of relying on the management saying that it'll be clubbed, better to check with someone in 6th sem: what exactly is happening.\n│           └── I graduated in 2022 - the first time pooled placements took place was for my batch, so I'd say I know what happens. Placements are pooled and there is no way to identify from a company's POV if a student is from RR or ECC. It's been that way for years now for every batch since then. Only PES can identify which student is from campus, the listing by companies includes both campuses always.\n│               ├── That's nice! \nAnd how's the placement ratio?\nMain campus to ecc campus?\n│               │   └── There's no official metric, but it doesn't make sense to compute it anyway since the number of CS kids at RR is almost triple the number of CS kids at EC today. Number of RR kids getting selected for a T1 job will always be more because of the distribution.\n\nNumbers will always look skewed here and provide a wrong conclusion.\n│               │       └── Hmm.\nOk, I don't know the total count of students from ecc campus but u can just contact a ecc class person and ask how many in their section got into T1,T2 and compare it against your class.\n\nMy only reason for pointing it out is because I don't want people to just take ecc considering placements being same for both.\nIt has been same since forever but when u sit for interviews, you will realise the difference.\n│               │           └── As I said, comparing numbers makes no sense cause the distribution is skewed. From a company's POV, they cannot distinguish between a student from RR and EC because both sit for the same tests, both appear for interviews together in the same location. PES does not disclose their campus details. \n\nYou graduated before the changes were implemented. People in the last 3 graduating batches have vouched for there being no difference anymore.\n│               └── I'm mainly worried about the people getting shortlisted.\nIf ur from main campus: how many people got tier1,2 and check the same with ecc campus.\nSome of my close friends come to take interview and I've heard that the bias exists.\n├── i know it depends on shift and stuff but can you please give me an idea of \"safe score\", that if i get 100+ or 120+ out of 180 i will secure my seat in rr or ece campus or something like that?\n│   └── They don't release the scores so idk about that\n│       └── alright thankyou so much ;-;\n└── thank you"
    },
    {
      "id": "l09z8vy",
      "body": "Bro I guessed and got\n└── really?  Did you get cse regardless of rr/ec branch"
    }
  ]
}