{
  "id": "1c6xk3s",
  "title": "any resources for pessat",
  "content": "so well i haven't studied pcm in like a year after graduating from highschool last year, currently have a seat at rv university and want to start preparing for comedk and pessat... can someone share their resources like one shot lectures for pcm 11-12 from which i can prepare from.\n\nwould be better to assume i dont have much prior knowledge of pcm LOL.\n\nthanks",
  "metadata": {
    "root_comment_id": "l04k943",
    "post_id": "1c6xk3s",
    "author": "safenimrod13",
    "url": "https://www.reddit.com/r/PESU/comments/1c6xk3s/any_resources_for_pessat/",
    "permalink": "https://reddit.com/r/PESU/comments/1c6xk3s/any_resources_for_pessat/",
    "score": 6,
    "upvote_ratio": 0.8700000047683716,
    "created_utc": 1713425932,
    "flair": "PESSAT/Admission",
    "nsfw": false
  },
  "comments": [
    {
      "id": "l04k943",
      "body": "I got a seat in rvu in january, but they asked to pay within 10 days and I didn't. Is rvu worth it?\n├── I dont know tbh they asked to pay first year fees to hold your seat if you get an admission in some other place they'd refund everything but keep 10k.\nimma keep that as a last resort and first focus on pes and then comedk\n└── If you're talking about B.Tech, go for RVCE, not RVU, RVU is comparatively new\n    └── [B.Tech](http://B.Tech) CSE, yeah. I see, but I'm NKR though. Is comedk my only option other than management quota? Any resources for comedk and pessat?"
    },
    {
      "id": "l0647ur",
      "body": "pessat is pretty much bang in the middle of KCET and MAINS difficulty imo. so just look at questions in both to get an idea. \n\nalso about RVU, i wouldn't recommend taking a seat there unless it's the absolute best you can get.\n└── thank you for your response, from what they are saying they'd refund everything except 10k if I choose to get an admission somewhere else so its fine i can hold the seat till i get a better place.\n\ncould you please recommend some yt videos or something from which i can study (i have like no pcm knowledge rn)\n    └── for physics i only studied from the HC verma books. maybe rarely a youtube video to understand some explanations\n\nfor math, there's this woman Neha agarwal or something. that kinda helped me\n\nfor chemistry, don't ask me. i literally skipped the entire subject. \n\nall competitive exams for me were 1.5 hours phy, 1.5 hours math, and 5 minutes at the end to make educated guesses for chemistry.\n        └── I cant rely on that 😭\nkay i will look into what I can do, would be best if I can get into pes ec campus with cs.\ndo you have any clues as to how many marks would I need for that\n            └── in pessat they do not release marks. only rank. \n\njust write the exam the best you can and only worry about cutoffs and stuff after you get your rank\n\nbut yeah, if you get pes ec, it's definitely better than rvu anyday of the week. it's basically the same as rr campus but in a different location. placements, syllabus and exams are all the same. \n\nthe exams literally take place at the exact same time on the exact same computers running the exact same interface. \n\nteachers are equally not that great in both campusses\n                └── yeah i have heard that from others too, the reason why i want to go into ec campus is like its very close to my home ;)\n                    └── oh that's great. good luck then\n                        └── thanks"
    }
  ]
}