{
  "id": "1c8hbki",
  "title": "SENIORS PLEASE GIVE ME GENUINE ADVICE",
  "content": "i got decent marks in manipal entrance test and i have pessat after 2 days....  \nso what is better MIT BLR CSE OR PES CSE   \noverall exposure placement internship college life everything coz fee is same nearly",
  "metadata": {
    "root_comment_id": "l0elbh8",
    "post_id": "1c8hbki",
    "author": "MeasurementOwn2314",
    "url": "https://www.reddit.com/r/PESU/comments/1c8hbki/seniors_please_give_me_genuine_advice/",
    "permalink": "https://reddit.com/r/PESU/comments/1c8hbki/seniors_please_give_me_genuine_advice/",
    "score": 9,
    "upvote_ratio": 0.9200000166893005,
    "created_utc": 1713587791,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "l0elbh8",
      "body": "Neither are ideal, but between these two I'd go with PES"
    },
    {
      "id": "l0engq3",
      "body": "I'd recommend PES CS since Manipal BLR is new. This was asked last year as well - if you search the sub you'll find answers"
    },
    {
      "id": "l0eqkiy",
      "body": "Stay away from mit Bangalore. \n\nYou should rather take cs with specialisation in mit main campus\n└── i dont have good enough marks to get cs with any specialisation...reading many reviews of mit blr is it right to say it is worst than muj coz it is too much outside to city any do not even have single food court to eat like wth\n    ├── What is your rank? I'd still wait and see\n\nBut yeah pes both campuses are better. \n\nAlso try till the end through comedk\n    │   └── i got 104 marks rank not ot yet last year last year at my socre it was around 8k...yeah i will try for comedk\n    │       └── Yeah not very great. \n\nI have a friend who's currently in mit Bangalore, I can ask him how it is if you'd like\n\nBut yeah, write the remaining exams properly\n    ├── How much marks did you get bro ?\n    └── We have multiple food courts man. College is literally next to nitte meenakshi, yelahanka.\n        └── i read this stuffs inreddit commnents thats why i am scared...and what is better ece at manipal or cse at mit blr"
    },
    {
      "id": "l0evtw0",
      "body": "I got 80 can I get Manipal Jaipur cse ?\n└── U will get banglore cse but not core \n    └── I have 80% in boards (this year it's 50% MET + 50% boards) now can I get specialisation in banglore ?\n        └── This is know shit in Manipal exams we can't tell untill ranks are out,... Just keep it for backup. "
    },
    {
      "id": "l0foz3e",
      "body": "Bhai manipal ke marks kaise check kiye? Are reults out pls tell me\n└── [apply.manipal.edu](http://apply.manipal.edu) pe login krke scorecard download krle"
    }
  ]
}