{
  "id": "1c9hhob",
  "title": "Propective Student Here",
  "content": "Hello my pessat went really well and will 99% join PES University as my dad said it's good for Foreign University prospects as my goal is to get a good MS abroad not that worried for placements.\n\nI wanted to know 2 things  \n1. How are the prospects to do a research paper  \n2. What's a good CGPA for abroad I've heard it's 8+",
  "metadata": {
    "root_comment_id": "l0lcwsj",
    "post_id": "1c9hhob",
    "author": "Hungry_Cress_5332",
    "url": "https://www.reddit.com/r/PESU/comments/1c9hhob/propective_student_here/",
    "permalink": "https://reddit.com/r/PESU/comments/1c9hhob/propective_student_here/",
    "score": 11,
    "upvote_ratio": 0.9200000166893005,
    "created_utc": 1713704920,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "l0lcwsj",
      "body": "1. Research at PES is a pain point right now. Not many profs here are interested in pursuing good research or even want to for that matter. >90% of them just publish extremely low effort and low quality research in the most predatory and scammy conferences possible. Research clubs are at their lowest since there are no good profs to lead them, some of them have even been shut down. There are probably, at best, a handful of professors in each department who still pursue good research. \n\n2. Maintain a 9+, atleast if you're aiming for CS. It's cut throat out there and CGPA being a primary factor can make or break your case.\n├── I was told every UG student has a mandatory publication\n│   └── Every student does have one. But most students in PES are not interested in research and since the Uni basically forces everyone to publish, you end up with a ton of poor quality papers with a few good ones mixed in. Quality > quantity always when it comes to research: Adcoms know the difference between copy-paste research and actual novelty. A poor publication will hurt your chances instead of improving your profile.\n\nAlso, you do not need a research paper to get into a foreign university. It depends on what kind of programs you are applying to: research oriented ones require good research experience while industry focused ones require good industry experience. Don't be fooled into thinking that a research paper is an entry ticket into graduate school. A lot of candidates get into top schools without a research paper because of their skills/experience in other areas + choosing the right program for their profile.\n└── Hey, being a pre-final year ECE student, I want to add on some things, \n\n1. First off, I do agree 100% that research in PES is not that great as before. Yes, Research clubs are also not that good these days, but what I can say, there are some good ones -> PES Innovation Lab (which has really good professor as faculty to advise), and **IEEE RAS and IEEE CS** too perhaps. However, one must also understand that, ***research within clubs*** still go on as of now at centers like C-IoT, ISFCR PESU, or CAVE Labs or any other research centers. Maybe they may not be high-class or very good, but they are decent. Moreover, adding on, ***PESU has a really good research culture*** is what I feel.  \n\n\n2.  \n\n>a handful of professors in each department who still pursue good research.\n\nSo, I want to quote an incident of one of my friends from an XYZ College in Bangalore, who was intending to do research, their HOD called them and straight up told instead of wasting time on research projects do internships and try to get a job and save **college reputation**\n\nSo, what I feel is *We should be privileged to have atleast a handful of teachers in each department interested in research.*\n\n3. Regarding 2nd point, yes I completely agree that one must definitely have 9+  GPA. \n\nFeel free to correct me if I am wrong, because whatever i have mentioned here, corresponds to the present scenario as of now.\n    └── >PESU has a really good research culture\n\nSorry, but this used to be the case pre-COVID. Research centers now function at barely 30% their output as before. CDSAML is a shadow of its former self. Clubs like CCBD, PCPR have been down for years. CORI was shut down a few months ago. A little research happening in 3-4 clubs does not paint an accurate picture of what has happened to the overall research culture here. Professors here (at least in the CS department) are barely working on their own personal research now. When I joined, almost every prof had their own research goals and was working on something interesting and taking in students. How many profs still do this? How many of them want to take in passionate students? And the worst part about everything mentioned here is that it is all declining and not getting better. EC Campus is still doing better than RR I would say, but all of it is a glimpse of what used to happen. You might have been unfortunate to miss out on the actual research culture that existed here before you joined, but that does not mean that the present day is the benchmark.\n\n>We should be privileged to have atleast a handful of teachers in each department interested in research.\n\nThis is such a flawed outlook. Instead of encouraging a richer research culture and promoting it within students you are asking people to accept it as what it is. If this is the way you look at the problem then you are very much part of the problem because students themselves do not want to pursue good research anymore and are ok with these clubs getting shut down. While I understand that having something is better than nothing, that is not the solution here.\n        └── > CORI was shut down a few months ago.\n\nCORI is not shut down. It is still active. I have few of my friends working there as of now, from ECE. Also there are some 2024 seniors working there too under Manikandan sir \n\nRest all things, makes sense. \n\nThank you :)"
    },
    {
      "id": "l0m6vy9",
      "body": "What branch you are opting ?\n└── Computer Science with AI-ML"
    },
    {
      "id": "l0qc0qp",
      "body": "Hi, as someone who went to PES and then went to the US for my masters, PES does not publish their rankings to other universities. Just an FYI."
    },
    {
      "id": "l1rm4bo",
      "body": "Don't do research at PES if you want peace of mind.\n└── bro knows about rex .💀\n    └── Dr. Rex is honestly one of the BEST professors in the department. Yes, he's very smart - but if you come to a grad school, you'll realize most professors have the same expectations as Dr. Rex. He's one of the only professors in the department who genuinely cares about the careers of his students.\n        └── agree 💯"
    }
  ]
}