{
  "id": "1c9mkyc",
  "title": "PES - Mechanical / Electrical branches ",
  "content": "Back then during my days 2007, getting Mechanical and Electrical at PES University (Ernst while PESIT) was only possible if someone had K-CET rank less then 2700, my friend was somehow lucky got into electrical with 3200+ rank and that was the last seat at PES at that moment, \n\nBut these days it’s sad to see EC at PES closing at 4500+ K-CET rank, like seriously?? And Mechanical closing at 25K ???\n\nMy days had witnessed EC at PES closing at 150 and CS at roughly 300. Implying to which every other department had some “Studios” or academically well-off students. That made PES campus a better once / or say safe. ",
  "metadata": {
    "root_comment_id": "l0m9k37",
    "post_id": "1c9mkyc",
    "author": "ReasonableBother4859",
    "url": "https://www.reddit.com/r/PESU/comments/1c9mkyc/pes_mechanical_electrical_branches/",
    "permalink": "https://reddit.com/r/PESU/comments/1c9mkyc/pes_mechanical_electrical_branches/",
    "score": 4,
    "upvote_ratio": 0.75,
    "created_utc": 1713718192,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "l0m9k37",
      "body": "Well CS hype wasn't so much back then, plus core branches aren't attractive anymore due to very few job opportunities. So the drop in rankings.\n└── Core Engineering jobs do pay well but they require high amount of Theoretical knowledge and practical competency which an individual would earn over a period of time of their career.\n\nIn that I would support CS branch when they try developing new and complex software, not some random Joe writing “Hello World”"
    },
    {
      "id": "l0ma2yf",
      "body": "That time pes didn't had thousand cs seats\n└── lol ! Thousand of seat .. that’s crazy\n    └── 720 core cs seats in main campus and 360 cs AIML seats + 360+120 in ec campus\n        ├── What’s that 30ml ?\n        │   └── Well 360 seats are in CS AIML basically Cs degree with Ai and machine learning specialisation\n        └── It's 720 core CS in ec campus as well"
    }
  ]
}