{
  "id": "1ca1v1s",
  "title": "General enquiry on bcom ",
  "content": "How is the bcom program in pes rr campus I couldn't find much info online soo help me out please.",
  "metadata": {
    "root_comment_id": "l0pq6lm",
    "post_id": "1ca1v1s",
    "author": "Cold-Rabbit-5811",
    "url": "https://www.reddit.com/r/PESU/comments/1ca1v1s/general_enquiry_on_bcom/",
    "permalink": "https://reddit.com/r/PESU/comments/1ca1v1s/general_enquiry_on_bcom/",
    "score": 1,
    "upvote_ratio": 0.6700000166893005,
    "created_utc": 1713760284,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "l0pq6lm",
      "body": "You can't find much info about bcom in this sub\n└── Any suggestions where I can find info on bcom in pes?"
    },
    {
      "id": "l0qbhw6",
      "body": "idk much about bcom general, but i can tell you about bcom acca (theyre pretty similar tho, the subjects are the only things changed mostly). if you dont know what acca is, its basically ca but uk based. so there are 13 papers you need to clear to get the acca title, and in PES you can write 9 papers in the college level without actually taking the professional exam.   \n  \nSo basically, it's a four year course and you have nine exemptions for ACCA. There are 3 levels in the ACCA exams: knowledge, skill and professional. We have exemptions for knowledge and skill. Professional we have to write if we want to be ACCA. Professional level has 4 papers: 2 subjects are mandatory, while the other two subjects are elective. \n\nIn 1st and 2nd year, we finish all the exempted papers. From 3rd year we get coaching for the professional papers. Currently college is offering coaching for only 2 of the electives, but it might change. \n\nAll ACCA subjects are integrated with the bcom subjects. How it works is, for example bcom has business regulatory framework and instead of that subject, we have business and corporate law. \n\nEverything else is pretty much the same, though a little more effort is required here because questions have to be approved by ACCA India, so exams are considerably harder. We also have considerably more to study, cause we don't really get notes. We have to study from the study text, and the pages increase as the difficulty increase. (a subject called UK taxation has more than a 1000 pages, for example). The amount of resources we have is also very large, like we have study text, pocket notes, exam kit and mock questions and answers. And I think the difficulty level will be more for upcoming batches because PES kinda knows what it's doing now and how to do certain things. With us, some things were sort of experimental but now they know what not to do (we were the first batch, the 2024 batch will be the thrid batch)\n\nthere's also this new thing they're starting- bcom with cma or something. i know nothing about it, but you can search it up if you're interested.\n└── Just a few questions regarding the acca.\n1) what are the placements looking like.\n\n2) Do we get  internship opportunities which align with the acca education we have received.\n\n3) what are the future opportunities that can be expected after going through this course.\n\n4) how us the acca program different from the other universities acca program/ are there differnce in opportunities provided like specialized internships etc...\n\nGeneral note- \nI have heard that some colleges give out \"EXPOSURE\" through various Fest, corporate training, Giving industry standard qualities etc..  how is that done for acca (sorry for any dumb questions).\n\nI have also heard that some acca students do their internship at small CA firms to cover the internship requirements for writing the professional paper. Is that true? And how do they do acca in the ca firm. (Again sorry for any dumb questions).\n    └── placements: the management says we will get more priority over bcom general during placments since we are already more than halfway through a professional course (though competition within acca exists- you should ideally clear at least one of the professional papers to gain an upper hand over your batchmates) regarding packages, we were told that the average wouldnt be more than 5 lpa, though you can certainly put more value on yourself by doing extracurriculars and clearing professional papers\n\ninternship: during 2nd sem, we have to do a social internship, which is basically wokring inan ngo. they ideally want you to do social work, but gaining accounting experience in NGOs is highly encourgaed (though rather rare cause what ngo just lets a 2nd sem kid look at/handle their accounts. i personally didn't get to do it even thoigh my NGO told me they would run me through their accounts and give me some details). also, you have to look for the ngo yourself, no one's gonna help you with that. regarding corporate internships, i believe that we have to find them ourselves too. we were originally supposed to have a corporate internship during this june and july, but they cancelled it and we have to instead clear our ethics module (it is an acca requirement). we have 6 month long internshops twice during 6th and 8th sem. we haven;t really gotten much detail about what we have to do there, how we get into the corporate world and shit. i dont think i can be of much help here cause we ourselves have no idea what to do about it\n\nfuture scope: i would say acca has a lot of potentila in india, especially in MNCs. IFRS standards are ebing integrated into Ind AS much more now, so the syllabus for ca and acca are pretty similar. our mentors and tecahers also belive that being an acca will be highly desirable in the future considering the economic expansion. currently, acca's are not have signing authority- it stil rests with ca's. it might chnage in the future, but even without that we are in demnad cause acca's are comparitively lesser than ca's so MNC's and Big 4's definitley want us. you just need to have the credentials they look for\n\ndifference from other unis: i dont think i am qualified enough to answer this- i chose to come to pes simply because i didnt want to do bcom general and pes was close to where i lived lol. i didnt even bother researching anything about acca, i just took it. it took me 2 semesters to understand what i was doing\n\nexposure: you will get it if you go to the right people. no one is gonna go out of their way and tell you \"hey, you're good at this, you should write a paper about it, i'll help you\". you have to identify someone who is gonna help you, talk to them and make them remember you, let them see you are worth helping and they will help you. they will guide you to write, publish and present papers in various conferences. i havent really identified any other exposure within acca, though i highly recommend joining other university clubs- some of the b tech seniors ive met are the most awesome people in my life\n\nacca in ca firms: if you think about it, all acca's in india are at ca firms simply because acca firms do not exist (as far as i know). it really wont be much of a hassel (except having to explain to people what acca is) since accounting standards are pretty similar. also, i dont think we have any internship requirements for professional papers- acca just wants you to write and pass them, we dont have anything like articleship. \n\nQ5: i wouldnt say acca is above ca lol, they are both pretty similar and difficult to do. the exam structure for acca just makes it slightly less of a burden than ca. acca is not very popular in india for now, correct. however, in the near future im pretty confident that we will be in good enough demand so i dont think thats something to br worried about. and you always have the opportunity to go to other countries- 180+ iirc.\n\nwe- the first batch- are still in 2nd year (will be entering 3rd year this august) so we still dont have a lot of clarity about some stuff. things like placements can only be speculation until we actually get placed and there is data to analyze, so all we can do is make sure we have enough credentials for top companies. \n\npretty sleep deprived rn, apologies if i didnt make sense here and there, lmk if i missed anything or if you have any other questions\n        ├── What is 180+ iirc? \nAnd thank you for providing clarification. \n\nGeneral note -\nWhat other extracurricular stuff I need to do so that it complements the acca program and also help me secure a good placement ( I know I am thinking a little too forward but I just want to see the path that is laid out further down the line) .\n        │   └── chill dude, im happy the juniors are actually thinking about their future, 90% of my class didnt do any of this (we are still confused) \n\nso acca is recognised in more than 180 countries (iirc just means if i remember/recall correctly) so you can basically work in many other countries. regarding extracurriculars, at university level you wont really get anything to do with improving your acca credentials directly since most of them are btech related clubs. you can try out for the finance domain in clubs provided they accept non-btech kids. you'll have a higher chance of getting into finance in the cultural clubs, though i hegly recommend joining the cultural clubs for the cultural aspect too- they're super fun! there are also some clubs within the bcom department related to finance you can join, but they dont really hold much value imo. as i said in my previous comment, get close to the right faculty and you can get a paper or two published in your first year. go to conferences and present your papers. participate in hackathons, go to events from other college fests (only if you get reimbursed by uni, DONT spend your own money on it unless its dirt cheap). there are also many free online certification courses you can do. oh also, open a linkedin account if you dont have one already, its gonna impress the teachers. speaking of teachers, they chnage every sem. we only have like one faculty dedicated to acca and shes the program head. we have different faculty every semester. most of them have been good though you get a bad egg here and there (we have an asshat for a faculty this sem and i have a strong suspicion shes gonna be asked to teach us again). most of our visiting faculty dont return, though theres this one guy who came back, THE BEST teacher ever, i hope he keeps coming back everybody deserves to learn from him. the tecahers will help if you arent an asshole. some will go out of their way to help you, for others you have to approach them yourself, but regardless ive almost always found help when i needed it\n        │       └── Humm ok I get the general grasp of the stuff academically now I would like to know the students perspective like the daily life of students the sports allowed to play amount  of free time available etc please clarify the above (as in is it full day/half day, etc as the question follows ) ( sorry to ask any unnecessary details as I have to decide which college ama join in the next 3 to 4 days so the time pressure is on).\n        │           └── i totally understand, dw! okay so for sports inter department competitions and stuff happen. no one's gonna notify you about it, you just need to check for notifications on pesu and check notice boards to see what is happening. there is also availability of badminton court, squash court, basketball court, etc. though im not sure about the booking process to play in these. there are also official university teams for sports you can join. they hove tryouts, but idk much about it. and regarding free time, id say not much, there is talk going on about keeping our classes until 6 though i dont know when/if thats gonna happen, but i cant guarantee free time cause the management keep introducing new things into our time table in between the semester (for example, from the beginning of april we suddenly had classes until 5 15 three days of the week). but i think if you manage your time well it should be okay. classes are usually until 3 15 or 4, and can start at 8 or 8 45, depending on faculty availability. canteen food is good enough and pretty cheap imo, theres variety. i personally dont eat a lot there, and whenever i do i only get the most basic stuff cause im a picky eater, but overall its good. and about the library, its actually really good, theres a lot of variety of books both academic and non academic. ive seen many famous novels and they have whole ass series there. i dont borrow any books i just read them there, so im not sure what the borrowing policy is. i also domt know about the availability of philosophy books cause ive never looked for them, but there are motivational and lifestyle books so i think philosophy will be available too. \n\nanother thing i think you should know is how internals work. so 50 marks go towards internals, out of which 20 are from ISA and 10 each are from assignments, case studies and research work.  we have to do 10 assignments, 5 case studies and 1 research per subject. its actually pretty easy now cause the teachers send us the assignment questions and case study beforehand. we just need to memorize the answeres well enough and write it in class. so it wont take up much of your time, especially if you are open to copying the answers during class (though i shouldnt recommend that). onw downside to this is it HAS to be done during class hours, so if you miss that class then youre gonna have to do a lot of begging to rewrite it.  \n\nlmk if you end up joining pes, i might help you out with academics too!\n        │               └── Sorry for the late reply but ig I will be joining pes only for bcom with acca soo how can I expect the first sem to be ??\n        │                   └── sure! sorry for the late reply, it was internals week\n        │                       └── So I finished my admission to the bcom with acca  today I still have a few questions.\nShould I register for the acca course or is the uni doing it for me?\nAnd what is SRN number? \nAny general idea when the classes start?\n        └── Ok so will we clear all the 9 papers (4 exempted) before we graduate? Also what would happen if we fail a paper. That wouldn't affect our graduation in any way right. Also I heard PES usually has a lot of assignments and projects to keep u on the run. So is it possible to have a life and study at the same time? How are the professors and the study material there? Is it worth the money? Sorry for bombarding you with questions but I'm thinking about doing Acca with bcom and there isn't much info about it online. \n            └── Idk if you are still pursuing this thread but just as a reply you get 9 papers exempted in pes after which 4 you will need to write on your own. On the note that you do fail those papers you will get a backlog which you will need to clear.By joining pes you get the foundation level of the acca papers as exemption after which the next remaining papers that come upto a total of 9 papers are paid exemption you will finish all the exempted papers by approximately the end of 2 and a half or a bit longer of 3 years at pes in the final sem you will need to finish 1 paper of the specialist level. if you do fail and don't clear the backlog then it does affect your grade.\nComming to assignments and projects the main stuff you will be doing is writing work sheets and case studies in class . If you are referring to take home assignments then there is only a research paper that you work on for like a week. If you want to have a fun life at pes then it is recommended that you have good time management as pes is quite the academically challenging institution (you ofcourse have all your fests and clubs ). Comming to the professor's it depends on you how you choose to interact and clarify and adjust to their pace ( but there are also some \"challenging\" profs to deal with but they are quite rare to encounter so no need to worry) but all in all they are quite competent and well, study material is up-to-date but sometimes it is not elaborated well enough. If you ask me if it is worth the money then ig the best thing I can say is it depends on how you choose to interact with the crowd and how much productive you want to be, as what you will be doing is what is going to define how your moneys worth so.. again it's how you use your time to make it your money's worth. If you feel you have more questions or clarification fell free to reach out."
    }
  ]
}