{
  "id": "1cb5l0q",
  "title": "how can I effectively use my 4 months gap between 12th and sem 1 of btech",
  "content": "im done with all my competitive exams, now I have around 4 months of free time in hand. regardless of what college I get into (say i get into PES itself), taking a mental break -relaxing during holidays apart. what should I be doing during these 4 months. anything specific that will come in handy as soon as college starts, maybe certain skills?(like communication skills etc, or even technical skills) \nI'm just a workoholic and I don't want to waste 4 months doing nothing but play video games and end up regretting later. so if someone can suggest me helpful activities id be really greatful.",
  "metadata": {
    "root_comment_id": "l0w7exw",
    "post_id": "1cb5l0q",
    "author": "Ascend_Cloud",
    "url": "https://www.reddit.com/r/PESU/comments/1cb5l0q/how_can_i_effectively_use_my_4_months_gap_between/",
    "permalink": "https://reddit.com/r/PESU/comments/1cb5l0q/how_can_i_effectively_use_my_4_months_gap_between/",
    "score": 4,
    "upvote_ratio": 0.6399999856948853,
    "created_utc": 1713881300,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "l0w7exw",
      "body": "Enjoy it brother you won't get this freedom back\nAlso after spending a good time on yourself maybe you could revise your 12th math differentiation n integration those two are like 2 semester math just revise your basics \nN also try having good communication skills it really does help in many things other than that as I said enjoy the time you'll be in a lot of stress frm August\n└── thankyou for your input, I will try to keep a good balance between the two!!\n    └── kitne attempt kiye bhai pessat me??\n        └── I'm mains candidate\n            └── so r u joining pes ?/\n                └── it's a backup , only pvt college in blr that takes through mains\n                    └── ok goodluck\n                        └── thanks , you too"
    },
    {
      "id": "l0wc17r",
      "body": "Seriously?😂😂 just go out take a breath and enjoy life.\nYou've just got out of a nightmare... this is 4 months is the only peace ull get.Once u join pes itll  be hectic..take a one trip with fam or friends and live a little"
    },
    {
      "id": "l0wjs6j",
      "body": "Bro just enjoy, this is the time.... Literally love your life, go roam around, do whatever you want... Once college starts you won't get time to breathe!\n└── come on now, it's bad but it's not that bad. can you tell me with a straight face that you studied something until a week before every isa?😂\n    └── Yes I do study on a regular basis, I don't believe in \"last moment\" shit\n        └── Yeah don't listen to them, consistency is key. Habits carry over, and a few years later \"last moment\" work will not cut it in the industry. And for people who think \"I will change when I get a job\", you'll soon realise your procrastination will lead to trouble with daily deliverables.\n            └── True words indeed 😊"
    },
    {
      "id": "l0wnyqh",
      "body": "Answering this as a grad:\n\n# Enjoy the last summer vacation of your life.\n\nI cannot stress on that enough. Once you begin college, you are going to miss the annual summer breaks. And once you are out of college, you don't really have a summer break anymore. I'd suggest to relax, do whatever you would like to do and give your mind and body a break. College is a whole new chapter and a pretty big step up in life. It is not going to be like school. Its best to just relax for now and tick things off your bucket list lol. \n\nYou don't need any prep or study to start college, just an open mind ready for the new experience.\n\nHowever if you absolute *want* to do something and you are looking at CS/ECE branches, I would highly recommend doing [MIT's missing semester course](https://missing.csail.mit.edu/).\n└── rightt . . . thanks"
    },
    {
      "id": "l0wpt39",
      "body": "1) i would suggest waking up at 6 am. then remember that you don't need to study anymore, so go to sleep and acually wake up at noon. \n\n2) get up brush your teeth and then (this is very important) eat some shit and either watch tv or play some video games. after a couple hours, glance over to your nearest clock and notice that the time is 12 am. \n\n3) check your calendar, if the day is not the first day of college, go to sleep. if it is the first day of college, cry and then go to sleep. \n\n4) repeat steps 1,2,3 until it is the first day of college\n└── 🗿"
    },
    {
      "id": "l0wx8sk",
      "body": "2 works\n\nJUST CHILL \n\nTLDR:\nCHILL"
    },
    {
      "id": "l0yomqi",
      "body": "I did an internship after my boards. DO NOT DO THIS. You need the break.\n└── what sort of internship\n    └── I did some random thing I got off of internshala."
    },
    {
      "id": "l11c8za",
      "body": "1) Go out for a vacation, if possible try solo vacation. \n2) Whether u r a boy r girl, keep urself fit and in a good flow(good diet) . Cz once college starts it's not easy to develop good habits."
    },
    {
      "id": "l11eoe2",
      "body": "Upskill and prep for interviews.\nDon't while away your time\n└── lol"
    }
  ]
}