{
  "id": "1cb8jth",
  "title": "How many total extra credits are required for B.tech ?",
  "content": "",
  "metadata": {
    "root_comment_id": "l0wr4yu",
    "post_id": "1cb8jth",
    "author": "Sea_Mail_2026",
    "url": "https://www.reddit.com/r/PESU/comments/1cb8jth/how_many_total_extra_credits_are_required_for/",
    "permalink": "https://reddit.com/r/PESU/comments/1cb8jth/how_many_total_extra_credits_are_required_for/",
    "score": 5,
    "upvote_ratio": 0.8600000143051147,
    "created_utc": 1713888663,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "l0wr4yu",
      "body": "What do you mean by total \"extra\" credits? You need 160 credits to graduate.\n└── I think he means other than the ones that are a fixed part of your course. \n\nFor cs i think it's 8 or so\n    └── Last time I checked, coursework adds up to 154 credits over 4 years. 6 credits come from internship (or from coursework again, if you can't get one). 154+6=160.\n        └── Are you including a 2 credit special topic in the second and third year?\n\nIm not sure about how many you've got to take but our teacher said that at some point or another you have to take a couple of them to fulfill the credit requirement. \n\nSo the minimum is definitely equal to or greater than 2 extra credits\n            └── 2 credit special topics also count as coursework, so yes I'm counting them too.\n                └── Oh okay. So you're counting one per sem in both second and third year? Someone told me you need 8 credits like this so maybe it's correct. \n\nI think that's what op was asking about\n                    └── I just did total credits (160) - allowed internship credits (6) which gives 154 course credits. These 154 must come from all normal courses + as many required 2 credit courses (STs). Now for the 6 internship credits, if you do not get an internship you'll have to take more STs to meet the requirement. Thus, the number of STs is not fixed. It depends on how many you need to graduate. \n\nIdeally, college should assign you one ST from sem 3 through 5, and then depending on whether you get an internship, it's duration and how many credits you want to redeem, you take up the remaining number of credits as STs in sem 7 and 8. This is what happened for my batch atleast."
    },
    {
      "id": "l12tzwk",
      "body": "There is mandatory requirement of 160 credits required for B.Tech. The total MANDATORY credits is split as - \n\n22(1st Sem)\n\n22(2nd Sem)\n\n22(3rd Sem)\n\n22(4th Sem)\n\n22(5th Sem) +2(Special Topic Optional)\n\n24(6th Sem)\n\n\n\nLeading to a total of **134 or 136(With 5th Semester Special Topic)**\n\n\n\nThere will be a total of 24 credits available in final year:\n\n7th Sem - 6(Capstone) + 8(Special Topic)\n\n8th Sem- 4(Capstone) + 6(Internship)\n\n  \nDue to this new **rule** : (Not sure if it applies to Department of Computer science) - We should mandatorily publish our capstone project in a reputed Journal for an S-grade. Request someone from CSE - 2025 batch to confirm this once\n\nHope it helps!"
    }
  ]
}