{
  "id": "1cfgc11",
  "title": "Is it worth dropping out ",
  "content": "I feel exhausted after having 3 backlogs(2nd year)\nAnd unable to study and focus anymore\nIt no more feels like a degree or a thing I was interested in, rather feels like a burden ,\nI feel helpless and have kinda given up on studies , At this point I feel dropping out would be a better option \nI need an opinion on this \n",
  "metadata": {
    "root_comment_id": "l1oyd8n",
    "post_id": "1cfgc11",
    "author": "Ashamed-Alps5908",
    "url": "https://www.reddit.com/r/PESU/comments/1cfgc11/is_it_worth_dropping_out/",
    "permalink": "https://reddit.com/r/PESU/comments/1cfgc11/is_it_worth_dropping_out/",
    "score": 10,
    "upvote_ratio": 0.9200000166893005,
    "created_utc": 1714336378,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "l1oyd8n",
      "body": "Won't your two years be wasted if you drop out. And wht will you do after dropping out?? Have u planned ??\n└── Yes I agree 2 years will be wasted but it's better than struggling to do the basics , also I've heard there are  some exams that u can give to get a basic b.com degree"
    },
    {
      "id": "l1qqoc6",
      "body": "Try asking on btechtards developersindia and askindia"
    },
    {
      "id": "l1rf5f4",
      "body": "That’s would depend did you get in via merit or management\n└── Mgmt"
    },
    {
      "id": "l1w468j",
      "body": "Hey brother, look at the positive side. You passed so many tough subjects. I am sure with a little help you can clear the other subjects as well. Talk to your mentor and see how you can get help. You already studied 2 years, 1 more year of study and 1 year of capstone is all that is left to obtain your degree. You can surely do it. I suggest you review and see why you didn't pass those subjects and take the necessary steps to correct it so no more backlogs show up. Take one backlog at a time and clear it up. Make sure you work on the other subjects so you don't get more backlogs.  Dropping out is easy, but then what? Keep a career goal and work towards it every single day.. consistency is the key. Good luck!"
    },
    {
      "id": "l1x215g",
      "body": "I had multiple backlogs in my first year. Cleared all of them by end of second year. Also managed to get an internship during summer break. How?\nI worked on multiple projects (related to the domain I was interested in) and uploaded them to my GitHub and resume. Also maintaining good relations with faculty members can help with them considering to give you opportunities to work with them on their own research/projects they’re working on as an assistant. Many people do it.\n\nMy advice to you would be quit thinking you have the world’s burden on your shoulders cuz you don’t lol. Stop feeling sorry for yourself, you got yourself in this situation and you need to get yourself out. Don’t let one rough patch screw up your entire life.\n├── Bro but see like in my college if u get more than 5 backlogs u have to repeat one year\n│   └── Sorry for the late reply, busy with isa lol. I’m in pes too, 3rd year cse. So I understand your plight very well. \nAll you need to do now is make sure you don’t get backlogs in any other subjects. All you have to do to clear backlogs is to just get 35+ in those exams, not a humongous task honestly.\nNow will you gpa take a hit because you’re preparing for more exams at a time? (Slightly/Maybe). But it’s all worth it if it means you won’t have any “active” backlogs by the time companies start opening up internship positions for your batch.\n│       └── Bro but I'm not able to score in this semester because my basics are not clear im in a termoil \nIdk what to do\n└── may i know in which company you got the internship ? And what projects did u work on ?\n    └── Mostly college projects, pesu.io, open source etc. Internship I got through a referral"
    }
  ]
}