{
  "id": "1cgux7q",
  "title": "2nd year fees",
  "content": "Hello seniors,\n\nI wanted to ask that whn r we supposed to pay our 2nd year fees? Like im frm pessat and 4,60,000 is no joke since im frm a middle class family... Sooo..\n\n1. When should we pay the fee, like do we pay whn the 3rd sem starts or before that?\n\n2. Should we clear the whole fee in one go?\n\n3. Can we pay it in installments? Like half before the sem starts and half after the 3rd sem?\n\nPls answer it would help a lot...💗",
  "metadata": {
    "root_comment_id": "l1y7qjw",
    "post_id": "1cgux7q",
    "author": "Own-Priority777",
    "url": "https://www.reddit.com/r/PESU/comments/1cgux7q/2nd_year_fees/",
    "permalink": "https://reddit.com/r/PESU/comments/1cgux7q/2nd_year_fees/",
    "score": 3,
    "upvote_ratio": 0.7099999785423279,
    "created_utc": 1714489091,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "l1y7qjw",
      "body": "When 3rd sem starts around mid August ig.\nAlso it's a one time payment if I'm not wrong"
    },
    {
      "id": "l1y8ihp",
      "body": "The payment should be done soon after the odd sem starts usually August end.\n\nIt has to be paid in a single installment.\n\nAfaik there is no option for installments, you can ask the accounts dept if there is a provision for this."
    },
    {
      "id": "l1yauy9",
      "body": "There are no installments, u need to pay all at once through payment gateway on pesu academy."
    },
    {
      "id": "l1ywcpq",
      "body": "1. You pay it just before 3rd sem starts, they will start sending reminder emails regarding this again and again.\n2. Um, you have to clear whole fee in one go.\n3. You cant pay in installments, but you can split 460000 into 4 parts and pay separately using any payment method using pesu academy. But all payments have to be made online only\n\nAnd I feel its not worth it to join PES for ECE anymore\n└── How did uk i am from ece??🙃\n    └── The Fees 🤑\n        └── 😭"
    }
  ]
}