{
  "id": "1chdm8q",
  "title": "I have My Pessat Exam tomorrow ie on 2 may 1 shift ",
  "content": "Guys can u give any tips to get good marks as my aim btech with cse what is the average marks so i can get belong to the rank ",
  "metadata": {
    "root_comment_id": "l21y1qx",
    "post_id": "1chdm8q",
    "author": "Regular-County1915",
    "url": "https://www.reddit.com/r/PESU/comments/1chdm8q/i_have_my_pessat_exam_tomorrow_ie_on_2_may_1_shift/",
    "permalink": "https://reddit.com/r/PESU/comments/1chdm8q/i_have_my_pessat_exam_tomorrow_ie_on_2_may_1_shift/",
    "score": 4,
    "upvote_ratio": 0.8299999833106995,
    "created_utc": 1714538911,
    "flair": "PESSAT/Admission",
    "nsfw": false
  },
  "comments": [
    {
      "id": "l21y1qx",
      "body": "if u attempt less than 80 do full guess work \n\nif more than or equal to 80 then no tukka \n\nif more than equal to 110 u can do guess work again \n\nbtw.. ur mains percentile??\n├── 88 in jee mains\n│   └── bss bhai follow the above u will be good acc to me. and plzz tell ur exam experience after the exam\n│       └── tera kab hai\n│           └── mera hogaya bhai isliye to bta rha hu 22 apr ko tha\n│               ├── bro its not good case u just taking on tukkkas\n│               │   └── dekh bhai i attempted 93 so i have done any tukka but if u have less than 80 why not bet on ur luck\n│               └── Have you got any mail regarding interview booking\n│                   ├── no why?? have u got any\n│                   │   └── My friend got one. He applied for btech :\")\n│                   │       └── on which date he had his pessat??\n│                   │           └── 23rd\n│                   │               └── ok mine was on 22nd but i havent got any. there website has also not given this kind of interview booking info.\n│                   │                   └── Yeah thought so. I want to attach the screenshot but im not able to. My friend got the message from whats app actually\n│                   └── intreview is for bsc course i think\n├── What kind of big brain math is this\n│   └── unable to open this\n└── 80 questions or 80 marks?"
    },
    {
      "id": "l22o0u2",
      "body": "Lootenge tumhe par firbhi, \nExam ka koi pattern nahi hoga, dekhkar gabhraana mat aur social media me kam time spend karo.\nBasically, kcet ya comedk ki tarah hai.\n└── ok thanks"
    }
  ]
}