{
  "id": "1cnpw60",
  "title": "How much should I expect?",
  "content": "I did full 12th chem, and maths but my maths is only at the ncert level\nI studied onyl formulas and its applications of 11th and 12th physics.\nShould I expect anything more than 75?",
  "metadata": {
    "root_comment_id": "l38ukmc",
    "post_id": "1cnpw60",
    "author": "lilloser1234",
    "url": "https://www.reddit.com/r/PESU/comments/1cnpw60/how_much_should_i_expect/",
    "permalink": "https://reddit.com/r/PESU/comments/1cnpw60/how_much_should_i_expect/",
    "score": 3,
    "upvote_ratio": 1,
    "created_utc": 1715233566,
    "flair": "PESSAT/Admission",
    "nsfw": false
  },
  "comments": [
    {
      "id": "l38ukmc",
      "body": "yeah 85 easily i think\n└── Hoe much would that be in rank? 5kish?\n    └── i think 3kish coz this year negative marking was there so cutoff will fall dratically\n        └── Nah I doubt it, cuz 85 seems too low for 3k and even 5k"
    },
    {
      "id": "l38yhh5",
      "body": "bro there is normalisation in pessat, So there will be percentile system if u r in top 2%tile in ur shift ur rank will be fine cause nobody can tell about ur marks. So marks vs rank will depend on how many question are solved correctly by other students.\n└── Then too there's got to be a median somewhere right\nWell whatever not expecting much anyway"
    },
    {
      "id": "l3an4kz",
      "body": "How many questions did you attempt and out of them how many did you guess\n├── No I'm asking how much will I get if I only studied this\n│   └── Isnt pes over? \nI thought last date was 6th may\n│       └── Nah tmmrws mine\n│           └── All the best!!!! \nLemme know how it goes!!!!\n└── No I'm asking how much will I get if I only studied this\n    └── i wrote my pessat on 8th. tbh its a bit towards jee, not really jee level but i hope you get it :)  \nmath you need to have knowledge of bit higher than ncert i could say, chemistry i hope you studied the deleted portion of cbse(i didnt) cuz they spammed it and the same for physics(radioacitivity law and shit)  \nfinally you will not at all be able to solve180/180 qn so if u see a lengthy, jus skip it cuz it wudnt be worth it.\n\nHope it helped!\n        └── how many questions did you answer out of 180   \nand out of them how many did you guess\n            └── i answered 160-165 with like 5 guesses?\n                ├── Oh....really? \nOnly 7 guesses? \nYou mustve found the exam relatively easy then\n                │   └── it was typically way easier compared to jee so yes i cud say?(omitting the deleted)\n                └── How much are you scoring in kcet btw\n                    ├── well this years out of 141 so i scored arnd 115ish as i had most of the deleted qn earlier but i knew them as i solved the concepts for jee adv(im cbse so i had no clue abt state/kcet deleted)\n                    │   └── 115 out of 180? Or 115 out of 141. Eitherways its great ngl:) \nAnd yeah im cbse too\n                    │       └── 115/141!\n                    │           └── Thats great dude😭😭\nIm assuming you've achieved 98 percentile ish in mains\n                    │               └── i got a 98.5 lmao.  \ni got 27s1 and 6s1 so welp unlucky :( (scores: 228 and 200)\n                    │                   └── Lmao thought so \nYour scores are amazing \nIm assuming you're aiming for iiit's too\n                    │                       └── well yeah pes ive kept it as my backup cuz its pretty good(rvce looks out of reach with kcet+cbse anyways)\n                    │                           └── I would honestly place pes above rv \nCause I've heard private unis curriculum is more up to date \nWhat all colleges are there on your list\n                    │                               └── well wait\n\nlets dm cuz its so annoying trying to find msgs\n                    └── what are you studying btw?\n                        └── Same boat as yours. \nFinished 12th (cbse) now just waiting for results\n                            └── wbu? what did u fare in kcet,pessat and jee?\n                                └── Kcet im a bit embarrassed to say my scores:) \nPesat yeah I answer like 135 or 140 ish...and in that also I guessed quite a few \nJee I didn't take it cause I hadn't reallt prepared for it and none of the colleges im applying to require jee scores, all are private\n                                    ├── kcet np man! and im pretty sure pessat thats really good right?\n                                    │   └── Yeah kcet ain't that imp \nThose marks are not so useful \nPessat idk:) \nI have no idea what to expect\n                                    └── if you dong mind me askin, wheere are you from?\n                                        ├── Mysore \nYou?\n                                        └── Youre from blore mostly \nCause you wrote pessat on 8th \nAnd here it was available only on 23rd and 24th :(\n                                            └── no im actually from mlr 😭\n                                                └── You're from mangalore??? 😭😭😭\nSorry"
    }
  ]
}