{
  "id": "1cnv3br",
  "title": "Can I expect an admission in pes with 80 in pessat this month shift. (It had negative markings). What rankings can I expect",
  "content": "",
  "metadata": {
    "root_comment_id": "l39rn2x",
    "post_id": "1cnv3br",
    "author": "Competitive_Stay_732",
    "url": "https://www.reddit.com/r/PESU/comments/1cnv3br/can_i_expect_an_admission_in_pes_with_80_in/",
    "permalink": "https://reddit.com/r/PESU/comments/1cnv3br/can_i_expect_an_admission_in_pes_with_80_in/",
    "score": 0,
    "upvote_ratio": 0.25,
    "created_utc": 1715254599,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "l39rn2x",
      "body": "results are out??\n└── 16th Of May"
    },
    {
      "id": "l39ro0h",
      "body": "Can y'all just wait till results are announced. You guys don't have patience or what I understand it's the turning point of your life \nBut instead of spamming the same question in this sub y'all can wait for the results.\nNO ONE KNOWS FOR HOW MANY WHAT RANK YOU'LL GET.\n├── Finally, someone TOLD. \n\nTo all juniors,   \nPlease don't post same questions again and again. Check subreddit again if the question has been already posted. And DO NOT Ask questions regarding *marks of PESSAT* because the Marks is not at all revealed. No one can predict the marks. Just chill out till your results come.\n└── Literally me, even am pretty eager for the ranks but waiting on the edge of my seat 😭"
    },
    {
      "id": "l39vjgl",
      "body": "bro atleast wait for the goddamn ranks are given. everybody knows exactly what you do, nothing.\n└── Wdym wtt I do?? It's a simple qs, and the top comment alr said the same thing.\n    └── Everyone's frustrated because all aspirants like you post the same question every day without going through previous answers to the same question."
    },
    {
      "id": "l3bnfat",
      "body": "I don't know what's wrong with these juniors they're more paranoid than Saddam Hussein ever was. Like wait for your results bro, why are you freaking out so much?\n I understand your excitement but spare some time and scroll through the sub for existing queries rather than spanning unnecessarily. Maintain the decorum of the subreddit."
    }
  ]
}