{
  "id": "1co7z9n",
  "title": "How do I update 12th board marks for PESSAT ",
  "content": "I'm a student of ISC board and my result was announced on 6th May.\n\nQuestions:\n1) When I try to search Google, it shows me the link to update PUC marks. According to my little knowledge, it is something equivalent to 11+12th in Karnataka. Is it valid for me to update 12th ISC boards result there?\n2) If I do update it there n upload marksheet, I have to also fill the \"Overall Aggregate Percentage\". Should I fill percentage of best 4 subjects(as calculated in ISC) or including all 5 subjects? \n\n",
  "metadata": {
    "root_comment_id": "l3dfycd",
    "post_id": "1co7z9n",
    "author": "Individual_Vehicle52",
    "url": "https://i.redd.it/9voed68wtgzc1.jpeg",
    "permalink": "https://reddit.com/r/PESU/comments/1co7z9n/how_do_i_update_12th_board_marks_for_pessat/",
    "score": 3,
    "upvote_ratio": 0.8100000023841858,
    "created_utc": 1715288678,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "l3dfycd",
      "body": "Where did you get this link??"
    },
    {
      "id": "l3do14t",
      "body": "Hey I want to know this too! Aren't we supposed to get an email with the instructions for the same? I never got it.\n└── Exactly, I have been delaying updating marks because I am waiting for the email. The last date is 13th May n there's yet to be any email. Moreover, if I remember correctly, they will disqualify candidates who don't update their marks."
    },
    {
      "id": "l3dwjkz",
      "body": "1. They're asking for your 12th marks only.\n2. Overall aggregate.\n└── 2) So, is it best of 4 or 5. Maybe this is a petty question because I will be uploading my marksheet and they can check it themselves. However, I just want to be cautious in case they claim I lied about the percentage or something.\n    └── If I remember correctly, don't go with the \"best of\" score. Just calculate your overall across all subjects. That's what my ISC friends did back during my admission time. Even CBSE had a best-4 policy but we input our overall aggregate.\n        └── Ok, thanks."
    },
    {
      "id": "l3dynvl",
      "body": "i wouldve never found this lol why didn't tehy give any instructions to submit board marks"
    },
    {
      "id": "l3e4m3w",
      "body": "Hey, can you send the link to this, it isn't showing up on my portal for some reason\n└── https://pessat.com/pucmarks/"
    },
    {
      "id": "l3e6cff",
      "body": "i just submitted my marks but then it opened the login portal again then i logged in and its showing to fill and upload again lol what's happening\n└── Lol. When I tried to login a few days ago, it said that my registration number was invalid. Later, they did fix it. So I guess, just wait and see perhaps."
    },
    {
      "id": "l3eio6m",
      "body": "Bro but cbse results aren't announced yet\n└── It does say that 13th May is the last date to update marks(only for candidates whose 12th/PUC marks have been declared)\nSo I believe that you don't need to worry."
    },
    {
      "id": "l3tm3xe",
      "body": "guys after finishing those things i clicked the submit marks and later it brought me to the same page what does it mean ?\n└── Click on continue below , u will see a summary sheet of ur marks , which states that u hv submitted ur marks.\n    └── I didnt show, it just sent me back into the login page. So should i need to do it again?\n        └── Did u click on continue option below ur marks sheet ?\n            └── Marks sheet shld be in jpg format 900kb\n                ├── Jpeg? I chose pdf\n                │   └── Only jpg can be uploaded, just convert and compress it\n                │       └── Ok thanks\n                └── And also is it only for 12th marksheet or with 10th marksheet?\n                    └── 12th only\n                        ├── Ok\n                        └── Yo dude, when is the last date to do finish this?\n                            └── For puc I guess today , but as cbse results were released today , they might extend\n                                └── Ok bro, i still tried to do it.. but it went to the candidate login's page again after i clicked submit your marks button. Idk if it is even correct or not\n                                    └── Scroll down , click on continue option\n                                        └── YESS BRO YESS IT FINALLY CAME THANKS ALOT\n                                            └── Ok nice .\n\nATB FOR RESULTS :D\n                                                └── Thanks alot\nI feel anxiousness but i wish it is for the best"
    },
    {
      "id": "l3tn08a",
      "body": "I have uploaded my 12th marksheet but whenever i click on that link again i brings me back to that same page as if it's not submitted what to do\n└── Click on continue , below u will see a summary sheet of ur marks , which states that u hv submitted ur marks.\n    └── I did clicked on the continue nd it showed something like the short summary nd then i logged out .\nBut when again i tried to log in they just showed the portal with continue option written all over again ..\n\nSo is it submitted or not .. it's not confirming anywhere\n        └── When u see that summary , I guess it’s submitted. \n\nMostly they are gonna extend the date because half of the people didn’t receive a email or SMS about it still .\n            └── Oh yeh i can see the summary..it's just that when again i try to log in ..it shows me that filled form nd continue option written all over again nd when i click on it it again shows me the small summary nd after that there is no option..that is why i was confused if it's submitted or not\n                └── Summary is last step , it should be submitted mostly .\n\n\nATB FOR RESULTS \n                    └── Yehh let's wait now .tq soo muchhh"
    },
    {
      "id": "l3vkroc",
      "body": "In my case, I don’t no why but I am unable to submit my file of my 12th marksheet. In what file type and size do we have to submit ?\n└── Jpg below (900kb)"
    },
    {
      "id": "l3yhmsl",
      "body": "What happens if you don't fill it at all?"
    }
  ]
}