{
  "id": "1couu2o",
  "title": "help",
  "content": "fucked this sem....isa total is on average of 33 in internals....how much should i get in esa to atleast get above 8.5(if its possible)",
  "metadata": {
    "root_comment_id": "l3gk014",
    "post_id": "1couu2o",
    "author": "AlternativeGood9237",
    "url": "https://www.reddit.com/r/PESU/comments/1couu2o/help/",
    "permalink": "https://reddit.com/r/PESU/comments/1couu2o/help/",
    "score": 3,
    "upvote_ratio": 0.800000011920929,
    "created_utc": 1715361432,
    "flair": "Study Help :table:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "l3gk014",
      "body": "Which sem? \n\nAlso I'm sure you could probably calculate on your own the esa score required to roughly no how much to get your desired gpa.  \n\nMy assumption is probably high 70s to 80+ to guarantee 8.5\n└── 4th sem and how do you calculate  the esa score roughly?\n    └── How do you not know how to calculate your GPA and ESA scores after being here for 4 semesters? That's plain ignorance and lack of seriousness.\n\nCheck the FAQs, it's documented here: https://bit.ly/pesu-faq"
    },
    {
      "id": "l3gtoue",
      "body": "I asked a lot of my friends and based on thinking that you got 23 in each isa, you total to 115 per isa. \n\nBased on the data i have from my friends you should get like high 7 to low 8. If you continue like this\n\nAdd to the data by telling me your last sem sgpa\n└── Is b grade possible in cn somehow with 23-25/50 . I fucked up very badly in cn and laa\n    ├── God knows dude. But unlikely i think\n    └── CN is a 5 credit course so internals including lab is 30 marks as opposed to 10 for normal courses. So  if you have 23-25/50 that's like 15 out of 40 assuming you thought internals is 10 marks. Now assuming you submitted all the lab stuff and got good in the quiz(best case), add 30 to 15 we have 45. If you want B grade, 0.7*120 =84. So you need 39 more marks so 78 in ESA\n\nPerfectly achievable since CN is a 5 credit course. You have 2 days to prepare as well"
    }
  ]
}