{
  "id": "1cqx4kc",
  "title": "Help",
  "content": "Could anyone tell what would be my rank if I scored around 160 out of 180 in pessat This year?",
  "metadata": {
    "root_comment_id": "l3u6t3r",
    "post_id": "1cqx4kc",
    "author": "Fragrant-Buffalo8135",
    "url": "https://www.reddit.com/r/PESU/comments/1cqx4kc/help/",
    "permalink": "https://reddit.com/r/PESU/comments/1cqx4kc/help/",
    "score": 0,
    "upvote_ratio": 0.18000000715255737,
    "created_utc": 1715600265,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "l3u6t3r",
      "body": "For the hundredth time, no one can tell because they do not disclose the marks you scored. I get that this is a nerve wracking period for your batch but if you're absolutely sure you did well then you have a fair chance of getting in. That is all anyone can say about it.\n└── Just a approximation I am not asking exact numbers but just a approx rank for 160 score?\n    ├── You will definitely get cs with a score like that\n    └── Probably top 100, most likely top 200 but it’s an estimation so take it with a grain of salt, you only need a rank of above 1k to get the best seat possible anyways, which you will definitely get so chill\n        └── So there are 200 students who have scored above 160? What's the score of rank 1?\n            ├── Bro this is all speculation , noones are ever revealed and we don’t know exactly how many marks approximate to what rank. Please stop asking such pointless questions constantly.\n            │   └── I think the mods need to create a megathread for such questions. It's getting repetitive to the point of annoyance.\n            │       └── u/ChromaticChaos for the love of God please don't approve posts like these (or give me perms to reject lmao)\n            │           └── I could reject, but i think it wouldn't be fair?\n\nThese are genuine questions ig\n\nIf is start rejecting this, then, what would be line dividing a genuine question and a non-genuine question\n            │               └── Reject the posts with a reason if they are duplicates. This has been asked atleast thrice this week. Reject duplicates, not non-genuine questions.\n            │                   └── got it!\n            └── Dude, nobody can predict because you only get your rank, not marks. Stop posting duplicate and redundant questions."
    },
    {
      "id": "l3v74db",
      "body": "AIR 1-10 pakka brother\n└── Is it true ? Like I was seeing some YouTube videos there they monetioned that on a score of 150 plus there is rank under 300 I mean top 10 how?\n    ├── Don't trust any website/video/blog about PESU marks -> ranks. PES has never disclosed marks, how are websites able to estimate ranks? Its all clickbait.\n    └── Look dude a lot of people have told this before that it's not predictable.....160 in your shift could be equivalent to 140 in a difficult shift so just keep calm, I understand ur anxiety but it's really not possible to guess the rank, definitely it's gonna be a good rank to at least fetch you RR-CSE (being the most popular choice lol) so just chill and focus on other exams if any"
    },
    {
      "id": "l3v8ziw",
      "body": "On avg ppl get about a 100 for a rank above 3k, how tf did u get 160?\n└── If I get 155 to 160 what would be my rank approx?\n    └── what do you think huh?\n        └── I am really not in contact with any seniors or alumini so I don't have a base idea of how much could I get , all I have seen is on internet and YouTube and they say around 300 or less but i was Lil confused that more than 200 students will a score of more than 160 means I lacked somewhere I guess I could have done better and yes I have not done well in my 12 boards so family is just fucking me up so maybe a cope up way on 16 may\n            └── pessat exam is out of 180 my friend\n                └── Yep I am talking about 300 rank*\n                    └── wow i got 85% of the questions correct in a competitive entracne exam i wonder how much i will get... do you know u sound obnoxius rn? ull get ranks 1-10 easily"
    },
    {
      "id": "l3yk9v9",
      "body": "160/180 in a paper with negative marking? If that’s really true why do you even want pes, focus on advance/ manipal/bits\n└── I am not confident about advance that's why I want to do something in which I am totally confident about and maybe get something best and yes looking for bits btw the negative marking was -0.25 right?"
    }
  ]
}