{
  "id": "1ct2e37",
  "title": "\"Choosing the Right Path: Should I Wait or Dive into PES University?\"",
  "content": "Hey everyone,\n\nExciting new, I got accepted into PES University. However, I'm in a bit of a dilemma and could use some advice.\n\nHere's the situation: While I got accepted into PES University after my interview, I initially saw it as a backup due to its high fees and uncertain value. Now I'm torn between sticking with PES or exploring other options.\n\nI've also applied to St. Joseph's and Kristu Jayanti College, but I'm on their waiting lists because I don't have my 11th-grade results yet. The results are due in early August, and there's no guarantee that seats will still be available.\n\nSo, should I wait for my results and risk missing out on seats at St. Joseph's or Kristu Jayanti, or should I just go ahead and enroll at PES University?\n\nAny insights would be appreciated!\n\nCheers!",
  "metadata": {
    "root_comment_id": "l493k88",
    "post_id": "1ct2e37",
    "author": "Practical-Abalone121",
    "url": "https://www.reddit.com/r/PESU/comments/1ct2e37/choosing_the_right_path_should_i_wait_or_dive/",
    "permalink": "https://reddit.com/r/PESU/comments/1ct2e37/choosing_the_right_path_should_i_wait_or_dive/",
    "score": 0,
    "upvote_ratio": 0.4399999976158142,
    "created_utc": 1715825976,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "l493k88",
      "body": "Congrats mate on it. Well in your case I prefer you opting out the safest option"
    },
    {
      "id": "l493n4m",
      "body": "No. Just don't."
    },
    {
      "id": "l497hvm",
      "body": "Just Block the seat don't pay th the Full amount that's the best option if you get St Joseph then go there and get Back the Money From PES.\n└── For context : I'm a CIE student completing both AS and A levels together this year due to last year's backlog. While PES is a great option, its high fees make me hesitant. I've also applied to St. Joseph's and Kristu Jayanti College but am on their waiting lists due to missing 11th-grade results."
    },
    {
      "id": "l499xiv",
      "body": "Dive into Pesu\nWise choice of words\n└── I mean I have read recently someone jumping off from the campus building like a dive bomb\n    └── Fucking people don't prioritize mental health for fuck sake!"
    },
    {
      "id": "l49bofg",
      "body": " which course are you joining for??\nlike i have no idea about the interview or any shi like what have you mentioned\n└── For BCA"
    },
    {
      "id": "l49irbw",
      "body": "Honestly just block the seat and hope for the best"
    }
  ]
}