{
  "id": "1ct7s20",
  "title": "I have heard the syllabus in PESU is quite updated to the industry requirements if this true ? If yes can you please share the pdf of the syllabus ?",
  "content": "I got 8k rank so not much to talk about will be going to a tier 3 college but Microsoft and amazing does visit my campus\nI just don't want to study old syllabus which people say are outdated ",
  "metadata": {
    "root_comment_id": "l4a0hfu",
    "post_id": "1ct7s20",
    "author": "Mother_Breadfruit107",
    "url": "https://www.reddit.com/r/PESU/comments/1ct7s20/i_have_heard_the_syllabus_in_pesu_is_quite/",
    "permalink": "https://reddit.com/r/PESU/comments/1ct7s20/i_have_heard_the_syllabus_in_pesu_is_quite/",
    "score": 2,
    "upvote_ratio": 0.6700000166893005,
    "created_utc": 1715846490,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "l4a0hfu",
      "body": "Easiest way to get the updated syllabus is to ask a current student. If you visit the FAQs, there is a question on where to access the latest syllabi, visit that link: [https://www.reddit.com/r/PESU/comments/14c1iym/faqs/](https://www.reddit.com/r/PESU/comments/14c1iym/faqs/)"
    },
    {
      "id": "l4a39r4",
      "body": "Also there is a website called betterpes where you find all your course content along with the syllabus.\n└── its dead, no one uses it dw."
    },
    {
      "id": "l4a3qo7",
      "body": "Never heard of Amazing.. A new Unicorn?\n├── He meant Amazon ig\n└── Oh my bad i meant Amazon lmao"
    },
    {
      "id": "l4a78ll",
      "body": "which college are you joining if you don't mind me asking?\n└── Most prolly MANIPAL BLR OR Jaipur both have Microsoft Amazon visiting\n    └── ahh i thought dayanand sagar university\n        └── Microsoft doesn't visit dayanand Sagar Amazon didn't last year (as per a senior studying)\n            └── They do , in the university , there's a complete brochure of how many people joined each company , they were a few in amazon and Microsoft .\nthats why I joined it\n                └── Microsoft and Amazon don't visit RVCE why would they visit Dayanand Sagar (RVCE placement spreadsheet is already posted in the sub reddit refer it 2 guys who were placed in Amazon were off campus )\n                    └── bhai , Google visited jain global campus 💀💀. \nwe cant really judge anything at this point"
    },
    {
      "id": "l4aa616",
      "body": "Have a look at [https://better-pes.vercel.app](https://better-pes.vercel.app) \n\nIt contains the latest syllabus for most courses"
    },
    {
      "id": "l4aa68w",
      "body": "Have a look at [https://better-pes.vercel.app](https://better-pes.vercel.app) \n\nIt contains the latest syllabus for most courses\n└── No bro, It is not getting updated for ECE now"
    },
    {
      "id": "l4aa6g1",
      "body": "Have a look at [https://better-pes.vercel.app](https://better-pes.vercel.app) \n\nIt contains the latest syllabus for most courses"
    },
    {
      "id": "l4beumd",
      "body": "Based on your branch, I can Send u the updated syllabus\n└── Cse(AIML)\n    └── This i dont have. better to ask someone in 2nd year as of now. Coz my batch didnt have AIML\n        └── Okay can you send the CSE syllabus ?\n            └── Sure, you can find all course infos in this link  \n\n[https://we.tl/t-5umVUfymsO](https://we.tl/t-5umVUfymsO)"
    }
  ]
}