{
  "id": "1ct87hg",
  "title": "Can I attend Round 2 of Counselling If I skip the Round 1 for now? Can I attend the counselling without Parent/Local Guardian with me?",
  "content": "",
  "metadata": {
    "root_comment_id": "l4a6u25",
    "post_id": "1ct87hg",
    "author": "Miserable-Raise2771",
    "url": "https://www.reddit.com/r/PESU/comments/1ct87hg/can_i_attend_round_2_of_counselling_if_i_skip_the/",
    "permalink": "https://reddit.com/r/PESU/comments/1ct87hg/can_i_attend_round_2_of_counselling_if_i_skip_the/",
    "score": 4,
    "upvote_ratio": 0.8299999833106995,
    "created_utc": 1715848426,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "l4a6u25",
      "body": "Same doubt"
    },
    {
      "id": "l4a7tas",
      "body": "First question yes. Second i think mostly yes\n└── is it better to directly go for round 2 i have 35xx rank\n    ├── Last year I heard they pulled a scam where they moved pessat seats to management after round 1\n\nSo there were abnormally few and even negative seats left for round 2. \n\nDon't take the risk. You have a good chance as getting cs or aiml at ec campus\n    │   └── oh okay thanks and what is the refund policy can i withdraw my seat afterwards ?\n    │       └── You will be charged 10k and the rest will be refunded if you cancel.\n    │           ├── okay thanks\n    │           └── How much time does It take for the refund to be reflected in my account, I mean do they do it as soon as I withdraw the seat or when the whole counselling process is done\n    │               └── It will take a little bit of time, I am not sure how long it took.\n    ├── Go and Speak to PESU asking Why they Scam Seats In Round 2 Bro.\n    └── go round 1  \nyou cann pay and refund if you dont want to do in pes\n        └── T\n            └── cfbr"
    },
    {
      "id": "l4ab40i",
      "body": "Yes for both; but i would suggest to have either a parent or local guardian with you\n├── is it better to directly go for round 2 i have 35xx rank\n│   ├── and what is the refund policy can i withdraw my seat after that?\n│   └── i don't think i can answer that\n└── I mean, I'm from North and It'd really get very costly coz I'd have to fly my way here and fare would get upto 10k so that'd cost me too much to take parents with me.\n    ├── same for me i am from delhi its costing 15k pp plus sucides in pesu also giving a concern\n    │   └── Lmk if you want to go together I'll most prolly board from Delhi Airport too\n    └── Even am flying with the most expensive fares I've ever had, my rank is even more then y'all but still going as I have no other options left 😭"
    },
    {
      "id": "l4affzc",
      "body": "I have 64xx rank\nIs there any sense for me going to offline counselling any computer related branch will work in any of the two campus\nEven if they ask extra charge\n└── Check last years cutoff  in this post [https://www.reddit.com/r/PESU/comments/1ct5ujc/which\\_branch\\_can\\_i\\_get\\_at\\_no\\_dont\\_make\\_such\\_posts/](https://www.reddit.com/r/PESU/comments/1ct5ujc/which_branch_can_i_get_at_no_dont_make_such_posts/)"
    },
    {
      "id": "l4ai0ia",
      "body": "I'd suggest you take some local guardian/parent with you to the counselling.  \nRound 2 counselling the chances of seats being available is VERY VERY Less. Last year for round2 cse seats were in negatives for example ( Overbooked)\n└── I have around 4xx rank, would it still be difficult to get CSE in 2nd round?\n    ├── Yes.  \nThere may not be any seat left even if you have under 100 rank. This year idk how it will be, but last year 0 cse seats left in round2\n    └── In 2022 counselling, there were 77 seats left in CSE and 15 seats in CSE-AIML for the second round\n\n[Round-2 Beginning](https://photos.app.goo.gl/1m2Mr5ZM4Lx6ZsCp8)"
    },
    {
      "id": "l4akd5i",
      "body": "JEE advanced and CET verification is happening on Counselling day. Child can authorise their parent and need not attend."
    },
    {
      "id": "l4kl6u9",
      "body": "For both the questions, the answer is yes. Just that you need to bring everything like the demand draft, your docs blah blah blah."
    },
    {
      "id": "l8ag0jx",
      "body": "I wanted ECE in RR campus but I got in EC campus instead.I was 100 ranks behind the last seat so should I attend round 2."
    },
    {
      "id": "l8g1i66",
      "body": "I could not attend pessat counselling due to jee advanced exam in last month.. My pessat rank 580. Can I attend 2nd round for getting cse in RR campus?"
    }
  ]
}