{
  "id": "1cta7wy",
  "title": "Will I get ECE in any branch? (I saw the post by Rowlet but read the body!)",
  "content": "I've got a rank of 6307 in PESSAT. I also got a mail asking me to attend counselling in 26th May. My dad is saying that if I don't get ECE, it's not worth going. So will I get cuz some people such as my counsellor say I can  but from Rowlet's post I can see that I ain't close to getting ECE. Please help me!",
  "metadata": {
    "root_comment_id": "l4akyec",
    "post_id": "1cta7wy",
    "author": "PSYCHC75",
    "url": "https://www.reddit.com/r/PESU/comments/1cta7wy/will_i_get_ece_in_any_branch_i_saw_the_post_by/",
    "permalink": "https://reddit.com/r/PESU/comments/1cta7wy/will_i_get_ece_in_any_branch_i_saw_the_post_by/",
    "score": 6,
    "upvote_ratio": 0.800000011920929,
    "created_utc": 1715857224,
    "flair": "PESSAT/Admission",
    "nsfw": false
  },
  "comments": [
    {
      "id": "l4akyec",
      "body": "98% chance you wont get. ece closes early"
    },
    {
      "id": "l4ao2gw",
      "body": "It's possible. \n\nThey increased the fee, And the seat allotment is offline only.\n\nI'm sure that the number of people who come will decrease a lot.\n\nWill the ece cutoff for ec campus move from 4k to 6k. I don't know. But i think it's a Rick worth taking if you don't have many other options\n├── But thing to note here is that the factors you speak of - increase in fees, offline allotment - these happen **every** year. \n\nBut I agree with you. Go for counseling, always. There is nothing to lose.\n│   ├── Yeah that's true about the fee\n\nBut my batch has online allotment for people out of the state of something. People in Bangalore had to go but a lot of other people just did it online. And it was 22, not a COVID batch.\n│   │   └── Are you sure? PES has always had offline counseling.\n│   │       ├── bro what do you think of the campus life i know its non existent but which one would you say is better  \nec campus or rr campus?\n│   │       │   ├── It's not as bad as people make it out to be. But rr is kinda better for infrastructure and location\n│   │       │   │   └── bro all i care is about sports facilities and hostels which one do you think is the better option?\n│   │       │   │       └── From second year both are fine. But for first year in ec campus the hostel is like 6km away. They arrange a bus every morning and evening. If you miss the but you find your own transportation. \n\nBut rr has hostels inside campus from first year. \n\nIf you're a girl, hostels are outside for all years in both campuses 💀\n│   │       │   └── Campus life depends largely on what you make out of it. If you are anti-social and cannot make friends, you won't have a life. There are events happening all the time around campus. Go out there and talk to people and have fun.\n│   │       └── Dude my first year roommate attended second round counseling from the hostel at ec campus\n\nYes I'm sure 🤣\n│   │           └── what is my chance of getting ece at 79xx? And are the people from pes harami enough to get me ece if i give money like vit?\n│   │               └── That is called management quota.\n│   │                   └── I have seen Round 1 cutoffs and I know I am almost getting nothing there at 79xx. What is my chances in round 2?\n│   │                       └── Probably nothing. All branches close at \\~7k and the cutoffs mentioned are after both rounds.\n│   │                           └── I guess shiksha website scammed me. However, what do u think or srm ktr ece?\n│   └── Hey i have a similar question . at rank 2396 is there any chance to get cse AI ML at rr campus??\n│       └── [https://www.reddit.com/r/PESU/comments/1ct5ujc/which\\_branch\\_can\\_i\\_get\\_at\\_no\\_dont\\_make\\_such\\_posts/](https://www.reddit.com/r/PESU/comments/1ct5ujc/which_branch_can_i_get_at_no_dont_make_such_posts/)\n└── Hey i have a similar question . at rank 2396 is it possible to get cse AI ML at rr campus??\n    ├── Anything is possible. 2p20 cutoff was ~1800. Now they doubled the intake, and the offline counseling. So yeah it's definitely a possibility. If not cse at ec campus is good as well\n    └── +1, got a rank of 240X"
    },
    {
      "id": "l4bruq5",
      "body": "As an ECE student studying at EC campus, I would suggest not considering EC campus. The placements in the campus are very poor, and the HOD doesn't care. If you encounter any problems in the department, there is nothing you can do, nor can you complain to anyone. I remember someone complained about a faculty member to the HOD, and for the whole semester, that faculty member literally ragged him in almost every class. You will not have any independence in forming project teams, and for any issues, you are solely responsible."
    }
  ]
}