{
  "id": "1ctflxo",
  "title": "PES RR campus vs Ramaiah ",
  "content": "Please enlighten me about these things:\n1. Placement statistics\n2. Crowd and Peer group\n3. Clubs and extracurricular ",
  "metadata": {
    "root_comment_id": "l4bmp1c",
    "post_id": "1ctflxo",
    "author": "Hazel_unknown",
    "url": "https://www.reddit.com/r/PESU/comments/1ctflxo/pes_rr_campus_vs_ramaiah/",
    "permalink": "https://reddit.com/r/PESU/comments/1ctflxo/pes_rr_campus_vs_ramaiah/",
    "score": 5,
    "upvote_ratio": 0.8600000143051147,
    "created_utc": 1715873259,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "l4bmp1c",
      "body": "Placement statistics for PES can be found here: [https://www.reddit.com/r/PESU/comments/1ct5ujc/comment/l49p42j/](https://www.reddit.com/r/PESU/comments/1ct5ujc/comment/l49p42j/)\n\nPES crowd and peer group is top notch. Great alumni and network connections who are either working in top MNCs or pursuing Masters at top Uni's abroad. The crowd here is pretty competitive.\n\nClubs are probably decent at best. \n\nThere are more details highlighted in the pros and cons: [https://www.reddit.com/r/PESU/comments/13ygg68/comment/jmmro6e](https://www.reddit.com/r/PESU/comments/13ygg68/comment/jmmro6e)\n└── Thank youu"
    },
    {
      "id": "l4cye7s",
      "body": "pes peer group is the best. Alumni network >>> ... Also the hackathon culture is far more better\n└── ngl the hackathon culture has been utterly ruined. No point in this stuff when there's one every week or the other, and when the organisers are expected to manage organising such events in their clubs with no attendance benefits\n    └── Ayy, the attendance is the issue. I was so pissed, I had to miss so many classes for organising hackathons to realise I won't be getting attendance. That's bad 😔 but we organise quite frequently unlike other colleges (partially and politics here in hackathons are surreal lmao)\n        ├── ヽ༼ ຈل͜ຈ༽ ﾉ Raise ur dongers!\n\n^^Dongers ^^Raised: ^^75440\n\n^^Check ^^Out ^^/r/AyyLmao2DongerBot ^^For ^^More ^^Info\n        └── The frequency is what is leading to a dilution in quality. A couple of years ago, hackathons were held about max 2 times a semester. People would spend time coming up with a solid and if possible novel idea to build and present. Many people in my batch turned their hackathon ideas into major projects/papers. We used to look forward to these hackathons right from the beginning of the semester and would put everything into it when it did arrive. There was more effort and passion involved.\n\nYou can't do that if you have a hackathon happening every week where all people get to do for prep is git clone different existing projetcts.\n            ├── This is so trueee! Most people just copy from GitHub or use ChatGPT and end up winning. Things are in a sad state now 😔\n            └── Oh and have any idea abt the average package offered to CS and AI students?\n                └── The batch was introduced 2 years ago. The first batch is still in 2nd year. I wouldn't recommend choosing AIML for undergrad."
    },
    {
      "id": "l4ezhp3",
      "body": "Can't say much about Ramaiah CSE but its IS programme has some extremely great crowd and alumni"
    },
    {
      "id": "l4kgcnu",
      "body": "If you're getting MSRIT and PESU RR campus (CSE related branches) through KCET, then it would be better to choose PESU RR campus. However, if you're getting PESU RR campus through PESSAT and MSRIT through KCET then IMO coming here (MSRIT) would be a better choice. I'm from MSRIT and if I were to answer:\n\n1. Placement statistics are not even documented and released by MSRIT. The best that we have is an incomplete student compilation of all the 10LPA+ companies back from 2023. [https://drive.google.com/drive/folders/1cWBRZXSk4n4NJ7inJDiSrKQNvBa-UA0h](https://drive.google.com/drive/folders/1cWBRZXSk4n4NJ7inJDiSrKQNvBa-UA0h) (Credits: Seniors from MSRIT)\n\n2. I'm from CSE(CY) and the peer/crowd here is not really the best. Noisy classes, only a few students interested per-say. However, the crowd in ISE is really nice and I'm pretty sure you can see that through the current status of the alumni. \n\n3. Only 2 popular coding related clubs here: GDSC RIT and CodeRIT. There are 2-3 other coding/CSE related clubs but they are small and ran by mostly power/status-hungry people and that would make sense why most of the clubs collapse by the end of the 4th year. However, when we consider music/sports/etc. , there are quite a few good clubs plus the sports facilities provided are honestly top-notch. \n\nOverall it depends on which branch you're choosing and what is your mode of admission. If it is a CSE related stream and you're getting both through KCET then PESU RR campus would be better IMO."
    }
  ]
}