{
  "id": "1ctjttg",
  "title": "EC Campus CSE vs RR Campus ECE",
  "content": "I'm really confused about which one of these to choose. I'd like to know more about the difference in courses and placements in both fields and more about in faculty, research labs, hostel (girls), fests, clubs etc of both campuses. \nThank you in advance.",
  "metadata": {
    "root_comment_id": "l4cgjdy",
    "post_id": "1ctjttg",
    "author": "honestly_idgaf",
    "url": "https://www.reddit.com/r/PESU/comments/1ctjttg/ec_campus_cse_vs_rr_campus_ece/",
    "permalink": "https://reddit.com/r/PESU/comments/1ctjttg/ec_campus_cse_vs_rr_campus_ece/",
    "score": 7,
    "upvote_ratio": 1,
    "created_utc": 1715883847,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "l4cgjdy",
      "body": "Why are you comparing between branches? Pick the branch that you're interested in, as simple as that.\n└── It has to do with the fact that I'm planning on taking a double degree in either ece or ds either way. I wanted to know if ece will require a more hands on approach hence I'm considering it as my main branch. In terms of pure interest, I prefer cse to anything else.\n    └── Then I'd suggest picking CS as your primary major and ECE as a dual degree, given that your interest is primarily in CS.\n        └── Alright.. thank you"
    },
    {
      "id": "l4ci9jx",
      "body": "Look up what is done in both the courses. Most btech colleges in India do similar stuff. \n\nPick the one that interests you\n\nIf you are unsure, cse is the way to go. When you're blindly walking into something you might as well blindly walk into the one with better opportunities and better placement stats"
    },
    {
      "id": "l4d7qmj",
      "body": "Go for cse in ecc, cse offers better placements than ece.\n\n\nIt is easier to score in cs which allows you to maintain a good GPA which is important for placements and for higher education.\n└── But RR campus ECE is horrible and worst"
    },
    {
      "id": "l4ek04m",
      "body": "EC Campus CSE"
    },
    {
      "id": "l4f8j2h",
      "body": "why not RR campus CSE?\n└── Not a good enough rank for that I'm afraid\n    └── okay"
    }
  ]
}