{
  "id": "1cu6ypx",
  "title": "PES's absolutely and utterly useless 'mentorship' system.",
  "content": "This is the SECOND time these guys have said \"there were no red flags seen in the mentorship\". What mentorship? There literally IS no mentorship. Half the 60+ member class gets assigned to one namesake 'mentor', who only ever interacts with anyone on the last day of the semester when you need to go sign some ISA marks confirmation sheet. A vast majority of students only find out who their 'mentor' is literally on that last day.\n\nOf course there weren't any red flags. There aren't \"one on one sessions\". The 'mentors' are literally just professors, who have no further qualification as such for 'mentorship'. Ask a 'faculty mentor' to list 2 of the names of the students they're supposed to be mentoring. Not 20, not 10, ask for TWO; they won't know.\n\nIt's a useless system. What motivation does a student have to ever approach a 'mentor' for anything? They're not a counsellor. They're not a parent. They have no further interest in you than any other professor. ",
  "metadata": {
    "root_comment_id": "l4gp1w9",
    "post_id": "1cu6ypx",
    "author": "throwawayrandomlol",
    "url": "https://i.redd.it/whkj8mj1101d1.png",
    "permalink": "https://reddit.com/r/PESU/comments/1cu6ypx/pess_absolutely_and_utterly_useless_mentorship/",
    "score": 55,
    "upvote_ratio": 0.9599999785423279,
    "created_utc": 1715956961,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "l4gp1w9",
      "body": "Completely agree. This faculty advisor system isn't new, it's pretty old and has been pointless for years. The faculty have never really bothered with the mentorship program since they themselves aren't qualified to be counselors and most of them treat it as extra work. \n\nAnd looks like now you atleast need to meet your advisor once a semester. Throughout my 4 years at PES, we never met our advisor. I didn't even know who my advisor after first year was until after I graduated and received a call from one of the profs asking me to \"rate and review the college positively for future batches\". \n\nThe entire system is broken.\n├── The golden time of PESU is long gone now. 😔😔\n│   └── Golden era of PESU ended around 2018-2019\n│       ├── yeah\n│       ├── All colleges Era Ended In Your Time Except IITs ,NITs ,BITS maybe now Quality of engineering has Dipped In General.\n│       └── Which year did you graduate btw\n├── I remember the OTHER half of my class's faculty mentor's name, and not my own. I don't even remember her face. I may have interacted with her maybe 2 or 3 times ever. But hey, at least mine didn't bother giving me a call and asking me to rate the university well in the future so there's that.\n├── My advisor would Whatsapp us saying \"pls message these students to sign FAM book\" once a semester and he was one of the better ones.\n├── I don't even know who is my mentor\n└── You got to meet the faculty advisor 3-4 times a sem, they ask you if you are facing any problems, if you do share actions are taken actually and make you sign. \nIf you guys are facing any troubles please do not hesitate and do share with them.\n    └── I assume you're some sort of spokesperson or representative of the college. I ask you to pick a random faculty member and ask them to name 5 of the students they're supposed to be 'mentoring', and identify their faces. \n\nI guarantee you the results will not be pretty."
    },
    {
      "id": "l4gswmp",
      "body": "No wonder why good professors have left this college.. They should appoint proper mentors who can actually assist rather than increasing professor's workload"
    },
    {
      "id": "l4k86o7",
      "body": "The teachers here are so shit. So third class and unprofessional. My friend's terminal was not working and during every esa he had to change his terminal. He complained this to the coe and ukw they say, \"bring a letter and we will try solving something if possible\". They also snatch steel water bottles. They gave the answer script 10 minutes late to my friend because he forgot his admit card. He asked them to allow him to get it within a min, but they refused. Then they told him to go to the coe, where now he was to pay 50 rs fine for something so stupid. The invigilators are so rude here, they keep doubting us even when we don't have anything to copy, but the other people copying continue their work. The invigilators in S&H are worse, they are so third class. They speak and gossip loudly during esa, and we were unable to focus properly. They make those cheap noises while drinking tea which is worse. Their leader is this Dhanashree Bhate, cheap third class woman."
    },
    {
      "id": "l4ksu9m",
      "body": "mentorship my ass, nobody writes anything in that mentor book they give \nthat’s just for formality \nnobody gives a shit about it"
    },
    {
      "id": "l4ld9bb",
      "body": "Faculty mentors are assigned 10+ students and some of them do monitor the students’ academic progress on a monthly basis and the report is submitted to the head of the department.\n└── I assume you're some sort of spokesperson or representative of the college. I ask you to pick a random faculty member and ask them to name 5 of the students they're supposed to be 'mentoring', and identify their faces. \n\nI guarantee you the results will not be pretty.\n    └── I am not any representative or spokesperson of the college. I am an IIT alum. You and many others are making a bigger deal than necessary about this “mentoring” because you all are entitled.\n        └── you seem to 'know' an awful lot about that 'mentorship' program for someone not particularly associated with the University..\n\nAnd every student here knows what the mentorship program is useless and no one really cares. The 'big deal' comes in when the University use it as an excuse to absolve themselves of any blame by saying \"hey we saw no red flags in the mentorship process\". Which you'd know if you'd bothered to see the original post and the attached image.\n            └── What the university says is separate from whether this kind of mentorship has any value. Faculty are not trained psychologists; if they were then there would be some value. Decision to attend PES or any other engineering college should be based on the quality of education, prospects after graduation in terms of placements, admissions to reputed MS and PhD programs in the US, India and other locations etc. \n\nThis kind of faculty mentorship is not going to solve mental health problems that a student may battle."
    },
    {
      "id": "l4n1yl0",
      "body": "I swear, my mentor is not even available half of the time. Even when she is, she just asks us to sign on a sheet. She does asks if I have any problems and when I tell them, she says she'll look into it but never comes back to with any information. These professors do none of the tasks assigned to them properly!!"
    },
    {
      "id": "l56dira",
      "body": "This mentor/ Counsellor is there in RVCE and BMS also I have my friends complaining of that System even in RV and BMS"
    }
  ]
}