{
  "id": "1curn9c",
  "title": "PES ECE or VIT Vellore for ECE",
  "content": "i got VIT cat 1 ece and also pes ece through pessat , i wanted to do ece not cse anyway so what i wanted to know was which college is better for ECE (based on placement and curriculum etc) fees is not a problem , please answer me ty",
  "metadata": {
    "root_comment_id": "l4kjhjy",
    "post_id": "1curn9c",
    "author": "Konquorer",
    "url": "https://www.reddit.com/r/PESU/comments/1curn9c/pes_ece_or_vit_vellore_for_ece/",
    "permalink": "https://reddit.com/r/PESU/comments/1curn9c/pes_ece_or_vit_vellore_for_ece/",
    "score": 3,
    "upvote_ratio": 1,
    "created_utc": 1716016452,
    "flair": "PESSAT/Admission",
    "nsfw": false
  },
  "comments": [
    {
      "id": "l4kjhjy",
      "body": "Best to ask someone on PESU Discord about ECE. But from whatever I know, it is probably at best, decent, at PESU. CS/CS-AIML branches are focused on more here."
    },
    {
      "id": "l4ky2s8",
      "body": "I'm about to graduate from PES this year and I must say ECE has been one hell of a ride. From what I know, the core placements have been abysmal this year. The VLSI subfield is comparatively better at EC campus than RR campus and that's the only strength that I could think about. I think VIT has some good facilities in the interdisciplinary field of Nanotech that also happens to include elements of ECE. If one's really interested in going down that path, VIT is preferable.\n└── yeah I agree with you\n    └── maybe you should just get off reddit?"
    },
    {
      "id": "l4l45lb",
      "body": "Don't go to vit. On an average they take 5k-7k students per year. It becomes too difficult to stand out while u are attending for placements. If ur only other option is pes choose pes."
    },
    {
      "id": "l4lblod",
      "body": "Do not join PES for ECE Please. It is worst here.   \nIf you are joining PESU, do join CSE / CSE-AIML."
    },
    {
      "id": "l4lfj29",
      "body": "Pes ece or dsce ece?\nI am sure that i will study well in college\n└── pes over dsce for any branch"
    },
    {
      "id": "l4lpy8j",
      "body": "vit vellore dude easy. I've heard negative reviews from my friend in ece at pes rr about the abysmal workload etc etc but the friends in cse don't complain as much since their placements are better ig idk. vellore is a more famous college in terms of reputation and international relations which might serve well for an ece student? idk I'm just guessing about that and you'll be saving A LOT in terms of fees. in the end vit vellore cat 1 will cost you less than even IITs. not worth spending so much for pes imo."
    }
  ]
}