{
  "id": "1cutc2i",
  "title": "Seniors, is PES worth it in my case?",
  "content": "I would say I am a fairly average student (Not someone who would study nothing and pull off something to ace an exam in the last minute)\n\nI am/might be getting a few other colleges, like VIT-C, Amrita Bangalore (maaaybe Coimbatore), Shiv Nadar University.\n\nI want to study ECE, will I be able to maintain a good CGPA while also enjoying college life (messing around, recreational activities and such), or will it be too hectic and should I try for any of the other colleges?",
  "metadata": {
    "root_comment_id": "l4ksy77",
    "post_id": "1cutc2i",
    "author": "boywhocriedbass",
    "url": "https://www.reddit.com/r/PESU/comments/1cutc2i/seniors_is_pes_worth_it_in_my_case/",
    "permalink": "https://reddit.com/r/PESU/comments/1cutc2i/seniors_is_pes_worth_it_in_my_case/",
    "score": 10,
    "upvote_ratio": 0.8600000143051147,
    "created_utc": 1716023868,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "l4ksy77",
      "body": "Also, I will be joining through PESSAT not KCET  \nMy rank is 42XX\n└── Then even worse. Do not join ECE at PESU\n    └── Why do you say and what do you suggest?\n        └── ECE in PESU is not good bro\n            └── Just \"not good\" seems a bit bland after hearing a bunch of positive reviews from my dad's colleagues.\n\nWhat factors do you consider when you say this?\n                └── A) The Professors are average at best. Most good professor left during peak covid time. The ECE dept in general in RR campus is disoriented \n\nB) Placements of ECE are not good . While this is true in Most engineering colleges , pes is no exception to that . This season only 30% got placed in ECE dept with highest as 24.62 and median 8.5 ( Only 20 out of 551 ECE students got T1 placements ). Yes this time market was bad and placements was bad in general but usually it is not better by any significant margin for ece.\n\nC) The Labs and Facilities are average / bad / terrible if you wanna do ECE properly. They just have enough equipments and facilities to conduct small experiments for your coursework . Even to use what is left of those in the labs, you have to go through a tedious process to gain access to use the labs which is just a wats of time ( They just gaslight and catfish you into projects which can be made by even beginners who grasp a decent amount of Hardware , microcontroller and sensors knowledge and they just  showcase that )\n\nD) If you are coming through PESSAT then the fees you pay for ECE is not justified or worth it.\n                    └── Thank you for all the stats. If not PES, then what would you suggest I pick out of the ones I mentioned? Keep in mind that I am only interested in electronics.\n\nAlso, how is the EEE scene here in PES?\n                        └── Based on your options I would say pes but don't keep you expectations high in ECE in pes. Just work hard , learn and maintain a good cgpa and you can work your way around.\n\nEEE I don't know much about it. I had a friend who shifted from EEE to ECE and he always gave good reviews on the professor and syllabus of EEE . That's all I can say\n                            └── Alright thanks man, this was genuinely very relieving to read. I guess I just need to not worry too much and just think about doing well in whatever college I go to.\n                                └── Yep , People have made it from all corners of the world. Yes PES is bad for ECE but that shouldn't stop you from achieving want you want\n\nKeep in touch with latest technology used in the industry,  Work hard from first year itself as well maintain some form entertainment to refresh yourself  , maintaina good cgpa, Try to build good connections with people and in due time your work will pay off\n                                    └── Thanks for the advice! I appreciate you taking the time to help out."
    },
    {
      "id": "l4kx23t",
      "body": "You want to study ece or is it what you're getting?\n\nEven for ece at pes you might only get ec campus. \n\nBut vit and Amrita aren't very great either. The best option (of the three) is probably pes\n\nI'm not sure about shiv Nader so won't comment on that\n└── I **want** to study in ECE, if i don't get ECE, EEE is also fine, because I am planning to study power electronics for M.Tech.\n\nIs it worth choosing EEE here, even if I get ECE in the colleges I mentioned?\n    └── I honestly can't say. I think it's better than vitc and Amrita, But a quick search on shiv Nader shows its pretty good. \n\nAnother thing is that you can change branches to ece very easily at pes. In my year you needed like 7 or something. Anybody under the sun can get that much if they care.\n        └── Okay thank you, should I prefer PES over Amrita Coimbatore?\n\nAnd why do you say I shouldn't choose VIT? Is it because of the discrimination there or any other reason? \n\nAlso, can I DM?\n            ├── Sure dude dm away.\n            └── Amrita coimbatore is your best option. I’m not getting the branch I want there which is why I didn’t take Amrita already. I have a friend in VITC and he says to absolutely avoid anything other than vellore campus. Shiv Nader is a money grab and mostly research oriented rather than technical college.\n                └── Thank you for replying. Why do you say Amrita coimbatore is better? It is in the outskirts of the city, so I think PES has more opportunities for internships and stuff right?\nAlso why does your friend against VITC? I mostly only hear complaints about discrimination against north people (I am from south).\n                    └── There are pros and cons to all three colleges. \n\nAmrita is worse than Tihar Jail in terms of strictness if you're going to stay in hostel, the college life is 0. PES college life isn't the best but better than amrita in every way.  \n  \nBut their ROI is FAR better than PES, I know my school seniors grads from PES who haven't landed any decent jobs after grad. If you're getting PES through KCET then it is the best choice, but if you're getting thru pessat it is not worth it. 5lakhs fees PA is too much for a college like PES btw\n\nAmrita on the other hand brings good opportunities for placements, and even in current market scenario amrita is holding up fine. (acc to my seniors)\n\n  \nPES management and faculty has become shit, but both campuses are equal in PES, unlike VITC. \n\nIf you get vellore campus, your chances of getting good placements are far better than chennai campus. Chennai campus is like the neglected child.\n                        └── Okay then, I will have to talk to some people in Amrita. Do they have an active subreddit like this?\n\nAnd for VITC, aren't the placements centralized?\n                            └── The placements r centralized, but from what I've heard it's always best to choose the main campus, Vellore students are given more priority, and even if the placements r centralized, you're basically up against people from all three campuses consider their high student intake. \n\nVITC isn't the worst college or anything, and honestly if you think you have the caliber to hold up against so many people then go for it. In my opinion for ECE, \n\nAmrita>VITC>>>PES\n\nyou can ask someone on r/Amrita_Forum\n                                └── Ah okay. I will probably talk to someone in my neighborhood since the sub seems kinda dead.\n\nTysm for all the info!!"
    },
    {
      "id": "l4l38sy",
      "body": "ECE professors are retards. my closest friend is in ece, through management. but she studies her ass off day and night. ECE students cannot participate in cultural events as freely as u think. \n\nSome professors have 0 tolerance against missing one class also. So I'm in the dance club and there are a few ece students. They can never make it to practice and are always so so so afraid of their teachers. Extremists. I would not recommend PES for ECE or CS if ur not an EXCELLENT student. Teachers are rude and unprofessional and do not know how to talk. Of course not all but all the higher authorities responsible for decision-making are like this. Which makes it hard to do anything. There are bouncers who are a constant pain in the ass, lurking in the corridors and keeping an eye on us like we're criminals. \n\n\n\nThe pressure the college puts is very real it's not just a theory...\n\nif you are sure u can handle it then it's ur call in the end. But I just had to say all this so that you know the other side of this college\n\n\n\nBefore I joined I asked the same questions to seniors and most of them were positive so I chose to overlook the negative sides. I'm an average student too, GPA of 7.6, and love to live life a lil. However, these exams require a **constant and consistent** effort.\n├── Thank you for your detailed take.\n\nAre all the professors like this or are there some that you can connect with and get help/advice?\n\nAnd finally do you have any recommendations for me? Amrita results aren't out yet, what do you suggest I do if I get only in bangalore?\n│   ├── All professors in ece in ec campus are like this, not one exception\n│   │   ├── Wow okay\n│   │   └── Lokesh, Rajesh and Bajrangbali are pretty chill though\n│   │       └── Rajesh is fine, lokesh doesn't really teach higher sems i think, vinay and renuka are also fine but ye getting these teachers is low probability\n│   ├── Cse has some really good professors. And when i say \"really good\" I'm referring to their basic human decency. When you pay attention in class you'll prolly understand every teacher, teaching wise it's fine. But it's about whether you're willing to sacrifice your self respect for decent teaching\n\n\n\n\nWell Amrita University in Bangalore right? That college has pretty strict rules too ig from what I've seen, they have a uniform and all. But idk the insides. \n│   │   └── I did my 11th and 12th in Chaitanya, so I don't think I would need to prepare myself to forget my self respect or anything because what you describe has exactly been my last 2 years 💀\n\n  \nBut yes, I have heard from almost everyone that Amrita is super strict, especially with hostel rules.\n│   │       └── Then ig pes is okay..\nIf you came out of chaitanya with that environment not affecting your mental health much then yeah. If you have thick skin you can survive anywhere\n│   │           └── Cool, thanks for clearing that up.\n│   └── Plus the current ece dept heads are bunch of snowflakes IMO, criticize them a bit for their poor quality of work they just lose their thinking capability and try to be as petty as possible to push the blame on you. like legit i can name only like 2-3 actual good professors in the whole ece dept who can teach well, understanding towards students and are lenient to an extent. you say something you don't like about what they do, they just deem it as being disrespectful towards elders.\n│       └── Are the department heads and professors campus specific or are they the same quality in both campuses?\n│           └── sorry for late reply, campus specific\n└── Bro you're scaring me 💀 I am first year ece in ec campus, how much is the cutoff to shift to AM atleast?"
    },
    {
      "id": "l4l399p",
      "body": "ECE professors are retards. my closest friend is in ece, through management. but she studies her ass off day and night. ECE students cannot participate in cultural events as freely as u think. \n\nSome professors have 0 tolerance against missing one class also. So I'm in the dance club and there are a few ece students. They can never make it to practice and are always so so so afraid of their teachers. Extremists. I would not recommend PES for ECE or CS if ur not an EXCELLENT student. Teachers are rude and unprofessional and do not know how to talk. Of course not all but all the higher authorities responsible for decision-making are like this. Which makes it hard to do anything. There are bouncers who are a constant pain in the ass, lurking in the corridors and keeping an eye on us like we're criminals. \n\n\n\nThe pressure the college puts is very real it's not just a theory...\n\nif you are sure u can handle it then it's ur call in the end. But I just had to say all this so that you know the other side of this college\n\n\n\nBefore I joined I asked the same questions to seniors and most of them were positive so I chose to overlook the negative sides. I'm an average student too, GPA of 7.6, and love to live life a lil. However, these exams require a **constant and consistent** effort."
    },
    {
      "id": "l4l3b7m",
      "body": "ECE professors are retards. my closest friend is in ece, through management. but she studies her ass off day and night. ECE students cannot participate in cultural events as freely as u think. \n\nSome professors have 0 tolerance against missing one class also. So I'm in the dance club and there are a few ece students. They can never make it to practice and are always so so so afraid of their teachers. Extremists. I would not recommend PES for ECE or CS if ur not an EXCELLENT student. Teachers are rude and unprofessional and do not know how to talk. Of course not all but all the higher authorities responsible for decision-making are like this. Which makes it hard to do anything. There are bouncers who are a constant pain in the ass, lurking in the corridors and keeping an eye on us like we're criminals. \n\n\n\nThe pressure the college puts is very real it's not just a theory...\n\nif you are sure u can handle it then it's ur call in the end. But I just had to say all this so that you know the other side of this college\n\n\n\nBefore I joined I asked the same questions to seniors and most of them were positive so I chose to overlook the negative sides. I'm an average student too, GPA of 7.6, and love to live life a lil. However, these exams require a **constant and consistent** effort."
    },
    {
      "id": "l4l51zs",
      "body": "You can enjoy and still manage to maintain gpa. I am an average student here (3rd year), I mostly don't listen to class\nI study on my own, most of my friends study on there own. I start to study a weeks before any exam. I did manage to maintain gpa of 8.5 till now, even tho I did pretty bad in some sem.\n└── Thank you for the input, what branch are you studying?\n    └── CSE"
    },
    {
      "id": "l4lzpxv",
      "body": "Please don’t take up ECE if you are an average student. Given that you’re interested, I’m assuming you’ve done your research on what you’ll be studying. If that’s the case then go ahead. \n\nI’ve been a topper since school, and trust me taking ece is one of the worst decisions. I still have a cgpa close to 9 now but I worked way too hard and borderline even cried before exams. Way too hectic and teachers aren’t that great. \n\nThis might be because I’m not interested in ece, so take it with a pinch of salt.\n└── I do know what I will be studying. The branch isn't the problem, however I am a bit worried about the professors and how I am going to manage studies and social life.\n    └── You can deffo manage social life, not that hard. It’s not like you need to study everyday. Professors are hit or miss. Some teachers are lenient and chill, others are not necessarily strict but they just get on your nerves now and then.\n        └── Which campus are you in? Also can I dm?\n            └── Rr campus, sure"
    },
    {
      "id": "l4m1q3a",
      "body": "If you take ece in ec campus, it becomes very hard to do well in 3rd and 4th sem and the teachers are also very very unprofessional, you won't get to enjoy \"college life\" in ec campus, however ece in rr campus is slightly less horrendous\n└── I see, that is unfortunate because I am getting ECE only in that campus. Unless I go for EEE in rr campus\n    └── It's first round only man, what is ur rank? You can take ece in ec campus wait till second round, if you have a rank lower than 3.2 or 3 k you'll get ece in rr campus, if not you can take ece in ec campus, study hard and get a Good cgpa then at the end of second year shift to rr campus\n        └── Yeah that would also work. I wont get rr ece even in 2nd round, my rank is 4.2k"
    },
    {
      "id": "l4p4mxx",
      "body": "DONT COME TO PES\n\nI am a senior at ec campus, and lord is college life at its absolute worst. Plus they don't have any amenities here for extra curricular,its like school maybe worse . \nIf you do consider please pick rr campus,everything is better there except the crowd I guess from what I have heard.\nDon't really know about Amrita and all but can guarantee you will not be happy here at pes ec campus.\n├── Heard this a lot. But my parents are giving preference to branch rather than campus, so I'll just wait and see how counselling goes.\n│   ├── Getting ece in rr is easy ,moreover if you get a good cgpa in your first year, above 8.2 or smtg you can change branch and campus according to the number of empty seats. After first year there's gonna be another counselling where you can change.\n│   └── Give as much importance to the campus, it affects the placements too. Take up RR campus if u have to, if u have an option better than PES please take it up\n└── I mean his other options ain't that good man, amrita bangalore is pretty ass I've heard, and as for vit he isn't even getting vellore, ig pes might be his best bet\n    └── Don't know about other colleges ,but pes is shit all I can say"
    },
    {
      "id": "l4uww3f",
      "body": "Electronics branch is hard, the faculty is incompetent/strict is what i’ve heard. Regardless, if you can push through and maintain 8.5gpa then it shouldn’t be a problem, you will have opportunities in terms of placements and higher studies. Also pessat or kcet? What is the pessat fees now?\n└── Alright thanks. If I join, it'll be through pessat 4.2L 💀"
    }
  ]
}