{
  "id": "1cuz8ro",
  "title": "GENUINE DOUBT",
  "content": "https://preview.redd.it/yawj5el7971d1.png?width=1412&format=png&auto=webp&s=e9126199a253797133cdaf7d241235cc73ae6772\n\nguys so i saw this in some youtube video and im really confused  \nwhat does the last rank mean here  \nis it like the cutoff for last year  \nor is it the last rank that selected the branch shown",
  "metadata": {
    "root_comment_id": "l4lxl3o",
    "post_id": "1cuz8ro",
    "author": "ALPha--29k",
    "url": "https://www.reddit.com/r/PESU/comments/1cuz8ro/genuine_doubt/",
    "permalink": "https://reddit.com/r/PESU/comments/1cuz8ro/genuine_doubt/",
    "score": 6,
    "upvote_ratio": 0.8799999952316284,
    "created_utc": 1716044537,
    "flair": "PESSAT/Admission",
    "nsfw": false
  },
  "comments": [
    {
      "id": "l4lxl3o",
      "body": "Cutoff\n├── bro 1k is the cutoff for every branch?????????????????\n└── and how is aimls cutoff for ec higher than aiml in rr\n    └── Sorry your image didn't load for me first \n\nHere yeah it's the last rank who has taken a seat"
    },
    {
      "id": "l4lz3xt",
      "body": "Last rank the seat was given to"
    },
    {
      "id": "l4m0jm7",
      "body": "wait this doesn't make sense?? so that another pic with cut off for cse ec around 3k what was that then....did no one after 1k rank take up cse....help im so confused"
    },
    {
      "id": "l4m1k0e",
      "body": "The cutoff picture in the previous post indicated the *overall* last rank that took the particular branch.\n\nThis picture here seems to be from the second round of counselling (given from the date being 17-06 in the picture).  When you go through counselling, as the seats get occupied, the counter also shows the rank of the last person who opted for said seat. That is why the last ranks listed here are much lower compared to the *actual* last rank since it just indicates the rank of the person who showed up in the second round and just took the seat. And yes, some people show up with low ranks in the second round too.\n\nHope this clears things for everyone.\n└── there were 418/432 vacant seats in ec campus cs for second round? doesn't make sense dude. almost everyone should've left then. \n\nnot only that, eee and me, and bt have literally the same vacancies as the capacity. must mean that everyone left\n    └── There seems to be an issue, yeah, but going by what *usually* happens: it usually displays the *current* number of students that have taken a seat.\n        └── i think this is first round counselling. \n\nthey usually divide the people into batches of 1200. and this is the second batch, but of first round counselling. \n\nthat's why almost everyone took cse rr, few took the rest, and some branches are untouched. only the first 1200 ranks went through the allotment\n\nthis is probably the pov of a guy in the second batch. 1200-2400 batch\n\nif this were second round there would be vacancies in the sub 100 range, not 99% vacant"
    },
    {
      "id": "l4mcd72",
      "body": "Hi! This seems to be the MIDDLE of round 1 of the counselling 2023. From the bottom right of the screen you can see that rank 1200 was the last rank to make a choice so far. She took EC campus CSE. This is why the numbers don't seem to make sense idk who took this inbetween the round screenshot"
    }
  ]
}