{
  "id": "1cv0afq",
  "title": "Pessat counseling doubts",
  "content": "According to the previous years cutoff, am getting CSE AIML in RR campus and CSE at Ecity campus. Which one should I go for?\nAlso am getting CSE at Vit vellore. Should I be choosing that over pes? \n\nAlso can someone guide about the DDs? Are they refundable if I withdraw my seat?",
  "metadata": {
    "root_comment_id": "l4m7mpl",
    "post_id": "1cv0afq",
    "author": "couchpotatoheree",
    "url": "https://www.reddit.com/r/PESU/comments/1cv0afq/pessat_counseling_doubts/",
    "permalink": "https://reddit.com/r/PESU/comments/1cv0afq/pessat_counseling_doubts/",
    "score": 5,
    "upvote_ratio": 0.8600000143051147,
    "created_utc": 1716047447,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "l4m7mpl",
      "body": "Vit definitely pes is in the news for all not the good reasons\n├── VIT hostel rooms literally have iron grills covering ceiling fans to prevent students from attempting suicide. Also if I'm not wrong they take 8k students a year, which makes the competition much worse.\n\nNot defending PES btw, I despise this college with every fibre of my being but I do not believe VIT is much better.\n│   └── Why do you despise pes sm 💀\n│       ├── I feel like you should take VIT, especially if you have a lower category.\n│       └── lol i may have exaggerated a little, this subreddit often leans towards pessimism.\n\nBut yeah I do dislike the management, the faculty is pretty average and the (PESSAT) fee is imo exorbitantly high considering everything. But if you want to go here then great, I'm not saying anything.\n└── Vit is in news for all the great reasons uh 😂\n    └── Vit nirf ranking be 🤡. Viteee exam in itself is a fucking joke"
    },
    {
      "id": "l4m9huj",
      "body": "Who do you wanna compete in placements \n8k cs students vs around 3k \nYour choice ultimately \nAnd also aiml there's no placement stats as it was introduced in 2022"
    },
    {
      "id": "l4me1pf",
      "body": "Cse in ec campus is my pick. If you care about location for some reason, I'd say it's not a bad decision to take aiml at rr\n\nOnly reason to take vit is if you're getting a really good category or something. Otherwise id pick pes\n└── How are the ec campus placements and faculty?\n    └── placements is the same \n\nfaculty are equally not very great in both campusses"
    },
    {
      "id": "l4mwnsv",
      "body": "What's your rank in PESSAT ?? I GOT 56XX and do you think I get CS in Ec campus\n├── I got a rank of 16XX.\nI can't comment man, I think it's tough getting cs with that rank in ec campus seeing the previous year cutoff\n└── check [this post](https://www.reddit.com/r/PESU/comments/1ct5ujc/which_branch_can_i_get_at_no_dont_make_such_posts/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button) to see what branch you might get"
    },
    {
      "id": "l4psfaj",
      "body": "Bro can I get anything at 7144 rank?\n└── I don't know, am not sure. Attend the 1st round counselling, if not ig in second round you can if there are seats left although the chances of that happening are really slim. Am saying this based on last year's cutoff which u can refer here (https://imgur.com/a/5pHf9Td)\nI think the seniors would be able to answer better tho. \nAll the best mate!\n    └── Any chances for ece or eee?\n        └── I honestly have no idea, how did ur kcet go? Any hopes?\n            └── Didn't gave kcet, gave onle pessat....\n                └── Oh, attend the counseling regardless. All the best bud!\n                    └── Bro I am from Delhi cannot go to Bangalore at such a short notice and that too after getting a rank of 7k, anyway I have already opted of round 2, let's see....\n                        └── Oh makes sense, maybe round 2 yeah possible. Dw you'll do good. ^^\n                            └── Thanks brother...."
    },
    {
      "id": "l54vvui",
      "body": "Check dm"
    }
  ]
}