{
  "id": "1cvhjks",
  "title": "Please Help !",
  "content": "I am waiting till BITSAT 2nd session nearly on 25 June, so can I take admission in PESU even after that ?  \nMy rank: 15xx (I may get CS in AI/ML)",
  "metadata": {
    "root_comment_id": "l4pd3xg",
    "post_id": "1cvhjks",
    "author": "Interstellar777077",
    "url": "https://www.reddit.com/r/PESU/comments/1cvhjks/please_help/",
    "permalink": "https://reddit.com/r/PESU/comments/1cvhjks/please_help/",
    "score": 3,
    "upvote_ratio": 0.8100000023841858,
    "created_utc": 1716098892,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "l4pd3xg",
      "body": "You can leave pes before second round counseling. Which will be like 1-2 months after first round. \n\nBut why not just directly attend the second round?\n└── I heard the rumours that the seats are sold with management quota in the 2nd round, not sure if it's true .....  \nBTW thnx for ur input !\n    └── Yeah apparently that happened last year. So yeah. \n\nBut if you join in first round then you have to attend classes from the first day onwards. This might even be before bits seat allotment starts. \n\nBut you can ditch pes when you get a seat. They keep like 2k per day after the last day. Find out the last day\n        └── Maybe, I have to take risk and leave PES in the 1st round .......\n            └── Too risky IMO. Last time there were <5 seats in some branches\n                └── Really, so less ?  \nIf I take admission through round 1, then after a month probably last week of June, how much refund I will get and how much will I have to pay ?  \nAlso after round 1 when does the classes start ?\n                    └── yeah these useless mfs converted so much into management quota\n\nlike bro i knew 15 people myself who surrendered pessat cse seat including me last year, and total seats left in cse in second round was 25 or something, makes no sense\n\ntry joining RVCE via comedk\n                        └── Thnx for confirmation.\n\nI can get RVCE Mech. or BMS ECE, but I prefer branch over college (tho I am not sure whether it's a good idea or not)\n                            ├── It is tbh\n                            └── You can always go for branch change in Comedk colleges.\n                                └── Not so easy I believe ......."
    }
  ]
}