{
  "id": "1cvi6ku",
  "title": "Girls hostel for RR campus",
  "content": "I'll be joining PES RR campus, so just wanted to know about the facilities, restrictions, food etc. Of girls hostel",
  "metadata": {
    "root_comment_id": "l4q1wa0",
    "post_id": "1cvi6ku",
    "author": "Lumpy-Breath4671",
    "url": "https://www.reddit.com/r/PESU/comments/1cvi6ku/girls_hostel_for_rr_campus/",
    "permalink": "https://reddit.com/r/PESU/comments/1cvi6ku/girls_hostel_for_rr_campus/",
    "score": 3,
    "upvote_ratio": 0.7200000286102295,
    "created_utc": 1716101422,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "l4q1wa0",
      "body": "This is just stuff I heard from my friends so you'd have to confirm with someone.   \nThe curfew timings are 7:30 which is insane considering that the boys hostel is 10. It's not on campus so you'd have to take the college bus everyday. Haven't really heard anything good about the warden too so atb\n\nOh and the food is straight up ass afaik 💀\n└── ig its same for ec campus girls too? also 10 pm for boys wtf 💀💀💀\n    └── Not really sure about ec but the first years both men and women stay in Amaatra (it's like 5 km from the campus ). Starting second year, the boys move to the hostel on campus and I assume the girls stay in amaatra till they graduate. As for the curfew timings being 10 for boys, it was 7:30 for us too but idk halfway through first year they extended it to 9 and eventually 10"
    },
    {
      "id": "l4raz00",
      "body": "Here’s what I’ve heard from a friend there  - The warden gives you a really judgemental look if he sees you with guys and I was like wtf? 😭 also the area is good but it’s in some galli bruh so annoying, I’ve been goin to that area all these years but never expected pes to have a hostel in that corner smh. Boys have their hostel in campus but girls hostel isn’t. But yeah there’s bus pickup and shi to pick you up and drop from hostel\n└── What about the food?😭\n    └── You gotta wait for someone else to answer that, I’m not in touch w that friend anymore 💀💀\n        └── I see, thanks man\n            └── Yup, got a friend who stays close to the hostel but not in the hostel, will ask her once just in case she knows\n                └── Yeah lemme know if you find something\n                    └── Yup, lmk if you want me to ask anything else. Unfortunately or not but got friends in cse, law , bba, design and psychology too😭\n                        └── I needed to know if there's any scholarship for top rankers of pessat?\n                            └── Apparently there’s no scholarships based on your rank, as in you won’t have a cheaper fees just because you got top 100 or smth, but yes if you are a top ranker in your batch during your course in the uni, you do get fees reduction. Criteria and all you can look it up it’s there on their website. They’ve named it after people so I don’t remember lmao\n                                └── Alright thank you"
    },
    {
      "id": "l4tx57s",
      "body": "The food is not that great apparently \nAlso you can't order anything past 830\n└── So will have to join a mess or something?"
    }
  ]
}