{
  "id": "1cvlptw",
  "title": "Should I choose VIT Vellore cse (core) or PESU CSE?",
  "content": "Title",
  "metadata": {
    "root_comment_id": "l4pzrhk",
    "post_id": "1cvlptw",
    "author": "Opposite-Pianist-566",
    "url": "https://www.reddit.com/r/PESU/comments/1cvlptw/should_i_choose_vit_vellore_cse_core_or_pesu_cse/",
    "permalink": "https://reddit.com/r/PESU/comments/1cvlptw/should_i_choose_vit_vellore_cse_core_or_pesu_cse/",
    "score": 6,
    "upvote_ratio": 0.800000011920929,
    "created_utc": 1716116495,
    "flair": "PESSAT/Admission",
    "nsfw": false
  },
  "comments": [
    {
      "id": "l4pzrhk",
      "body": "cfbr"
    },
    {
      "id": "l4q1bsv",
      "body": "As much of a population college pes is, vit is ten times worse. For that alone pes\n└── Campus is 20x the size lmao\n    └── Campus size becomes irrelevant after your third year\n        └── No offense rowlett what do you do u online 24x7 lmao\n            └── Ikr i always wondered that😭"
    },
    {
      "id": "l4q2w4q",
      "body": "100% PES if you’re getting RR campus unless you’re getting a Cat-1 or maybe even a Cat-2 seat,the placements,the prospects,the academic rigidity and the location of Bangalore make it much better\n└── what about ec campus?\n    └── Both campuses share placements."
    },
    {
      "id": "l4q3a3j",
      "body": "I would recommend vit vellore cse cos of the shit profs and all the restrictions put by the staff just google the number of suicides in the last 6 months if you need any other reason not to join this fucking hell hole"
    },
    {
      "id": "l4q79qp",
      "body": "See both are pretty much the same\nPes kcet>>vit cat 1,2,3>> pes pessat>vit cat 4,5"
    },
    {
      "id": "l4qnwap",
      "body": "pesu i am also taking ece mostly in rr or ec campus side by side cse ka coding main khud sa karunga pes >>> vite cause culture is way better vitee is like factory imo too crowded\n└── I heard ece in pes is not that good"
    },
    {
      "id": "l4quywi",
      "body": "VIT vellore cse easy bro u high or smt?\n└── Bro placments , hackathons , gsoc  coding culture in pes >> vit cse its fax even ece is better than vellore these are the only 2 branches good in pes\n    └── 3 people got placed in ece rr this year lmao. And if you're comparing vit culture with pes then ure seriously delusional. Biggest fests Riviera gravitas etc. More people commit suicide in pes than got placed.\n        └── i got all this info from google i am still searching for college 🤷‍♂️"
    },
    {
      "id": "l4roo7j",
      "body": "  \nI know people might downvote me here, but I think you should go to VIT V CSE.\n└── But why? can uh give me a reaon in breif? fees uski 4.5L hogyi hai is saal se jitna maine suna hai\n    └── Bhai, PESU CS is a better option. I was wrong in the above comment. Deleted it."
    },
    {
      "id": "l4tvi4a",
      "body": "DONT CHOOSE ENGINEERING ONLY"
    },
    {
      "id": "l4u38tj",
      "body": "VIT anyday, away from home. With more diverse people. Slightly less strict environment. Placements are trash right now anyways. You'll gain a lot more skills and confidence in VIT. I personally wouldn't think twice."
    },
    {
      "id": "l4ucm25",
      "body": "PES CSE in all aspects will be above vit be it exposure due to location, or placements."
    },
    {
      "id": "lflzo4x",
      "body": "Dear experts kindly guide me which option is better IIIT Bhubaneswar CE / PES CSE / MS Ramaih ISE"
    }
  ]
}