{
  "id": "1cvvwxx",
  "title": "PES Counselling vs COMEDK for ECE: Which Should I Choose?",
  "content": "Hi all,\n\nI scored around 42xx in the PESSAT exam and also took the COMEDK this year. Based on my rank, I believe I have a chance of getting ECE at MSRIT or BMS through COMEDK. However, PES University is asking for a Demand Draft for the first round of counseling, and I'm unsure if I should proceed with that.\n\nI’ve seen the closing ranks from last year, so I understand my chances of getting CSE is dead. However, I’m hoping for ECE or Electrical, preferably at the RR campus if not the EC campus.\n\nI've heard that core placements for ECE are better at MSRIT and BMS compared to PES. Should I risk going for PES counseling or stick with COMEDK? What would you do in my situation?\n\nThanks!",
  "metadata": {
    "root_comment_id": "l4rwvnk",
    "post_id": "1cvvwxx",
    "author": "i_nithinsudhagar",
    "url": "https://www.reddit.com/r/PESU/comments/1cvvwxx/pes_counselling_vs_comedk_for_ece_which_should_i/",
    "permalink": "https://reddit.com/r/PESU/comments/1cvvwxx/pes_counselling_vs_comedk_for_ece_which_should_i/",
    "score": 2,
    "upvote_ratio": 0.75,
    "created_utc": 1716146185,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "l4rwvnk",
      "body": "Take ece at the comedk colleges. Pes is overpriced and for ece it's not very good\n└── I am pretty sure the fees for comedk is still around the same man so either way that person has to pay around 3-3.5 lakhs"
    },
    {
      "id": "l4t2ezx",
      "body": "Pes doesn't offer a good ECE program. Take ECE at RVCE/BMS/MSRIT after doing ample amount if research."
    },
    {
      "id": "l4untv1",
      "body": "Bro is there any chances of me getting ECE at 71xx rank till round 2?\n└── bro you’re cooked\n    └── ☠️"
    },
    {
      "id": "l51wo2h",
      "body": "Bro what's your comedk marks? How are you saying for sure that you'll get ece in msrit\n└── I've already said it. I didn't say I'm definitely getting ECE, I mentioned that I might have a chance. Do read it carefully and comment."
    }
  ]
}