{
  "id": "1cw7irw",
  "title": "Is mechanical engineering at PESU still in demand?",
  "content": "I got mech eng seat through JEE, i dont know if i shud pay the fee and reserve my seat. Is there still scope for mech eng these days? n what abt the placements in mech branch. \n\nPESSAT i got 8k rank n was just eligible for round1 counselling so will i get CSE or CSE(AIML) at RR campus?  \n",
  "metadata": {
    "root_comment_id": "l4u41o2",
    "post_id": "1cw7irw",
    "author": "BusinessSupport7114",
    "url": "https://www.reddit.com/r/PESU/comments/1cw7irw/is_mechanical_engineering_at_pesu_still_in_demand/",
    "permalink": "https://reddit.com/r/PESU/comments/1cw7irw/is_mechanical_engineering_at_pesu_still_in_demand/",
    "score": 5,
    "upvote_ratio": 0.6899999976158142,
    "created_utc": 1716180932,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "l4u41o2",
      "body": "No.\nTheir HOD is fucked .\nThat's it that's the explanation"
    },
    {
      "id": "l4u6rhf",
      "body": "Pessat idt that you'll get anything for 8k.\n\nAnd your mechanical seat don't take it. There are much better options for mechanical engineering at cheaper fee plans."
    },
    {
      "id": "l4u9jqo",
      "body": "Run the other way around, this battle is not worth at all, youll find your overall intellect reduced when you are graduating. Stupid profs, stupid HoD, stupid staff, mostly stupid students in this dept."
    },
    {
      "id": "l4ud3wg",
      "body": "Better join merchant Navy than becoming a mechanical engineer in India."
    },
    {
      "id": "l4ugae8",
      "body": "I'm from mech, it's not worth it in PES"
    },
    {
      "id": "l4uqexb",
      "body": "3rd year mech student at PES here.\n\nScope: It's hard to explain. There are jobs, but it can be hard to get. Most people often go do their Masters abroad. \n\nOtherwise, if you have a relative or connection at a PSU (public sector undertakings like HAL, BHEL, etc.), you can use it to get a stable job there. Others take over the family businesses. Alternatively, some go work at start-ups. Pay is low at first, but higher pay can be expected afterwards or abroad. \n\nPlacements at mech overall in India are bad to non-existent. Most of the stats will be IT jobs. Once in a while, core jobs come on campus. Otherwise, you will need to try off-campus, or family connections.  If you're a girl, you are luckier because you can use the diversity quota to get a job. Otherwise, it's hard. \n\nDepartment: HoD is fucked, but there are rumours he could be replaced coming semester. Lots of good and older faculty have left during/after covid-era due to various reasons. The remaining faculty is decent, but they also get bullied by the current HoD a lot. \n\nOnly take mech if you're interested in it. If you have other options, like Manipal, VIT, RVCE, etc. you could try there. PES is better than colleges like DSCE whose mech branch is filled with chapris. However, mech in Indian colleges is facing severe quality issues. You will find complaints and shortcomings (especially related to faculty, infrastructure and syllabus) everywhere. \n\nYou will not CS/AIML at PES for 8K rank.\n└── Thanks man, what about doing mech eng n doing any CSE course n applying for IT companies at campus placements? Do the IT companies give 1st preference to branch or if you have the skills they hire you?\n    └── If you want an IT job, do CS (or IS, AIML, other related branches. ECE is not CS for the record).\n\nCompanies will always give first preference to CS. Even if you do CS courses, its not the same as a degree or having proper projects. Not to mention, you will need to balance studying for mech subjects to maintain a decent GPA. Most ppl who come to mech dont have a high GPA. \n\nDon't join mech if your not interested in mech. On the other hand, if you think CS is all about programming, its not."
    },
    {
      "id": "l4ur697",
      "body": "Bro if you don’t mind my asking what’s your percentile ?"
    },
    {
      "id": "l4uu0ul",
      "body": "Can you tell your jee percentile if you don't mind"
    },
    {
      "id": "l5bnc47",
      "body": "NO"
    }
  ]
}