{
  "id": "1cw93bs",
  "title": "Looking for guidance on Biotech at PES. Is it worth it? I have 2xxx rank but this is what I want to study.",
  "content": "",
  "metadata": {
    "root_comment_id": "l4uobf0",
    "post_id": "1cw93bs",
    "author": "TopConnect2414",
    "url": "https://www.reddit.com/r/PESU/comments/1cw93bs/looking_for_guidance_on_biotech_at_pes_is_it/",
    "permalink": "https://reddit.com/r/PESU/comments/1cw93bs/looking_for_guidance_on_biotech_at_pes_is_it/",
    "score": 6,
    "upvote_ratio": 0.8700000047683716,
    "created_utc": 1716187292,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "l4uobf0",
      "body": "Bruh i too have 2k rank and I am taking cse as I don't have much options(dsce cs bmsit ) so u literally can get cse and placements are good ig\n└── Sadly I am only interested in BT\n    ├── Then I wouldn't suggest it as there are better options and in pesu from wt i heard in reddit apart from cse and ece all other branches are rlly bad \n    └── Hey! I am currently a Biotech student in this college. It is not as bad as people make it out to be. You can DM me if you want, I'd be more than happy to tell you more :)\n        └── Thanks I will dm"
    },
    {
      "id": "l4uqpph",
      "body": "You can dm me\n└── Thanks, I will"
    },
    {
      "id": "l4uujqx",
      "body": "Spend the next few days looking at what exactly happens in each of the courses. Make sure that your interest will last and that you won't change your mind. \n\nThe average 12th grader doesn't know what he's doing, make sure that you aren't the average 12th grader\n\nWhether you like it or not, cse and ece have better opportunities and statistics, so if you need money when you grow up i think you should pick something else. Simply due to the lack of opportunities for biotech\n\nIf future income isn't an issue, take whatever you want.\n└── Lack of opportunities? The rest of the world provides more opportunities. Most ECE people are a wannabe CS students. For the record, other branches also happen to make good money after some actual work and experience, while CS salaries stagnate in that same time period"
    }
  ]
}