{
  "id": "1cwgiev",
  "title": "Cse or AIML?",
  "content": "According to my rank, I am getting both cse and aiml in rr campus.. which one should I go for? ",
  "metadata": {
    "root_comment_id": "l4vla1x",
    "post_id": "1cwgiev",
    "author": "Lumpy-Breath4671",
    "url": "https://www.reddit.com/r/PESU/comments/1cwgiev/cse_or_aiml/",
    "permalink": "https://reddit.com/r/PESU/comments/1cwgiev/cse_or_aiml/",
    "score": 3,
    "upvote_ratio": 0.800000011920929,
    "created_utc": 1716214157,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "l4vla1x",
      "body": "CSE, ai ml u wont have an option to choose many electives, cse gives u broad scope.\n└── So in CSE, will I get the basic knowledge of AI?\n    └── Yes, u can take AI ML electives and gain the same knowledge as AI ML peeps. Ngl but all these specializations are scams. They just limited the number of electives u can take, they don't provide you any specialized knowledge for your domain. I'm into bioinfo and was checking out a clg offering cse with bioinfo, they just threw in some molecular biology, biochemistry and bioinformatics subjects from the biotech curriculum, it didnt really help u gain specialized knowledge. If u wanna specialize in AI and ML go for masters in it after bachelors.\n        └── Okay got it, so they are basically doing this to mainly attract more students as everyone's mad about AI nowadays\n            └── Yeah that's whats happening, actually, PES isn't the worst lol. Places like VIT and even smaller colleges have waaay too many cse options with no real added value.\n                └── True, Vit is just 🤡"
    },
    {
      "id": "l4vm2ot",
      "body": "AIML is just an excuse for the college to increase seats of CSE coz that's where the money is. Go with CSE and if you take electives related to AIML in higher sems there would hardly be any difference.\n└── Oh alright, thank youu"
    },
    {
      "id": "l4vnmbw",
      "body": "There is a detailed answer in the [FAQs](https://www.reddit.com/r/PESU/comments/14c1iym/faqs/). You can find the same answer here: [https://www.reddit.com/r/PESU/comments/147gamv/comment/jnve51g/](https://www.reddit.com/r/PESU/comments/147gamv/comment/jnve51g/)\n└── Thanks a ton✨"
    }
  ]
}