{
  "id": "1cx89ph",
  "title": "is there any student from ec branch?",
  "content": "So, i just got my pessat results and according to 2023-24 year cutoff it seems like im eligible for cse in ec branch but not in rr. I just wanted to know about ec campus as i go look for reviews its about rr campus everywhere. Help/guidance is appreciated\n\n  \nThank you.",
  "metadata": {
    "root_comment_id": "l50ugun",
    "post_id": "1cx89ph",
    "author": "perkyclown",
    "url": "https://www.reddit.com/r/PESU/comments/1cx89ph/is_there_any_student_from_ec_branch/",
    "permalink": "https://reddit.com/r/PESU/comments/1cx89ph/is_there_any_student_from_ec_branch/",
    "score": 6,
    "upvote_ratio": 0.800000011920929,
    "created_utc": 1716299089,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "l50ugun",
      "body": "EC campus students will not be able to give you a proper comparison because we haven't attended a class in RR either. You must look for students who have studied in EC and then migrated to RR after their first year. I know a few and I can connect you with them\n├── yes please.\n│   └── DM\n│       └── okay\n└── i dont want an exaxt comparison\n\ni wanted to know about the professors, clubs etc\n    └── Clubs are equally enthusiastic in both the campuses. There does exist a huge gap in funding for clubs in both the campuses. Here in EC, clubs make the best of how much we've got and it's very fun. Clubs in RR have a more corporate theme to them.   \nIf you want to work projects under professors, I have heard professors tell themself that it's easier to get approval in EC when compared to RR\n\nEC is much less crowded than RR. \n\nInfrastructure in RR is better as they have recently built the golden jubilee block - which is amazing\n\nI can't speak to the quality of peers but in EC, they are decent. You just have to pick the right friends group.\n        └── oh... thank you (:"
    },
    {
      "id": "l516nep",
      "body": "everything is identical. clubs are good and active, hackathons are also pretty regular. the classrooms and everything is the same. the teachers are equally bad in both. syllabus, exams, exam centres are also pretty similar. both campuses write the same papers at the same moment\n\nthe only advantage rr has is location and better infrastructure, which matters in your mind for all of 10 seconds\n\nsource: i spent a year in each campus\n├── thanks a lot  ( i really mean it )\n├── btw if i get a better oppurtunity after round 1 of councelling, what percent of amount are they going to return back?\n└── do you get the option to switch campuses once you join?\n    └── Yeah you can change branch/campus if you get a better seat in round 2. Also you can change branch/campus after year 1 based on your CGPA\n        └── what is the minimum cgpa for switching?\n            └── I think the cut off to switch to RR CSE was >9.5 , EC CSE was around 7.5 but seats were exhausted before this CGPA got a chance to select.  AIML in RR was around 8 or 8.5. This is information from last year, the current change of branch counselling hasn’t happened afaik\n                └── alright thanks for the help"
    },
    {
      "id": "l5lvw0c",
      "body": "I am an EC campus passout and had friends in RR as well. EC campus isn't a good option."
    }
  ]
}