{
  "id": "1cxq14v",
  "title": "Can someone explain how pes counselling works?",
  "content": "How does the two round counselling work, I have a rank of 13xx now that gets me cse ai ml but I have no idea if that’s in round 1 or round 2. I also have a seat in vit and well still have to pay some balance on that so was wondering if I can get cse ai ml in round 1 itself\n",
  "metadata": {
    "root_comment_id": "l54aw3x",
    "post_id": "1cxq14v",
    "author": "Unique_Hamster2734",
    "url": "https://www.reddit.com/r/PESU/comments/1cxq14v/can_someone_explain_how_pes_counselling_works/",
    "permalink": "https://reddit.com/r/PESU/comments/1cxq14v/can_someone_explain_how_pes_counselling_works/",
    "score": 2,
    "upvote_ratio": 1,
    "created_utc": 1716346238,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "l54aw3x",
      "body": "You mostly will"
    },
    {
      "id": "l54g9uo",
      "body": "Basically u gotta come to main rr campus , theyll take u to the main auditorium in mrd block, therell be a projection and ull showup on the big screen rank wise and u gotta go in front and choose your branch. Last year aiml cutoff was 1.8k so u mostly will get aiml\n└── Cool man but any clue if I get in round 1 or two cause I don’t wanna risk losing a seat in round one and not getting one at all in round two\n    ├── you should get aiml in round 1 itself\n    └── bro round 2 just exists for the sake of it , these guys book all seats in round 1 itself and yea u will 100% get aiml"
    },
    {
      "id": "l54ifi3",
      "body": "Regarding which branch you can get with your rank, check the previous year cutoffs. \n\nCounseling usually takes place as follows (long comment so it can be added to FAQs): \n\n1. Everyone shows up to counseling and registers themselves at the front desk, so PES knows which ranks have shown up on that day. This removes all the ranked kids that did not show up.\n2. As counseling starts, all ranks are called out one by one. So it starts with the first rank that showed up, and then the next, and so on. \n3. There's a big screen that also shows stats like the total number of seats in a branch and the last rank that took the seat, among other metrics.\n4. If your rank is called, you head over to the system, choose a branch from any of the ones that have seats and confirm it. This also decrements the seat count for the chosen branch. The person at the system hands you a token. If you do not like any of the branches, you can choose to not take anything and leave. \n5. You take the token to the financial counters at the side and make the deposit amount for that branch (10k + first year fees) via the DDs you've carried. They take a bit of time to activate everything and once that is done they give you a bunch of receipts, maybe ask you to sign some documents and then hand you some merch like water bottles and tshirts. \n6. Once the previous step is done, you've essentially been registered into the system and your admission is complete. You should be able to access the student portal after this and complete the remaining admission related tasks. \n\nThe second round of counseling works exactly like the first round, except for a few important things: \n\n1. There are usually extremely few seats in round 2. You should not skip round 1 and directly come to round 2 unless you have an extremely good rank (<200), since there are usually at most a handful in every branch. If you don't get a seat in round 1, you will 70% not get the seat in round 2. \n2. You don't need to give up your round 1 seat before round 2. If you've chosen branch X in round 1, and then you choose another branch Y in round 2, they'll simply switch your registration details and initiate a refund or ask for more money for the difference in fees when you head to the financial counters with your token. \n3. However, if you choose a branch in round 1, and don't like any options in round 2, you cannot give up the seat you have during the second round. You'll need to initiate a refund request and you will be charged atleast 10k. \n4. The second round of counseling works exactly like the first, so there is no preference given to you if you came for the first round. They will start with the first rank that shows up on that day. So if you have a rank ~500, you'll still need to wait for all the kids with a lower rank than you to finish their selection before you get to make yours.\n├── Man I don’t know who you are but seriously all the stuff you’ve done thanks a lot man I mean it with all my heart 🥹🥹\n│   └── ![gif](giphy|l0NwGpoOVLTAyUJSo|downsized)\n├── hey dude can i dm you abt some doubts regarding fees?\n│   └── Sure, although you can just post your question here as well.\n├── hey what is the policy on refund of the fees if we dont take admission. I am still deciding which college to take but dont want to leave pes cs. so if i pay the dds on day of admission will they give it back if i dont take admissions in the college later?\n│   └── 10k cannot be refunded if you take up a seat. The remaining amount depends on how late you ask for a refund. If it is before classes begin, they usually refund the entire amount. Otherwise, they charge a certain % of fees for each day of class you attend.\n│       └── oh thanks\n├── Is it mandatory to have 60% aggregate in PCM to participate in the councelling or will they relax it.\n└── Rowlet bro, I have 2.3k in pessat and have Cs in ec campus. If in second round, I don't get RR aiml , what will happen- can we just leave in between and still keep the Cs ec campus seat without paying anything in that counseling? keeping in mind the 3rd point that My seat can't be surrounded after that."
    },
    {
      "id": "l54itnx",
      "body": "You got to visit the main campus on the said dates, they’ll verify all the documents and you will be taken to the auditorium. There will call ranks starting from 1 if they have registered for the process. When your rank comes you get to choose from the remaining seats available, if you give the DD, your seat is confirmed. The number of seats remaining and all other details will be screened in the auditorium.\n└── Gotcha man thanks a ton\n    └── And do you feel I should give up my vit seat in preference to this. I’m paying cat 4 fees in vellore and well was just wondering abt which college is better?\n        └── Because I have until Friday to pay the remaining balance of the vit fees and well my parents were just wondering what to do they are ok to pay both but still were wondering"
    },
    {
      "id": "liir47e",
      "body": "I m from ec campus btech. I got in through pessat. Where do i submit my original documents?\n└── You should submit in your campuses admin department"
    },
    {
      "id": "lk4thyr",
      "body": "do i need to pay extra for round 2 counselling in the scenario where i dont get my preffered branch and i have the resort to my first round seat   \n(i hae rank of 2xx and want to switch from ai to core)\n└── No as long as you chose a branch of the same fee category which in your case is true so no extra payment is needed"
    }
  ]
}