{
  "id": "1cykyvg",
  "title": "Skill Enhancement Courses",
  "content": "My professors announced the requirement of skill Enhancement Courses in the summer. I was wondering which of the courses on the current list are online because I'm over 800 km away from campus with family. Thank you so much in advance for your help all of you ",
  "metadata": {
    "root_comment_id": "l5a7vyl",
    "post_id": "1cykyvg",
    "author": "Loose_Ad_3973",
    "url": "https://www.reddit.com/r/PESU/comments/1cykyvg/skill_enhancement_courses/",
    "permalink": "https://reddit.com/r/PESU/comments/1cykyvg/skill_enhancement_courses/",
    "score": 6,
    "upvote_ratio": 1,
    "created_utc": 1716441023,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "l5a7vyl",
      "body": "I dont think any of those are online bro\n└── The issue is that the professors told us there were online courses 😭 so I need to know if there are any"
    },
    {
      "id": "l5aaq1w",
      "body": "The ones taught by students? They are not compulsory as per my knowledge. Ignore, the quality of courses is crap too.\n├── No like the courses are very much required since they provide credits towards your degree. Our professors said we need 8 credits extra to finish our bachelor's\n│   └── The ones taught by students don't give you credits, the ones taught by teachers are again optional. Talking them allows you to skip a subject later, but that's all.\n│       ├── No, in my course it's not that way at all. I'm asking about the skill enhancement courses that are required for the credits needed to do the honours degree. If I want general then I won't do it but I want to do that fourth year\n│       └── Also the skill enhancement courses were never taught by students.\n└── It's not taught by students.. mostly it's taught by the teachers only and if u take these courses now then u can peacefully utilise 7th sem for placements without talking any special topics (if u have covered 6 credits from these skill enhancement course)"
    },
    {
      "id": "l5azl5q",
      "body": "are these the same as summer courses which give you credits, so then you won’t have to take them during 5th and 6th sem?\n└── They are the same but they function completely differently for non engineering courses. If I want an honours degree I have to do these for extra credits"
    },
    {
      "id": "l5fl31v",
      "body": "where do we apply for those...??"
    },
    {
      "id": "l5hoges",
      "body": "Bruh i think it's completely offline and most of the courses will be taught by staff and not students"
    }
  ]
}