{
  "id": "1cyvucb",
  "title": "The Pros and Cons of PES University of ECE at RR Campus and EC Campus",
  "content": "Hello Juniors !\n\nI am an ECE 3rd year student pursuing *ECE at PES University RR Campus*. I wanted to share the **pros and cons of PES University's RR and EC Campus both.** These are compiled by me and my friends and considering overall experience and several factors, the below points have been written -  \n\n\n**Ring Road campus -**\n\nPros - \n\n* Most teachers are approachable and are ready to answer doubts.\n* Presence of Good teachers like Vamshi Krishna, Niranjana Krupa, Kaustav Bhowmick, M Rajasekar, T S Chandar etc. who are exceptionally good at their fields or domains. \n* **Allowed** to sit for CSE placements for most companies and allowed to do Minor courses in CSE - DSA (Data Structures and Algorithms), DAA (Design and Analysis of Algorithms), OS (Operating systems) and DBMS (Database management systems).\n* **Allowed** to do your capstone project (Final year project) in Computer science department.\n\nCons- \n\n* Admission fees through PESSAT is very high and ECE is not at all worth that high fees.\n* The core subjects do not really teach you anything. Only some elective subjects are good, but overall it's just mediocre.\n* Course syllabus is not updated as per latest standards. There are lot of outdated stuff which are not at all matching industry standards.\n* Very few good teachers - There are only a few teachers who are good and who actually know the syllabus very well. \n* Lack of research centers - There are zero or very less research centers for ECE in PES. There is one called cRAIS, but it's literally dead. \n* Core placements have been abysmal this year. Among the 2024 seniors only 30% of them have actually got placed. (Refer images attached for statistics) \n* Heavy workload - You will be bombarded with shit load of assignments and stuff and it is academically rigorous making it extremely hard to manage extra - curricular stuff. It is just a toll on your mental health. It will be **difficult** for you to manage club activities if you are in ECE.\n* You **cannot** take more than 1 non - ECE Elective out of the 4 Electives offered in 3rd year. *But if you are smart, you can scam the department and take 2 non - ECE Elective in 2nd and 3rd year*\n* **Mathematically** heavy subjects - Some subjects in 4th and 6th semesters are too mathematically intensive and it is very hard to score high in these. On top of this, these are not at all useful in the industry. \n* Labs are at the **worst possible state** - If you are someone into *hardware* then ECE is not the place for you and moreover there are some useless software tools that you need to learn for labs which are never even used in the industry (ex - Mentor Graphics EDA, CST Studio).\n\n  \n**Electronic City Campus -**  \n  \nPros - \n\n* Students vs Teachers ratio - Since the students are lesser here, the teachers can focus more on students.\n* Research - CHIPS lab (VLSI) and QUANAD (Quantum) labs are quite good right now. 2 more are coming up, I heard, one for Communication domain and other for Analog VLSI. There is another one called MEDIN lab (Biotechnology, Machine Learning and Signal processing), don't know what's it's status\n\nCons- \n\n* Lack of excellent faculty - There are excellent professors and teachers here also. But, they are much lesser in number than EC campus \n* Final year project (Capstone project) - During capstone (final year project), you will have more opportunities since there are more labs and good teachers. But, the number of students is also much higher. You cannot choose your own capstone team, it is ***allotted***, impacting many people.\n* You **cannot** do a Capstone project in CSE, even if you are interested in it. \n\nUltimately, we are **not** the one to decide your choices. So, please be wise and make a smart move after considering above factors.\n\nAll the best for counselling!",
  "metadata": {
    "root_comment_id": "l5c5bo6",
    "post_id": "1cyvucb",
    "author": "Comprehensive-Fig722",
    "url": "https://www.reddit.com/r/PESU/comments/1cyvucb/the_pros_and_cons_of_pes_university_of_ece_at_rr/",
    "permalink": "https://reddit.com/r/PESU/comments/1cyvucb/the_pros_and_cons_of_pes_university_of_ece_at_rr/",
    "score": 16,
    "upvote_ratio": 0.8600000143051147,
    "created_utc": 1716478825,
    "flair": "ANNOUNCEMENT :snoo:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "l5c5bo6",
      "body": "Requesting mods to Pin this\n└── I'll add it to the FAQs\n    └── Sure, thank you"
    },
    {
      "id": "l5cj6cv",
      "body": "I disagree with these two points: \n\n* Course syllabus is not updated as per latest standards. There are lot of outdated stuff which are not at all matching industry standards.\n\nYes there is a scope for improvement in the syllabus however these topics are you fundamentals.. it will a shame if the foundation isn't proper especially in ECE\n\n* Lack of research centers - There are zero or very less research centers for ECE in PES. There is one called cRAIS, but it's literally dead. \n\nCORI, IOT LAB, RAS, PVL are still active and going.. being active doesn't mean like clubs.. clubs do lot more stuff but research centres keep working on things without marketing it out.. CORI had 3 papers and 2 patents this yr Ig\n└── Oh shoot, sorry, forgot about CORI lab. Yeah I agree clubs do lot more active research !\n\nThanks for correcting!"
    },
    {
      "id": "l5ezy44",
      "body": "as a final year ECE grad at RR campus, i think OP has stated all points correctly\n└── Thank you !"
    },
    {
      "id": "l5f8buk",
      "body": "Mentor graphics not used in industry? Why r these people teaching it.... People spend hours making schematics and layout, is it waste of time? Please let me know I thought of making layout for my miniproject....\n└── Hi, So many people nickname Mentor graphics as - **MS Paint 2.0** lmao 😂😂.. Bro its utter trash\n    └── Mentor Graphics (acquired by Siemens) along with Cadence and Synopsys form the big three of the EDA market. Being a major EDA vendor, it's nowhere near obsolete.\n        └── I think Cadence is more better\n            └── My comment wasn't about your opinion but it's relevance in the industry\n                └── OK"
    },
    {
      "id": "l5fhhdw",
      "body": "Just adding on, most of the cons here are not cons of PESU but engineering as a whole!!\n\nSome of them are PESU specific but the points related to syllabus and assignment heavy semesters, that's engineering"
    },
    {
      "id": "l5focr4",
      "body": "* There a few problems in this post. You can see the clear bias of the OP wanting to be in CS but getting ECE.\n\nTLDR: OP's post lacks nuance and understanding of what it means to be an engineer that is not in CS. Faculty points are correct, syllabus points requires more nuance and detail, labs are a combo of both. OP also forgets to mention that sometimes you need to put in work to be good - either for academic or improving yourself.\n\nBefore any replies to me that I'm a propagandist for PES or otherwise, I am not. There are genuine things that need to be addressed, updated and corrected. But its not that bad. Most places in India are far, far worse. Its all a compromise in the end. Perhaps poetic, considering engieering in real life is also balancing & comprimising.\n\n\n>Allowed to sit for CSE placements for most companies and allowed to do Minor courses in CSE - DSA (Data Structures and Algorithms), DAA (Design and Analysis of Algorithms), OS (Operating systems) and DBMS (Database management systems).\n\n>Allowed to do your capstone project (Final year project) in Computer science department.\n\nI recommend changing the 2nd point to \"Allowed to do interdiscinplinary/inter-branch capstone project. This means your project can have teammates from other branches of engineering - CS/EEE/Mech/BT. There are procedures that allow this, and it varies from branch to branch, but it is allowed.\"\n\nThe 1st point can be reworded as \"More minor course options as there are more departments here\".\n\n>Lack of research centers\n\nu/Uternhmer_129 has already addressed this within 1 hour of this post being posted. Why have you not edited & updated the points?\n\nAnother note, there is an upcoming Bajaj Engineering Skill Training (BEST) Center coming up in Golden Jubliee Block 8th floor (to access it, from front entrance to the lift, go to 6th floor and climb 2 stairs up). I have been there yesterday. Equipment is coming in daily as its being lifted up via crane.\n\nIt's pretty good for robotics, mechatronics, PLC, automation, IoT, control systems, hydraulics, electric vehicles, electric power systems etc. I have seen the current faculty being trained to use these so that they can be taught to students in the upcoming semesters. Every day machines are being installed, calibrated. These are industry-standard learning machines straight from top companies like FANUC, KUKA etc. The entire list of machines is to long to put but you can see their quality by just seeing them. You can see the investment done by Bajaj in PES. The future plans for this center is also pretty good. At first it was hard to believe, but after seeing it in-person yesterday, I would not be surprised. Anyone who is entering their 3rd year this year will have opportunities in their 6th semester to experience here - either through STs, internships, etc.\n\n>Core placements have been abysmal this year. Among the 2024 seniors only 30% of them have actually got placed. (Refer images attached for statistics)\n\nThis needs additional information by stating that the current state of placements is low everywhere & that core placements in general are low due to a multitude of reasons.\n\n>Heavy workload - You will be bombarded with shit load of assignments and stuff and it is academically rigorous making it extremely hard to manage extra - curricular stuff. It is just a toll on your mental health. It will be difficult for you to manage club activities if you are in ECE.\n\nWhile true, ECE in general is a course that requires rigour. Its also true a lot of club heads are in ECE and lot of club members in various clubs - both technical & non-technical are from ECE.\n\n>You cannot take more than 1 non - ECE Elective out of the 4 Electives offered in 3rd year. But if you are smart, you can scam the department and take 2 non - ECE Elective in 2nd and 3rd year\n\nExcuse me but are you from this college? Electives are only in 3rd year in PES. 1 non-branch elective in 5th & 6th semester is univeristy policy. After all, if your interested in core ECE, I'm pretty sure most people would stick to ECE.\n\nSpecial topics, or ST, are 2-credit subjects which can be taken from any department anyways. Overall in our 160 credits, there is like 10 credits dedicated to ST. In simple words, you can take 5 entire non-department courses. oh, and these can be outside of engineering as well. Can be done in Pysch, managment, law, etc.\n\n>Mathematically heavy subjects - Some subjects in 4th and 6th semesters are too mathematically intensive and it is very hard to score high in these. On top of this, these are not at all useful in the industry.\n\nAny and all CORE engineers knows that ENGINEERING is MATH. They form the FUNDAMENTALS of engineering. Why is it necessary? All the best getting a core job without knowing FUNDAMENTALS. They will form the basis of your problem-solving skills. In core jobs, you apply FUNDAMENTALS with PROBLEM-SOLVING SKILLS. Perhaps the lack of understanding in certain students makes targetted misinformation make posts like this.\n\nIncoming students, if you think engineering is just sitting and clicking stuff on a computer, you won't be wrong if you want to be stuck with a dead-end job with no mobility. Real engineering requires creativity, ability to math, ability to problem-solve and understanding of core concepts which form the basis of engineering solutions. If you want to improve your problem solving skills, take up projects. CS students are luckier because their assignments actually requires you to problem solve. Atleast for those who are doing it genuinely. Other branches need to improve on the type of assignments from basic question-and-answer or submitting screenshotted/code-copied submissions.\n\n>Labs are at the worst possible state - If you are someone into hardware then ECE is not the place for you and moreover there are some useless software tools that you need to learn for labs which are never even used in the industry (ex - Mentor Graphics EDA, CST Studio).\n\nI'm not going to comment on the state of the labs in PES. They do need more improvements and upgrades. However for software, you can literally learn and do projects on them on your own. No one is stopping you except yourself (or your schedule).\n└── All the necessary changes have been made!"
    },
    {
      "id": "l5g74r7",
      "body": "Mentor Graphics (acquired by Siemens) along with Cadence and Synopsys form the big three of EDA market. Being a major EDA vendor, it's nowhere near obsolete."
    },
    {
      "id": "l5g83yw",
      "body": "TSC, KB ... are exceptionally good at their fields, lmao \n\nWake your friends up! Good at teaching / Good at research??? A glance at their h-index is enough to judge how exceptional they actually are. Their teaching isn't great either.\n├── If not KB, TSC is good right? That's why I heard tho\n│   ├── What is TSC good at, teaching/research? Teaching is a subjective matter and his h-index is abysmal, what aspect of his is left out as a faculty?\n│   │   ├── my friends told he is good at teaching bro, although he is strict sometimes, and shows some of his *army traits*. Research wise not very sure.\n│   │   └── Since you mentioned vehemently about TSC and KB (assuming we are referring to the same people), I was going through most ECE faculty profiles. TSC and KB are among the ones with most number of journals of repute compared to BN Krupa etc. and also with funded projects. I am more confused now about your comments.\n│   │       └── You are free to have a different perspective. I don't give a damn about how they fare compared to other PES faculty. You would have to go deep into their field to know how mediocre the situation actually is and listen to people who worked with them (esp. KB) to grasp the nitty gritty.\n│   │           └── So...ok....have you worked with him? No one publishes anything with KB? Because according to my brother at an IIT, with whom I checked the h-index etc. (me being new to those), the quality of publications of \\*\\* or \\*\\*\\* are much superior to Niranjana Krupa etc., which obviously fetches them project money (as he saw on the profiles). Also, I guess you are talking of the Photonics lab? That one I hear is considered much important by Vice chancellor these days. I hope there is no one off incident related to TSC or KB which is getting generalised?\n\nMy brother also said many a times Professors who try to work on very current topics, make cross citations with their friends etc., to increase citation. So h-index may not always reflect a great innovative idea. I am just trying to be neutral here. So, are you currently doing research in the field of TSC or KB?\n│   │               └── 'h-index' is one of the foremost objective measures to evaluate a researcher while another is an 'impact factor' of journals. I don't get why you are obsessed with benchmarking against Niranjana. \n\nAnyways, assuming h-index to be manipulative at an individual level, let's look at the impact factor of journals, which I feel is not as susceptible to manipulation by an individual. Once you gather that, assess for yourself. \n\nComing to you last question, I've been there and done that.\n│   └── Oh! You despise the professor (assuming) KB? thats strong! What does he do?\n└── Confused at this! Those are faculty members? You studied with them?"
    },
    {
      "id": "l5h1p7x",
      "body": "Thank you so much for putting this down!, as an ece student entering 2nd year could you suggest how to prepare for what's ahead?"
    },
    {
      "id": "l6ahwle",
      "body": "OP doesn't seem to have a very good idea about how ECE is at EC Campus. I'll just add a few points in case someone is considering it.  I'm in my 8th semester in ECE EC campus and I'll share a few of my views so you get a good perspective from a senior in both campuses. I'll also give you a few cons of ECE in general across both campuses from what I've experienced.\n\nFirst off, the faculty here is horrible and many of them are very unprofessional. Any ECE EC student can tell u how bad they are and how much all of them are hated lol. Our HoD thinks he's doing a good job if everyone hates him because apparently \"teachers should be hated by students\" or something according to him. He also keeps reminding us very condescendingly how we are all inexperienced nobodies and how there are ppl always better than us. Should give you a good idea of how the atmosphere is here. Yes, there are one or two really qualified and nice professors here but most of them are not the kind of teachers any student likes to deal with. And since there are a small number of teachers, the same teachers will teach multiple subjects in different semesters for the same student. So if one of them hates you, tough luck. Say goodbye to high internal marks in multiple subjects.\n\nMore on the atmosphere here. College basically felt like a prison before but it even looks like a prison now. There are grills everywhere and if you look out the window and walk outside in the corridor you get a nice authentic prison feeling with grills all around you. There are bouncers everywhere to make the prison experience more realistic and immersive. The bouncers are there to keep you in check, not as security for you. You cannot be outside class during class hours. If a bouncer or teacher sees you in the canteen or outside class, your id card will be confiscated and you will be taken to the principal and your HoD will be informed you were bunking classes. There's a separate committee of teachers called the discipline committee who go for rounds around campus to check for students bunking outside the building. You can say goodbye to hanging out with friends or doing anything except attending classes here\n\nOP talked about the labs in RR. EC campus has more labs and more equipment, but most of that will not actually translate into you doing more with it. All of the subjects with labs will use a software called Cadence or Xilinx Vivado which is basically simulation of basic circuits on an application. The actual hardware components that you will use like Arduino boards, Raspberry Pi boards and the components have to be purchased by you personally. In my entire 4 years of being in ECE, I have used a total of one Hardware device in the lab for one period.\n\nWe have the same syllabus and exams and OP has done a good job explaining how outdated it is. Nothing we learn except the pure basics will help us anywhere in the industry. Also, ECE exams(At least for my batch) were way harder than CS. CS people had 20 1 marker MCQS for their internals whereas ECE people had only 4 guaranteed MCQs for 1 mark each and 2 descriptive 4 markers where we had to solve equations and numericals and then type them step by step in the system. Imagine typing steps with sub notations like n1,n2, and terms with exponents, logs, squares and all. And all 20 marks had to be done in 30 minutes. Compare that to the 20 1 markers(MCQs) that CS people had and you can see the disparity. I think the exam pattern has changed now and it might be a bit fairer for all branches now but I'm not sure.\n\nYes we have Research labs here like CHIPS and the Quantum lab. I have friends who have done their final year projects in both and let me tell you the reality lol. CHIPS is pretty exclusive and unless you have a very good CGPA or the teachers like you, you're not gonna be able to use those facilities or do a project there. As for the Quantum lab, it's just a glorified chemistry lab with a fancy name. The things done in that lab involve fabricating some very important and expensive components which are microscopic. For that, you need chemicals and equipment worth lakhs and the people in charge are very stingy with it. Good luck convincing them to let you do anything major in the lab. No clue about the other labs. It's probably just something they said to make EC campus seem more attractive because no other labs are being constructed right now here.\n\nAs for electives, You cannot choose any elective you want, and all our electives are ECE electives. The teachers give a list of a few topics every semester and only the ones which have a strength of 30+ are offered. If there's a subject that looks interesting but at least 29 other people don't want to take it, you won't be able to do it and are forced to do what other people choose. There's more lol. Electives don't have only a lower limit of students here, they also have an upper limit. Only 60 people can take a particular course. If you wanted a course that many people like and you delayed your choice by 1 or 2 seconds, you won't get that and are now forced to take some elective which you might not want but has some free seats. Kinda defeats the point of electives if you can't even choose what you want no?\n\nIf you think 30% placements is abysmal, what would you say about 5%? And 0% in core companies? I'm in my 8th sem now and last I checked, in march, 6 people out of the 125 ish people we have were placed. That's 5%. And all of the companies are IT companies. So none of the ECE students in my campus got placed in core companies. Everyone else, including me, just got internships and jobs through referrals. Our placements have been going on from March of last year so most of the companies have come already so if someone hasn't been placed by now, there's a very small chance of them getting placed after this. Also, average package of ECE students was 3.2 lakh for my seniors whereas that of CS students is 12 lakh this time.\n\nNow that the fees for ECE is 20 lakh, as a senior, I would 100% not recommend ECE to anyone who isn't passionate about it or very interested in it. Anyone who is thinking f taking ECE because they did not get CS will have a very bad time with the subjects. All the subjects are mostly math and physics. Lots of advanced numericals and derivations and stuff you learn in 3rd and 4th sem carry over. Unless you really enjoy solving advanced numericals or really like the core part of it, you're gonna find ECE subjects really hard and frustrating. They're lengthy and all of the subjects in the VLSI and Comms domain feel like the exact same subject to study . if you don't like one, you're probably not gonna like any of them. Hope you find another perspective useful and Good luck :)\n├── Those EC campus points were written by my Friends in EC campus. So, If there are any mistakes in that, my apologies. \n\nThank you for your comment\n│   └── No mistakes, but there's a huge disparity between your amount of content on RR and EC no. Just wanted to add a bit more content lol\n│       └── Ah okay lol\n└── bro , im juss done with kcet counselling, I've got BIT robotics and ai , if I push through extended round I might get pes ( ec campus) ece , should I go for it or is BIT robotics enough, ..I was thinking of going into IT field or will be there improvement in ec related jobs 4 years later , idk , I'm fine with anything, I juss need a job that pays me well , what's ur opinion, should I take admission to BIT or wait for PES \n    └── PES ECE is shit but it's definitely better than BIT robotics for sure if u wanna get into the IT sector. Idk about ECE jobs in the future, I'm still a fresher but PES is a better college than BIT and ECE is definitely better than robotics if u don't have an interest in either of them. If it's through CET, I think PES is definitely worth it"
    }
  ]
}