{
  "id": "1cyy6gq",
  "title": "Should i take pes ec cse through merit list or rr cse through higher fee quota (donation)?",
  "content": "Hi, my rank is under 3k in pessat and from what I’ve seen online i can get pes ec campus cse through my rank but my dad is suggesting me to take rr cse through higher fee/ donation quota, which campus should i go for?",
  "metadata": {
    "root_comment_id": "l5cmx4y",
    "post_id": "1cyy6gq",
    "author": "Bigdoughnut32",
    "url": "https://www.reddit.com/r/PESU/comments/1cyy6gq/should_i_take_pes_ec_cse_through_merit_list_or_rr/",
    "permalink": "https://reddit.com/r/PESU/comments/1cyy6gq/should_i_take_pes_ec_cse_through_merit_list_or_rr/",
    "score": 6,
    "upvote_ratio": 1,
    "created_utc": 1716484582,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "l5cmx4y",
      "body": " Why on earth would anyone willingly spend 50-60 lakh on this.Take CS at EC campus. There isn't much difference between the two campuses, anyway.\n└── Is cse through ec campus good or can i look at other options?\n    ├── Mention your \"other options\"\n    │   ├── Vit/Mit/bms(donation)/rv (aiml) donation\n    │   └── Vit/Mit/bms(donation)/rv (aiml) donation\n    │       └── Personally i would narrow it down to rvce aiml through management or pes ec cse through merit\n\nI would feel a bit guilty going through management \nThough keep in mind going through pessat is going to be only **comparatively** less expensive\nBut if guilt is kept aside  i would go for rvce aiml\n    └── It's no different than CS in RR. The placements are held together for both campuses, if that is your concern. RR's infrastructure is better than EC but after a certain point it won't matter.\n        └── Thanks for the info"
    },
    {
      "id": "l5cqgoa",
      "body": "There's a detailed comparison in the FAQs: https://bit.ly/pesu-faq\n\nTo summarise, your campus is irrelevant after the first 3 years. It doesn't show up anywhere - degree, transcript or anything. Placements and everything else are objectively the same. Don't pay so much more for practically no reason."
    },
    {
      "id": "l5lqfe2",
      "body": " EC CSE for sure. There's no way PES is worth 50 lakh, not even CS RR. Plus the good thing about EC campus is it's easier to get scholarships since there's less people and less competition. The syllabus, the exams, the teachers, they're all very similar in both. The only downside of EC Campus is that it's just a bit far for a few people. 20 lakh already is a verryyy large amount for PES and there's no way you should even consider 50 lakhs. Even the placements of both campuses are done together so there's no reason to take the management seat. A lot of my CS friends in my campus (EC) have got better placements than my other frnds is RR. Branch is more important than campus and if you're getting cs through pessat, you should not even think about management seat"
    }
  ]
}