{
  "id": "1czlrcm",
  "title": "Hopefully I get something ",
  "content": "I have counselling tomorrow, all the DD's are ready. My mom is ready. But I am not. Idk the way things are going i think I'll have to settle with pes only. That too mostly likely I'll get ec campus. I am not saying that pes is not a good college but I just wanted more. I was a good student. Had a huge downfall in 11th, didn't fail, just scored mediocre marks. In 12th I was determined to show everyone what I'm really capable of and i did it. Became an A grade student again and scored 90 percent in boards too(expected more but ig not everything is supposed to go my way). All the entrances I've given i performed really mid, below average too sometimes. I just stopped studying properly. I had distractions as well hit I had plenty of time to study yet i wasted it. It hurts man. I regret everything so much. That feeling of not being good enough is eating me alive. I want to make my parents proud. In the exams in which I did do well, i just had sheer bad luck. There were 2 exams, nda and comedk in which I performed extremely well. But it just wasnt meant to happen ig. I messed up my bits paper too, got only 180/390. I am giving second attempt too. I am trying to go all out but I just don't have that energy anymore. Anyways, I just wanted to vent a little bit. By god's grace, i get main campus cse+aiml tomorrow. I wish nothing but the best to everyone else too. ",
  "metadata": {
    "root_comment_id": "l5h5ec2",
    "post_id": "1czlrcm",
    "author": "Ldyboykiller",
    "url": "https://www.reddit.com/r/PESU/comments/1czlrcm/hopefully_i_get_something/",
    "permalink": "https://reddit.com/r/PESU/comments/1czlrcm/hopefully_i_get_something/",
    "score": 9,
    "upvote_ratio": 0.8600000143051147,
    "created_utc": 1716560080,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "l5h5ec2",
      "body": "I am in the same boat more or less. The feeling when you know you're capable of doing it but you just can't, however hard you try is the worst. I don't know if it's ever gonna get any easier for people like us from here but I do know that we'll never give up. Hope you get your desired seat tomorrow. Also hoping to see you at bits:)\n└── feels good to see it put into words man"
    },
    {
      "id": "l5h7pwa",
      "body": "PES ain't the end of the world bro. There are always plenty of options available.\n└── I ain't saying it is, but I do believe I can do better"
    },
    {
      "id": "l5h9q5j",
      "body": "PES cse is really good chill, look on the bright side u get to live in blr with parents.\n└── Yeah my family will be moving out at the end of June."
    },
    {
      "id": "l5hgzp1",
      "body": "No one's first choice has been PES. We all wanted something, somewhere else. A lot of people in have been in a similar boat. .Senior management also acknowledges it weirdly. Maybe that's why its been easier to bond with friends here than in school or coaching. All the best for BITSAT, but in case it doesn't go well, it's fine. PES is good enough for CS and with a bit of hard work here you can get a good placement/job. Might not be as fancy or overly paid as it is for IITians/BITSATians, etc. but people survive on worse. \n\nIt will take a semester, or two, or three to perhaps stop caring about the regret and truly moving on. Whats been is done, now you just improve yourself. Join a club, pick up a new hobby, pick up different skills to improve yourself. Don't take management's word seriously if they threaten you. Avoid angering them. Be good with the faculty you like. Say hi to the guy who will sit next to you in class. After a few years, you will get a different set of worries. So, don't regret too much. Work and move on"
    },
    {
      "id": "l5hj2dz",
      "body": "Bro from now on the only thing that matters is doing well at pes. It absolutely doesn't matter however u did in ur 11th 12th. In my batch many management quota people are doing better than most of the others. Scoring in college exams and developing skills here is completely different from scoring in jee"
    }
  ]
}