{
  "id": "1cznyal",
  "title": "Serious doubt regarding counselling tomorrow",
  "content": "I got a rank of 2.4k in pessat and I might get ece at rr/cse at ec with this. I'm super confused if I should go for the counselling or not. My first priority is BITS and after fucking up BITSAT today with 206 marks I really want to improve for the next attempt.\n\n  \nMy doubt: If I get a seat of my liking tomorrow:  \n1) Does PES take the entire fees in one go?   \n2) Is there a seat blocking system? (so in case I don't go to BITS, I could then choose PES in June)  \n3) If I pay the fees tomorrow and want to withdraw if BITSAT goes well next month, what's the refund struture like? how much % of the money do I get back?\n\nI know this is a lot to answer. If you don't wish to, please please attach a link or something where this stuff is mentioned. Thank you!",
  "metadata": {
    "root_comment_id": "l5hjsht",
    "post_id": "1cznyal",
    "author": "Time-Hyena-6584",
    "url": "https://www.reddit.com/r/PESU/comments/1cznyal/serious_doubt_regarding_counselling_tomorrow/",
    "permalink": "https://reddit.com/r/PESU/comments/1cznyal/serious_doubt_regarding_counselling_tomorrow/",
    "score": 3,
    "upvote_ratio": 0.7200000286102295,
    "created_utc": 1716565814,
    "flair": "PESSAT/Admission",
    "nsfw": false
  },
  "comments": [
    {
      "id": "l5hjsht",
      "body": "1. The entire first year's tuition fees for the branch + 10k processing fee is taken.\n2. Seat blocking is called counselling. That is what you will be appearing for tomorrow.\n3. You cannot get 10k back. The remaining amount depends on when you ask for a refund. Since you will ask for it before classes begin, they ideally *should* refund the entire tuition fees. Not sure if they charge any penalty for this, but **confirm this information**. However, if you ask for a refund *after* classes begin, they charge x% of fees for each day you attend.\n\nThere is more info about counselling (among other things) in the FAQs: [https://bit.ly/pesu-faq](https://bit.ly/pesu-faq)\n├── Thank you i read the entire thing and it did help a lot. But is there no surety about the full refund before the classes begin?\n│   └── Regardless of if you end up joining PES, if you take a seat then 10k will not be refunded. \n\nNow if you take a seat and choose to not join PES, then you will be refunded based on the conditions I mentioned.\n└── I just dmed you please check"
    }
  ]
}