{
  "id": "1d0eprc",
  "title": "couldn't attend counselling today due to personal reasons ",
  "content": "I couldnt show up for counselling today, will there be a second round of sorts in june?(my friend said so) and my rank is 70x will i still be able to get cs in rr campus incase someone gives ur their seat? ",
  "metadata": {
    "root_comment_id": "l5mlnxz",
    "post_id": "1d0eprc",
    "author": "lonethewalker",
    "url": "https://www.reddit.com/r/PESU/comments/1d0eprc/couldnt_attend_counselling_today_due_to_personal/",
    "permalink": "https://reddit.com/r/PESU/comments/1d0eprc/couldnt_attend_counselling_today_due_to_personal/",
    "score": 4,
    "upvote_ratio": 1,
    "created_utc": 1716651608,
    "flair": "PESSAT/Admission",
    "nsfw": false
  },
  "comments": [
    {
      "id": "l5mlnxz",
      "body": "They said that second round of counselling will be held in the first week of July side to side of kcet counselling\n\nAnd about you getting cse seat\nWe really cant tell man it totally depends on the number of people who are going to surrender their seats\nAnd apparently they secretly sell some of the surrendered seats under management quota for more money \nThere is no farm in attending the counselling though\n└── ohhhhh, bruh my life is so sad. one exam i do decent in and i couldnt show up for counselling.\n    └── Nah nah chill mate, you are pretty safe because your rank is in the 3 digits. Few people will obviously release their seat because of kcet, bitsat etc.\n        └── ty man hope it is that way"
    },
    {
      "id": "l5nehz3",
      "body": "Chill every year there's a second and people will definitely get better colleges so don't lose hope as they would withdraw soon\n└── yeah hope so i cant really afford management seats."
    },
    {
      "id": "l5p70t0",
      "body": "Usually the cutoffs for second round used to be higher than the first round, but last year due to some weird reasons the cutoff for cse seats in second round were shockingly low due to less number of seat withdrawals.\n└── prolly cuz they sell it as management seats, pvt clg is proift oriented usually\n    └── I remember when I went to the admissions office. That guy simply replied to me that all the vacant seats are being given to management students. If the seats are vacant after that, then they will show up in the second round. \"Why will we give seats to students who are giving 3.4L instead of students who are giving 10L per year?\""
    }
  ]
}