{
  "id": "1d0txag",
  "title": "College Ranking what do you think",
  "content": "Is this ranking reasonable considering perception in this group\n\n1. **IIIT H/BITS Pilani**\n2. **BITS Goa/Hyderabad, IIIT D, IIIT B**\n3. **RV College/BIT Mesra**\n4. **Thapar/VIT/MIT/PES /BMSCE/Ramaiya - All Main campus // There might be some college from Pune and Bombay**\n5. **Thapar Dera Bassi, VIT Chennai, PEC Electronic City**\n6. **JSS/Dayanand Sagar/BMSIT/**\n7. **BIT, RVITM,NIE**\n8. **Nitte Meenakshi**",
  "metadata": {
    "root_comment_id": "l5pggf1",
    "post_id": "1d0txag",
    "author": "OkRecognition2932",
    "url": "https://www.reddit.com/r/PESU/comments/1d0txag/college_ranking_what_do_you_think/",
    "permalink": "https://reddit.com/r/PESU/comments/1d0txag/college_ranking_what_do_you_think/",
    "score": 8,
    "upvote_ratio": 0.699999988079071,
    "created_utc": 1716699303,
    "flair": "PESSAT/Admission",
    "nsfw": false
  },
  "comments": [
    {
      "id": "l5pggf1",
      "body": "This ranking is for private colleges only."
    },
    {
      "id": "l5ph69n",
      "body": "pes ec = rr , rest of it true\n├── I agree but perception is one of the parameter here.\n│   └── then rr ahead, fosho\n└── It is not equal in any measure take it from a senior. Ece != RR\n    └── It is equal in opportunity boss\n        └── Sir ig you're not yet in tbe placement scene. Or you're CS in rr. If you're in ecc and in the placement time and you're saying this, maybe you're not in the same pes as I am.\n            └── Hi I'm CSE in ECC. I have friends in RR CSE. It's the same challenge both ways. In one of my HR interviews, I had to explain to my interviewer that there were two campuses in Bangalore.\n                └── Very few people know about PES ECC. many times when I tell people I'm in pes, they're like \"ohh Banashankari ah\"\n\nThen I have to correct them saying Electronic City. Very annoying\n                    └── Hey , I am attending counseling this year . Had a doubt to between  choosing pes (ec campus ) and jss . Please answer"
    },
    {
      "id": "l5ph6t3",
      "body": "Firstly, no ranking system is accurate. Every ranking, including NIRF, is flawed to a large extent. There is no point trying to rank colleges beyond the T1 status which IITs/BITS/NIT/IISc have. \n\nSecondly, why are both PES campuses ranked differently? They are objectively the same: placements, degree, etc. Since when did subjective parameters become a differentiator? That's bias.\n\nThirdly, everyone and their mother knows that PES only competes with Stanford and South Korea. We even unveiled our own flag yesterday. PESU League >>> Ivy League. /s\n└── TIL my VC Bulletin shitpost about going to war with South Korea has become part of PESU lore\n    └── It's all turning to reality man. Check the PESU flag :vckek:"
    },
    {
      "id": "l5ph7jn",
      "body": "What's the ranking based on? Placements and campus?\n└── Placement is the main parameter followed by perception.\n    ├── Aight looks good.\n    └── Regarding placements, you should ideally compare the median of the base pay. Using average or CTC will greatly skew these results. Further, since the number of students varies greatly across these colleges, unless you look closely, you will only see biased results. This is the same reason a lot of people think RR campus gets better placements when the reality is that RR simply has more people sitting for a T1 company compared to EC. \n\nIf you're going by reputation, then yeah sure I guess your list is okay. Although you should know that from a higher education point of view for MS, everything other than IIT/NIT/BITS/IIIT/IISc gets put into the same bracket, and there is no distinction *between* different different IITs, between different NITs etc.\n        ├── I agree with you 100%.\n        └── wtf why am *I* getting downvoted of all people for bringing up logic? xD"
    },
    {
      "id": "l5pimjn",
      "body": "all bits campuses fall at the same place. you get the same degree irrespective of campus and placements are centralised.\n└── Perception is one of the parameter."
    },
    {
      "id": "l5piqfd",
      "body": "Seems fair. I'd bring rv down to 4. And ec campus up to 4. Nothing else really"
    },
    {
      "id": "l5pmhdo",
      "body": "What's the best college in India for BTech that offers admission through donations or management quota? I'm guessing RVCE?\n├── That's a genuine point then IIT Bombay and all other IITs/NITs give admission based on reservation in so many categories.\n│   └── True, but I'm asking what's the best option for someone looking for admission via $$$\n│       └── RVCE in Bangalore. I am not sure if Manipal has MQ. If it does, then Manipal.\n│           └── Is Manipal seriously better than RVCE? I thought RV is way more selective, Manipal takes almost anyone\n│               └── We aren't talking about the selectiveness of the entrance mode here, right? The comparison is being made after you secure admission through any means.\n\nIf you compare the infra, labs, research, opportunities to build your profile, placements, campus & campus life, and ofc the reputation as well, then in that case, I think Manipal is probably better (maybe not by much) overall. \n\nOfc not to say RVCE is bad or anything: its a great college. But seems like if you put together all the factors Manipal might have more going for it than RV does.\n│                   └── Interesting. I brought up selectiveness because in India, more selective = better placements and prestige.\n│                       └── I think that applies only for T1. Beyond that, the equation disappears IMO. If I'm not wrong colleges like Thapar take admissions via Boards % too and they have placements on par with PES\n└── Bro I'm currently selecting colleges for my btech and management quota in rv for cs branch it is 68 lakhs!!!! Unreal he bhai... IT is 50 lakhs hahaha not worth it imo unless u get through merit seats\n    └── 68 lakhs ? What the fuck, people are ready to spend this amount of money for an engeneering seat?\n        └── Ikr unbelievable tho... Isse accha toh aur Paisa laga ke bahar padhne jao way better option"
    },
    {
      "id": "l5pnvo0",
      "body": "Amrita can be added in #5 or #6"
    },
    {
      "id": "l5pr4kr",
      "body": "Pes ecity isn't that bad bro. It's just below rr"
    },
    {
      "id": "l5pufir",
      "body": "nah these rankings are overrated and nothing new many colleges pay to get good ranks"
    },
    {
      "id": "l5pyldk",
      "body": "Also DTU is above RVCE\n└── dtu is a govt college\n    └── Bro even IITs and NITs are Government Colleges."
    },
    {
      "id": "l5q2si0",
      "body": "What's the jee main cutoff for cse in main campus?"
    },
    {
      "id": "l5q6p12",
      "body": "bro I feel like this post doesn't even belong here this is for pes related stuff go to some other page like r/JEENEETards or something. This sub reddit is for PESU related things. If u want to talk abt pessat and admission at pesu that fine but ranking and all gtfo"
    },
    {
      "id": "l5qzeh7",
      "body": "Not much difference between BITS Pilani/Goa/Hyderabad have heard this from many students.   \nBIT Mesra is a GFTI  \nVIT-V should be at 5 and Chennai at 6  \nRest is perfect"
    },
    {
      "id": "l5vni1b",
      "body": "why is PES rr not mentioned"
    },
    {
      "id": "l60nqm1",
      "body": "i feel BITS is really costly for engineering. (I feel BITS worth it on if you get CSE). Then depends if you get PES or RVCE through KCET, its a really really good deal. So yeah many factor ranking depends on, I can see many issues with this ranking. To rank college you need - Exam scores (KCET, BITSAT, JEE Mains), Location (Bengaluru has a huge advantage and Hyderabad also)"
    }
  ]
}