{
  "id": "1d10epj",
  "title": "ec campus girls hostel query",
  "content": "i read the rules and regulations of the hostel and it says stuff like grp study prohibited, cant use phone after 11 pm, laptop can be used only with permission, no leaving the room etc etc... is it really that strict?",
  "metadata": {
    "root_comment_id": "l5r40kf",
    "post_id": "1d10epj",
    "author": "draught0fLivingDeath",
    "url": "https://www.reddit.com/r/PESU/comments/1d10epj/ec_campus_girls_hostel_query/",
    "permalink": "https://reddit.com/r/PESU/comments/1d10epj/ec_campus_girls_hostel_query/",
    "score": 14,
    "upvote_ratio": 0.8899999856948853,
    "created_utc": 1716726937,
    "flair": "PESSAT/Admission",
    "nsfw": false
  },
  "comments": [
    {
      "id": "l5r40kf",
      "body": "most of those rules aren't real but the warden IS a b*tch and she will make your life hell. do yourself a favor and pls don't come. ill elaborate if you want in the DMs.\n├── If you elaborate here in a separate comment it'll help everyone out. I can also add it to the FAQs, since hostel is a pretty common question.\n│   └── Talk your shit moss\n│       └── I have no clue what that means my dude\n│           └── 😂😂😂 kids these days have vocab that make us feel old\n│               └── Nah that isn't vocab. That's brain rot.\n│                   └── Still have no clue what that means 😂\n├── yes please do ill dm\n└── Elaborate here only no :)"
    },
    {
      "id": "l5raey2",
      "body": "Yes pls someone tell what it's like at the hostel? Curfew and all the rules that one should know before getting themselves into the hostel\n└── Curfew is 6:30 pm, and the warden is pretty stringent about it. The warden is a piece of work. She imposes a lot of absurd rules. Like, you can't wear shorts or sleeveless tops inside the hostel. Sometimes she has issues with girls leaving their hair open. If you dont disobey the warden explicitly she'll be fine for the most part but otherwise she can be the devil. She often threatens people with random room checks.\n\nAlso btw the hostel is 7km away from campus. There are buses at 7 in the morning and 5 in the evening. If your classes end early you either wait in campus till 5 or take an auto back or something.\n\nIt's like any other hostel. You'll have to share a room with 3 others. There are common washrooms on each floor and they get cleaned everyday, but if you're a hygiene freak (like me) you'll have a hard time adjusting. People can be absolutely disgusting, leaving toilets unflushed, used pads thrown around and more. The food is average and you may get non veg once a week. There's a laundry system and you can give laundry twice a week. \n\nIf you really desire the \"hostel experience\", you could stay a year in hostel and move to pg for your subsequent years, which is what most people do. Or else you could find a pg close to college and stay there.\n    └── is the laundry free or we have to pay extra for it?\n        └── It's included in the hostel fee. So no you won't have to pay anything additional for it."
    },
    {
      "id": "l5rbhbl",
      "body": "It's not as strict as the rules and regulations that are mentioned but the warden has mood swings, she's very very fake. In front of your parents she'll be so fucking sweet and then once they're gone she shows her true colours. \n\nThen again this is just my opinion: it's better to stay in a PG which is closer to the campus. Anyways there's no girls hostel inside the campus (which is kinda ridiculous if you think about safety)\n\nAlso, the warden does NOTHING if you go to her with any problems related to your room or your roommates. She doesn't understand most of us. And honestly, 6:30pm is a really shitty curfew to be stuck in a hellhole for.\n├── i guess ill have to manage this year then move to a pg next year 😭\n├── And if we want to stay outside past the curfew time what do we do?( Considering we have a local guardian)\n├── And if we want to stay outside past the curfew time what do we do?( Considering we have a local guardian)\n└── And if we want to stay outside past the curfew time what do we do?( Considering we have a local guardian)\n    └── Elaborate permission procedure you have to sign some stuff your lg has to come to pick you up"
    },
    {
      "id": "l5rhano",
      "body": "Damn thanks so much this clears a lot for me"
    },
    {
      "id": "l5rku21",
      "body": "I have seen girls getting suspended for being drunk at girls hostel while pandu was quite chill even when he caught a few guys\n└── All my homies love Pandu\n    ├── Who’s pandu bro , isn’t the boys wardens name mahesh ?\n    │   └── Amaatra hostel warden name was panduranga idk if he is there or not know. Lmao idk if panduranga is his first name or surname\n    │       └── He is still there.\n    └── Fr bro, really miss my amaatra days"
    },
    {
      "id": "l5unjvy",
      "body": "this is real"
    },
    {
      "id": "l5uqhf6",
      "body": "Really don't think the money is worth it. It's 5km from the college, which makes it super tiring to do anything before or after college. (considering the curfew is 7am (at least it was when I was there) to 630pm)\n\nI was in the hostel dec 2020 - may 2023 so here's what I thought.\n\nFood: There are induction stoves on two floors and it's a little unclean but you can cook whatever you want at whatever time (provided you have the utensils and groceries obviously). The food cooked in college is sent over to us as the four time meals. It tastes decent, but gets annoying when the warden yells at you for talking or using your phone in the mess. It fully depends on her whims, and a lot of people try very hard to suck up to her. It's exhausting to care about trying to please the warden when you have so much else to do. \n\nLiving: Four people in one room felt a lot more cramped once I got OUT of there but while living there it wasn't that horrible. The washrooms have lines for each stall in the mornings because everyone wants to get ready at the same time and only a handful of the toilets work at a time. You can avoid this by waking up super early I guess. Same goes for the bathing areas. \n\nStudying: This feels the worst because of the curfew and attendance bullshit. The study rooms have limited number of tables, the wifi is decent but it cuts out every time there's a power failure, you don't have any silent areas if you want to give tests/interviews (I think this is worse now because the warden seems to be trying to shut down any hostel group chats) and there's an attendance that you need to go down and give at 630 which has a loud bell ring. Also, the curfew makes it so you can't even stay at college or go anywhere else after college. \n\nEnvironment: The warden told me that her reasoning for the crazy rules was safety concerns because of the \"drunk\" construction workers right outside and the security cameras being handled by men inside. Seems insane to police our clothing inside the hostel by telling us it's because men are watching us, but whatever I guess. I also think the area nearby is really dirty. You have to walk past a lot of garbage to get to any grocery/stationery/fast food place etc. nearby.\n\nI'd advise you to stay at the hostel for maximum one year to meet PESU people of your batch and then shift to a PG like VSR or something with them.\n└── okay got it thanks a lot for the reply"
    },
    {
      "id": "l5uysdb",
      "body": "boys hostel is chill af, we have so much fun, idk about you people..."
    }
  ]
}