{
  "id": "1d12sz1",
  "title": "How to access schedule ",
  "content": "I got cse in rr campus but I have no idea where to get my books from, when will the classes start, when do I need to shift in hostel and a lot more questions.. Can anyone help me in this issue please ",
  "metadata": {
    "root_comment_id": "l5r16pr",
    "post_id": "1d12sz1",
    "author": "Lumpy-Breath4671",
    "url": "https://www.reddit.com/r/PESU/comments/1d12sz1/how_to_access_schedule/",
    "permalink": "https://reddit.com/r/PESU/comments/1d12sz1/how_to_access_schedule/",
    "score": 0,
    "upvote_ratio": 0.5,
    "created_utc": 1716734359,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "l5r16pr",
      "body": "I think it's better you ask this in your respective WhatsApp groups or Discord server, so as to get a more faster answer"
    },
    {
      "id": "l5r6ufw",
      "body": "Classes, shifting to hostel, etc are usually informed by email. The first date of classes is usually in the first week of August.\n\nRegarding books - nobody buys books here since these are pretty expensive and are useful for 4 months in a year at most. You can find soft copies of all the books on PESU Media. Check the FAQs for links to syllabus and notes: [https://bit.ly/pesu-faq](https://bit.ly/pesu-faq)\n\nAnd as someone commented, join the Discord server/WhatsApp groups and ask there. Most of PES runs on discord, so ideally you would want to join it sooner or later."
    },
    {
      "id": "l5ra3sy",
      "body": "There's still a very long time till your guys' college starts, why are you all so worried, just enjoy your summer vacation, after this all your summer vacations will be packed with something or the other  \nYou'll figure all of this out before college starts\n└── Yeah ik that, it's just that this is all new for us, I wanna join a few classes basically extracurricular but i have to pay in advance so I just wanted a rough idea of when the classes will start\n    └── August first week is the earliest you can start"
    },
    {
      "id": "l5sbft1",
      "body": "It wont start earlier than August as even 2nd and 3rd year doesn't start till then so chill out. It would be next level clownery imo if they started before August\n└── I have got CSE AIML in EC Campus this year through PESSAT. My first sem will be the physics cycle or the chem cycle? I'm asking coz I feel like I haven't reALLY DONE 11th and 12th PCM that well and should revise the relevant stuff before 1st year begins.\n    └── It would be fairly easy compared to 11th 12th no need to revise\n        └── My name starts with an A, middle name with a R and last name with a T. Any idea if I get the physics cycle first or chem? Btw, thank you for the help.\n            └── U will get chem cycle section A or B most probably"
    },
    {
      "id": "l5tnjec",
      "body": "All you'll need is a single 5-subject notebook. Textbooks are not required. You can either borrow them from the library at F-block or use their PDF versions. There are slides for all the lectures which is the primary way many study for ISA & ESA here. The next semesters begins on 5th Aug for current 1st/2nd/3rd year. Yours will be like a week after that. You'll get the relevent notification soon enough\n└── Alright thank you soo much\n    └── no problem. join this discord server - https://discord.com/invite/bDqj5bEWez . It has materials for all sems and all branches. You'll find another post for the invite link for PESU Discord. These 2 are enough to have all your future doubts cleared"
    }
  ]
}