{
  "id": "1d1nbvs",
  "title": "Pes boards requirement?",
  "content": "Today i inquired some admissions officer on information on management seat in pes rr campus . She said that i wont get a seat as my pcm aggregate is not above 80%. Is this true?",
  "metadata": {
    "root_comment_id": "l5v6jsd",
    "post_id": "1d1nbvs",
    "author": "Reso_28",
    "url": "https://www.reddit.com/r/PESU/comments/1d1nbvs/pes_boards_requirement/",
    "permalink": "https://reddit.com/r/PESU/comments/1d1nbvs/pes_boards_requirement/",
    "score": 3,
    "upvote_ratio": 0.7200000286102295,
    "created_utc": 1716800698,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "l5v6jsd",
      "body": "Nah, maybe you spoke to the wrong person\n└── defo not the wrong person but for CSE the criteria might be 80%\n    └── Dude I visited the campus offline, no-one told me about this criteria. Me myself don't have 80 still they were offering me the seat through management quota."
    },
    {
      "id": "l5v7lyz",
      "body": "You asked for a management seat I think. For management seat it’s that criteria\n├── I cant find any information about it online and another person says its false\n│   └── For management, it is true\n│       └── Could you show me a source or where it says that please\n│           └── my cousin took management seat. It is on it\nOnce you pay ₹12lakh(CS), you will receive a letter and it will be on it\n└── Yo I was in the campus for counseling, I got a seat but not in my favourable branch. Dad asked them if we can upgrade via management seats, and while enquiring, there was not a single word about boards score."
    },
    {
      "id": "l5v8l3e",
      "body": "\n\nIt's above 80% if you're looking for a management quota seat, if you're looking for a PESSAT seat then I think it's above 70% or 60%, I don't remember"
    },
    {
      "id": "l5vsnv0",
      "body": "For admission through pessat, I think boards criteria us 60% something.  For management quota (I enquired), it's 80% PCM aggregate. They actually calculate it (I was there when they did it).\n└── There goes pes out of the window . Thanks anyway\n    └── I also visited PES for management seat, told them I have 68 percent pcm aggregate the lady was like let me talk to admissions manager came out in 10seconds and was like I spoke to sir and convinced him but only if you pay fees today itself, we told okay and left cause I got VIT CSE Cat2"
    },
    {
      "id": "l5wc4c9",
      "body": "my mqmt friend told it was 90%, damn they reduced it, crazy"
    },
    {
      "id": "l5x296m",
      "body": "I got 72% in boards, 70% in pcm and I got management seat so\n├── same\n└── Which year was this?\n    └── Last year"
    },
    {
      "id": "l5zbvsd",
      "body": "macha it depends. I had interest in mechanical but missed it by a few ranks in round 1. Im sure ill get in round 2 but just incase i went and blocked a management seat. I had an aggregate of 66% in pcm but i still got the seat without paying anything. Just go to the college and inquire once, it may differ from branch to branch\n└── Others in the comments are saying that 80% is needed and pes is in the complete opposite side of bangalore with respect to my house , so it will be a huge waste of time and money if i go there and they tell i aint elligeble"
    },
    {
      "id": "l5zxuxh",
      "body": "Mgmt cse 2020 admit here, for me the cut off was 75%"
    }
  ]
}