{
  "id": "1d2ewd4",
  "title": "How is EEE at PESU RR",
  "content": "can any senior give an unbiased, honest review of the course? What are its pros and cons?",
  "metadata": {
    "root_comment_id": "l618c9j",
    "post_id": "1d2ewd4",
    "author": "Bwoah_06",
    "url": "https://www.reddit.com/r/PESU/comments/1d2ewd4/how_is_eee_at_pesu_rr/",
    "permalink": "https://reddit.com/r/PESU/comments/1d2ewd4/how_is_eee_at_pesu_rr/",
    "score": 4,
    "upvote_ratio": 0.8299999833106995,
    "created_utc": 1716886542,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "l618c9j",
      "body": "Worst\n└── can you please elaborate?"
    },
    {
      "id": "l61esau",
      "body": "In short, if you're getting electrical in RV or BMSCE please go for it because the labs and faculty are a little better. \nWhen it comes to core branches PES doesn't have a lot of good faculty. Most of the good professors have left. \nIf your interest doesn't lie in core electrical and you want to pursue something related to embedded systems/signal processing then there are few professors who are extremely good and have a lot of experience. \nOr if you're interested in just using your btech eee degree as an opportunity for placements in computer science then PES is the perfect place. Spend time learning your DSA and OS from your second year itself. Start applying for internships in your third year and you'll be in a good place. \nAll in all it's a pretty safe option. \n\n(The above is for students going through CET. If you're going for a management seat or through pessat I'd recommend not to go to PES EEE because it's not worth that much money.)\n└── can i DM bro?\n    └── Sure man"
    },
    {
      "id": "l61maio",
      "body": "Hi, I graduated from the EEE program in 2022. If you get a better option, go for it. It's a very toxic environment with not a lot of importance to things like education. Most professors are tired and unwilling to help students who want to learn. If you decide to go, never do research under anybody else but Dr. Rex or Dr. Rangan. They are the only people with ethics in the department."
    },
    {
      "id": "l6gowv4",
      "body": "Meh"
    },
    {
      "id": "l6q672s",
      "body": "\n\nHere's a different take. Your experience with EEE at PES is highly dependent on your peers. They can make or break your experience. If your peers are motivated to be job-ready and learn essential future skills, we have excellent professors in Power Electronics, Embedded Systems, Control Theory, Signal Processing, and more, who will go out of their way to teach you.\n\nYou'll gain a lot from the numerous projects and assignments. As with any department in any college, you'll encounter a few bad apples and some dirty politics. However, in my opinion, we're still a better group compared to the batches at BMSCE or DSCE. RV may be better, though.\n\nAdditionally, we have many excellent technical clubs that will help you make the most of your degree. If you're someone who doesn't follow the crowd and is dedicated to honing your craft, PES is definitely a great option.\n\nOn a sidenote, now and the next years batch I recommend people to join only because some of the good professors are planning their departures soon."
    }
  ]
}