{
  "id": "1d4zz80",
  "title": "Can somebody once and for all compare the research internships at pes. ",
  "content": "I got into isfcr, cdsaml, and IEEE. \n\nAll of them are domains I am interested in. I'd probably enjoy them equally. But I'm more concerned about the guides and teachers. Anybody with any past experiences? \n\nI didn't really like the way the isfcr teacher took the interview so not really favouring that as of now. But does anyone have any other opinions and experiences ",
  "metadata": {
    "root_comment_id": "l6itbed",
    "post_id": "1d4zz80",
    "author": "Annie_Rection__",
    "url": "https://www.reddit.com/r/PESU/comments/1d4zz80/can_somebody_once_and_for_all_compare_the/",
    "permalink": "https://reddit.com/r/PESU/comments/1d4zz80/can_somebody_once_and_for_all_compare_the/",
    "score": 12,
    "upvote_ratio": 0.9300000071525574,
    "created_utc": 1717173506,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "l6itbed",
      "body": "You cannot compare across different research internships like that because they're all focused on different fields and have a separate set of profs that run these. You can't say CDSAML > ISFCR or vice versa because there are no objective parameters here to rank. Research is driven entirely by subjective parameters. What's interesting to you might not be to someone else. \n\nAny form of research should be primarily and solely guided by research goals and interest. You should choose the one which aligns with *your* research goals. Which field are you more inclined towards? What kind of problems do you want to solve? Which field makes you wonder more about? Which field do you want to dive deeper into and get your questions answered?\n\nYou don't pick a research internship by doing inky pinky ponky. Sit down, review the problem statements and projects these labs are working on. See which one resonates most with your interests. Review the profs, see which ones are heading which projects and review their past work in the same field. Finally, pick the project in the lab where (1) your research interest, (2) the prof's research interest and (3) the lab and/or project's goals all align.\n└── Yeah that's what I mean. I'm not really particularly interested in one of them. They're all topics which are nice. \n\nI just want to know about how the teachers are, and what exactly you do differently in the internships. Especially the IEEE one\n    └── It's a research based internship, which means just like Capstone you'll be pursuing research. Most of the summer will go on studying papers, analysing approaches, figuring out a viable new solution and coming up with a hypothesis. Usually, this is all you'll get to do before the internship ends, since its a pretty short period. \n\nMost students during these summer research internships just work on the literature survey and at most come up with the base approach. At this point the summer has ended + kids realise they don't want to do research or work on this project, so they tend to drop it. The people who actually end up publishing are those who continue to work with the lab even beyond the summer break on iterating through new ideas, analysing results, drawing conclusions etc etc. \n\nRegarding profs, you would've been assigned a project and/or prof for each of these right? Maybe list them here and if people know they can give their opinions on them. Although as I said in my original comment: you should pick the problem statement that interests you the most.\n        └── Thanks for the help. \n\nAnd what is the criteria to get the credits. Does everyone get them for participating? What about a stipend? \n\nYou said you were in cdsaml in another comment didn't you. Did you personally feel like it was worth your while\n            └── Lol dw, feel free to ask questions. \n\nEveryone gets credits as long as they meet the requirement, which is 3 weeks of work = 1 credit. So if your summer internship is 6 weeks, everyone who works for all 6 weeks gets 2 credits. I am not aware of a stipend, best to ask your prof. \n\nI was in CCBD, not CDSAML. They used to function as different research labs and CCBD used to have higher research output back then. My experience was great, as I've stated in my other comment. Working with KVS was pretty fun and also helped us learn a lot more through the project. He was a great prof alongside being a good research advisor, one of the last few profs at PESU who cared about his students. Plus as I said, it opened up opportunities later like TAships and referrals for both industry and Masters. Although we hit a roadblock on our actual project, the internship was still pretty great. Additionally, the CCBD community is really good too. There's a large community of past (and maybe current) members who meet up once in a while and even sometimes step in to help the CS department with related courses like Big Data and so on by suggesting changes to curriculum, showing up for guest lectures and even holding bootcamps. Unfortunately my work has kept me busy over the last year so I haven't really been able to turn up to any of these, but I do see the pictures that get posted and it brings a lot of FOMO lmao.\n\nTo summarise, my experience was great, but it was also because I had an interesting project and a great advisor. Definitely worth it if these align for you.\n                └── Thanks a lot dude it really helps\n\nThe isfcr teacher acted really strict in the interview. And she was literally addicted to mentioning that I won't get the 2 credits unless our paper gets published or something. Like dude, I got it the first 5 times you told me. \n\nDon't know, just didn't give me a good feeling. Ccbd it is then\n                    └── Sure, happy to help. \n\nAlthough I would still recommend finding out the prof and project before making a decision.\n\nGood luck!"
    }
  ]
}