{
  "id": "1d6448f",
  "title": "Comparing MIT Manipal/RVCE/PESIT",
  "content": "Here are my options\n\n1. MIT - Core CSE (merit list not yet out, but I am confident) \n2. RVCE - Computer Science with DS\n3. PESIT - Computer Science EC Campus\n4. PESIT- Computer Science AI/ML - RR campus\n\nthe options in Bangalore are via kcet, so fees are low. How would people rank this?\n\n\n\n",
  "metadata": {
    "root_comment_id": "l6pxzlc",
    "post_id": "1d6448f",
    "author": "Ok_Western_6701",
    "url": "https://www.reddit.com/r/PESU/comments/1d6448f/comparing_mit_manipalrvcepesit/",
    "permalink": "https://reddit.com/r/PESU/comments/1d6448f/comparing_mit_manipalrvcepesit/",
    "score": 5,
    "upvote_ratio": 0.7799999713897705,
    "created_utc": 1717298488,
    "flair": "PESSAT/Admission",
    "nsfw": false
  },
  "comments": [
    {
      "id": "l6pxzlc",
      "body": "Whats your score in manipal if you dont mind\n└── 165 in MET"
    },
    {
      "id": "l6pye71",
      "body": "Take rvce cs related branches placements are same in cs core. Last year placement were quite good. Only problem with manipal here would be fee issue. \n\nRv cs related branches> manipal cs core\n└── Why exactly is rr campus aiml >> ec campus according to you?\n    └── He is getting cs related branch at main campus, which is way better than getting cs at ec campus. If he was getting ece at main campus then cs at ec campus would be better. From what I have heard from my friends here, ec campus isn't that great, they regret choosing it even being at cse branch( but didn't have any choice).\n        └── It is not worse by any means. I've spent a year at both. Everything is identical. \n\nThe classrooms are identical, the teachers are equally bad. The syllabus is identical and the exam papers are the same and are written at the exact same time. \n\nThe only thing lacking is infrastructure. And not by much either. Ec campus has a pretty good mrd block. \n\nThere's only one reason the cutoffs for both campuses differ so much: 12th graduates aren't known for their best choices\n            └── Ok, if he wants to choose ec campus I got no problem. I just gave my review on it. \n\nAnyways he would choose top 2 options only most likely they're better than 3rd and 4th option"
    },
    {
      "id": "l6pz2vw",
      "body": "If fee is a concern\n\n2>3>=4>1\n\nIf money is no object\n\n2>=1 > 3>=4"
    }
  ]
}