{
  "id": "1d665mk",
  "title": "Got 4k in KCET & around 800 in ComedK. Which is better for CSE? ",
  "content": "PES CS (EC) (kcet), DSCE (CS) (comedk/kcet- only cs specializations), BMSCE (CS) (comedk) or Amrita (CS) ?  \nPreferably want CSE only-  \n",
  "metadata": {
    "root_comment_id": "l6qbe7f",
    "post_id": "1d665mk",
    "author": "Scarlet_Pirate6174",
    "url": "https://www.reddit.com/r/PESU/comments/1d665mk/got_4k_in_kcet_around_800_in_comedk_which_is/",
    "permalink": "https://reddit.com/r/PESU/comments/1d665mk/got_4k_in_kcet_around_800_in_comedk_which_is/",
    "score": 5,
    "upvote_ratio": 0.7799999713897705,
    "created_utc": 1717306257,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "l6qbe7f",
      "body": "Why don't you try rv?\n└── I don't think it's possible to get CS (core) in any round"
    },
    {
      "id": "l6qcet4",
      "body": "Which shift and how much did you score for comedk?\n└── shift 2 (112)"
    },
    {
      "id": "l6qdrt6",
      "body": "Ill say\nPesu(kcet)>bmsce(comedk)>everything else\nBut if you are willing to spend the extra for better college life and similar placements then go for bmsce\n├── Okay thanks!  \nPES through KCET acc to last year is after round 2 although, so not sure about the refund (as its date it july 5), and as: if comedk counselling will get over before kcet then I'd have to fix for bmsce or dsce, and round 2 kcet might be late. So, I'd have to completely skip comedk abd only hope for kcet then. I don't know how all this works-\n└── Why are u downvoted to oblivion lmao"
    },
    {
      "id": "l6qh7og",
      "body": "I'd say bmsce cse is better, don't waste your time on travelling that far. It's exhausting and you won't have the freedom to go and come back from college anytime you want as fast as possible.\n└── Okay, yeah- exactly what I was thinking, thanks.   \nThe only problem is: to get bmsce core cse, ALL rounds have to get over, as last year that's what happened. Plus, comedk fees are higher.   \nHowever, in case of PES EC, last year through round 2, it was possible to get cs. And, here fees are lower."
    }
  ]
}