{
  "id": "1d70ikl",
  "title": "What's the cgpa cutoff for internships?",
  "content": "",
  "metadata": {
    "root_comment_id": "l6x0inq",
    "post_id": "1d70ikl",
    "author": "Icy_Bullfrog6296",
    "url": "https://www.reddit.com/r/PESU/comments/1d70ikl/whats_the_cgpa_cutoff_for_internships/",
    "permalink": "https://reddit.com/r/PESU/comments/1d70ikl/whats_the_cgpa_cutoff_for_internships/",
    "score": 4,
    "upvote_ratio": 0.6700000166893005,
    "created_utc": 1717407711,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "l6x0inq",
      "body": "There is no straightforward answer to this, so I'll just info dump.\n\nThe minimum requirement to sit for internship/placement season is the same: 6.75 CGPA (this could have changed but is usually around \\~7). However, companies might have their *own* CGPA requirements for both the aptitude test as well as interviews. \n\nMost companies have a 7+ requirement for the aptitude test. Some tend to have higher such as an 8+, and a handful have a 9+. If you do not clear this requirement, you won't even be able to give the test.\n\nWhile shortlisting for interviews, companies use a combination of various factors, including your CGPA. So while answering the majority of the aptitude questions does put you in a strong position, having an average CGPA might tank your chances of getting selected for interviews. Some are notorious for picking only 9+ CGPA candidates, while some are slightly more relaxed with an 8.5+. The only way to soften the blow from an average CGPA is by maximising points scored in the aptitude section.\n\n Ideally, scoring an 8.75+ in CS is a safe bet for both aptitude and interviews in 98% of all companies.\n└── All the companies that came for internship this time have not taken anyone less than 9 so far."
    },
    {
      "id": "l77y7op",
      "body": "On campus it's usually on the higher side (8.75-9+) along with a lot of reservations and diversity quota requirements\n\nOff Campus it's just based on your resume and how well you perform in your interviews"
    }
  ]
}