{
  "id": "1d9uo6u",
  "title": "Pls forgive me rowlett owl for his post",
  "content": "Pes ec ece vs mit main ece/cce/ds/mnc\n54xx rank",
  "metadata": {
    "root_comment_id": "l7fx328",
    "post_id": "1d9uo6u",
    "author": "Educational-Guava-71",
    "url": "https://www.reddit.com/r/PESU/comments/1d9uo6u/pls_forgive_me_rowlett_owl_for_his_post/",
    "permalink": "https://reddit.com/r/PESU/comments/1d9uo6u/pls_forgive_me_rowlett_owl_for_his_post/",
    "score": 0,
    "upvote_ratio": 0.5,
    "created_utc": 1717711820,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "l7fx328",
      "body": "Mit cce main campus\nBetter in terms of college life placements everything ig\nExcept location"
    },
    {
      "id": "l7gb3px",
      "body": "mit"
    },
    {
      "id": "l7h8v3x",
      "body": "Why are you afraid of me 😭 \n\nYou're comparing across 5 different branches. Which branch are you actually interested in (regardless of options)?\n├── bro's spreading fear tsk\n│   └── ![gif](giphy|AQbUwg8dAJsEWTo6o9|downsized)\n├── not particularly interested in anything but idk if ill get cs spec at mit at 5k rank. Acc to last yr I should be getting it but where has last yr applied to this yr. If it did id be in nitk lower branches.\n│   └── If you're not particularly interested in anything then you should spend some time figuring out which ones you don't like at the very least because engineering doesn't work like that. \n\nPick the branch closest to the one that matches your interests\n└── Rowley Anna the kids are scared of you omfg"
    },
    {
      "id": "l7hapab",
      "body": "can you atleast list the full forms of the branches at mit. these people have gone insane these days, instead of just increasing the computers seats they have to invent a million \"allied courses\"\n\neither way, go with mit. if interested in elec, take elec. if interested in computers, take an allied branch that sounds the best to you\n\nif you're not interested in either, just take one of those cs allied branches. you will have better future opportunities to make some dough\n└── ty"
    },
    {
      "id": "l7igp31",
      "body": "You shouldn't be afraid of rowlets. They are cute\n├── ![gif](giphy|PV9nVwercTEU72CQ1X)\n│   └── Awwwwwwwww <3\n└── The real rowlet is cuter 🥰\n    └── 😳😳"
    }
  ]
}