{
  "id": "1dav416",
  "title": "Manipal cs core (Main campus) vs Pes rr cse core",
  "content": "Which college will be better in terms of academics as I want  to pursue my masters abroad . What does pes offer in research in terms of publishing papers and working in internships with good organizations. I am aware that the placements are similar in both colleges but due to the rise in intake of students will it have an effect on future batches. Many people have said that manipal has a bad rep due to its supposed illicit activities but doesn't this happen across all colleges like pes in this case or is it not of that magnitude (drugs). ",
  "metadata": {
    "root_comment_id": "l7n6f99",
    "post_id": "1dav416",
    "author": "No_Situation_4276",
    "url": "https://www.reddit.com/r/PESU/comments/1dav416/manipal_cs_core_main_campus_vs_pes_rr_cse_core/",
    "permalink": "https://reddit.com/r/PESU/comments/1dav416/manipal_cs_core_main_campus_vs_pes_rr_cse_core/",
    "score": 13,
    "upvote_ratio": 0.9399999976158142,
    "created_utc": 1717822824,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "l7n6f99",
      "body": "This has been asked multiple times over the past few weeks on this subreddit, as recently as a few days ago. Please search the subreddit next time before making duplicate posts.\n\nHere are the most recent ones:\n\n1. [https://www.reddit.com/r/PESU/comments/1d2c6xi/comment/l5zumuy/](https://www.reddit.com/r/PESU/comments/1d2c6xi/comment/l5zumuy/)\n2. [https://www.reddit.com/r/PESU/comments/1dahl1x/pes\\_ec\\_cse\\_or\\_mit\\_manipal\\_cceit/](https://www.reddit.com/r/PESU/comments/1dahl1x/pes_ec_cse_or_mit_manipal_cceit/)\n\nIn terms of research, its not really a great situation at PES. They do publish but don't expect much support in terms of publishing good quality papers. Most profs here publish for the sake of publishing, with most even forcing you to publish. There are a handful of profs per department who actually care about doing good research. Most research clubs are almost dead and they don't really carry out any meaningful work nowadays. From whatever I have heard from friends at Manipal, there are good opportunities to build your profile as long as people are interested, but you should do your own research from current students.\n\nInternships are solid. You can check past placement records (check the [FAQs](https://bit.ly/pesu-faq)) for them. You will find students interning or working at Apple, Amazon, Microsoft, Google and other companies too.\n\nAnd regarding the reputation, if you are aiming at Masters then neither college has any kind of brand name outside India. If you aren't going to an IIT/NIT/BITS/IIIT/T-1 college, your college falls into the \"other\" category. So reputation wise, they are equivalent. If you do want to pursue a Masters later, then I would suggest Manipal core CS. Although PES alumni have get into top Unis like CMU, UCLA, UCSD, UPenn, Harvard, NYU etc every year, Manipal offers more opportunities and it won't be as difficult as it is at PES.\n\nAlso unrelated and unwanted advice but thinking about Masters even before Undergrad is a stupid move because requirements, plans, goals and everything change over the course of 4 years and a Masters degree relies a lot on these. You should revisit this decision only after your second year once you have an answer to all of these. You will yourself realise that it was too soon to think of a Masters before understanding more about what you want to study.\n└── Thanks for the detailed response!"
    },
    {
      "id": "l7ns8tu",
      "body": "that's some hardcore shit"
    }
  ]
}