{
  "id": "1dce0ru",
  "title": "I am getting cse through pessat in rr campus and cse through kceg in ec campus(fee will be less)",
  "content": "what should I choose?",
  "metadata": {
    "root_comment_id": "l7xaucq",
    "post_id": "1dce0ru",
    "author": "Tight-Common-7247",
    "url": "https://www.reddit.com/r/PESU/comments/1dce0ru/i_am_getting_cse_through_pessat_in_rr_campus_and/",
    "permalink": "https://reddit.com/r/PESU/comments/1dce0ru/i_am_getting_cse_through_pessat_in_rr_campus_and/",
    "score": 14,
    "upvote_ratio": 0.9399999976158142,
    "created_utc": 1717997130,
    "flair": "Club Announcement :snoo_smile:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "l7xaucq",
      "body": "EC cse 100%\nboth campuses are pretty much the same\n└── I'm also getting vit cse, fee will be 4.5lpa and manipal cse fee 5lpa, but parents want me to join pes because of the drug culture in those clgs, what should I do?\n    └── imo still pes, manipal would be better but 5lpa is too much compared to kcet fees, its not worth 15L more"
    },
    {
      "id": "l7xazej",
      "body": "If you don't have any problems with the location, then take the KCET seat at EC Campus. We share the same study material, slides and everything. The teachers are also uhh... equally tolerable. IMO, RR isn't worth the 3.5-ish lakh extra that you'd be paying every year through PESSAT.\n└── I'm also getting vit cse(fee 4.5lpa) and manipal cse (fee 5lpa), but parents want me to join pes due to the drug culture in those places, what should I do?\n    ├── If it is Manipal main campus, only then pick Manipal any day. Convince your parents that you will turn out fine(ish). There are more advantages to picking Manipal at the moment.\n    ├── PES EC. PERIOD. Less fee, basically the same thing as RR.\n    ├── If it is Manipal main campus, only then pick Manipal any day. Convince your parents that you will turn out fine(ish). There are more advantages to picking Manipal at the moment.\n    │   └── but placements wise everyone said pes would be better\n    │       └── As far as I remember, they are pretty similar, or maybe marginally better.\n    │           └── yah like I don't wanna disappoint my parents, so if pes has better placements, I'll go with pes only\n    │               └── A college is not defined only by it's placements, but the overall range of opportunities it provides. I would still recommend Manipal because it simply has more to offer, both from an academic as well as non-academic standpoint. \n\nThe end decision is up to you as always, but before you make a final decision, I'd suggest reading through all the past posts on this subreddit from the last few days where there have been extensive comparisons between Manipal and PES.\n\nGood luck.\n    │                   └── alright thank you\n    └── If it is Manipal main campus, only then pick Manipal any day. Convince your parents that you will turn out fine(ish). There are more advantages to picking Manipal at the moment."
    },
    {
      "id": "l7xbchd",
      "body": "Easy choice: EC Campus CSE through KCET. Save yourself the \\~3L every semester.\n\nQuoting my other [comment](https://www.reddit.com/r/PESU/comments/1daq7pd/comment/l7n7onf/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button):\n\n>But to summarise, they are objectively as good as RR: same degree (campus is not mentioned on degree), same placements, same syllabus, same tests/exams and unfortunately also similar quality of average faculty. The only things different about the EC campus are subjective ones: smaller fests, not as fancy a campus as RR (but this is also because RR's current iconic building was constructed only a year ago and is brand new), and fewer clubs. However, it also has a couple of advantages over RR being a more spacious and open campus and a significantly better tech culture and CS clubs.\n\nFor more information, you can find a detailed comparison between the campuses on the [FAQs](https://bit.ly/pesu-faq)."
    },
    {
      "id": "l7xbqdp",
      "body": "KCET SEAT!!!!\n└── placement wise both are same no, just based on our cgpa and performance right?\n    └── s"
    },
    {
      "id": "l7xcqco",
      "body": "I had the same choice a few years back and took CSE in ec campus. I have no regrets so far.\n└── placements wise, are both the same?\n    ├── like if I maintain a good cgpa and perform well, can I expect 15+ lpa when I graduate?\n    │   ├── Yes, if everything goes well\n    │   │   └── But luck also plays a factor in placements\n    │   │       └── luck? how exactly?\n    │   │           └── Some people have it a lot easier in interviews and some have it harder\n    │   └── Highest CGPA != better package. \n\nThis is a wrong misconception. The students who bag the best offers are often not the ones who have the highest CGPA but rather the ones who prove that they actually have industry ready skills that companies are looking for, alongside good research and/or work experiences. They are students who show that they are way more than their CGPA.\n\nA good CGPA only opens up doors. Its up to you to walk through them.\n    │       └── yah alright, performance then, noted, so in ur pov, there's no difference between ec and rr campus, only individual capabilities rught?\n    │           └── Yes. Choose EC and save money\n    └── Yep, although people will tell that companies are biased towards rr campus, it's not true and just appears that way since rr has more people with cgpa 9+\n        └── oh alright makes sense"
    },
    {
      "id": "l7xgejd",
      "body": "strongly recommend ec cse."
    },
    {
      "id": "l826pdf",
      "body": "get EC campus, study hard and shift yourself to RR, hard meaning 10 sgpa in either one of the 2 semesters of first year"
    }
  ]
}