{
  "id": "1depvuf",
  "title": "Seeking Advice: Is Offline University Experience at PES Truly Beneficial?",
  "content": "Hey everyone,\n\nI hope you're all doing well! I'm currently at a crossroads and need some honest advice, especially from those who have been studying at PES for over a year now (second, third, and fourth-year students).\n\nGiven the current scenario, I'm wondering how much attending university offline actually benefits you, particularly if you're planning to pursue further studies. I've been contemplating whether it's worth moving from Pune to Bangalore for PES or if I should focus on online learning instead.\n\nNowadays, platforms like Coursera and Udemy offer courses taught by top-tier professors from institutions like Stanford and Harvard. It makes me question the necessity of strict attendance, practicals, and assignments when I could potentially learn the same (or even more) online. Plus, learning from home would give me more time to build my external profile.\n\nSo, here are my questions for you:\n\n1. How much value do you feel you're getting from the offline university experience at PES?\n2. For those of you planning to pursue higher studies, do you think the offline experience at PES has given you a significant advantage?\n3. Is there any part of you that feels you could have achieved the same or more by studying online and staying at home?\n4. How big a role is PES playing in your education and personal growth? Do you think it's worth the move from Pune to Bangalore?\n\nI appreciate your insights and experiences. Your feedback will be incredibly valuable in helping me make an informed decision.\n\nThanks in advance!",
  "metadata": {
    "root_comment_id": "l8donyw",
    "post_id": "1depvuf",
    "author": "Disastrous_Memorry",
    "url": "https://www.reddit.com/r/PESU/comments/1depvuf/seeking_advice_is_offline_university_experience/",
    "permalink": "https://reddit.com/r/PESU/comments/1depvuf/seeking_advice_is_offline_university_experience/",
    "score": 3,
    "upvote_ratio": 1,
    "created_utc": 1718250842,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "l8donyw",
      "body": "In India, there is no replacement for an offline degree. It may sound harsh, but recruiters won't take an online degree seriously.\n\nI’d suggest you to go with a B.Tech. Also in India, skills and degree don't go hand in hand, so anyways you’d be required to upskill yourself on your own no matter which degree you pursue.\n└── No, like I'm talking about taking an offline degree in Pune , in which the college I will take doesn't have good professors and doesn't require strict attendance. So basically I would do the learning part at home, but he's degree would be offline btech cse only in both cases....\n    └── what's the college if you don't mind sharing?\n        └── VIT PUNE, Bibewadi or MIT WPU.\n            └── what are you getting at all three of them? at vit, wpu and pes?\n                └── Cse in all three.\n                    └── not worth looking into wpu then. either go for pes or vit. both are decent enough options. offline is almost certainly always better than online. your overall development matters too not just academics."
    },
    {
      "id": "l8e52qf",
      "body": "Let me try to answer these as a working professional (alumnus of PESU ECC): \n1. The value of an offline degree is in the connections you make with people. At PESU Bangalore, you will get the opportunity to meet several really smart people that builds your network. You learn a lot from other students in that environment, rather than the faculty. This is a highly underrated and powerful advantage.\n\nOn the other hand, yes, PESU does not give you time to do anything else. Very strict about attendance and deadlines. So your actual skills will probably not be as great as if you took online courses. At the end of the day, it's the hard work and practice you put in.\n\n2. PESU is considered a Tier 3 college by any country/university. So ideally you should aim for Tier 2+ colleges to increase your chances for higher education. Research is not great at PESU, but the curriculum is pretty relevant and up to date. Most foreign universities will look at your research contributions and publications, alongside your GPA. PES makes it pretty hard to get a good GPA. \n\nThere's no real advantage, but my friends and I are all going for higher studies abroad with no issues. Some even in Ivy League universities.\n\n3. Of course you have the ability to learn more and upskill yourself on your own, IF your are disciplined enough. There isn't much use of the curriculum in practical work scenarios, it just provides solid foundational knowledge across multiple domains. It's up to you to dive deep and build your skills, and most professors, seniors, alumni would be glad to help. \n\n4. If you're planning to work in tech, moving to Bangalore is the right choice. Not really about the college. But yes, you will learn a lot more in the environment at PES than in Pune.\n\nPersonal growth: \nWell college is a place where you mature a lot over the course of 4 years. If you have the unfortunate experience of dealing with PESU management, then you will know the worst of humanity and can easily appreciate and get along with any person in any company/university you join in the future.\n\nAlways happy to help :)"
    }
  ]
}