{
  "id": "1dfgktu",
  "title": "Pes (ec) vs Dayanand Sagar.",
  "content": "Which would be better?\nCse in pes ec or cs spec in Dayanand Sagar?",
  "metadata": {
    "root_comment_id": "l8j1ees",
    "post_id": "1dfgktu",
    "author": "jalagara_",
    "url": "https://www.reddit.com/r/PESU/comments/1dfgktu/pes_ec_vs_dayanand_sagar/",
    "permalink": "https://reddit.com/r/PESU/comments/1dfgktu/pes_ec_vs_dayanand_sagar/",
    "score": 1,
    "upvote_ratio": 0.6700000166893005,
    "created_utc": 1718332883,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "l8j1ees",
      "body": "Cse in pes ec and it's not even close\n├── But cutoffs of dayanand sagar is greater tho\n│   └── Is it now?? When I joined pes ec cse had a greater cutoff\n│       └── Yep\nHow's the ec campus?\nI saw the rr campus nd it's huge\n│           └── Lot fewer buildings but more open space\n│               └── Ohh thanks!\n├── Should I choose cse aiml in pes ec or ise in dsce or cse aiml rr(Pessat)\n│   └── Choose PES over DSCE. There is no difference between the campuses so choose the cheaper mode of admission.\n│       ├── Ok thanks!\n│       └── Asking for my friend \nMy friend got 7xx in kcet should he choose pes cs or rvce cs spec\n│           └── Both are pretty comparable IMO. RV does have better placements but I don't think it's by much. Pick RVCE only if you think the difference in placements is worth skipping out on core CS.\n└── Need help, is dsce that bad? Pes is situated outside the blore right? The campus surrounding is better at dsce ig, does teaching really matter? Is there a really big difference in placement?"
    },
    {
      "id": "l8j4cwf",
      "body": "Man compared biryani to pulao\n└── Bruh is dayanad sagar that bad?💀\n    └── I have another option that is bms iot cybersecurity \nOr Ms ramiah cs with business system \nWhat to choose?😭\n        └── Honestly, neither. PES CS is much better than these specialisations"
    },
    {
      "id": "l8j541a",
      "body": "![gif](giphy|pRh2jqZ63EAK4P0BjH)\n└── Ayo😭"
    },
    {
      "id": "l8jac1x",
      "body": "bro whats wrong with you? cutoffs are similiar coz pes has wayyy more seats\n└── So i should choose pes?\n    └── upto you, dayanand is chiller if that matters\n        └── Doesn't matter much tbh\n            └── How's the crowd at ec?"
    },
    {
      "id": "l8jbhxl",
      "body": "im in same dilemma \ni know pes ec is wayyyyy better than dsce \nthe thing is i live 2 mins away from dsce and pes ec is 16kms from my place and i dont wanna go hostel\n└── Not worth sacrificing a better college just because its convenient to travel to a worse one. There are people at PES who travel 1.5 hours one-way on a daily basis.\n    └── also pes through pessat and dsce through kcet"
    }
  ]
}