{
  "id": "1dh9cw6",
  "title": "How many backlogs can one person have? ",
  "content": "Just as the title says, how many backlogs can someone have? I enrolled but I went through a surgery and didn't really go to college. Missed through my first year classes and exams and rarely met my professors, I can't contact COE. I tried emailing and calling but no one responded. I can't go in person cuz I'm still recovering and I got no family that I talk to. I can't afford to restart the whole thing again. I'm supposed to write first semester backlogs in July. Since I haven't fully recovered, I was thinking if I could write this later? Since I have two semesters with 12 subjects ( 5 subjects+ lab). And when do they usually held exams in July?",
  "metadata": {
    "root_comment_id": "l8vawdq",
    "post_id": "1dh9cw6",
    "author": "Antique-Guava-7293",
    "url": "https://www.reddit.com/r/PESU/comments/1dh9cw6/how_many_backlogs_can_one_person_have/",
    "permalink": "https://reddit.com/r/PESU/comments/1dh9cw6/how_many_backlogs_can_one_person_have/",
    "score": 12,
    "upvote_ratio": 1,
    "created_utc": 1718549838,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "l8vawdq",
      "body": "Yih can have a maximum of 24 backlogs or 22 if I am not wrong, if it exceeds that then you won't be able to attend the next semester\n└── So is it okay if I sit for only the main 4 exams and sit for the lab and 1 credit in dec? When do the exams usually start in July? Is there any other way I could earn those credits if not for backlogs?\n    └── You can clear the backlogs whenever you wish to, but remember that backlog exams are held only at certain points in the year and you cannot have more than 22 or 24 credits in backlog. And you have to clear the backlogs since they're required courses. \n\nYou can check the FAQs for more details on backlogs, when they can be cleared, etc.\n        └── Thanks but does anyone know when the exams usually start in July?\n            ├── Best to ask the COE.\n            │   └── Can't visit him atm, I've sent an email and tried calling him, but no one respond\n            └── Applications are open right now. They close on the 28th. I think dates will be announced sometime next week.\n                └── Well they uploaded a draft timetable last night\n                    └── That isn't for engineering, assuming you're an engineering student.\n                        └── No I'm not\n                            └── That's fair."
    }
  ]
}