{
  "id": "1dhywn7",
  "title": "Pes over bms/msrit?",
  "content": "Hey guys, so I have the following options: pes cse(pessat),bms/msrit(comedk) and some new iiits like sricity kottayam etc. Do you think pessat fees is worth it choosing over comedk fees considering that I am ready to grind at college and be in top 20% and so spend 3-4 lakhs extra on pes over bms. \n#P.S: Ik pes is hectic and it probably wont affect me much coz I survived in Narayana/Sri chaitanya for 2 long years\n",
  "metadata": {
    "root_comment_id": "l903orq",
    "post_id": "1dhywn7",
    "author": "Severe-Mission1166",
    "url": "https://www.reddit.com/r/PESU/comments/1dhywn7/pes_over_bmsmsrit/",
    "permalink": "https://reddit.com/r/PESU/comments/1dhywn7/pes_over_bmsmsrit/",
    "score": 18,
    "upvote_ratio": 0.9599999785423279,
    "created_utc": 1718633111,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "l903orq",
      "body": "yo bro i have like similar choices for colleges can i dm u?\n├── Yaa sure\n└── can i dm u too?\n    └── yessir hmu"
    },
    {
      "id": "l907goo",
      "body": "If you spent 2 years in coaching ull be way more than good in PES. If you care majorly about placements , peer group and academics then i'd recommend going for PES ... Also what branch are you getting? Just asking out of curiosity\n└── Thanks, cse at rr campus( I am actually inclined towards cs, I might even get ece at rv but not considering it atp)\n    └── branch > college anyday and considering rv and pes , cse would be a better option if ur interested too\n        └── Ya thats the reason I am inclined towards pes. My friends still suggest me to take rvce ece coz of the RV tag\n            └── The RV , PES tag are all very relevant in Karnataka , but ur CSE tag will be more relevant to companies , especially since both the colleges are next to each other ( RV being first and PES behind it )"
    },
    {
      "id": "l91na81",
      "body": "It doesnt always work out as you imagine bro , I have a friend who grinded two years in chaitanya and got 95 something percentile in jee mains and got burnt out and performed averagely here . Its very hard to put consistent ,daily efforts for 6 long yrs which you will be required too to be in the top 20% . If i was in your place I would have taken bmsce for the almost similar placements , Leagues better college life , Spending 3-4 lakhs  extra compounded over 4 yrs is a difference of 12 lakhs ,trust me the diiference in placements b/w pes and bms is not worth 12 lakhs and all especially considering the immense competition due to the humongous intake\n└── Bro thank you so much for ur reply. So even I was thinking of joining bms at starting considering the fact that there is almost 8 lakhs difference in fees b/w pes and bms(without scholarship). But the problem is that most of the bms Seniors I have talked to have told that the placements are too bad atp at bms and also the syllabus is quite outdated as compared to pes and even at bms cse related branches intake has crossed 1000 mark and also there's a lack of coding culture over there\n    └── hmm So you want quality Education too means eyes closed Pes University is the better choice. placements wise the two colleges are almost same only I would say similar companies only visit after that it's upto you to crack the companies. The placements are down every where cuz of the recession which I'm sure won't be the case when you come to 4th year."
    },
    {
      "id": "l9l00tp",
      "body": "Following"
    }
  ]
}