{
  "id": "1disdtu",
  "title": "Reaching out to all the seniors who are living in the girls hostel , is there really 4-6 room sharing? Because it's really putting me on the spot and thank you for making time to answer this!!",
  "content": "",
  "metadata": {
    "root_comment_id": "l961zit",
    "post_id": "1disdtu",
    "author": "Striking-Midnight759",
    "url": "https://www.reddit.com/r/PESU/comments/1disdtu/reaching_out_to_all_the_seniors_who_are_living_in/",
    "permalink": "https://reddit.com/r/PESU/comments/1disdtu/reaching_out_to_all_the_seniors_who_are_living_in/",
    "score": 7,
    "upvote_ratio": 1,
    "created_utc": 1718721834,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "l961zit",
      "body": "if you’re asking about EC Campus then yes, it’s 4 and 6 sharing. \n\nthe rooms itself aren’t that bad but it’s the warden that put me off. she’s extremely strict and micromanages everything. \n\njust vacated hostel today and had the best feeling ever :))\n\nps: the male warden is pretty chill, it’s just bad for girls\n├── Pandu FTW!\n│   └── I've not even come to college and already I know Pandu be iconic fr , stan Pandu\n└── Thank you so much!! Then looking for pg's nearby would be better I guess?\n    └── 100%"
    },
    {
      "id": "l99mck0",
      "body": "Would you recommend looking for pg's then? Because the review for the girls hostel has not been good"
    },
    {
      "id": "l9feobt",
      "body": "I would say don't straight away go to pgs in your first year of college, you can stay at the hostel,  I know the hostel is bad (in terms of warden and stuff) but you will get to know many of your classmates and other people.\nAnd then maybe you will find like minded people with whom you can shift to a pg or maybe to a flat in the upcoming clg years.\nIf you straight away shift to pg in your first year,  you will have less exposure to people from your college. Staying at hostel always helps you in one or the other way during your initial days, be it about the academics or other stuff, especially if you are new to the city."
    }
  ]
}