{
  "id": "1ditmvj",
  "title": "Mit Blr copium💀",
  "content": "",
  "metadata": {
    "root_comment_id": "l967kbs",
    "post_id": "1ditmvj",
    "author": "Heavy-Yogurt8693",
    "url": "/r/Manipal_Academics/comments/1dios3x/my_visit_to_mit_blr_today_met_rank_31xx/",
    "permalink": "https://reddit.com/r/PESU/comments/1ditmvj/mit_blr_copium/",
    "score": 12,
    "upvote_ratio": 0.75,
    "created_utc": 1718724972,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "l967kbs",
      "body": "the reality is that nobody on earth cares\n\nas long as you're not from a top iit, nit, iiit. or from a well known private college like bits or vit (only popularity), nobody gives two shits where you're from. \n\njust get over yourself and actually look towards the future"
    },
    {
      "id": "l96gubj",
      "body": "Yup but the comments reflect that only op was delusional.  The rest of us, weren't. "
    },
    {
      "id": "l99q0ej",
      "body": ">The students emphasized that MIT BLR is already considered one of the top colleges in Bangalore. When I compared it to PES, they were confident that MIT BLR is a superior choice\n\nI see that the stock from Manipal has reached Bangalore. \n\nWhat a fucking clown-ass take. Campus built a few years ago, zero placement statistics and the best they have are student internship stats at local startups. Everyone knows that the only reason kids are choosing MIT BLR is because they did not get CS/IT/CCE etc at Manipal Main, its a campus filled with main campus rejects.\n├── It's funny you say this but legit sub 100 rankers met are also in campus, there are lots of sub 5k rankers in mit blr simply cause either their parents didn't allow them to leave blr or they themselves don't want to leave blr, generalising is just a stupid idea\n│   └── Just because a few kids gave up CS/CS-allied branches at Manipal main just for Manipal BLR, it does not invalidate any of my points. Your campus will still play second fiddle compared to main campus. Whatever may be their reason, even you cannot argue about the demographic of the MIT BLR campus is primarily composed of main campus rejects.\n│       └── I mean all of this is just speculation till the placement stats come this year and from what I have talked with seniors things are looking positive, I ain't saying it's the best college but pretty sure the avg is gonna be very near main campus cse course atleast for core and ai branch, rest just wait for placements ig\n└── Also students have been given internship in moss Adams, intel, cisco, IBM, Bosch etc to say the least\n    └── Now compare the number of students that get such internships from the same colleges being compared. You will get your answer right there. I work in one of those companies you mentioned, I know the value the existing BLR colleges have when it comes to recruitment.\n        └── Well around 50 students got on campus internship on 3rd year in a batch of 250 students vs 100 in a batch of 700 for main campus (literally confirmed by a main campus senior) so the internship ratio for 3rd year on campus is better than main atleast, yes few people were not able to clear nvidia etc but they came to campus for internship which itself speaks volume (and they normally don't come to campus for interview in many decent blr colleges itself) honestly it may sound copious but waiting for stats is the only way it can convince the doubters"
    }
  ]
}