{
  "id": "1djh1q5",
  "title": "Mechanical in PES",
  "content": "My brother got Mechanical in PES. Can anybody with Mechanical or any other senior help with how the curriculum and placements looks like? Is it something that should be considered or are there a lot of drawbacks? \nPlease share your inputs to help us make a better and informed decision whether to keep the seat or withdraw before the second round\n\nThanks! ",
  "metadata": {
    "root_comment_id": "l9aup82",
    "post_id": "1djh1q5",
    "author": "LopsidedPineapple606",
    "url": "https://www.reddit.com/r/PESU/comments/1djh1q5/mechanical_in_pes/",
    "permalink": "https://reddit.com/r/PESU/comments/1djh1q5/mechanical_in_pes/",
    "score": 2,
    "upvote_ratio": 1,
    "created_utc": 1718797227,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "l9aup82",
      "body": "There are more Mech. students on the discord server than on this subreddit. You will find better luck there. Check the FAQs for the server link: [https://bit.ly/pesu-faq](https://bit.ly/pesu-faq)"
    },
    {
      "id": "l9avq91",
      "body": "If it's via PESSAT then withdraw the seat because placements for mechanical are non-existent.\n└── Aren’t Mechanical students allowed to sit for IT/Consulting placements?\n    └── Not allowed for IT companies at PES. IT companies allow CS, ECE students to sit. Very rarely, EEE. \n\nDo not join Mech at PES if your goal is to get an IT job, because that will never work out."
    },
    {
      "id": "l9bdxtg",
      "body": "Not worth joining mechanical engineering in pes\n└── Can you please share reason as well? Any pointers would help!"
    },
    {
      "id": "l9euz9e",
      "body": "PESSAT seat is not really worth it imo\nYou’re already spending close to 20 lakhs with uncertainty regarding your placement.\nThe batch size has been significantly reducing past 3-4 years it’s at 60 or 90 this years intake. I’m from the 2020 batch and we had over 200. Few senior professors are retiring or are leaving the college\nPartially disagree with rowlet here, Mechanical students are allowed to sit for IT roles as long as you have the requirements. Ofc not all companies allow mechanical students to sit for the exam but quite a few do. I got placed for a consulting role so the opportunities are endless. DM if you want to know anything specific\n├── Hey, please check DM!\n└── please check DM!"
    }
  ]
}