{
  "id": "1djnku9",
  "title": "Specialization Certificate's importance!?",
  "content": "I feel like taking Applied Cryptography and Big Data as my 5th Sem electives but the combination of these two doesn't fall under any of the 3 mentioned specialization domains (MIDS,SCC,CSCS). So I wanted to ask does specialization play a role during college placements in any way??",
  "metadata": {
    "root_comment_id": "l9c6t0d",
    "post_id": "1djnku9",
    "author": "Content-Walk9994",
    "url": "https://www.reddit.com/r/PESU/comments/1djnku9/specialization_certificates_importance/",
    "permalink": "https://reddit.com/r/PESU/comments/1djnku9/specialization_certificates_importance/",
    "score": 6,
    "upvote_ratio": 0.8799999952316284,
    "created_utc": 1718814946,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "l9c6t0d",
      "body": "I spoke to a bunch of seniors and they unanimously agree that specialisation isn't important. Infact, if you mention in an interview that you have a specialisation, they'll cook you on that topic itself which you may or may not be able to answer.\n└── Great then.. Even I thought what could possibly be the use of an undergrand specialization 🤡"
    },
    {
      "id": "l9c79hs",
      "body": "abso-fucking-lutely useless.\n\nIts a distraction, and a removal of choice.\n\nStudy a course because you like it, not because you have the noose of a specialization around your neck\n└── Thanks for your valuable insight dude"
    },
    {
      "id": "l9ccgu8",
      "body": "Take whichever course you like, the certification is just another useless piece of paper, no company comes and explicitly asks for MIDS students.\n└── Okay thanks for the reply!"
    },
    {
      "id": "l9emu95",
      "body": "Is it worth taking advanced algorithms? What are the pros and cons of the subject? Would it be a better idea to take data analytics if I am interested in ML? Also keep in mind that i will be choosing big data as a 2nd elective.\n└── Take courses which you are interested in. If you're interested in ML, take Data Analytics. If you're interested in theoretical CS, take Adv. Algo. If you don't have any inclination, take Adv Algo because it helps the most during placements.\n    └── But if I take data analytics instead of adv algo what are the things that I can do to prepare for placements that will make up for not taking adv algo?\n        └── From whatever I've heard, the reason Adv Algo helps is because the concepts covered are often above of whatever is required for placements. You don't need to actually know at that level to solve the aptitude questions. Just practice your basics, make sure you are adept at a little over your normal DSA course."
    }
  ]
}