{
  "id": "1dkrd63",
  "title": "GRE prep",
  "content": "Seniors who have given GRE and have prepared by themselves,could you please share some resources and how much time did it take with college studies ",
  "metadata": {
    "root_comment_id": "l9jyrrp",
    "post_id": "1dkrd63",
    "author": "Pitiful-Car-9475",
    "url": "https://www.reddit.com/r/PESU/comments/1dkrd63/gre_prep/",
    "permalink": "https://reddit.com/r/PESU/comments/1dkrd63/gre_prep/",
    "score": 5,
    "upvote_ratio": 0.8600000143051147,
    "created_utc": 1718930966,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "l9jyrrp",
      "body": "Gregmat is pretty good.\n\nA month and half would be sufficient"
    },
    {
      "id": "l9kgisx",
      "body": "Gregmat is great, although I didn't personally use it. \n\nFor quant, I used the Manhattan 5lb book + Math workout for the GRE + ETS official guide. \n\nFor verbal, I used the ETS official guide + Magoosh flashcards (basic + common words) + Gregmat strategies on YouTube. \n\nFor AWA, I watched through Gregmat's videos on YouTube again. \n\nI gave myself about 2.5-3 months of prep (this is because I also had full time work at the same time). I got a decent score of 320/340 (166Q, 154V, 4.5AWA). \n\nI'd suggest you to first shortlist universities and figure out if the GRE is even needed. I ended up *not* submitting my score where it was optional. Almost all applicants do not end up submitting scores unless it's mandatory, or they have scored a 330+. So go through programs and shortlist universities and find out how many actually need the GRE. It doesn't have to be a final list and even a starter list will do. \n\nGive a diagnostic test to figure out how much you are able to score without any preparation. That will tell you how much time you need. I know people who obtained the same score after 2 months of prep, and I know people who took 4 months for the same. It depends on your personal ability.\n└── Is GRE for MS in University like US/UK?\n    └── For US, yes."
    },
    {
      "id": "l9kvc1u",
      "body": "I prepped only from the Manhattan 5lb book. If you studied in ICSE or CBSE in high school, you should have English basics solid, and Math is very simple.\nI got a 324 on 340. Didnt write essay. Was preparing for ISB YLP programme."
    }
  ]
}