{
  "id": "1dkzilr",
  "title": "3rd sem ECE",
  "content": "Just completed my sem 2 and it didn't go well. Wanted to know what are the pre-requisites for 3rd sem ECE,how should I work on myself and any suggestions regarding how I can make this vacation a productive one(any course recommendation is also welcome). Also, is it true that 3rd sem is hard?? Also, does ECE require any coding stuff?",
  "metadata": {
    "root_comment_id": "l9laler",
    "post_id": "1dkzilr",
    "author": "Subject-Whereas-3221",
    "url": "https://www.reddit.com/r/PESU/comments/1dkzilr/3rd_sem_ece/",
    "permalink": "https://reddit.com/r/PESU/comments/1dkzilr/3rd_sem_ece/",
    "score": 6,
    "upvote_ratio": 0.800000011920929,
    "created_utc": 1718960502,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "l9laler",
      "body": "Focus on Fourier series,transform as well as the Laplace transform. If your calculus is weak, practice differentiation and integration. A lot of your 3rd semester subjects involve a lot of math. \n\nThere isn't too much coding involved in the 3rd semester, except in CADD, where you'll learn system verilog.\n└── Thank you so much!!"
    },
    {
      "id": "l9lfqwp",
      "body": "Firstly get some well deserved rest. You wont get any for another year xD \nBrush up on Fourier and Laplace and probability that you probably had in 2nd sem like someone already mentioned.\nIf you truly want to dive into some really fun ece topics then learn system verilog from [here](https://web.archive.org/web/20230815062438/https://verilogguide.readthedocs.io/en/latest/)\nit’ll help you in CADD and also spark some interesting in HDL and related projects (at least it did for me) \nAlso pro tip, please use textbooks in your 3rd sem. Slides cover barely anything and textbooks like Razavi for analog circuit design have amazing content.\n[this](https://youtube.com/playlist?list=PL0my2vWlgboyAgh00gRk4vqkMBRDI7EfC&si=zFs_uw2EGfHSDOtg) playlist by the author of the prescribed textbook for CADD will help in understanding topics better and help you score well too! \nAlso yeah i cant help you much with communication resources cuz i messed up those subjects myself xD\n├── Thank you so much!!\n└── Is there a similar playlist for SS and possibly NAS too? Would really appreciate it.\n    └── havent found any good channels for these personally. preparing NAS through solved textbook problems + pesu academy questions should be good enough. For sns also ganesh rao and oppenheim textbook solved problems are good if you can start early."
    }
  ]
}