{
  "id": "1dl0l8z",
  "title": "manipal cse vs pes ec cse",
  "content": "pes ec 1lpa, manipal 5lpa and I prefer academics over campus life tbh",
  "metadata": {
    "root_comment_id": "l9liw47",
    "post_id": "1dl0l8z",
    "author": "Tight-Common-7247",
    "url": "https://www.reddit.com/r/PESU/comments/1dl0l8z/manipal_cse_vs_pes_ec_cse/",
    "permalink": "https://reddit.com/r/PESU/comments/1dl0l8z/manipal_cse_vs_pes_ec_cse/",
    "score": 1,
    "upvote_ratio": 0.6000000238418579,
    "created_utc": 1718965031,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "l9liw47",
      "body": "So you think manipal won't offer anything in terms of academic and Placements? Still I would suggest pes cse."
    },
    {
      "id": "l9ljd2j",
      "body": "pes ec"
    },
    {
      "id": "l9lkhl5",
      "body": "if you prefer academics over campus life then PES ec, the campus life will SUCK but the plcements will be the best you can get\n└── how bad is suck, will I still find a good friends circle\n    └── yes, you will don't worry\n        └── thanks mate!"
    },
    {
      "id": "l9ltibo",
      "body": "CSE vs ECE those are different battle fields, check out the sub for similar questions, you’ll find plenty of answers.\n└── not ece, both are cse only\n    └── My bad sorry, then choose PES EC is academics if your only goal, you’ll end up saving lot of money in the process as well.\n        └── but placements wise which is a better choice?\n            └── If you are ready to slog forgoing college life PES will be the obvious choice.\nCompetition is pretty high in PES with around 3-4K CSE students.\n                ├── 3-4K?? Is it really that much??\n                │   ├── ig its 1.5k, 3k bohot hogya right😭😭\n                │   │   └── Lmao 720 cs core students in each pes campus\n                │   │       └── so what should I choose?\n                │   │           └── You'll prolly be at the top in ec campus if you take pes ec cs so that'll help deffo as You'll get a better cgpa as its mostly relative grading in most cycles so placements will be sorted\n                │   │               └── And if you have financial constraints , kcet seat is a no Brainer as you'll be save up for masters /mba\n                │   │                   └── oh it'd noy like I can't afford mit, but like the saved money will surely help\n                │   └── not a 100% sure, but this year i think its around 360 students per campus for cs through pessat\n                └── In the seat matrix it's around 2k students, I think\n                    └── You got to count in both the campuses, CSE + AIML, they’ll be management quota diploma entry students later.\n                        └── Seat Matrix is like\n\nRR campus:-\n\nCSE- 720\nAIML- 480\n\nEC campus:-\n\nCSE- 720\nAIML- 240\n\nTotal- 2160\n\nI think this is the right one 🙂\n                            ├── It was 720 for CSE in RR campus for 20-24 batch, excluding management and diploma students \nNo fking way it’s still the same\n                            │   ├── its the same bro\n                            │   └── Hmmmm but I think the total seats through the PESSAT in both campuses and both branches are \n360+360+264+132 = 1,116\n                            │       └── It is actually 288 + 288 + 192 + 96 = 864. They took in 360 + 360 + 264 + 132 during round 1 counselling coz they knew a lot of students would be surrendering their seats as the other counsellings began. The following is the seat matrix.\n\n[https://pes.edu/intake-of-courses/](https://pes.edu/intake-of-courses/)\n                            └── then it'd pretty similar to manipal"
    },
    {
      "id": "l9vsje7",
      "body": "manipal has the best mix of campus life and academics, as far as I've seen even the syllabuses of both the unis are pretty up to date. If money isn't an issue and you want stories to tell about your college life then go to manipal. If money is an issue and you want to only study and cram for 4 years then go to pes ecc\n└── but I can't go to manipal because of the drug culture, parents didn't agree man:(\n    └── Try showing them manipal's placement stats maybe? Idk 😭\n        └── but pes has better placements no😭\n            └── I'll give you a very good explanation, if you compare manipal cse core and pes cse core, manipal has better numbers due to less and quality intake (240 seats I think) BUT if you compare only the TIER 1 PES CSE Placements(Top 20ish% of students/above 8/8.5gpa)vs Manipal CSE, pes wins\n                └── guess I'm doomed, I tried everything I can to convince my parents, it doesn't seem to work 😭\n                    └── Chalo phir enjoy your life in pes, I'm in pes rr and I think it's pretty great, over there I don't know much.\n                        └── I'm scared now😔\ndid I make a wrong choice\n                            └── If you know how to manage your time and stay ahead of your peers, pes ecc is great, just that people don't do it very well over there and jump to"
    }
  ]
}