{
  "id": "1dlz706",
  "title": "Special topics for Sem-3",
  "content": "-What are special topics?\n\n-What are the special topics for sem 3(CSE)?\n\n-Do we have to choose according to our interest or from scoring pov(my cgpa for 1st year would be 7.6-7.8, Iam aiming for nearly 9 by end of sem 6,idk if it's practically possible)?\n\n-Which spl.topic is scoring?",
  "metadata": {
    "root_comment_id": "l9scfou",
    "post_id": "1dlz706",
    "author": "PYUchiha7",
    "url": "https://www.reddit.com/r/PESU/comments/1dlz706/special_topics_for_sem3/",
    "permalink": "https://reddit.com/r/PESU/comments/1dlz706/special_topics_for_sem3/",
    "score": 7,
    "upvote_ratio": 0.8999999761581421,
    "created_utc": 1719072847,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "l9scfou",
      "body": "-Its basically an elective subject for 2 credits. you have to get 6 credits from these special topics by the end of the 6th sem. you can either take a special topic during the sem or during the summer holidays. During sem, its classes will only be on fridays for about 2hrs. And during summer holidays, its duration is 1 week.   \nwe had 3 options.  \n\n\n-we had 3 options.  \nObject Oriented Programming in C++, Programming with R, Unix Shell Programming. almost 50% -60% of CSE take C++\n\n  \n-It depends on you but i would say look at it from a scoring pov cause no matter how much you try, you can't really learn much from it or atleast i didn't.\n\n  \n-I took C++ but most of my friends who took R said it is scoring\n├── How was ur experience with cpp?                                                         \nU invested time for that or...?\n│   ├── CPP is a good course. It's not as straightforward as R but it's by far the most useful. Definitely recommend it if you're aiming at good placements. \n\nHowever if you want an easy course, R is the way to go. There's atleast a 50% overlapping syllabus with the statistics course which makes it easier. I took up R back when I was in sem 3 and it was like having half a course lol. Although you don't really learn too many useful things, so it doesn't help in the longer run. I'd suggest taking this only if you're desperate about raising your GPA\n│   ├── you have to invest some amount of time compared to other special topics. ISAs are manageable and ESA will be coding heavy.\n│   └── IMO cpp was fine , you don’t have to put in a considerable amount of time.ISAs can be tricky because of it being only mcqs but if you go through the notes on PESU and have a decent understanding of the concepts they are honestly fine. ESA was again theory related and the few coding questions they ask are surface level and are in no way like the questions they’d ask in concept heavy courses like DSA. Apart from isa the internals are graded with a mini project\n├── How is R language?\n└── can you brief the rest syllabus, excluding special topics, also is DSA taught in C or Java?\n    ├── DSA is taught in C here. If you want to, you ca learn in Java as well. But tbh language does not matter\n    └── Digital Design and Computer Organization DDCO(5 credit)-its that kind of subject which you feel easy to understand but when it comes to exams, you don't really get anything. It has a very vast syllabus and its ESA is on the tougher end compared to other subjects. Not much content on pesu slides but av summaries and text book are helpful. \n\nData structures and its application DSA(5 credit)-manageable. Easy to understand and is very important for placement.\n\nWT(4 credit)-most people find it tough. you can't really understand the code. you just have to practice them. again, an important subject for placement.\n\nStatistics for data science SDS(4 credit)- lot of theory and statistics. scoring subject and easy to understand. and is a necessary subject for ML which you will learn in future.\n\nAutomata Formal Language and Logic AFLL(4 credit)- easiest of all subjects. probably you can score an S in  it.  in unit 5, youll learn about turing machine and all. if you can mange that, you can score an S. personally, AV summary were helpfull for me.\n        └── Minor addition: AFLL is the base course for compiler design, the hardest and heaviest course in your CS curriculum. If you do not learn AFLL properly you will struggle in sem 6. It builds on all the concepts you learn in AFLL."
    },
    {
      "id": "l9vkjox",
      "body": "Be clear with your ds concepts in C, as it will fetch you marks, AFll is a scoring subject, it's the type of subject in which you can do well if you listen to class, it's tougher if you sit and study on your own, for DDCO be clear with your slides, nothing more.. verilog for lab is very easy with chatgpt now, it used to be a nightmare for us. Sds is a tricky subject with lot of formulae, I think for this subject you'll have to study ahead and by heart the formulae. Webtech is the worst subject.. you most likely won't get an A or an S in this. And pls make a team of 3 and start on your project for webtech from first day. don't wait for ur teachers.. use MERN stack and css. Don't try something too fancy and demonstrate your application ability of concepts taught in class and you're good.\n├── Ps. For special topic take R. It's the best for scoring .\n└── Damn thanks bro!"
    }
  ]
}