{
  "id": "1dmdcif",
  "title": "Seeking Advice on First Year Preparation and Syllabus at PES University",
  "content": "\n\nI've recently enrolled at PES University and I'm eager to start off on the right foot. Could anyone share insights on what subjects/topics are covered in the first-year syllabus for Computer Science. Also, any recommendations on what I should study beforehand to excel in my first year and potentially aim to be a topper?\n\nAny advice or tips would be greatly appreciated! Thank you.\n  ",
  "metadata": {
    "root_comment_id": "l9ux66z",
    "post_id": "1dmdcif",
    "author": "Kshitij_Indian",
    "url": "https://www.reddit.com/r/PESU/comments/1dmdcif/seeking_advice_on_first_year_preparation_and/",
    "permalink": "https://reddit.com/r/PESU/comments/1dmdcif/seeking_advice_on_first_year_preparation_and/",
    "score": 0,
    "upvote_ratio": 0.25,
    "created_utc": 1719114510,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "l9ux66z",
      "body": "You can refer [one of my previous answers to a similar question](https://www.reddit.com/r/PESU/comments/1dm4f41/comment/l9uwynn/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)"
    },
    {
      "id": "l9uztax",
      "body": "You honestly don't need to study anything beforehand. This is the last ever summer break of your life. It's best to enjoy it for now. \n\nIf you do want to pick up things, take a look at the MIT Missing Semester course. It covers a lot of useful topics that CS engineers should know, but aren't part of any CS syllabus.\n\nAlso, being a topper is a good aim but unfortunately a pointless one. Anything above a certain CGPA is pretty much the same when it comes to opportunities. You're better off having a 9.0 CGPA with a strong list of experiences and projects rather than a 10.0 with nothing else to show. If you want to get placed, you're going to have to be more than your CGPA."
    },
    {
      "id": "l9vrwvz",
      "body": "Enjoy the time you get before your college start and don't overburden yourself to become a topper. I'd suggest start learning Python but that's only if you consider it fun and not a burden, if you do consider it a burden, give your brain some rest till pes starts."
    },
    {
      "id": "l9w06zp",
      "body": "Bro just enjoy your life. Make new friends (and girlfriends) and go party. Study when you have to and just be happy, that’s it really"
    }
  ]
}