{
  "id": "1dn7y4a",
  "title": "How many half days do we get in ec campus?",
  "content": "title",
  "metadata": {
    "root_comment_id": "la0sfpe",
    "post_id": "1dn7y4a",
    "author": "Weekly-Track-500",
    "url": "https://www.reddit.com/r/PESU/comments/1dn7y4a/how_many_half_days_do_we_get_in_ec_campus/",
    "permalink": "https://reddit.com/r/PESU/comments/1dn7y4a/how_many_half_days_do_we_get_in_ec_campus/",
    "score": 6,
    "upvote_ratio": 1,
    "created_utc": 1719214955,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "la0sfpe",
      "body": "If I am not wrong, it was 2 full days and 3 half days if you hadn't taken up special topics, else it's 3 full days and 2 half days."
    },
    {
      "id": "la0uh8p",
      "body": "1 half day every week, which is on Wednesday\n└── is it same in rr?\n    └── Nah\n        └── then? say the difference also"
    },
    {
      "id": "la0zon2",
      "body": "Not as much as RR for sure, when I checked with my friend in ecc, they had like 1 half day and a couple of more days until 4:45 whereas in the same time period we have a minimum of 2 half days and the timings never exceed 4pm (one exception being you get 3 half days and one day goes on till 4:45 in rr campus). Idk why they have more class hours to complete the same amount of syllabus for both campuses and have exams at the same time\n└── So at what time do the classes start at e-city? And will they end at 4:45? Till what time will half days end and can you tell me whether saturdays are off or not. Please reply\n    └── Saturdays are always off for any pes campus, and ecity classes start exactly at the same time rr classes start(alternates bw 8 or 8:45), it just ends late for ecity, atleast until the first isa, for no absolute reason\n        └── Half days mean classes only until lunch break (1 or 1.45)\n            └── Okay thanks for replyig,and how many half days do e city have? I've heard that there are 2 to 3 half days in rr campus but only 1 in ecity,how true is this?\n                └── It's absolutely true"
    }
  ]
}