{
  "id": "1dne1df",
  "title": "Should i apply?",
  "content": "Wont be allowed for others and its only 12LPA",
  "metadata": {
    "root_comment_id": "la1u5vu",
    "post_id": "1dne1df",
    "author": "SnooAdvice1157",
    "url": "https://www.reddit.com/r/PESU/comments/1dne1df/should_i_apply/",
    "permalink": "https://reddit.com/r/PESU/comments/1dne1df/should_i_apply/",
    "score": 11,
    "upvote_ratio": 0.9200000166893005,
    "created_utc": 1719237233,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "la1u5vu",
      "body": "Wait, does it mean you can't take a regular FTE offer as well since this is just an internship offer?\n└── sounds like that\n    └── Is this mail from the company don't worry about what they say in that mail. Just ask the placement coordinator about it.for us if we have an internship offer then you are eligible for any FTE offer without the internship\n        └── What if you are offered a FTE offer via the internship as well? Do you get to choose between the two FTE offers?\n            ├── If a tier 3 offer you will be eligible for tier 1 and 2 if you get tier 2 then you are eligible for tier 1. If you get tier 1 then your placement is done you are not eligible for any other placement\n            └── But according to the placement head if you get a FTE from an internship then you have to join. But I think by the time you decide these things your btech will be completed and you have full authority to it"
    },
    {
      "id": "la1v0rk",
      "body": "Same dilemma"
    },
    {
      "id": "la21sz8",
      "body": "What's the sgpa criteria for this btw?\n└── nothing\n    └── can eee students take this? if they're good in CS that is"
    },
    {
      "id": "la2fzgs",
      "body": "When they say Btech ( CS) , that includes Btech CS(AIML) students as well right? Can they apply too\n├── Btech is Btech\n└── Ask the placement coordinator. This (or the next year) is the first year that AiML would be sitting for placements."
    },
    {
      "id": "la67f1l",
      "body": "From college side u can sit for placements if u get in... So dw abt it and apply. But college has a limit of 2 offers so choose those 2 offers wisely(yes, it applies to internships as well)"
    }
  ]
}