{
  "id": "1dnztoj",
  "title": "What scholarships pesu provides?",
  "content": "I want to enroll into cse rr campus and by last year cutoff i should get, but fees is issue for my family(<4lpa). What scholarships does pesu provide? During kcet application form we had no issue so registered as General male but due to sudden family issues im having financial issues.   \n  \n Im also asking because my friend who enrolled there via pessat said some policies changed and website is not updated.   \n",
  "metadata": {
    "root_comment_id": "la6cvqs",
    "post_id": "1dnztoj",
    "author": "Financial-Quote6781",
    "url": "https://www.reddit.com/r/PESU/comments/1dnztoj/what_scholarships_pesu_provides/",
    "permalink": "https://reddit.com/r/PESU/comments/1dnztoj/what_scholarships_pesu_provides/",
    "score": 2,
    "upvote_ratio": 1,
    "created_utc": 1719298891,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "la6cvqs",
      "body": "The fees is lower if you join through kcet. It was around 1l when I joined 2 years ago. Might have increased by now but I don't think it's 4l per year. \n\nAs for your question, there are 2 scholarships available at PES. MRD and CNR Rao scholarships. \n\nIf you're in the top 2% of your batch in your CGPA (cumulative GPA), you'll get a 50% fee return.   \nIf you're in the top 20% of your batch in your SGPA (semester GPA), you'll get a 40% free return. \n\nThis is for both KCET and PESSAT\n\nApart from these two, there is a distinction award of some 1.5k if you get GPA higher than 7.5 as far as I know\n├── Ik it's lower thru cet but it's still bit much for my family currently. Is it viable to take edu loan for pes?\n│   ├── I mentioned that since you said 4LPA. it's only 4LPA if you get in through JEE or PESSAT. You can take an education loan if required. I'm not the right person to know about the process or give financial advice. I suggest you ask someone else about this\n│   │   ├── kk thanks buddy\n│   │   └── No I meant my family income is less than 4lpa rn.\n│   └── though cet its like 5lakhs for your entire btech, i think it is 1.2Lpa for cet students\n│       └── yes ur right, but my family is in pinch rn and idk how/when situation will improve, so i asked.\n│           └── You could apply for a loan if you are a cet student you could easily get a loan and you can easily repay it.\n│               └── But my family already has lots of other loans pending. And no member currently earning(laid off). \nHow will I get education loan?\n│                   └── That I have no idea govt banks should sanction a loan on your name since you have a good kcet rank and the kcet fees are cheap try going to SBI or BOI and try to get a  loan without any co signer and collateral, private banks also give our loans without collateral but they need a co signer or a good credit score\n│                       └── can i have to pay the loan back after i get a job 4 years later ?\n│                           └── I think so but ask the bank regarding the details I'm not so sure\n└── Also how hard is it to avail 50% one? Ie how hard is it to maintain 9.5 ish cgpa in pesu? Any idea/anecdotes will help"
    },
    {
      "id": "laakgww",
      "body": "Hey are you looking through comedk and kcet? I have a rank of 2.7k and 3.1k in both. Might get CSE at RR it right?\n└── Kcet\n    └── Check out cutoff 2023 ull get idea for cet, dunno about comedk"
    }
  ]
}