{
  "id": "1do0lga",
  "title": "PESU Refund Policy",
  "content": "I am confused regarding the refund rules of PESU. During counselling, they told us July 5 to be the last date to get refund of program course fee of 4,80,000 if we withdraw our seat. This is what the important dates section on their site says as well\n\n||\n||\n|**July 5, 2024**|Last date for submission of original documents / Last date for surrender of PESSAT seat (only for admitted students)|\n\n  \nBut their site also says this-\n\n**Program Course Fee:** Any refund here will be done as per current UGC refund norms only.\n\nAnd the UGC norms are this-\n\n[https://www.ugc.gov.in/pdfnews/1654477\\_Fee-Refund-Policy-2024-25.pdf](https://www.ugc.gov.in/pdfnews/1654477_Fee-Refund-Policy-2024-25.pdf)\n\nIt says that Higher Education Institutions have to refund the entire amount up to 30 September 2024 and deduct not more than Rs.1000 up to 31 October 2024 if a students cancels his/her admission.\n\nCounsellings of BITS, etc. will still be happening after 5 July and if I'm able to get something better as per me in those, I would want a refund of the 4,80,000 from PESU. Will they give me that money back? And I know that those who get into IIT, NIT, IIIT will get a refund after 5 July as well, but what about colleges like BITS, etc?",
  "metadata": {
    "root_comment_id": "la6f7ob",
    "post_id": "1do0lga",
    "author": "Honest_Acadia_182",
    "url": "https://www.reddit.com/r/PESU/comments/1do0lga/pesu_refund_policy/",
    "permalink": "https://reddit.com/r/PESU/comments/1do0lga/pesu_refund_policy/",
    "score": 2,
    "upvote_ratio": 0.75,
    "created_utc": 1719302255,
    "flair": "PESSAT/Admission",
    "nsfw": false
  },
  "comments": [
    {
      "id": "la6f7ob",
      "body": "yeah I had the same doubt!\n└── But isn't that illegal as per UGC norms? They technically can't do that, right?\n    ├── yes it is, forgot to ask them about that ;-;\n    └── Welcome to PES :)"
    },
    {
      "id": "la6gbv5",
      "body": "Yeah so they will probably deduct some amount from that 4.8L\n\nBut dw, high chance that they'll push the deadline several times which they did last year\n\nIf you convert your pessat seat into a kcet one your amount will be refunded totally , regardless of the deadline\n\nSince BITS is private institution it's unlikely they'll refund but you'll have check with them once\n└── But UGC guidelines say you have to refund the entire money till 30 Sep if a student withdraws their seat, regardless of where he/she takes admission. Can PESU legally make their own rules on this?\n    ├── PES will find loopholes. That's what they always do. During COVID we used to call PES a union territory because it didn't follow state or national guidelines on not holding offline exams lol\n    │   └── But like, seriously, can we not threaten legal action in case they try to not refund the money?\n    │       └── You're welcome to try. Know that you're not the first one and definitely won't be the last.\n    │           └── But have those before me been successful in this endeavour?\n    │               └── Not very. Search through this subreddit. It's a common question asked every year. They will take 10k minimum as non-refundable fees.\n    │                   ├── That's fine. Hey, take 10000 more as a token of appreciation if you are willing to give back the remaining amount. Let's see what happens. Thank you Mr, Owl for your responses.\n    │                   │   └── true, 10k seems still ok in front of 4.8 lakhs which they want to eat\n    │                   └── they said full fees will be gone, if we fight will they refund all taking away 10k?\n    └── Yes, it's risky, they won't return the full amount after the announced deadline. \n\nHowever I have heard people have fought with the management to get refund, if you are willing to or ready to face the management then you can try it out"
    },
    {
      "id": "la6kscy",
      "body": "Listen, better stick to the announced date, you won't have any problems . \n\nIf you stick to UGC norm, trust me they will make you work to get your money back.\n└── If I could know before 5 July whether I will get something better as per me, I sure would withdraw before that. It's just that I prolly wouldn't since a lo of counsellings will still be going on after 5 July, and withdrawing before that would be risky."
    },
    {
      "id": "n4krd3o",
      "body": "Any success in withdrawing your seat?"
    }
  ]
}