{
  "id": "1do1mls",
  "title": "Doubt",
  "content": "I'm planning on joining pes Cs this year and I live around 20kms away. I'm planning on traveling through metro and wouldn't really have time to prepare food for myself. I was wondering if non hosteller can obtain mess too or anything similar? (I'm female)",
  "metadata": {
    "root_comment_id": "la6o0b7",
    "post_id": "1do1mls",
    "author": "scumragg",
    "url": "https://www.reddit.com/r/PESU/comments/1do1mls/doubt/",
    "permalink": "https://reddit.com/r/PESU/comments/1do1mls/doubt/",
    "score": 7,
    "upvote_ratio": 1,
    "created_utc": 1719306673,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "la6o0b7",
      "body": "I don't know about mess but the cafeterias are quite good. There are a couple cafeterias on campus and some shops for snacks too. Most day scholars eat there"
    },
    {
      "id": "la6vyo1",
      "body": "I also stay almost 20 km apart , it's a pain to travel 😭\nU can buy food in cafeteria if u want"
    },
    {
      "id": "la70410",
      "body": "y dont u consider taking the hostel lol\n└── Real but curfews are a headache"
    },
    {
      "id": "la7ajsw",
      "body": "If you want the hostel ,do apply in 1st year.\nI too stay 21kms far and was late for applying for hostel in 1st year and suffering now.\nWhen asked for 2nd year, the hostels are full. It's a big pain...😭"
    },
    {
      "id": "la808en",
      "body": "no the mess food is terrible, you can go sit and eat there if you borrow any hostelers ID card and go sit. I tried it once and never will eat that food that shit aint good man , i have deep respect to all the hostel homies who eat that on a daily basis.\n└── Not in all the messes. Oh u tried hostel mess"
    },
    {
      "id": "la83w8f",
      "body": "you can get breakfast and lunch from the hostel mess even if are not from the hostel, it is not as good as cafeteria but it is unlimited and tastes decent.\n└── Ooh I'll consider that"
    },
    {
      "id": "la84z7g",
      "body": "There are cafeterias in campus. My advice is to reach there as early as possible otherwise there will be a rush. If you're thinking of lunch. Breakfast maybe easier...but you have to leave ur house early. Classes begin at around 8."
    }
  ]
}