{
  "id": "1do8o83",
  "title": "Doubt ",
  "content": "I secured 1976 rank In pessat . What can I possibly get in rr campus in round 2. Heard that aiml closes at 1735 this year . Will I get aiml in rr campus or cse in ecity campus ",
  "metadata": {
    "root_comment_id": "la7wotm",
    "post_id": "1do8o83",
    "author": "LengthinessMurky1335",
    "url": "https://i.redd.it/xojwgt61kq8d1.jpeg",
    "permalink": "https://reddit.com/r/PESU/comments/1do8o83/doubt/",
    "score": 9,
    "upvote_ratio": 0.9200000166893005,
    "created_utc": 1719329063,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "la7wotm",
      "body": "It all depends. How many students have withdrawn, the ranks of those who show up for counselling and also whether PESU does a little bit of trolling like they did last year or not. What I mean is that they sold the remaining PESSAT seats to management students and those who showed up for second round in hopes of getting a seat had to go back empty handed.\n└── JoJo's bizzare adventure indeed."
    },
    {
      "id": "la80t22",
      "body": "Fuck u all😭,back in 2021 I got 2911 rank and I cud barely get ECE"
    },
    {
      "id": "la875hy",
      "body": "What can I possibly get with 11k kcet rank in bangalore?\n└── U can get CSE with design in dsce...try checking previous year cut offs it's available in kea website"
    },
    {
      "id": "la8ciqp",
      "body": "Does anyone know when the 2nd round of counselling starts?\n└── Maybe after 7-8 days hopefully\n    └── So soon? They haven't even sent a mail or anything for it. If someone from outside Bangalore wants to attend, won't they have issues?\n        └── Just a guess , maybe even after 2 weeks after kcet round 2 counselling no idea"
    },
    {
      "id": "la8nmkl",
      "body": "I wanna talk to the 817th ranker who took mechanical. Like, who's THIS determined to die a virgin?\n├── Mechanophilia\n├── Hey HEY NO\n└── yeah lol, that girl took it"
    },
    {
      "id": "labiwid",
      "body": "I don't mean to sound harsh but last time when I showed up for round 2 of counselling with my rank of 12XX in the hopes of getting a core cse from my aiml seat, top rankers with ranks under 700 also couldn't get core cse because the seats available only were extremely less, but a LOT of people showed up for those less seats. PES wasted a lot of our time that day, I'd say if your rank is 1k+ don't bother going to second round.\n└── I want to get aiml or ece in any of the branches , is there any chance for me? I got 1976 rank\n    └── There are 0 seats left in both the campuses in the branches u want. Last time only 26 people surrended their seat & a guy with literally a 89 rank got no seat, so I don't think you can get any of the branches you want, maybe biotech or mech possible, that's also a MAYBE\n        ├── 💀 hell na wtf\n        └── The 2nd round cutoffs have increased by 400 ranks which means smone who's Gove 400 ranks more than the previous cutoff got the seat , that's what it means right?\n            └── Yeah that is what it means but it all depends upon HOW many people are going to withdraw their seat so the matrix can go +1 and then they'll call from RANK 1 ONWARDS, so if rank 1 didn't show up for first round counselling and shows up for 2nd round, he/she takes the seat (happened in my case)\n                └── So there's no possibility for me to get a seat atleast in the ecity campus?\n                    └── Last time as far as I remember, 0 people surrended their seat in ec campus and the matrix still showed 0 seats. 💀\n                        └── My only option is pes college cause it's better than other colleges in placements and I fucked up all other exams\n                            └── dm me.\n                                └── I'm new on this app buddy I don't know how to dm you 😭"
    },
    {
      "id": "labx53c",
      "body": "Btw, you'll have good aiml faculty in ec as well.\n└── Is there any possibility I'll get cse, aiml, ece in ecity campus?\n    └── Yes ofcourse\n        ├── People say that they sell the surrendered seats as management seats , really worried rn.\n        ├── 17k rank in pessat or cse?\n        │   └── I'm talking about kcet ranking, You got 11k in kcet right?\n        │       ├── Yeahh 11k in kcet\n        │       │   └── Yeah then don't worry. Just opt pes through counseling\n        │       │       └── Okayy\n        │       └── Can I dm you?\n        │           └── Sure\n        └── Really? Was it coz of reservation? Coz I don't think a general category one could get ecity cse or aiml with that rank.\n            └── Cutoff is the max ranked student got seat in that college last year. Doesn't meant to be same for this year. I know a person with 5x ranking getting a seat via general category in college having cutoff x.\n                └── That was in dsu. As for cse in pes . Yes 17k in gencat\n                    └── All you have to do is, list the best colleges in counseling go for round 1, 2 .. wait for it. Sometimes a person get a seat in a college u wanted but he's doesn't. So possibly he'll go for round two. If he leave that seat you may get it. If pes is your priority, enlist at the top for all rounds."
    }
  ]
}