{
  "id": "1dp5i5x",
  "title": "Regarding ESA revaluation",
  "content": "Has anyone ever got their grade increased after going through revaluation? Is it very rare? Also, if our grades increase how much will we get refunded? \n\nOur ESA results came out and I am confident that I should've got better grades in atleast 2 subjects but a bit hesitant on applying considering the Rs 1000 or so they charge per subject and can't go for paper review also now as I went back to my hometown. \n\n",
  "metadata": {
    "root_comment_id": "laegqgb",
    "post_id": "1dp5i5x",
    "author": "Head_Fish794",
    "url": "https://www.reddit.com/r/PESU/comments/1dp5i5x/regarding_esa_revaluation/",
    "permalink": "https://reddit.com/r/PESU/comments/1dp5i5x/regarding_esa_revaluation/",
    "score": 4,
    "upvote_ratio": 1,
    "created_utc": 1719425833,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "laegqgb",
      "body": "Apply for re-eval. Grades do increase. They are not *very* common but they do occasionally occur. You should always take the chance given you are confident about your performance. If your grades increase, they refund 50% of the fee (if I remember correctly, could have changed).\n├── how do you apply for reval? i just raised a ticket in the student grievance redressal system. is that all i need to do?\n│   ├── Hmm they usually send out a form? Unless things have changed now. Maybe write a mail to COE and/or HOD. \n\nWe used to fill out a form and submit it.\n│   │   └── they haven’t sent a form in the mail yet and i don’t see any announcement or link on the portal. but i’m guessing they’ll put it out either today or tomorrow cus our results just came out yesterday, that too provisional. if it doesn’t, i’ll write a mail to COE.\n│   │       └── Ah. Give it time, it is usually sent out within 48 hours of results. And all results are provisional until final ESA results are released, which is after re-eval results are out. \n\nAll the best!\n│   │           └── aah okay, thank you so much!!!\n│   └── They release a notification in pesu academy which has a form, take a printout of that and fill it. Additionally, take a printout of the fee receipt after you have paid for the reveal. Take the signature of the hod of your dept, and submit it to the core office. This is the process in the ec campus. Not sure if the process in rr is the same.\n│       └── hey, i filled the form and took a printout of the fee receipt as well. but i’ll be leaving during the weekend when their COE office is closed, so do they accept the application through a friend? or do i have to write a letter to the COE personally explaining my absence?\n│           └── Not sure whether they accept the reval forms through friends, but you can try nevertheless. Just ask the coe office people once. :))\n│               └── sure, thank you!\n└── can your marks slip after reval?"
    },
    {
      "id": "lags02r",
      "body": "When's the last date btw for reval ?\n└── apparently they send a form within 48 hours of the results being out, so dw they haven’t sent it yet\n    └── Yeah they actually sent it now check it out\n        └── in the mail? cus i just checked and i haven’t received it yet\n            └── In the app\n                └── yeah, found it. thanks!!!\n                    └── Np\n                        └── hey just another thing, is it compulsory to submit the applications offline to the respective campuses?\n                            ├── I think so I've never done it before\n                            ├── I think so I've never done it before\n                            └── No u could email them but u won't be able to view your answer sheet. I myself emailed after 4th sem\n                                └── i did email them, but they haven’t replied yet. did they do the challenge evaluation for you though? despite not seeing the answer sheet.\n                                    ├── We haven't got the results yet but yes u can do it without viewing ur answer script too as they the paper entirely\n                                    │   └── aah okay, thanks!!!!\n                                    └── Have u paid the fees ?  Ig they will allow u once u show them the  receipt in the email\n                                        └── yes i did, but i haven’t attached the receipt. i’ll attach the receipt rn.\n                                            └── Yeah and fill the re-eval form too and attach it\n                                                └── can i simply fill the form and send them a photocopy of it?\n                                                    └── U can send them the soft copy on email if u aren't in blr\n                                                        └── aah fine that works, thank you!"
    }
  ]
}