{
  "id": "1dp6nlf",
  "title": "How to Fix my life",
  "content": "Sem-2 Results are out and I have a cgpa of 6.8 . I am a AIML student. How do I go forward from here.",
  "metadata": {
    "root_comment_id": "laepv6s",
    "post_id": "1dp6nlf",
    "author": "No-Cattle-6304",
    "url": "https://www.reddit.com/r/PESU/comments/1dp6nlf/how_to_fix_my_life/",
    "permalink": "https://reddit.com/r/PESU/comments/1dp6nlf/how_to_fix_my_life/",
    "score": 8,
    "upvote_ratio": 0.9100000262260437,
    "created_utc": 1719428713,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "laepv6s",
      "body": "At this point PES SHOULD FIX ITSELF.                                               \nThere's no way they can fuck up results this much,how can 8 graders drop to 6.5-7 and 9 graders to 7.5-8?! (Acc to data of 15+ ppl)\n└── Wdym?"
    },
    {
      "id": "lagrli6",
      "body": "Plan ahead and try to score 9+ from upcoming sems to fix ur gpa. "
    },
    {
      "id": "lagta4v",
      "body": "You are still in sem 2 bruh..\nDw you'll have plenty more opportunities to score and increase your gpa\nJust put in the hard work and you will definitely do better :)"
    },
    {
      "id": "lagtvfh",
      "body": "You're going to have to pull up your socks and work much harder, there's no way around it. Currently, your CGPA isn't enough to even sit for placements. If you score a 9+ every semester for the next 4 semesters, that will take your CGPA between 8-8.2. Being from a CS branch, this is still going to be the lower end of the scale when it comes to having a competitive GPA, but it's possible to still get good offers at this range. Figure out where you went wrong and double your efforts. Put in hard work consistently from day 1. You're going to have to sacrifice a lot for this but it's the only way to salvage that CGPA.\n└── How's AIML is it a branch on the tougher end, is it very code intensive so I should take coding classes in summer vacation.\n    └── I'm not sure if you're joking around by asking if a computer science branch is \"code intensive\". Of course it is. All courses except maybe a handful will require you to code out assignments and/or implement a project. \n\nThe language will depend on the course itself but expect Python and C to play a major part. So if you screwed up the C course, I'd suggest learning it thoroughly because you're going to need it for placements too. \n\nAIML is also very math intensive. There's going to be quite a bit of calculus, probability and stats.\n        └── I'm sorry I think I should reframe my question. I am thorough with python just wanted to know if that's enough for AIML or is it c intensive like cse\n            └── Firstly, you will end up with a SWE job itself because there are barely any true ML jobs for undergrads. Most ML jobs that are present for undergrads are basically glorified SWE/DevOps roles. \n\nYou'll still need to know C for multiple courses including DSA, DAA and OS. This is excluding any electives you take up which might also require C. And these are just courses - you'll still need C/C++ for internship/placements OA and interviews. You'll use other languages as well such as Python and maybe Java, but C is definitely part of every semester.\n\nYou cannot run from C - the only thing you can do is get better at it."
    },
    {
      "id": "lb4dltw",
      "body": "Following"
    }
  ]
}