{
  "id": "1dpg71v",
  "title": "Helppp",
  "content": "Pes rr campus cse or THAPAR (COE/cobs) or RVCE EEE and below",
  "metadata": {
    "root_comment_id": "lagpuzm",
    "post_id": "1dpg71v",
    "author": "Capable_Tooth1364",
    "url": "https://www.reddit.com/r/PESU/comments/1dpg71v/helppp/",
    "permalink": "https://reddit.com/r/PESU/comments/1dpg71v/helppp/",
    "score": 0,
    "upvote_ratio": 0.5,
    "created_utc": 1719454474,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "lagpuzm",
      "body": "How are y'all comparing across different branches. Just pick the branch you are more interested in.\n└── You say that as if most people are already interested in something in 12th grade lmao\n\nIn reality most people in 12th know Jack shit. And when you know jack shit, imo it's ideal to join the branch/campus that gives you the best future prospects\n    └── >You say that as if most people are already interested in something in 12th grade lmao\n\nThey *should* be. They *should* know which career path to pursue. Choosing a field in engineering shouldn't be based on cherry picking the one with better career outcomes but rather by interest. You're taking the first major decision in your life which potentially affects the rest of your career. You cannot be taking such decisions lightly, especially by just picking what everyone else seems to be picking. \n\nThere's enough career counseling services out there today but not enough people actually make use of them. My parents took me to one way back when 10th grade ended - this was back in 2016 when it was practically unheard of for JEE aspirants. I've spoken to so many aspirants over the years and most of them don't even know *why* they are pursuing something. Interest goes a long way in engineering. At the end of the day, we're giving these entrances to study the field of our choice, not to score the highest in the entrance.\n\n>In reality most people in 12th know Jack shit. And when you know jack shit, imo it's ideal to join the branch/campus that gives you the best future prospects\n\nFair, I can agree with this as a safe fallback choice. However engineering doesn't work like that. You can only fake an interest for so long. The cracks will soon appear before you know it and when you realise you've made a mistake you're going to suffer. I've seen people in my own batch go through this now.\n        └── The people who took cs or ece and then regretted it cause they aren't interested in it, are usually not interested much in anything to begin with. \n\nI've never seen a single person say \"I hate cs, mechanical is my calling\". A lot of them just hate studying stuff in general. \n\nTheir only goal is to make the most money possible and just take the path of least resistance. I think most people fall under this category \n\nThe people who are truly interested in any field let alone their field are really rare and will generally have a different outlook. \n\nI'm not saying either one is wrong, college is just something that can help you regardless of your goal, and maybe hopefully get you interested in your field as well.\n            └── >For a lot of people, the only goal is to make the most money possible and just take the path of least resistance. I think most people fall under this category\n\nYeah this is fair and understandable. I agree with this. Although my point still stands that this will only take you till a certain point in life until you hate yourself for the situation you are in. \n\nWhile neither method is wrong, people should take a moment to take an informed decision"
    }
  ]
}