{
  "id": "1dpt9m0",
  "title": "how was the result for all of you?\n",
  "content": "",
  "metadata": {
    "root_comment_id": "laj4gpy",
    "post_id": "1dpt9m0",
    "author": "Enough_Necessary7915",
    "url": "https://www.reddit.com/r/PESU/comments/1dpt9m0/how_was_the_result_for_all_of_you/",
    "permalink": "https://reddit.com/r/PESU/comments/1dpt9m0/how_was_the_result_for_all_of_you/",
    "score": 9,
    "upvote_ratio": 0.8500000238418579,
    "created_utc": 1719500163,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "laj4gpy",
      "body": "I think i speak for everyone and that it was ass\n└── did they applied relative grading?\n    ├── Idts\n    └── Not in mathematics for sure\n        ├── is everyone got lower grade or i am the only one who did very badly\n        └── they did relative, my friend got 10 in isa1, 12 in isa2 and matlab 12, matlab exam didnt write any shit, submitted the test within 30min, and he got a E grade\n            └── The people who failed math this time increased tho it's like 300+ this sem\n                └── Which sem are these 300?\n                    └── Sem 2.To be precise the number is 310.\n                        └── What’s the reason for so many to fail? Did they not prepare well enough or is it cuz the paper was out of the league\n                            └── ISAs were horrible for M2 and Sem paper was average,Ig it was hard for those ppl to cover up the marks lost in ISAs.And the grades are far below our expectations\n                                └── So what’s the lesson for us(I’ll be joining this year AIML)\nWhat wrong did yoh guys do which we should avoid\n                                    ├── My grades r not that good to give any lessons.If ur asking abt mistakes i would say sticking only to Classwork problems(U will get to know what r they) was a major mistake.For ISAs they didn't ask from them or similar to them, they were kinda different/hard(U can see fuck maths post for both sem 1 and sem 2 on this sub,someone posted).For ESA they did ask some good amount of questions from/similar to them cause so many ppl fucked up,since our ISAs were too bad grades didn't raise much.Practice QB(It's in pesuacademy website,u'll get to know everything) and if possible practice some good amount of questions from textbook too(This also ull find in pesuacademy website once u get access).\n                                    │   ├── Thank you for your guidance 😊\n                                    │   └── I honestly think PES has gone a bit overboard with the spoon-feeding of course materials. When I started college, all we had was the textbook - no PPTs, no worksheets, no prof's typed out notes, etc. Whatever notes we had was what was written down in class (so a good number of people in class actually wrote notes, because it was needed), so the textbook was essentially mandatory for most courses. I'd say arguably people in my batch went in better prepared because of the book, especially for courses which involved practising problems like EEE, ECE, Civil and Math. Plus it also pushed people to put in more effort.\n\nIn my 4th sem or so when PES introduced PPTs we all were pretty happy because it was a welcome change. We did not need to cover page after page from the book for ISAs and the slides made it easier to cover the syllabus in short periods. Then COVID hit and one thing led to another and soon PES started bombarding content in different forms - notes, PPTs, videos, etc.\n\nIMO they really need to roll back a bit on how much they actually provide. Slides and worksheets are ok. There are too many people now who don't even know *which* textbook is prescribed for a course. And some courses like DDCO and OS have absolutely amazing textbooks which explain concepts much better than the profs and their slides. Since you are entering 2nd year now, I would highly recommend picking up the habit of referring to the book. It will greatly help you out. If only people had covered the books, they would have done better.\n                                    │       ├── Thank you!.I'll definitely have to do it since my gpa is low now(7.75).I have no other choice but to do anything to push it up as much as I can.I will be more than happy to get any input on how to improve it further.\n                                    │       │   └── Consistent hard work. Ask most 9+ kid and they will tell you that it wasn't the hours of effort before the ESA that helped but rather the little effort they put in throughout the semester from day 1. \n\nTbh you don't even need to start from day 1. Do what I did - until 2 weeks before the ISA, just do the bare minimum needed for assignments and projects, but listen in class and make notes. Beyond the classroom, work on your interests, hobbies, projects or impress that person you have a crush on . Do not touch any coursework unless you need a break from your hobbies or you feel the need to study. \n\n2 weeks before the ISA, cut out everything else. Pay attention in class, make notes, go home and study. Do not do anything else but revise concepts for ISA, cut out all distractions. Avoid the temptation of working on your other interests. When you are studying, study from the source, aka the textbooks, as much as possible, Use the slides for revision (or when the book is unavailable), and cover EVERY resource - book, slides, notes etc. Spend time practicing problems, especially for courses with numericals like stats, AFLL, DDCO etc. \n\nTry these approaches and see which works for you. I can guarantee you that at least one of them will help you achieve better results.\n                                    │       │       └── Thank you so much!\n                                    │       └── This is explained so well! Can't agree more!\n                                    └── Looks like everyone got lower than they expected, so they mostly didn't apply any relative grading for any course. Math 2 usually screws everyone over and they loosen the grade map, but I guess this is what happens when they don't. \n\nThis experience just establishes the fact that PES exams aren't easy. It takes effort to score well and screwing up a single component like the ISA can hurt your final grade. People also tend to underestimate how much effort and practice some courses take to score even a B grade. That's why even scoring an 8.5+ at PES requires a good amount of effort. Also remember that course difficulty and workload increases as you progress through the years, so it's only gonna get tougher.\n\nI'm not saying that people didn't work hard - I'm just stating a fact here that exams at PES aren't easy and are definitely not possible to ace overnight. An overnight study will give you at best a passing grade.\n                                        ├── Got it\nSince I’m used to JEE. Prep, I think I won’t be leaving everything till the last moment\nBut yeah.. thanks for the message\n                                        │   └── Honestly, just put in regular effort. That's more than enough. 1-2 hours everyday is *more than enough* to do well and cross an 8.5. \n\nA lot of people face burnout after joining college because of the hectic JEE lifestyle, so they tend to take things easy when college starts and slack off. Plus they want to finally enjoy life and all college has to offer, which is fair. Add in the fact that PES isn't easy, it's a recipe for disaster.\n                                        │       └── Yep understood  \nthanks owl\n                                        └── Facts bruh I screwed up isa 1 and paid the price for it . People who say \"I'll cover up in isa2 or esa\" is insane cope cus even if they do the damage done by messing up isa 1 or 2 is irreversible\n                                            └── I honestly have insane respect for people who cross 9.5. Whether a 9.5+ is useful/needed is a separate question altogether but the amount of dedication, consistency and hard work required to cross a 9.5 at PES is extraordinary. The idea is simple but difficult to execute: get a near-perfect score on **every** ISA, project, assignment AND ESA, and then do it for EVERY course. Absolute chads."
    },
    {
      "id": "lajst5l",
      "body": "Personally with the amount of preparation I did i'd say it wasn't that bad\n└── I got my results as expected 😪"
    }
  ]
}