{
  "id": "1dpw14t",
  "title": "cse at bms vs aiml at pes",
  "content": "in a dilemma\n",
  "metadata": {
    "root_comment_id": "lajq6hv",
    "post_id": "1dpw14t",
    "author": "iamshashank_ste",
    "url": "https://www.reddit.com/r/PESU/comments/1dpw14t/cse_at_bms_vs_aiml_at_pes/",
    "permalink": "https://reddit.com/r/PESU/comments/1dpw14t/cse_at_bms_vs_aiml_at_pes/",
    "score": 1,
    "upvote_ratio": 0.6700000166893005,
    "created_utc": 1719507060,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "lajq6hv",
      "body": "Take bms and chill\n├── BMS has Same seats as PES So placement will be difficult in BMSCE\n│   ├── That's also there\n│   └── But better branch + significantly lower fees for equivalent placements. BMSCE is an easy choice here.\n│       └── What'd u say for same cs branch?\n│           └── BMSCE, because same branch + similar placements at much lower fees.\n│               └── I thought the same too , but apparently coding culture in bmsce is still lacking, idk if that alone is worth extra 50k or so though\n│                   └── PES crowd is significantly better, I agree.\n\nBut how is BMSCE only 50k cheaper? Are you referring to per semester fee difference?\n│                       └── I meant yearly fee. Afaik pes (thru cet) was 1.2L and bms(thru cet) was 65k\n│                           └── If its through CET then PES is an easy choice dude. Regardless of your other options, PES CS via KCET is top notch. However things change if its via PESSAT.\n│                               └── Ight tyy\n└── Hmm, cse placements is better at pes but not sure if aiml placements happen with cse, that's why idk if i should prefer bms cse to pes aiml\n    └── I'm second year in aiml pes. 3rd year starts in like a month and they didn't even give us the portions yet. The different subjects were not handled very well in my opinion. The only good part is that very few subjects are actually different. \n\nAnd God knows what placements will be like\n        └── Hey i am joining pes aiml this year .. can i dm you ?\n            └── No problem"
    },
    {
      "id": "lajxdsz",
      "body": "This year they Increased Seats"
    },
    {
      "id": "lansd4m",
      "body": "If you are getting aiml at rr, you will probably get cs at ec. That may be a better option"
    }
  ]
}