{
  "id": "1dqcdrh",
  "title": "BMSCE (ECE/ETE) or PESU (Ring road) (AIML) or MSRIT(ECE/ETE)",
  "content": "Which one should i take?\n\nWhich is better and why?\n\nI've heard PES is a little too strict and there' not too many chances they give to do extra-curricular stuff...... My dad is alumni of BMSCE (CSE) he told me that it's a little chill (he studied in the 90's)",
  "metadata": {
    "root_comment_id": "lan2wkx",
    "post_id": "1dqcdrh",
    "author": "Parametric_Peroxide",
    "url": "https://www.reddit.com/r/PESU/comments/1dqcdrh/bmsce_eceete_or_pesu_ring_road_aiml_or_msriteceete/",
    "permalink": "https://reddit.com/r/PESU/comments/1dqcdrh/bmsce_eceete_or_pesu_ring_road_aiml_or_msriteceete/",
    "score": 1,
    "upvote_ratio": 0.6700000166893005,
    "created_utc": 1719553494,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "lan2wkx",
      "body": "If cs pes. If you want elec take bms. \n\nIf unsure about branch, go learn what they are. If still unsure and want best prospects, take pes aiml\n└── okay......But pes fees is a little high no? Or is it same thru kcet\n    └── It's like 30k higher through kcet afaik.\n        └── Ic"
    },
    {
      "id": "lan35nn",
      "body": "i am getting pes eee in rr campus , and ece in electronic city campus. should i take either of them?\n├── i'd say ece better tbh imo\n│   └── okay , thank you\n└── ECE in EC campus is better even though campus sucks now.\nTry to keep up your grades and you'll be fine.\n    └── i will cs in colleges like nhce , but idk if i should choose those\n        ├── You should choose based on your interest. Because in the end you have to study everything by yourself. Teachers won't do shit for you. There are very rare teachers what are actually good at their job. Being smart or having a PHD doesn't really qualify them as good \"teachers\" iykwim. So don't think that if you go to a better college, you'll get a better CGPA, hence better placements. And in my experience it's really hard to score in core subjects at PES.\n\nSo if you're looking only for placements regardless of branch I'd say go for \"good\" colleges. Otherwise if you think you can study and do well, go for CS regardless of the college, gain skills, do online certified courses, hackathons, internships and build a portfolio. In my opinion, that's more valuable than the brand name of a college. \n\nIt's always a question of branch or college. Simple answer, or rather a question for you to answer - What is your interest and what you do see yourself doing in the long run?\n\nIf your interest lies in CS, you can get IT jobs even after doing ECE or ME or EEE. But you need to be good and have good skills.\n        └── What did u choose??\n            └── chose pes ec campus ece\n                └── Does PESU live upto ur expectations??\n                    └── NO"
    }
  ]
}