{
  "id": "1dqt2gk",
  "title": "Am I cooked?",
  "content": "I got into pesu through management (eee). And I am so scared . I regret every second of my 11th and 12th. I got sick before pessat and couldn't even perform well. And I was really mentally disturbed for almost 1-2 months cause of the regret . I was a good student all my life and I fucked up so bad in 12th. And I took eee cause I wanted that tbh and its 1L more than the fee through pessat and I know it's not worth it but my parents kind of talked me into it and I feel so guilty . I am really ready to work my ass off and get good grades. \nWILL I BE JUDGED BY MY CLASSMATES BY GETTING SEAT THROUGH MANAGEMENT?\n",
  "metadata": {
    "root_comment_id": "laqd7vn",
    "post_id": "1dqt2gk",
    "author": "Lost-Step-8395",
    "url": "https://www.reddit.com/r/PESU/comments/1dqt2gk/am_i_cooked/",
    "permalink": "https://reddit.com/r/PESU/comments/1dqt2gk/am_i_cooked/",
    "score": 20,
    "upvote_ratio": 0.8899999856948853,
    "created_utc": 1719605600,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "laqd7vn",
      "body": "nah bro just study hard"
    },
    {
      "id": "laqlk2v",
      "body": "Bruh you’re thinking too much…… \n\nIf anything, you should feel more entitled than us cuz you’re feeding the 🧀 to uni"
    },
    {
      "id": "laqmp8q",
      "body": "Na you won't be judged for coming in through management chill\n├── Imposter syndrome? Wdym?\n│   ├── Someone who feels out of place\n│   └── Like the sudden urge to vent\n└── are you in rr campus?"
    },
    {
      "id": "larq7o9",
      "body": "They won't even know if you're coming in from the Management seat or PESSAT as long as you don't tell them. \nSo chill and focus on your courses"
    },
    {
      "id": "larswd8",
      "body": "Just chill, study hard in first year and aim for a branch change. Cs in ec campus cutoff was only 7.4 and ece even lower. \n\nYou can definitely do it with the most minimal of efforts. \n\nI know management people who get gpas consistently in the 9s,8s,7s and ones who have multiple backlogs. College is a clean slate, make sure you study hard this time\n└── But OP doesn't want a branch change, OP wants EEE itself \n\nBut yes I agree. Some of my friends from management quota used to score 9+ too lol. There's no relation between management quota and how you perform."
    },
    {
      "id": "laryxg4",
      "body": "Mgmt student here, sooner or later people realise that a decent amount will outperform the cet/PESSAT students in college (there are ofc loafers who take management). Be truthful about it,there is 0 shame and put more effort in 1st year since people good in jee/cet will have advantage. After that it becomes a level playing field:) atb!!"
    },
    {
      "id": "laslhrz",
      "body": "EEE final year here. Honestly we genuinely don't know or don't care about who's management, who's pessat or who's cet. student. Genuinely, EEE feels like a family in the later years because of how small we are. It's a great place (sometimes). Just work hard and dont shy away from subjects that are difficult (there's a lot of them). \nFun Fact: I didn't even know some of my batchmates were management kids until a few weeks ago, that's how unbothered we are.\n└── how'd u find out lol"
    },
    {
      "id": "lasmc37",
      "body": "Hi, nobody's gonna know you're a MGMT seat. DW about that. \nWork really hard and don't piss off a professor in EEE"
    },
    {
      "id": "lasrhej",
      "body": "what's the fee thru management quota"
    },
    {
      "id": "lauhfb8",
      "body": "Bruh, do you have any idea how many people come in through management in engineering colleges all over the world??? It's not a big deal and nobody cares about it. Just do your shit, focus on educating yourself and doing what you like to do. First of all your parents shouldn't have \"talked you into it\" so don't be in fear of disappointing them."
    },
    {
      "id": "lb4oe51",
      "body": "Getting the scholarship money would feel so much better haha. In all seriousness you don't need to worry about it. People are usually chill but if anyone starts treating you differently just because you came through management quota then it's a very good sign that you need to stay away from them. Helps weed out the fake ones I suppose."
    },
    {
      "id": "lbpw4ju",
      "body": "dude just say my dad is rich fuck off (only if somebody tries to pick on you)"
    }
  ]
}