{
  "id": "1dr3mm8",
  "title": "How tough is branch change at PES(EC campus) will most likely be joining ECE. How much cgpa do I need for EC CSE or RR CSE branch change like is it possible?",
  "content": "Please let me know this year cgpa cutoffs for branch changes too ",
  "metadata": {
    "root_comment_id": "lasjafo",
    "post_id": "1dr3mm8",
    "author": "Illustrious_Bag_3134",
    "url": "https://www.reddit.com/r/PESU/comments/1dr3mm8/how_tough_is_branch_change_at_pesec_campus_will/",
    "permalink": "https://reddit.com/r/PESU/comments/1dr3mm8/how_tough_is_branch_change_at_pesec_campus_will/",
    "score": 3,
    "upvote_ratio": 1,
    "created_utc": 1719637693,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "lasjafo",
      "body": "EC campus ECE to CSE is fairly easy (7.5-8 CGPA). A switch to RR campus CSE will be much tougher (9.7+ for my batch)\n├── For rr campus ece to cse?\n│   └── Change of branch and campus counselling happens at the same place for both campuses, all cut offs are for the branch you want to change into. What branch or campus you’re coming from is irrelevant\n│       ├── Bro what will be the cgpa cuttoff for aiml branch in rr campus? I am taking CS in ec branch but want to shift to the main branch next year.\n│       │   ├── Iirc it was around 8, not too sure\n│       │   └── 8.2 exact last time\n│       └── Mkayy\n└── How to apply for Pes ec (cs) to rr campus(cs) and does this happen after 1st year? What is the crteria to apply for it? And how many students were able to pull this off last year?\n    ├── You’ll get a notification mostly in third semester about Change off branch/campus counselling. All fees for the upcoming year needs to be cleared. That is pretty much the only criteria to be ELIGIBLE to attend the counselling. Last year PES RR CSE closed at 9.7 CGPA and two students were able to make the switch\n    │   └── Ohk thnx! Also is there any rule in pes like you have to pay full fees of 4 years before taking admission. Like if I wanna partial drop, and I get a good nit or iit nxt yr, so I can dropout right without having to pay full fees?\n    │       └── Nope no need to pay 4 years fees at once. You have to pay it yearly.\n    └── Hi also is there any rule in pes like you have to pay full fees of 4 years before taking admission. Like if I wanna partial drop, and I get a good nit or iit nxt yr, so I can dropout right without having to pay full fees?"
    },
    {
      "id": "lass10o",
      "body": "For ECity AIML to RR AIML, what was it this year?(approx should be fine)"
    },
    {
      "id": "laswclv",
      "body": "If you score more than 8 you should realistically be able to get Ecc cse, Ecc Aiml or Rrc aiml. \nRR cse has a very high cutoff of somewhere around 9.7"
    },
    {
      "id": "lazs0an",
      "body": "How to change from Pes ec (cs) to rr campus(cs) and does this happen after 1st year? What is the crteria to apply for it and the cgpa cutoff? And how many students were able to pull this off last year?"
    }
  ]
}