{
  "id": "1dr7bh6",
  "title": "Partial dropper dilemma ",
  "content": "Ok so i completed my 1st year in rr CSE and i am a partial dropper as well I am really confused about what to do whether to go to bits or stay in Pes .So i got around 270 in bitsat and i might get ece in hyd or goa or eni in Pilani.Adv didn’t go to well due to rank inflation so i wont get a decent branch at a good iit for nit I ll be waiting for csab. I got decent cg in 1 st yr(9.3 and 9 in sem 1 and 2) so i can stay back at Pes as well so i am just really confused about what to do atm any suggestions will be helpful (as for branch idm either)",
  "metadata": {
    "root_comment_id": "lat5kzq",
    "post_id": "1dr7bh6",
    "author": "Original_Bat3183",
    "url": "https://www.reddit.com/r/PESU/comments/1dr7bh6/partial_dropper_dilemma/",
    "permalink": "https://reddit.com/r/PESU/comments/1dr7bh6/partial_dropper_dilemma/",
    "score": 16,
    "upvote_ratio": 1,
    "created_utc": 1719653009,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "lat5kzq",
      "body": "BITS dude. Pick the branch you like more between ECE or ENI unless you have specific campus preferences. Regardless of your choice, you will turn out much better than at PES.\n\nAlso, what an absolute madman. Managed to ace BITSAT AND has >9 CGPA. Congratulations dude, you should be insanely proud of yourself.\n\nAll the kids who screwed up first year are gonna be really mad xD\n└── As a first year who screwed up I can confirm he is indeed a chad"
    },
    {
      "id": "latdfhf",
      "body": "The only reasons to not go\n\n1 you want to graduate a year early/save money \n2 you like the lack of competition and love getting easy grades at pes\n3 you are only interested in computers and aren't willing to study another subject just to be in a better college\n\nImo sometimes it's better to be at the top of a lower college than average at a better one. But you're probably going to perform good over there too\n\nIf the above don't apply to you, go for it you absolute Chad"
    },
    {
      "id": "laugwp6",
      "body": "PES is gonna be hell for you in the next 4 years so be mentally prepared for that. If you really want to be in CSE then stay in PES, don't move anywhere.\nBut if you're okay with either of the 2 courses that are available for you at BITS, move ASAP. If you have a chance to not stay at PES, take it. It's horrible and pathetic here in PES.\n\nPES does provide good placement and package. But I'm guessing BITS would be doing a better job.\n└── Should I take MIT Bangalore over PES?\n    └── Nope, manipal Bangalore is new has to mature"
    }
  ]
}