{
  "id": "1dr97x6",
  "title": "Urgent help needed!! ",
  "content": "Guys don't ignore.. \n\nI've read in this sub that, people can switch their college after 1 year, so is it possible for me to switch from ec campus cse to re campus cse? \n\nDid anyone do that, plz help.. ",
  "metadata": {
    "root_comment_id": "latjj3f",
    "post_id": "1dr97x6",
    "author": "Unfair-Strength272",
    "url": "https://www.reddit.com/r/PESU/comments/1dr97x6/urgent_help_needed/",
    "permalink": "https://reddit.com/r/PESU/comments/1dr97x6/urgent_help_needed/",
    "score": 3,
    "upvote_ratio": 0.8100000023841858,
    "created_utc": 1719660848,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "latjj3f",
      "body": "People with very very high cgpa are able to go through campus change internally… you need 9.7+ if you want to change campus through the internal change of branch/campus counselling"
    },
    {
      "id": "latrsax",
      "body": "My friend did that. There were a total of three vacant seats in rr campus last year and the cutoff to get it was 9.65 or so. \n\nFor context, you'd probably have to be in the top 1-2% of your batch to get that much. So don't join in hopes of a branch change\n└── I can get cse in ecc, but I'll have to travel a lot...\n    └── In that case aiml in rr is not a very bad option"
    },
    {
      "id": "lattc4j",
      "body": "Yes you can change the campus , apply for change of campus (college will notify when it will happen)GPA criteria depends on GPA of people participating in campus change process . Usually for CSE it will be very high.\n└── My frnd can get cs in ecc, but he has to travel a lot, that's the issue.. Rr one is closer to him.. \n\n>GPA criteria\n\nDo you have any idea about the required gpa this year?\n    └── Mostly around 9.7+ like the top 2%people   \nBut this completely depends people participating in the process , dont expect it to come very low , most toppers participate  for it ."
    }
  ]
}