{
  "id": "1dre1ez",
  "title": "has anyone joining pes this year submitted the original documents?",
  "content": "im really confused whether we have to submit the documents now only or we can do it once classes start...",
  "metadata": {
    "root_comment_id": "launz0u",
    "post_id": "1dre1ez",
    "author": "draught0fLivingDeath",
    "url": "https://www.reddit.com/r/PESU/comments/1dre1ez/has_anyone_joining_pes_this_year_submitted_the/",
    "permalink": "https://reddit.com/r/PESU/comments/1dre1ez/has_anyone_joining_pes_this_year_submitted_the/",
    "score": 7,
    "upvote_ratio": 1,
    "created_utc": 1719675774,
    "flair": "PESSAT/Admission",
    "nsfw": false
  },
  "comments": [
    {
      "id": "launz0u",
      "body": "I've done it\n└── in rr campus right? bro i actually live outside of karnataka dont know how ill go to bangalore at such short notice...\n    └── Chill the date has been extended to 15th just check it once\n        └── ik but still it'll cost hell lot of money to book a flight now 😬 im so nervous....\n            ├── Book a train ticket \nStay here for a week\nExplore both the campuses and the areas around it \nYou don't have to worry about anything \n            │   ├── thank you ill see\n            │   └── acha did you receive any confirmation email after submitting the documents?\n            │       └── Nah\n            └── Are you sure you need to submit the documents this early? For us, we had time until almost halfway into the first semester.\n                └── im so confused its given in the website 15th july is the last date and i saw a reddit post from a year back the person was saying how their seat got canceled since the original docs were not submitted...\n                    └── Hmm, then I guess its best to submit them soon."
    },
    {
      "id": "laushfl",
      "body": "I submitted them a few days ago, and now they have extended the dates. \n\nf\\*ing stupid they are 😡\n├── did you receive any confirmation email after submitting the documents?\n│   └── Not yet\n├── when is the last date to submit ? pls reply\n│   └── 15 July rn\n└── what are the documents you have submitted?"
    },
    {
      "id": "laux04o",
      "body": "except 12th marksheet and 10th marksheet everything is done\n└── oh i see when will you be submitting the rest? i don't live in Bangalore so i was thinking whether it would be possible to submit the documents once classes start\n    └── whenever 12th marksheett is released ( im from karnataka state board )\n\ni heard from the seniors that u can submit before 1st sem\n        └── oh that's a relief thanks\n            └── welcome, btw ec or rr?\n                └── ec\n                    └── same, what course?\n                        └── cse wbu\n                            └── same lol\n                                └── yayay"
    }
  ]
}