{
  "id": "1drfn44",
  "title": "CSE in PESU or ECE in RVCE which one is better in terms of placements?",
  "content": "I am from a small town from karnataka. It does not matter if the college is strict or not but give me your honest opinion on this. I am focusing entirely on placements and will depend entirely on education loan. Please do answer this post ASAP!",
  "metadata": {
    "root_comment_id": "lauufp0",
    "post_id": "1drfn44",
    "author": "Chemical_Weekend_85",
    "url": "https://www.reddit.com/r/PESU/comments/1drfn44/cse_in_pesu_or_ece_in_rvce_which_one_is_better_in/",
    "permalink": "https://reddit.com/r/PESU/comments/1drfn44/cse_in_pesu_or_ece_in_rvce_which_one_is_better_in/",
    "score": 8,
    "upvote_ratio": 0.8399999737739563,
    "created_utc": 1719680225,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "lauufp0",
      "body": "I could also go for CSE with specialization in BMS or MSRIT through KCET please share your opinion on this\n└── See bro if you are getting PES CSE through PESSAT, it is definitely not worth the money, especially since you are taking an educational loan. You have mentioned that you can get CS specialization in BMS or MSRIT, which I think is through KCET or COMEDK, which would have considerably less fees compared to PES. The teachers in PES are mostly crap, syllabus is very hard and exam patterns are also really difficult compared to other colleges, so if you want to get good marks here, you need to depend completely on yourself. In terms of placements I think PES is definitely ahead, but you'll honestly need to make full use of that opportunity which requires a lot of hardwork. So the safer option for you would be to take specialization in MSRIT or BMS. Also I would recommend you to upskill yourself side by side through online courses. Best of luck.\n    └── PES accepts KCET too so would that still be a better option?\n        └── Are you getting PES CSE through KCET? If so, then probably it depends person to person. I also got PES CSE through KCET (Got a rank of 698), but I am really struggling academically due to the reasons I have explained. If I had a chance to go back in time, I would have told myself to join BMS or MSRIT instead. And about the syllabus thing, Syllabus is definitely more hard for PES compared to VTU colleges like MSRIT and BMS, you can confirm this by asking other seniors here.\n            └── hey , can u explain why ud rather have joined bms?\n                └── I already gave my reasons, to summarize: Below par quality of teaching, difficult syllabus, difficult grading, highly academically pressurizing, and placements are bagged only those having higher cgpa (not completely true but yeah). By joining BMS, not only would I have been able to maintain a very decent CGPA, but would also not feel stressed or burnt out, and my placement prospects would have been way more better."
    },
    {
      "id": "lav0veo",
      "body": "Arguably PES. CSE always gets the best packages, regardless of the college. Being in ECE might also handicap you because companies do prefer CSE grads, and there are significantly more CSE grads compared to an ECE grad. \n\nYou will find more details about getting an IT job as an ECE kid here: [https://www.reddit.com/r/PESU/comments/14c1iym/faqs/](https://www.reddit.com/r/PESU/comments/14c1iym/faqs/)\n└── If I have to choose between CSE in BMS, MSRIT or PES which would be better?\n    └── PES, MSRIT, BMS, in that order :)\n        └── I don't get it. Why does PES have a higher cutoff than the other two? And do you know the median package in PES?\n            └── Placement stats have been posted on this subreddit multiple times. Search and you'll get it."
    },
    {
      "id": "lavso4h",
      "body": "Rvce ece median is 14 afaik\nAnd pes cse we dont know real median\n(Split up into tiers and stuff) But most probably similar only\nIf you are looking for a cse oriented job go for cse at pesu only because handling ece+computer stuff on the side will be hectic\nAnd rvce's  computer cluster (ai,cy,ds) and ece cluster(eee, mech) and stuff have diff skill labs as well"
    }
  ]
}