{
  "id": "1drh9kb",
  "title": "HELPP!!SERIOUS HELP!!!",
  "content": "sooo my doubt is whether for management quota students will the scholarship be valid??As that is the bare minimun i can do for my parents,also how hard is it to get it,is it being realistic?can i acheiv it?",
  "metadata": {
    "root_comment_id": "lavm8ot",
    "post_id": "1drh9kb",
    "author": "Key-Head5179",
    "url": "https://www.reddit.com/r/PESU/comments/1drh9kb/helppserious_help/",
    "permalink": "https://reddit.com/r/PESU/comments/1drh9kb/helppserious_help/",
    "score": 2,
    "upvote_ratio": 1,
    "created_utc": 1719684700,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "lavm8ot",
      "body": "Yes scholorship is valid for management kids. Can you do it? That depends on your hard work id you do then you will be recognised for rit\n├── rlly lol?\n│   └── Wdym lol? Pesu doesn't discriminate between students from different quotas\n│       └── wtf rlly? shit yaar\n\nI was gonna withdraw my seat\n│           ├── I mean it's your choice at the end of the day management seats are overpriced and the roi isn't that great. Depends on your other options\n│           │   └── my other options are DU Bsc CS, Ashoka CS and NMIMS AI\n│           └── you joining via management dawg?\n│               └── Thinking\n└── well that saves a lot of breath for mee,what is the cretire to get scholarship any idea?\n    └── There are two types:\nCNR:\n 50% of semester fees \nYou have to be in the top 5℅ of the batch ( it is based on CGPA ( takes into account gpa of all semesters) \nFor this you have to really well from the first semester itself. \n \nMRD:\n40℅ of semester fees \nTop 20% of the batch. This is based on SGPA(gpa of current semester only) \n\nEveryone above 7.75 SGPA gets 2000.\n        └── THANK YOUU ,also above 7.75 SGPA GET 2000rs scholariship?is that it?"
    },
    {
      "id": "lazugcj",
      "body": "Bro it's simple, you have to come in top 20 percent of the batch in that semester, in easy grading semesters this might mean scoring 9.3+ in hard grading semesters, it might mean scoring 8.6 also"
    },
    {
      "id": "lb4hraf",
      "body": "Hey.. it's not going to be easy, make use of every minute judiciously. There are folks in this college who cracked jee adv and came to pesu only for cse. U will be competing against the best. Any less than ur A game and u can bid goodbye to 8.5 gpa for that sem. Scholarship you'll get if you get above 9. Pls don't take any class lightly.. and take classes very seriously.\n└── thank you for the heads up!!"
    }
  ]
}