{
  "id": "1dtgejx",
  "title": "Placents",
  "content": "What's the determining factor or like the one which has the most importance for getting a good offer during placements\nSkills or CGPA or resumè",
  "metadata": {
    "root_comment_id": "lb97gpf",
    "post_id": "1dtgejx",
    "author": "AlternativeGood9237",
    "url": "https://www.reddit.com/r/PESU/comments/1dtgejx/placents/",
    "permalink": "https://reddit.com/r/PESU/comments/1dtgejx/placents/",
    "score": 5,
    "upvote_ratio": 0.8600000143051147,
    "created_utc": 1719907115,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "lb97gpf",
      "body": "Short answer: everything. \n\nLong answer: \n\nYou need a good CGPA to not only be eligible to sit for placements but also to get shortlisted for companies. Companies use various parameters to shortlist applicants - the number of problems solved and CGPA being the two main ones. Depending on the company, they might shortlist candidates with 8+, 8.5+ or even 9+. Regardless, once you get shortlisted, CGPA takes the back seat. \n\nDuring the N interview rounds, it depends entirely on your skills (including DSA) and resume. They might ask you tougher DSA questions and ask for pseudo code, or they might ask you how a certain application might use a certain data structure. Or they might ask you about some framework/tool/CS concept they work with and ask you how it works. They might also ask you to explain your projects and then question you on the project. If the job role is well defined, they will ask you questions directly related to that role and test the skills needed to succeed in that role. \n\nSo basically it's not just a good CGPA that's needed but rather a good combination of everything. If you have only a good CGPA, you will either not clear the test or struggle during interviews because you are nothing beyond those digits. On the other hand if you have a top notch set of skills, excellent projects and experiences but have an average CGPA, you will find it difficult to get shortlisted (this happened to me). So the best solution is to ensure you have atleast an 8.5+ because that makes you eligible for almost all companies and also have all the skills needed to ace interviews.\n└── Which companies ask 9+?\n    ├── Tejas Networks\n    │   └── Ohh package  ?\n    │       └── Not too sure, check the placement sheet in FAQs\n    └── You can check the spreadsheets linked in the placement related posts. You'll find the companies listed there along with their exact cutoffs.\n        └── For ece guy 8.5+ will give entry to main right\n            └── The cutoffs set by a company do not depend on the branch. If they keep it as 9+, it'll be the same whether you're from CS, ECE or even EEE.\n                └── Is pes grading system harder than vtu? \nIf you dont mind sharing  please \nSupose vtu ece and pes ece  \nIf 94.5 percentiler with 98% percentile  physics will strrugle with ece  if he dedicate atmost 30mins  and 1 week good revsion  is it enough to keep  8.5 cgpa  or \nIs it harder than jee  advance \nSomeone told from vtu ece only 1week before exam is enough to get 8.5 cgpa \nSoo pls it will be helpful  if you answered\n                    └── I wasn't in ECE so I cannot answer in detail but I can guarantee that PES syllabus is significantly harder. 1 week study before each exam here will probably at best get you an 8+, but that's in CS. Ask an ECE kid for a more accurate answer\n                        ├── Wait at best ?\n💀💀\nYou guys study day and night ?\nIs it more hetic than jee preparation ?\n                        │   └── No, it depends on a lot of factors. But unless you start like 2 weeks or so before the exam you will find it tough to cover the syllabus. During internals there are no holidays between tests and during end sem exams there is 1-2 days at most.\n                        │       ├── So just cover topics logically which taugt in college daily  and dp bullshit assigments in college and revise before week is enough tight\n                        │       └── Anyway got it thanks dude \nStartted dsa now itself will try to grind dsa and cp till 2nd year\n                        └── Then steotrype of enjoy college life blah blah blah is just false?\n                            └── Mostly false, if you're going by standards set from movies and tv shows. It's definitely possible to have a great college life, but you need to have realistic expectations.\n                                └── Oh lol \nThen how do most people crack good it compnaies being ece student?\nEven my cousins did (msrit) but 10 years ago soo??\nIn tier 3 colleges like banaglore are there really people who grind cp dsa hard level ?\n                                    └── It has nothing to do with being an ECE student. As long as you have the skills and can get past the minimum criteria to sit for a company, you have a shot.\n                                        └── Dayum yes hoepfully \nNeed to mog cse people  in their own stream🔥🔥🔥"
    }
  ]
}