{
  "id": "1dtiym8",
  "title": "third years",
  "content": "People who are starting third year in August this year, how many of you have choosen groups for Capstone project and have some idea of the topic??!\n\n[View Poll](https://www.reddit.com/poll/1dtiym8)",
  "metadata": {
    "root_comment_id": "lbaghgk",
    "post_id": "1dtiym8",
    "author": "Strange-Slide-5300",
    "url": "https://www.reddit.com/r/PESU/comments/1dtiym8/third_years/",
    "permalink": "https://reddit.com/r/PESU/comments/1dtiym8/third_years/",
    "score": 2,
    "upvote_ratio": 1,
    "created_utc": 1719917720,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "lbaghgk",
      "body": "Friendly advice: you should finalise teammates soon and start contacting profs around September end/October beginning. Although the official forms roll out at the end of December or in January, most in-demand profs like Gowri, BJD, KSS and the like get reserved on a FCFS basis well in advance. So the only way to beat the competition is to arrive before the competition. \n\nUsually if you reach out to these profs early they might ask you to come back later at a certain point in time. If they do so, remind them again 2 weeks before the time they stated. That will ensure you are definitely on their list when they finalise which teams to accept.\n\nNote that this will not guarantee you a spot on their list, but gives you a shot at it. There are other factors like how relevant your idea is to their research interests and the potential of your team to carry out the said idea.\n├── Thanks!\n└── Adding on to this, due to the new rules of publishing 2 papers for capstone(maybe??) and a journal paper mainly, Its suggested that you guys start finding team and guide by 5th sem itself, so that it will not be a hassle later. \n\nAlso, if you have been working with some teacher(s) from previous semesters, you can pick them as guides, if those teacher(s) approve it.   \n  \nActually, this is what I did too, I was working under my guide since 4th semester & I picked that teacher as my guide and I am doing capstone under him now. \n\nHope this helps\n    └── thanks!"
    },
    {
      "id": "lbelavw",
      "body": "Chill enjoy holidays, and then after 6 th sem decide about it"
    }
  ]
}