{
  "id": "1du3xvd",
  "title": "How many credits for 3rd sem?",
  "content": "How many credits for 3rd sem?",
  "metadata": {
    "root_comment_id": "lbe43fe",
    "post_id": "1du3xvd",
    "author": "Academic_Tax8051",
    "url": "https://www.reddit.com/r/PESU/comments/1du3xvd/how_many_credits_for_3rd_sem/",
    "permalink": "https://reddit.com/r/PESU/comments/1du3xvd/how_many_credits_for_3rd_sem/",
    "score": 6,
    "upvote_ratio": 1,
    "created_utc": 1719975081,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "lbe43fe",
      "body": "24 credits assuming you do special topic\nPSA:Either do your special topic in summer or take up CIE L1 if you’re interested in entrepreneurship\n├── Why not do the special topic in the semester itself, leaving the summer for internships, vacation or other activities?\n│   ├── That's your headache\n│   │   └── I mean yeah but they're special topics at the end of the day. They take a week's effort at most. I'm just trying to find out the rationale behind pushing them to the summer.\n\nBack in my time special topics during the semester were mandatory. So nobody had to mandatorily do any course over the summer and by final year the course structure every semester would automatically ensure all credits have been met by 8th sem. The only reason people took up summer courses was to swap with existing special topics later. \n\nNot saying either is wrong, just want to know what's the reason behind picking the non-flexible option here.\n│   │       ├── Usually the assessment is much more lax in summer and it gets very draining since you’ll either have an extra long Monday or Friday,you’re much better off just doing it in that one week.\nI get leaving summer for internships and projects but the snowball effect of exhaustion over the weekdays really affects your grades\n│   │       │   └── Extra long? Don't classes end at 3:30/4 even when you have special topics? Or are they even longer?\n│   │       │       └── It’s 4 but they might leave you 5-10 minutes earlier,I might sound whiny but 3 full days at PES is quite draining and I personally can’t do much after a full day so in the end I guess it’s preference\n│   │       │           └── Yeah as I said neither is wrong. I would prefer to have the option to swap courses later because it gives me a shot to improve my grade.\n\nAlso boomer advice but if you are tired after 3 working days you are in for a hard time with 5 working days in corporate man. Maybe try making some lifestyle changes so your body and mind still have some energy to function beyond 3 days.\n│   │       └── Could you explain what you meant by \"swapping summer courses with existing special topics later\"? Can we swap any course and improve our grade or it's limited to only special topic courses?\n│   │           └── Before I explain, note that this is under the discretion of your department HOD and it may or may not be allowed anymore. Also, this was only allowed for STs in specific semesters and is mostly only valid in the 7th and 8th sem.\n\nIn your final year, there used to be an option to swap summer course credits for special topics, *if* you have taken up **extra credits**. So let us say you take up one ST each in the 3rd, 4th and 5th semesters. Assume that you have also taken up a couple of summer courses. Thus, you now have an *excess* of credits, and since college does not have a concept of early graduation, anything beyond 160 credits is excess and goes to waste.\n\nEarlier, the department would let you *choose* which special topics add to your 160 credit requirement. Thus, if you did not perform well in one you could always depend on another. However, there was a limit to swapping as well.\n│   └── I think he meant that it's better to get over with a subject quickly in the summer rather than drag it over the semester. \n\n\nIf you're someone who just wants credits, this is okay. But if you want to learn the subject, take a special topic during the semester. Summer courses are a scam. You gotta pay for them and they teach you content worth a semester in 3 days.\n│       └── You don't wanna pay separately for them and what will you do big in that 5 days of summer\n├── When will we be notified about Registration of special topics that should be taken in sem 3?                                                             Now they have announced only about entrepreneurship,wt about CSE special topics?\n│   └── Around second week of college they’ll send a form across I believe\n│       └── Okay, thanks!\n└── What do you  you mean by CIE L1??can you just explain\n    └── It is a special topic that delves into the basics of entrepreneurship. It is a fantastic course provided you have a strong team. It helps you to enhance your professional skills.\n        └── Tq"
    },
    {
      "id": "lbkcnqb",
      "body": "Assuming you are a CSE Student -> [Syllabus](https://pesufy.netlify.app/docs/branches/cse/)"
    }
  ]
}