{
  "id": "1du66a1",
  "title": "BMS/PES/MSRIT CSE vs LNMIIT CSE vs BITS MSc Maths/Eco vs BIT MESRA ECE vs RVCE ECE",
  "content": "I'm mainly interested in CS.  \nAm I right in preferring LNMIIT over PES and BMS as it only accepts JEE Main candidates and there is no management quota & reservation and less intake?",
  "metadata": {
    "root_comment_id": "lbef8py",
    "post_id": "1du66a1",
    "author": "theAntagonist__",
    "url": "https://www.reddit.com/r/PESU/comments/1du66a1/bmspesmsrit_cse_vs_lnmiit_cse_vs_bits_msc/",
    "permalink": "https://reddit.com/r/PESU/comments/1du66a1/bmspesmsrit_cse_vs_lnmiit_cse_vs_bits_msc/",
    "score": 4,
    "upvote_ratio": 0.699999988079071,
    "created_utc": 1719982643,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "lbef8py",
      "body": "Lnmit 100% over pes and bms if you could afford fees, it's coding culture is amazing and you are very interested in it, go for lnmit you won't regret\n└── Tu usko apna naam bat de terd ko gift bhehegs itne acche advice ke liye"
    },
    {
      "id": "lbem0mw",
      "body": "Bits anyday\n└── Dual degree is worth 40 lakhs and there is only a 1 in 5 chance he'll end up in cs. There's a high probability you may end up getting civil/mech/chem\n    ├── ReallyM\n    ├── not really, I agree that there is a 1 in 5 chance that he'll get cs maybe a bit more but 80 percent of dualities get cs, mnc and electronics. Very few people actually get mech, civil,chem. This is from a senior btw....\n    └── >1 in 5 chance he'll end up in cs\n\nthe CG cut off for CSE is like 7-8 and a bit lower for ECE, hell get pretty easily"
    },
    {
      "id": "lbfmreg",
      "body": "Bro please go to BITS Msc eco, it trumps literally any of the other options here\n\nLNMIIT aint that good"
    },
    {
      "id": "lbwvyrf",
      "body": "bits fosho, but if ur only interested in cs and don't want Phoenix branches at all, you can take lnmiit or pes"
    }
  ]
}