{
  "id": "1dvi4wz",
  "title": "just an experience",
  "content": "umm, this is a first hand account of one of the most significant experiences of my life being a first year student. i missed an ESA last semester (2nd). it was the subject i had scored the maximum marks in, in my internals and labs. i was so focused on my exam prep that i wasn’t aware of my exam timing being different from the last exam. so as expected, i missed it. it was devastating. i was having a breakdown in front of everyone present in the CoE department floor. the staff told me i would get an F grade in the subject and i would have to write a backlog exam to clear it. somehow, for the next few days i tried not to think about it and decided to write my other papers as if nothing had happened. fast forward a few weeks, my ESA results are here. somehow i had managed to secure an sgpa of 8. i was shocked when i found out i got a D grade for the subject i didn’t even write an ESA for. i called up the CoE department and they told me i had cleared it based on my internal and lab marks. on one hand i was happy i didn’t yet have a history of backlogs. my parents told me to be happy and be grateful about it. however, sometimes i feel kinda low when i realise i could’ve gotten a much better grade only if i had written the ESA. i also lost my scholarship. now that a few days have passed, i’ve processed the whole thing. and maybe it was just a lesson that i had to learn since i’m usually a little careless about stuff like this. \nthat’s all, haha. when life gives u lemons, sometimes u can only get half a glass of lemonade. make sure you enjoy it though!",
  "metadata": {
    "root_comment_id": "lbo7sfq",
    "post_id": "1dvi4wz",
    "author": "Pleasant_Initial_126",
    "url": "https://www.reddit.com/r/PESU/comments/1dvi4wz/just_an_experience/",
    "permalink": "https://reddit.com/r/PESU/comments/1dvi4wz/just_an_experience/",
    "score": 21,
    "upvote_ratio": 0.9700000286102295,
    "created_utc": 1720129368,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "lbo7sfq",
      "body": "A lot of lessons here\n\n1. To accept the mistake and try to be more careful next time.\n\n2. To reattempt, to review, find a solution and see how better one could have handled the situation.\n\n3. Having honest, open, respectful conversations with parents and having their support is a huge plus. \n\nAll great life lessons indeed."
    },
    {
      "id": "lbog78l",
      "body": "My friends and I always used to confirm the dates and timings of our exams with each other one day prior cuz we were too scared of missing them lol. Maybe you could do that too?\n└── yes, learnt to do that the hard way :’)"
    },
    {
      "id": "lbp1sfp",
      "body": "Thanks for speaking out and sharing this difficult experience. There's a lot to learn from this.\n\nHowever, it's kind of weird that they made the decision to use internals+labs and pass you instead. For two reasons: \n\n1. The rule is that if you don't show up to an ESA, you get an auto backlog, regardless of whether you could have passed in the other components. What prompted the change?\n2. The reason I am bringing this up is that you don't know how well you could have performed in the backlog exam. Now there will always be uncertainty about whether you would have obtained a better grade by giving just the ESA. \n\nI'm happy that things eventually worked out for you but I'm not entirely sure if this is the best possible outcome here. If I were you, I'd try finding out more details from the COE.\n└── everyone told me about the auto backlog rule, so i had already started preparing for the backlog exam. hence, i registered for the summer term backlog examination. initially, i had mailed the CoE department but they did not reply to my emails. so, my parents decided to call them up and talk to them. even the last mail had confirmed that lab marks won’t be considered. however, the latest rule that stands is if you clear either the lab exam or the ESA and your internal marks are enough for you to pass the subject, they’ll pass you. they didn’t really elaborate any more. also, they did not refund the exam fees that i paid."
    },
    {
      "id": "lbparv8",
      "body": "There is a reason they give timetable, better follow it. \n\nThat app sucks, dont rely on it\n└── yes, that was the exact issue i had faced. my app did not update the exam timing for the next day when i checked it last. however, it was my fault to not have seen the time table so i didn’t want to use it as an excuse for my carelessness :’)"
    }
  ]
}