{
  "id": "1dvqqko",
  "title": "Opinion abt Faculty",
  "content": "Currently moving to 5th sem cse. Got the elective's faculties list. How is gowri mam for data analytics and Prafullata mam for big data? Dont wanna make a blunder.",
  "metadata": {
    "root_comment_id": "lbpkg3y",
    "post_id": "1dvqqko",
    "author": "DaikonEmbarrassed147",
    "url": "https://www.reddit.com/r/PESU/comments/1dvqqko/opinion_abt_faculty/",
    "permalink": "https://reddit.com/r/PESU/comments/1dvqqko/opinion_abt_faculty/",
    "score": 2,
    "upvote_ratio": 1,
    "created_utc": 1720158476,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "lbpkg3y",
      "body": "Gowri is one of the best profs. She's very sweet and understanding too. She is extremely knowledgeable about the courses she teaches (she also takes CV) and is the best research advisor also at PES. She's also very friendly with students and there have been multiple accounts of her helping out students in need (can personally vouch for this). A lot of students stay in touch with her because she's a really nice person as well - if you go to the ground floor in B block you'll see the pictures she's taken with her capstone students on the boards. Her LORs are also very valuable (she is a CMU alumni). She is overall one of the best profs still left at PES. \n\nPrafullata is also good. She knows the course content pretty well and specialises in it too. She might not be the best but she's much better than the average prof here at PES. Prafullata is also pretty friendly, especially if you work with her as TA or part of the CCBD lab. She's very active on the group and keeps inviting her students to come visit and there have been multiple meetups too. Unfortunately I haven't been able to make it to even one but they all looked fun from the pictures lol.\n└── Regarding \"one of the best profs still left\" - I've seen similar comments suggesting faculty attrition on other threads too.  Can you please help with some more info on this? Where did the profs who left, go to? Other colleges in bangalore/india, or research/Industry?  And what would be the major reason - just even better opportunities outside or something else?  TIA.\n    └── Most returned to the industry as practitioners and researchers. I do not want to badmouth too much on a platform where people already know my identity, but it was basically disagreements and dissatisfaction with the management, workload, etc.\n        └── Thanks for the reply.  Workload is probably because of increasing batch strengths?  Hopefully things have stabilized now.  Other private colleges too might have gone through or going through similar issues with increase in batches,  new courses etc.  Our population is 1.5 billion and IITs are still happily operating at 100 batch size, so someone has to bear the brunt 🙂"
    },
    {
      "id": "lbq93n7",
      "body": "Where did you get the elective faculty list from?\n└── Usually remains the same right?\n    └── BROOO no offence \nBut why do you keep \" pride of pesu\" ?\nIs it close to your heart or something? Just curious!!\n        └── I was assigned it, you can't assign it yourself. \n\nKind of like a gesture for all the help I have provided.\n            └── Ohhh cool!! \nYep saw your messages not just pesu i feel it helps people from tier 3 colleges too!!\n                └── Thanks, much appreciated :)"
    }
  ]
}