{
  "id": "1dwszvc",
  "title": "Are these stats legit? ",
  "content": "",
  "metadata": {
    "root_comment_id": "lbwrx89",
    "post_id": "1dwszvc",
    "author": "Unfair-Strength272",
    "url": "https://i.redd.it/we0r6rnc9xad1.jpeg",
    "permalink": "https://reddit.com/r/PESU/comments/1dwszvc/are_these_stats_legit/",
    "score": 26,
    "upvote_ratio": 0.9399999976158142,
    "created_utc": 1720281915,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "lbwrx89",
      "body": "This whiteboard is maintained by the placement coordinator if I am not wrong. Cannot say anything about the exact numbers but mostly seems right and what is expected from the student maintained spreadsheet.\n└── Are ppos counted here?\n    └── I don't maintain this, so no clue. Another thing to note is that this also does not account for returning offers (people who joined as interns but received a full time offer based on their performance)\n        └── >(people who joined as interns but received a full time offer based on their performance)\n\nIsn't that what a ppo is\n            └── Not exactly. PPOs are given after completion of summer internships. You could argue they function similarly but PPOs also mostly require you to return for spring internships the next year."
    },
    {
      "id": "lbwu0er",
      "body": "this was 3-4 months ago\n└── What are the stats now? Can u plz provide them if u have.."
    },
    {
      "id": "lbx10p9",
      "body": "How are the percentages 52.8% and 60.1% for CSE EC and CSE RR? Shouldn't they be 45% and 51%? Can anyone explain this?\n└── \"Total\" in the bottom table means total number of students in the branch but placement percentage is calculate based on number of eligible students. You can verify it with the above table.\n    ├── oh! Thanks bro\n    └── but why bro this time placement is very low ?\n        └── recession bro\n            └── is placement season ended or ongoing?"
    },
    {
      "id": "lbx1c19",
      "body": "Yes these are somewhat old but I don't think it would've changed much because of FTE conversions."
    },
    {
      "id": "lbxelkx",
      "body": "These are pretty damn bad wtf I thought pes was good, I know we're going through bad market conditions but this is sad\n├── True man, the stats were so good last year, it had around 15 lpa median for cse.. It decreased to 12 this year..\n└── Bro these stats are similar to tier 2 nits, idk what else you expected lol\n    └── No lol not even close, the average might be similar but close to everybody gets placed at least. Look at the placement percentage it's literally sad wtf even with 9+ cg people didn't get placed\n        └── Check out nit kkr 2024 cse placements and see for yourself\n            └── I did, it's on their website. It's nowhere as bad as this, only 9 people in cs and IT aren't placed and the average is higher"
    }
  ]
}