{
  "id": "1dwt468",
  "title": "Capstone Teammates",
  "content": "Hey Seniors,\nI am entering 3rd year and wanted to enquire if there is any criteria for choosing capstone project team members? I heard we need to have a teammate from every CGPA band (9,8,7) and need to have a female teammate.\n\nDoes that depend on the Mentor or is that a hard requirement? \n\nWould also appreciate if someone could give a basic run down on how the timeline for the Capstone would look like? What are we expected to do? Is there something I could do to gain an edge? \n\nWould appreciate any insights or help! \n",
  "metadata": {
    "root_comment_id": "lbxtvau",
    "post_id": "1dwt468",
    "author": "FlushedFool",
    "url": "https://www.reddit.com/r/PESU/comments/1dwt468/capstone_teammates/",
    "permalink": "https://reddit.com/r/PESU/comments/1dwt468/capstone_teammates/",
    "score": 5,
    "upvote_ratio": 0.8600000143051147,
    "created_utc": 1720282232,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "lbxtvau",
      "body": "They usually send out these guidelines every year, however, it is not usually strictly enforced. They notified our batch as well but I know many teams which comprised all teammates with 9+ CGPA. Funnily enough, I still remember back when they had a meeting regarding capstone team formation (this was during COVID, so everything was online), one student raised a concern saying \"There aren't enough girls in the batch to follow the guidelines because most girls prefer all-girls teams\". This eventually turned out to be true because I knew so many who struggled to find a female teammate. So basically it usually isn't enforced but of course is best to at the very least meet the gender guideline rather than the GPA one.\n\nRegarding the timeline, they will clear it out when your capstone begins. It is split into 3 phases. Phase 1 (2 credits) during 6th semester is a preliminary phase where the focus is on forming your idea and doing a feasibility study, understanding the premise, performing a literature survey and documenting these. Phase 2 (4 credits) in 7th semester is the chunk of your capstone. You will work on the methodology, generate results, work on your hypothesis and perform experiments to validate it. Phase 3 (2 credits) in 8th semester is for wrapping up your project and publishing your work. The grade in this phase depends on where you publish.\n\nIf you want to gain an edge, (1) start early: the more work you finish early, the quicker you wrap up everything and focus on placements/Masters OR the more time you get to work on it and do a better job, and (2) put in consistent efforts so that you aren't breaking your back before each panel review and most importantly (3) pick a really good capstone guide - this can make or break your capstone because most good guides also have their own ongoing research projects/ideas and they can suggest those + some of them are really good at advising students and will ensure everything works out.\n└── This is great! Appreciate you writing such a detailed post. Thank you!"
    }
  ]
}