{
  "id": "1dxeeb9",
  "title": "Help",
  "content": "   \ncollege over branch or branch over college\n\n* should i opt for cs core at bms or cs specialization at rvce\n* is pes electronic City as bad as its shown to be\n* whats the subject taught in cse ? Curriculum \n* what cs specialization should one choose and how to find what's the best for them ?",
  "metadata": {
    "root_comment_id": "lc0zfy8",
    "post_id": "1dxeeb9",
    "author": "pussybilli",
    "url": "https://www.reddit.com/r/PESU/comments/1dxeeb9/help/",
    "permalink": "https://reddit.com/r/PESU/comments/1dxeeb9/help/",
    "score": 0,
    "upvote_ratio": 0.33000001311302185,
    "created_utc": 1720351794,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "lc0zfy8",
      "body": "Rvce\n└── sab question ka answer do pls\n    └── Go for rvce \nRest questions related to pes no idea"
    },
    {
      "id": "lc15a4m",
      "body": "If you can get into circuit branches (CS/IS/EC/EE) in RV you can keep that as your 1st preference, unless you don’t have any hatred towards EC/EE. I am not sure what you meant by just CS specialisation at RV.\n\nPES RR is pretty good for CS (opinion as an alumni), and about Electronic city I don’t have much idea. But as far as I know they do get almost same opportunity as RR campus in terms of placements.\n\nCS Curriculum is difficult to type in here, I’ll try to get the list of courses if possible.\n\nChoosing specialisation is purely upto either your area of interest or subjects where you think you can score better. You’ll get a fair idea on this once you are in your 1st year. \n\nAlso Im not sure of your options in hand, still\nI would suggest\nRV(CS/IS/EC/EE) > PES RR (CS) > bms (CS), Ramaiah (CS) > PES EC (CS)\n\n\nHope it helps!\n├── tf does ec and rr campus cse have that much difference\n└── Is ece at rvce really worth it over bms/pes cse considering I have equal interest in both electronics and cs\n    └── No, cse at bms/pes is the better choice"
    },
    {
      "id": "lc1p817",
      "body": "Branch over college always. Especially in this situation when none of your options differ much in reputation. Studying courses you are interested in goes a long way in making things easier and keeping your options open.\n\n>should i opt for cs core at bms or cs specialization at rvce\n\nCS core at BMSCE. [This](https://www.reddit.com/r/PESU/comments/147gamv/comment/jnve51g/?utm_source=share&utm_medium=web2x&context=3) answer is specific to CS-AIML but majority of the points also cover any specialisation.\n\n>is pes electronic City as bad as its shown to be\n\nNot at all. PES EC = RR for all objective comparisons. The only differences are subjective and become irrelevant after 3 years: budget for fests and fancy newer buildings. [Here is a comprehensive difference between campuses](https://www.reddit.com/r/PESU/comments/14anjmd/comment/jobruzy/).\n\n>whats the subject taught in cse ? Curriculum\n\nCan be found on the PES Media Discord server. Ask [there](https://discord.gg/KUSydtjaAh).\n\n>what cs specialization should one choose and how to find what's the best for them ?\n\nIdeally, do not pick any specialisation. Pick core CS and explore different fields before deciding which one to specialise in. Do not let college pick a path for you. If you absolutely must pick a specialisation, then spend time going through each curriculum and then see which one you like most. Talk to alumni who work in those fields, see if it matches your interests and skills. For example, AIML is math intensive and requires a good understanding of probability, stats, and calculus. People who do not like math generally end up disliking/hating ML courses.\n\nAlso, all the links I provided are from the friendly neighbourhood [FAQs](https://www.reddit.com/r/PESU/comments/14c1iym/faqs/). Highly recommend going through them.\n└── Rowley anna this year bmsce have increased there cse core intake to 900 and total cse related to 1440. Do you still say bms through comedk is better than pes through pessat\n    ├── Isn't the competition still higher at PES? Tbh the only benefits PES has are (1) slightly better placements (2) significantly better crowd/alumni and (3) stronger academic rigour. I do not know ComedK fees for BMSCE but if they are comparable, I'd choose PES, unless it's a financial burden. However I know that CET fees for BMSCE is lesser (20L cheaper) so in that case I'd recommend BMSCE.\n    │   └── Its between 2.8L-3.1L per year now through comedk\n    │       └── So that's roughly a difference of 8L with PESSAT? Hmm, it's still pretty steep IMO. Personally I wouldn't be able to justify the extra financial investment of 8L for crowd or slightly better placements but others are ofc might feel otherwise.\n    │           └── Ya I dont want to put an extra burden of 8 lakhs on my parents but the fact that scholarships at pes can reduce the fees a lot is making it tough for me to decide\n    └── how much was it earlier?"
    }
  ]
}