{
  "id": "1dxg3m8",
  "title": "Placement Statistics 2024",
  "content": "Could the seniors please tell us this year's placements statistics...  \nheard that 3 students were offered by DE Shaw?  \na clearer placements picture please?",
  "metadata": {
    "root_comment_id": "lc1bgji",
    "post_id": "1dxg3m8",
    "author": "Agile_Tip4177",
    "url": "https://www.reddit.com/r/PESU/comments/1dxg3m8/placement_statistics_2024/",
    "permalink": "https://reddit.com/r/PESU/comments/1dxg3m8/placement_statistics_2024/",
    "score": 31,
    "upvote_ratio": 0.9700000286102295,
    "created_utc": 1720357622,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "lc1bgji",
      "body": "You are late🤓\n└── Bruh does cgpa here refer to only btech cgpa or class 12 , 10 as well ? and if not then what's the class 12 eligibility criteria for placements ?"
    },
    {
      "id": "lc1dju9",
      "body": "why don't i see big companies :sob:\n└── Curious, which \"big\" companies are you referring to? Even a couple of companies from FAANG visit PES usually.\n    └── I was trying to find google amazon microsoft and stuff maybe too high expectations sorry\n        └── Google does not visit PES but there are multiple who get placed there off-campus. Search on LinkedIn, you will find multiple alumni.\n\nAmazon and Microsoft also regularly visit PES, maybe they did not visit this year because of the market. But last year they did visit.\n            ├── okay!  \n\n\noh is it? I did see previous years also and couldn't find them   \nMaybe missed so ill go and check again\n            ├── FYI, Google does not go to any college in India.\n            │   ├── lmao, another day of being glad to not be in PES\n            │   │   └── Doesn't matter, plenty get placed off campus at Google every year alongside the (assuming) on-campus placed kids from BITS which is a highly regarded T1. This gives the PESts more credit here than the BITSians. \n\nClearly shows that you don't need that college tag which some of you are nothing without.\n            │   │       └── T1 kids after reading this \"OmG  YoU gUyS sAlTy YoU cAnT gEt TaG bCuZ YoU dInDt ClEaR JeE eXaM \"\n            │   │           └── It's always the insecure ones who say that because deep down even they know that once you take that tag away they don't really have any industry relevant skills. Their PCM abilities got them through JEE and they think that's enough to get them a job too. What's worse is that through the last Masters admission cycle I saw so many T1 kids under the delusion that their tag was enough to get them into top US Unis and that \"getting into IIT means I'm qualified for top Unis\".\n            │   └── uhh Google does visit colleges. I literally just saw a post on btechtards with the salary breakdown of Google's visit to Thapar.\n            │       └── oh okay, i think they go to only a handful of colleges in India.\n            └── Also is there /will there be a \"apple recruitment cell\"\nIn pes \nApparently bmsce is getting one from this year \nIk one dude in pes who got placed in apple this year"
    },
    {
      "id": "lc1dya0",
      "body": "Talking about placement statistics \nThere was one on a whiteboard from.the placement coordinator or someone \nWere the stats mentioned in that according to ctc or base\n├── Ha usme to 12lpa tha shyd avg(or median ig) pes ke main campus cse ka\nBut is pdf ke hisab se to lgra ki is saal bhi shyd ache placements hue hai!\n└── I saw it too. CSE average was shown as 14.5 and ECE average was shown to be 8.2 with placement percentage being 60% of CSE and 28% for ECE at RR campus. Can someone confirm if that was true or not?\n    └── Total CSE students = 1486 ,  Placements for cse = 689 (Median = 12, Avg = 13.8 , Max = 52)\n\nTotal ECE students = 551, Placements for ECE  = 103 (Median = 8, Avg = 8.3, Max = 24.62)\n        └── these are for both the campuses?\n            └── I have mentioned RR campus , for both campuses I have put the placements stats picture above in this thread . You can check there"
    },
    {
      "id": "lc1h02l",
      "body": "It this only CSE students or all combined?\n└── The name of the sheet has \"CSE\" in it.\n    ├── Oh I didn't notice 💀\n    │   └── But my question is, can other departments sit for CSE placements, given they have the skills and a solid resume.\n    │       └── they can sit but its rare for them to get shortlisted is what ive read from other posts.\n    │           └── damn, thanks\n    │               └── There is a detailed comment by me about this already attached in the FAQs (under the ECE sections) if you are interested in reading in detail.\n    ├── Coudnt ece pepople sit for palcments\n    │   └── They can but it's an uphill task to compete with CSE. Check FAQs for more info.\n    │       └── Brooo i already started dsa prep ! Btw pesu  guy told oa rounds are cheated a lot in all colleges including iits and nits is it true?\nEven i have skill and dis honestly can cheaters take my position?\n    │           └── Yes it does happen. Happens at PES, happens at IITs.\n    │               └── 🥲🥲did you do same ? Is it compulsary or having enough grasp of dsa is enough?\nTrue even in cpp people have started cheating !\n    └── Not a student but considering joining the college: Do CSE vs CSE AI/ML, CSE DS and these specialization branches differ in placements? Can students from one branch apply to placements for other CSE branches?\n        └── Pretty sure they will all sit together for placements lol. There are no specialised roles for undergrad students, its very rare. Separation into teams by companies happens based on fit, and specialised roles especially AIML arent for freshers."
    },
    {
      "id": "lc5qg7t",
      "body": "[Pes-Placements-CSE-ECE](https://ibb.co/q0777v1)\n\nThis is the entire CSE and ECE placement statistics from the placement coordinator room\n├── these are different from what I saw. the numbers are updated ryt. how old is this one?\n│   └── This is the latest one , updated last on June 28th . What you saw is the old one\n│       └── were the stats for other branches shared similar to how these were? to get an idea what the overall university average and percentage were?\n│           └── AFAIK other branches placements are not shared because the placements are petty non-existent (batch strength is small as well ) as most go for masters and GATE\n├── This isn't opening man, can u plz share me the ss in dm..?\n├── is it legit because the placements are trash like half people arent even placed i have vit vellore cse cat 4 and amritha bangalore slab as options i feel they are way better than pes if the this stats are true\n└── Hi, do you have placement data of PES CSE for this year (2025)?"
    },
    {
      "id": "lcbjheq",
      "body": "Bruh what's was the eligibility criteria of class 12 ?"
    },
    {
      "id": "ltsvb4m",
      "body": "How about Product Marketing engineer role which Texas Instruments came for Campus drive ? What was the comp offered ?"
    }
  ]
}