{
  "id": "1dyag85",
  "title": "help**",
  "content": "going to join cse this year, \nshould I start doing DSA in Java or c++?",
  "metadata": {
    "root_comment_id": "lc76axp",
    "post_id": "1dyag85",
    "author": "Bitter_Front226",
    "url": "https://www.reddit.com/r/PESU/comments/1dyag85/help/",
    "permalink": "https://reddit.com/r/PESU/comments/1dyag85/help/",
    "score": 1,
    "upvote_ratio": 0.5600000023841858,
    "created_utc": 1720449296,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "lc76axp",
      "body": "python>c>java"
    },
    {
      "id": "lc788fo",
      "body": "anyday in cpp\n└── Oh okay"
    },
    {
      "id": "lc7d144",
      "body": "I did cpp & no regrets!\n└── Hmmm thanks!"
    },
    {
      "id": "lc7jmb1",
      "body": "Unpopular opinion, but golang."
    },
    {
      "id": "lc7q8nz",
      "body": "Please stop treating college like a JEE race. You don't need to grind DSA day after day to get placed. In fact if that's all you can do, you will definitely not get placed. College is so much more. Grow out of the JEE mentality - it's not about the one who solves the most problems. \n\nDuring school you prepared to get into college and from day one of college you're trying to get a job. It doesn't work like that. Instead of constantly trying to prepare for the next step, take a moment to actually be in the moment.\n└── Agreed. People in 12th thought not getting into an IIT or BITS would be the end of the world but ended up in PES. When in PES life goes on and you see alumni who've done really well in life without getting into an IIT. Same goes for initial placements\n    └── The main flaw in our education system is that people aren't interested in joining college to learn, they're interested in joining college so they get the degree for a job. Most don't even care about what they are learning as long as it gives them the degree.\n        └── I dont think so mate!\nRich people have chances to take risk enjoy parties  do some timepass with their parents money and call startups (non the serious one) \nIndia if you see 95% earn around 25k/month \nFor them job is one which gets out of this mess !\nIg degree doesnt matter but its just the elgiblity so yeah \nLearning i feel youtube >>>>>>> t2/t3 easily !\nEven most of iiitans nitian learn from gfg blogs videos  etc\n            └── I partially agree with your statement. I understand that not everyone comes from the same financial privilege and for them, a high-paying job is a way to a better life. I am also aware that most Indians do not have the financial liberty to pursue their interests and are focused on living a better lifestyle for themselves and their family.\n\nHowever, I do have concerns about ones with the financial liberty to do so. **Your degree should not be treated as an eligibility certificate**. You are here to learn. It is your **skills** that make you eligible for a job. The entire reason this is drilled into our brains is that coaching centres and alike brainwash students with the idea that college is only to get a job and nothing else we do there matters. The \"Get into T1 college, you will get 50+LPA CTC job\" philosophy is repeated multiple times, but not a single coaching centre focuses on what to do *in* college: \"Get into T1 college, you will get X, Y and Z opportunities to learn these fields, pursue research, network with profs, start your company and become industry ready for a job\". \n\nMost JEE aspirants I see are not interested in *studying*/*learning* at an IIT, they simply want to *clear JEE* or *get into* an IIT. They want all the benefits that come with the tag without actually making the most of their time at IITs - research, startup opportunities, etc. Tbf most of them barely do anything worthwhile because they know that regardless of what they do, they will still end up getting paid more than the average T2/3 college student. The apathy and disinterest are very concerning because these are supposedly the \"brightest\" minds in the country. Most of them are not really passionate about any field, they are only passionate about getting paid well. I can say that less than 5% of any branch in an IIT actually comprises students who care about that field. The remaining are there because its the *best branch they could get*.\n\nSure I am being extremely idealistic right now, but there needs to be changes in how we treat undergraduate education in our country. Higher education was never meant to be a rat race. It is literally called \"education\" for a reason.\n\nThis is already a long comment, I'll just link my other [comment](https://www.reddit.com/r/PESU/comments/1dumryi/comment/lbjh7kl/) to end this.\n                └── True but i agree !\nBut mate this life there is famous saying \nThose with passion dont have financial liberty to take risks for thier own dreams  and those with fiancial  liberty  dont have have passion nor dreams  as they have their needs fullfiled .\n \nAnd tbh we dont have enough jobs good ones i mean even if we have skills \nDue to free eudcation you can see neet cutoff 650 ypu aint getting seat\nSo yeah if pur education system was good enough for providing  funds for inovation then it would be great but just see isro budget top performing sicentist are underpaid  imagine how much underpay they would provide  for innovation \n\n\n\n\n\n\n\n>Strict population control needed with based on demographics(so india doesnt end up like europe)\n>Govt dont provide funds to family having more than 2 children\n>promote core branches -make labour laws so civil electronics electrical mehcanical are payed good as well\nBut for this mangment system caste resvartion should be ended ! \nCongress foucs was on freebies  bjp improved by focusong on infrastructure  but the real focus should be on education\nFreebies makes a day! Infrastructure  makes a decade !\nBut education makes a generation prosperous!"
    },
    {
      "id": "lcqej6e",
      "body": "Do it in whatever language you're already comfortable in. You don't need to learn a new language just to improve your problem solving skills."
    }
  ]
}