{
  "id": "1dyynme",
  "title": "How useful is the pre placement traning held for 10 days? ",
  "content": "We received an email stating that a placement preparation bootcamp will be held from 15 - 25 th of July. It will be in person, so I would like to know if it was held previously, and what they make us do for 10 days. Is it held at both campuses or only RR? ",
  "metadata": {
    "root_comment_id": "lcc0n23",
    "post_id": "1dyynme",
    "author": "Academic_Strike_4446",
    "url": "https://www.reddit.com/r/PESU/comments/1dyynme/how_useful_is_the_pre_placement_traning_held_for/",
    "permalink": "https://reddit.com/r/PESU/comments/1dyynme/how_useful_is_the_pre_placement_traning_held_for/",
    "score": 9,
    "upvote_ratio": 1,
    "created_utc": 1720519406,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "lcc0n23",
      "body": "I really don't think it will be any useful bro. This is happening for our batch for the first time\n└── No, PPT was there for my batch as well. Has been there for years. But yeah you are right about it not being useful lol. They cover DSA and DAA courses primarily and hold a couple of tests.\n    ├── PPT is already over for us in 6th sem bro.\n    │   └── Hmm, but the title says PPT (Pre Placement Training). How come you guys had it in 6th sem? Its usually over the summer before final year.\n    │       └── we underwent this - Pre placement test - in 6th sem. is it different? \n\nGreetings from PESU PPT !We enable PESU students to better prepare for placement exams, by providing them exposure to the types and levels of questions asked by top recruiters visiting the university,conditioning them to the test environment, and providing them feedback on their results for constant improvement.  \nWe would like to inform you that we have planned **Pre-Placement tests for 6th Semester** [**B.Tech**](http://B.Tech) students starting this week and mails for the same have been sent to the students.  \n  \nIt is extremely important that the students attempt all the exams, preparing them for their upcoming placements. Herewith, we kindly request you to encourage the students to participate in these tests.  \n  \nTypes of tests conducted:  \n**1) Technical Test :**  \n**a) Registration :** Monday, 9AM -  Tuesday, 6PM  \n**b) Test day :** Wednesday, 7PM(1 hour)  \n  \n**2) Coding test :**  \n**a) Registration :** Thursday, 9AM - Saturday, 12 PM  \n**b) Test Day :** Saturday, 6PM (3 hours)  \n  \nPFA the calendar of the Tests scheduled for this semester and their guideline.  \n  \nThe **first coding test is scheduled this Saturday (20th January)**, for which registrations will be open from Friday (19th January) 9AM onwards.  \n  \nThank you for your support!  \n  \nRegards,  \nPESU PPT\n    │           └── Ah no, I'm referring to these. We used to have this towards the end of 6th sem and over the summer after 6th sem. It was called PPT as well. \n\nMaybe this is something new or it could also be the same thing. Either way, it's all conducted by the PPT team.\n    │               └── yes yes, this is something different actually. \n\nThis is to inform that the placement office will be organising a pre placement training involving technical skills and soft skills to prepare students to be ready for placements.  \n  \nThe training program is proposed to be held during July 15 to July 25(except Saturdays and Sundays).  students are advised to make the best use of the opportunity for being successful in placements. Students interested in participating are hereby informed to register by using the link given on or before July 11, 2024 to make necessary arrangements for the training.\n\nAnd its **offline** \n\nthis is what *pesu placements team* sent us\n    │                   └── Ah nice to see them actually do something useful lol\n    └── Does this take place in the respective campuses or in just RR?\n        └── I'm not sure how it occurs now. For us it was entirely online but was available for both campuses."
    },
    {
      "id": "lcc7vv0",
      "body": "hi, was this sent only to 4th year students ?\n└── yes"
    },
    {
      "id": "lccqnap",
      "body": "probably  not useful cause what are they gonna teach that will help u in 10 days if they couldnt for 3 years"
    }
  ]
}