{
  "id": "1e1opz6",
  "title": "NIT AGARTALA(cse) vs PES RR (cse).",
  "content": "I am from south only, should i just take PES and enjoy banglore or Go to north east for sake of NIT tag.I am not concerned about placements in both college. Just want a good college and city life. Any adivce would be helpfull. ",
  "metadata": {
    "root_comment_id": "lcw8245",
    "post_id": "1e1opz6",
    "author": "CherryOk4647",
    "url": "https://www.reddit.com/r/PESU/comments/1e1opz6/nit_agartalacse_vs_pes_rr_cse/",
    "permalink": "https://reddit.com/r/PESU/comments/1e1opz6/nit_agartalacse_vs_pes_rr_cse/",
    "score": 4,
    "upvote_ratio": 0.75,
    "created_utc": 1720808609,
    "flair": "PESSAT/Admission",
    "nsfw": false
  },
  "comments": [
    {
      "id": "lcw8245",
      "body": "bhai chhup chap nit jha, you dont want the competition in pes,\n├── Pes rr cse anyday\n└── Well in 22 23 nit agartala cs had 14 lpa avg and pes rr had 17 18. Pes rr cs will be a better option than nit agartala unless you're hellbent on getting a nit tag.\n    ├── did you read their post fully?  \nclearly mentioned that they're not concerned about placements in both colleges and just want a better college and city life\n    │   └── Bangalore is a more happening place than Agartala . I am saying this as some1 who has visited both places.\n    │       └── sure but college life is not present in PES\n    │           └── Do you study in pes?\n    └── was the avg actually 17lpa?\n        └── Yes coz the strength was less at that time\n            └── In 2023 right\n                └── S\n                    └── It was nearly same number of seats ig\n                        └── For 22-23 batch?\n                            └── Ya\n                                ├── Dude, then how was the avg that high lmao..\n                                │   └── Without recession ig\n                                │       └── Still No way the avg would be that high for 1000 students.. \n\nWait lemme check that again\n                                │           └── Not 1000 for rr cse 600 \nEc cse 360\n                                │               └── Are u calculating manually using spreadsheet\n                                │                   └── Nah I didn't calculate anything, but the avg package that was mentioned as 17l was for t1 column and this avg might be different for t2 column.. So it means the total avg is not 17l , might just be 14-15l ig\n                                │                       └── Oh\n                                │                           └── Pes cse placements\n438 people got t1 (>12lpa)\n300 people got t2 (6-12lpa)\n28 people got t3 (less than 6lpa)\n                                └── I checked 2019 seat matrix now pes rr cse had 600 students"
    },
    {
      "id": "lcxjjgv",
      "body": "Yes"
    },
    {
      "id": "lczvy55",
      "body": "Don't know about the exact placement stats.\nAs per my observation PES RR has very good placements, and I believe NIT A would be having pretty good placements.\n\nBut leaving all this, NIT is a once in a lifetime opportunity. You'll not get it again, you'll carry that NITian tag throughout your career.\n\nBut you have to make the decision based on what exactly you want and consider the tradeoffs."
    },
    {
      "id": "ld3llyg",
      "body": "Take ece or something in an nit nearby. Don't ask these questions in the pes subreddit lol it'll just be copers who didn't even get anywhere close to your percentile in jee"
    }
  ]
}