{
  "id": "1e24i2n",
  "title": "Another questions",
  "content": "How is the culture of competitive programming at PESU ?  \nI heard people there are more towards projects and papers .........\n\nAlso what are some of the achievements PESU has achieved as an institute in India as well as world wide ?",
  "metadata": {
    "root_comment_id": "lcylba2",
    "post_id": "1e24i2n",
    "author": "Interstellar777077",
    "url": "https://www.reddit.com/r/PESU/comments/1e24i2n/another_questions/",
    "permalink": "https://reddit.com/r/PESU/comments/1e24i2n/another_questions/",
    "score": 10,
    "upvote_ratio": 0.9200000166893005,
    "created_utc": 1720855370,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "lcylba2",
      "body": "None, everyone is busy mugging up books and PPTs, say codeforces there and people will be like huh?\n└── Good for us \nColleges top 10 of banaglore  bave good palcments  we can eaaily be top 1% if things go right\n    └── Yeah thats good until you meet your IITian colleagues and see them being Candidate Masters xD\n        ├── True  but beign top 1% in banaglore is good start and slowly if discpline we can catch up\nBut is it true that these colleges dont (\nIf anyone has 1.7 or 1 l.8k with \nGood dsa projects + lld+ system design  get good stuff \nMaybe from colleges like bmsit or rvitm (combined palcmwnts\n        │   └── Jesus man I had an aneurysm by reading your comment. Please type properly. I can't even understand if you're asking a question or not.\n        │       └── Yeah lol i meant \nIf there is no cp culture in pes bms msrit like iits nit \nThen \nGood level dsa+ lld + system design + core concepts and good puzzle /cp solving can make us easily the top 1% ?\n        │           └── If you do even 50% of what you've mentioned you'll be able to get a good job from PES, maybe one of the top packages too. And there is a CP culture at PES, maybe not as much as other colleges. PES has a good development culture too btw.\n        │               └── Oh \nI may get ece though kcet \nI might choose bmsit or rvitm cse over it any loose ?\n        │                   └── Hey dm me if you're joining bmsit cse\n        └── Once you join the industry you'll realise all those rankings are useless. Nobody cares whether you're some Candidate Master or whatever other rank exists. There isn't any bias just because someone is more active on LC/CF/HR lmao. And neither does it matter if they're from IIT or PES. You aren't going to be given extra credit just because you cleared Advanced. \n\nAll that matters is how you perform at your job. The employee with better skills at the job gets recognised and promoted while the person shit at their job will eventually be phased out. And no, better competitive programming skills do not translate to better software engineering and design skills. Sure it helps build aptitude but the goal is to solve real world problems using actual development tools, and most people who force on competitive programming only often write extremely bad code and don't have the intuition to solve actual problems or for good software engineering and design.\n            └── Broo \nI heard finding intervieas is tougher than getting intevriew  so\nYeH it will matter  😅\n                └── How do you misspell the same word in two different ways in the same sentence 😭\n\nAlso that's because the market is shit. The poor market is affecting all colleges, including IITs. Referrals are the way now.\n                    └── Brooo \n\"Langauge is just medium \"\nWhat matters is that you understood😊\n\n\nYeah dude i am chad at typos"
    },
    {
      "id": "lcyreor",
      "body": "* Many people do competitive programming in PESU. Personally I do as well, but I just stick to **LeetCode** and **InterviewBit**. *CodeForces* I dont really explore, because I feel its not necessary for now. \n* There is also a *Competitive Coding Club named THE ALCODING CLUB* In PES university, RR campus.   \n* *Yes, there are multiple people publishing papers and doing great projects.*   \n\n* Achievements of PESU is a long list, you can check it in PESU website only."
    }
  ]
}