{
  "id": "1e24zwh",
  "title": "Internship ",
  "content": "Whats the scene of internships ? do companies also have class 12 marks as eligibility criteria for internship? And how much do they pay",
  "metadata": {
    "root_comment_id": "lcyofmj",
    "post_id": "1e24zwh",
    "author": "Fragrant-Buffalo8135",
    "url": "https://www.reddit.com/r/PESU/comments/1e24zwh/internship/",
    "permalink": "https://reddit.com/r/PESU/comments/1e24zwh/internship/",
    "score": 7,
    "upvote_ratio": 0.8199999928474426,
    "created_utc": 1720857379,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "lcyofmj",
      "body": "People aren't getting jobs itself so the chances of you getting a internship are pretty low and looking at how you framed your question I'm assuming you are gonna join the college from this year so your chances are close to zero unless you know someone to get you an internship, remember you are fighting with 2,3,4th years to get an internship unless you have a cracked resume forget it. Pay depends on the company some pay like really nice money , most of them don't\n├── What when I come in 2nd and 3rd year ?\n│   └── Depends on how good you're projects or your resume is\n│       └── Do they also ask for class 12 marks ?\n│           └── 95% of companies don't ask for your 12th marks, very few of them ask for it. If your question is if MNCs ask for 12th marks the answer is No they ask your GPA\n│               └── If someone has 66 percent during class 12 does it have any effect in placements or internship?\n│                   ├── No but if you have an similar gpa like this then it will affect your placement.\n│                   │   └── Bruh the semester exams are hard or like easy to be scored if one study well while enjoying life at same time and doing otherstuffs too?\n│                   │       ├── Hey man I mean no offence but you should take your engineering a little more seriously. You already have a very sub par 12th marks , you can enjoy and score well in pes but you should know how to manage both of them. And looking at your marks I don't think you know how to do it. The semester exams are a little on the moderate to tough side so you should make the appropriate call for your future.\n│                   │       │   └── Yes it's true I had brought ncerts last 1 months of boards so yes the score justifies my action\n│                   │       └── They aren't straightforward. Scroll a bit back and you'll find a lot of posts that complain how difficult it is to score here. Basically, it takes effort. If you study overnight, you may not pass (or you'll barely pass). To actually get a decent grade, you're going to have to put in a bit of effort. Marks aren't handed out like candy.\n│                   │           └── So like if we study regularly for semester perday it will alright ?\n│                   │               └── Yeah. Consistent efforts across everything.\n│                   └── Some of them do keep a 75% requirement but most of them do not have any.\n└── Just want to add that major MNCs will not recruit anyone before completion of their third year. It's standard practice. Until you hit summer internship season (summer after 3rd year), they will simply skip your application. \n\nStartups are different. They will pretty much hire anyone."
    }
  ]
}