{
  "id": "1e2jzh3",
  "title": "Regarding Girl's Hostel at PES south campus ",
  "content": "I am a bit confused whether i should opt for hostel or not. The rules look a bit too ridiculous and it looks like girls have little to less freedom there. Just wanted to get few questions clarified nonetheless.\n\n1) How is the hygiene in the girls hostel? \n\n2) There are rumors of bed bug infestation in the hostel. Is this true?\n\n3) do we get to go outside on weekends to roam around? \n\n4) How strict is the warden about the dressing sense? She mentioned (no make up!!) in brackets. Does this mean even light make up as in kajal or eyeliner isnt allowed? \n\n5) can we order food to the hostel? \n\n6) I have noticed that the windows of the hostel rooms is really small. Is there enough ventilation at all? \n\n7) How is the food provided? Do we get to cook food ourselves as well? \n\n8) Are hair dryers allowed? \n\n9) How was your experience staying in the hostel? I stay 35kms away from the campus. Do you suggest i opt for bus facilities or hostel facilities for the first year? Is there anything else that as a first year student that i would be needing to know about the hostel? \n\n10) is the cupboard enough for a person it looks too small?  \n11) do we need to purchase the mattress and chairs ourselves? ",
  "metadata": {
    "root_comment_id": "ld1no6f",
    "post_id": "1e2jzh3",
    "author": "Icy-Sprinkles682",
    "url": "https://www.reddit.com/r/PESU/comments/1e2jzh3/regarding_girls_hostel_at_pes_south_campus/",
    "permalink": "https://reddit.com/r/PESU/comments/1e2jzh3/regarding_girls_hostel_at_pes_south_campus/",
    "score": 7,
    "upvote_ratio": 0.8199999928474426,
    "created_utc": 1720902571,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "ld1no6f",
      "body": "well first off all, hostel is bad\nHygiene? if you happen to be in the ground floor, say hi to the rat family from my side.\nBed bugs? Yes. Found a bed bug in my room just after a few days of “bed bug deep room cleanup, gives 100% surety that you’ll never see another bed bug in your entire life “\nYou do get to go out only after succeeding the rounds of cross questioning by the warden, she doesn’t really care if you aren’t close to her, but if you keep smiling at her or are just nice to her (learnt it the hard way) get ready.\nAnd about makeup she might point out, never got yelled at for wearing Kajal or eyeliner but you never know, depends on her mood and your fate.\nYes you can order food but if you’re close to her, she will start a big lecture on why you shouldn’t order and bleh bleh who cares anyways.\nAnd about the windows, depends on what wing you get the room in, some are pretty well lit and some makes you feel like you’re a vamp.\nUmmm food, sigh, snatches your will to eat, atleast that’s what happened with me, but overall it’s bad, phulka is equivalent to a chewy flour cake, well let’s get to the bright side (not so bright) some dishes actually are good, emphasis on some.\nI owned a hair dryer but always used it soo cautiously, legit tried my best to make sure that the warden doesn’t listen to the sound cuz you never know what might happen lmao, as far as I know irons are a big no no but me being the super obedient do not get in trouble kinda student, I didn’t take any risk.\nWell my house is around 35-40 kms far from the hostel too but it all depends on who your roommates are and what kind of people you have around you, you might have fun you might feel lonely you might feel homesick, it all depends on the environment you make your space into. Honestly, imo it’s better you opt for a pg, the hostel rooms sure are much better and the environment might seem much safer to your parents but you have no freedom here. The warden gets nosy at times. Might as well barge into your room and start recording just to check if the room is “clean”\nNah you don’t need to purchase mattress and chair\nOh and you can cook your own food, there was a broken induction stove,wonder if they changed it.\nBut overall, my experience in the hostel was equivalent to living in a hell hole due to various reasons, the one and only reason to tag along with the hostel is because it’s “safe” according to the parents lmao.\nAnd the curfew is 6:30 lol, I once came back around 6:25 and the warden still shut the door on my face and made me stand out. Well to conclude, it really really depends on the kind of roommates you get and the kind of people around you (neighbouring rooms) if you’re social, if that’s not the case and if you prefer silence i guess you can survive.\n├── rip. Thank you smmmm. I hope the conditions have improved :}\n├── Also the warden is retarded. He’s gonna shame you and ask you about stuff if he sees you going out w guys and if they come to pick you up 💀\n└── To add on, the warden will skin you alive and call your parents if she sees you talking to guys from the boys hostel side. Like lmao they make a co-ed hostel in the same compound and expect us not to talk, logic¿"
    },
    {
      "id": "ld31jek",
      "body": "\n\n1. Hygiene is alright. Housekeeping cleans rooms and restrooms everyday (except Sundays). However, ppl are disgusting so more often than not you will find unflushed toilets and used pads thrown about in the washrooms.\n2. I'm not sure about this. I did not have bed bugs in my bed and neither did my roommates.\n3. Yes. But you'll have to be back by curfew time. (6:30)\n4. The warden is pretty conservative about clothing. I once got caught by her for going out in a frock one weekeend (the frock came up to my knees). She will not let you wear shorts or sleeveless tops either. I am not sure about makeup since I don't wear it but my roommate did everyday and the warden either didn't care or didn't notice.\n5. Yes. But before 6:30 pm only.\n6. There are a few rooms with two windows. If you're claustrophobic, I would suggest that you get one of those rooms. The ventilation is otherwise poor and it gets unbearably hot in the summer months, especially if your room is on one of the higher floors.\n7. Food is provided in the 2nd floor mess (includes breakfast, lunch, snacks, dinner). Non veg once a week. Yes you can cook your own food, there's an induction on the ground floor.\n8. The warden, for some reason, has issues with people bringing electrical appliances. If you can find a way to hide it then no issues.\n9. I'm also a Bangalorean that stays 30 km from campus. You CAN take the college bus if you're ok with spending 2 hours each in the morning and evening + a lot of traffic. I have a friend who lives in my neighborhood and his bus came at around 6:30 am and droped him  off at 7:00 pm. I went home every weekend so I didn't feel homesick. There is a laundry system in hostel but they're inefficient and often misplace clothes. \n10. Yes it's pretty small. Since I went home every weekend, what I did is bring clothes only required for a week.\n11. No. They will be provided.\n\nMy biggest problem with the hostel was the warden. She's an unpleasant cunt and makes everyone's lives hell. She's sweet when you visit with your parents but in reality shes absolutely awful. If you really desire the \"hostel experience, you can stay in hostel for your first year and take a PG from 2nd year.\n├── gosh it sounds painful. my parents arent so fond with the idea of me living in a pg sadly. Which floor has the two window rooms ? is there any particular \"comparatively better than others\" floor? hehe\n│   ├── Ground floor is mostly accommodated by the nursing students.\nFirst floor is for amaatra students they say but i still see some juniors living there.\nSecond floor is better imo because of the mess.\nThird floor is not bad too, we had a study room which is now closed.\n4th is just tiresome and it gets too hot during the summers. 2nd floor would be the best. But the thing is during the initial days it’s the warden who puts you in your room, you have no say in your roommates and the room, you can change after a while.\n│   │   └── I lived in the 4th floor and I swear I could have died of a heat stroke 😭 \n\nIt was terrible\n│   │       └── R u fr, me too, i wanted to kill myself it was soooo hot, and my fucking roommates didn't want to keep windows open and that too they stink so bad and don't even take bath, and leave their dirty clothes and shoes around and wet towels in a clump on the bed\n│   │           └── It's insane that the warden won't even let us wear shorts when it's boiling. Tf does she expect me to wear when it's 38 degrees.\n│   │               └── Bhai woh gaand marae, she doesn't tell us workers are coming to our floor to fix the water machine or anything else and then i get up and I'm going to the washroom looking shitfaced in shorts and these 3 men are walking like wtf???? Send a message in that goddamn group where you keep saying other shit no that HEY GIRLS BE APPROPRIATE FOR A BIT THERE ARE CREEPY PERVERTED MEN COMING TO FIX SOMETHING IN THE WASHROOM\n│   └── Two of my friends had double window rooms in the 3rd floor. There are very few on each floor and you'll have to ask the warden for it specifically because otherwise she randomly assigns rooms.\n│       └── ohh i see. Thank youu!\n└── To add on, the warden will skin you alive and call your parents if she sees you talking to guys from the boys hostel side. Like lmao they make a co-ed hostel in the same compound and expect us not to talk, logic¿"
    }
  ]
}