{
  "id": "1e39kgs",
  "title": "Confusion regarding submission of docs",
  "content": "So while scrolling here I found a comment thread discussing about going to the uni to submit docs before 25th. I have a few doubts about this\n1. They already checked all of the documents they required us to bring on the day of pessat 1st round counselling itself and collected photos and dd and stuff. I have also received a slip of acknowledgement about the document submission and the temp id card and merch. They said to login in their website and also asked to submit some details which have also been done (It included 12th marks card and all).\n2. The acknowledgement slip they gave itself is weird. They have checked half the checkboxes of docs to be submitted, but in reality I did not submit anything except photos and dd. All the documents mentioned in the acknowledgement were checked and handed back in the counselling, even though it shows only half are submitted.\nThere has been no communication from PES to me regarding this, so I'm confused whether this is relevant to me or not or is it related to kcet peeps. I only found out about this from a reddit thread in this sub which I know is not reliable info but I'm still worried as I don't trust pes communication too well.\n(Sorry for the long post)\n",
  "metadata": {
    "root_comment_id": "ld98gt7",
    "post_id": "1e39kgs",
    "author": "Audaticreddit",
    "url": "https://www.reddit.com/r/PESU/comments/1e39kgs/confusion_regarding_submission_of_docs/",
    "permalink": "https://reddit.com/r/PESU/comments/1e39kgs/confusion_regarding_submission_of_docs/",
    "score": 8,
    "upvote_ratio": 0.8299999833106995,
    "created_utc": 1720982298,
    "flair": "PESSAT/Admission",
    "nsfw": false
  },
  "comments": [
    {
      "id": "ld98gt7",
      "body": "cfbr\n└── Reddit does not work like LinkedIn. Upvote the post to increase reach."
    },
    {
      "id": "ld98h13",
      "body": "cfbr"
    },
    {
      "id": "ld9p3bh",
      "body": "Im facing the same issue too, though talking to seniors, I’ve been recommended to just give it after sem start"
    },
    {
      "id": "lda9iwy",
      "body": "Document submission applies to both PESSAT and KCET. You will need to go to PES and submit the documents they require at the admission department in RR campus (regardless of which campus you got a seat). If you do not do this before the deadline, your admission usually gets cancelled."
    },
    {
      "id": "ldafmbf",
      "body": "you have to submit but do so when you come for the orientation"
    }
  ]
}