{
  "id": "1e8083d",
  "title": "Doubt regarding which college to get admitted to.",
  "content": "I got a rank of 28.8K in KCET 2024 and a rank of 6K in PESSAT 2024 and I preferably want ECE branch in a college through KCET, I have considered BNM, RNSIT, JSS, DSCE(EEE), as options through KCET. I had rejected a EEE seat in PESSAT 1st round counselling. I also am planning to do my masters(M.S or M.Tech, idk) after working for a minimum of 2 years. So I need a bit of advice here. I can afford the PES EEE or ECE seat without the help of any student loan, but I also need to pursue further education which might be a load for my father who is nearing his retirement(in 2-3 years) and is building a house, and has to fund my brother's MBA too.",
  "metadata": {
    "root_comment_id": "le3tq0r",
    "post_id": "1e8083d",
    "author": "nightfury_017",
    "url": "https://www.reddit.com/r/PESU/comments/1e8083d/doubt_regarding_which_college_to_get_admitted_to/",
    "permalink": "https://reddit.com/r/PESU/comments/1e8083d/doubt_regarding_which_college_to_get_admitted_to/",
    "score": 14,
    "upvote_ratio": 1,
    "created_utc": 1721494754,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "le3tq0r",
      "body": "bro I don't think pessat fees r worth it especially for electronics\n└── I don't mean to counter your statement, but i just want to know, that for my KCET rank what decent college options I would have for ECE.\n    └── look at last year cutoffs nd shortlist clgs and why don't you prefer cse?\n        └── I sure am interested in software engineering but the fact that multiple Devs are getting fired and the development of AI(though it might take like 10 years atleast) I'm scared for the long term.\n            ├── brother 10years ago also same thing people told don't take cse it will fall in next couple of years now also people r saying same thing nothing is gonna happen cs will never decline dude it's just market was very vulnerable this year it'll pick up nd wen your going to a bit lower clgs it's better to prefer cse\n            └── nd one more thing like since thru kcet your options r not that gud ig pes might be best option if you get ece take it without thinking\n                └── Hmmm, what about EEE and taking a chance at branch change in PES? Or some college like BNMIT or RNSIT ECE/EEE(question of third round counselling) then branch change to CS/ECE respectively.\n                    └── branch change is especially tough you can't depend on it just remember if it goes wrong ur stuck in that branch for 4years I hv heard eee is the toughest branch but if you feel you can handle it then it's fine ig nd chck their placements too bnmit rnsit even tho fees r lower not that good go with pes only\n                        └── But I'm not exactly looking for placement as I'm gonna go for masters, so if I decide on going abroad it's gonna be costlier, we'll it's less expensive to go to Europe for education than to the US but still costlier than studying in india. So I'll have to try saving now, don't I? I've gotten 2 types of advice, one is the one you gave, as placement in other KCET colleges are bad, go for pes. But the other ones say that just go for the KCET college and save your money for your masters.\n                            └── yeah dude both the advices r good uhm pretty confusing tbh just take some time to decide ig talk to your family hear out their opinions"
    },
    {
      "id": "le40vj9",
      "body": "Since u don’t wanna take a student loan now \n\nI don’t think u would wanna take one for ur MS either \n\n\nSo the best option for u would be Germany ( due to no tuition fee) or somewhere in Europe\n\n\nSo ur university or the university to which ur college is affiliated needs to have H+ status on Anabin website \n\nSo would recommend u to join a decent college and check its status before joining \n\n\nRECOMMENDATIONS:-\n\n1) EEE chances are bleak in Pessat as at first round it got closed at 4 or 4.5\nBut if u get it second it’s the best bet u hv got \n\n\n2) around 28 k u can get ece at the following colleges \n\nI)new horizon\n2) Dayananda Sagar University (not Dsce)\n3)RNSIT (2nd round )\n4) BNMIT (2nd round )\n5) ETC at Dsce \n6)MVJCE\n7)DSATM\n\n\nIf u want mech \nU can get it \n\n1) rvce (2nd round )\n2) PES (1st round )\n\n\nDon’t get into mech unless ur interested , but it wouldn’t be a bad option if u do it at RVCE and u will do MS in Germany \n\n\nEEE is hard and if u don’t get Ece in good colleges \n\nU can take EEE at \n\n1) BMSITM\n2)DSCE \n\n\n\n\n\n\nSO OVERALL \n\n\nUR BEST OPTION IS EEE AT PES \nIF U GET IT IN SECOND ROUND TAKE IT BLINDLY\n\n\nOR \n\n\nIF WANTED SOMETHING THROUGH KCET \n\nEEE AT BMSITM , EEE AT DSCE , ETC AT DSCE \n\nARE THE BEST OPTIONS \n\n\nWOULDNT RECOMMEND MECH IF UR NOT INTRESTED \n\n\nALL THE BEST FOR YOUR FUTURE ; )"
    }
  ]
}