{
  "id": "1e8odkp",
  "title": "Will taking ece at PES EC Campus ruin my future ",
  "content": "Pls tell everyone is telling me it's really bad n worthless but I do not have good options I thought this was the best our of those is it really that bad there",
  "metadata": {
    "root_comment_id": "le8joqd",
    "post_id": "1e8odkp",
    "author": "jeecrack2024",
    "url": "https://www.reddit.com/r/PESU/comments/1e8odkp/will_taking_ece_at_pes_ec_campus_ruin_my_future/",
    "permalink": "https://reddit.com/r/PESU/comments/1e8odkp/will_taking_ece_at_pes_ec_campus_ruin_my_future/",
    "score": 5,
    "upvote_ratio": 0.7300000190734863,
    "created_utc": 1721574391,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "le8joqd",
      "body": "Best or worst depends on you\nIf you dont study dont upskill worst\nIf you study and upskill best"
    },
    {
      "id": "le8vtgp",
      "body": "Bro  since you have no other options grind in first year and change to a better branch \nThe cgpa cutoffs for changing to \nRr cse was 9.68\nRr aiml was 8.20\nAnd ec cse was 7.4\n\nEc cse needs just a bit of effort \nAnd if you get even better than you can go to rr itself \nThough wouldnt recommend switching to aiml"
    },
    {
      "id": "le96rei",
      "body": "It's not gonna ruin your future or anything, that's a bit dramatic. But it definitely sucks big time. ECE on its own is really hard and you'll hv to put in a lot more effort than CS students to come even close to their CGPA. And if you don't like advanced math and physics, you'll hate every subject in ECE. And EC campus ECE is like 10 times worse than RR. The teachers suck, the campus life is the worst and you won't have a lot of fun unless you have really good frnds and do stuff outside clg. My advice is try getting 9+ CGPA in sem 1 and 2 and try switching to RR ECE or CSE. If that's not possible, just try to get through sem 3 and 4, it gets easier after sem 5. Don't stress about it too much. Classes and exams are waayy more liberal now than it was for my batch. If we got through it, you guys can as well"
    },
    {
      "id": "le9bxhr",
      "body": "Wats ur rank? Probably  in 2nd round u can get aiml in EC\n└── its 3664 will i be able to get it\n    ├── Hmm with this rank its tough to get in 2nd round actually.\nBecause aiml in EC got over at 3501 in 1st round. I dont yet how many seats will still be available in 2nd round. Only way of getting something good is try to get a good cgpa in first year for branch change\n    └── Bro my rank is 3665 and even i am getting nervous but if it is tough for you it is tough for me and everyone so don't really worry"
    }
  ]
}