{
  "id": "1ebvs01",
  "title": "Does capstone project starts in 5th sem ",
  "content": "I know lot of people who are already forming teams also, even some people are saying according to new rules capstone starts from 5th sem ",
  "metadata": {
    "root_comment_id": "levlba5",
    "post_id": "1ebvs01",
    "author": "Suspicious-Nobody-05",
    "url": "https://www.reddit.com/r/PESU/comments/1ebvs01/does_capstone_project_starts_in_5th_sem/",
    "permalink": "https://reddit.com/r/PESU/comments/1ebvs01/does_capstone_project_starts_in_5th_sem/",
    "score": 13,
    "upvote_ratio": 0.9399999976158142,
    "created_utc": 1721916421,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "levlba5",
      "body": "Teams needed to form during 5th ig. Finalizing the problem statement and everything can be done in during sem 6. \n\nFor our batch (2025) we were asked to submit our team along with guide details suddenly before 6th sem was about to start. And this was after the chairperson told us not to bother and approach professors during sem 5.  Even right now for our batch they changed rules for special topic overnight and are forcing interning students to leave internships and come take up courses lol. Basically, CSE dept is not very good at conveying rules and will go back on the rules they themselves made mindlessly. Better be prepared.   \n  \nJust find yourself good teammates and possibly explore a few avenues of your interest, don't stress over it too much. then if possible, approach a few good professors with or for ideas.\n├── Indeed management has become a shitshow lately\n├── Rules changed now, Capstone starts from 5th sem only bro for juniors\n│   └── So does that mean no special topics in 5th sem? Is it still 6 + 6 for special topics/ summer courses + internship?\n│       └── mostly yes\n├── Is it compulsory to have atleast 1 female student in the team?\n│   └── No they'll just mention that at that start, lots of all boys and all girls teams in my batch. They probably won't enforce this rule for you either\n│       └── I see Thank you!!\n├── >Even right now for our batch they changed rules for special topic overnight and are forcing interning students to leave internships and come take up courses lol.  \n  \nWhy are they forcing interns to take up courses? Can't they take those in fourth year? What are the new changes?\n└── Bruh wtf. Why spoil internships ... Why are they ruining the college so badly past two years"
    },
    {
      "id": "lewen53",
      "body": "Can we make team across departments?\n├── Yes that would be allowed\n│   └── cool thanks\n└── You can do that, but better to confirm from your capstone projects coordinator\n    └── ok"
    },
    {
      "id": "lewetyw",
      "body": "can we make team across departments?"
    },
    {
      "id": "lezwm8g",
      "body": "Also is it mandatory to form a team with atleast one from other gender"
    }
  ]
}