{
  "id": "1eclbl7",
  "title": "Partial Drop in PES RR campus, engineering ",
  "content": "If anyone here has taken a partial drop at PESU, and went to a different college after the first year, please send me a dm, i have a few doubts i want to clarify.",
  "metadata": {
    "root_comment_id": "lf0qrc9",
    "post_id": "1eclbl7",
    "author": "Special_Quarter_6624",
    "url": "https://www.reddit.com/r/PESU/comments/1eclbl7/partial_drop_in_pes_rr_campus_engineering/",
    "permalink": "https://reddit.com/r/PESU/comments/1eclbl7/partial_drop_in_pes_rr_campus_engineering/",
    "score": 3,
    "upvote_ratio": 0.8100000023841858,
    "created_utc": 1721991902,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "lf0qrc9",
      "body": "i had asked this question here like  a month ago. from what others told partial is not possible because of college pressure. They told its a rat race and if we f up our cgpa we are doomed. even i was planning on partial but now i am scared. But if there are many of us who are trying partial drop, lets make a grp after clg starts.\n└── Don't worry about all that, i just want to confirm a few things with those who have taken a partial drop, succeeded and went on to another college.\n    └── There are not many, probably at most 1-2 per year (and that is being generous). It is not easy to manage time for JEE prep and academics at PES. Most end up screwing up both their GPA and their partial drop attempt. I would recommend a complete drop. Please go through this subreddit, you will find multiple opinions posted by people on why a partial drop does not work here. TLDR; this college is not the place for partial drops because of the academically rigorous environment.\n        └── i am already done with my 11th and 12th, by partial drop all im doing is revising it once in a while, but that isnt what the topic is, i just want to clarify a few doubts i have about leaving the college and if we have to pay the 4 yrs fee when leaving or just 50% of the 4 years fee, because if pes has a program that lets in people from other colleges during first year, they should let people go out too.\n            └── You will not have to pay the remaining years' fees. You can leave after 1st year."
    }
  ]
}