{
  "id": "1ecmwl0",
  "title": "PES (EC) CSE VS PES (RR) AIML VS BMSCE(CS SPEC)",
  "content": "Ik most of u guys say cse at ec campus should be preferred but as the placement opportunities of aiml and cse is the same shouldn't I prefer the better campus (RR) ?",
  "metadata": {
    "root_comment_id": "lf0wfc5",
    "post_id": "1ecmwl0",
    "author": "jalagara_",
    "url": "https://www.reddit.com/r/PESU/comments/1ecmwl0/pes_ec_cse_vs_pes_rr_aiml_vs_bmscecs_spec/",
    "permalink": "https://reddit.com/r/PESU/comments/1ecmwl0/pes_ec_cse_vs_pes_rr_aiml_vs_bmscecs_spec/",
    "score": 12,
    "upvote_ratio": 0.9300000071525574,
    "created_utc": 1721997056,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "lf0wfc5",
      "body": "Wait who said placement opportunities are same ....?\n└── i heard students from both cse nd aiml sit together for placements?\n    └── Where have u heard this since no aiml student has sat for placements so far, the first batch for aiml will graduate in 2026.\n        └── In other colleges I meant"
    },
    {
      "id": "lf1kmjb",
      "body": "CSE and CSE(AIML) placements for undergrads will be the same. There are no AI/ML roles for undergrads so they'll be going into CSE SWE jobs with the same packages. The reason it's recommended to take core is if you're not sure what you're interested in and don't want to risk studying something you may not like.\n└── okayyy\n\nso should i keep pes rr aiml above pes ec cse in my option entry priority list?\n    ├── Well thats what I did personally,  owing to my interest and the courses I had done in AIML. But it's upto you. I feel if you're willing to study and have an interest in technology , you can go for PES RR AIML\n    └── I would recommend choosing core CS. Its documented in detail in the FAQs: [https://www.reddit.com/r/PESU/comments/14c1iym/faqs/](https://www.reddit.com/r/PESU/comments/14c1iym/faqs/)\n\nCheck the question related to CS vs CS-AIML."
    },
    {
      "id": "lf1q4hd",
      "body": "have literally the same dilemma, I have heard from enough people that core is better always, so that sorts out the two options (although everyone I ask who isn't from pes is skeptical of the electronic city campus idk why).  \nNow coming to BMSCE, I was inclined towards it until i heard about the massive seat increase, also the argument that core is always better applies here too. If BMS core cse was an option, it would be a tough choice\n└── same situation. \n\nppl on this sub be sayin rr=ec but ppl outside r like avoid 2nd campus\n    ├── Yeah if any senior could clarify, would be great\n    │   └── This is answered in the FAQs: [https://www.reddit.com/r/PESU/comments/14c1iym/faqs/](https://www.reddit.com/r/PESU/comments/14c1iym/faqs/)  \nCheck the answer to why RR is (incorrectly) preferred over EC.\n    ├── The two campus are virtually the same except the faculty who teach and campus location. If i remember right last year cse students of 2nd year ec campus actually had most of their classes held in rr. The placements for both are held together and mind you recruiters cant see what campus student comes for a interview as all students are called to the rr campus for interviews. I would say choose the one which is closer to your home as travel time is a important factor in deciding.\n    │   └── what if its something like rr aiml and ec cse?\n    │       └── If it's purely based on course with no consideration of other things ( travel , fees , etc ) then Cse at EC would be my choice.\n    └── The placements are the same but the peer group would be worse in e city campus by a long shot. In kcet cs closes at around 1.6k in rr and around 5.6k in e city so you can make your choice based on your volition ( Dayanand sagar cs has higher cutoffs than pes e city)"
    }
  ]
}