{
  "id": "1ee4c0h",
  "title": "Droppers who wrote Pessat Query",
  "content": "Any droppers who wrote pessat here, pls tell ur rank in pessat before and after drop. I had 2k rank this yr( some 30k people wrote the exam) so wanted to know if I can achieve better than this next yr as backup.",
  "metadata": {
    "root_comment_id": "lfbk3yn",
    "post_id": "1ee4c0h",
    "author": "grinderOP",
    "url": "https://www.reddit.com/r/PESU/comments/1ee4c0h/droppers_who_wrote_pessat_query/",
    "permalink": "https://reddit.com/r/PESU/comments/1ee4c0h/droppers_who_wrote_pessat_query/",
    "score": 3,
    "upvote_ratio": 0.7200000286102295,
    "created_utc": 1722162183,
    "flair": "PESSAT/Admission",
    "nsfw": false
  },
  "comments": [
    {
      "id": "lfbk3yn",
      "body": "Tbh pessat isnt a good backup man\n\n•No matter how much you study the topics they ask are completely random and unpredictable and if they ask questions completely on one topic which you are weak in then it will be disadvantageous to you\n\n•Since they dont release marks of any students \nNor the question papers so \nWe dont know if they even properly normalise across the shifts\n\n•Even after clearing the exam the fees aint worth it \n\nBetter backups are comedk bitsat met(if you have a good boards pcm score)\nAnd kcet (if you are from Karnataka)\n├── add vitee to the list.  \neven the amrita exam\n│   └── Vitee rank is random number generator lmao \nCant be trusted\n\nEven aeee has same issue  which i said no marks/question papers released so we dont know if they normalise properly\n│       └── Its true but its worth a shot, they have lots of seats Afterall.\n└── I would rule out met as the fees is more or less than pes. The only good backups are comedk and kcet but tbh most comedk colleges aren't worth it unless you're getting rvce. Pessat is a decent option if you have the financial means to pay the fees and if you're in the top 25% ile of your student cohort you get a discount on the tuition fees so that would significantly cut down the cost.\n    └── The thing is manipal main campus has better college life than pes \n+ Placements are better/on par with rvce \n\n\nSo having nearly same fees as pes is justified\n        └── Placements of main campus cs is actually worse if not same as pes. Last yesr pes cs was almost touching 17 18 lpa avg whereas manipal cs was 16.92. Rvce cs avg was 19 lakhs . Rvce is way harder to get into manipal\n            └── Can you link to where its written that avg is 17-18 i don't see it written in last years spreadsheet \nThanks\nThough i still think manipal is worth over pes for around the same fees"
    }
  ]
}