{
  "id": "1ef7jc7",
  "title": "Internship credits",
  "content": "What does the college mean when they say that they'll give our internship's two credits during 8th sem? Will they contact our manager again? Are there chances of not getting the credits?",
  "metadata": {
    "root_comment_id": "lflq7tu",
    "post_id": "1ef7jc7",
    "author": "strange_panther21",
    "url": "https://www.reddit.com/r/PESU/comments/1ef7jc7/internship_credits/",
    "permalink": "https://reddit.com/r/PESU/comments/1ef7jc7/internship_credits/",
    "score": 5,
    "upvote_ratio": 1,
    "created_utc": 1722279207,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "lflq7tu",
      "body": "To claim credits for an internship (only qualifies for approved internships in summer or in 8th sem), you need to fill out the internship credit claim form sent out by your department. It takes in your manager's contact details, your offer letter etc. They will then contact your manager and ask them to fill out a feedback form which will ask them to rate you across several parameters from technical expertise to soft skills. PES then maps this rating to grades. \n\nUnless you are pursuing an internship which is not approved by PES, you will get as many credits as per the set guideline (if I remember correctly it's 3 weeks of work = 1 credit).\n└── I did my internship this summer (after 2nd year) but they sent an email saying that they'll decide the credits during 8th sem. I've filled the credit claim form and my manager has received the evaluation form\n    └── Then you've completed all the steps. Internship credits reflect only in the 8th semester because that's the \"internship\" semester and they'll list out all the internships and corresponding grades in that semester's grade sheet. So your manager will have to fill out the evaluation form now and their response will be used to generate a grade, but you probably won't get to see it on your transcript until your final semester (or at least I don't think there is a way to see it beforehand?).\n        └── Ohh okay, thank you!!\n            └── If you do want to see your grade, ask your manager about what they filled in. All the parameters are on a scale of 1-10 unless they have changed it. You can use the average to determine your grade (10->S, 9->A and so on)\n\nOf course, this depends on your relationship with your manager."
    }
  ]
}