{
  "id": "1egncpl",
  "title": "No more pessat",
  "content": "Damn looks like pesu wants to increase their repuatation all over india. ",
  "metadata": {
    "root_comment_id": "lftblt9",
    "post_id": "1egncpl",
    "author": "no_potential17",
    "url": "https://i.redd.it/duoim79hxufd1.jpeg",
    "permalink": "https://reddit.com/r/PESU/comments/1egncpl/no_more_pessat/",
    "score": 89,
    "upvote_ratio": 0.9800000190734863,
    "created_utc": 1722432949,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "lftblt9",
      "body": "Where does it say this on the website?? I can't find it."
    },
    {
      "id": "lftcw6b",
      "body": "Ayooo crazyyy"
    },
    {
      "id": "lftdbl3",
      "body": "I wonder how many people who actually perform well in JEE can afford the PESU fees, which is guaranteed to increase every year.\n└── There are colleges like thapar and lnmiit with>pes level fees who take admission thru jee mains\n    └── Yeah but PES isn't on par with them right? Afaik those are better colleges and the fees is justified.\n        ├── Placement wise in cse all 3 are almost same with lnmiit edging by a small margin. But college life and facilities wise they are way better than pes. But many people prefer coming to bangalore coz of location.\n        ├── PES is far better than Thapar boss - community wise. people from bengaluru and around would prefer PES to the weird groups at LMNIT and Thapar\n        └── galat jagah bol diya bhai\n            └── Nah I agree with the other points, was not aware about placements. PES crowd and location are significantly better."
    },
    {
      "id": "lftei89",
      "body": "Wait whaaaat ? Seriously ?? PES does'nt come close to so many top NITs, IIITs and other colleges. They have to keep the cutoff much lower to see the level of intake we have now. Next are they gonna rid of KCET as well ?\n├── They cannot remove KCET because of government restrictions (they already tried once)\n│   └── since you're talking about that, I had a question or two\n\nAll colleges need to have few seats reserved for kcet?\n\nIf yes, how does Jain & Christ University not have it?\n│       └── yeah , even mit (manipal) doesnt have kcet\n│           ├── I think they follow the main campus’s state gov rule\n│           ├── Yeah I am aware but I do not know too much about the guidelines here. I do know that they did try removing CET once before but it did not work out.\n│           └── Minority college so it gets exemption\n└── You’re definitely delusional, check out the people from PES on LinkedIn. You would be amazed by them. My team has a couple of PES people and they can write code way better than my NIT colleagues. I had no clue about this university until I did a quick LinkedIn search.\n\nThey are in all FAANG companies or studying in good schools abroad.\n    └── As if I didn't know lol. Looks like u are a new or upcoming student. PES does have a good reputation in a lot of areas and has had it for years, but it is still way behind than many other top colleges, like IIITH, IIITB, LNMIT, NIT Tirchy, NIT Warangal, etc.  Look, if they take JEE Mains, the cream are'nt necessarily gonna choose PES for sure, which is something they would want, as their options increase. Also, idts you understand how many people join this place. This place has a huge population of thousands, and they need so many students for the money, now you can't really admit a lot of people through either JEE and KCET. So if this is their plan to increase management quota admissions then it's a vicious plan.\n        ├── How did you manage to figure out that I’m a new/upcoming student? \n\nI literally said that they work in my team. You’re definitely delusional and that you confirmed it. I agree that the campus is nowhere close, but if they work at such companies, faculty and alumni network is amazingly strong.\n\nSince they want the cream, they are doing this. In a span of 50 years, if they are able to garner such a network, the aspiration alone would be enough to get them to the top. You’re unnecessarily pessimistic about the kids joining there.\n\nEven on day-to-day activities for coding, they are a mile ahead based on my experience. I had not interviewed them, but the amount of skill and knowledge PESU kids have is amazing. \n\nWe had been stuck on a problem, mind you we have engineers from top NITs, and yet they couldn’t crack it. The new joiner from PES was able to provide a solution in less than a week. \n\nTake your unnecessary shit posting somewhere else kid!\n        │   └── Just out of curiosity, are you a PESU graduate? Saw a comment on a post where you said your jee advanced rank was around 7k\n        │       ├── He said he's not from PES. He works in a team with a few PES grads along with some from NITs as well.\n        │       └── Nope, I graduated from BITS Goa. I didn’t intend to be on this subreddit. This post was on my feed and particularly this person’s comment caught my attention.\n        └── Y'all cope so hard lmao bro got downvoted for saying nit trichy is better than your 25 acre college  😭😭😭\n            └── I don’t think the comment that is getting downvoted is because of kids loving their campus. Or calling PES a better university than NIT Trichy. It is down to the sheer stupidity of the redditor. He/she is making tall claims without backing information.\n\nThey are just shitting on a college that could potentially be someone’s 4 year university. I definitely cannot withstand such low IQ comments. They are probably a bunch of salty people because they weren’t able to crack another college and get beaten up for it at their home. \n\nIt hurts them when someone is spitting out facts. Also what would you do in a 100 acre campus anyways? In your complete lifetime at the college, you would hardly cover 5 acres. And that’s from experience. Kids these days are more about showing off than the numbers. I just got to know that in 34 years, the alumni have founded ~70 startups. Something that this private university is doing right!"
    },
    {
      "id": "lfth4ob",
      "body": "10% Seats are reserved for KCET students paying JEE MAINS quota fees , says website . Damn they never leave a opportunity to make more n money\n└── how tf will that work? wont top 10% already be eligible thorugh kcet fees only?\n    └── Exactly lol. But website says so"
    },
    {
      "id": "lftokha",
      "body": "Craazy man.. Wtf.."
    },
    {
      "id": "lftqptd",
      "body": "``` Out of 100% of our B.Tech seats, 40% is allocated for KCET admissions through the Karnataka Government KCET counseling, 45% is allocated for JEE Mains and KCET quota (out of this 45%, upto 10% seats are reserved for students with KCET scores paying PESU JEE Mains fee) and 15% is allotted for Higher Fee Category / Management Quota. For Management Quota admissions, please reach out to the office of admissions at PES University ```\n\nThis is what I found on their website.\n├── Why would someone get in through KCET but pay JEE Mains fee wtf\n│   ├── Maybe, it's for people who have high KCET ranks ( can't get a seat through seat allotment by KEA) and want to join PES.\n│   └── Maybe like a semi govt seat, that happens in neet.. People with higher ranks like 20-30k get that by paying some extra fee\n└── Can you please add the link for where you found this?"
    },
    {
      "id": "lftvpgt",
      "body": "So people can't cheat and get through pessat in future 😂\n├── yeah, i felt the exam was kind of a scam or a lucky draw\n└── People have cheated on pessat? Don't they have strict invigilation?\n    └── not exactly cheating in the exam, the exam is a kind of a lottery system\n        └── Explain?\n            └── I don't think he exactly meant a lottery. PESSAT was conducted over more than 2 weeks, students getting a chance to choose their preferred date. On some days, the paper was tough whereas on the other days, the paper was on the easier side. They don't release the questions or answer keys or marks cards. So there's always been speculation that the normalisation of marks done in PESSAT might not be accurate, leading to a difference in the expected and real ranks."
    },
    {
      "id": "lftw341",
      "body": "Top 10 percent means merit list of KCET, who will apply separately not through kcet counselling"
    },
    {
      "id": "lfxsodl",
      "body": "Now pes is gonna be more well known across India and not just Karnataka, it'll be like one of the best private Institutes accepting jee scores. Leading to a more diverse crowd too\n└── ....in the state it is arguably the best but if  you take whole country it still has a long long way to go"
    },
    {
      "id": "lfy468p",
      "body": "They're just making it harder for people to get in. jee is tough ... my rank was like 50% despite all the hardwork I put to it."
    }
  ]
}