{
  "id": "1ej7fys",
  "title": "Ece ec profs 3rd sem",
  "content": "Am I cooked?",
  "metadata": {
    "root_comment_id": "lgd6w6i",
    "post_id": "1ej7fys",
    "author": "pokecuber-",
    "url": "https://i.redd.it/1a47pekx6hgd1.png",
    "permalink": "https://reddit.com/r/PESU/comments/1ej7fys/ece_ec_profs_3rd_sem/",
    "score": 5,
    "upvote_ratio": 0.8600000143051147,
    "created_utc": 1722702479,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "lgd6w6i",
      "body": "Tbh yes"
    },
    {
      "id": "lgd79eo",
      "body": "Murlidhar is the WORST professor of the college\n└── Worst but also good at teaching"
    },
    {
      "id": "lglqsbq",
      "body": "Bruhhh, this lineup is horrible, I feel bad for you. Ajey is easily the worst here, he knows absolutely nothing and I have not seen someone with a bigger ego in ny life. All he'll do in class is try to teach and then just give everyone a lecture on how useless you all are and he seems to forget that he isn't very capable and hasn't accomplished anything either. Shreyus sir also doesn't teach great and is really really strict but he's professional if you don't fuck around in his class and take proper notes. If you bunk like 2-3 continuous classes he won't give u attendance for the next classes until u get a letter from ajey and ajey is such a sad loser he'll do anything except give u the letter and keep asking why your cgpa is like that, what you do at home and other bs like that. Muralidhar again is really strict but if you pay attention to his class, you'll understand ACD properly. He's a very good teacher, but it'll suck for you if  he doesn't like you. Prahlad has some anger management issues but he'll be chill and give you good marks if you don't get on his bad side. Vinay is a cunt or a nice guy depending on who you talk to. He is very close to students and if he doesn't like you, you are completely screwed and if he likes you, you get full marks in everything, just like ajey. He doesn't correct any assignments you submit, he just sees the name and allots the marks. \n\nSucks that you have these people in the hardest semester but try to get through it, the other teachers that you get after this won't be nearly as bad when you compare them to these teachers. Try not to get their attention in a bad way and you'll be fine(kinda). Don't look at the other section teachers and feel bad, you'll probably get them later on. If you don't understand something, make sure you try to read it on your own as sem 3 is basics and you'll use many of these topics in the coming semesters. You got this. Good luck!\n└── Thank you"
    }
  ]
}