{
  "id": "1ekj1rc",
  "title": "is this calculator ok for college or do i need a better one?",
  "content": "title",
  "metadata": {
    "root_comment_id": "lgkx5tl",
    "post_id": "1ekj1rc",
    "author": "Weekly-Track-500",
    "url": "https://i.redd.it/25xw7beg8tgd1.png",
    "permalink": "https://reddit.com/r/PESU/comments/1ekj1rc/is_this_calculator_ok_for_college_or_do_i_need_a/",
    "score": 18,
    "upvote_ratio": 0.800000011920929,
    "created_utc": 1722848275,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "lgkx5tl",
      "body": "Get FX-991 EX\n├── alright thanks!\n├── But what if I already have this one?\nStatistics student here\n│   └── You can still do most types of calculations but not all so it's not a compulsion to buy this model in specific.\n└── +1"
    },
    {
      "id": "lgkxt34",
      "body": "No,Get either of these 3\nFx-991CW\nFx-991EX\nFx-991ES\n├── And Fx-991ES plus\n├── what about the 100ms one??\n└── thank you!"
    },
    {
      "id": "lgkyl6r",
      "body": "This is exactly what I had, unfortunately it can't do scientific calc.. so its better you shift to FX-991   \nu/broke-my-feet has mentioned the models.. any one is fine\n├── oh i see okayy\n└── I second this. I had the same one too and it's missing some real important stuff like solving definite integrals and doing cubic question. Not gonna lie, it has cost me a few marks.\n    └── But that was OG.. a really good one!\n        └── Can't deny."
    },
    {
      "id": "lgkzctk",
      "body": "This is shit you can't do matrix operation and so on....go for fx 991es"
    },
    {
      "id": "lgkzvsn",
      "body": "991 ex is the best\n\nU get to perform calculations of degree 4 and even vectors of higher dimensions compared to the other ones"
    },
    {
      "id": "lgl2y5a",
      "body": "This calci Is enough u don't need another one"
    },
    {
      "id": "lgl8tyt",
      "body": "Any calculator which can solve matrices and solve equations works"
    },
    {
      "id": "lgl8z2t",
      "body": "Do I need to buy one in 1st year??\n└── Yes"
    },
    {
      "id": "lgl9x3c",
      "body": "What is the need?? Is it allowed in exams??\n├── Yep\n└── lol, bro is stuck in school.\n    └── What do you expect from a person who is studying in school for the past 14 yrs??\n        └── to be aware of how things work ahead."
    },
    {
      "id": "lglnl0n",
      "body": "Yes.. this will do.. anything non programmable will do"
    },
    {
      "id": "lgn4byn",
      "body": "PLEASE DO NOT GET THESE DOUBLE LINE ONES, you'll have a hard time in matrix questions+in this you probably can't even solve them\n\nGet the Casio textbook display ones (fx991 ex plus)\n\nOr what I would recommend you is to get the fx991 cw (i personally bought it after struggling with my 2 line calculator)\nYes it is a bit more expensive, but its worth it\nFaster+less chance of errors because you can see the exact values you have entered\n└── got it thanks!"
    },
    {
      "id": "lgripb9",
      "body": "Get 991 cw, had this trash in first sem, can't do basic stuff like integration or summation"
    },
    {
      "id": "lgx4hxz",
      "body": "You can try to get the graphic one. But this is the basic one required for the exams. It depends on the branch and teachers input."
    }
  ]
}