{
  "id": "1en8vrs",
  "title": "How is Navratri and other festivals celebrated in pesu?",
  "content": "",
  "metadata": {
    "root_comment_id": "lh4ejnc",
    "post_id": "1en8vrs",
    "author": "jeecrack2024",
    "url": "https://www.reddit.com/r/PESU/comments/1en8vrs/how_is_navratri_and_other_festivals_celebrated_in/",
    "permalink": "https://reddit.com/r/PESU/comments/1en8vrs/how_is_navratri_and_other_festivals_celebrated_in/",
    "score": 3,
    "upvote_ratio": 0.5600000023841858,
    "created_utc": 1723130792,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "lh4ejnc",
      "body": "They don't."
    },
    {
      "id": "lh4gm8x",
      "body": "Who's gonna tell him? 🤓👆"
    },
    {
      "id": "lh4hstl",
      "body": "You came here to study or celebrate festivals ?\n└── You would like an old school principal chill"
    },
    {
      "id": "lh4i70h",
      "body": "oh poor lamb"
    },
    {
      "id": "lh4i71n",
      "body": "It's celebrated in university and colleges situated in North India, not here.\n└── Nah dude, nitk celebrates navaratri..\n    ├── then go there lol.   \nNitk is purely residential hence its like that, i think majority of pes kids are locals.\n    │   └── Dude u dumb or smtg.. The comment stated that festivals aren't celebrated in South Indian colleges.. So was my comment correcting his facts..\n    └── Bro that's NIT, I leave NIT's and VIT as an exception. What abt other colleges?\n        └── No, ig none.."
    },
    {
      "id": "lh4m0pv",
      "body": "🤣🤣🤣"
    },
    {
      "id": "lh4rusn",
      "body": "Here's a shocker for you, yaha Holi ki chuti nahi milti\n└── Tbf Holi isn't a major festival here, so it is understandable. Any institution/organisation follows regional holidays. Once you start working, you will also see that different campuses of a company in different parts of the country will have a slightly different set of holidays.\n    └── Yeah but it's hard for people to fathom that a festival like Holi isn't celebrated much in south while it is one of the major festivals in north India.\n        └── I completely understand. I'm not a South Indian either and I've never gotten to celebrate Holi properly since I grew up in Bangalore.\n            ├── Happy cake day!\n            └── Sad to hear that mate"
    },
    {
      "id": "lh4w5yf",
      "body": "😂😂😂😂😂😂😂😂😂😂😂😂😂😂"
    },
    {
      "id": "lh62dge",
      "body": "Lmfao😂"
    },
    {
      "id": "lh82bt0",
      "body": "Nahi hota Bhai,Amity join karle"
    }
  ]
}