{
  "id": "1eo1axf",
  "title": "branch change today in rr campus",
  "content": "those who attended branch change counselling today, what was the cutoff for pes rr cse?",
  "metadata": {
    "root_comment_id": "lhad2gs",
    "post_id": "1eo1axf",
    "author": "sunrise_4567",
    "url": "https://www.reddit.com/r/PESU/comments/1eo1axf/branch_change_today_in_rr_campus/",
    "permalink": "https://reddit.com/r/PESU/comments/1eo1axf/branch_change_today_in_rr_campus/",
    "score": 22,
    "upvote_ratio": 0.9700000286102295,
    "created_utc": 1723214126,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "lhad2gs",
      "body": "19 CSE rr campus seats were vacant \nThe last person to get CS seat had 9.3 cgpa\n├── any info on other branches in rr and ec?\n├── cool thanks\ncould you also drop the other cutoffs? like aiml rr and cse ec?\n│   ├── Nah I don't have all those details \nBut if cs had so many vacant seats then ig the curoff's for other branches wld also be lesser than previous year's \nInfact the highest vacant seats were in CS rr campus than any other branch\n│   └── The last person taking a seat in rr aiml had a cgpa of 8.4 ish\n│       └── AIML was 8.6something not 8.4\n└── Does this also apply to EC CSE -> RR CSE change?"
    },
    {
      "id": "lhasq2u",
      "body": "Rr cse - 9.36\nRr aiml - 8.66\nEc cse - 8.05\nNot sure about ece and ecc aiml\n└── So exactly how does this work can i be in suppose Rr eee and I get 8.2 cgpa can I get a branch change to ec cse or do I have to be in ec campus suppose brance ece and then score 8.2 I can get Cs in ec or maybe more like 9.4 and get Cs in rr campus\n    └── Anyone from any campus to any campus"
    },
    {
      "id": "lhb88gb",
      "body": "Where shld the 5k or 10k be paid for those who opted branch change today ?\nIs it offline at campus \nOr online\n└── Afaik it's DD you need to submit to accounts department"
    },
    {
      "id": "lhez550",
      "body": "Do all student who r shifting from EC campus to RR campus via branch change get hostel accommodation?? Pls reply"
    },
    {
      "id": "lhlt2t7",
      "body": "Here are the cutoff-\nCS at RR- 9.36\nAIML at RR- 8.66\nCS at EC - 8.05\nECE at RR - 7.95\n\n\nAll the other branches had vacant seats\nAIML at EC had 4 seats left at end. \n\n\nBasically many changes were from RR AIML to RR CS along with EC RR to RR CS.\n\n\nOverall 260ish people applied for branch change.  \n└── But around 200 people didn't get? I. E all thier cgpa was lower than 7.9?\n    └── Like see, it depends on what you want. People who got below 7.9 , some of them either applied for electrical at rr or aiml at EC. Finally at the end of counselling seats remained as follows:\n1. aiml and ece at EC campus \n2. EEE, mech, BT at rr. \n        ├── Is it preety ez to get more than 8 or 8.5 or more than 9 even if u pay attention in class and study. I want to do Cse or Cse aiml but I'm not meeting cutoffs, so is it safe to take ECE in ec campus and fully rely on branch change, while also being aware of studies and try to get more than 9 or 8.5, is it doable, worth the risk?\n        │   └── Cuz I heard pes grading is different from vtu clgs and also quite hard acedamics and to score cgpa compared to other vtu clgs\n        └── Same question as the guy below"
    },
    {
      "id": "lm3u6x1",
      "body": "should we be in a circuital branch prior to entering first year or is it not necessary, like if im in mech which is non circuital, after first year can I apply to circuital branches like eee or ece for branch change?"
    }
  ]
}