{
  "id": "1epdfv5",
  "title": "CSE (Pessat) vs AIML (Kcet)",
  "content": "Which one of the two should I go for: cse in pes rr campus through pessat or cse-aiml in pes rr through kcet, is it risky taking the aiml branch?",
  "metadata": {
    "root_comment_id": "lhju5xt",
    "post_id": "1epdfv5",
    "author": "Sea-Date-9139",
    "url": "https://www.reddit.com/r/PESU/comments/1epdfv5/cse_pessat_vs_aiml_kcet/",
    "permalink": "https://reddit.com/r/PESU/comments/1epdfv5/cse_pessat_vs_aiml_kcet/",
    "score": 13,
    "upvote_ratio": 0.8799999952316284,
    "created_utc": 1723355196,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "lhju5xt",
      "body": "Cse electronic city kcet"
    },
    {
      "id": "lhjupog",
      "body": "Depends if fees is the issue go with AIML EC or else if fees aint a issue go with CSE RR\n└── Sorry for the confusion but I meant aiml in pes rr itself but through kcet, I mean like is it worth taking the risk of aiml branch for considerably lesser fees or should I stick to core?\n    ├── CSE offers more diversity, and if you can do a specialization over that you are all done. Choose CSE if fees ain't issue. In RR , but AIML also wont be a issue ( if you have fees issue ) . CSE is relatively better that's it .. rest is upto you.\n    └── OP, choose CSE if you have no prior experience with coding and you don't know what you are getting into. You only get to do ur bachelors once, make it count. Don't spend 4 years regretting ur choice choosing AIML. U can always choose to pick AIML while ure doing CSE but not the other way round."
    },
    {
      "id": "lhjwfyn",
      "body": "If fees is not a issue got for cse , hope you carefully consider the fees also cause if I remember right pessary fees is as high as 4.5l per year\n└── I mean fees is not really an issue but my dilemma is whether or not taking core over aiml would be worth the extra 14 lakhs or so considering it's the same campus"
    },
    {
      "id": "lhk279t",
      "body": "Take Cse electronic City campus through kcet. Despite what many people have made you believe, there isn't much difference between the two."
    },
    {
      "id": "lhk34ay",
      "body": "I'd say take AIML with the cet fees. There's not much of a difference between the core and aiml branches of cse, only your electives change in the third year."
    },
    {
      "id": "lhk55au",
      "body": "If placements are the same for both CSE and AIML branch, then take AIML via KCET"
    },
    {
      "id": "lhk6ful",
      "body": "Spec are just mode for more intakes in CS branch you'll be fine through aiml, just the things syllabus might be tough cuz of maths and you have to maintain cgpa so your maths is weak then difficult to maintain cgpa\n└── Hey I was a bio student in 11th and 12th. Studied PCMB, but only focused on PCB cuz I was preparing for NEET. So I might not be good at math. I had gotten both CS and AIML through PESSAT but chose AIML for some reason. Will it get difficult for me considering I didn't focus on math in 11th and 12th? \nI'm kinda worried after reading your reply based on math in the syllabus.\n    └── Dont worry you'll be fine but the thing is it may feel bit tough at the start but do some hard work and don't waste too much time, focus on studies from 1st or 2nd sem,.. maths is not everything there but math is the prominent subject in aiml, I'm also a pcmb Student and i have got cse aids\n        └── Okay thx!!"
    },
    {
      "id": "lhkdp1c",
      "body": "Cs ecity via kcet \n\n\nI'm pretty sure someone had exact same question as u on this sub so search it up.\n\n\nTldr from what I've read, reduced fee, aiml degree was introduced literally in 2022, so very new. Specialized degree has tendency to skip or cover fundamental topics in rushed manner.\nFew years ago ec city campus also became autonomous. I have no idea why that campus cutoffs are so much lower"
    },
    {
      "id": "lhkrmdq",
      "body": "you shd totally go for ec campus cse"
    },
    {
      "id": "lhptcqk",
      "body": "If you don't know anything about AIML and you don't have any experience with CSE whatsoever. Please go for CSE. AIML is a specialization branch. Since you have no prior experience with coding or computer science in general, you would be much better off with choosing CSE since there are many different specializations and electives to choose from as you familiarise yourself with the field. AIML is a bad idea for someone who hasn't had prior experience and who doesn't know what they're getting into. You're only gonna get one bachelor's degree in your life, make sure it's worth it and not something that you would regret for 4 years. 4 years is not a short amount of time."
    },
    {
      "id": "lhvfnfe",
      "body": "This year it is not aiml it is cse with aiml specialization so I think there will not be much difference you will study all the important subjects of  cse in it.So u should go with cse(aiml) through kcet."
    },
    {
      "id": "lhyku1i",
      "body": "if you want to take cyber security specialization go for aiml (kcet) as cse- cyber security and aiml- cyber security are same( no difference)"
    }
  ]
}