{
  "id": "1epqecv",
  "title": "Will there even be least bit of fun in PES EC Campus?",
  "content": "All i have seen that everyting about this college is so strict . I know i am going there to study but still i want to enjoy college life with studies . But everybody says there is no life here .",
  "metadata": {
    "root_comment_id": "lhmaljx",
    "post_id": "1epqecv",
    "author": "jeecrack2024",
    "url": "https://www.reddit.com/r/PESU/comments/1epqecv/will_there_even_be_least_bit_of_fun_in_pes_ec/",
    "permalink": "https://reddit.com/r/PESU/comments/1epqecv/will_there_even_be_least_bit_of_fun_in_pes_ec/",
    "score": 11,
    "upvote_ratio": 0.800000011920929,
    "created_utc": 1723397391,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "lhmaljx",
      "body": "Not really unless you're a masochist.\n└── taught me a new word thanks bro"
    },
    {
      "id": "lhmfk2n",
      "body": "I wouldn't say you have no fun at all. The college is definitely strict, however the EC campus clubs are quite active so there will be a lot of events to participate in, design competitions, open mic, dance performances, workshops, hackathons, etc.\n\nIf by fun you mean being able to hang out with friends after college or by bunking classes, there is no restrictions placed on you in that respect. As long as you have more than 85% attendance and can manage the classes you missed on your own, there is no problem at all. You wouldn't be able to walk out of the classroom in the middle of classes (obviously) but during either the short or lunch breaks you can leave/join the classes without a problem.\n└── Wtf the attendande limit is 85 percent? And btw what are the class timings of EC campus? I've heared there's only one half day whereas in the rr campus all days are half\n    ├── It's 75% now. Timings are 8-4 for odd semesters and 8:45-4:45 for even.\n\nYou'll have half days on Wednesdays and classes till 3 on two other days.\n    └── I think it's 75% this time but keep it above 80 to be safe. \n\n  \nFor half days, we had 2 days in both 2nd and 3rd year (This honestly depends on the timetable for your section, we got lucky and asked our teachers to move after lunch classes to our free periods so we could have another half day). Wednesday is always a half day. \n\nThe class timings are from 8 am to 4pm. But again, when each day ends depends on your timetable somedays, they end at 1 others at 2, 3 or 4.\n        └── Ok but how often will they end at 4? Cause don't you think 8 to 4 is too hectic. And my 35 min will be spent travelling each way, am i cooked?"
    },
    {
      "id": "lhpjhu8",
      "body": "ofc you can have fun bro , try to find a friend group that balances academics and fun. You can open up you laptops in class join some game room online(listening to class doesn't matter for most theoretical subjects) and have fun or just normal talking, 3 days in a week are half days you can go the MRD centre play some Table tennis , 8 ball pool, Carom, chess, Badminton (u need non marking shoes for this). College isnt that strict also tbh just that people have some other expectations like you can study 1 night before and get good grades and can get away with 50% attendance which wont work here. It all matters in the friend group.\n└── Are there 3 half days in the EC campus as well?\n    └── yeah we have 3 half days, 2 days on which we had labs was full day\n        └── okay so you are from EC campus right?"
    },
    {
      "id": "li1hcto",
      "body": "How about rr campus?"
    }
  ]
}