{
  "id": "1eqyaby",
  "title": "BMSCE CSE vs PES (RR) AIML",
  "content": "As bmsce is increasing seats nd pes has slightly better placements is it better to choose pes?\nBut bms is chill nd not hectic nd i would get time for other stuff. In a dilemma now pls help \nNd how bad are placements at bmsce(considering the increase in intake)?",
  "metadata": {
    "root_comment_id": "lhw3edr",
    "post_id": "1eqyaby",
    "author": "jalagara_",
    "url": "https://www.reddit.com/r/PESU/comments/1eqyaby/bmsce_cse_vs_pes_rr_aiml/",
    "permalink": "https://reddit.com/r/PESU/comments/1eqyaby/bmsce_cse_vs_pes_rr_aiml/",
    "score": 6,
    "upvote_ratio": 0.8799999952316284,
    "created_utc": 1723521062,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "lhw3edr",
      "body": "I'd say PES for academics/placements/exposure/infra\n\nBMS for a comparatively relaxed college life , or if fees is lesser (not sure what exams ur going through)\n├── Kcet so the fee is same\n└── If fee ain't a problem then I would definitely say AIML at RR. As mentioned, all the infrastructure, exposure, community and placements are above par. I wouldn't necessarily say you'd get freedom as much in BMS but it isn't on the other extreme too, it all comes to how well you manage things. Also, now that we know the syllabus of AIML, I'd say it isn't much different from CSE provided you choose the right electives in 3rd year. The competition will also be higher in BMS since the intake is 1500 now. It Ultimately is your choice!"
    },
    {
      "id": "lhwx0dc",
      "body": "Same situation. \nI'm opting for pes ecity if I don't get rr. Mainly coz I've heard syllabus in pes most updated.\nAnd better infra but I need to go check that for myself physically.\nHave heard bms is more chill. Placement is probably the same.\nWouldn't worry much abt competition tbh, pes has combined placements soo\n├── Plus you can go and search more abt aiml course in pes, lots has been written abt it already\n└── Idt placements are similar \nIf at all it is similar then I would obv choose bms cse\n    └── Idk man I can't find recent data on either. Only know from 2 years ago most PPL agreed placements were similar "
    }
  ]
}