{
  "id": "1es12tk",
  "title": "KCET Counselling doubt ",
  "content": "Suppose I get a college in first round and I choose the second option (which says \"satisfied but wish to participate in second round by holding the first round seat\") ,and then in second round if I get the same thing again , will I be able to participate in second extended round .\n\nFor example , suppose I get pes aiml in first round and I choose the second option and let's say I get pes aiml again in second round . In this scenario can I again choose option 2 and enter second extended round or will I have to accept the college and exit from the process?",
  "metadata": {
    "root_comment_id": "li2has2",
    "post_id": "1es12tk",
    "author": "Salty-Count-1578",
    "url": "https://www.reddit.com/r/PESU/comments/1es12tk/kcet_counselling_doubt/",
    "permalink": "https://reddit.com/r/PESU/comments/1es12tk/kcet_counselling_doubt/",
    "score": 7,
    "upvote_ratio": 1,
    "created_utc": 1723640675,
    "flair": "PESSAT/Admission",
    "nsfw": false
  },
  "comments": [
    {
      "id": "li2has2",
      "body": ">which says \"satisfied but wish to participate in second round by holding the first round seat\"\n\nwhere are you seeing this? I was given the result with none of these options\n└── It will come when actual counselling begins. Not in mock rounds\n    └── Ah alright thanks"
    },
    {
      "id": "li2kccu",
      "body": "The 2nd extended round is not similar to the 1st and second round.You cannot hold any seat while u r entering the second extended round.U will get the 2nd round alloted college only if u don't get any college through the second extended round.If u get any, then u will not have any option to choose between the colleges alloted in round 2 and 2nd extended. The allotted college in the second extended round is the final\n├── you can hold a seat while going to second extended round \n\n[https://cetonline.karnataka.gov.in/keawebentry456/ugcet2024/infobuletinallotenglish.pdf](https://cetonline.karnataka.gov.in/keawebentry456/ugcet2024/infobuletinallotenglish.pdf)  \npage 3\n│   └── If u get a clg in 3rd round u will not have a choice between them and it's not termed as 'holding a seat' as it is in the 1st round,it's different,that's wt i meant.Only in the case if u don't get any college in round 3 or if u get alloted the same college/branch, then u can admit in the same college\n│       └── You couldn't choose between the newly allotted college and the one you're holding, even in round 2. So how is round 3 different?\n└── Oh ok thank you very much"
    },
    {
      "id": "lijedpi",
      "body": "Yes you will and if you do not get any higher options college in the 2nd extended  then the seat which you had got in the second round will be your final seat and college"
    }
  ]
}