{
  "id": "1es2yoe",
  "title": "Finding team members for capstone ",
  "content": "Idk what pesu is doin but cat b guys are cooked . And more over We have to  find  team members uhhhhhh  .the c guys are quite rare and they tend to go towards girls(which is obvious).cant they just sort out and  just  assign team members randomly ?? .i know some guys will not agree this but if you look at the other side its certainly in a mess .",
  "metadata": {
    "root_comment_id": "li2x0ov",
    "post_id": "1es2yoe",
    "author": "newreichminister",
    "url": "https://www.reddit.com/r/PESU/comments/1es2yoe/finding_team_members_for_capstone/",
    "permalink": "https://reddit.com/r/PESU/comments/1es2yoe/finding_team_members_for_capstone/",
    "score": 22,
    "upvote_ratio": 0.7900000214576721,
    "created_utc": 1723645535,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "li2x0ov",
      "body": "Thats 101% true my fuhrer"
    },
    {
      "id": "li2xobp",
      "body": "Skill issue if you cannot find a team.\n└── Nigga category b guys are more"
    },
    {
      "id": "li2zclp",
      "body": "what is category b lmao\n└── am trying to control my inner jalagara"
    },
    {
      "id": "li3ir7v",
      "body": "Cat b guys ?? The C guys ??"
    },
    {
      "id": "li3myxk",
      "body": "If u can't find a team they do assign randomly"
    },
    {
      "id": "li3njfi",
      "body": "ppl who r downvoting have no clue the hate we go thru"
    },
    {
      "id": "li3o23q",
      "body": "Put your interested topic in your group chat (if you have one with your classmates) and form a team with those interested. They need at least two members for Capstone."
    },
    {
      "id": "li5tnnq",
      "body": "What is category B and C?\n└── Category B Abou cpgp 7 and bellow 7.99\nCategory c  bellow 6.99"
    },
    {
      "id": "li6e7k9",
      "body": "cat c is people under 7 gpa or something. it's really hard to find one who is also competent. i know many freeloaders who are in good teams with toppers just cause of their poor ass grades lmfao"
    },
    {
      "id": "li6p6ze",
      "body": "What is cat b bro? Just like how you say kora for Koramangala? 🤣🤣🤣. Jokes apart if you can't find team members, your department will randomly assign you to others dw."
    },
    {
      "id": "li6q0lv",
      "body": "You don't really need to find people based on the categorisation. You can form your own teams anyhow(CS)"
    },
    {
      "id": "lj6jjt5",
      "body": "You just ask your friends if they want to join your team with your topic. Otherwise just ask in your class group who wants to join yours. Minimum people for CAPSTONE is 2, they don't allow you to do it individually."
    }
  ]
}