{
  "id": "1euixad",
  "title": "Getting PES ECE branch in Electronic city . have doubts ...",
  "content": "i am getting PES ECE branch in electronic city and EEE in RR campus. i was wondering if any of you could tell me \n\n1. how ECE branch in Electronic city is \n\n2. placements in ECE and IT jobs\n\n",
  "metadata": {
    "root_comment_id": "likony1",
    "post_id": "1euixad",
    "author": "sasta_internet",
    "url": "https://www.reddit.com/r/PESU/comments/1euixad/getting_pes_ece_branch_in_electronic_city_have/",
    "permalink": "https://reddit.com/r/PESU/comments/1euixad/getting_pes_ece_branch_in_electronic_city_have/",
    "score": 5,
    "upvote_ratio": 0.8600000143051147,
    "created_utc": 1723904617,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "likony1",
      "body": "if you want IT job join CSE / related branches in other colleges bro. ECE placements were decent in the covid era but are straight up trash now . The course is tough too . EEE is even tougher and even worse in terms of placements\n└── the other places i am getting cs it have very bad reputations. so i put msrit ete above instead. i am aware the placements weren't good in ece this year, and hence i was doubtful about it\n    └── you can make up for the bad reputation with good skills bro. Just put ur headdown and get work,gain skills which companies want, if not oncampus then off - campus but I highly recommend pick the course you like. All you need is one job right out off college then after that its all you, college wont matter beyond the first job but the degree will stick with you forever\n        └── even i had the same thought, hence confused between pes nd msrit ete . i will think more on it \n\nthank you so much !!"
    },
    {
      "id": "lioyhhw",
      "body": "Placements are more or less the same in either of the branches. \n\nBut join CSE or any similar computer branches since it offers better placements than other branches. Join ECE only if you are interested in electronics or interested in pursuing higher studies on electronics not for the namesake purpose as the courses are really tough."
    },
    {
      "id": "ljkd4yy",
      "body": "If ur getting ece in pes than u will get some cse specs in dsce or bmsit take those...\n└── dsce and bmsit donot have that good reputation man \n\nofc i will get cs in nhce dsce and those places\n\nbut their reputations are pretty negative. their seniors themselves recommended to not go there ."
    }
  ]
}