{
  "id": "1ev722l",
  "title": "What do you hate about this uni ?",
  "content": "",
  "metadata": {
    "root_comment_id": "lipanw1",
    "post_id": "1ev722l",
    "author": "Practical-Author1959",
    "url": "https://www.reddit.com/r/PESU/comments/1ev722l/what_do_you_hate_about_this_uni/",
    "permalink": "https://reddit.com/r/PESU/comments/1ev722l/what_do_you_hate_about_this_uni/",
    "score": 22,
    "upvote_ratio": 0.8700000047683716,
    "created_utc": 1723980617,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "lipanw1",
      "body": "75% attendance\n├── Back in the day we had an 85% cap.\n│   ├── I'd back flip from top floor if they did that to us\n│   └── These kids don't know how bad 85% was 😭\n│       └── Rowlett are you confident that usa ms upu woll land a job? I heard soo many videos  people are saying cpme after 3 or 4 year experince\n├── F off I had 85 back then, would kill for 75 😭\n└── Rv has 80"
    },
    {
      "id": "lipd3ab",
      "body": "The campus is so tiny.\n└── What is this campus you speak of\n    └── RR"
    },
    {
      "id": "lipd59l",
      "body": "Very high intake\n├── yeah in cse na?\n\nbut tell me this aiml and cse ka sath mein hoga kya cgpa mein\n\nor is it diff\n└── Is it really that bad tho, colleges like RV have 500 cs related branches.\n    └── Therr are about 1000 cs students in ec + 1000 in RR. That's a lot more than 500."
    },
    {
      "id": "lipd72z",
      "body": "Wifi\n└── bruh yall dont play any games or anything\n    └── Have a xbox"
    },
    {
      "id": "lipjgq6",
      "body": "Very strict about attendance and assignments\n└── are on the bright side you get to hang out without your friends"
    },
    {
      "id": "lipnl4o",
      "body": "Exams and intake of students"
    },
    {
      "id": "lipph81",
      "body": "Attendance is 75 at almost all private unis , except BITS so that isnt a uni-specific thing to hate  \nIntake is high but placements are somehow still excellent ( CS )\n\nCampus is tiny but the infra is great , also its in the blr city so the campus size is understandable ( atleast in RR )\n\n  \nSomething I do dislike tho is that hostels are kinda strict, there are workarounds but they can still make it chiller."
    },
    {
      "id": "liqzaxy",
      "body": "Question should have been\n\n>What do we not hate about PESU?"
    },
    {
      "id": "lir535g",
      "body": "Doraemon and his sidekicks. A lot of good teachers have left because of the extent the management mistreats them."
    },
    {
      "id": "liu3ekd",
      "body": "Been trying to get LOR, situation feels worse than government office\n└── COE = Government office"
    }
  ]
}