{
  "id": "1ew8y4b",
  "title": "Why PES ask to submit original documents?",
  "content": "So far, I haven't heard of any other university asking to submit original documents? Why PES ask for original documents? Do the keep them for 4 years? What is the process followed here?",
  "metadata": {
    "root_comment_id": "liwy2lx",
    "post_id": "1ew8y4b",
    "author": "ReasonableFeed2045",
    "url": "https://www.reddit.com/r/PESU/comments/1ew8y4b/why_pes_ask_to_submit_original_documents/",
    "permalink": "https://reddit.com/r/PESU/comments/1ew8y4b/why_pes_ask_to_submit_original_documents/",
    "score": 2,
    "upvote_ratio": 0.75,
    "created_utc": 1724091461,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "liwy2lx",
      "body": "every college afaik takes documents such as 10th,12th marks card transfer certificate and stuff at admission time\n\none thing different about pes atleast wrt comedk colleges is that they return the original documents they took after 1st year   \nwhich is a positive\n├── BITS is one private college I know, which doesn't take it.   \nNone of the government colleges take.\n│   ├── my b then\n│   │   └── Please check my edit in the post for link to University Grant Commission (UGC) circular for non-retention of original documents\n│   └── Nah bro, every gov college asks for documents.\n│       └── They ask you to show it for verification, they don't keep original documents with them.\n│           └── No bro, my brother just joined in a gov college they ask it and keep it with em for a while and then return it.\n│               └── which college?\n│                   └── A law college.\n└── you're very right. all these college you get through kcet and comedk also take your original docs. i found out last year after i personally called them and asked the same."
    },
    {
      "id": "lj0a2eh",
      "body": "As per this circular of University Grant Commission no college can retain original documents\n\n[https://www.ugc.gov.in/pdfnews/5437737\\_UGC-Notice-reg-Fees-refund-Eng.pdf](https://www.ugc.gov.in/pdfnews/5437737_UGC-Notice-reg-Fees-refund-Eng.pdf)"
    },
    {
      "id": "lj6iv2s",
      "body": "Idk why too. After they take you can take it back after a year."
    }
  ]
}