{
  "id": "1ew9b2j",
  "title": "Can you fail capstone? ",
  "content": "All seniors who've passed out. Have you heard if anyone getting an F in capstone? \n\nI basically got a terrible team, and we didn't talk at all for the previous 3 months. \nGuide is not helpful too. \nReviews are gonna start next week, we haven't done shit, and at the rate at which things are moving, it doesn't look like we will do shit. \nI think I'll just do some work ( whatever I think is right) andpresent it off. Howmlow can the grades go? ",
  "metadata": {
    "root_comment_id": "liwyjm3",
    "post_id": "1ew9b2j",
    "author": "consuded",
    "url": "https://www.reddit.com/r/PESU/comments/1ew9b2j/can_you_fail_capstone/",
    "permalink": "https://reddit.com/r/PESU/comments/1ew9b2j/can_you_fail_capstone/",
    "score": 14,
    "upvote_ratio": 0.9399999976158142,
    "created_utc": 1724092332,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "liwyjm3",
      "body": "What is stopping you to initiate the communication from your side? Talk to your team.   \n  \nOne of the key reason for doing capstone project in teams is because they want to prepare you for the corporate world. Not all people in a team would be equally motivated (neither in college, nor in corporate world). You need to deal with it and the only way to deal with is to communicate with integrity and drive it with positive intentions.\n\nDon't try to corner yourself and do it alone. Take this challenge head on, convince them to work on it. You need to tell them \"What is in it for them?\", \"What they will gain by doing it well?\", \"What they will loose if they don't take it seriously?\" .   \n  \nWho knows, all of you might be (individually) thinking in same way about each other, waiting for someone to take the first step, or else do something of their own.\n\nJust talk buddy, just talk and resolve it!\n└── Will try talking again bro, thanks for suggestion...I have left a text multiple times on the group in the past month. \nOne guy responds personally, other two leave me on read. Idk if they are preparing for placements or their plan is to just wait for the pressure to build up and then they will hopefully reply to something. \nBut unfortunately I ignored too many red flags. They used to do the same when ISAs were close last sem. \nIf any juniors are reading this - please form a good team people. It's pure torture if you end up with selfish folk.\n    └── What does your mentor say?\n        └── Initially she had pretty high expectations for us.\n\nShe wanted everyone to meet her once every week and stuff...My team members did not keep that up in 6th sem itself, so we missed an easy S grade. \n\nShe didn't bother about us in the summer, but now she wants to see what we worked on, nothing wrong with her expectations there, but she allowed us to get into a field (topic) which she has zero idea about, and at times has crazy different ideas + expectations on what is right and wrong."
    },
    {
      "id": "lix0enq",
      "body": "Pretty much same issue. Only me and another teammate of mine has done any work so far. Guide is great. But will the whole team get the same grade? I've tried communicating and trying to instill good mindset but it's been backfiring\n└── Agree, that is a sad side of team environment where everyone doesn't give their best.  \nHowever, you should right now just focus on outcome, forget about others' grades at this moment.  \n  \nI am not sure about grading process, they may or may not get same/similar grades. One thing which is sure that they won't get same knowledge as you (which is what matters at the end - so focus on that, don't let your mind diverted towards negative aspects of the situation)."
    },
    {
      "id": "lixsy5i",
      "body": "Can you not change your team at this stage after talking to your guide ?\n└── I think he is in 4th yr"
    },
    {
      "id": "lizv8j3",
      "body": "The lowest grade you can get in capstone is a C as long as you just show up for the ISAs and ESA. Even if you don't speak a word and your project is pretty much nonexistent, you'll get a C. I haven't personally seen anyone get less than a C. Our project was worked on for a max of like 8 hours across 3 sems and it wasn't even working and we all got A in sem 6, C in sem 7 and B in sem 8. Capstone is worth 10 credits but it's given more importance than it deserves. Many of your projects are there just for the teachers to use for their phd and shit. If your team isn't working and if you don't mind the effect to your cgpa that much, just focus on your placements and upskilling yourself. It's definitely more important and the one year free time that you get can be crucial in you landing a job. Just try to present something and just get the report done. You'll be fine\n└── Someone got it right, 👍😂😂... You work for the PhD of your profs not actually gaining from their experience."
    }
  ]
}