{
  "id": "1exrmii",
  "title": "DSA",
  "content": "for dsa which language is better c++ or python or java?",
  "metadata": {
    "root_comment_id": "lj7xhtq",
    "post_id": "1exrmii",
    "author": "AlternativeGood9237",
    "url": "https://www.reddit.com/r/PESU/comments/1exrmii/dsa/",
    "permalink": "https://reddit.com/r/PESU/comments/1exrmii/dsa/",
    "score": 9,
    "upvote_ratio": 1,
    "created_utc": 1724251931,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "lj7xhtq",
      "body": "C / C++"
    },
    {
      "id": "lj7zcyg",
      "body": "Python or Java and don't look back. I'd say python because it is easier to code and easier to understand most of the time.\n└── may I ask why do most people dont use C ?\n    ├── Try yourself and understand\n    └── C requires user defined memory management. This is often hard to keep track of. Not tracking and managing memory will make you program fail. \n\nC++ adds a few guardrails to memory management and so makes it easier to work with memory. \n\nIn Java and python, most of the time memory management will not be considered while programming. (This is w.r.t to dsa n stuff not in a job)"
    },
    {
      "id": "lj8znkv",
      "body": "Roll the dice with python"
    },
    {
      "id": "lj98uim",
      "body": "I dont't know much about Java but the common choice is usually between C++/Python. You'll do fine with any of these two languages for 90% of the companies. \nThe rest 10% includes companies that don't allow Python in their OAs, Interviews (Generally networking companies). Whereas, some companies disabled STL (C++ Library for using inbuilt Data Structures) for their OA round making it very difficult to code.\n\n\nI will recommend learning both of them if you're comfortable in doing so and have one of them as your backup."
    },
    {
      "id": "ljcq1t7",
      "body": "C++ . As python is easy , whereas C++ is a bit more harder and more input goes into it which will train your mind . After that python will be a cake walk for you . But shifting from python to c++ is tough."
    },
    {
      "id": "ljctluq",
      "body": "First priority should be whichever of the 3 you are most comfortable with. \n\nAfter that make sure you can do basic coding in all 3. They are the most commonly used \"backend\" languages."
    }
  ]
}