{
  "id": "1f0p3su",
  "title": "Confirmed I think",
  "content": "Doredaddy is sure this time abt this I think 😅💀",
  "metadata": {
    "root_comment_id": "ljtlqed",
    "post_id": "1f0p3su",
    "author": "Dull_Grade5086",
    "url": "https://i.redd.it/wzo30n2xwqkd1.jpeg",
    "permalink": "https://reddit.com/r/PESU/comments/1f0p3su/confirmed_i_think/",
    "score": 28,
    "upvote_ratio": 0.9700000286102295,
    "created_utc": 1724563574,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "ljtlqed",
      "body": "about time"
    },
    {
      "id": "ljtnysy",
      "body": " I think now they're not waiting for kcet anymore"
    },
    {
      "id": "ljtthfw",
      "body": "So how would this round work now? by any chance can i fcuk up and lose my current seat(i know its a silly question but do answer).\n└── Nah. You have to live under a rock if you do that \n    └── Bro I hv 2.3k rank ( Cs in ec campus). In second round, if I don't get RR Aiml can I just leave the counseling without paying anything extra? And I won't lose the current seat then right?\n        └── yes"
    },
    {
      "id": "lju6c78",
      "body": "Does this mean classes will start by sep first week, or it will be after kcet counselling too? \n├── First week is highly doubtful but yea ig second week they will start it\n│   └── Amd the kcet people will join us later? \n│       └── Maybe yes cuz for pessat students they usually start early\n└── The hostel warden told that it's most likely gonna be on 9th"
    },
    {
      "id": "ljuorvm",
      "body": "Bro i don't get one thing if kcet 1st round result is on sept 1 in the evening, why are they doing 2nd round counselling on same day it should be AFTER round 1 results right??\n└── It's kinda too late already.....the clg can't keep waiting on CET ppl... anyways they have PESSAT, JEE and management quota ppl...enough for them to start"
    },
    {
      "id": "ljvna0t",
      "body": "Hey, any info About MCA program documents verification date or anything, Ring Road Campus. 2024 freshers."
    }
  ]
}