{
  "id": "1f2i8n5",
  "title": "Round 2 Counselling",
  "content": "My PESSAT rank is 22xx. I already got CSE in EC Campus...Can I get CSE in RR Campus in 2nd round counselling?",
  "metadata": {
    "root_comment_id": "lk6jhqq",
    "post_id": "1f2i8n5",
    "author": "notorious_niqqa",
    "url": "https://www.reddit.com/r/PESU/comments/1f2i8n5/round_2_counselling/",
    "permalink": "https://reddit.com/r/PESU/comments/1f2i8n5/round_2_counselling/",
    "score": 2,
    "upvote_ratio": 0.75,
    "created_utc": 1724768361,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "lk6jhqq",
      "body": "It looks like a tough chance at getting CS\n\nMaybe it’s possible for getting AIML\n\nBut you shouldn’t keep hopes for CS ig\n├── My rank is 316x can I get CSE core at EC campus?\n│   └── Depends on number of vacant seats.\n\nMaybe round 1, you would’ve had a good chance\nNow it seems tough\n│       └── My rank is around 554x what can i get in ec with this rank??\n│           └── Mostly nothing :(\n└── I have 2.3k rank and I too am hoping to get RR- AIML. it closed around 1.7k in first round so is there any chance? I know it depends on the number of people attending it, but till which rank it can go upto?\n    ├── It not only depends on the number of people. \n\nGenerally PES sells some of those surrendered seats under management quota. (Of course..it’s a business and they want to make the most profit)\n\nSo after selling the seats, the few seats which are left are kept for counselling. \n\nBased on what I feel about your rank, it seems like on the border of getting it. Most likely, AIML might end around 2250 Is what I feel\n\nBut I’m also joining this year, so I’m only telling all this from shared experiences by seniors.\n    └── Tough"
    },
    {
      "id": "lkbojt3",
      "body": "My rank is 554x what can i get in ec campus??"
    },
    {
      "id": "lkbon56",
      "body": "i have a rank of 1790s. currently i am getting cse at ec campus and as far as i remember rr aiml went till 1730 in first round. will i get it if i sit for second counselling\n└── 99% you will\n    └── ohk thanks"
    }
  ]
}