{
  "id": "1f34ymz",
  "title": "Ec campus 1st year Hostel amenities",
  "content": "I got CSE in the EC campus through PESSAT, and after counseling, I went to check out the hostel. The warden and security showed us a room that was clean and had soft mattresses. The warden mentioned that the mattresses would be provided by them. However, I recently came back to Bangalore (last week) to submit my original documents. Before that, my uncle (local guardian) came to select the room and submit the DDs. When I went to check out the room, I found out that the mattresses shown to us were completely different from what they will actually be giving. The ones they provide are of very poor quality, and I suspect they are spring mattresses.\n\nAdditionally, the woodwork in the room is chipped here and there, and one can easily get splinters. The locks were also kind of rusty and hard to turn. When I asked the warden about these issues, he dodged the question by saying that everyone gets the same thing. When my family and I asked the security guard while the warden wasn't around, he said, \"That was a 'sample' room.\"\n\nSo, I wanted to ask the seniors if you guys suffered the same fate or if the hostel is trying to cut costs this year.\n\nP.S. rusted doesn't mean actually rusted but like they had green spots here and there and gave a creeky feeling when turning the key",
  "metadata": {
    "root_comment_id": "lkbplh5",
    "post_id": "1f34ymz",
    "author": "zanilyx",
    "url": "https://www.reddit.com/r/PESU/comments/1f34ymz/ec_campus_1st_year_hostel_amenities/",
    "permalink": "https://reddit.com/r/PESU/comments/1f34ymz/ec_campus_1st_year_hostel_amenities/",
    "score": 8,
    "upvote_ratio": 1,
    "created_utc": 1724833546,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "lkbplh5",
      "body": "PES ec appears to good at scamming student.. Fuck who can trust these pvt institutions"
    },
    {
      "id": "lkbr5no",
      "body": "All rooms are pretty much similar. Some slightly better than the others. \n\nIf you don't like the mattress, just put your own on top of it. Nobody will ask you anything\n└── Can we ask them to throw the existing one or something?\n    └── Just put it aside. There's 4 beds and only three people in a room. So just put it on top of the vacant bed or something\n        ├── 3 ppl?\n        │   └── Yeah. Is it different now?\n\nWhen I was there 2 years ago, it was 3 people per room. One bed and desk used to be free\n        │       └── 4 now 🫠🫠 and every room is booked as of yesterday and warden said after 30th 10% or so might give up seats\n        └── Also like i was told only to pick from first floor so i picked the one with most ventilation but it was hideous"
    }
  ]
}