{
  "id": "1f5gsju",
  "title": "What is pes(rr) college fees through kcet?",
  "content": "I wanted to know whether the fees is ₹1,07,000 as mentioned in kea website or is it still more. Coz everyone I asked here tell me that pes is expensive",
  "metadata": {
    "root_comment_id": "lksr1bi",
    "post_id": "1f5gsju",
    "author": "shreeshreya",
    "url": "https://www.reddit.com/r/PESU/comments/1f5gsju/what_is_pesrr_college_fees_through_kcet/",
    "permalink": "https://reddit.com/r/PESU/comments/1f5gsju/what_is_pesrr_college_fees_through_kcet/",
    "score": 3,
    "upvote_ratio": 0.8100000023841858,
    "created_utc": 1725085400,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "lksr1bi",
      "body": "afaik the total fees per year is around 1.37L\n├── Thank u\n└── How can u breakdown for me plis.\n    ├── 107+30\n    │   └── Where's this 30 coming from\n    │       └── Extra fee\n    │           └── I'm asking what this extra fee is. And do I have to pay it every year? And why bcuz kewnalready said 20k smt is included in above fees of 1.lakh smth\n    │               └── Yes every year \n\n30k extra if u want scholarship benefits and 20k extra if you don't want any scholarship benefits\n    │                   └── Ok got it but like\nWhy do I have to pay 20k extra EVERY YEAR? \nIf it were smth for whole 4 years of understand. And what abt least statement in fee structure pdf which says 20k included in above fees of 1,07,495?\n    │                       └── Extra fee is actually 50k in which 20k is paid to kea already and remaining 20/30k you pay to pes or any other clg you go\n    │                           └── Wtf , it works like that? I just assumed total extra fee was 20k.\nThen what's the tuition fee?\nBy that logic a college can charge whatever they want as extra fee bruh, no use of regulation.\n    │                               └── Riyal\n    └── 1.07 as tuiton fees, 20k as exam fees and 10k as scholarship fees(optional)\n        └── 20k is exam fee?? Didn't kea tell 20k is already included in above 1 lakh smth fees in their fee structure document?\nAnd I have to pay 20k extra every year?\n            └── 10k is exam fees and some 11k extra is for library e-resources and recreation fees. It is 96,574 as tuition fees 10k as exam fees and 11,426 as extra fees for library and stuff which I just added into the exam fees to make it simpler. Your total fees till you graduate will be 1.2L per year (if you opt out of scholarship)\n                └── So my scholarship amt refund is based on 96kish amt right? Or full amt.\nAnd everything apart from 10k for scholarship is compulsory right?\n                    └── Nah from this year onwards it's for your full fees you paid and yes apart from the scholarship everything is mandatory\n                        ├── Can I pm u?\n                        │   └── Whut? Do you mean dm? Sure you can dm\n                        └── Wait WHATTT"
    }
  ]
}