{
  "id": "1f5yh3t",
  "title": "Urgent help required anyone pls help",
  "content": "I am a pessat candidate and got ec cs this year. I honestly wanted to take a drop and prepare again for IITJEE but my parents forced me to submit the documents here and not take risk. My relatives had a talk with my parents and kinda made them agree. It will be hassle to get the documents back now and I don't think I will get any refund now . \n*main ques- If someone surrenders Pessat seat after deadline, will the candidate be debarred for taking admission here next yr??* \nI went through the UGC norms but I don't know if its going to apply for a pessat candidate. Its dumb and waste of yr to come back here but as a backup. I contacted the office and they told to write mail to the vice chancellor or something.   ",
  "metadata": {
    "root_comment_id": "lkxsqj4",
    "post_id": "1f5yh3t",
    "author": "Lazy_Specialist9726",
    "url": "https://www.reddit.com/r/PESU/comments/1f5yh3t/urgent_help_required_anyone_pls_help/",
    "permalink": "https://reddit.com/r/PESU/comments/1f5yh3t/urgent_help_required_anyone_pls_help/",
    "score": 7,
    "upvote_ratio": 0.8999999761581421,
    "created_utc": 1725140899,
    "flair": "PESSAT/Admission",
    "nsfw": false
  },
  "comments": [
    {
      "id": "lkxsqj4",
      "body": "Why to take drop when you got pes\n└── not satisfied, especially after seeing the cutoffs dropping so low today."
    },
    {
      "id": "lkyp7cg",
      "body": "u/rowlet-owl u/chromaticchaos u/zuron7 does anyone know any info regarding this?\n└── I guess, you need to ask the Placement/Admission office for upto date and correct information \n\nIf you are asking about drop year, i would also suggest against taking the drop year, you can join the college and make the best of it!\n    └── ok and will I be debbared of taking admiasion here if I do seat surrender now?"
    },
    {
      "id": "lkzw125",
      "body": "Dude u got pes cse , idt you’ll have to take a drop! And there is no pessat exam from next year. They’re gonnna take admissions from jee and kcet from next year . No more pessat exam. if u flunk jee you won’t even have an option to join pes clg again and the placements are really good. just my opinion!\n└── hm jee main percentile will be 97+ for cs ?"
    },
    {
      "id": "lkzy29d",
      "body": "There is a last date to confirm your seat, I think it's over, but after that date you can get your documents back but won't get a refund. My advice is to just stick to PES. Drop years very rarely work and almost all my frnds who took a drop ended with with a rank lesser than their original. PES CSE is a good branch in a good college and unless you're sure you can crack JEE adv the next time, it's a safe and good bet to stick to PES\n└── ok and will I be debbared of taking admiasion here if I do seat surrender now?\n    └── Yes, you'll have to write pessat again and apply again with that rank"
    }
  ]
}