{
  "id": "1f6frab",
  "title": "HELP ME WITH THE DILEMMA",
  "content": "Guys, I have gotten into PES RR AIML through PESSAT. I chose AIML even when I was getting CSE since one of my cousins(who has a lot of experience in this field) suggested me. I ended up getting CSE In EC in KCET Round 1. Also, The fee at RR this time through PESSAT is 5L and I figured it would be around 3L at least in EC since I would have to lookout for a hostel. So what do you guys suggest, Seniors please hop in! Also what do you think about my decision of choosing AIML over CSE? Ik many would say either is fine or smtg but guys pls dont be considerate,I need a solid answer since i've got abt 2 days rem for choice entry.",
  "metadata": {
    "root_comment_id": "lkzucwv",
    "post_id": "1f6frab",
    "author": "No-Yard6142",
    "url": "https://www.reddit.com/r/PESU/comments/1f6frab/help_me_with_the_dilemma/",
    "permalink": "https://reddit.com/r/PESU/comments/1f6frab/help_me_with_the_dilemma/",
    "score": 3,
    "upvote_ratio": 0.7200000286102295,
    "created_utc": 1725200929,
    "flair": "PESSAT/Admission",
    "nsfw": false
  },
  "comments": [
    {
      "id": "lkzucwv",
      "body": "Join EC CSE get above 8.7 cgpa then do branch change to RR AIML, so you save fees moreover for 2027 batch only junior year electives are partially changed. CBCS electives are same\n├── I thought of that too, but changing the branch totally depends on the vacancies created and it is open to all the branches in both campuses so id have to get the highest grades possible to ensure it but even then it aint guaranteed. So risky.\n│   └── Bro take that risk.its worth it getting 8.7 is not hard you need to be consistent in first year\n│       └── yeah, the grades ill manage someway or the other but the creation of vacancies isnt in my hand right, now ill ask you another thing, choose between the two  \nRR AIML(no hostel) vs EC CSE+ hostel\n│           └── Ec cse hostel,fyi I also shifted from ec so I am suggesting\n└── You shifted from ec cse to rr aiml? What was the cutoff this year, 8.7? Also what was the cutoff for ec cse to rr cse?\n    └── 9.2 iirc"
    },
    {
      "id": "lkzuls5",
      "body": "I have taken aiml in rr campus too! I don’t think there would be any difference with the curriculum between cse and aiml. Doing core has its own advantages as there would be more opportunities. But when it comes to aiml you’ll have an upper hand in doing masters!\nIf u can afford the fees then it’s a pretty good deal. \nI got aiml in ecity through kcet. I wanted to do my engineering in the main campus cus you’ll have more recognition and more competition which makes it hard to maintain a good cgpa.\n├── Fee ain't really a problem tbh. The thing is i would get to stay in hostel if I choose EC, thats another thing to consider now lol. I just wanna make the right choice at the end of the day.\n│   └── Suggest you to join rr aiml cus end of the day you’re paying the same amount of fees! You’ll have more exposure\n│       └── um, ig you missed out on the context a lil bit, if i were to join EC CSE then that would be through KCET not PESSAT so fee is obv lesser including hostels.\n│           └── Oh then suree!! Go for kcet if fees is the problem\n│               └── yo, forget about the fee, wt would you choose ultimately:\n\nRR AIML(No hostel, through PESSAT) vs EC CSE( hostel, through KCET) ?\n│                   └── Personally I would choose RR AIML THROUGH PESSAT Cus I took rr aiml though I got Ecity aiml\n├── The RR AI/ML department is a disaster. They're desperately short in faculty, to the extent where they tried to bring in some guest faculty, who taught for a week and said no thanks and left. They also fired their best professor (KSS) because of a very off ego tussle between him and the HoD. \n\nThe best AI/ML professor in the University, Dr. Gowri, is still with the CSE department. Do yourself a favour and very much reconsider an 'AI/ML' degree.\n│   └── hey i took cse core in ec campus. I know the coursework is similar till like 2 year and it changes 3yr yr onwarda with electives but in ur resume it's still gonna be cse( aiml) so wont they hire u more for the ML jobs like data analyst?\n│       └── No one can say for certain right now, the first batch of AI/ML haven't even gotten summer internships yet. However, most entry level jobs don't particularly care about the fact that it's an AI/ML degree; your primary potential upside is if you're applying for a masters. However, what matters much more there is a good resume and LoRs, and as of right now there is only one professor in the AI/ML department whose LoRs mean anything at all.\n└── Ok one point is just straight up incorrect. You will be at a **disadvantage** with respect to masters when you do Aiml over core CS. Core CS will be preferred even for a Aiml masters. Most universities consider a specialized branch (for BTech) a bad thing."
    }
  ]
}