{
  "id": "1f6o16o",
  "title": "Whats the name of this guy and what does he do",
  "content": "",
  "metadata": {
    "root_comment_id": "ll1muaq",
    "post_id": "1f6o16o",
    "author": "samrth_1991",
    "url": "https://i.redd.it/ygm43cfba9md1.jpeg",
    "permalink": "https://reddit.com/r/PESU/comments/1f6o16o/whats_the_name_of_this_guy_and_what_does_he_do/",
    "score": 54,
    "upvote_ratio": 0.9800000190734863,
    "created_utc": 1725221851,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "ll1muaq",
      "body": "There's not much available on the internet about him. \n\nHe's Prof. Ajoy, was the COO earlier and perhaps in a similar role now after the administrative restructuring post university status.\n└── he was there for the pessat counselling atleast for round 1, sadly didnt speak about KPIs"
    },
    {
      "id": "ll30ss4",
      "body": "His job is to spread misinformation around campus"
    },
    {
      "id": "ll38ea4",
      "body": "[https://pes.edu/about/leadership/prof-ajoy-kumar/](https://pes.edu/about/leadership/prof-ajoy-kumar/) (now don't come back and say that this is a different guy - he was not bald when he joined PES)\n└── PES is a machine that turns young people into bald people 💯 (I'm balding too and I'm scared 😰)\n    └── Lmao"
    },
    {
      "id": "ll3vvbh",
      "body": "It's Per-Se Man. He keeps per-serrizing the students.\n└── Lol 😂"
    },
    {
      "id": "ll3w08r",
      "body": "College friend on Jawahar Doreswamy. He is here since pre university days."
    },
    {
      "id": "ll4srhh",
      "body": "He used to teach for Information science and computer science students when I was in college (EC campus) from 2009-13. Being from the ECE branch never had the opportunity to be in his lectures. \n\nHis name is Ajoy Kumar and always have this memory of him walking around with his earphones connected to an ipod. \n\nThat's all we knew about him.\n├── damn that description of him walking made me smile\n└── lol we used to call him killjoy"
    },
    {
      "id": "ll4xwmr",
      "body": "Taught us Unix, barely the subject and a lot Life Gyan, most of which was offensive to people but is very practical in the real world.\nNo BS, a little stereotypical but really appreciate hard-working folks. An eye opening (if not offended) series of classes."
    },
    {
      "id": "ll5gvuc",
      "body": "He's a phantom that appears only during the admission season then disappears without a trace.\n└── Unless u worked as vol for the amateur scientist where he is incharge"
    }
  ]
}