{
  "id": "1f778o0",
  "title": "Urgent ðŸ™ðŸ™",
  "content": "Hello guys! I am getting pes(rr) ece and bmsce ece and hell lot of confused what to choose. I visited to campus and talked to both the college students and it created more confusion in my mind. So as far I researched and got to know is\n1. Infra : pes > bmsce\n2. Placements: not sure but PPL say it's almost similar but pes have slight edge.\n3. Free time : pes < bmsce \n4. College life : depends on the friends you make \n5. Fests : pes < bmsce \n6. Clubs and activities: pes > bmsce \n7. Hostel Life : not sure \nFor me I am completely orientiated to ece and want to do core itself. The campus and opportunities of pes tempt to me to choose pes whereas the reputation and less crowd makes me feel to go for bmsce. At this point I am in 50:50 situation. If you guys can guide me what to choose and tell me what you would choose if you were in this situation would help me a lot . Thank you .",
  "metadata": {
    "root_comment_id": "ll5asau",
    "post_id": "1f778o0",
    "author": "Lopsided_Pilot1901",
    "url": "https://www.reddit.com/r/PESU/comments/1f778o0/urgent/",
    "permalink": "https://reddit.com/r/PESU/comments/1f778o0/urgent/",
    "score": 12,
    "upvote_ratio": 1,
    "created_utc": 1725285057,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "ll5asau",
      "body": "I would pick pes. \n\nIf you're interested in ece good. But if you're not, then branch changing to cs or aiml is super easy, especially ec campus. If that's something you'd like, then yeah\nâ””â”€â”€ Hmm thanks"
    },
    {
      "id": "llbhb4q",
      "body": "I would pick pes ece. Mainly cuz of the syllabus , faculties , facilities . was in bms for a few days during their bootstrap or smtg. the labs aren't tht great.\nâ””â”€â”€ Ohh thanks"
    },
    {
      "id": "llfhi71",
      "body": "BMS ec is better\n\nThe Thing in pes is only cs and aiml course are good, all other courses placements are not upto mark, you have to remember that there is no such good talk in pes for courses like ec,eee,mech\n\nBMS is pretty cool, chill environment and not hectic load on students like pes, BMS ec average package is around 10-12 Lpa and BMS ec placements are way better than pes ec\n\nPreferably, BMS ec >>>>> pes ec\nâ””â”€â”€ Alr thanks"
    },
    {
      "id": "llmyikh",
      "body": "In bms seats are inflated a lot from this year (around 1200 bmsce cse seats + 900 BMSIT CSE seats not including any CS specialization SEATS) the thing is, you have a lot of competition during placement as you're in ECE (THEY HAVE INCREASED ECE SEATS AS WELL)\n\nMy suggestion Would be PES ECE if you want relatively less competition during placement season."
    }
  ]
}