{
  "id": "1f7twxp",
  "title": "EC moving to RR",
  "content": "I heard the EC campus is getting moved to RR campus and the EC buildings are getting used for growing the medical college facilities. Any idea when this is happening and what does a combined campus mean for students from EC ?",
  "metadata": {
    "root_comment_id": "ll9uje3",
    "post_id": "1f7twxp",
    "author": "EasyOtter70",
    "url": "https://www.reddit.com/r/PESU/comments/1f7twxp/ec_moving_to_rr/",
    "permalink": "https://reddit.com/r/PESU/comments/1f7twxp/ec_moving_to_rr/",
    "score": 13,
    "upvote_ratio": 0.8799999952316284,
    "created_utc": 1725348321,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "ll9uje3",
      "body": "Nope not happening , atleast that’s what the guy presenting the PESSAT second counselling said so"
    },
    {
      "id": "ll9ynx2",
      "body": "The COO said that it's far from the truth and they want to focus on ec campus or smth."
    },
    {
      "id": "lla0pdl",
      "body": "Turns out it's just a rumour"
    },
    {
      "id": "lla18rc",
      "body": "That'd be crazy...they have to build new classrooms and such and more canteens. Doubt they'd make the switch. If they want to introduce a new stream then they will build."
    },
    {
      "id": "lla9vcq",
      "body": "If it's happening, it's not happening anytime soon. Only the people in the upper management know about stuff like this and if it's close to happening, they would have definitely announced it somewhere"
    },
    {
      "id": "llad13u",
      "body": "All very valid points. However, I did hear from a couple of sources including from a current student in EC. Fingers crossed !\n├── Whom would it benefit?\n│   └── exactly it wouldn't change shit. might make it worse infact, cause rr already has no space.\n└── This was clearly stated as a rumour on sunday\n    └── Oh. Sounds like it was ruled out categorically."
    },
    {
      "id": "llaut4e",
      "body": "Oh. Sounds like it was ruled out categorically."
    },
    {
      "id": "llaye4z",
      "body": "Rr is overcrowded as it is"
    },
    {
      "id": "llxosut",
      "body": "I don't think they'll move anytime soon (like in 10 years) tbh. They building golden jubilee building from 4 years so idts they will"
    }
  ]
}