{
  "id": "1fdph6b",
  "title": "Amaarta Hostel Cooked?",
  "content": "I was fucking flabbergasted reading all the hostel rules and regulations.\nIs the warden actually strict or is it just to glaze our parents?\nDo all of yall follow the rules or chumma just starting starting itll be like that and then later you can fuck around?",
  "metadata": {
    "root_comment_id": "lmhcluo",
    "post_id": "1fdph6b",
    "author": "hypiri-",
    "url": "https://www.reddit.com/r/PESU/comments/1fdph6b/amaarta_hostel_cooked/",
    "permalink": "https://reddit.com/r/PESU/comments/1fdph6b/amaarta_hostel_cooked/",
    "score": 6,
    "upvote_ratio": 0.8799999952316284,
    "created_utc": 1725993868,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "lmhcluo",
      "body": "They don't really implement a lot of rules and regulations. The boys hostel warden is chill as long as you dont do stupid shit. The girls hostel straight up sucks, has too many restrictions.\n└── what abt the curfew timings? \ndo they actually fine us for that?\n    └── For girls hostel it's 6:30. They won't fine if you're late but you'll get scolded. For boys ig it's 7:30 pm not sure though."
    },
    {
      "id": "lmjxpp6",
      "body": "bruh pandu the warden is chill af , only for the first few days they gonna act strict , as long as you dont do stupid shit like weed and alcohol you gonna be fine."
    },
    {
      "id": "lmmrpup",
      "body": "nah its nowhere near that strict in reality it seems"
    },
    {
      "id": "lmq5rv8",
      "body": "Are there vacant seats for freshers as of now\n└── yeah ofc\n    └── Can I expect rooms by the end of this month as I have applied for r2 of kcet\n        └── im not aure abt that, cuz actual classes are gonn start from 28th of this month\nj call him up n ask no\n            └── Can you please do that for me\n                └── there are exactly 100 vacancies for boys and around 5 for girls, so you better finish the college adm and the hostel adm in oneday as soon as the 2nd round results are out.\n(1st year hostel is about 8km away from the campus)\n                    └── Thank you so much\n\nAnd do they provide bus facility to come to campus?\n                        └── yeah they do pickup and drop, everything included in the hostel fees"
    }
  ]
}