{
  "id": "1fgl8tz",
  "title": "Study hours",
  "content": "Seniors, would like to ask how many of you study for 36 hours a week seriously and what cgpa did you all get??\n",
  "metadata": {
    "root_comment_id": "ln2vc8m",
    "post_id": "1fgl8tz",
    "author": "Confident_Chard7453",
    "url": "https://www.reddit.com/r/PESU/comments/1fgl8tz/study_hours/",
    "permalink": "https://reddit.com/r/PESU/comments/1fgl8tz/study_hours/",
    "score": 0,
    "upvote_ratio": 0.5,
    "created_utc": 1726317919,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "ln2vc8m",
      "body": "36 hours a week is 5-6 hours a day. I assure you that most people who have a life arent studying that long, barring the week preceding exams. Chill man this isn't JEE."
    },
    {
      "id": "ln2xmjn",
      "body": "Even the week before exams you don't need to study more than 1-2 hours\n\nOn the week of exams maybe 5 hours or so\n\nIt's really simple shit dude, nothing like jee. More like 10th boards, not even 12th\n\nJawahar is a moron don't listen to a word he says\n└── Though I agree 36hrs is a stretch but it's definitely not as easy as you're making it look here lmaoo\nIt is really subjective to a individual's intellect and learning pace imo. If somebody has a slower pace of learning they definitely need to study a little more than others on a regular basis or before the exam season starts."
    },
    {
      "id": "ln30gif",
      "body": "R u serious? This guy scared us first day itself. He says 24-30-36 ur choice and accordingly u get the reward.... \nHe says min 24 hours and I'm surprised PPL in the starting don't even touch 18\nAnd one thing there r no options it seems  so will it become very tough to score 9+ in pes(I have top public us schools for masters in mind)\n└── I don't know who's comment you intended to reply to, but if it was mine, I'll let you know that fearmongering among students is the tactic motherfuckers like Jawahar use because they want their college to be seen as the \"best\". This is the kind of mentality that leads to stress and depression.\n\nI'm an average student. As in I take time to understand concepts and I'm definitely not anywhere in the top. I don't study more than 2 hours in a day and I managed to get 8+.\n    └── This answers most questions related to achieving higher sgpas and cgpa ultimately."
    },
    {
      "id": "ln4gyg2",
      "body": "There are good comments here already but if you're looking for more, there are a couple of old comments (from me mostly) about how difficult the ISAs/ESAs can get. Those should give you a better idea."
    },
    {
      "id": "lnc5tqb",
      "body": "I think the most important part is to keep yourself up to date with the syllabus covered in class. It will hardly take you 1-2 hours a day to revise the day’s syllabus, and to briefly do a cumulative revision. Trust me, this will help you stay relaxed during the exams."
    },
    {
      "id": "lnfsnj4",
      "body": "Hi"
    },
    {
      "id": "lnfstsp",
      "body": "Hi hi"
    }
  ]
}