{
  "id": "1fgq6ku",
  "title": "When will be the ISA for 1st semester?",
  "content": "Just curious with tight semester schedule when will ISA happen",
  "metadata": {
    "root_comment_id": "ln3zg7u",
    "post_id": "1fgq6ku",
    "author": "ReasonableFeed2045",
    "url": "https://www.reddit.com/r/PESU/comments/1fgq6ku/when_will_be_the_isa_for_1st_semester/",
    "permalink": "https://reddit.com/r/PESU/comments/1fgq6ku/when_will_be_the_isa_for_1st_semester/",
    "score": 7,
    "upvote_ratio": 0.8999999761581421,
    "created_utc": 1726331754,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "ln3zg7u",
      "body": "Bro said after 6-7 weeks of classes test will be there today"
    },
    {
      "id": "ln3zsc3",
      "body": "You will get the whole sem calendar within a week after ur classes start"
    },
    {
      "id": "ln42bpq",
      "body": "Around October end"
    },
    {
      "id": "ln47oj6",
      "body": "31st November first ISA bro\n\n\n\nLol,jk..... generally 7weeks into the semester"
    },
    {
      "id": "ln77wc3",
      "body": "Yesterday"
    },
    {
      "id": "lnutdmn",
      "body": "November second week most probably as maaya is on 6th and 7th nov\n└── Oh it's a two day fest? What all happens in maaya and will we have classes at that time as well? \n    └── Well technically a one day fest. So it goes like the entire week will be fun. There will be themes decided according to which you can wear dresses for eg cosplay day (dress as a character) , mismatch day , traditional day and other . Classes will go on as usual and on the friday there will be no classes, the entire day clubs will be hosting their respective events and evening is the concert.\n\n  \nSenior Tip -\n\nDont miss the concert, dont think that mayaa holiday is a long vacation and go home. \n\nParticipate in as many no of competitions. \n\nYou cannot take your bags to MRD concert and you cannot keep the bags in classes(as campus closes at 5 and the concert will end at 8) so either get your car or ask your friend to keep your bag in his/her car.\n        ├── woah cool ty\n        └── hey maaya is happening on weekend( 9-10nov), so will we have any events lined up before 9-10, during the weekdays or just classes as usual?!"
    }
  ]
}