{
  "id": "1fgtp99",
  "title": "a sad tale",
  "content": "introverted. shy. lonely this was everything i was, this was everything she wasn’t. my gaze met hers and the stars aligned, a universal event that would put even the gods to shame. water slid off my cheeks, this time it wasn’t the tears that i always shed, it was the rain, a walk in the rain with her that filled my heart to the point of spillage, she poured everything i didn’t possess into me but alas, even alexander fell to his knees, who am i to deserve something astronomical. a mere lover in the midst of this bustling college, a mere romantic in this world full of romeos, a mere nobody in this universe. all i ask for is guidance now.",
  "metadata": {
    "root_comment_id": "ln4qfav",
    "post_id": "1fgtp99",
    "author": "lonelybug99",
    "url": "https://www.reddit.com/r/PESU/comments/1fgtp99/a_sad_tale/",
    "permalink": "https://reddit.com/r/PESU/comments/1fgtp99/a_sad_tale/",
    "score": 46,
    "upvote_ratio": 0.8399999737739563,
    "created_utc": 1726341602,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "ln4qfav",
      "body": "Bluds down bad\n└── i asked for advice not hate comments 🙃"
    },
    {
      "id": "ln4t2u6",
      "body": "Shit happens, move on bro.\nTry reaching out to other dating related subs.\n└── i'm way too shy for that, what we had was something i can never find on dating apps. anyway i can get her back?\n    ├── Check dm\n    └── Dm me if possible\n        └── hehe, it's fine, not much to do now i guess 🙃"
    },
    {
      "id": "ln4tjnz",
      "body": "freaky ahh romance"
    },
    {
      "id": "ln50k97",
      "body": "To kya mai nachu\n└── advice dedo thoda!"
    },
    {
      "id": "ln57qjl",
      "body": "Just leave social media for a while and focus on work and see the results don't fall for mere distractions"
    },
    {
      "id": "ln6xout",
      "body": "I wish i had a heart to understand this."
    },
    {
      "id": "ln6zsuv",
      "body": "Bro shaked my spears"
    },
    {
      "id": "ln70mwr",
      "body": "Romanticizing loneliness is my only coping mechanism too man. Works like a charm every time\n└── Underrated"
    },
    {
      "id": "ln71am2",
      "body": "Dont worry, pes will prepare u for the worst, so u will feel that it was nothing afterall <3"
    },
    {
      "id": "ln72bef",
      "body": "r/breakups"
    },
    {
      "id": "ln74ekr",
      "body": "I don't have anything to say here, nonetheless upvoted this masterpiece"
    },
    {
      "id": "ln7ei1p",
      "body": "bro u shld write"
    },
    {
      "id": "ln7jgrb",
      "body": "Ball up top dawg"
    },
    {
      "id": "ln7lub7",
      "body": "Do you read?"
    },
    {
      "id": "ln7o9p5",
      "body": "It's joever"
    },
    {
      "id": "ln7occ3",
      "body": "It's joever"
    },
    {
      "id": "ln7tzdw",
      "body": "Arts kyu nahi liya itna bootiful poetrie"
    },
    {
      "id": "ln9wojo",
      "body": "u/lonelybug99 i think its time for pattangere shed."
    },
    {
      "id": "lnj8uwq",
      "body": "Just talk to her, don't romanticize your loneliness. You have nothing to lose, if it was meant to be it will be. Just remember that everything happens for a reason, and the pain of rejection is worse than that of never trying. \nWho are you ? You are the main character of your own story, and it will be what you make of it."
    },
    {
      "id": "lnj90y8",
      "body": "Tf is this cheeseball"
    },
    {
      "id": "lnjo7r0",
      "body": "dont worry homie, im single\n└── ;)"
    },
    {
      "id": "lnwyhu9",
      "body": "Don't worry you will get her"
    }
  ]
}