{
  "id": "1fh4ghd",
  "title": "URGENT HELP PLS",
  "content": "PES RR CS+AIML (PESSAT) VS PES EC CS CORE (KCET).\n\nWhich do you think is a better option for the upcoming years? Also how tough is it to switch campus cause in the orientation jawhar sir mentioned a cutoff of 9.44(Which seems pretty high)? ",
  "metadata": {
    "root_comment_id": "ln7957q",
    "post_id": "1fh4ghd",
    "author": "Nice_Philosopher4224",
    "url": "https://www.reddit.com/r/PESU/comments/1fh4ghd/urgent_help_pls/",
    "permalink": "https://reddit.com/r/PESU/comments/1fh4ghd/urgent_help_pls/",
    "score": 0,
    "upvote_ratio": 0.25,
    "created_utc": 1726374877,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "ln7957q",
      "body": "PES EC CSE. Don't waste money on a PESSAT seat."
    },
    {
      "id": "ln7978j",
      "body": "My advice - Don't gamble with the cutoffs,it differs from year to year.Take what u want now itself."
    },
    {
      "id": "ln799wh",
      "body": "Pes ec cse is a no brainer, Who in their right mind wants to pay 20L for a btech degree. Branch change ito rr is difficult since you gpa needs to be near 9.5 and pes doesn't make it easy to score marks ,maintain 35+ in all your internals and study well for esa you can cross 9.5 easily"
    },
    {
      "id": "ln7tbs1",
      "body": "take rr it’s the main campus and also god knows when cet results will come so you can join the college on time and not be late\n└── So your logic is that it's better to join 2 weeks early rather than saving 15 lakh?"
    },
    {
      "id": "ln956p5",
      "body": "Man, I would suggest just going with ec cse core. It's a win-win situation, man, if your worried about placements, the fact that both campuses have the same placements, if you still want to come to RR campus, work hard and get a good cgpa sufficient enough to come to RR campus, don't burden your parents with pessat fees, I kind of request you to not go with PESSAT, as  you know it all, it ain't worth that money even after getting such a good university via kcet......"
    },
    {
      "id": "lnd0w98",
      "body": "I am a btech student in EC campus \nI am a ncc cdt,\nAnd I am attending a camp in AFS\nWhich means I am not attending the bootstrap also I did not attend the orientation \n\nSo am I Missing on anything?\nAlso I will be missing classes for like 10 days\n\nWill it make any difference in my academic waise??"
    }
  ]
}