{
  "id": "1fhducc",
  "title": "Bootstrap",
  "content": "What do we have to bring on 17th sept bootstrap. And what exactly is bootstrap? It was vaguely told at orientation.",
  "metadata": {
    "root_comment_id": "ln93154",
    "post_id": "1fhducc",
    "author": "CompetitiveClue1820",
    "url": "https://www.reddit.com/r/PESU/comments/1fhducc/bootstrap/",
    "permalink": "https://reddit.com/r/PESU/comments/1fhducc/bootstrap/",
    "score": 12,
    "upvote_ratio": 1,
    "created_utc": 1726410656,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "ln93154",
      "body": "Which branch\n├── How does it matter?\n└── Cse ai and ml\n    └── He make u talk with Siri or Google 🫠jk"
    },
    {
      "id": "ln95iym",
      "body": "Free labour for pes\n├── pr points for pes\n└── Lmao"
    },
    {
      "id": "ln99qml",
      "body": "I'm going to say what I know about mechanical boostrap since I helped conducting it past 2 years. Don't need to carry anything. it'll take place in the parking lot. First you'll be shown some informational videos (boring, just to extend time). Next there are cars and bikes which is kept and some seniors will explain about the vehicles internals and running and give you guys the opportunity to do some basic work on them. This activity is honestly fun and a change of pace, so I suggest you attend it. Idk if the boostrap is the exact same this year as well tho but should be similar\n└── Is it different for other branches or same for all?"
    },
    {
      "id": "ln9d59c",
      "body": "Don't go for community service day. It's just cleaning and painting a govt school. Paint fell on my pant 😢\n├── Forget paint bruh I inhaled so much dust while cleaning I ended up falling sick.\n└── Shit man I don't need no paint on my clothes parents gon kill me."
    },
    {
      "id": "ln9gvnf",
      "body": "I only attended 2 days of bootstrap , its not that important and u can skip if u want\n└── Will there be attendance during this period?\n    └── They make you sign on a paper , they say they take attendance, but it's not counted along with the normal classes"
    },
    {
      "id": "lne2dfb",
      "body": "you dont have to bring anything, the purpose of bootstrap is just to give you guys a way of socialising with one another\n└── Thanks man"
    },
    {
      "id": "lnek6m9",
      "body": "Do they give attendance for bootstrap and is it mandatory to attend?"
    },
    {
      "id": "lnfa97w",
      "body": "What is the timing of bootstrap. Till 3PM?"
    }
  ]
}