{
  "id": "1fjnw5s",
  "title": "Dont igone please help ",
  "content": "Hello, I am an EC campus student. On August 13 at 12:15, I went to the library to borrow a DSA book. They told me they couldn't give me the book because I had already taken 3 books. When I checked, 2 of the books had already been returned in April, but they hadn't updated their records. The third book, which I never took, is about Yoga and Meditation.\n\nHere's the main issue: the third book was issued to me on August 13, but that was the first time I had entered the library. Now, it's shown as issued under my name. I explained the situation to them, but it’s been more than a month. I’ve gone to the library more than 10 times, and they still haven’t resolved it. Now, they are asking me to pay a 300 INR fine for the book I never took because they can't find it.\n\nWhat can I do now? Please help me. I am mentally exhausted.\n\n",
  "metadata": {
    "root_comment_id": "lnpduel",
    "post_id": "1fjnw5s",
    "author": "Enough_Necessary7915",
    "url": "https://www.reddit.com/r/PESU/comments/1fjnw5s/dont_igone_please_help/",
    "permalink": "https://reddit.com/r/PESU/comments/1fjnw5s/dont_igone_please_help/",
    "score": 22,
    "upvote_ratio": 1,
    "created_utc": 1726648047,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "lnpduel",
      "body": "just pay them and have peace of mind\n├── Ya.but 300 is huge for me\n└── Not everyone is rich enough to throw away 300 bucks😭\n    └── Then earn it ...! If ur telling u r not rich then it ur parents money ...!!!\n        ├── buddy,take it easy.  \nThere is no need to criticize him for depending on his parents while he/she is in college.  \nIf you arent then thats a personal choice.\n        │   └── Pretty sure he was being sarcastic lol, Jawahar said something on the same lines during the orientation\n        │       └── Ohh\nMb then\n        └── Have to pay back everything my parents spent on me (it's 8.6Cr I'm cooked)"
    },
    {
      "id": "lnpf05c",
      "body": "Try emailing pes or contact ur mentor\n└── Ya will try to contact my mentor \n    └── Try telling them the scenario,in most cases they will just write a letter to the librarian and it should get resolved.\n\nTry telling them that it was not you who took the book,and now you have to borrow another book for the ISAs.\n        └── I am telling the same from last one month.\n\nbut nothing  happened till now."
    },
    {
      "id": "lnpkaxp",
      "body": "Is the library open on Saturdays?\n└── yes"
    },
    {
      "id": "lnq2bx4",
      "body": "send me ur gpay number. ill send u 300\n├── Split in 2 ( i can contribute) 🙋\n└── What a legend"
    }
  ]
}