{
  "id": "1fl7wzn",
  "title": "to the seniors of pes (or the newbies joining too, mainly seniors) is living close to pes better, like in a society(apts), or living far at home (like 24-25kms+) and commuting everyday? long term.",
  "content": "title",
  "metadata": {
    "root_comment_id": "lo0z13x",
    "post_id": "1fl7wzn",
    "author": "godgreeting",
    "url": "https://www.reddit.com/r/PESU/comments/1fl7wzn/to_the_seniors_of_pes_or_the_newbies_joining_too/",
    "permalink": "https://reddit.com/r/PESU/comments/1fl7wzn/to_the_seniors_of_pes_or_the_newbies_joining_too/",
    "score": 8,
    "upvote_ratio": 0.8500000238418579,
    "created_utc": 1726824444,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "lo0z13x",
      "body": "My home is a similar distance from college and commuting is a pain in the ass. I have to spend 2-3 hours in evening traffic and by the time I'm back I'm too exhausted to study or do anything else. It gets harder as your workload only increases in higher semesters. \n\nIf I were you I would prefer to live closer to college (assuming you don't have a metro connection)."
    },
    {
      "id": "lo1b791",
      "body": "i live far and let me tell you , during half days in summer , its really fucking exhausting , so in even semesters you are absolutely cooked unless u have your own car"
    },
    {
      "id": "lo1fu9o",
      "body": "Get a place nearby clg itself"
    },
    {
      "id": "lo1pb3g",
      "body": "I completed my degree commuting daily up and down 32kms, from HSR to RR Nagar, honestly at points I felt annoyed, especially with silk board traffic. But now that I look back I honestly don't think it was that bad. It's better than renting and living in small apartments imo.\n└── in the same situation as a newbie, do you recommend getting a car or is the bus good enough?\n    └── Idk about car, I used to commute on a 2 wheeler. I would try out bus for a few days to get a good idea if I was you"
    },
    {
      "id": "lo21flm",
      "body": "What could possibly be the advantage of living far from college, I'm curious\n└── True"
    },
    {
      "id": "lo5rgi4",
      "body": "If you have the option to, Living near campus is better hands down! You’d also be living close to malls, shops, restaurants everything."
    },
    {
      "id": "lo6o17m",
      "body": "I'm from pes ecc 3rd yr. My home is in Hebbal North blr,\nI tried traveling in 2nd sem to and fro, it drained the fuck out of me. Mornings it took me 1.1 hr but evening makes it 2.5 to 3 hr thanks to Blr traffic. I would go to Hebbal via majestic in BMTC . Later shifted to PG and now its Peace !"
    }
  ]
}