{
  "id": "1fle1kl",
  "title": "need sugg",
  "content": "i have pes ec aiml rn and in the next round can get pes rr ece i am personally interested in studying computers itself but now everyone that i talk to is suggesting to opt for rr campus as it’s way better and recommending that i can change course or sit for cse placements despite my branch.\ni am in 2 minds rn so please any seniors can help me out!\n",
  "metadata": {
    "root_comment_id": "lo2bvey",
    "post_id": "1fle1kl",
    "author": "spiderma-am",
    "url": "https://www.reddit.com/r/PESU/comments/1fle1kl/need_sugg/",
    "permalink": "https://reddit.com/r/PESU/comments/1fle1kl/need_sugg/",
    "score": 4,
    "upvote_ratio": 0.7599999904632568,
    "created_utc": 1726844282,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "lo2bvey",
      "body": "Take rr, better campus and also ece is like core eng. Branch. You will be able to go for cse placements and if you want you can go into core also. Ece is also computers btw literally. Designing computer chips, ai hardware etc.\n\nI'm rr aiml btw, was ece but got aiml in round 2 kcet\n├── how is aiml going on, as i am thinking to take aiml in pes rr campus , but the thing is i am not that good at maths but decent ..... , and tell me if it is true that that cse core and cse(aiml) are 90 percent same and also , in last year we can avoid ai electives etc ....... (was said by some senior)...... and how are placements for aiml people and how hard are papers designed for aiml students by pes\n├── you are a fresher or a senior??\n│   └── Fresher\n└── Better campus doesn't play any role. And being from ECE will restrict OP's opportunities when it comes to placements in IT (or for future MS admissions).\n    └── yo rowlett needed to ask something pertinent,can i dm?\n        └── Sure"
    },
    {
      "id": "lo32vpx",
      "body": "If you're interested in CS, pick CS. There's no difference between campuses. If your goal is to get into IT companies, being from ECE will work against you. There are many posts and comments on this subreddit which discuss it in detail - check the FAQs you'll find more info about CS placements from ECE and other related topics.\n├── I just don't understand, despite such brilliant [comment](https://www.reddit.com/r/PESU/s/XtXGawoLGr) from you, why majority is still biased towards RR campus, while I agree peer group is relatively better their, but what are the other factors. At this point it just seems like a word of mouth that rr is better.\n└── thanks bro"
    }
  ]
}