{
  "id": "1foxekc",
  "title": "I am considering buy macbook m1 air in upcoming sale? Feedback needed !!",
  "content": "I am joining PES EC Cse Aiml and thinking to buy Macbook M1 Air which is costing around 52-55k in coming sale. \nNeed feedback interms of weather its a good choice for a college student who isnt much in gaming, my main work would be coding and general purpose use. Are there any restrictions in any subject which restrain from using macbook? Let me know your thoughts.",
  "metadata": {
    "root_comment_id": "lotdkgs",
    "post_id": "1foxekc",
    "author": "LibrarianAgitated702",
    "url": "https://www.reddit.com/r/PESU/comments/1foxekc/i_am_considering_buy_macbook_m1_air_in_upcoming/",
    "permalink": "https://reddit.com/r/PESU/comments/1foxekc/i_am_considering_buy_macbook_m1_air_in_upcoming/",
    "score": 4,
    "upvote_ratio": 1,
    "created_utc": 1727243249,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "lotdkgs",
      "body": "It's good for coding, but again you might encounter issues when it comes to installing certain packages which is always a problem on MacOS. It would be better if you get a laptop which has windows dual booted along with Linux.\n└── Ok..yes i did hear about this. Isnt there any way around this?\n    ├── Afaik the m1 had these issues. Not sure about m2, hopefully it might have been resolved.\n    │   └── Ok thanks mate\n    └── Been using m1 mac air for about 3 years now, incredible for coding anything but AI/ML related stuff. \n\nIf you are planning on going deep into AI/ML , stay away from Mac in general.\n\nOther than that, i haven’t encountered any issues with installing packages so far. \nBut i also have a home server running which i use as a remote dev server if some package is Linux specific/ has terrible support for mac, so I’m a lil biased."
    },
    {
      "id": "lotee40",
      "body": "go for m2. most software is available on mac now and there are always workarounds. Plus Windows and Linux VMs run very smooth.\n└── Rookie question is linux and windows VMs easy to install in macbook? Also if it will work fine in mac m1? Or need to go for m2?\nI did check lot of reviews m2 doesn’t have huge changes compared to m1.\n    └── Easy to install. Cracked software available. M1 and m2 doesn’t matter software wise but the m1 is like 4 years old now.\n        └── Thanks.. will check m2"
    },
    {
      "id": "lotk6tp",
      "body": "Please be careful with it I've heard that some users including myself have experienced screen issues with the MacBook M1 Air, including horizontal or vertical lines. This is reportedly due to problems with the device's architecture and T-con chip. If you're considering buying one, I'd recommend doing some more research and perhaps considering other options.\"\n├── Many of my friends, including myself bought it during first year, haven’t had any such issues, so I think it should be safe to buy. All depends on how op takes cares of it ig\n│   ├── Yep absolutely, but especially the 2016-17 touchbar models have this issue.\n│   │   └── Intel Macs are definitely a RL\n│   └── So you do recommend macbook air 1 for college?\n│       ├── For sure\n│       └── Yep, absolutely worth it\n└── My brother has one and using it since last 2 years not facing any issue"
    }
  ]
}