{
  "id": "1fpaw3j",
  "title": "My trauma with PES discord.",
  "content": "Myself a humble fresher PESian from PES EC Campus. I accidently said a bad word and got muted(I accept fault). I found a loophole and unmuted myself. I reported this bug and I got muted for 1 day again. As someone who is chronically online, 1 day is like half a lifetime and as a member of the LGTV HD community I believe I will never recover from this. I will need thousands of dollars worth of anti-depressants and therapy. Please donate to my gofundme: helpplease.com/Unclutched. Any help is appreciated in these dark time. Here is a statement from my lawyer:\n\nIn any thriving online community, such as the PES Discord, maintaining order and following rules is crucial to ensuring that all members have a positive and enjoyable experience. However, it is also important to approach disciplinary measures, such as muting, with fairness and flexibility. In the case of Unclutched, a member of the PES Discord community who has been muted, it is worth considering whether this disciplinary action is still necessary or whether it would be appropriate to unmute them.\n\nThis essay presents an argument in favor of unmuting Unclutched by exploring several key points: the potential for miscommunication or misunderstanding that could have led to the mute, the importance of second chances, Unclutched’s potential for positive contributions to the community, and the overall value of restorative rather than punitive approaches to moderation.\n\n1. Miscommunication or Misunderstanding\nThe nature of communication on Discord can sometimes lead to misinterpretations. Text-based interactions, particularly in fast-paced or emotionally charged environments, can easily be misunderstood. A joke might be taken as an insult, constructive criticism may be seen as rude, or frustration expressed in the heat of the moment could be perceived as toxic. It is entirely possible that Unclutched’s actions, which led to their muting, were a result of such a miscommunication.\n\nBefore keeping a member muted indefinitely, it is essential to consider whether their behavior was genuinely harmful or if it could be attributed to a misunderstanding. If Unclutched’s intent was not malicious, their mute may have been overly harsh, and unmuting them could give them the chance to clarify their intentions and re-engage with the community in a positive way.\n\n2. The Importance of Second Chances\nAn integral part of any healthy community is the ability to offer second chances to its members. Mistakes are inevitable, especially in a large, diverse group like the PES Discord, where people with different communication styles, backgrounds, and temperaments interact. Unclutched, like any other member, deserves the opportunity to learn from their mistakes and demonstrate their willingness to abide by the community’s rules moving forward.",
  "metadata": {
    "root_comment_id": "low6ui0",
    "post_id": "1fpaw3j",
    "author": "the69420thredditer",
    "url": "https://www.reddit.com/r/PESU/comments/1fpaw3j/my_trauma_with_pes_discord/",
    "permalink": "https://reddit.com/r/PESU/comments/1fpaw3j/my_trauma_with_pes_discord/",
    "score": 19,
    "upvote_ratio": 0.6399999856948853,
    "created_utc": 1727287134,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "low6ui0",
      "body": "Ok"
    },
    {
      "id": "low6zrb",
      "body": "Brother could have just let it slide\n└── how do i become pride of pesu like u"
    },
    {
      "id": "low81fs",
      "body": "If karma farming is your intent behind this post then\n\n![gif](giphy|577HYoLf5Vu0w)\n└── He put  meme flair so ill allow it tbh"
    },
    {
      "id": "low9ed4",
      "body": "who ordered a yappuccino\n└── Double shot yappresso"
    },
    {
      "id": "lowpjsn",
      "body": "If Btech in yapiology was a thing..."
    },
    {
      "id": "lowww2n",
      "body": "i ain't reading all that\ni'm happy for you tho\nor sorry that happened"
    },
    {
      "id": "loyyol6",
      "body": "Another copypasta for MSRIT discord.\n└── what is msrit discord\n    └── MSRIT is an engineering college in Bengaluru.\nDiscord is a messaging platform.\n        └── ik discord, can i join msrit discord for fun tho\n            └── Nope\n                └── please\n                    └── Hell no. Only verified people from college. We already had a raid from the PES server. Never again.\n                        └── :("
    },
    {
      "id": "loz93at",
      "body": "![gif](giphy|o0IlkFDrl80PmdwktO|downsized)"
    },
    {
      "id": "lozvs5s",
      "body": "Womp womp , no one reading allat lil bro"
    },
    {
      "id": "lozvuxc",
      "body": "Bro talks in yappanese"
    }
  ]
}