{
  "id": "1fs6ry6",
  "title": "Why laptop?",
  "content": "Some of my friends in other vtu colleges told me that they do not carry laptops but in pes ec campus laptops are supposed to be brought.why is this so? Can anyone explain",
  "metadata": {
    "root_comment_id": "lpi62yj",
    "post_id": "1fs6ry6",
    "author": "ORIONpax-km121",
    "url": "https://www.reddit.com/r/PESU/comments/1fs6ry6/why_laptop/",
    "permalink": "https://reddit.com/r/PESU/comments/1fs6ry6/why_laptop/",
    "score": 9,
    "upvote_ratio": 0.7599999904632568,
    "created_utc": 1727623213,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "lpi62yj",
      "body": "Different college different rules!"
    },
    {
      "id": "lpi6s0v",
      "body": "which branch\n└── Cse core- fresher\n    ├── ._____.\n    ├── Dude , You are CSE guy . You should carry a laptop regardless as a student .\n    └── This batch makes my brain hurt\n        └── sorry on behalf of all logical 28 kids"
    },
    {
      "id": "lpi90xc",
      "body": "Pretty sure pes is not vtu"
    },
    {
      "id": "lpiatpn",
      "body": "vtu colleges   \nonly physics cycle has programming languages c/python   \nwhereas in  pes we have computer courses in both sems   \npython in sem 1 and c in sem 2 \n\nand the requirement of bringing laptop also differs professor to professor   \ndont need to bring laptop on day 1 wait until your professor tells you whether you should bring or not\n└── Ok but the way my professor was telling to bring laptop feels as if we would be using it in every class till semster ends. Also i am not so comfortable in bringing laptop everyday to class\n    └── whether you like it or not from 2nd year you have to get your laptop if you are a cs student   \nits better if you get used to it from now on itself\n        └── Ok i see thanks for helping out"
    },
    {
      "id": "lpidp5c",
      "body": "We do a lot of stuff outside academics and the laptop is our Swiss army knife"
    },
    {
      "id": "lpilanx",
      "body": "pes said bye bye to vtu long back brother"
    },
    {
      "id": "lplm3fe",
      "body": "in your 1st year, it is quite manageable without bringing a laptop to campus.\nThe teachers wont force it\nSince youre in cse, you must get it\nbut if you wanna get in 2nd year it is required \n1st year you just need to code C and Python which doesnt put a lotta strain on your laptop\neven a potato laptop will work\nIn 2nd year if you get a decent laptop based on your budget, you would be set\n(dont buy 2 laptops 🤡)\nIf you can buy a laptop in your 1st year and wanna do something you’re interested in, then go for it\nif not and theres a budget strain, dont stress on getting in 1st year"
    },
    {
      "id": "lpmwgw0",
      "body": "im not in pes but im in a college which is autonomous under vtu and have seen mamy seniors bring their laptops to college"
    },
    {
      "id": "lpn0kg7",
      "body": "bro laptop is not needed if u just wanna get through classes and exams, but ppl do extra curricular stuff too, having a laptop makes it easier."
    },
    {
      "id": "lpo0fvl",
      "body": "Laptop is the only thing needed, you can skip everything else. And yes everyone carries laptop everyday to college, PS thats the only thing in my bag"
    },
    {
      "id": "lpujl46",
      "body": "If ur like ec can u manage without a laptop?"
    },
    {
      "id": "lq94t26",
      "body": "Bud, all through most of second and third year laptop and charger were the only things I took to college. Don't get what the complaining is about\n\nYou won't have much CSE stuff in your first year i can understand but it'll be useful for ya to do miniprojects with ur teammates in college, and I'm guessing you have matlab too in first year."
    }
  ]
}