{
  "id": "1ftn7cj",
  "title": "I took admission in the 2nd round and the classes started from yesterday..",
  "content": "Yo, the college vibes are totally off, man. It feels like I'm back in high school or something. I'm not getting that college experience I was hoping for. What should I do?",
  "metadata": {
    "root_comment_id": "lpszaud",
    "post_id": "1ftn7cj",
    "author": "24Lakes",
    "url": "https://www.reddit.com/r/PESU/comments/1ftn7cj/i_took_admission_in_the_2nd_round_and_the_classes/",
    "permalink": "https://reddit.com/r/PESU/comments/1ftn7cj/i_took_admission_in_the_2nd_round_and_the_classes/",
    "score": 20,
    "upvote_ratio": 0.7400000095367432,
    "created_utc": 1727786788,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "lpszaud",
      "body": "Welcome to the 3 years of disciplinary life :)\n\nThe 4th year will be chill from the college side, if u chose btech\n├── I'm from btech only ,currently in rr cs\n├── Ohooo discipline anol\n│   └── 🥲\n│       └── Sir you big people now\nIgnoring on campus 😔\n├── Tell everyone you from 1st sem niga\n└── Tell everyone you are from first sem"
    },
    {
      "id": "lpszcfk",
      "body": "You'll get used to it don't worry"
    },
    {
      "id": "lpszdhh",
      "body": "tf does college experience even mean? I joined yesterday too, ofc the first few days are gonna take some getting used to\n\nthat's the case with any place you go to"
    },
    {
      "id": "lpszydi",
      "body": "change your expectations"
    },
    {
      "id": "lpt0gr2",
      "body": "bro thinks college in movies = college in real life\n└── 😂"
    },
    {
      "id": "lpt0v45",
      "body": "To me it's because of our electrical faculty, she acts like a school teacher. Today she took away a guy's phone while he has checking his attendance.\n├── P11?\n│   └── Yes\n│       └── Same\n├── P11?\n│   └── Yes my guy\n│       └── But she teaches good isiliye chup hoon..\n└── eyy P11\n    └── didn't expect jalgara to be in p 11\n        └── haha meetup when\n            └── I'm socially anxious😭\n                └── aww thurday I'll find u\n                    └── Don't tell me you are one of the guys sitting in the last bench\n                        └── tf how do uk\n                            └── I sit infront of you\n                                └── name starts from S?\n                                    ├── roll no. 1\n                                    │   └── not like I remember everybody's roll number😭\n                                    │       └── I'm the one with long hair\n                                    │           └── Dude u r sathwik?\n                                    │               └── No..\n                                    └── Dude are you the guy sitting on the last bench in the first row?\n                                        └── first row last bench was empty yesterday wdym😭\ni was in 2nd row\n                                            └── Oh that rv pu clg guy you are ?\n                                                └── nah\n                                                    └── Oh leave leave anyways will find you tomo\n                                                        └── ah let's see😈"
    },
    {
      "id": "lpt4f41",
      "body": "Bruh what exactly do u mean by college experience ? No college is like how Bollywood portrays it to be lmao especially not on the first day. Idk what your expectations were but I'm having a good time here so far. They might be slightly more strict than other colleges but even the so called lenient ones won't fit into your idea of what college is supposed to be.\n└── Hmmmm yes indeed I completely and totally agree with your statement. I met this crazy guy here who bet me that I couldn't find his reddit acc, ah sucks to be him.\n    └── Damn he mustve given u a ton of clues cuz otherwise ud have probably taken a few decades to find it if at all you even did"
    },
    {
      "id": "lpt51it",
      "body": "Lmao kids thinking that PESU (or any college in the country) is going to give them a college life that's portrayed in movies"
    },
    {
      "id": "lpt6xr3",
      "body": "cope? idk"
    },
    {
      "id": "lpt807e",
      "body": "AFAIK only bits and manipal give THAT college experience which you see in movies. "
    },
    {
      "id": "lpt8rjb",
      "body": "Same feeling here😔 btw which section are u in?"
    },
    {
      "id": "lptefxd",
      "body": "welcome to PES\n└── Joining pes? Waiting for third round or what\n    └── no\n        └── then how can you join now\n            ├── They didn't update their flair\n            └── i simply can"
    },
    {
      "id": "lpu61s8",
      "body": "Welcome machaaa"
    },
    {
      "id": "lpucoy6",
      "body": "Bruh who asked u to join, simply complaining for karma "
    },
    {
      "id": "lpuksch",
      "body": "Well welcome to PESU"
    },
    {
      "id": "lpuxy52",
      "body": "Fuck all college, in for a roller coaster ride"
    },
    {
      "id": "lpx9le3",
      "body": "Yo, what section are you in?\nI'm in O, I can totally relate to you 😭😭😭😭😭😭"
    }
  ]
}