{
  "id": "1ftn0kn",
  "title": "REGARDING PESU AND PG'S NEARBY",
  "content": "Iam from KCET and I might get PESU CSE in the second extended round. Iam confused between MSRIT CSE and PESU CSE, as in which one to place above the other in my option entry. Which one's better? Most people will say PESU is better because of better infrastructure, modern curriculum, and good placements. Also, what about pg's and Hostels?  \nI can't be a day scholar because of distance. I will most probably miss the orientation. Is that going to be a problem? Admission can be done on or after 9th oct so Is it bad that iam joining so late? Am I gonna face any problems like getting lost in the huge campus, or maybe not knowing whom to talk to in order to make friends and such things? ",
  "metadata": {
    "root_comment_id": "lpszju0",
    "post_id": "1ftn0kn",
    "author": "Nearby_Bee_8891",
    "url": "https://www.reddit.com/r/PESU/comments/1ftn0kn/regarding_pesu_and_pgs_nearby/",
    "permalink": "https://reddit.com/r/PESU/comments/1ftn0kn/regarding_pesu_and_pgs_nearby/",
    "score": 2,
    "upvote_ratio": 0.75,
    "created_utc": 1727786214,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "lpszju0",
      "body": ">getting lost in the huge campus  \nrr aint even that big to get lost lol\n└── Thank you for those suggestions. Deep inside,  I think I prefer PES more than RIT. Also, how \"modern\" do you think the curriculum actually is, when compared to colleges like RVCE and MSRIT?\n    └── i am from your batch only i know its much updated from vtu but dk till what extent"
    },
    {
      "id": "lpt9las",
      "body": "I will tell you that there are no hostel left and you have to find a pg for now\n└── For the first year can I take a pg and from the next year can I try for the college hostel? If the hostels are full now does it mean they are permanently filled? Or can i have a chance of getting it after the first year is over?"
    },
    {
      "id": "lpu59db",
      "body": "Opt for PESU, the curriculum and vibe is more tech related and you get better exposure. Talking about Pg’s food is gonna be shit, if you are willing to adjust then i’d say go on and pick a pg, if not college hostel would be the best pick:)"
    }
  ]
}