{
  "id": "1fuacdj",
  "title": "9.5 cg",
  "content": "There is nothing in this world, I'm already fed up, no friends nothing(except my roomies and 1-2 outside with which I chill most of time), rn sem1 cse student in ecc, just want some guidance, how can I achieve 9.5cgpa at the end of 1st year so that I can get RR CSE in 2nd year\n\nLittle bit of BG got 93%ile, almost qualified advance to get a rank, everything in my life is almost take bits and iiit hyd. And all, already made peace with my life regarding this.",
  "metadata": {
    "root_comment_id": "lpxzreo",
    "post_id": "1fuacdj",
    "author": "Dull_Grade5086",
    "url": "https://www.reddit.com/r/PESU/comments/1fuacdj/95_cg/",
    "permalink": "https://reddit.com/r/PESU/comments/1fuacdj/95_cg/",
    "score": 18,
    "upvote_ratio": 0.8299999833106995,
    "created_utc": 1727853046,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "lpxzreo",
      "body": "Hey dude ig the grass is always greener on the other side..\n\nIm a fresher at rr campus and there's literally nothing special about this place..\n\n1) The canteen is quite crowded, and u only have 30 minutes for lunch. It takes 15 minutes to walk to the canteen and back to my classroom, so u only have 15 minutes to eat. In 15 mins you can only have idli sambar lmao\n\n2)Our classes are in the F block, and it feels like we're in a prison or something and its so old..\n\n3) People say the campus has great infrastructure, but what can I even do with it when the crowd is so huge? You won't even find a single peaceful place to sit and talk with your friends. \n\n4) When it comes to friends and such, everyone is busy with their own lives and no one seems interested in making new friends, lol.\n\nSo just get 9.5 cgpa and stay there itself, nothing is special about this place tbh\n├── Still, mann.......😓\n└── So real"
    },
    {
      "id": "lpy2x6e",
      "body": "Would be helpful if some seniors connect with me who can guide me for 9+ cgpa \nWill remain always grateful to them 🙏🙏\n├── Just cover the slides and textbook well and maximise marks in assignments and project. 9+ is simply crossing 80/100 in every course's overall. If you get a full score in assignments, quizzes, project, etc, it gives you a lot of room to screw up in ISA and ESA and still get an A, which translates to a 9 point. Do this for every course and you have a 9+ GPA.\n\nThe FAQs cover this in more detail\n│   └── Ayy! Rowlet Anna the saviour \nStill i would like to connect with a senior with this experience 😅\n└── Slides are enough for most of the content. However, you need to practice questions, which is very very important for understanding. Questions from the recommended textbook is more than enough. Also read parts you don't understand from the textbook.\n\nSource - currently have a 9.8 cgpa\n\nAlso, EC campus people are really really cool. Some of the smartest people I know are from there. Hackerspace is from ECC, join and connect with them."
    },
    {
      "id": "lpyay1t",
      "body": "Hey man, chill out. All of us were like you in sem 1 too. Our grades were shit and we were pretty depressed too, but CGPA isn't everything. It's not even that important. Ik friends who were in ece with 5.4 cgpa and who have jobs with 11-15 lpa. You're still in sem 1 and its just 1/8th of the way there. There isn't that much of a difference between RR CS AND EC CS. CS is the best you can get in PES and that's where you are rn. Don't stress about CGPA man, as long as you have 7-8 you'll be fine with regards to placements. As for friends, just be a bit more social and you'll make many more friends. Your classes will change in sem 3 and you'll make way more friends then too. Just try to enjoy college life, you're still in sem 1"
    },
    {
      "id": "lpyv3mr",
      "body": "Regarding making friends \nHaving a few close people is good enough. \nTrust me after you graduate and life gets going, not many friends are in touch that often"
    },
    {
      "id": "lq302ql",
      "body": "for like two/three weeks before the exam week (do three for first isa, then 2 or 3 based on isa1 marks), just sit down for a couple hours a day and study as much as you can. this i do just to get an idea of what's actually in the portion, not really to finish everything. try to finish atleast one unit of one subject a day. \n\nand the week before exam should be for proper studying, here probably again 2-3 hours of effective study should be enough. it will be easy cause you have a general idea, but you still have some stuff to learn. \n\nand finally on the exam week, you need to do similar amounts and it will be pretty easy.\n\nalso, for mug up subjects like mechanical, chemistry etc, there's minimal \"concepts\" and mostly just mug up. so studying early for them is pointless. i would forget it anyways, so i just go through the fundemental concepts, numericals first and do the actual theory parts the day before the exam. \n\nit works well for me, maybe for you too\n└── Thank you so much will consider all this 😭"
    },
    {
      "id": "lqcn2z6",
      "body": "i have heard many seniors want to come back to CSE in ECC who took AIML in RR in 2nd year"
    }
  ]
}