{
  "id": "1fv6l75",
  "title": "Why can't every prof be like Dr BM Shankar",
  "content": "That guy is cool asf. He teaches math for us damnn man hands down for this guy... Profs should be like him in clg lmao😭 such a nice guy he is..",
  "metadata": {
    "root_comment_id": "lq4lb15",
    "post_id": "1fv6l75",
    "author": "No-Spell22",
    "url": "https://www.reddit.com/r/PESU/comments/1fv6l75/why_cant_every_prof_be_like_dr_bm_shankar/",
    "permalink": "https://reddit.com/r/PESU/comments/1fv6l75/why_cant_every_prof_be_like_dr_bm_shankar/",
    "score": 46,
    "upvote_ratio": 0.8899999856948853,
    "created_utc": 1727958747,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "lq4lb15",
      "body": "P11?\n└── Yup"
    },
    {
      "id": "lq4qagt",
      "body": "He is still out there teaching ? Damn \nWas such a cool professor and we had so much fun in his class\n└── Same man, we had fun after a long time!!"
    },
    {
      "id": "lq4rq59",
      "body": "Sadge i am not in the class\n└── Our electrical ma'am thinks that we are in school, man, so we have some good ones ( only one to be precise ) and the rest are actually mehh\n    └── Our math teacher calls people to  board to solve questions and makes people to sit in first bench. Feels same as school"
    },
    {
      "id": "lq4tjcy",
      "body": "We have a teacher named shivasankar he is equally chill\n└── Batch of '20 alumnus here. SS is very cool. We had his for two semesters, loved the guy"
    },
    {
      "id": "lq4uykd",
      "body": "BMS is the best teacher I have ever had in my life, he used to teach for like 20-30 mins and mess around the rest of the time, and still managed to make us totally ready for the ESAs"
    },
    {
      "id": "lq4vuvd",
      "body": "Wow in 2024 even professors have pr\n\n  \n/s\n└── We got profs getting pr before gta 6 /s"
    },
    {
      "id": "lq4xu4m",
      "body": "BMS sir has the best stories and nicknames"
    },
    {
      "id": "lq5lui9",
      "body": "I found him to be disrespectful towards women :/\n└── can you elaborate?"
    },
    {
      "id": "lq6eh7w",
      "body": "Probably one of my most fond memories @ PESU would be attending his classes. He strikes a perfect balance between creating a fun atmosphere and teaching. To my surprise, many of the first benchers (nerds) never liked him because he would waste time instead of covering the syllabus. But it always happened that he would still finish the syllabus on time. It’s very easy to get carried away in his classes and feel math is very easy, because he makes it look simple. I have his handwritten M4 notes preserved and still use it occasionally xD, it was that simple to understand \n\nIf you guys are passionate about Fluid mechanics or physics of fluids, he’s probably one among the top researchers in this area in India…not many get a chance to publish in Journal of Fluid Mechanics multiple times in a year, but he’s done that. Extremely fun and chilled prof inside and outside the classroom."
    },
    {
      "id": "lq747fp",
      "body": "sivasankar too!"
    },
    {
      "id": "lq8f0ox",
      "body": "Manikandan"
    },
    {
      "id": "lq94be5",
      "body": "his class was the only one in which i maintained 100% attendance. never had 100% in school too\nyou will love attending his class\nhe might not do anything for half the class but he will still be done with portions half a month before isa/esa"
    }
  ]
}