{
  "id": "1fvdmvx",
  "title": "Sem 3 ECE",
  "content": "hey guys. so isa didnt do as expected....i might have messed it up. so, dear seniors, can u pls tell me how to cover that up and perform good in isa2 and esa. i have to score really good this time to maintain good cgpa. hence, pls suggest how to study and resources to be used. are slides enough or i have to go through textbook also. honestly my math teacher is very bad, so any yt channel you'd recommend? TIA.",
  "metadata": {
    "root_comment_id": "lq9z0a9",
    "post_id": "1fvdmvx",
    "author": "Subject-Whereas-3221",
    "url": "https://www.reddit.com/r/PESU/comments/1fvdmvx/sem_3_ece/",
    "permalink": "https://reddit.com/r/PESU/comments/1fvdmvx/sem_3_ece/",
    "score": 13,
    "upvote_ratio": 1,
    "created_utc": 1727977656,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "lq9z0a9",
      "body": "Slides are definitely not enough. Especially not for subjects like NAS and ACD. These ones you need to pay attention in class or learn from youtube because it's not something u can memorise or study on your own. Pesu notes can help if you look at the derivations and the numericals. I've never studied the textbook and I don't know anyone else who has so can't comment on that.\n\nThere is this youtube playlist of ACD by this guy called Razavi. He's the author of your textbooks. Watch those. It's like 20-30 hrs per unit but I guarantee it's worth it. You'll understand everything properly and you'll be set for ACD.\n\nNAS also you need to watch YT videos and solve a loooooottt of numericals. It's easy to get 20/20 in unit 5 in the paper because the same questions come every time. Be perfect with the cauer and foster forms and some of the other easy theory questions. Unit 1 is also pretty simple but you need a lot of practice. U2 has a lot of overlap with maths so you'll find very good youtube videos. Search up a topic on youtube, see the videos on the same topic on multiple channels and whoever makes you understand better, you stick to that channel for the whole subject. Practice a lot of numericals in NAS, that's all there is to the subject\n\nFor math, there's this guy called Gajendra Purohit on youtube. Bro is the only reason I passed math from sem 1-4. His videos are amazing and you can finish one unit in like 2-3 hrs while understanding everything. After that practice the questions given in the slides, usually those are the ones that come in the ESA and ISAs. If you have time left over, go for the questions in the notes\n\nIn signals and sysems, Unit 1, 2 and 5 are the easiest ones. Focus on those first. Unit 1 has almost nothing new, it's all basic signal stuff that you porbably know already like addition of signals, multiplication of signals, odd and even signals and stuff. There are a few more properties but they're pretty easy once u solve some numericals. You should be able to easily get 18-20 in this unit. Unit 2 is all about LTI systems if I remember correctly. Just read the theory from the slides and look at the numericals on yt. Unit 3 and4 are fourier transform so there's a lot of overlap with math, so just search the topic names on youtube and you'll find plenty of vids explaining the topics with solved numericals. solve as man numericals as possible, these are the hardest units. Unit 5 is again pretty chill. Not as easy as Unit 1 but its still pretty easy. There's a youtube playlist on Z transform on a channel, I don't remember which, but if you do that, you should be set for u5.\n\nCan't say much about CADD, most of us struggled in it. Just spend a lot of time and memorise a lot of the important diagrams and working like the 8 bit MUX and shit. unit 1 and 5 are pretty doable if I remember correctly\n\nAt the end of the day, ECE is a pretty hard subject to study on your own but watching some av videos and yt videos definitely helps. Practice a lot if you're not getting something and after some time, it'll click too. Don't hesitate to go to other teachers for doubts if you need help. Hope this helps! All the best :)\n└── omgg, thank you so much for such a detailed answer. very grateful <3\n    └── No worries, ik how hard sem 3 is. It's easily the hardest sem by far for ECE and if you can handle it, every other semester will be easy and after sem 5 as long as you choose the correct electives, it'll be really chill and easy and u can score more than 8 without even trying very hard"
    },
    {
      "id": "lqb2ji6",
      "body": "I used to listen to the class lectures of the head for that subject and make notes . I’m a 2022 pass out . Idk that did the job for me personally. Almost nothing came out of the  head’s lectures. . Literally took me from D grades to high A or S\n├── Agreed lol\n└── Where do you get lecs of head of the sub?? Av summary??\n    └── Find out who the head for each subject is first. Check which section he teaches in. Then look at those lectures\n        └── alright, thanks"
    },
    {
      "id": "lqf2jfw",
      "body": "I can relate. Sem 3 was my worst semester in college. Listening to classes and writing notes is what helped me a lot. They often tell a lot of concepts which may not be there in slides and even if it's there you can't understand what it means just from reading slides. If you're struggling i really think talking to profs will help. Tell them what your problem areas are and they usually give good advice. Good luck :)"
    },
    {
      "id": "lqhate9",
      "body": "Learn ACD and CADD from textbook.\nLearn NAS and Signals and Systems from Neso Academy "
    }
  ]
}