{
  "id": "1g25rx3",
  "title": "Scholarships",
  "content": "I'm sorry for asking this question again since it's been asked so many times in this subreddit but I've gone through all of the posts and I haven't gotten a definitive answer yet. \nSo here are my questions:\n\n1. Are both mrd(50%) and cnr(40%) only applied to tuition fees or the entirety of my fee paid. I'm in AIML and I paid 4.8L out of which 4.21L is tuition fee and remaining are other fees.\n\n2. They said smtg about paying 10k to register for the scholarships. Is that only for kcet students or for pessat too? (cuz sm PPL say it's not needed for pessat students)\n\n3. How is the scholarship processed. Does the money fall into the bank through which we paid the fees or is it smtg else?\n\n4. What were the previous year cutoffs for both scholarships and what should my realistic aim be to achieve them this year?",
  "metadata": {
    "root_comment_id": "lrll7ye",
    "post_id": "1g25rx3",
    "author": "PlusBad4113",
    "url": "https://www.reddit.com/r/PESU/comments/1g25rx3/scholarships/",
    "permalink": "https://reddit.com/r/PESU/comments/1g25rx3/scholarships/",
    "score": 12,
    "upvote_ratio": 0.8899999856948853,
    "created_utc": 1728755709,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "lrll7ye",
      "body": "1) it's applicable to whole fees except the 10k\n3) you need to make a separate union Bank account on your name , the money will come to that \n4 ) and for the cutoffs I commented on one of the posts , u can check that"
    },
    {
      "id": "lrlnmev",
      "body": "1. It applies to your whole fees."
    },
    {
      "id": "lrlobil",
      "body": "1.) It used to be only tuition fees until last year when they changed it to the whole fees.\n\n2.) Paying 10k for scholarship is only for kcet students\n\n3.) They will give a Google form asking for your union Bank account details. Just fill that up and relax\n\n4.) Can't give any direct answer for this. When I was in first year, cutoff for 50% scholarship was 9.2."
    },
    {
      "id": "lrod40z",
      "body": "1.Also are the scholarships given semester wise or year wise?\n\n2.are the scholarships given on basis of highest of class or branch or entire college?\n└── 1) 50 % one is given based on cgpa while 40% on sgpa\n2)in 1st year it's highest of the cycle (physics/chem , from 2nd year it's branch wise\n    └── Thanks!\n        └── >Thanks!\n\nYou're welcome!\n            └── You stole my thanks 😡"
    }
  ]
}