{
  "id": "1g54j5c",
  "title": "Friends?-",
  "content": "rr fresher here, kinda *friendless* at the moment xd. So help guys😭",
  "metadata": {
    "root_comment_id": "ls89uo3",
    "post_id": "1g54j5c",
    "author": "Fair_Combination_548",
    "url": "https://www.reddit.com/r/PESU/comments/1g54j5c/friends/",
    "permalink": "https://reddit.com/r/PESU/comments/1g54j5c/friends/",
    "score": 19,
    "upvote_ratio": 0.8899999856948853,
    "created_utc": 1729098557,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "ls89uo3",
      "body": "Don't you all have a whatsapp group and discord server too? Put yourself out there a bit more, you'll find people you can vibe with. Regardless, most friendships are formed through common events like clubs and other activities, so if you take part in different things you'll automatically make friends with similar interests. \n\nOr as they say, wait for an extrovert to adopt you.\n├── I shall wait😭\n│   └── It's not that difficult to find people lol. You're going to have to come out of that shell sooner or later. Once you put yourself out there a little bit, it becomes increasingly easier.\n├── This.\nCan't express how true this is.\nWhatsApp and Discord are for building your network beyond your interests.\nEvents are for finding like minded people.\n\n\nDiscord is always there to help anyone, anyone who's willing to meet new people.\n│   └── I'll check that out thanks\n└── It's all fun and games until someone doxxs you in the same whatsapp group\n    └── True, but give it a while and sooner or later all your friends and even strangers around you will know your identity on discord.\n        └── Bro's talking from experience. (I know who you are, but I'll keep it to myself :))"
    },
    {
      "id": "ls8ahgj",
      "body": "Section ??"
    },
    {
      "id": "ls8aq6x",
      "body": "Section ??"
    },
    {
      "id": "ls8cqj1",
      "body": "Are you a boy or a girl"
    },
    {
      "id": "ls8cvyg",
      "body": "Are you a boy or a girl\n└── girl:D"
    },
    {
      "id": "lsawft2",
      "body": "Hahaha same"
    },
    {
      "id": "lsaz9h8",
      "body": "Bro lol.  You not in WhatsApp? Or discord?"
    },
    {
      "id": "lsb9vse",
      "body": "Kinda i feel the same n I'm in my 3rd yr😭😭\n└── 😭😭pains\n    └── My college life is almost kinda cmplt"
    },
    {
      "id": "lsd67gd",
      "body": "we could be friends. dm."
    },
    {
      "id": "lshd3y3",
      "body": "Just approach people it's not that hard. What's the worst that could happen\n└── Drugs"
    },
    {
      "id": "lsjxkad",
      "body": "Just either talk to your chlaassmates or join clubs and things and find those who share simmilaar interests."
    }
  ]
}