{
  "id": "1ge25vh",
  "title": "Haridas nayak mechanical faculty EC CAMPUS",
  "content": "This guy is the worst educator to have walked on this planet all he does his tell some stupid unfunny story waste time and grab his belt/buckle/penis whatever it is scratch it and smell it like there was over 50 students in the class dawg have some shame he does not know shit about mechanical reads off of slides and answers doubts with \" you should know that\" his excuse is that hes a mechanics teacher and not a mechanical teacher he doesnt like mechanical if u dont like it then dont teach us wth is this ",
  "metadata": {
    "root_comment_id": "lu6bitw",
    "post_id": "1ge25vh",
    "author": "SecondFade",
    "url": "https://www.reddit.com/r/PESU/comments/1ge25vh/haridas_nayak_mechanical_faculty_ec_campus/",
    "permalink": "https://reddit.com/r/PESU/comments/1ge25vh/haridas_nayak_mechanical_faculty_ec_campus/",
    "score": 47,
    "upvote_ratio": 0.8399999737739563,
    "created_utc": 1730122434,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "lu6bitw",
      "body": "Just be glad you don't have S*tish"
    },
    {
      "id": "lu6bv14",
      "body": "Looks like my guy hasn't met Sa\\*\\*sh\n└── What does S****h teach and why is he so bad\n    └── He's so delulu that it's not even funny. Absolute retard"
    },
    {
      "id": "lu6e0i8",
      "body": "imagine shitting on one of the few teachers that will literally make your sem more bearable, maybe even memorable\n├── average 1st benched ass kisser\n│   └── you clearly haven't gotten round to meeting the other faculty\n│       └── So glad I have vinay p\n└── the opposite\n    └── Haridas seems fine if you look at the other specimens this college employs. Wait for your higher semesters."
    },
    {
      "id": "lu6mu7l",
      "body": ">his excuse is that hes a mechanics teacher and not a mechanical teacher he doesnt like mechanical if u dont like it then dont teach us wth is this\n\nUnfortunately, this is very common here. What do you think happened to all the professors from branches that were cut down in the number of seats or completely axed? They are still here teaching courses they aren't qualified to teach and that's why they are dissatisfied with their job. You will many such profs in CS taking up AIML courses without prior experience in it.\n\nOfc, this is just a side note and has nothing to take away from his misconduct during classes.\n└── Nahh Seems Like This Dude Is Going Through An Identity Crisis Of Some Sort . He used to boast that he did BE in mech from NIE MYSORE and that was the best in the state back then atleast 2-3 times a week throughout the sem. Went through his staff profile as well he published multiple papers on topics related to mech, pursued Mtech and a PHD in mech."
    },
    {
      "id": "lu6nl8r",
      "body": "Welcome to PES EC campus\n└── Uninterested, Unqualified Profs aint common to just EC lol"
    },
    {
      "id": "lu6o5b9",
      "body": "wait for a year my guy"
    },
    {
      "id": "luaoxrc",
      "body": "Wait for Sathish"
    }
  ]
}