{
  "id": "1gga3vc",
  "title": "Rohith Vaidya is the worst assistant professor I have ever seen existing on this earth",
  "content": "To Rohith Vaidya, why are you even alive brother?\n\nThe other day when we all were sitting in the SE class inside classroom number 500, he gave break in a 3 hr class, which was actually good tbh, and a girl made a paper plane and was playing with it and the students in her bench were laughing whenever she tried to fly it. The plane accidentally flew and fell in the same row, but next column..... here the thing comes, our assistant professor comes near the plane and says (I don't know the exact words, so putting double quotes will put me in trouble) I will throw that group from here as you threw this plane here. We all were in floor 5 and brother how can he even tell that provided all the incidents happened, and is gonna happen (hopefully not) in both the campuses? \n\nAnd I saw him confiscating a guy's mobile phone in the same class and heard that he blamed the guy who was sitting next to that phone guy being the reason for confiscation. Brother this isn't appropriate behaviour brother. Change yourself or resign. We need better people in society...",
  "metadata": {
    "root_comment_id": "luo3oud",
    "post_id": "1gga3vc",
    "author": "Proud-Air-4625",
    "url": "https://www.reddit.com/r/PESU/comments/1gga3vc/rohith_vaidya_is_the_worst_assistant_professor_i/",
    "permalink": "https://reddit.com/r/PESU/comments/1gga3vc/rohith_vaidya_is_the_worst_assistant_professor_i/",
    "score": 0,
    "upvote_ratio": 0.3499999940395355,
    "created_utc": 1730365349,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "luo3oud",
      "body": "Looking at the rage in the first few lines i expected it to be a lot worse than what followed lol.\n└── I removed that line so that you won't feel a lot worse was there. It's there maybe but I know only this much...."
    },
    {
      "id": "luo3q9k",
      "body": ">To Rohith Vaidya, why are you even alive brother?\n\nYou should also change the way you speak.\n└── Fine I'll remove that line for you, not anything else..."
    },
    {
      "id": "luo8fu8",
      "body": "Brother don't speak like a faggot brother. \n\nHe's by far the coolest person I have ever met who rarely rages on students. If he has confiscated someone's phone it's that person's problem for using it in class. \n\nDo some research before you post next time.\n├── I don't know what happened there, but idts accusing the guy next to that phone's guy being guilty is the proper thing to do.... Accuse that phone's guy for doing that..... Why that innocent person sitting next?\n\n\nAnd yeah I posted this cuz I saw this happening in front of my eyes....\n└── He maybe was coolest person of your times brother, not ours.... people change.... I know, but it shouldn't be like blaming students for what they didn't do......\n    └── Well I won't defend him either. But what you said about him also didn't make sense either.\n        └── Telling a group that he'll throw them from the 5th floor didn't make sense to you? Damnnnnn i didn't know that pes graduates are so dumb.....\n            └── You're the real dummy, who can't even take a simple joke. Bloody woke kid.\n                └── There's a way to joke brother. He might've meant it as a joke. But imagine there's someone in the group who got offended by the words he said and does something to himself/herself or others. Will he be responsible for that? No, he'll just slip away... same as what management people are doing in every incident occurs\n                    └── skill issue then bro"
    },
    {
      "id": "lurh8dp",
      "body": "lol, i made the paper planes in that class. Fun day ngl."
    },
    {
      "id": "lurj655",
      "body": "Imagine being in a competition of being sensitive and your opponent is u/Proud-Air-4625 ....\n\n🤡\n└── He's such a snowflake."
    },
    {
      "id": "lut33b7",
      "body": "womp womp cry about it"
    }
  ]
}