{
  "id": "1gho9k7",
  "title": "Is Maya the only fest happening in pesec...",
  "content": "Are there any other cultural fests or programme that's gonna happen and why are they making us pay for the tickets of Maya even though we are from this college....",
  "metadata": {
    "root_comment_id": "luyzfsw",
    "post_id": "1gho9k7",
    "author": "Detective_7",
    "url": "https://www.reddit.com/r/PESU/comments/1gho9k7/is_maya_the_only_fest_happening_in_pesec/",
    "permalink": "https://reddit.com/r/PESU/comments/1gho9k7/is_maya_the_only_fest_happening_in_pesec/",
    "score": 21,
    "upvote_ratio": 0.8700000047683716,
    "created_utc": 1730520178,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "luyzfsw",
      "body": "Name one clg fest of any clg in india which doesn't make students pay ☠️ , again after this RR campus too would conduct their signature fest so be looking forward to that next sem.\n└── There are quite a lot of colleges I know which grant access to everybody, even outsiders. As a matter of fact, all the colleges in my city do it that way. It was a shock for me too when I got to know we've got to pay for college fests when I first came to Bengaluru.\n    └── We'll most colleges in teir 1 cities like banglore don't give free for all kind of entry for fests , this might be true for smaller cities and collages but atleast for most it's this way only.\n        └── Well, I've been to college fests which have invited A-lister singers and performers like Armaan Mallik, Ananya Bhatt and even some sunburn DJs with open to all kind of entry. Just seems kind of \"meh\" to pay for tickets for budding artists is all. Atleast the college should take up the cost on this one. \n\nShaan? Yeah, that I could somewhat pay?\nBut tbh, Maaya? I really think the college could've picked up the tab on this one.\n            └── Kinda agree with this , cause ( ntg against female dj's) she looks mid af , sane with the band too .\n                └── Tff the band is amazing, go watch their vids on yt"
    },
    {
      "id": "luzw4j0",
      "body": "It's the only one that happens in ec campus. \nIt's seems kinda dismal though. They have invited a relatively less popular dj and a band which only plays rock/metal music specifically linkin park. It doesn't really have a whole lot of hype either."
    },
    {
      "id": "lv6ru75",
      "body": "My take,\nSkip Maaya concert, go to Vasuki vaibhav concert in RR the next day. It'll be worth every penny."
    }
  ]
}