{
  "id": "1gj9qoe",
  "title": "pointless rant",
  "content": "i know this is probably the wrong place but i just need to get some shit off my  chest\n\neverything just keeps getting shittier, I feel like an idiot as an average student. Now with all the talks of placements, internships and all im more stressed than ever. All my friends have boyfriends they roam with meanwhile the one guy I liked doesn’t even bother with me. My friends don’t hang out with me if I make plans. I don’t have any talents, no exceptional qualities. Just winging everything.\n\n that's it",
  "metadata": {
    "root_comment_id": "lvbloj2",
    "post_id": "1gj9qoe",
    "author": "throw_aw_ay_11",
    "url": "https://www.reddit.com/r/PESU/comments/1gj9qoe/pointless_rant/",
    "permalink": "https://reddit.com/r/PESU/comments/1gj9qoe/pointless_rant/",
    "score": 84,
    "upvote_ratio": 0.9399999976158142,
    "created_utc": 1730709566,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "lvbloj2",
      "body": "Relatable hogaya 🌚😭"
    },
    {
      "id": "lvbmphz",
      "body": "You should stop comparing yourself to others and focus on improving yourself. Everything will fall into place after that"
    },
    {
      "id": "lvbn9gv",
      "body": "dw everything will fall in place and things will go the way you want them to, just keep it pushing and you will be alright."
    },
    {
      "id": "lvbpr52",
      "body": "Us sister"
    },
    {
      "id": "lvbuqn6",
      "body": "I felt the same way a few years ago. However, everything you see today is temporary. Your friends might find new partners or stay together—it's hard to say. \nLife will change, and new things will come your way. I recommend trying to learn something new. It could be a great project in your field or something completely different, like sketching or reading a book. \nEventually, you'll find friends who are just like you. You may not understand this now, but trust me, this is a form of freedom. My friend and I used to explore a new restaurant every weekend or drive to random places without a destination."
    },
    {
      "id": "lvbxj2p",
      "body": "comparison is the thief of joy aunty\nonly person you should compare yourself to is the person you were the day before and if you've remotely made some progress you're doing it right\n\nand dw about the relationships I've seen most of them crumble by the end of the college lmao\n└── \"Aunty\" lol\n    └── Blr slang rubbing off dude 🤷"
    },
    {
      "id": "lvbxqji",
      "body": "If you benchmark your standards based on what others have, then you won't find growth in your life. Do things that make you happy. You'll eventually get where you wanted to be in life. Be patient."
    },
    {
      "id": "lvc0q7h",
      "body": "Seems god copy pasted peoples life script. i have seen similar rants with similar problem on other subreddits"
    },
    {
      "id": "lvce57a",
      "body": "As a fellow person with 0 talent in coding but still doing CS , just keep working hard , that's literally the only solution to success for people like us . I come from a poor household so I understand the pain of poverty so I always try to give my best efforts , As for the friends part try to hang out with more people I guess , not having a boyfriend is not the end of the world , who knows there might be someone out there who really likes you but is afraid of coming out . So don't worry OP ."
    },
    {
      "id": "lvco91j",
      "body": "The indomitable power of the human will shall always exceed every moment of suffering"
    },
    {
      "id": "lvcr0hw",
      "body": "I don’t know if any unsolicited advice would help, but it’s worth a shot.\n\nJust don’t live your life by the blue print someone else created or in general trying to fit into your peer group. Whatever is happening to you is just a phase and this too shall pass. I’ve observed atleast 80% of the couples pretending to be happy but are rotting internally (with insecurities) so consider yourself lucky. If loneliness scares you, then seeking companion ship often backfires and you might end up in something you never really wanted (the grass is always greener on the other side) Just focus on what makes you happy and things will automatically fall into place. \n\nYou seem to be self aware to call yourself average, then I’m assuming you have the maturity to get your shit together and work towards what you want in life. If you don’t know what you want, atleast work in the direction that makes you happy. It maybe a technical or nontechnical. Seeking social validation is an invisible poison that will eventually kill you emotionally. \n\nGood luck ! Hope you achieve your ambitions"
    },
    {
      "id": "lvd418n",
      "body": "us moment"
    },
    {
      "id": "lvdp7vz",
      "body": "ye toh us moment hogaya"
    },
    {
      "id": "lveiq8t",
      "body": "Bro take control of your life.\nIt's yours to live .take the first step . Go talk to the guy about anything common , improve your self day by day ,and stop comparing yourself with others to feel sad,compare yourself to know where you are standing.its easier said than done but yeah hmu if you wanna talk"
    },
    {
      "id": "lvem6d5",
      "body": "lmk if u need a rope"
    }
  ]
}