{
  "id": "1gkbwpx",
  "title": "How to date in PES",
  "content": "Title",
  "metadata": {
    "root_comment_id": "lvjxblt",
    "post_id": "1gkbwpx",
    "author": "LastAssociation9694",
    "url": "https://www.reddit.com/r/PESU/comments/1gkbwpx/how_to_date_in_pes/",
    "permalink": "https://reddit.com/r/PESU/comments/1gkbwpx/how_to_date_in_pes/",
    "score": 2,
    "upvote_ratio": 0.5199999809265137,
    "created_utc": 1730827125,
    "flair": "Pride Of PESU",
    "nsfw": false
  },
  "comments": [
    {
      "id": "lvjxblt",
      "body": "phir wahi\n└── Sax sux\n    └── Ki batey"
    },
    {
      "id": "lvjyym5",
      "body": "CFR CFR CFR CFRCFR CFRCFR CFRCFR CFRCFR CFRCFR CFRCFR CFRCFR CFRCFR CFRCFR CFRCFR CFRCFR CFRCFR CFRCFR CFRCFR CFRCFR CFRCFR CFRCFR CFRCFR CFRCFR CFRCFR CFRCFR CFRCFR CFRCFR CFRCFR CFRCFR CFRCFR CFRCFR CFRCFR CFRCFR CFRCFR CFRCFR CFRCFR CFRCFR CFRCFR CFRCFR CFRCFR CFRCFR CFRCFR CFRCFR CFR\n└── Brother calm down , you still have time 🙏😭"
    },
    {
      "id": "lvk613w",
      "body": "these juniors lmao concentrate on ur isas kids"
    },
    {
      "id": "lvk647e",
      "body": "No rowlet answer in faq for this :(\n└── Rowlet knows the answer, he won't tell you guys tho\n    └── Rowlet is emotionally damaged from dating in PES\n        └── ![gif](giphy|ro08ZmQ1MeqZypzgDN)"
    },
    {
      "id": "lvk9hyq",
      "body": "Is it just me, or is the quality of this subreddit falling down? Like, there used to be genuine questions and advice a few years back.\n├── As more people join the subreddit, the quality of posts starts to dip.\n├── It is \nBut it aint exclusive to just this sub \nOverall reddit is downgrading \nAs its becoming more and more mainstream everyday\n│   └── was hoping reddit wouldnt turn into another shithole like Quora did, but it's too late now.\n└── It is, has become more of a confession page"
    },
    {
      "id": "lvkuydp",
      "body": "Man another cringe post and we're going to have to increase moderation on this sub. Recently it's been a shitshow of brainrot from freshmen. This sub used to have such high quality posts and discussions just a year ago.\n├── Reddit is becoming too mainstream\n├── Really yes, please get more strict on moderation, I suggest. This is not a shitpost place\n└── we need r/pesubrainrot or r/pesushitpost"
    },
    {
      "id": "lvl0hws",
      "body": "Step 1: Become a DSA professional trust"
    },
    {
      "id": "lvmjsmz",
      "body": "You can't it's impossible"
    },
    {
      "id": "lvnff5h",
      "body": "phir wahi sax sux ki baat"
    },
    {
      "id": "lvnobkk",
      "body": "Rookie mistake. You shouldn't be asking such things here."
    },
    {
      "id": "lvnsz4m",
      "body": "Don't eat where you shit."
    },
    {
      "id": "lvnw2oj",
      "body": "don't go to 10th floor BE block. Go to gjb"
    },
    {
      "id": "lvnxlg7",
      "body": "ideally dd/mm/yy but a less accepted version is mm/dd/yy"
    },
    {
      "id": "lvobdqy",
      "body": "these juniors lol. I have a feeling that as PES keeps increasing the fees, the quality of this sub gets decreasing. \n\nTo answer your question, score more gpa. there are many sapiosexuals in PES, once you start scoring 9+ cgpa and start getting MRD scholarship - girls are going to flock towards you. \n\nGo study now kid."
    }
  ]
}