{
  "id": "1gnyoms",
  "title": "Guys how did yall study for mech engi sciences...",
  "content": "Leave some tips for God's sake..\n\nUnit 1 was easy and manageable, got all the questions correct in assignment 1..\n\nBut but but\n\nUnit 2 has a shit ton of theory how can a normal human being remember that much. Can I get some tips plzzz...\n\nUr help would be appreciated thanks...",
  "metadata": {
    "root_comment_id": "lwelfjn",
    "post_id": "1gnyoms",
    "author": "RamanaGad",
    "url": "https://www.reddit.com/r/PESU/comments/1gnyoms/guys_how_did_yall_study_for_mech_engi_sciences/",
    "permalink": "https://reddit.com/r/PESU/comments/1gnyoms/guys_how_did_yall_study_for_mech_engi_sciences/",
    "score": 9,
    "upvote_ratio": 0.9100000262260437,
    "created_utc": 1731238230,
    "flair": "Study Help :table:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "lwelfjn",
      "body": "Cheatsheet with all key points. Write it in words you understand and include key words. Use the internet and gpt to understand stuff.\n\nDon't mean to brag, but with this tactic the subject was ez af, got top score in the batch."
    },
    {
      "id": "lwf00bb",
      "body": "I've posted this before but I'll do it again: \n\nYou'll come across multiple courses even in CS that are extremely theoretical and will require you to memorise vast amounts of content, and your performance in tests will depend directly on how much you can recollect from memory. As someone who was never great (but good enough) at memorising blindly, I always gave myself enough time for these courses. \n\nI'd follow the following: every single day, study and memorise X pages/slides and read through whatever you read yesterday. Since most of you use slides, you can plan it out as memorising 10 slides everyday and revising the previous day's 10 slides. Of course this meant having to study the course every day (or atleast 5/7 days a week), but it also meant you only need to study small chunks everyday and you're constantly revising what you've studied. \n\nStudying + revising 10+10=20 slides every day does not take too much time (about an hour of dedicated study) and makes it way more manageable, plus the constant revision means you don't need to break your head the week before ISAs trying to memorise theory. There's a lesser chance of you forgetting content and it's way less stressful towards the end. Putting in small bits of consistent effort throughout the semester will pay dividends at the end of the semester because you've already memorised everything and simply need to read through.\n\nIt's probably a bit late to try this for ISA 1, but try it for ISA 2. Of course depending on your ability (and time constraints) you can choose to change how much you're covering per day, but back when we had to depend on the textbook, I'd cover 3-4 pages per day. Most people whom I've recommended this to have gotten back to me and told me that it definitely did make the theory courses easier to score well in and they performed well too.\n└── Man thank you so much..will do this for isa 2.."
    }
  ]
}