{
  "id": "1gql82c",
  "title": "Genuinely curious how difficult is it for other batches.",
  "content": "So i am doing nursing in ec campus, But when we look into the life of other batches in the college, we feel like you guys are having “the college life” while we are still stuck in school. I saw people describing the college as jail when i feel like we are the real ones in jail. I mean you guys get everything that we want for ourselves, the college wala college where you can see all the seniors,juniors and batchmates but since we are in different floor it makes us feel like we are the only one in the campus..? , you get Wednesday as half day and you can do whatever you want, you only have 75% attendance requirement, you people are always there in the foodcourt and basket ball yaar??? Like howww?? You get Saturdays off while we will be working in the hospital. You get the proper maaya wala maaya, you get enough and more time to study, when we are barely making it through between works in hosp to assignments to requirements to classes to studies, you have hackathons while the only night out from college we might get will be night shifts, so how is that you guys are having it difficult (totally not saying Taudda kutta Tommy, Sadda kutta kutta) . But i really wanna know what makes it difficult for you over that side of the river. ",
  "metadata": {
    "root_comment_id": "lx0wk6p",
    "post_id": "1gql82c",
    "author": "mewhomine",
    "url": "https://www.reddit.com/r/PESU/comments/1gql82c/genuinely_curious_how_difficult_is_it_for_other/",
    "permalink": "https://reddit.com/r/PESU/comments/1gql82c/genuinely_curious_how_difficult_is_it_for_other/",
    "score": 26,
    "upvote_ratio": 0.9300000071525574,
    "created_utc": 1731526065,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "lx0wk6p",
      "body": "Medical degrees are more rigorous than other degrees in general.This isn't specific to PES.\n\nI wouldn't say Btech is as as bad as nursing, but it does get STRESSFUL at times (towards the end of the semester, especially). We now begin working on final year projects from 5th semester. And the management also kinda sucks, most of our teachers aren't anything great, so there's that."
    },
    {
      "id": "lx179dx",
      "body": "Try being in a course which isn't known by the fucking pro vice chancellor of the campus,, (Pharm D), having exams during fests every fucking year, n getting cancelled the only event which was specific to our course because we had to join in with the engeneering fests .. having to follow the exam pattern of engineering course.. because hey why give a fuck about other course as long as they are minting money\n└── We in the same situ"
    },
    {
      "id": "lx731h6",
      "body": "As a fresher in engineering, ngl pes has been chill af. Like u just have to finish shit on time and ur good. "
    },
    {
      "id": "ly4mtb5",
      "body": "Studying 24/7. Can't attend things unless we skip classes. Clubs we have to hunt. Each branch has its own challenges."
    },
    {
      "id": "lyxxezn",
      "body": "skill issue"
    }
  ]
}