{
  "id": "1gslzz7",
  "title": "Frustration with Technical Club Orientations at PES RR",
  "content": "Honestly, it feels like there are way too many clubs on the RR campus that claim to be active but barely do anything. Some clubs seem to think hosting one event in an entire year is enough to call themselves active.\n\nWhat’s even more frustrating is when that one event turns out to be nothing but a club orientation—basically just the core team hyping themselves up and talking about their club.\n\nThis seems to be a trend. For example, Hackerspace (RR campus) had an orientation last semester, and then... nothing. Nexus also made a big deal about themselves and ended up doing just an orientation.\n\nTo be clear, there’s nothing wrong with doing only one event per year if that event is genuinely engaging. For instance, Kodikon and Horcrux were genuinely enjoyable. The problem is when a club’s sole activity is self-promotion.",
  "metadata": {
    "root_comment_id": "lxf85lo",
    "post_id": "1gslzz7",
    "author": "Prestigious-Web-5812",
    "url": "https://www.reddit.com/r/PESU/comments/1gslzz7/frustration_with_technical_club_orientations_at/",
    "permalink": "https://reddit.com/r/PESU/comments/1gslzz7/frustration_with_technical_club_orientations_at/",
    "score": 36,
    "upvote_ratio": 0.9800000190734863,
    "created_utc": 1731759120,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "lxf85lo",
      "body": "Hackerspace and Nexus are two most inactive clubs in RR. Honestly I dont see them doing any events tbh. \n\nEmbrione does amazing events.\n└── *Sad HackerSpace noises*\n    ├── u/rowlet-owl  this one went personal ngl. Only you could help in making hsp great again, that is, if, you have some time away from - Making Amrika great again .  \\*cue in eagle and blonde hair vids\\*\n    │   └── ![gif](giphy|hXJ1MWMzY7Af32UIUD|downsized)\n    └── Without you hackerspace fell off"
    },
    {
      "id": "lxfinek",
      "body": "yeah some of these clubs exist just for the sake of it."
    },
    {
      "id": "lxfy9pv",
      "body": "mods should really make a club review flair"
    },
    {
      "id": "lxgdoum",
      "body": "I agree it's so frustrating when you see a club only promoting itself without conducting any event"
    },
    {
      "id": "ly4kr8g",
      "body": "We just need to keep a lookout n get their contact details whether its insta or something else. All communications will happen there mostly. Don't depend only on pesu n posters."
    }
  ]
}