{
  "id": "1gsp84i",
  "title": "to the general males of this subreddit who got in through KCET, please tell me how to do it ",
  "content": "i am a jee 2025 aspirant and i don't think i'll get more than 95 percentile in the first attempt. so KCET colleges are my only hope. PESU is my \"dream\" college cuz its near my home and has very good packages. so please tell me at what rank should i expect PESU and if there are any particular resources i should follow. many thanks in return! ",
  "metadata": {
    "root_comment_id": "lxfw6te",
    "post_id": "1gsp84i",
    "author": "JEE_failure_dropson",
    "url": "https://www.reddit.com/r/PESU/comments/1gsp84i/to_the_general_males_of_this_subreddit_who_got_in/",
    "permalink": "https://reddit.com/r/PESU/comments/1gsp84i/to_the_general_males_of_this_subreddit_who_got_in/",
    "score": 1,
    "upvote_ratio": 0.6000000238418579,
    "created_utc": 1731769729,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "lxfw6te",
      "body": "From \"gates of heaven\" of \"dream college\" huh\n\nDamn PESU marketing is crazy.\n└── its really not about marketing, i have never seen an ad for PESU and till last month i thought PESU is beneath me (delusional) but after research i think its a very good tier 2 college.\n    ├── Do you live in Bangalore? If yes and you haven't seen an ad for PESU it's surprising cause they have ads running all over from the airport to even on dustbins. It's a good T2 college yes, but definitely not worthy of being called a \"dream\" college lol. \n\nYou know what, I'll just let one of the many PESts put a \"RemindMe\" comment here and invoke the bot so we can revisit this a year later to see if your opinion has changed, if you've joined PES that is.\n    │   └── yes i live in bangalore, infact the PES campus is visible from my windows and i think my apartment is visible from PES (lol hope i don't get doxxed) but i don't remember seeing ads for PES. anyways i do hope i get in. any help or resource suggestion would be helpful.\n    │       └── Just prepare well for JEE and do well in KCET and Mains. I graduated years ago, so Ii you want to know cutoff ranks, maybe someone else here can help. Good luck.\n    │           └── thank you !\n    └── Don’t worry now, the moment you typed PESU on your keyboard you’ll get bombared with ads on social media and newspapers\n        ├── Me visiting this subreddit was 100% the reason behind me seeing PESU ads atleast once a week on YouTube.\n        │   └── PESU ads made its way to my work laptop also\n        └── i have adblockers maybe thats why. ublock the goat"
    },
    {
      "id": "lxfxk5x",
      "body": "do well in boards,(i was like you disregarded boards for jee , fucked up my jee mains and boards  ) , if ur prepping for jee u can do well in kcet easily\n└── any particular yt channel/ resources you followed? like unacademy bounceback is for JEE is there any similar content for KCET?\n    └── just do pyqs bro for cet , like most questions repeat"
    },
    {
      "id": "lxfydcp",
      "body": "damn, dream college."
    },
    {
      "id": "lxfye3l",
      "body": "For RR cse within 1.5k\nFor RR AIML within 2.5k\nFor EC Cse Within 5k\nFor EC AIML within 7k\n\nThis year the counselling was heavily delayed so dont take them as a reference take 2023 cutoffs as reference \n\n\nFor advice on how to get to those ranks search in r/kcet\n└── im in cbse :( at max ill be able to get 280/300.\n    └── The point is to maximise your board marks so that even if you fuck up the actual exam you have something to fall back on \n\nYou are a dropper so ig you know kea decided to include cutout portions in the exam and many jee adv. asspirants got analed for it.\n        └── i see. thank you."
    },
    {
      "id": "lxfznx6",
      "body": "Your dream will turn to dread after one month in this college"
    }
  ]
}