{
  "id": "1gu649j",
  "title": "fcked up maths exam , is there any hope",
  "content": "due to time issues , i couldn't complete the the exam and missed about 8-10 marks , atp i doubt ill even cross 20 , if i grind hard and study well and get 30+ in other subjects plus do well in maths isa-2 and ESA , can i get a sgpa of 8-8.5+ ?",
  "metadata": {
    "root_comment_id": "lxrfh2e",
    "post_id": "1gu649j",
    "author": "Feeling_Bird_3666",
    "url": "https://www.reddit.com/r/PESU/comments/1gu649j/fcked_up_maths_exam_is_there_any_hope/",
    "permalink": "https://reddit.com/r/PESU/comments/1gu649j/fcked_up_maths_exam_is_there_any_hope/",
    "score": 19,
    "upvote_ratio": 0.9100000262260437,
    "created_utc": 1731940560,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "lxrfh2e",
      "body": "Getting an 8+ requires you to at the very least, get an 8.0 grade point in every course, which translates to a B grade in every course. B grade in every course means getting a 70+/100 in every course in your overall score of ISA+ESA+assignment. It's hard to predict using a single ISA score.\n\nGetting an 8+ isn't that difficult since you can effectively lose 30 marks out of 100 and still get it. Similarly, getting a 9 GPA means getting 80+ in every course. You can play around with the score for each ISA/ESA and figure out how much you need to score, given that these will be scaled. \n\nNext time, read the FAQs. The GPA question has this explained in detail and even has a GPA calculator to automate things like this."
    },
    {
      "id": "lxrfxum",
      "body": "Man even I need an answer to this..but what happens if scoring 30+ in other subjects is not possible in this isa..won't we get 8.5gpa atleast?!?"
    },
    {
      "id": "lxrge0e",
      "body": "These juniors really need to chill out ,after just their first paper they're stressed out they got whole semesters ahead\n├── We all were there at some point, just that they're unloading it on this platform ://\n│   └── I agree with you but this whole subreddit's now filled with rants and cries for help all the time ,idk how I feel about these new batches anymore\n│       └── Lame and repetitive shitposts are annoying I agree, but I don't see any harm in students ranting about exams. Exams in this college are not very easy and I can understand why newcomers feel overwhelmed.\n│           ├── Definitely, the reason why mods go easy on them. Unlike r/bangalore ughh.\n│           └── Sure but they could sit and study instead too\n│               └── Ok dude. I doubt spending 2 minutes on a three line reddit post would disrupt someone's study schedule. If you're so bothered by a post, why not downvote and move on?\n└── 1st year is the easiest year to maintain a good gpa...they might have heard about it many times too.And c'mon we all have been through that phase"
    },
    {
      "id": "lxrjzg5",
      "body": "This is very reminiscent of my first semester. Math sucked for me and a lot of other people. I still have PSTD from my first ever ISA for math, lowest score I've gotten in any ISA till date. But they relative graded it and I ended up getting a decent grade. Don't worry about it, study for tomorrow's exam."
    },
    {
      "id": "lxrm0mx",
      "body": "I got 16 in isa 1 and still got B grade in math.(With an sgpa above 8.5 with S grade in Chem and mech). ISA 1 gives you a good idea of how to prepare in the future, all is not lost, just focus on what’s in front of you for now, trust me you’ll be just fine, all the best for your remaining isa\n└── so wts your current CGPA??\n    └── 8.66"
    },
    {
      "id": "lxrm1a7",
      "body": "even i am cooked , dw lets hope chem/phy is better."
    },
    {
      "id": "lxrqy58",
      "body": "This is your first actual test and its okay for things to go wrong, make sure you learn from it.  \nIts hard to comment on cgpa because that depends on how your overall batch has scored and whether you will be relatively graded or not. So even if you do post these questions here you are unlikely to get what you are looking for (cause even we don't know its been volatile even for us)  \n  \nMath papers will be lengthy but if you practice well , the logic will come to you naturally. Build up day by day. Try different methods of studying and see what works best for you. You'd have more than a month between isa's so it gives you enough time to try out textbooks , slides , notes (or even paying attention in class :P) and see which helps you the best.\n\nThings that work for some won't work for others. Ultimately, it comes down to your hardwork and staying level headed cause it gets worse down the line, and by then people expect a certain level of professionalism from you and expect you to handle things like this.\n\nSo what I'm saying is you have enough time to make mistakes and its not the end of the world , experiment and enjoy your first year dont take things too seriously but dont let things go entirely, You'll figure it out , like we all did :)\n└── is the grading system absolute or relative?\n    └── It's absolute, but if a batch underperforms they modify the grading system a little. Check the FAQs."
    },
    {
      "id": "lxrypkz",
      "body": "Chill, u can make up for it "
    },
    {
      "id": "lxsvjsz",
      "body": "Homie remember the golden rule, if everyone fucked the exam, no one did. \nAlso it’s fine man. I’ve graduated this year and I can’t remember a single thing I studied for these stupid exams because they don’t translate into what you’ll do eventually either ways. Just be consistent and do your best and you’ll be sorted."
    },
    {
      "id": "lxszu50",
      "body": "Life goes on"
    },
    {
      "id": "lxvhtzw",
      "body": "Yes you do get SGPA 8-8.5 if you grind hard in every subject.\n\nBut Bruh let me be honest , CGPA doesn’t even matter except the thing is to be eligible for placements.\n\nIk the whole point is abt the placements but yea it doesn’t mean if u have higher GPA you will get a best job, other words if u have a less GPA doesn’t mean you will end up with a mediocre job.\n\n\nIt all depends on various factors like your skills and most importantly LUCK 🍀 factor should help you.\n\nYou will understand better once the placements starts for you!\n\nATB:)\n└── what about higher studies GPA is very important imo...\n    └── Yea :)"
    },
    {
      "id": "lxxx88n",
      "body": "If its that bad you may need to write it again as backlog. Study properly and don't make the same mistake.\n└── So if we get very less marks in isa1 will I have to retake the test or what?\n    └── u have 2 do real well in subsequent isas n esa to make up. if you screw isa 2theres no way to get high gpa even if u study.\n        └── Real well in the sense wt range of score do I need to score?! Is it 30+ or 35+?"
    },
    {
      "id": "lykx6yn",
      "body": "I'm a first yearite but I know the grading system well enough, so I'll show you what you're looking for:\n\nScenario 1: (small efforts improvement)  \nISA-1: 16/40 = 8/20  \nISA-2: 31/40 = 15.5/20 (should be possible if you study consistently)  \nAssignments: 7/10  \nESA: 81/100 = 40.5/50  \nTotal: 8+15.5+7+40.5 = 71,   \nand getting an 8.0 (B grade) in the subject requires 70-79 so you're fine, little to no room for error though...\n\nScenario 2: (a good amount of effort consistently)  \nISA-1: 16/40 = 8/20  \nISA-2: 32/40 = 17/20   \nAssignments: 8/10  \nESA: 86/100 = 43/50  \nTotal: 8+17+8+43 = 76.5  \ncomfortably ahead with a B grade only (if most screw up the subject and grade cutoff dips from 80 to 75 for an A then you're chilling with an a grade\n\nScenario 3: (lot of hardwork consistently)  \nISA-1: 16/40 = 8/20   \nISA-2: 37/40 = 18.5/20  \nAssignment: 9/10 (1 mark room for error is always good)  \nESA: 92/100 = 46  \nTotal:  8 + 19 + 9 + 46 = 82,  \nA grade, or 9.0 is 80-89 so this gets you too a 9.0\n\nScenario 3 is a hard to get I'm sure, but always possible if you put in the work. And if you see, an 8.0 is very much possible, if your efforts are anywhere between Scenario 1 and 2 then you're chilling.\n\noh and also to check if you can get 8.5+, use this gpa calculator: [https://pesupedia.vercel.app/academics/gpa.html](https://pesupedia.vercel.app/academics/gpa.html)"
    }
  ]
}