{
  "id": "1gx5jqw",
  "title": "Cse seniors, which is the most difficult subject exam u have written in college?",
  "content": "can be any subject in all 4 years",
  "metadata": {
    "root_comment_id": "lyefrkr",
    "post_id": "1gx5jqw",
    "author": "LastAssociation9694",
    "url": "https://www.reddit.com/r/PESU/comments/1gx5jqw/cse_seniors_which_is_the_most_difficult_subject/",
    "permalink": "https://reddit.com/r/PESU/comments/1gx5jqw/cse_seniors_which_is_the_most_difficult_subject/",
    "score": 7,
    "upvote_ratio": 0.8899999856948853,
    "created_utc": 1732274301,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "lyefrkr",
      "body": "Not a senior, but I've seen people saying that DDCO and compiler design are tough... no idea what they are, tho\n└── As a senior i completely agree. These 2 are the subjects that I literally had no interest in studying. Not very hard but just really really boring"
    },
    {
      "id": "lyekgrx",
      "body": "I’m from 2025 graduating batch. Toughest papers I’ve written are DDCO ESA( everyone in my batch can attest to the trauma of this “external paper”) and the Unix System Programming special topic ESA"
    },
    {
      "id": "lyepang",
      "body": "Ddco"
    },
    {
      "id": "lyf3nr3",
      "body": "For 2020-24 batch it has to be MPCA in 4th sem and DSA in 3rd sem\n└── That MPCA exam came entirely out of left field"
    },
    {
      "id": "lyf6s94",
      "body": "Definitely compiler design. That shit gave me enough trauma during 6th sem. What made the course 10x worse is that our TOC (now called AFLL) course (which back then was in 4th sem, not 3rd) was cancelled halfway because of COVID. So all of us went into compiler design without knowing the basics lmao. \n\nI still have PTSD from that course even now. I've got an Interpreter Design course for my Master's this semester and every class reminds me of the shit I went through 3 years ago and the assignments give me sleepless nights 😭\n└── Hi, where are you doing your masters from? If you don't mind\n    └── NYU Courant"
    },
    {
      "id": "lyf9tex",
      "body": "DDCO 🥹"
    }
  ]
}