{
  "id": "1gx7ar0",
  "title": "Which is the toughest CSE paper  in 3rd sem ESA for the seniors ",
  "content": "",
  "metadata": {
    "root_comment_id": "lyeqnv9",
    "post_id": "1gx7ar0",
    "author": "Accomplished-Honey11",
    "url": "https://www.reddit.com/r/PESU/comments/1gx7ar0/which_is_the_toughest_cse_paper_in_3rd_sem_esa/",
    "permalink": "https://reddit.com/r/PESU/comments/1gx7ar0/which_is_the_toughest_cse_paper_in_3rd_sem_esa/",
    "score": 13,
    "upvote_ratio": 0.9399999976158142,
    "created_utc": 1732280499,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "lyeqnv9",
      "body": "If you don't understand enough, everything would seem tough. You got your answer."
    },
    {
      "id": "lyew2s7",
      "body": "DDCO was easy for us...just try to understand the topic. Web Development was more on the difficult side. Every paper had its own difficulties go through previous papers get an idea of what type questions u will get"
    },
    {
      "id": "lyf1g3t",
      "body": "DSA/DDCO if u go without understanding anything and just mugging up stuff\n\nWeb if u go without mugging up codes\n\nSDS If u don't understand hypothesis interpretation,rejection and how to look up a distribution table\n\nAFLL (if u did PDA only in student lounge)\n└── U r saying we should memorize web tech codes? 💀\n    └── For ESA yeah, I at least had to do it bcz I suck at web dev.\n\nThey expect you to write express code, so it was really difficult to code without any web reference while writing paper\n\nReact codes made some sense, hooks and stuff was better than express and routing codes"
    },
    {
      "id": "lyf2po0",
      "body": "Web dev\n└── Can you elaborate on that a bit more specifically\n    └── Web dev is a really broad topic and there is a lot of stuff to keep track of. I was never interested in that subject in the first place and the questions they asked were vague and open to interpretation. If you have a lot of prior experience with web dev, it shouldn't be a problem though\n        └── Thanks for inputs . How was afll ddco from your pov\n            └── Afll was easy and ddco was moderate for me. I was not able to answer any question from the second unit in ddco esa. I got everything else though."
    },
    {
      "id": "lyf6dhi",
      "body": "You already have recent insights but if you want an opinion from a dude who gave his 3rd sem in 2019, definitely DDCO. Same reasons as people already gave above.\n└── Thank you"
    },
    {
      "id": "lykci3a",
      "body": "DDCO followed by DSA for me were the most challenging! DDCO ESA gave me a headache at the end of the exam lmao"
    },
    {
      "id": "lywwc50",
      "body": "DCO 100% Its hard even if you felt u understood everything. Thats the paper I studied hardest for but got the least marks in.\n\nWeb Dev if you dont understand how to write the code too. Especially the Express Code. Node and React you can somehow get by"
    }
  ]
}