{
  "id": "1h1n5nc",
  "title": "Placement ",
  "content": "Do Students Below 7 CGPA get placed in PESU?\nJust Curious because my mentor tells me you won't get placed if you have a cgpa lower then 7.",
  "metadata": {
    "root_comment_id": "lzcu6ca",
    "post_id": "1h1n5nc",
    "author": "whatwv",
    "url": "https://www.reddit.com/r/PESU/comments/1h1n5nc/placement/",
    "permalink": "https://reddit.com/r/PESU/comments/1h1n5nc/placement/",
    "score": 10,
    "upvote_ratio": 0.8600000143051147,
    "created_utc": 1732765803,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "lzcu6ca",
      "body": "there is a cutoff cgpa to be able to sit for placements and some companies have their own cutoff, so you gotta have atleast that, as far as i know, 8.5 is a safe score\n└── Ideally the *safest* score is a 9+ since that guarantees meeting every company's requirement, however, an 8.5+ is good enough for > 95% of companies\n    └── 9+ still wasn't every company for 2025 batch :') maybe because of GPAflation compared to your batch.  \nStockX, Apple, etc. there were 4-5 companies which had cutoffs like 9.3,9.4,9.5\n\nBut yeah 9+ should cover basically 95% of companies, and 8.5+ will cover like 85% of companies afaik"
    },
    {
      "id": "lzcuyic",
      "body": "Yes, my friend has < 7 GPA and he got placed in a Tier 3 company. Only thing is, its *hard* to get *Tier 1 FTE + internship* with < 7 GPA but off campus option is always there\n└── Did he get placed in campus or off campus?\n    └── on campus"
    },
    {
      "id": "lzden0q",
      "body": "your chances drop as the cgpa goes down cuz to even be eligible for placements you need at least 7+ or something idk it changes every year"
    },
    {
      "id": "lzdiepk",
      "body": "Yeah there’s a chance u can get placed , but most of the companies will prefer 8+ \n\nSo it also depends on the company .\n\nAnd also if they take less than 7 as eligibility the competition will be more so chances will be less :)"
    },
    {
      "id": "lzdj97d",
      "body": "If your CGPA is less than 8.5, there will be fewer than 15 companies you are eligible to sit for in August and September. After that, if your CGPA is 8, you can sit for T2 companies as well as a very few T1 companies. Companies will still be conducting CGPA-based shortlisting until the end of November"
    },
    {
      "id": "lzdlz00",
      "body": "Chud Gaye guru"
    }
  ]
}