{
  "id": "1h2lkll",
  "title": "ISA avg results ",
  "content": "Ive scored around 20-25 in all subjects so it's around avg how hard will it be to get around 8.5+ sgpa\n\nAlso seniors who scored bad in first ISA and had a comeback in the next drop some tips",
  "metadata": {
    "root_comment_id": "lzk1c8r",
    "post_id": "1h2lkll",
    "author": "FireOverWater312",
    "url": "https://www.reddit.com/r/PESU/comments/1h2lkll/isa_avg_results/",
    "permalink": "https://reddit.com/r/PESU/comments/1h2lkll/isa_avg_results/",
    "score": 7,
    "upvote_ratio": 0.8999999761581421,
    "created_utc": 1732886210,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "lzk1c8r",
      "body": "Check this previous comment to find out how much you need for 8.5+:  https://www.reddit.com/r/PESU/s/cWp2hxpPK4\n\nYou'll first have to figure out *why* you performed poorly if you want tips on how to perform well the next time. Unless you share why you couldn't do well, I don't think it's possible to give specific solutions and the best we can suggest is to study more.\n└── Well I do have a reason, I was absent for 2 weeks coz I got into an accident and also got high fever, but the problem is will I be able to study for ISA 2 and ESA in a month and cover ISA 1 topics\n    └── I feel like it's not a question of whether you will be able to do it because if you want a good GPA, you kind of have to. If you want tips: start preparing early, clear all conceptual gaps and ensure you know the concepts thoroughly and practice old questions. Beyond this, you will need to look at your mistakes in your answers and see why you went wrong.\n        └── Okay thanks you so much!!"
    },
    {
      "id": "lzlqply",
      "body": "Its the story of every 1st year ISA the first one is set by the guys over at EC campus who love to absolutely fuse the heck out of your mind and the second one is set by rr campus folks which is relatively MUCH MUCH MORE CHILL. The same is going to happen to you in 2nd sem you isa 1 will go really bad followed by a decent or really good isa 2.  \nregardless study hard only option to beat it. start prep 2 weeks before the exams start + you still have your esa's and labs left so not a huge loss\n└── I have a question. I'm slightly worried about physics lab. Where do I find potential viva questions and also where do I see the setup of experiments? they don't really explain that in the lab record. Any videos I can refer to for that?"
    }
  ]
}