{
  "id": "1h5043k",
  "title": "HackerRank",
  "content": "In our cs labs, we are made to do HackerRank live contests. So it got me wondering:\n\n* Is it smthg that will genuinely strengthen our resume, or its just smthg extra to mention?\n* Has anyone here ever got an internship or job because of their HackerRank profile?\n* Does being a 3-star or higher in a particular language really mean anything?\n* Which platform is more relevant to strengthen our resume?",
  "metadata": {
    "root_comment_id": "m02ao4f",
    "post_id": "1h5043k",
    "author": "Known-Anxiety-4407",
    "url": "https://www.reddit.com/r/PESU/comments/1h5043k/hackerrank/",
    "permalink": "https://reddit.com/r/PESU/comments/1h5043k/hackerrank/",
    "score": 25,
    "upvote_ratio": 0.9700000286102295,
    "created_utc": 1733159806,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "m02ao4f",
      "body": "Freshman here, think of hackerrank like leetcode but a bit easier and more aimed towards people learning stuff rather than developers and swe's. \nI have heard of people getting internships because of certificates/ sprint done on hackerrank but not as much as leetcode.\n3 star doesn't really mean much, you can get it in 2 days by doing only easy problems too. Get 5 stars and then a certificate.\nNot sure which platform is better."
    },
    {
      "id": "m02d6qz",
      "body": "LeetCode LeetCode LeetCode - be doing this, u will get a Tier 1 job ðŸ‘\nâ”œâ”€â”€ Is codewars a good alternative?\nâ”‚   â””â”€â”€ donno\nâ””â”€â”€ Roger that!"
    },
    {
      "id": "m02i4mb",
      "body": "To answer all 4 questions in short:  Hackerrank contest , Hackerearth contest, leetcode contest doesnt matter. You can give whatever you like. The most important thing is be honest to yourself and try to improve your coding skills thats it.  I know people with 3/4 stars who cant solve one question without taking help or cheating because the just copy paste answers from internet/ChatGPT.  So yeah main goal should be to improve your DSA knowledge and problem solving skills here. \n\nYou can mention this in your resume as you are a fresher but that doesnt matter after some time, the thing that will matter is what you will learn doing this contest.  Give your 100% in all contest and never cheat better get 0 in this and try to score better in next contest. After the contest you can do analysis and practice the topics which you were not able to solve.\n\n  \nI have cracked 4 internships in top companies over my 3rd and 4th year of college. And yes my resume i didnt mention my leetcode or hackerrank profile but during interviews/OA i showed my DSA skills and was able to crack it. I think PES has taken a great initiative doing these contest please utilize it proper and dont cheat.\n\n  \nI think Geeksforgeeks and Leetcode are my favorite but i feel all are equal in this case. You can practice on leetcode everyday at home after college. I pretty sure if you start from 1st/2nd year its very easy to crack a 50-60 CTC package.\n\n  \nDoes being a 3-star or higher in a particular language really mean anything? - This is just bullshit timepass focus on problem solving and data structures also important algorithms.\nâ””â”€â”€ Thank you, this was really helpful.\n\n>  \nI pretty sure if you start from 1st/2nd year its very easy to crack a 50-60 CTC package.\n\nThere's a lot of grey area in that, but will surely try :)"
    },
    {
      "id": "m05m467",
      "body": "Freshman here, think of hackerrank like leetcode but a bit easier and more aimed towards people learning stuff rather than developers and swe's. I\nhave heard of people getting internships because of\ncertificates/ sprint done on hackerrank but not as\nmuch as leetcode. 3 star doesn't really mean much,you can get it in 2 days by doing only easy problems too. Get 5 stars and then a certificate. Not sure\nwhich platform is better."
    }
  ]
}