{
  "id": "1h66mqk",
  "title": "do you guys get FAANG jobs? ",
  "content": "title. i went through the placement pdf and i didn't see any FAANGs other than apple that too only for internship ",
  "metadata": {
    "root_comment_id": "m0bbeam",
    "post_id": "1h66mqk",
    "author": "hexadecimal130",
    "url": "https://www.reddit.com/r/PESU/comments/1h66mqk/do_you_guys_get_faang_jobs/",
    "permalink": "https://reddit.com/r/PESU/comments/1h66mqk/do_you_guys_get_faang_jobs/",
    "score": 11,
    "upvote_ratio": 0.9200000166893005,
    "created_utc": 1733282997,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "m0bbeam",
      "body": "They don’t come for placements to our college. Microsoft used to at some point but they stopped several years back."
    },
    {
      "id": "m0bbt5a",
      "body": "We ain't even getting the F in the FAANG so chill\n\n![gif](giphy|Tg9jENf7x11tdJnyMQ|downsized)"
    },
    {
      "id": "m0bdo0u",
      "body": "Check out LinkedIn, you will find plenty of PES alumni currently working at Apple, Microsoft, Amazon and Google. I personally know many from my own circle who are working at these companies. The placement sheet might not be fully updated - LinkedIn would be more accurate.\n└── but how many of those were college placements and how many were off campus?\n    └── Everyone working full time at Apple and Amazon have been through placements. People at Google were not exactly from placements, but rather a college program by Google (I've forgotten the name now) that later shortlisted people. Only MS did not visit."
    },
    {
      "id": "m0c2lex",
      "body": "Only Apple came for our batch :)"
    },
    {
      "id": "m0cbs2l",
      "body": "not a faang but microsoft came this year\n└── i think amazon also came? i was seeing the 2025 data and i see both microsoft and amazon has hired pesu students"
    },
    {
      "id": "m0cfdp7",
      "body": "https://preview.redd.it/phkgd65dxs4e1.png?width=512&format=png&auto=webp&s=a257e1577b6a87c8e634d86609ab2f7309660c7e"
    },
    {
      "id": "m50ftub",
      "body": "Microsoft stopped on campus / off campus hiring altogether, except for IITs and a few other colleges. They mainly hire through the Microsoft engage program, which is a project + 2 month internship program. They use to come for that earlier when I was a student.\n-Source: I work at Microsoft"
    }
  ]
}