{
  "id": "1h77ueh",
  "title": "Skills",
  "content": "Are pesu students usually more skilled than bms, rvce, manipal,msrit, etc clg students in cse ??",
  "metadata": {
    "root_comment_id": "m0j28q2",
    "post_id": "1h77ueh",
    "author": "Confident_Chard7453",
    "url": "https://www.reddit.com/r/PESU/comments/1h77ueh/skills/",
    "permalink": "https://reddit.com/r/PESU/comments/1h77ueh/skills/",
    "score": 9,
    "upvote_ratio": 0.800000011920929,
    "created_utc": 1733400970,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "m0j28q2",
      "body": "more traumatized, yes. Skilled, idrk.\n└── So true 😭"
    },
    {
      "id": "m0j3vet",
      "body": "depends on the person"
    },
    {
      "id": "m0j4xih",
      "body": "A 100 percent yes"
    },
    {
      "id": "m0j5axr",
      "body": "Depends on what skills"
    },
    {
      "id": "m0j9yan",
      "body": "Yeah ofcourse. Don't you know about the \"updated syllabus\"?\n\nWe're going to cross iitb in a couple years\n└── iitb? that's already crossed(that's what my frnds say)..ivy leagues is the next target :>\n\n*sarcasm*.\n    └── Thanks for the sarcasm disclaimer i almost thought you were serious\n        └── Wait he wasn't serious.. I just started backspacing.\n\n*SarCasm*"
    },
    {
      "id": "m0jcst9",
      "body": "Many jokes in this thread I see xD But that’s the general impression many companies seem to have based on what I’ve heard from seniors/alumni. This might have to do with the much older batches(2013-2018) though, because the PESU students back then had syllabus light years ahead of other colleges you mentioned, made by actual great profs back then. Not sure if the same will hold true for upcoming batches, because the syllabus updates in recent years are more superficial and the the general quality of teachers has fallen. I would say PESU still has a clear edge in terms of the subjects and electives offered, and the hands on experience given by assignments/projects. You will notice this easily when you see the difference in quality of hackathon projects of teams from RV vs PESU.\n└── Adding on to this. The difference will also be visible once you join the industry and meet your colleagues from these colleges. There is a difference in skill set, adaptability and experience. I've spent 2+ years in the industry and many managers, team leads, etc have always remarked that PES students are one of the best college hires, especially compared to their counterparts from similar ranked colleges. They would ask me a lot about what courses are different and whether the curriculum and teaching method is different. When it comes to hiring in BLR from BLR-based colleges, PES does come out on top. A lot of it has to do with the academic rigour here - every course demanding a project or some deliverable. Most people I've spoken to from other colleges don't have as much emphasis on project-based learning or even if they do, it's at a much smaller scale (for example, the Big Data project here at PES used to be scaled down versions of industry level applications). \n\nThe only thing to note is as OC has discussed - this difference was significant a few years ago. Nowadays, the difference is very less. And also, very important to note, it depends on the individual.\n    └── well i rly hope they don't turn reduce the academic rigour for my batch just to reduce complains of pes being hard or reduce number of students failing.\n        └── Ig mainly people have problems with the intake, there's pessat, management, kcet, jee mains gosh\n            └── i mean the variety in ways of getting admission is not an issue, the issue is number of students, which is an separate issue all together but not bad compared to other kcet colleges as pes does not have a bazillion branches of engineering.   \nThe issue i am talking is that a lot of kids complain about pes being too hard, but the hard part of pes is what gives pes any edge over other colleges. So i hope they continue being rigorous in academics.   \nThey might reduce intake after a while (maybe after 10yrs), right now it seems like they just want to fund all the construction."
    }
  ]
}