{
  "id": "1h9j0m5",
  "title": "DDCO to be fucked up",
  "content": "What to do , I'm not in a position to finish the syllabus, syllabus is just too annoyingly longggggg😭😭😭",
  "metadata": {
    "root_comment_id": "m114s07",
    "post_id": "1h9j0m5",
    "author": "AggressiveTable5725",
    "url": "https://www.reddit.com/r/PESU/comments/1h9j0m5/ddco_to_be_fucked_up/",
    "permalink": "https://reddit.com/r/PESU/comments/1h9j0m5/ddco_to_be_fucked_up/",
    "score": 33,
    "upvote_ratio": 0.949999988079071,
    "created_utc": 1733665069,
    "flair": "Study Help :table:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "m114s07",
      "body": "I'm also in the same situation. I'm given up and am not even worried anymore but I feel like I should be."
    },
    {
      "id": "m11kuij",
      "body": "Ur not the only one buddy"
    },
    {
      "id": "m11l1z6",
      "body": "im so cooked. above all, for some reasons my ddco teach has too high hopes on me\n└── That means that will be for a reason\n\nEven if u tell u r cooked means ull get 70+ ?\n\nI have seen so many ppl saying it is cooked when it is not even in the initial boiling state, I hope you are not one of those betrayers\n    ├── True true seen too many of them\n    ├── I just hope the paper is so bad that they're forced to relative grade the subject. Otherwise most of us cooked.\n    │   └── Nah some ppl do study and set the bar high that relative will be too less even if they do it(I lost hope about relative in sem-2)\n    │       └── Yeah we are screwed rip.\n    └── i really didn't study, and now im sure im gettting a backlog"
    },
    {
      "id": "m11mg13",
      "body": "on top of that iverilog shit for 10 marks, which they didnt even teach!!\n└── True I don't know shit in verilog 😭\n    └── i swear to god i cant handle so much theory, and that assembly language is so weirdd"
    },
    {
      "id": "m11t6jg",
      "body": "Dont even think ill pass tmr ngl"
    },
    {
      "id": "m1217q9",
      "body": "\"Hi, this is Sushant Singh Rajput\"\n└── Ima get ur autograph on my rope tmrw"
    },
    {
      "id": "m15bobl",
      "body": "Nah I'd win"
    },
    {
      "id": "m15tuo9",
      "body": "Ikr its been same for us as well 🥲🥲,\nJust try to complete the main concept’s at-least! :)"
    },
    {
      "id": "m174lne",
      "body": "How was it??"
    }
  ]
}