{
  "id": "1ha0eu3",
  "title": "Profs give how many LORs for abroad unis?",
  "content": "",
  "metadata": {
    "root_comment_id": "m15dksh",
    "post_id": "1ha0eu3",
    "author": "TheShockSensor",
    "url": "https://www.reddit.com/r/PESU/comments/1ha0eu3/profs_give_how_many_lors_for_abroad_unis/",
    "permalink": "https://reddit.com/r/PESU/comments/1ha0eu3/profs_give_how_many_lors_for_abroad_unis/",
    "score": 13,
    "upvote_ratio": 0.9399999976158142,
    "created_utc": 1733714326,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "m15dksh",
      "body": "It depends on the professor. The max one can give is 5 iirc\n└── There is no \"max\". Depends on the prof.\n    └── yeah yeah"
    },
    {
      "id": "m15j7al",
      "body": "u/rowlet-owl will tell you all you need to know  \nOn a serious note, I got 10 LoRs from one prof in CSE and the rest gave me like 3-4 each\n├── I've become some counselor here eh\n└── bro what 7-9 LoRs from 1 professor alone? isn't an LoR sort of like a feedback/impression of the professor about the student? What can a professor write in 10 different LoRs? (no offense or insult implied I'm just curious)\n    ├── All 10 LORs will be pretty much identical. 10 LORs means LORs were submitted to 10 different universities.\n    └── An LOR isn't a physical entity. Getting N LORs mean the prof agreed to submitting the same LOR for N different applications.\n        └── oh wait I assumed the professor gives you an LOR and you just reuse it for all the universities you're applying to"
    },
    {
      "id": "m15vlsl",
      "body": "There is no \"max\". It depends on the prof, there is no guideline set on profs by PES. Depends a lot on the relationship you share with them and your working history. I've been fortunate to get 7-9 from the ones I was close to but also unfortunate enough to get 2-3 from a few I felt I deserved more from.\n\nIt's best to get LORs from profs you have a working history with, either as a TA, RA or otherwise. Otherwise, the LOR doesn't carry too much weight (look into DWIC LORs)."
    },
    {
      "id": "m1bd5es",
      "body": "It depends on how many you ask and your relationship with them. Some may be more strict to how they give them"
    }
  ]
}