{
  "id": "1hb26z8",
  "title": "What if I skip a whole sem attendance, can I write it as a backlog coming sem and continue, please dont ask the reason, why wt and all.....",
  "content": "",
  "metadata": {
    "root_comment_id": "m1cx1rw",
    "post_id": "1hb26z8",
    "author": "beastmaxop",
    "url": "https://www.reddit.com/r/PESU/comments/1hb26z8/what_if_i_skip_a_whole_sem_attendance_can_i_write/",
    "permalink": "https://reddit.com/r/PESU/comments/1hb26z8/what_if_i_skip_a_whole_sem_attendance_can_i_write/",
    "score": 9,
    "upvote_ratio": 0.8500000238418579,
    "created_utc": 1733838682,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "m1cx1rw",
      "body": "No, you can't, because you need a certain number of credits to be promoted to the next semester.\n\nCrct me if m wrong!"
    },
    {
      "id": "m1d59vv",
      "body": "You won't be able to move on to the next academic year (which starts with odd semester in August). So if you get all backlogs in an odd semester, you will move on to the next even semester. But if you get all backlogs in an even semester, you won't move on to the next odd semester.\n├── Of 6 subjects what's the max subjects I can drop?? And didn't expect it to work this way :( so for credits like do I need to pass all the subjects anything??\n│   └── You can drop everything if you want to. The max is 24 credits in backlog. To get full credit for a course, you need to get a passing grade.\n│       ├── So like even if I get around 10 credits it's enough right to go to the next sem ie yr??\n│       │   └── Yes\n│       ├── Hi! I am on the same page as op. If our attendance is less than 75 in even sem, then can we withdraw few courses of even sem before itself and write it as backlog in upcoming sem? Anyways if attendance is less than 75, we wont be able to write Esa due to mandatory criteria. Plus if we miss an Esa of subject( without withdrawal of course) , the Isa( no attendance criteria) and assignment marks get nullified. I just want to avoid the case of repeating a year in case jee adv doesnt go upto expectation.\n│       └── Hi! I am on the same page as op. If our attendance is less than 75 in even sem, then can we withdraw few courses of even sem before itself and write it as backlog in upcoming sem? Anyhow if attendance is < 75, we wont be able to write Esa due to mandatory criteria. Plus if we miss an Esa of subject( without withdrawal of course) , the Isa( no attendance criteria) and assignment marks get nullified. I just want to avoid the case of repeating a year in case jee adv doesnt go upto expectation- is there any way?\n├── Hi! I am on the same page as op. If our attendance is less than 75 in even sem, then can we withdraw few courses of even sem before itself and write it as backlog in upcoming sem? Anyhow if attendance is < 75, we wont be able to write Esa due to mandatory criteria. Plus if we miss an Esa of subject( without withdrawal of course) , the Isa( no attendance criteria) and assignment marks get nullified. I just want to avoid the case of repeating a year in case jee adv doesnt go upto expectation- is there any way?\n│   └── I am not entirely sure, since to withdraw from a course, you need to be by-default registered for the ESA for it. Reach out to the COE.\n│       ├── okay ty\n│       ├── What's the max backlog limit for even sem? Sem 2 is of 24 credits for us\n│       ├── What's the max backlog limit for even sem? Sem 2 is of 24 credits for us\n│       └── Sorry to bother you again but in vertical mobility circular, it states that \" A person will be promoted to higher sem with lesser than or equal to 24 credits in backlog\" which is applicable in all sems of study. So does that mean if u get all courses in backlog of even sem, you won't have to repeat a year and can give the backlog exam in next odd sem? ( u had mentioned in ur comment previously that the person would have to repeat a year for even sem backlog)\n\nhttps://preview.redd.it/mol8i0c6rzge1.png?width=993&format=png&auto=webp&s=47cd63b676430d7f598e821d96fc63747741834a\n├── https://preview.redd.it/xpo6grji23he1.png?width=993&format=png&auto=webp&s=9aa92066fb358bcc54284c8e774f58417fd607a9\n\nSorry to bother you again but in vertical mobility circular, it states that \" A person will be promoted to higher sem with lesser than or equal to 24 credits in backlog\" which is applicable in all sems of study. So does that mean if u get all courses in backlog of even sem, you won't have to repeat a year and can give the backlog exam in next odd sem? ( u had mentioned in ur comment previously that the person would have to repeat a year for even sem backlog\n│   └── If you get all courses as backlog, you won't be allowed to move to the next odd semester. For example, if you have all backlogs in sem 2, you can't move to sem 3. You'll be stuck in that year until you clear all backlogs. Then you'll move to sem 3 with the next sem 3 batch. \n\nIt's pretty clear from the wording.\n│       └── Oh okay, got it. So if I plan to attend only one or two courses, like the 2-credit course, and write the ISA and ESA while withdrawing from other courses, will that suffice for promotion to the next semester?\n│           └── Pretty sure you can calculate that yourself.\n│               └── ok thank u\n└── But what if we clear in the summer term after even sem , will we be able to move on to the next odd sem?"
    },
    {
      "id": "m1di1b3",
      "body": "20 credits or something i believe"
    },
    {
      "id": "m1ff6ds",
      "body": "Chill it's so simple just withdraw the courses,you can attend isa as attendance rule's is not applicable for isa (I think), with out any red flag's on Grades Card."
    },
    {
      "id": "m2bbzhx",
      "body": "You can withdraw courses and take them some other time. Credits matter for graduation so consider carefully if its something you want to do."
    }
  ]
}