{
  "id": "1hemsjw",
  "title": "Intra college branch change/ Sliding branches?",
  "content": "I've got a few friends over at manipal and they recently had this concept of \"intra institute branch change\" where students who are at manipal take part in another counselling based on their MET ranks and slide / switch branches... Is there something similar at PES? I'm guessing not because of having both kcet and pessat as modes of admission but I remember jawahar mentioning it (sliding branches) during our orientation.",
  "metadata": {
    "root_comment_id": "m24v817",
    "post_id": "1hemsjw",
    "author": "PlusBad4113",
    "url": "https://www.reddit.com/r/PESU/comments/1hemsjw/intra_college_branch_change_sliding_branches/",
    "permalink": "https://reddit.com/r/PESU/comments/1hemsjw/intra_college_branch_change_sliding_branches/",
    "score": 6,
    "upvote_ratio": 1,
    "created_utc": 1734244378,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "m24v817",
      "body": "Yeah, it's there. PESSAT has two rounds so a lot of people switch branches and even campuses during the second round based on their PESSAT ranks. This is quite common and a lot of people get shifted around this way. The same thing happens in KCET although it's rarer.\n\nYour final change to switch branches/campuses is in sem 3, where your first year GPA lets you switch between branches/campuses. This is more difficult, because there are very limited seats at this stage.\n└── no I don't mean initial counselling, I'm already in the college. I mean to fill up any remaining/vacant seats, like for eg if out of 720 there are 15-20 seats vacant, the college organizes another counselling between only students who are in the college to slide/switch branches and fill up those seats while emptying seats from lower branches like ece\n    ├── No there is nothing like this in pes\n    └── This generally happens when moving from 2nd sem to 3rd sem, based on cgpa. Few shifted from CSE-AIML to CSE, and few changed campuses as well from EC to RR. This is of course, subject to vacant seats in the branch you want to shift to. Not always guaranteed that you will be can switch."
    },
    {
      "id": "m261h61",
      "body": "After 1st year if seats are open then you can apply for change of branch/ change of campus or both.  Like how pessat counseling is conducted they will call u one day and  rank u by cgpa and ask your preference and shift you . There will be a live counter of seats. By the next day you can get the official notice signed by HoD with new srn. Then get new class and start with your new classes immediately."
    },
    {
      "id": "m2ba84k",
      "body": "People can apply to change of branch after 1st year once, if there's availability you can sit in those classes. If you decide not to...you can't change your mind later."
    }
  ]
}