{
  "id": "1hfdew6",
  "title": "How much free time do you get in 4th year?",
  "content": "",
  "metadata": {
    "root_comment_id": "m2aq6dg",
    "post_id": "1hfdew6",
    "author": "TheShockSensor",
    "url": "https://www.reddit.com/r/PESU/comments/1hfdew6/how_much_free_time_do_you_get_in_4th_year/",
    "permalink": "https://reddit.com/r/PESU/comments/1hfdew6/how_much_free_time_do_you_get_in_4th_year/",
    "score": 24,
    "upvote_ratio": 1,
    "created_utc": 1734331910,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "m2aq6dg",
      "body": "Depends on if you have a PPO or get places earlier and on your capstone. The special topics are usually low effort with studying one day before mostly will work, if you get placed early it’s really a peaceful year."
    },
    {
      "id": "m2aq6t4",
      "body": "if you're placed early, it's really fun and you have loads of free time\n\n\nif you're not placed... it's pretty stressful. even though you basically have only capstone and like 2 special topics, you'll be on leetcode and interview grind which is not fun\n└── How's it going for you since I noticed you're in 4th year\n    └── Got placed before 7th sem started, so had a lot of fun lmao\n        └── Off campus?\n            └── no I got placed on campus only\n\nthe first few companies start coming around July end, right before the semester starts. luckily I was one of them xd\n                ├── bro prolly had a 11/10 cgpa\n                │   └── cgpa doesn't have much correlation to actually being smart and getting placed lmao. you can easily get an S in a subject without really learning anything useful or practical\n                │       └── What's ur gpa tho\n                │           └── above 9.7\n                │               └── has 9.7 cgpa but says cgpa doesnt matter with placement 😑\n                └── gah damn good for you congrats. cgpa?\n                    └── 9.8\n\nbut cgpa is NOT indicative of getting placed btw. keep it above a threshold (8.5 good, 9 to be safe) to get shortlisted for companies. I kept it high since I'm planning on doing mg masters\n                        ├── First year here. Can u tell me what u did in your first year.? And how'd u maintain gpa and explore ur interests?\n                        │   └── dm me\n                        └── lets say i have a 9.2 and someone has a 9.4,will the company pick the one with better skills or the one with better [gpa.is](http://gpa.is) it fine if we keep it above 9 and work on cs related stuff?(1st year here)\n                            └── Look at the FAQs on the subreddit for a detailed answer.\n\nIn short though, after you clear the gpa cutoff as mentioned by a company, it doesn't matter anymore. \n\nKeep a good balance of both skills and gpa. 8.5+ is fine, 9+ is to be absolutely safe. The issue is that there are so many of you kids that companies sometimes can't conduct tests/interviews for all, so they keep a higher gpa cutoff. Only a few companies have a 9.5+ cutoff, but these are a very small number."
    },
    {
      "id": "m2b8stt",
      "body": "Whole 8th sem was free for me (Only internship to do, capstone paper and one online special topic) If you get paid internship there's no chance you'd have classes in 8th sem, only need to work on the paper for Capstone.\n└── In 7th...my main work was CAPSTONE and two subjects."
    },
    {
      "id": "m2c1sfa",
      "body": "No time to die"
    }
  ]
}