{
  "id": "1hg8er7",
  "title": "What’s one thing you wish you had known before joining PESU?",
  "content": "",
  "metadata": {
    "root_comment_id": "m2ha9hb",
    "post_id": "1hg8er7",
    "author": "Gracious_Heart_",
    "url": "https://www.reddit.com/r/PESU/comments/1hg8er7/whats_one_thing_you_wish_you_had_known_before/",
    "permalink": "https://reddit.com/r/PESU/comments/1hg8er7/whats_one_thing_you_wish_you_had_known_before/",
    "score": 17,
    "upvote_ratio": 1,
    "created_utc": 1734433956,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "m2ha9hb",
      "body": "I wish I had known that the college I’m getting admitted into would become the future IIT Bangalore\n└── On a serious note, I wish I knew how dynamic and unpredictable a university degree could get. Our batch experienced three different grading schemes, and adapting to these constant shifts while maintaining GPA was challenging. It felt like we were part of an experiment, with little consistency to rely on."
    },
    {
      "id": "m2hbbit",
      "body": "I wish I knew ECE is shit in PESU"
    },
    {
      "id": "m2hgmnz",
      "body": "thr academics is actually kinda annoying.\n└── You're crying in 1st sem only huh. Wait it gets worse"
    },
    {
      "id": "m2hjjyv",
      "body": "That I should not have joined PES"
    },
    {
      "id": "m2imfos",
      "body": "That There is no iit in Bangalore because there is PESU"
    },
    {
      "id": "m2it5hv",
      "body": "In part that I would have been better off in another college. But if you want a more constructive answer, accounting for commute, it tires you out a lot more than you'd expect."
    },
    {
      "id": "m2j7duu",
      "body": "not much actually, the seniors on reddit have told all the things already and everything is going as expected."
    },
    {
      "id": "m2j853o",
      "body": "That first year subjects matter the most for gpa.\n└── Also getting above C in all subjects is a must if we want high cgpa."
    },
    {
      "id": "m2umr77",
      "body": "That how bad and unstable the management is."
    },
    {
      "id": "m3lq74l",
      "body": "That this is a giant construction site. Was here 19-21. Lot of construction, dust and noise."
    }
  ]
}