{
  "id": "1hj83pd",
  "title": "What is the maximum funding PESU Venture labs can give to a startup?",
  "content": "",
  "metadata": {
    "root_comment_id": "m34l47q",
    "post_id": "1hj83pd",
    "author": "Successful_Room7386",
    "url": "https://www.reddit.com/r/PESU/comments/1hj83pd/what_is_the_maximum_funding_pesu_venture_labs_can/",
    "permalink": "https://reddit.com/r/PESU/comments/1hj83pd/what_is_the_maximum_funding_pesu_venture_labs_can/",
    "score": 16,
    "upvote_ratio": 0.9399999976158142,
    "created_utc": 1734780866,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "m34l47q",
      "body": "Wait.. u guys get funding for startups😭,ig i should've joined pesu\n└── We also get severe mental trauma. GGs\n    └── Well ig that's a good tradeoff, but yeah our placements are a bit worser than u guys😭\n        └── Well life gives and takes , i see other colleges and get really jealous sometimes too. Very difficult to get a good gpa here , comparatively. PES also somewhat encourages a coaching culture over interests. But it is what it is ig.\n            └── Yea ik😞,good luck being there bro"
    },
    {
      "id": "m34nsll",
      "body": "I think their entire fund is of $500,000\n├── Per startup?\n│   └── no overall\n│       └── Around 4.5 cr 🫤\n│           └── thats a lot of money, considering that in the previous shark tank india seasons, the sharks independently have not spent more than 7-8 cr, so 4.5 cr is a good number for college kids\n│               └── yeah number of startups in pes is gonna be a LOT less then what show up in shark tank, also most startups here are prolly software ones, so they might need less budget initially.\n└── tf is that username 💀\n    └── I am the author as well\n        ├── One of those huh ? I would avoid messing with u, gud luck carrying that hate  :)\n        │   └── It's up to you, man. I never forced you to talk to me. If you're genuinely offended by differing political views, that says more about you than anything else. Also, I don't hate any religion or anything like that—my username was just a harmless joke.\n        │       └── \"Offended\" bro your entire post history is just you arguing politics😭  and I remember you were the one whining under some post in this subreddit about a poor student from a village\n        └── Bohut cool ban gaya bhai"
    },
    {
      "id": "m34ri5n",
      "body": "They take Equity? Or is given in kind support?\n├── Yes they do take equity ,max I heard was of 25%\n└── they take equity ofcourse, but more than that if your startup is damn well successful, they will milk it for the next upcoming 25 years\n    └── have they milked anything till now.\n        └── dude this guy got placed in 2021 for 1.5 cr and mfs are still milking his placement."
    },
    {
      "id": "m38qobs",
      "body": "I would suggest not going there.\n└── why?\n    └── They take too much for too less."
    }
  ]
}