{
  "id": "1hpmloq",
  "title": "MSCS applications",
  "content": "Which is superior for MSCS 8.25-8.5 cgpa in pes university vs 9.25 cgpa in tier 2 clgs like BIT Dayanand Sagar. BMSIT,etcetc consider other factors for the application are nearly the same.... I'm still a freshman...grinding and figuring out how to score good cgpa here....My only goal is Masters (ill earn after completing education)\n",
  "metadata": {
    "root_comment_id": "m4injjv",
    "post_id": "1hpmloq",
    "author": "Confident_Chard7453",
    "url": "https://www.reddit.com/r/PESU/comments/1hpmloq/mscs_applications/",
    "permalink": "https://reddit.com/r/PESU/comments/1hpmloq/mscs_applications/",
    "score": 0,
    "upvote_ratio": 0.33000001311302185,
    "created_utc": 1735563173,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "m4injjv",
      "body": "those clgs are tier 3 lol\n├── Rv bms pes ramaiha tier 1\nBit jss dsce etc tier 2\nForget nits and iits iiits 😭😭\n│   └── Rv bms pes msrit sab tier 2 hein bro.\nRest of them are tier 3\n└── Then why did my neighbour get 25 lpa from dayand last year 💀\n    ├── Ayo neighbour hit me up\n    │   └── i will ask him once if i can share his linkedin\n    │       └── Thank you very much !!\nMay Doredaddy's grace be with you always\n    └── RIP to you if you are getting anything less than him /s\n        └── fr, hope he moves out"
    },
    {
      "id": "m4j8g4r",
      "body": "9.25 - 9.5 is superior.\nThe \"tier system\" does not exist , PES or whatever is not tier 2 / tier 3. They do check NAAC grade and nirf ranking tho but pes is not amazing in that regard either. \n\nIf your goal is PURELY masters , do not come here. It's much easier to get higher gpa in those colleges.\n└── bro im already in 1st sem its coming to an end\n    └── Then study here brother , why are you asking such questions? What will change by asking such questions? Just do your best.\n        └── ya true ill try my best thats all is in my hands"
    },
    {
      "id": "m4jm7ow",
      "body": "Once again we have kids barely in sem 2 thinking about Masters. You already have the answer to your question, but you should know that you are asking this way too early."
    },
    {
      "id": "m4m95rc",
      "body": "You shouldn’t see it only in terms of cgpa, it’s just one factor for MS adcoms. Definitely those DSU etc would be easier to score gpa but the kind of exposure and peer group you’d get at PESU (especially if you’re part of groups like the Innovation Lab) will make the rest of your profile way stronger than it would be in DSU. Also, fwiw some adcoms (like CMU) are actually aware of PESU and it is not treated like just another random college.\n\nIf you’re really ready to work hard on your profile wholistically then PESU is a better option. If you want to just get in based on easy high gpa(some places like USC and other not so good unis) then maybe look into the others.\n└── Not entirely accurate. PESU definitely helps you build a more holistically stronger profile. However, GPA is like 60-70% of the admission decision and is one of those parameters that *cannot* be compensated with other things - these other things simply *add* to your profile. Which means that having a 9.5 GPA from say SRM vs having an 8.5 GPA from PES + other accomplishments would still put our beloved PESt at a major disadvantage. \n\nIf you go through admission decisions, you'll more often than not see people with average GPAs but great profiles getting rejected from top schools compared to people from lower ranked unis with high GPAs. And USC is a cherry picked example here. There are many top schools where a high GPA is a foot through the door - CMU and UCLA being two famous examples. You'll also find similar cases at schools like UPenn, TAMU, UVA and the like. Check out LinkedIn and see the colleges where people currently at these unis are from. You'll see many random colleges there with almost nothing on their profile except a ridiculously high GPA. \n\nSummary: GPA (and GRE where mandatory) is definitely a very important parameter. It makes or breaks your case at most unis. Everything else simply adds to your profile. Given that your GPA is the first impression you make here, an extremely high GPA from a tier 3 or lower college can do wonders and outrank an average GPA from a tier 2.\n    ├── You’re right, agree with what you said mostly. I should’ve been clearer in my original comment, PESU won’t be helpful as much if you don’t get 9+ at least. That being said I do think if you have like 9.2 from PESU, great papers and great LORs from here, it’s going to be more of a differentiator for good unis than someone getting 9.7 from DSU or New Horizon and nothing else to their profile, simply by virtue of how many people there are just like that. That is not to say you can’t achieve the same kind of papers and LORs from those unis, it’s just less conducive. Also my answer might be a bit biased to top-20 kinda unis not sure how it’d work for mid-tier ones\n    ├── What good unis in the US aren’t GPA centric? \n\nAre European universities GPA centric too?\n    │   └── I'd say anything outside the T20 wouldn't be GPA centric. Not sure about European ones.\n    │       └── Thanks!\n    └── Hey, I'm a bit late to this but, is it the same case even after work experience (say of 2 years) or does cgpa matter less that time"
    }
  ]
}