{
  "id": "1hqybc7",
  "title": "Solutions to previous year end-semester exam questions.",
  "content": "Good afternoon everybody. Wish you a Happy New Year.  \n  \nWould not it be a good idea if PES will provide solutions to previous year end-semester exam questions? Here are some potential reasons why this could be beneficial:\n\n1. Some students might feel too shy to approach teachers with their doubts.\n2. Posting questions on platforms like Reddit often results in being told it is not the right place to ask.\n3. Sharing on Discord may lead to no responses, or if someone does respond, others may criticize them for giving direct answers instead of just hints.\n4. It can be uncomfortable or discouraging to repeatedly approach a teacher for clarifications.\n5. At times, teachers may not be in the best mood to answer and might come across as dismissive or teasing.\n\nThis suggestion is not to discourage students from making an effort, but having ready access to solutions can make it easier to understand and learn effectively when needed.",
  "metadata": {
    "root_comment_id": "m4tmbkh",
    "post_id": "1hqybc7",
    "author": "AdFirst3371",
    "url": "https://www.reddit.com/r/PESU/comments/1hqybc7/solutions_to_previous_year_endsemester_exam/",
    "permalink": "https://reddit.com/r/PESU/comments/1hqybc7/solutions_to_previous_year_endsemester_exam/",
    "score": 20,
    "upvote_ratio": 0.9599999785423279,
    "created_utc": 1735717320,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "m4tmbkh",
      "body": "Check pesu library, you may find there."
    },
    {
      "id": "m4tn8gn",
      "body": "There used to be solutions on the library website but this was a long time ago (around my first or second year). Maybe you can ask the anchor profs of the respective courses. Otherwise, I don't think you can get solutions - they are pretty stubborn about releasing them."
    },
    {
      "id": "m4ttok8",
      "body": "I think for python the teachers have solutions for the previous 2-3 [years.You](http://years.You) can ask your teacher for them,they are generally more than happy to share them."
    },
    {
      "id": "m4txbs0",
      "body": "You can't expect this from pesu officially"
    },
    {
      "id": "m4ubw0t",
      "body": "Questions come directly,it's PESU's last effort to make you study\n└── Directly from ?"
    }
  ]
}