{
  "id": "1ht8vb2",
  "title": "why i am not getting my 3rd sem ESA results as i ahve no dues in library fees etc all my friends got their result but mine it is showing 2nd sem result when i open pesu app",
  "content": "",
  "metadata": {
    "root_comment_id": "m5bjd3l",
    "post_id": "1ht8vb2",
    "author": "Capable-Win-5571",
    "url": "https://www.reddit.com/r/PESU/comments/1ht8vb2/why_i_am_not_getting_my_3rd_sem_esa_results_as_i/",
    "permalink": "https://reddit.com/r/PESU/comments/1ht8vb2/why_i_am_not_getting_my_3rd_sem_esa_results_as_i/",
    "score": 10,
    "upvote_ratio": 1,
    "created_utc": 1735974102,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "m5bjd3l",
      "body": "One of my friends told me she's having the same issue. Ig it's a bug the app itself is shit.\n└── yeah bro do u know any means to fix it\n    ├── i mean is there any other way to know the result\n    └── Can't say anything except try uninstalling and reinstalling the app"
    },
    {
      "id": "m5bjjp6",
      "body": "Try the website\n└── same problem"
    },
    {
      "id": "m5bkarr",
      "body": "if u r from KCET, then u have to pay some exam fees separately if i remember correctly, did u pay that?\n├── but they didnt asked i have paid 1lac 28k at beginning\n│   └──  not sure then, you can go and confirm with the controller of examination\n└── no"
    },
    {
      "id": "m5bmoki",
      "body": "First of all contact the exam guys, if there were any dues they will make sure you pay all of them before the exams , in fact they won't give you hall ticket if you haven't paid any, but you gave the esa so write an email through your 3rd semester's class teacher to the coe raising your issue, this is the way you should resolve stuff"
    },
    {
      "id": "m5bmru4",
      "body": "Try mailing: [coe.pesu@pes.edu](mailto:coe.pesu@pes.edu)  \nand if you are from ec campus: [dycoe.pesuec@pes.edu](mailto:dycoe.pesuec@pes.edu)"
    },
    {
      "id": "m5bsye2",
      "body": "Did you try scrolling down on that page?\nAs the sem3 result is displayed on the same page as sem2 result, just scroll down and check...\n└── Yeah I scrolled but I didn't get it"
    }
  ]
}