{
  "id": "1hu7ypj",
  "title": "Attendance!!!!",
  "content": "I have an attendance shortage in Maths,\nIt was 74.12% last Friday, but the math mam wasn't taking P-1 and P-2, so I bunked these classes because she had earlier (on Wednesday) told me that she would give me attendance.\nNow she didn't give me attendance or reply to my messages!\n\nCurrently, attendance is 72.41%\nI need 3 class attendances for it to go 75%\n\nWith should I do now? Do I need to submit a medical certificate or talk to her once again in person?\n(Teacher - Shivsankari)\n",
  "metadata": {
    "root_comment_id": "m5ivo1o",
    "post_id": "1hu7ypj",
    "author": "vanillaaaaiceCream",
    "url": "https://www.reddit.com/r/PESU/comments/1hu7ypj/attendance/",
    "permalink": "https://reddit.com/r/PESU/comments/1hu7ypj/attendance/",
    "score": 9,
    "upvote_ratio": 1,
    "created_utc": 1736086628,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "m5ivo1o",
      "body": "Try talking to the teacher, if she said she'll give you attendance chances are that she just forgot.  \nOtherwise yeah a medical certificate would be the way to go\n└── I just did; she just left me on seen, and now I'm disgusted to go talk to her!\n    └── https://preview.redd.it/9d0ekbcqr6be1.png?width=1080&format=pjpg&auto=webp&s=afec8837ffda9447c8fa6372e2ac21484260f8a5\n        └── Oh yeah, from the experience I have (3 teachers I've texted) like 70% of the time they don't respond, you have to go and talk to them in person 😔"
    },
    {
      "id": "m5iw6q5",
      "body": "Man, just ask he my teachers gave free attendance to people who had 70% or higher attendance"
    },
    {
      "id": "m5j7lg8",
      "body": "I think the management has informed the teachers to not to give attendance cuz like 👇\n\nhttps://preview.redd.it/vs9zx0po27be1.jpeg?width=1080&format=pjpg&auto=webp&s=30891bfbba6da14e65543bcadb04b0358854e2ec\n└── Even if I have one subject attendance less than 75?\n    ├── Yeah ig but still try talking to her, cuz like the teachers should update the final attendance in an excel sheet. So maybe if u butter her enough maybe she'll change it.\n    │   └── Thanks for the info\n    └── The number of courses with less attendance does not matter since attendance is computed independently for each course. Reach out to your prof as someone else suggested and see if they can show a bit of leniency."
    },
    {
      "id": "m5nk52m",
      "body": "worst case scenario,just attend the make up classes.  \nIt should not be more than 1 day if you have shortage in only Maths."
    }
  ]
}