{
  "id": "1huc46v",
  "title": "How tf yall actually excited for tomorrow",
  "content": "new sem starts tomorrow and i already got some mfers goin \"i missed college\" shutthefuckup how the fuck you already pre-glazing the professors- YOU AINT EVEN MET EM YET MAN\n\n\"CaNt wAiT tO gEt BaCk iNtO aCaDeMiA aNd PeRsUe mY aCaDeMiC pRoWeSs\" like god fucking damn bro, zip it up when you're done.\n\nLike guys im lowkey realising i havent improved a single bit this vacation, my fits didnt get tougher, i didnt get a glow up, i didnt really lose weight\n\nFAM IM THE EXACT SAME 🥷ER WHO THEY SAW GET COOKED @ DDCO, NOTHING CHANGED ABOUT ME\n\nfuck man i actually cant do this even my sleep schedule is fucked \n\nim going to sleep when college starts and waking up when college ends, THERES NO WAY IM MAKING IT TO FIRST CLASS ON TIME TOMMOROW BRUH",
  "metadata": {
    "root_comment_id": "m5jvchp",
    "post_id": "1huc46v",
    "author": "pesu-hater",
    "url": "https://www.reddit.com/r/PESU/comments/1huc46v/how_tf_yall_actually_excited_for_tomorrow/",
    "permalink": "https://reddit.com/r/PESU/comments/1huc46v/how_tf_yall_actually_excited_for_tomorrow/",
    "score": 121,
    "upvote_ratio": 0.9399999976158142,
    "created_utc": 1736098058,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "m5jvchp",
      "body": "Sam lol , my sleep schedule is so fucked , I go to sleep at 6 in the morning idk what will I do"
    },
    {
      "id": "m5jwra5",
      "body": "Was gonna type some hater shit but it seems like you're just mad at yourself, not others.\n\nLock in, prioritize whatever you need to sort out in your life (I'd say prioritize fixing your sleep schedule first). Things start to seem clear when you handle it one step at a time. \n\nEveryone needs time for themselves, and I suggest you dedicate quite some time to no one but yourself.\n\nP.S. even I was burnt out after 5th sem and pretty much just spent most of the sem break in some game or the other. Luckily, results were good and I feel like I've gathered myself enough to handle 6th sem. Stay strong, you'll pull through."
    },
    {
      "id": "m5jzp32",
      "body": "Chill bud, just bunk"
    },
    {
      "id": "m5k50hb",
      "body": "It's okay to use vacation to just chill man.... no need for life altering changes yk ;)"
    },
    {
      "id": "m5k6uxh",
      "body": "i Love your username"
    },
    {
      "id": "m5kgt8r",
      "body": "username checks out"
    },
    {
      "id": "m5kvhll",
      "body": "I've seen people across like 5-6 years in the age spectrum on this subreddit, and I've yet to come across even one person who enjoyed DDCO, loved the subject and was passionate about it. And don't @ me with \"muhhhh faculty baaaad\" because my DDCO prof was the legendary Dr. Ch He 😭\n\nDDCO lovers pls reply thx\n└── Not a DDCO lover but a u/abaksy lover uwu"
    },
    {
      "id": "m5mnogg",
      "body": "The only sane guy in PES be like"
    },
    {
      "id": "m5mw2ks",
      "body": "As you progress through the semesters, the excitement proportionally decreases. I feel you buddy.\n└── **proportionally** might be slightly understating it mate :)"
    },
    {
      "id": "m5n7vri",
      "body": "Why nobody getting the reference lmao"
    },
    {
      "id": "m5neook",
      "body": "Good username OP, but you can’t hate it more than me"
    },
    {
      "id": "m5neqs0",
      "body": "Fuck that, post college life is so much better juniors, trust me"
    },
    {
      "id": "m5ou121",
      "body": "Chill bro"
    },
    {
      "id": "m5puq6n",
      "body": "TLDR \nI hate people not hating what I hate."
    },
    {
      "id": "m5qkp33",
      "body": "I mean some people get turned on by the concept of learning, not pre-glazing the teachers per se, but yes there are mfers who do that and it's very evident who those are and they are annoying af"
    },
    {
      "id": "m61m0gc",
      "body": ">THERES NO WAY IM MAKING IT TO FIRST CLASS ON TIME TOMMOROW BRUH\n\nI like your spirit, I share said spirit."
    }
  ]
}