{
  "id": "1hugj9m",
  "title": "What I need to get into PES",
  "content": "I'm hoping to get admission in pes this year through kcet. I want to get cse at rr campus and I wanted to know how much I would need in boards/kcet to get a seat. I know it changes every year but I'd like a general idea so i have a goal to work towards. Also wanted to know how the removal of PESSAT would effect the seats.  My cousin went to pes and I've wanted to go for a long time. EC campus is out of the question and so is any branch other than cse (it's what I'm genuinely interested in). So if anyone can tell me I would appreciate it. Also my friend told me that since I am an OCI card holder there might be some other kind of quota for nri/oci. So if anyone knows anything about that could you explain how it affects like the fees and the rank I would need. I sent an email to the admissions office but they asked for my phone number but never replied. Thanks",
  "metadata": {
    "root_comment_id": "m5kxxwo",
    "post_id": "1hugj9m",
    "author": "HmmBoss",
    "url": "https://www.reddit.com/r/PESU/comments/1hugj9m/what_i_need_to_get_into_pes/",
    "permalink": "https://reddit.com/r/PESU/comments/1hugj9m/what_i_need_to_get_into_pes/",
    "score": 13,
    "upvote_ratio": 0.9300000071525574,
    "created_utc": 1736109251,
    "flair": "PESSAT/Admission",
    "nsfw": false
  },
  "comments": [
    {
      "id": "m5kxxwo",
      "body": "Do ur best cuz kea may or may not fuck u up, my frnd got iit madras ocean engineering smtg idk and got 5300 rank in kcet cuz he had attempted the out of syllabus questions too and my other frnd didnt even qualify for jee adv and got 2500 rank in kcet cuz he did not attempt out of syllabus questions. Some news articles say that kcet will include out of syllabus questions this year and many coaching teachers are stating otherwise is what my juniors told me. Give your best, safe bet wuld be 290+ in board and 120-130+ in kcet given kea doesnt fuck u up, again one more example, another one of my frnds had 280 in boards but 101/120 last year in kcet got 1k ish rank.\n└── I'm just grinding board pyqs right now, I'll grind kcet after boards end. I'm hoping to get almost 100% in chem, and let most of my lost marks be from physics. For the out of portion syllabus how would I go about knowing what to try? I only solve pyqs and sample papers right now, I don't  do much else. I'm hoping I can get 285+boards and 145+kcet, Hopefully that lands me around 1k rank for cse at rr.\n    └── do u hv prior jee or kcet prep?\n        └── Jee I'm writing but I'm not focused on it. I was in allen for kcet and attended properly till October. I finished solving all their modules already."
    },
    {
      "id": "m5lci3g",
      "body": "Jee I'm writing but I'm not focused on it. I was in allen for kcet and attended properly till October. I finished solving all their modules already."
    },
    {
      "id": "m5nnxtt",
      "body": "Brother you dont need anything ...your dads pocket should be filled with tons of money and that is enough to get into PES because DORESWAMY embraces money over talents\n└── Bro how hard is it to answer the question the right way"
    },
    {
      "id": "m5o3m6p",
      "body": "atp exam's are unpredictable just do ur best.   \nall PESSAT quota seats are no jee quota, kcet remains the same.   \nI have no clue about the OCI thing."
    },
    {
      "id": "m5o6iww",
      "body": "Don't join pes. Source: I'm a PES alum\n└── What are negative factors of pes?"
    },
    {
      "id": "m5p79cv",
      "body": "why's EC campus out of the question tho, no recruiter worth his/her salt would differentiate campuses over talent tbh( I'm from rr btw). Also maybe since you're an OCI card holder try to get NITs through DASA quota the cutoffs are significantly lower for you. IIIT-H and BITS Pilani offer admission for foreigners through SAT too which is much easier than any other exam. I'd honestly just prep SAT and go to IIIT-H or BITS Pilani if I had the opportunity. Yes the fees are higher but since your interest only lies in CSE go to IIIT-H its pretty much on par with CSE from top 7 IITs"
    }
  ]
}