{
  "id": "1hujs7b",
  "title": "How much CGPA do tier 1 companies ask for?",
  "content": "",
  "metadata": {
    "root_comment_id": "m5n6pu9",
    "post_id": "1hujs7b",
    "author": "fifo007-lfc",
    "url": "https://www.reddit.com/r/PESU/comments/1hujs7b/how_much_cgpa_do_tier_1_companies_ask_for/",
    "permalink": "https://reddit.com/r/PESU/comments/1hujs7b/how_much_cgpa_do_tier_1_companies_ask_for/",
    "score": 9,
    "upvote_ratio": 1,
    "created_utc": 1736117429,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "m5n6pu9",
      "body": "some ask for 7 - 8 and a few higher paying ones 8.5+\n└── Do companies prioritize people with higher gpa?\n    └── some shortlist higher GPA people for test as well, some dont\n        └── Whats the ratio?\n            └── it varies every year\n                └── How is it, generally?\n                    └── Check the placement sheets that are on this subreddit and calculate the ratio yourself. Search this subreddit should give you the placement related data, I believe it's on the FAQs too\n                        └── Remarks are mentioned only for a few companies. For example, they mentioned \"they shortlisted people with X CGPA and Y CGPA\" for only about 10–20 companies. For other companies, they did not mention anything. Does this mean that all other companies did not shortlist people based on GPA, and shortlisted people based on skills?\n                            └── Usually if there is no remark, it means that the maintainer did not observe any trend. \n\nRemember that companies do not explicitly announce that they are shortlisting X+ GPA for interviews (they mention it for the aptitude test). The maintainer (and full respect to them) goes through all the shortlisted students (which sometimes isn't shared, so they need to explicitly reach out) and see if there is any pattern in the GPA of shortlisted students. So there is always some possibility of false negatives."
    },
    {
      "id": "m5w8nr9",
      "body": "8.25-8.5 is a solid bet\nAim for that"
    }
  ]
}