{
  "id": "1huydb6",
  "title": "Is INTERNSHIP compulsory for batch 2021-2025?",
  "content": "For the batch of 2021-2025, is compulsory this time or can we just do courses instead? Also will remote/online internships work?",
  "metadata": {
    "root_comment_id": "m5owi6i",
    "post_id": "1huydb6",
    "author": "Aadi_1659",
    "url": "https://www.reddit.com/r/PESU/comments/1huydb6/is_internship_compulsory_for_batch_20212025/",
    "permalink": "https://reddit.com/r/PESU/comments/1huydb6/is_internship_compulsory_for_batch_20212025/",
    "score": 7,
    "upvote_ratio": 0.8999999761581421,
    "created_utc": 1736168178,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "m5owi6i",
      "body": "as long as its a paid internship, it works\n├── so if we do not get any internship, can we compensate that with extra courses?\n│   └── Yes you can\n│       ├── Okay thanks a lot\n│       └── How many courses are we supposed to take? 3? Because internship credits are 6, so instead we take 3 2 credit courses??\n│           └── You need to complete the credits, if you haven’t taken any summer internships then you should get 6 credits from courses meaning 3 courses of 2 credits each\n│               └── When will these courses be made available? A month from when 8th sem starts? Also, I apologize for asking too many questions\n│                   └── They will release the forms and information a week before 8th sem starts, you’ll be given time till ISA1 to get an internship so you can drop the courses\n└── So you guys don't have that rule where if it's from iisc ,iit then unpaid will be also accepted ?\n    └── we do, that is also allowed. research internships in Government organizations"
    },
    {
      "id": "m5pmkaq",
      "body": "You mean 8th sem? If so yes it is either paid or unpaid. If unpaid you need to take a special course.\n└── Okay thanks a lot!"
    },
    {
      "id": "m5vw4aj",
      "body": "Last I heard, it is compulsory. Best to meet the internship coordinator and confirm tho."
    }
  ]
}