{
  "id": "1huz6g9",
  "title": "sem 1 ",
  "content": "if i completely fuck up my first sem like suppose i get a really bad gpa like 4 or 5 maybe can i improve my overall gpa if i do well in the other sems \nor will i be totally fucked",
  "metadata": {
    "root_comment_id": "m5p3nop",
    "post_id": "1huz6g9",
    "author": "loser_4ever29",
    "url": "https://www.reddit.com/r/PESU/comments/1huz6g9/sem_1/",
    "permalink": "https://reddit.com/r/PESU/comments/1huz6g9/sem_1/",
    "score": 13,
    "upvote_ratio": 0.8799999952316284,
    "created_utc": 1736170692,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "m5p3nop",
      "body": "Try and lmk"
    },
    {
      "id": "m5p5ccx",
      "body": "Each semester contributes to your overall GPA. Since your first semester has 24 credits, it will contribute to almost 24/160 = 15% of your final GPA. \n\nIf you really want to know *how* much a 4.0 GPA can affect your final GPA, then use the GPA calculator in the FAQs. Enter 4.0 for sem 1 and whatever you wish for sems 2-8.\n└── isn't credit breakdown different for higher sems tho\n    └── It is. But first semester is fixed at 24 and you have 160 total credits, so the fraction of 15% is a constant. If you open the calculator, you'll understand how to use it. You will need to enter the credits per semester.\n        ├── 1st and 2nd sem was 22 for us. Was it 24 for yall?\n        │   └── Yeah tends to change sometimes. Mine was 24 iirc. \n\nEither way, 22-24 credits is still a decent chunk of your final GPA, being between 13.75%-15%. The weightage actually increases a bit if you consider the fact that for placements, only the first 6 semesters' GPA is practically counted.\n        └── I don't mean that, you mentioned use the calculator by assuming gpas for the next 7 semesters after this but we don't know the credits per sem after 1 and 2\n            └── Ask any senior. They will tell you. \n\nUsually 24+24+24+24+24+24+10+6 is a close approximation."
    },
    {
      "id": "m5pfxtg",
      "body": "fuck around and find out"
    },
    {
      "id": "m5pmwxs",
      "body": "First year matters...keep in mind your last year you'll have the least amount of subjects so scoring high gpa is low there from third year. If you mess up first year chances are you'll find a hard time maintaining gpa. Ideal thing is to get above C in all subject to get above 7\n└── How can it be hard...can't it be balanced by 2nd and 3rd year gpa?\n    └── It gets significantly harder to score a higher GPA given that workload and course difficulty increases. There are more details on this in previous posts\n        └── youd have to get 8+ in 2nd n 3rd year. syllabus will gradually get harder"
    },
    {
      "id": "m5q9isj",
      "body": "stop being a loser\\_4ever, get yo act up and come back"
    },
    {
      "id": "m5qfg2z",
      "body": "the normal thumb rule is don't fuck up the early sems cuz the later sems generally fuck you one way or another🙂"
    },
    {
      "id": "m5qg6fj",
      "body": "But... You can't get a 4... Minimum is 5 with an E grade in everything, I think?\n└── The minimum will always be 0 (if you fail every course that is): (4x0 + 4x0 + ... )/(4+4+...) = 0.\n    └── Ah yes i understood that but if the person is talking about \"improving\" gpa he'll need to clear them backs first... And then it'll be 5 i assume"
    }
  ]
}