{
  "id": "1hwibla",
  "title": "WHAT DO I DO??",
  "content": "My rank was over 97xxx in KCET I joined some reputed college for different course, though it wasn’t my first choice. I took things lightly, failed most subjects, and barely managed to pass. Now I realize this course isn’t for me, and I want to pursue CS. I’m thinking of dropping out to prepare for KCET again, but it feels daunting. My score in board was 270, if I start preparing for K-CET now will I be able to get rank under 5-10k? From KCET perspective I have to revise 10-15 chapters out of 50 and the rest I have to study from scratch what do I do?",
  "metadata": {
    "root_comment_id": "m61a94h",
    "post_id": "1hwibla",
    "author": "Individual_Bar7107",
    "url": "https://www.reddit.com/r/PESU/comments/1hwibla/what_do_i_do/",
    "permalink": "https://reddit.com/r/PESU/comments/1hwibla/what_do_i_do/",
    "score": 7,
    "upvote_ratio": 0.7699999809265137,
    "created_utc": 1736336684,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "m61a94h",
      "body": "You should prioritize passing the KCET exam with a good rank first, and then make a decisive choice about dropping out of college.\n└── they are giving so many assignments its impossible to study for kcet"
    },
    {
      "id": "m61c2y0",
      "body": "revising 10-15 chapters and studying 35-40 chapters from scratch for the upcoming kcet and scoring a rank of 5-10k is not realistic tbh (also considering your previous kcet rank)  \nsure you could study for kcet but if you drop out of college and then dont perform in kcet then what?you'll be left with no college  \nSo you need to think about all this before taking a decision (management quota is an option too if you're able to afford)\n└── I blindly ticked my last kcet paper\n\nno i cannot afford\n    └── Boss, if you blindly ticked an exam even after knowing how important it is, there's very little chance you will study for KCET now. So finish your degree wherever you are instead of dropping out of college and randomly marking in the KCET again.\n        └── you have a point i swear to god"
    },
    {
      "id": "m61x95r",
      "body": "nah dude just get a degree and try for placements if you don't get a job then do mtech i know some people who got jobs after graduating from tier-2,3 colleges and then doing mtech in some recognizable college. You can't do both .\n└── ahh shit"
    },
    {
      "id": "m66jlij",
      "body": "Give up,kys"
    },
    {
      "id": "m69r7sj",
      "body": "Pull yourself together whatever you decide to do next."
    }
  ]
}