{
  "id": "1hx8zkm",
  "title": "Canteen guys served us chicken instead of paneer ",
  "content": "\n\n4th floor, EC campus, btw.\n\nWe went early to order food and stood there for 20 minutes despite there being a very small crowd. Finally, the guy showed up with two plates, yelled our token number, said one was paneer and the other gobi, and gave me the paneer. By now, it was already quite crowded, so I just took the plate quickly and exited the crowd.\n\nOne of my friends took a bite of the \"paneer\" and spit it out a few seconds later. She told us it felt like chicken. We are vegetarians, so obviously, we were startled and also confusedm One of our other friends who eats meat tried it and confirmed it indeed was. We went back to the guy and informed him. He was quite rude about it until my friend and I fought with him and showed him the payment on my phone. Only THEN did he apologize and give us the paneer, and then brushed it off as if nothing happened.\n\nI understand there's always a huge crowd, so there must have been some sort of miscommunication. But please be careful while ordering in this canteen (or just any other canteen considering the shitty hygiene).\n\n\n",
  "metadata": {
    "root_comment_id": "m677jhp",
    "post_id": "1hx8zkm",
    "author": "Bulky-Permission-689",
    "url": "https://www.reddit.com/r/PESU/comments/1hx8zkm/canteen_guys_served_us_chicken_instead_of_paneer/",
    "permalink": "https://reddit.com/r/PESU/comments/1hx8zkm/canteen_guys_served_us_chicken_instead_of_paneer/",
    "score": 71,
    "upvote_ratio": 0.949999988079071,
    "created_utc": 1736414233,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "m677jhp",
      "body": "lol sound's scary"
    },
    {
      "id": "m677qr1",
      "body": "The canteen at PES is a perfect example of chaos and negligence, where miscommunication and rude service are served alongside your order."
    },
    {
      "id": "m678wnp",
      "body": "Screw them, too much attitude they have"
    },
    {
      "id": "m67bnst",
      "body": "Also they use the same wok for cooking veg and non veg chinese items.\n└── I am aware, and to be honest, it's a fucking college canteen, so I can't expect them to take the hassle of separate vessels and shit. But I didn't expect them to actually serve us chicken.\n\n.\n    └── That's why I would suggest getting home cooked food, if you're a day scholar."
    },
    {
      "id": "m67kje4",
      "body": "Hate that pigeon infested shithole\n├── At least the pigeons aren't missing\n│   └── U never know if yesterday's pegions are today's pegions lol\n└── Lowkey, I'd catch and eat a pigeon\n    └── Please man the Chinese are already giving us enough viruses, we don't need another one.\n        └── Yeah, but something about stupid birds man. I feel no remorse, ngl I'd roast that shit nice and ARGHH👹👹 that shit up. Ykwim?"
    },
    {
      "id": "m67svcc",
      "body": "Don't go there, come to the OG pixel canteen. The cashier and the other staff are very friendly. Sometimes there'll be a crowd, but you can take food and sit near the basketball court. So peaceful man. Idk why ppl go to 4th floor canteen\n└── Zor zor se logo ko scheme batade"
    },
    {
      "id": "m67uu11",
      "body": "Wtaf. The kitchen in 4th floor is pretty new but what the fuck. I'd be pissed if that happened to me. Just go to APU fam(it's the canteen next to the basketball court). They give food way faster and veg items there are pretty nice as well"
    },
    {
      "id": "m67yak1",
      "body": "I AM pissed man😭 I'm just going to try and avoid canteen food in general."
    },
    {
      "id": "m68yhio",
      "body": "Why doesn't this happen to non vegetarians?\n├── Even if it did , why would someone come here and post it , they'd just happily eat it\n└── I dont fucking know man, maybe it did happen. This post is about slamming the canteen for the shithole it is, not debating veg vs non-veg."
    },
    {
      "id": "m6ckq9p",
      "body": "Lucky u are"
    },
    {
      "id": "m6dba7k",
      "body": "If it's an honest mistake there isn't much you can do ."
    },
    {
      "id": "m6e10rl",
      "body": "4th floor canteen, my friend got a cockroach in his sandwich."
    },
    {
      "id": "m6v80uo",
      "body": "At least you are getting a dead cockroach"
    },
    {
      "id": "m74ulgz",
      "body": "Wow, thanks for this."
    }
  ]
}