{
  "id": "1hxacq1",
  "title": "sgpa and cgpa",
  "content": "is spga and cgpa for first year also dept based or overall , coz classes are mixed, also will they shuffle for next sem (if they do is it dept based like cs aiml ece )  as some teachers say yes some say no and same w subreddits ",
  "metadata": {
    "root_comment_id": "m67jzw2",
    "post_id": "1hxacq1",
    "author": "TopConnect4762",
    "url": "https://www.reddit.com/r/PESU/comments/1hxacq1/sgpa_and_cgpa/",
    "permalink": "https://reddit.com/r/PESU/comments/1hxacq1/sgpa_and_cgpa/",
    "score": 9,
    "upvote_ratio": 0.9200000166893005,
    "created_utc": 1736420358,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "m67jzw2",
      "body": "Sgpa and CGPA are your performance based; Relative grading uf happens will be done for all irrespective of department. \nIn second sem reshuffling happens based on department but there is a chance aiml and CSE being combined in 1-2 sections. Same with other branches.\n└── for example suppose cs students did decent where as many in ece did bad so the grade reduces for both to 85 if at all it does or only for ece\n    └── Yeah for all; But how relative grading happens nobody nows, not even most of the lecturers"
    },
    {
      "id": "m67uxff",
      "body": "1) When in first year, you don't belong to cs dept, aiml dept, ece dept etc. All of you belong to S&H dept and will be graded together. If there's relative grading, it'll apply for everyone in first year, regardless of what department they enter in 2nd year.\n\n2) Only when you enter 2nd year will you be segregated according to your chosen branch, and all your classmates will be from the same branch and the sections will be formed according to alphabetical order of names.\n\n3) Class is shuffled for a total of 2 times.Once after 1st sem (based only on alphabetical order and not branch chosen) and then after 2nd sem as mentioned in point 2). Once you've entered 3rd sem, your classmates are permanent, no more shuffling.\n└── oh so in 2nd sem all depts are again together?\n    └── Yup"
    }
  ]
}