{
  "id": "1hxa22l",
  "title": "Semester 6 Results",
  "content": "How are 6th Sem Results generally ? Are they better than 5th ? I heard they do moderation to boost CGPA because 6th Sem students sit for placements",
  "metadata": {
    "root_comment_id": "m68n2q5",
    "post_id": "1hxa22l",
    "author": "Loud-Experience-8006",
    "url": "https://www.reddit.com/r/PESU/comments/1hxa22l/semester_6_results/",
    "permalink": "https://reddit.com/r/PESU/comments/1hxa22l/semester_6_results/",
    "score": 17,
    "upvote_ratio": 0.9100000262260437,
    "created_utc": 1736419101,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "m68n2q5",
      "body": "> How are 6th Sem Results generally ? Are they better than 5th ? \n\nUsually much worse than 5th lol. It depends a lot on how you do in your electives and in CD, since people tend to perform equivalently well in OOAD and CC. If you have chosen electives which are easy for you, you will do better. Similarly, if you actually do well in CD, it'll boost your grade over others. Irrespective, it's arguably the most hectic semester as well as the toughest in terms of scoring. Most people get their lowest GPA this semester (unless you already had a horrendous semester before)\n\n> I heard they do moderation to boost CGPA because 6th Sem students sit for placements\n\nLol no. There is nothing like that. Remember that PES doesn't owe you placements.\n└── How is TDL Elective in terms of scoring A Grade ? Since its hard they will do moderation right ?\n    └── It depends. No way to deterministically say that they will loosen the grade map. If people do well, it is unlikely.\n        ├── TDL people don't do well generally ! Averages for ISA are pretty low and evaluation policy is strict af. How is TDL as an elective ? Any review ?\n        │   └── I am aware that averages are usually low. But you should know that moderation isn't something that is guaranteed. If it needs to happen, it will happen. No course at PES is by default moderated in grading.\n\nI've always heard generally poor feedback about the course. Too much content covered and concepts aren't covered in depth. Mostly a shallow overview of topics in breadth.\n        │       └── In terms of scoring is it a easy to get A if you put decent efforts ?\n        │           └── Honestly you could say that for every course.\n        │               └── They gave 83 S grade in Data Analytics RR Campus and 85 S Grade in Big Data. Since both are hard electives i expect the same to happen in TDL Elective Semester 6 as its equally hard. Machine Learning for about 90/120 they gave A grade\n        │                   └── Bruh if you're looking for validation, you're not going to get it on reddit. Just work hard knowing it's a difficult course and leave the grading to them. Being in 3rd year, you should know by now that it's not a transparent system.\n        └── I heard CD is the hardest core subject among CC & OOAD   \nAny tips for CC , OOAD AND CD ? How to get A or S grade in CD ? \n\nWill they ask programming in OOAD ISA & ESA ?\n            └── CC - textbook and slides usually enough. Mostly theoretical course\n\nCD - Preet's lecture videos (find the Drive link from some senior). Its the best and only resource you need. I discussed this in a previous comment of mine a few days ago.\n\nOOAD - syllabus changes frequently, ask a current 4th year.\n                └── Can you send Preet Kanwal ma'ams drive link ? She hasn't recorded the AV summaries in PESU Academy it's someother teacher\n                    └── I don't have the link anymore, but I remember it being circulated on discord last year. Search on PESU Discord, you will find it. Or ask there, someone will have it."
    }
  ]
}