{
  "id": "1hy3dj9",
  "title": "ESA ",
  "content": "How to get ESA PYQs? Is our paper corrected by teachers or AI ?? Do we have to pay any fees for re evaluation of ESA paper?? If so , how much ?? For ESA prep some r like u Hv to master every subject , but how do I do that,like from where,what n how to study ???",
  "metadata": {
    "root_comment_id": "m6efut4",
    "post_id": "1hy3dj9",
    "author": "Constant_Ant_6389",
    "url": "https://www.reddit.com/r/PESU/comments/1hy3dj9/esa/",
    "permalink": "https://reddit.com/r/PESU/comments/1hy3dj9/esa/",
    "score": 6,
    "upvote_ratio": 1,
    "created_utc": 1736512293,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "m6efut4",
      "body": "> How to get ESA PYQs?\n\nLibrary website. Check previously asked questions on this subreddit. You can find it on library.pes.edu\n\n> Is our paper corrected by teachers or AI ?\n\nI am not sure. Probably some current senior student can answer this. \n\n> Do we have to pay any fees for re evaluation of ESA paper?? If so , how much ?? \n\nYes. There is a separate cost for viewing your paper and a separate cost for rechecking your paper. If I remember it used to be ₹500 to view, ₹2000 to recheck. I could be mistaken of the values. \n\n> For ESA prep some r like u Hv to master every subject , but how do I do that,like from where,what n how to study ?\n\nYes, fairly accurate. ESAs are usually not as straightforward as the ISAs. They tend to be much harder with tougher and longer questions which often involve application of concepts. Which means that unless you are fundamentally clear with the topics and have a thorough understanding of them, it will be a challenge for you. \n\nYou have to be clear with what you are learning. Except for courses that are theory based, just rote-memorisation will not get you good scores. Practice questions from wherever you can (including the prescribed textbook for the courses) and definitely practice PYQs from the last 4 years at the very least (remember to check for syllabus changes).\n├── But we havent received the credentials for pesu library yet...\n│   ├── Bro just see youtube videos that's how we used to study om last night before exam\n│   │   └── Yeah got it but how do get access to the pyq on PESU library?\n│   │       └── Ask librarian Subhash and he will guide\n│   └── Hmm I think they use your PESU academy credentials, I could be wrong through.\n├── Understood tqsm ☺\n└── Esa papers are corrected by teachers.\nIn case of revaluation, to review a paper it's 100rs and for rechecking it's 1000rs."
    }
  ]
}