{
  "id": "1hy4pr5",
  "title": "Cutoff for cnr and mrd",
  "content": "What was the cutoff for cnr and mrd last year? , if possible can anyone predict what itd be this year wrt btech chem cycle",
  "metadata": {
    "root_comment_id": "m6f67hk",
    "post_id": "1hy4pr5",
    "author": "luna_2521",
    "url": "https://www.reddit.com/r/PESU/comments/1hy4pr5/cutoff_for_cnr_and_mrd/",
    "permalink": "https://reddit.com/r/PESU/comments/1hy4pr5/cutoff_for_cnr_and_mrd/",
    "score": 6,
    "upvote_ratio": 0.800000011920929,
    "created_utc": 1736516736,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "m6f67hk",
      "body": "I'm a fresher and even I'm annoyed of these repeated questions just search the subreddit even once before posting and there's a goddamn FAQs section\n└── i checked, im not talking about the gpa to qualify which is 8.5 and 9, most of the posts dont have proper clarity on \"cutoff\" which took place last year and if they do they dont specify chem or phy cycle, if you found a post with accurate information please link it cuz i seem to have missed it"
    },
    {
      "id": "m6gp4yy",
      "body": "Cutoffs cannot be predicted since it depends on how your batch performs. They take the top x% of your batch. If your batch has done well, the cutoff increases. \n\nScoring an 8.75+ is usually enough.\n└── Is an exact 8.75 enough?🫠"
    },
    {
      "id": "m6jbbzh",
      "body": "Previous batch chem cycle \nMRD - 9.6\nCNR - around 9.1 or 9.2\n├── thankyou!\n└── EC or RR?\n    └── RR\n        └── Okay so EC cutoffs will be lower"
    },
    {
      "id": "m6oekdq",
      "body": "Those things are subjected to a lot of change jus forget about it it depends on your batches performance too, one thing is for sure to even cnr you need 8.5 so fuckin try studying than asking shit questions, I just feel like the 2024-2028 batch is kinda retarded\n├── https://preview.redd.it/s9eki8br9xce1.png?width=500&format=png&auto=webp&s=05472b9285dddcdfbe0f16b9e6a57e9d9a8be987\n\nthis was you one year ago stfu\n├── you're really making assumptions about an entire batch based on bs. Maybe if you focused more on your own studying instead of throwing around judgment, you’d have the success you're aiming for and wouldnt whine around to strangers on the internet about how \"IM LOSING MONEY ON MY ZOMATO STOCKS PLEASE HELP ME\". Just saying\n└── https://preview.redd.it/0vq5hzebcxce1.png?width=1518&format=png&auto=webp&s=9b5e80e297b5562a21af9da5468253a58af15edb\n\nthe AUDACITY to shame someone else for asking a question youve asked plenty of times, are all seniors downies like you?"
    }
  ]
}