{
  "id": "1hy8huh",
  "title": "is re-val legit?",
  "content": "last sem esa i had given a subject for re-evaluation because i was convinced that i deserved a better grade but later i got a notification saying no change in grade\n\nmy esa results came out earlier this week and i’ve been considering giving it for reevaluation but is it even legit even cuz they’re charging us for it anyways and i don’t even know if they recheck the paper or not\nwhat do you guys think",
  "metadata": {
    "root_comment_id": "m6feexp",
    "post_id": "1hy8huh",
    "author": "SignalHoneydew982",
    "url": "https://www.reddit.com/r/PESU/comments/1hy8huh/is_reval_legit/",
    "permalink": "https://reddit.com/r/PESU/comments/1hy8huh/is_reval_legit/",
    "score": 18,
    "upvote_ratio": 0.9599999785423279,
    "created_utc": 1736527011,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "m6feexp",
      "body": "I gave a paper for re evaluation last sem and got a grade change. The money was only refunded like 6 months later though.\n\nThey Def suck at correction sometimes, and it might even be on purpose because they love to find new ways to make money. In the paper I gave for re Eval, these fucks had given a direct 0 for an answer that I had bubbled and written perfectly. This has happened to few of my friends too.\n├── i never got my money back : (( i applied and changed from A->S   \nstill nothing ...anyone i can contact?\n│   └── go to your coe and check maybe (but i haven’t heard about anybody getting their money back after a successful reeval)\n│       └── U get ur money back 70% if I am correct. Takes several months tho\n│           └── Thanks a lot!\n└── Wait you get your money back? I was just happy with the grade change coupled with my low expectations from college, I didn't even read the fine print to know they give money back. Fuck me...\n    └── I paid 1k and got 750 back."
    },
    {
      "id": "m6gq1dh",
      "body": "It's legit but not transparent unfortunately. \n\nMy friends and I have gotten our grade increased through re-eval. Unfortunately there's not much info you get if your grade doesn't increase, and neither can you view it again. I wish there was a way they could show you your paper after the re-evaluation too. \n\nAs for the money, yeah it takes a long time for a refund.\n└── Ideally I expect they show us the papers for free like how they show for ISAs by just calling us one day in the summer or next semester. Do we really need to pay to see our own answer scripts?"
    }
  ]
}