{
  "id": "1hypdmu",
  "title": "Isa vs Esa",
  "content": "Which one is tougher and why",
  "metadata": {
    "root_comment_id": "m6jcbxm",
    "post_id": "1hypdmu",
    "author": "prospectus__5262",
    "url": "https://www.reddit.com/r/PESU/comments/1hypdmu/isa_vs_esa/",
    "permalink": "https://reddit.com/r/PESU/comments/1hypdmu/isa_vs_esa/",
    "score": 5,
    "upvote_ratio": 0.6499999761581421,
    "created_utc": 1736574652,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "m6jcbxm",
      "body": "Depends on subj, no definite answer\n├── Mechanics and maths say\n│   └── mechanics isa easier, maths esa easier\n│       ├── Thank you bro\n│       └── seriously? maths esa easier than isa?\n│           ├── Yeah they ask straight from CW problems\n│           └── Yea because you will get marks for writing the steps and formulas\n└── Wt about mechanical\n    └── harder than isa, random ass qs\n        ├── Man even isa has random ass qs but Okay is 77-78 in esa achievable?\n        └── And what about eee and physics?"
    },
    {
      "id": "m6jfmnf",
      "body": "ESA is like the final boss, even if you use kryptonite you can defeat him. So ISA is your leverage point, with which you can get a better average in your subject."
    },
    {
      "id": "m6jfqnt",
      "body": "ISA and ESA have a different pattern.\n\nIf ISA is CBT, there can be any type of questions, MCQs, multiple correct options and fill in the blanks (rarely), there are chances that you can lose marks, one silly mistake will cut off the entire marks for that question, but if it is a subjective type of test, you have a chance to attempt the question, thereby assuring you some marks, even if you are wrong at the end.\n\nFor ESA, it is a different case, it depends on the subject, we had a tough paper for C in the first year and DSA in the second year, but it was the story two years ago. It is subjective, and the above logic for subjective papers still holds here."
    },
    {
      "id": "m6jhj7w",
      "body": "Stop asking shit questions, like the 2024-2028 what's wrong with you guys\n├── Which batch are you?\n├── why do you guys act like someone who gets hurt everytime there's a post for discussion? like thats the whole point of reddit\n└── What's got you so heated"
    },
    {
      "id": "m74sy3u",
      "body": "More weightage is given to ESA. If you pass in your ISAs + assignment combined then ESA can boost your GPA. If you do bad in ISAs then u need to score well in ESA."
    }
  ]
}