{
  "id": "1i2ctlr",
  "title": "Is this true?",
  "content": "If yes what's the separate rank list he's talking about, and where can I get info on that.",
  "metadata": {
    "root_comment_id": "m7dfkor",
    "post_id": "1i2ctlr",
    "author": "Emotional_Support_1",
    "url": "https://i.redd.it/prc2mpvu79de1.png",
    "permalink": "https://reddit.com/r/PESU/comments/1i2ctlr/is_this_true/",
    "score": 28,
    "upvote_ratio": 0.9700000286102295,
    "created_utc": 1736988921,
    "flair": "PESSAT/Admission",
    "nsfw": false
  },
  "comments": [
    {
      "id": "m7dfkor",
      "body": "*I don't mean the pessat thing I know it's cancelled from this year"
    },
    {
      "id": "m7e86cy",
      "body": "There is no separate rank list as far as I heard. Only JEE, KCET and management.\n└── how much does management cost and whats the process?\n    ├── a car or a 2 bhk\n    │   └── oh nvm\n\nitne mein toh germany mein ho jayega\n    │       └── for 50 lakhs?   \ni doubt lol.\n    │           └── 50lakhs is just fees no for pes? you'll also have to pay for hostel and stuff\n\nso it could cover like 3/4th of a bachelors in germany(obv not poora degree)\n    ├── Hey mate my parents booked for cs it's coming to total 48 for four years\n    │   └── 48 including hostel and misc costs or just fees?\n\nalso how did you book, any contact no?\n    │       └── Just fees I think no hostel cuz I already live in blr,\nParents went to pes and spoke with the admission office... I could get a number but it's better if you go speak irl once.\nNows a good time ull still have seats before high demand and panic\n    │           └── I think you're speaking of the high fee category, not management. The high fee category still has some bare minimum requirements on grades in school, but it is a reduced number.\n    │               ├── Whats the difference?\n    │               ├── No , its 12L per year for CS , if you get it this early atleast it's this much , maybe they increase later on\n    │               └── higher fee quota and management are the same, there is no different thing, they just refer to management quota as higher fee quota sometimes\n    ├── 4 lakhs but check on the official website for the course you're applying to.\n    │   └── its 12 now lol   \njee quota will be 5\n    │       └── For Biotech it was 4 for management.\n    │           └── oh ok, since ur a graduate i assumed u told the CSE management fee from a long time back or smth.\n    └── 12 per year for cse and 7 per year for ece  \nyou can contact them for the process   \nif i am not wrong u need 80%+ in pcm for a seat.\n        └── 12L for both pes rr and ec campus?? Or is it different for ec campus?\n            └── its not different lol."
    },
    {
      "id": "m7e8mvj",
      "body": "pesu is now on comedk too\n└── they removed that category from their website (which showed that the admission will also be from COMEDK from this year), so maybe not\n    └── 😲"
    },
    {
      "id": "m7hqcf4",
      "body": "Why did they forfeit Pessat I'll never get.\n└── jee will give a much higher number of people access to PES, jee quota will lead  to much higher student quality.   \nalso some people don't trust pvt entrance exams, cause they think they are rigged and stuff, but jee would make it transparent.\n    └── I found Pessat way easier than JEE. And how would there not be transparency? Its an online exam with invigilators who circulate.\n        └── its not about it being easier or harder, in competitive exams the difficulty of the paper wont matter as everyone writes same paper.   \nPESSAT is a pvt exam, god knows how they even do the normalization and grading ( not saying PES does manipulation, just saying the can if they want to) , u kind of just have to trust ehm, they could very much scam us if they want to, just sell of those seats instead.   \nJEE is gov exam and the gold standard for engineering.   \nIf anything goes wrong with jee (like neet scandal), nobody will blame PES, since its the governments fault.   \nThe switch to JEE is honestly perfect.   \nthe cse cutoff for jee will be at least 96%, but through PESSAT even kids who got like 85% in mains can get in thru PESSAT (it has much less competition, mainly people from blr writing it).\n            └── You have a point. But Honestly it might make it tougher for students to get in relatively speaking.\n                └── It should be academically tougher to get in, better students will get selected this way.   \nAnd jee would make it convenient too, as its one less exam to write now."
    },
    {
      "id": "m7ie6wn",
      "body": "Cheerio"
    },
    {
      "id": "m7sodgu",
      "body": "If cutoffs are insanely low through mains consider pes doomed"
    }
  ]
}