{
  "id": "1i4c0wd",
  "title": "What is the expected cutoff for cse in PES now that pessat will no longer be conducted?",
  "content": "The post older than 8 months shared the cutoff being 98 percentile for cse via jee mains but back then PESSAT was also being held. What could be the cutoff for cse now? Shiksha mentions that candidates can get in through jee and kcet. KCET being for the people of Karnataka ofc. Would be helpful if someone could provide an expected cutoff for cse.",
  "metadata": {
    "root_comment_id": "m7tvnz2",
    "post_id": "1i4c0wd",
    "author": "Tryzmo",
    "url": "https://www.reddit.com/r/PESU/comments/1i4c0wd/what_is_the_expected_cutoff_for_cse_in_pes_now/",
    "permalink": "https://reddit.com/r/PESU/comments/1i4c0wd/what_is_the_expected_cutoff_for_cse_in_pes_now/",
    "score": 6,
    "upvote_ratio": 0.8799999952316284,
    "created_utc": 1737219922,
    "flair": "PESSAT/Admission",
    "nsfw": false
  },
  "comments": [
    {
      "id": "m7tvnz2",
      "body": "Expected is 97+, defo cant go lower than that\n└── cap my friend got at 93 ,EC campus\n    ├── I doubt if it'll go that less for rr\n    │   └── No idea about RR ,But this isn't iit dude ,96-97 would be my guess for RR\n    │       └── Are you a fresher? I want you to come to my class and ask my classmates about their percentiles. I know this aint IIT, but none of my classmates scored less than 97.5-98 in JEE\n    │           └── No ,Just lurking and having PESU as last backup ,No need to get defensive ,Good luck\n    └── Which year ? Ig not this year .. and if it's this year how to see if I cleared it\n        └── This year but it was in EAC or something\n            ├── yeah then further rounds will be there .. but ig PES EC is just not worth those 5 lakhs .. its my last option after VIT Chennai CSe and Comedk if i clear it ..\n            │   └── PES is decent ,Honestly better than VIT if you're getting cat 3 4 5 ,Cat 1 ,2 vellore is better\n            └── Will I get ece for 91 percentile??"
    },
    {
      "id": "m7u4urm",
      "body": "Wild guess its 95 for cse\n└── How much did you score to get in?\n    ├── i got in thru pessat , your scores arent revealed tho so i dont know how much i scored   \nplus im not in cse life sucks 😢😢😢\n    └── in JEE?"
    },
    {
      "id": "m7uag91",
      "body": "I believe it should be closer to jee advance cutoff so maybe 94-96%ile"
    },
    {
      "id": "m7xut0q",
      "body": "since number of jee quota seats has increased cutoff will prolly fall, i will take a wild guess of 97%ile.  \nits just a guess nobody can tell for sure. Aim for 98%ile just to be safe. \n\nIt was nearly 99 before tho."
    },
    {
      "id": "m7y0hvl",
      "body": "12 or 14 lakh people had written Jee mains in 2024 and I got 95 percentile. I had the option to take CSE at either RR campus or EC campus by paying 3.73 lakhs per year. But I finally got into CSE at EC campus through KCET.\nSo yea, last year even at 95 percentile people could get CSE. Idk if there r any reservations for specific categories cuz I belong to General merit.\n├── Was home state quota playing any role in that 95 percentile selection? Moreover, there's this 8 months old post in which a guy states that he knows someone with 98 percentile in jee mains who got cse here. Don't know the campus tho. Which campus is better would you say? RR or EC?\n│   └── I don't think PES has home state quota cuz atleast half of the seats are reserved for KCET students and uk that only Karnataka state's students are eligible for that. If they keep Home state quota for JEE too then it's kinda unfair.\nWell, I'm a freshman at EC campus so I have a lot to explore and know before I can say which campus is better. But it's harder to get into RR campus than EC campus through KCET and more events and hackathons happen at RR campus than EC campus.\n│       └── But what did you mean by you had the option to cse at both campuses by paying 3.73 lakhs but you took admission via kcet?\n│           └── So I wanted to apply for pessat but I found out that there was a jee mains quota too. When I gave all my JEE mains details, I got the fee information and which branches I could join. I saw the fee and said f*** off and left it there. Later my cet results came out and I got into PES (CSE) for a fee lesser than 1/3 of the fee of the Jee quota\n│               ├── Soz atleast your cutoff was clear for cse at both branches at 95 percentile in jee, right? And since now, there isn't any pessat happening, could I expect some waiver in fees?\n│               │   └── I don't remember there being different cutoffs for RR and EC campus honestly (I may be wrong). Someone who actually joined through the JEE mains quota might know things clearly cuz I left the process half way. But this year I think the cutoff system will surely be different.\nNot sure about the fees waiver part tho\n│               └── May I know your cet rank beta?\n└── Hi, this is a parent. R u really sure that last year even 95 percentile guy got cse in rr campus? I really want to know this. Pls help"
    }
  ]
}