{
  "id": "1i511tq",
  "title": "gpa doubt",
  "content": "i coudnt find this in faq but since 5 credit courses are out of 120 so 90+ after 120 is reduced to 100 right ? like is that the right way of calculation , for example if i got 38 and 33 in cs and full in assignment and lab so total is (16.25+19+10+20)=65.25 and for S grade we need 90+ so 109-65.25=43.75 which means \\*2 which is 87.5 in ESA?",
  "metadata": {
    "root_comment_id": "m7zvfm5",
    "post_id": "1i511tq",
    "author": "TopConnect4762",
    "url": "https://www.reddit.com/r/PESU/comments/1i511tq/gpa_doubt/",
    "permalink": "https://reddit.com/r/PESU/comments/1i511tq/gpa_doubt/",
    "score": 10,
    "upvote_ratio": 1,
    "created_utc": 1737300797,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "m7zvfm5",
      "body": "You are given a score out of 120, say 115/120. This is then reduced to 100 (i.e 96/100). Your grade is calculated with this reduced score, giving you an S grade in this case.\nThe 2 credit course you're talking about is a minor course ?\n├── 2 credit ones like evs and consti\n│   ├── Damn have they made EVS and const also 2 creds for us it was 1 credit ?\n│   │   ├── Yes\n│   │   └── even mechanical became 4 credit\n│   │       └── Why did this shit bcome 4 cred man i hate this sub 😭😭😭\n│   └── Ohhh those were 1 credit for us. Yeah they count for your main CGPA. Both EVS and constitution are very scoring, in fact for constitution all the questions for both ISA and ESA come straight out of the question bank.Try getting an S grade in those to boost your GPA.\n│       └── do you know whats S grade for them? or how much to get\n│           └── You have 2 ISA's for 30 marks each, this 60 is reduced down to 50 and your ESA is another 50. Once you have a score out of 100, your grade is calculated like any other subject.\n├── No evs and constitution are of 2 credits from this year\n└── also can the marks for per grade go up if a batch does good in all for example this time python ig everyone did well so 95 for S grade type or in general can it go up as well? also esa do they give review and tell us marks or just the grades\n    └── Nah it never goes up in PES, only goes down for relative grading to help more people pass. \nU rly think everyone did well in python? Those bio kids seem to be suffering."
    },
    {
      "id": "m8v9ye2",
      "body": "did u ask anyone , if ur calculation was right?"
    }
  ]
}