{
  "id": "1i524k5",
  "title": "How to give a missed ISA?(Due to medical reason)",
  "content": "Hey seniors of PES RR, i wanna know whether i can give a missed isa where im marked absent for not coming, I have legit doctor's medical regarding my high migraine and fever, will they allow me to re-appear for the isa?",
  "metadata": {
    "root_comment_id": "m80373a",
    "post_id": "1i524k5",
    "author": "Puzzleheaded_Meal891",
    "url": "https://www.reddit.com/r/PESU/comments/1i524k5/how_to_give_a_missed_isadue_to_medical_reason/",
    "permalink": "https://reddit.com/r/PESU/comments/1i524k5/how_to_give_a_missed_isadue_to_medical_reason/",
    "score": 4,
    "upvote_ratio": 0.8299999833106995,
    "created_utc": 1737303599,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "m80373a",
      "body": "Give the medical certificate to the coe they will increase the weightage of your esa to 70 you cannot retake your isa"
    },
    {
      "id": "m803o18",
      "body": "go talk to ur assigned mentor and give them ur medicial certificate, theyll tell you what to do, the same had happened to me. ull basically hv to submit a letter to chairperson and coe. theyll increase esa weightage and manage the grade, dw."
    },
    {
      "id": "m80vcnh",
      "body": "they won’t let you rewrite \ni faced the same problem cuz i got covid during my first sem ISA and they did NOT give a shit\nthey’ll just change the weightage and your ESA will have more weightage compared to others\n0/10 NOT RECOMMENDED \nDONT MISS YOUR ISAs GUYS!!!\n└── How is it 0/10 if they’re increasing the weightage of esa from 50 to 70?\n    └── 0/10 for the experience not the marks distribution LMFAO"
    },
    {
      "id": "m85ar84",
      "body": "You cannot re-write an ISA. Submit a medical certificate and a letter addressed to your HOD and to the head of COE. A larger percentage of ESA will be considered for your final grade."
    },
    {
      "id": "m8blhbb",
      "body": "It will be counted as missed only. Make up in ESA."
    }
  ]
}