{
  "id": "1i85s6i",
  "title": "Lengthy Answer",
  "content": "If the answer is lengthy and continues onto the next page, can we write it on the following page while keeping the same bubble?",
  "metadata": {
    "root_comment_id": "m8qiul2",
    "post_id": "1i85s6i",
    "author": "AdFirst3371",
    "url": "https://www.reddit.com/r/PESU/comments/1i85s6i/lengthy_answer/",
    "permalink": "https://reddit.com/r/PESU/comments/1i85s6i/lengthy_answer/",
    "score": 6,
    "upvote_ratio": 0.8799999952316284,
    "created_utc": 1737645820,
    "flair": "Study Help :table:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "m8qiul2",
      "body": "I'm pretty sure u could even write in a different page as long u bubble it correctly\n└── Can we bubble again in next page\n    ├── Yes\n    └── You must bubble on the next page too"
    },
    {
      "id": "m8qkoby",
      "body": "Like you bubbled only the first page and continued the answer without bubbling the following? If that's the case , I had asked to sune teachers , sune days is okay but sune days to submit a letter to S&H dept\n├── I've been doing that since my very first exams here. It'll be considered dw\n└── You need to bubble all your pages otherwise those pages might not get counted."
    },
    {
      "id": "m8qob07",
      "body": "What happen i found it wrong and wants to answer in another page. Do I need to cross the bubble\n├── Cross the bubble and also cross the whole page.\n└── Cross the whole page."
    },
    {
      "id": "m8qptiw",
      "body": "If you want to continue bubble the same question number in the next page and continue writing."
    },
    {
      "id": "m8r6tq3",
      "body": "i was told no need to bubble\n└── My invigilators have told me the opposite.\n    └── bro what, im cooked then  \ni didnt do that in isa 2 but it still got counted in reval\n        └── Just my experience. If it did for you great"
    },
    {
      "id": "m8wzkxv",
      "body": "OhhhFFFF!\n I haven't mentioned question number on the paper but I have bubbled it!!\nIS THAT OKAY??\nTHE ANSWER WILL BE CONSIDERED RIGHT????\nF MANNNNNN\n└── Yea it will dw"
    },
    {
      "id": "m9nw0lm",
      "body": "You can take as many pages as you want. Just remember to bubble the question correctly. Also note you only get that booklet to write your answers."
    }
  ]
}