{
  "id": "1iaasx7",
  "title": "How is BBA at PES rr campus?",
  "content": "is there anything i should know before i pay the seat blocking fee? how is the faculty, placements. is there too much stress?",
  "metadata": {
    "root_comment_id": "m996cna",
    "post_id": "1iaasx7",
    "author": "aparnaaas",
    "url": "https://www.reddit.com/r/PESU/comments/1iaasx7/how_is_bba_at_pes_rr_campus/",
    "permalink": "https://reddit.com/r/PESU/comments/1iaasx7/how_is_bba_at_pes_rr_campus/",
    "score": 6,
    "upvote_ratio": 1,
    "created_utc": 1737885971,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "m996cna",
      "body": "💩overall feedback \nAlthough degree is just a name sake \nIf u wanna do do it with cheap money y to waste"
    },
    {
      "id": "m9anjsd",
      "body": "BBA is PES University is a joke, people already have no respect for the degree as it is and they make it worse\n\nWe have to wear a disgusting uniform and we are the ONLY course that has to do so. Honestly it really creates an inferior complex and makes us feel lesser than. \n\nApart from that, they have the worse possible of crowd of people. People can barely speak English and shame you if you don’t know how to speak Kannada, they’re not inclusive. \n\nPES admits literally anyone into this course, the quality of people is terrible.\n\nMy interview while being admitted into the college for example, was less than 30 seconds long. They asked me maybe two questions and the interview was over. They will admit literally anyone regardless of how incompetent they are. \n\nAnd I don’t think I need to mentions all the suicides. \n\n\n\nEveryone smokes and drinks their days away. People come to class literally reeking of alcohol and they had to have multiple bag checks DURING CLASS to see if anyone is in position of substances. \n\n\n\nThe classes are three hours long. EVERY subject is three hours long and we have multiple subjects a day. It’s so draining and by the end of it we are exhausted. \n\n\n\nThe teachers are so unreasonable, they don’t allow you to even look right or left or they constantly use attendance against you.\n\nYou could breathe too loud and they'd take away your attendance. \n\n\n\nThey also blindly admit PES Alumni as teachers even if they CANNOT teach. I’ve come across probably the worst set of teachers ever and they barely can keep a group of college students engaged. \n\n\n\nALSO 50 BUCKS A DAY FOR PARKING???\n└── damn is it that bad?😭 but how are placements and exams?\n    └── Hi, i am planning for my son for BBA at PES . I could not see the first comment. Why do you mention is it that bad. Pls advice"
    }
  ]
}