{
  "id": "1ibcwz2",
  "title": "im so sorry im a bit confused",
  "content": "math- 37  \npython- 42  \nmech-40  \nchem- 45  \nepd- 45.25  \ncons- 24  \nthese are my avgs in each subject. I fucked up my esas so far im barely expected 80+ in each if i am lucky. What are my chances at mrd scholarship? No post has mentioned the cut offs for mrd. And how do i include constitution in the gpa calculator, im so confused.",
  "metadata": {
    "root_comment_id": "m9h3bqe",
    "post_id": "1ibcwz2",
    "author": "Icy-Sprinkles682",
    "url": "https://www.reddit.com/r/PESU/comments/1ibcwz2/im_so_sorry_im_a_bit_confused/",
    "permalink": "https://reddit.com/r/PESU/comments/1ibcwz2/im_so_sorry_im_a_bit_confused/",
    "score": 7,
    "upvote_ratio": 0.7699999809265137,
    "created_utc": 1737994700,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "m9h3bqe",
      "body": "MRD doesn't really have a cutoff, it's just the top 5% of people in the batch, a safe bet imo is above 9.2\n\nTo add consti in the GPA calculator just add it as another course in Table 1 and put the grade you're expecting in consti, for constitution they take ISA1+ISA2, reduce it to out of 50 and then add 50 from the ESA paper.\n└── \\*Table 2. not 1\n\nAdding more info for OP - you can do either of these:\n\n1. Since the split up for const/evs is 50-50 for ISA+ESA, you will need to add another entry below Table 2 and add entries for ISA and a custom formula for calculating total score (look it up, its pretty easy). \n\n2. Calculate the final score manually for const/evs and add it under total score and include the credits. \n\nOnce you do either, the GPA should update. Here is an example using the 2nd approach:\n\nhttps://preview.redd.it/zrsddjt2fkfe1.png?width=1126&format=png&auto=webp&s=80da371657918fe66557767e664223d53f59f5b7\n\nAs you can see, I only added the total marks (80) and credits (2) for const, the rest was calculated automatically.\n    ├── Where did u get this calculator pls share the link I've been searching for this shit for the past 4 months\n    │   ├── I made it. \n\nYou can find it on the FAQs. Check the GPA related question.\n    │   │   └── Does it calculate the total and assign grades in backend after entering ISA and assignment marks?\nQuite awesome in excel :)\n    │   │       └── Yes, the Google sheet is linked to a GApps Script which has 2 functions. Each function has a hash table which converts marks to grade and grade to grade point respectively. If you hover over the first row of the columns that automatically compute values, you'll be able to see the function calls and their arguments. Once you make a copy of the sheet to your Drive, you'll be able to also access the script and play around with it. \n\nAnd thanks. The reason I made it on sheets is because it's (1) easily and freely accessible without needing to make a website and host, (2) easily customisable for specific needs (like calculating evs/const grade) and (3) it's transparent, so you can see the calculations being performed and you can verify them manually too. \n\nMore on GApps Script if you're interested: https://developers.google.com/apps-script\n    │   │           ├── Oh damn! Thanks for sharing. Definitely gonna make something using GApps Script. \n\nI too made a gpa calc specifically for 1st year but it can't be modified, will redo it for modifications and usable for every semesters. Thankyou for the idea.\n    │   │           └── Mr rowlet owl \nHow could you even reply to each and every post, also with detailed explanation in each and every fkin comments tooo.\nI really appreciate your efforts\n    │   │               └── ![gif](giphy|9EDHvl8L5WbbTDJG3N)\n\nFriendly neighbourhood rowlet at your service\n    │   └── U can use [this](https://gpa-evaluator.vercel.app/), easy to understand and use, and by 2nd year ig everyone knows how to calculate gpa.\n    ├── Are assignment marks added out of 10? Suppose Maths assignment marks are out of 20 how will they be calculated?\n    │   └── Scale it.\n    ├── I added it in Table 1 giving it a name and my expected grade, that worked pretty well\n    │   └── That would work if you already have an expected grade. I think OP is trying to calculate the grade itself.\n    │       └── I misunderstood the requirements, I thought OP already had a grade in mind\n    └── Bro but this table does not include the lab component marks of chem/phy and cs... it consists of 20 marks\n        └── The calculator is a *tool* which *you* are expected to tinker around with and use. You shouldn't expect everything to be spoonfed.\n\nYou know how much it will be scaled out of 100, do it yourself on the calculator after following the steps above.\n            └── Yes Sir!"
    }
  ]
}