{
  "id": "1ichhxx",
  "title": "CGPA for Masters Abroad",
  "content": "What's a good cgpa for getting into good universities abroad like CMU, USC, NYU etc? And what's the bare minimum cgpa I need to maintain for going abroad? Seniors, do you know anyone who has gotten into good universities like CMU with a cgpa of 7.5-8.5?",
  "metadata": {
    "root_comment_id": "m9qshw5",
    "post_id": "1ichhxx",
    "author": "dick_swagger69420",
    "url": "https://www.reddit.com/r/PESU/comments/1ichhxx/cgpa_for_masters_abroad/",
    "permalink": "https://reddit.com/r/PESU/comments/1ichhxx/cgpa_for_masters_abroad/",
    "score": 13,
    "upvote_ratio": 0.9300000071525574,
    "created_utc": 1738111876,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "m9qshw5",
      "body": "A 9+ is pretty much the standard requirement for the unis you mentioned, except NYU. The unis you mentioned usually get applications from students with 9+. It's unlikely you'll find someone with <9 getting an admit from PESU and similar ranked colleges. Generally speaking, the higher the GPA the better, but I've seen people go abroad with low 8 CGPA as well. There are people with 8.3-8.5 at top unis, but you should know that usually these are exceptions and not the norm. \n\nHere is a more detailed discussion from a few weeks ago from this very subreddit:\n├── Will your gpa matter if you do masters after working for a few years??\n│   └── Your GPA will *always* matter. As I said in the linked comment, GPA is the primary deciding factor. Everything else just adds to your profile to complement it, not compensate or replace it.\n│       └── cgpa matter for different colleges right , it is easy to score cgpa in other clgs in banglore where is it is hard in clg like rv and pes   \nthen candidate from 9 from other clg   \nor 8 from pes / rv   \nwho will be considered\n│           └── You didn't read the linked comment, did you? Its literally the 3rd sentence.\n├── How is life , brother?\n│   └── I'm good, Masters is hectic but fun too.\n│       └── Ohh nicc, where u doing yo msc?\n│           └── NYU Courant\n│               └── yo genuine question, don't take it in a bad way, but what made you proceed with masters in general? I don't really understand the reasons for masters in USA becoming so common. The pay is much better but wouldn't the cost of living negate that eventually and tuition isn't cheap too. Or is it something like having a degree from a reputed clg there and returning to India would help in the job market? Just wanted to get your thoughts :)\n│                   └── My goal isn't a job (although yes that's one of my secondary goals). So my reason would be different from most people going for MS. \n\nI love studying what I'm passionate about, and I'm interested in research. I eventually have plans of pursuing a PhD and building a career in academia. The reason I'm pursuing a Master's (and a research-oriented one) is to prepare myself for a PhD, build a stronger profile, gain good research experience and publications, network with researchers/advisors I want to work with and become a better researcher. \n\nThese opportunities are far lesser in India and most of the cutting-edge research in my field is happening here in the US, along with the people I want to work with on my research interests. So it was a straightforward decision for me. \n\nI agree with the costs being super high (especially at private schools in expensive cities like NYU). But I guess it's eventually something people are willing to work towards because the final outcome makes things worth it. \n\nSpeaking from a purely job related perspective, as you said, the end pay, standard and quality of living, among other factors, makes it worth it.\n├── Would u know about NTU for MS (Criteria and all)?\n│   └── Sorry, did not look into it. No clue.\n├── what preferential treatment for IITs?\n│   └── The more recognisable the uni to admission committees, the better your chances of securing an admit with a slightly lower GPA. 8.5 from IIT = 9.2+ from PESU.\n│       └── are projects necessary for admission to foreign programs? If I'm from IIT, is the college name enough to carry me through admissions?\n│           └── Yes, absolutely. College name will not get you through admissions. As I said: it only acts to boost/lift your GPA compared to others. CGPA is just used as a filter to get through to subsequent reviews of your profile; you still need a solid profile: projects, research/industry experience, GPA+GRE+TOEFL scores, well-crafted SOP, strong LORs etc. Having the IIT brand and nothing else to show will only ensure that your application is reviewed. You do not get an easy ride just because of your IIT tag because of the simple reason that there are students from T2 and lower colleges who have 9+ CGPAs and exemplary profiles to add to it (check the number of kids at CMU/UCLA/UCSD/NYU and the like from PES/RV/Manipal etc).\n\nAdmissions are still a *mostly* holistic process. All unis look at 100% of your profile, its just that CGPA takes up 60% of it. CGPA and college reputation are important, but they are not everything. The rest of your profile will decide how the decision goes once all the objective parameters are removed. People get into top programs from T2 colleges and lower all the time, and people from IITs/T1 get rejected from top programs because they do not have anything else all the time too. Goes both ways.\n│               └── oh damn ok   \nthanks a lot man\n└── I got into a highly ranked business program on a scholarship with no work experience and a CGPA <8. It all depends on how you tell your story\n    └── Okay, I should've been more specific. I'm referring to MSCS and CS-adjacent programs. There is significantly more competition here with such GPAs being the norm"
    },
    {
      "id": "m9ub153",
      "body": "I have a GPA of 8.4 Can I make it to Columbia MS Data Science or Carnegie Mellon MS Data Science   \nNYU MS Datascience   \nGRE Score of 325"
    },
    {
      "id": "m9v7un9",
      "body": "Assuming you have 8+, but less than 8.5+. Also talking about MSCS unless mentioned.   \n  \n\\* CMU is difficult, unless you aim for their MISM program which is a little less selective. 8.5 is on the lower end but definitely a acceptable CGPA for that specific program. \n\n\\* USC is highly GPA-centric and most people who get in have 9+.\n\n\\* NYU Tandon  is achievable with that GPA. If it's on the lower end(closer to 8), you're likely gonna be redirected and asked to study their Computer Engineering course instead. But NYU Tandon and even some of the MS programs in Stern are an okay fit(Stern courses aren't two years long though, so be careful). Courant is close to impossible unless you have good publications. \n\nIdeal GPA is a 9+ for USA and Europe. USA is more holistic and Europe solely looks at grades and fit with respect to your undergraduate coursework.\n└── Is Columbia MS Data science possible with 8.5 ?"
    },
    {
      "id": "macrtxz",
      "body": "is 8.7 enough for a normal tier 2.5 clg"
    }
  ]
}