{
  "id": "1icrzvw",
  "title": "Reattempting passed subjects to improve GPA",
  "content": "\n\nCan someone verify what I’ve heard, that it's possible to reattempt passed subjects along with backlog exams, and if we score better, the new grade replaces the old one in our GPA. Is this actually working?? Can I rewrite a subject in the upcoming summer break?? \nCan someone please help me with this\n",
  "metadata": {
    "root_comment_id": "m9t4xzh",
    "post_id": "1icrzvw",
    "author": "Low_File905",
    "url": "https://www.reddit.com/r/PESU/comments/1icrzvw/reattempting_passed_subjects_to_improve_gpa/",
    "permalink": "https://reddit.com/r/PESU/comments/1icrzvw/reattempting_passed_subjects_to_improve_gpa/",
    "score": 5,
    "upvote_ratio": 0.8600000143051147,
    "created_utc": 1738151305,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "m9t4xzh",
      "body": "You cannot rewrite a subject if you have passed it. You can only give a re exam if you have a backlog\n└── So there is no other way, other than getting good grades in the current and coming semester to improve the CGPA??\n    ├── It used to be there pre-Covid from what I have heard\n    │   ├── Ahh shit mann\nThen I'm screwed fr!!\n    │   └── Nope, wasn't there pre-COVID either. Once you pass a course, the grade is final.\n    │       └── do we have gap between exam during backlog\n    │           ├── Not entirely sure about this. Usually there's a backlog exam timetable that's released. Maybe ask on discord\n    │           └── It depends lol. Sometimes its chill otherwise its back to back. But this you'll not know till they release the time table.\n    └── Just do really well in the future sems, your first sem gpa might be bad but you have opportunities to improve so utilise it well\n        ├── Nahh bro I'm in 4th sem now,\nAnd so low is my gpa\nEven if I try really hard I might just go past 7.75 - 8 by the end of 8 semesters\n\nAnd heard that there will not be much in 7th and 8th semesters\n        │   └── 7th+8th combined have only 20 credits. By 6th semester, your final GPA will be CGPA ± 0.25 at best.\n        │       └── Ohh ohkk bro thanks\n        └── Also does anyone know how taking minor courses work in the matter of gpa and grades??"
    },
    {
      "id": "m9tdy70",
      "body": "Out of context.., \nCan anyone say how taking minor courses work in the matter of gpa and grades??\n└── A minor degree will only add to your Minor CGPA, not the Major. They are calculated independently.\n    ├── Ohh they are separate....\nHow does that even matter?? Like what if we don't take any minor courses\n    │   └── You should read the FAQs. Take up a Minor degree only if you're interested in the Minor branch or it is relevant to your career prospects.\n    │       └── Ohkk.... Thanks bro\n    └── I heard that if you do bad in minors it will affect your gpa.\n        └── It'll affect your Minor GPA. They're separate GPAs."
    },
    {
      "id": "mbanzz3",
      "body": "I also had that problem but never got a proper answer."
    }
  ]
}