{
  "id": "1icv44c",
  "title": "When will they announce scholarship cutoff for sem 3",
  "content": "",
  "metadata": {
    "root_comment_id": "m9ttkbx",
    "post_id": "1icv44c",
    "author": "Hour-Still2441",
    "url": "https://www.reddit.com/r/PESU/comments/1icv44c/when_will_they_announce_scholarship_cutoff_for/",
    "permalink": "https://reddit.com/r/PESU/comments/1icv44c/when_will_they_announce_scholarship_cutoff_for/",
    "score": 10,
    "upvote_ratio": 0.9200000166893005,
    "created_utc": 1738161264,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "m9ttkbx",
      "body": "Generally 1st or 2nd week of February\n└── Hi..If I’m aiming for MRD in 3rd and 4th sem, do my 1st and 2nd sem GPAs count? They’re in the 7.5–8 range, so am I already cooked or still in the game?"
    },
    {
      "id": "m9ulp9l",
      "body": "Isn’t the cutoff fixed ? I mean 8.5 for cnr and 9 for mrd\n├── No\n└── That's the minimum cutoff for them."
    },
    {
      "id": "m9y42p9",
      "body": "What's the highest cutoff that has ever been for cnr ??\n├── Sem 1 8.67  \nSem 2 8.95\n\nSem 3 8.5   \nSem 4 8.5   \nBatch of 2026 Stats\n│   ├── Isn't 8.95 a bit too high 💀\n│   └── Do u have any idea how much inflated SGPAs really were in sem 2 for 2026 batch. Cause many people got good SGPAs this sem also, any type of estimate will help\n│       └── It was very inflated !! They gave literally one extra grade in Math Sem 2 and even C Programming Others were relative except Electrical  \nYou can expect this Semester 3 and Semester 5 cutoff to be 9 this time\n└── Hi..If I’m aiming for MRD in 3rd and 4th sem, do my 1st and 2nd sem GPAs count? They’re in the 7.5–8 range, so am I already cooked or still in the game?\n    └── Yeah you’re cooked buddy. No way you’re getting that 50% back. Assuming you have 8 in both sem 1 and sem 2 (which you don’t), even if you score perfect 10 in both sems to get your CGPA to 9.04 even then you won’t get the MRD scholarship. You can aim for CNR tho since it’s on the basis of SGPA and not CGPA. If u score a sgpa 8.6-8.7, you should be fine but there have been some exceptional cases (like the sem when I asked this question) the cutoff was 8.83 and it was even 9 for some seniors… so according to other people’s performance it varies but in normal scenarios, 8.6-8.7 or anything above it will get your CNR\n        └── Yeah, cooked is right.. I kinda knew MRD was out of reach, but was still hoping for a miracle. Thanks for the clarity though, I’ll aim for CNR then. "
    }
  ]
}