{
  "id": "1idjwrn",
  "title": "So doomed",
  "content": "My sem 1 ( phy cycle) esas went like shit so shit. I'm so so scared that i might get a backlog in one or two subjects.My total score( isa1+isa2+assignment) is above 20 for 3 subjects and above 30 for 2 subjects and that's really so shitty. I'm already going through a lot mentally which was the main reason i couldn't do my best and literally just studied one day before exams. Getting a backlog will just make things worse and idk how I'll handle that. So I wanna know if esas corrections are actually really strict? And if I get a backlog will it in anyway affect me during placements?",
  "metadata": {
    "root_comment_id": "m9zlkr1",
    "post_id": "1idjwrn",
    "author": "Lost-Step-8395",
    "url": "https://www.reddit.com/r/PESU/comments/1idjwrn/so_doomed/",
    "permalink": "https://reddit.com/r/PESU/comments/1idjwrn/so_doomed/",
    "score": 24,
    "upvote_ratio": 0.9700000286102295,
    "created_utc": 1738232177,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "m9zlkr1",
      "body": "Hey bro, I don't really have answers for the placements and all that but just don't worry about the past now, it's all done, work on getting better and doing better next sem and get some help for your mental health"
    },
    {
      "id": "m9zwt4h",
      "body": "I don't think so you'll get a backlog see you just need 10 to 20 marks to pass like for that you need 40marks out of 100..given your isa marks you mightve done well"
    },
    {
      "id": "ma02yv7",
      "body": "Check my old comments for ESA corrections. They are usually standard: neither lenient, nor strict. If you have any active backlogs before the 7th sem, you will be ineligible for placements. Once you clear them, you will be eligible again."
    },
    {
      "id": "mb5evmw",
      "body": "It'll be fine. Just focus on the upcoming semesters. Don't get below C and the gpa will be good. Otherwise the gpa will stall around 6."
    }
  ]
}