{
  "id": "1ifqj6l",
  "title": "interview by pes university for BCOM ACCA",
  "content": "I am still studying in 12th and to join the pes university I have an interview tomorrow. I have selected [B.COM](http://B.COM) ACCA. What are the expected questions they might ask me? Please seniors help me out.",
  "metadata": {
    "root_comment_id": "maii7qw",
    "post_id": "1ifqj6l",
    "author": "Perfect_Review_2788",
    "url": "https://www.reddit.com/r/PESU/comments/1ifqj6l/interview_by_pes_university_for_bcom_acca/",
    "permalink": "https://reddit.com/r/PESU/comments/1ifqj6l/interview_by_pes_university_for_bcom_acca/",
    "score": 5,
    "upvote_ratio": 1,
    "created_utc": 1738475344,
    "flair": "ANNOUNCEMENT :snoo:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "maii7qw",
      "body": "There are no like expected questions just know your 11th and 12th, atleast in my experience they just asked me the 11th and 12th basic to moderately difficulty questions.\n└── is it like accounts and business basics?\n    └── As I had taken SEBA I was asked a mix of economics business and accounting\n        ├── oh ok thanks\n        └── Bro can you tell me what kind of questions they asked you? I am planning to join bba data analytics course in that university and i also studied SEBA in 12th, what are your suggestions for passing that interview? Should I have to revise all 11th and 12th std subjects?\n            └── As BBA is a different department than bcom I'm not really sure what they might ask.\n                └── Alright bro and also when you were enrolling in that college, what did they asked you? How did you prepare for the interview?\n                    └── They asked me a mix of accountancy question( entries for debentures, financial statements (example: what happens when a company changes its depreciation method or what happens when there is a a change in a certain aspect of the balance sheet) economics ( supply and demand questions, LDMU) and business and stats I don't really remember. I just revised my 11th and 12th grade basics ( focus on more of the basics as that really helped me answer my interview questions) and ya the general journals rules and what each statement does.\n\nDISCLAIMER: ( this was asked for the bcom acca interview to me, Do not expect the same questions in other departments because depending of the stream ( for you bba analytics) they maybe more technical in the stats part. So take this reply with a grain of salt ( these are only the questions I was asked and the questions asked for others were simpler and more difficult from what I was asked)\n                        └── Thanks man, really appreciate it\n                            └── Welcome and all the best for your interview."
    },
    {
      "id": "maj2993",
      "body": "Learn to use proper flairs from next time"
    },
    {
      "id": "majczk6",
      "body": "U have already wasted 100 rs by registering please don't waste 1.5 lakh\n└── what? how?"
    },
    {
      "id": "majhtw1",
      "body": "The Dept is flexing in notice board with 6 lpa offer that to only one student.\n└── so are you telling me not to do acca in pes?"
    },
    {
      "id": "mak0qcf",
      "body": "Bcom acca is actually a v bad option to do in pes. The last 4 papers, which are most important to clear to get the ACCA certification, is not taught in pes. This was the case in 2022 dk what's the situation now. Please talk to current batch students and make a choice.\n└── ok thankyou"
    }
  ]
}