{
  "id": "1iftij0",
  "title": "Wanted to know about the university",
  "content": "Can anyone tell me about the university is it good ? I am expecting 90-92 percentile in jee mains , can I get admission into cs ? Can anyone tell me the details like placement, internship, college life , girl boy ratio , everything is appreciated! Also how is the food ?",
  "metadata": {
    "root_comment_id": "maj2ner",
    "post_id": "1iftij0",
    "author": "gabbar-views",
    "url": "https://www.reddit.com/r/PESU/comments/1iftij0/wanted_to_know_about_the_university/",
    "permalink": "https://reddit.com/r/PESU/comments/1iftij0/wanted_to_know_about_the_university/",
    "score": 10,
    "upvote_ratio": 0.9200000166893005,
    "created_utc": 1738487844,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "maj2ner",
      "body": "Hey bro if you are not joining through kcet it's not worth it. If through jee you get some sort of reservation and scholarship then maybe it's ok.. else don't join here genuinely \n├── you arent even a student lmao who are you to decide that go study for boards or sumn \n\nbut shit aside its a great college but it is academically hectic pessat/jee fees is a lil extra tbh but i wont say it doesnt become worth it only because of that you get great placements, college life isnt really  that great but its not even that bad as long as you have your friends its all chill girl boy ratio is suprisingly kinda high and placement internships is prolly one of the best in bangalore so keep it as a proper option when considering colleges but be ready to be academically challenged\n├── i think u meant the opposite\n│   └── Typo my bad\n└── I disagree. PES is doing way better than almost all other private colleges in south India in terms of placements. The management, although strict, is very focused on growing the brand name and hopefully pes will do much better in the coming years. But I do agree the fees are now exhorbitant\n    └── I agree with placement but the return on investment is less because of high fees. Just my opinion there is no point paying high fees and continuing rat race. "
    },
    {
      "id": "maj6p7k",
      "body": "\n\n\n\n>90-92 percentile in jee mains\n\nBruh, PES isn't that good, I accept, but it isn't Tier 3 to get admission at 90 percentile😭\n└── What percentile is required then ?\n    └── 96-97"
    },
    {
      "id": "maj8jpm",
      "body": "How do you plan on getting admission? Jee or kcet?\n└── Not sure bro ! \nCan u tell me a little bit abt how to proceed with kcet ? It is all a little new to me\n    └── If you are not a student from karnataka, you can't take the KCET exam."
    },
    {
      "id": "mak1rnl",
      "body": "Honestly, not worth it, especially not worth it if you're joining PES University other than through KCET considering the fees is too high, with that high fees, you'd be better off studying abroad. If fees isn't the issue though, then if you are really good in academics, then this college can be rewarding, but being good here in academics is again a very challenging and difficult thing to do considering quality of teachers here. I didn't have any college life here so I can't comment much about that, but people say it's generally not good. Girl boy ratio here depends on the branch you select and I think CS branch has the best (closest) girl boy ratio of probably 2 : 3, about the canteens, they are quite crowded and there have been posts in this very subreddit of people finding insects in their food."
    },
    {
      "id": "mak2hpo",
      "body": "There's a detailed pros and cons list on the FAQs of this sub. Check it out if you need more info than what's already here."
    },
    {
      "id": "makkii6",
      "body": "If u don't have to break the bank for the fees join off, be ready for \"hard academics\", its not been crazy hard or anything for me in sem 1, higher sems are kind of cooked it seems.   \n  \nidt u will get cs at 92%ile, maybe mech in RR or ECE in EC campus, still try tho, u never know.   \nGender ratio is prolly is like 2:1   \nI heard food in the EC campus hostel is ok as far as hostel food goes.   \n  \nNgl the college has been quite fun, the clubs have been real cool. Maaya fest was mad fun.   \ntaking part in the hackathons was quite enjoyable.   \n\n\nOne good thing is the peers, plenty of mad smart folk, doing some or the other project, like making a game and stuff like that.  \n Seniors here are goated tho, The seniors are prolly the best thing in the college they come in clutch and help with everything, many helpful seniors around that are just a message away on discord, reddit or WhatsApp.  \n\nRR campus infra is rly good tho. \n\nDownsides- \n\n* A bit too much crowed, especially in RR. In EC the cafeterias are wayy to crowded, remaining areas crowed is not bad.  \n* Exams are quite a bit harder then other colleges like BMS or RVCE\n* EC infra is not up to the mark, heavy rains cause like a foot deep water logging on the road, building was find tho\n* Not all are proff are that great but that's kind of true for most Indian colleges atp\n\nsidenote: idk why people say its not worth it, cause it rly depends on person to person."
    }
  ]
}