{
  "id": "1ignix0",
  "title": "Why not pes",
  "content": "I read the pros and cons in the faqs and it had a lot of cons for branches other than cs. I am yet to give my kcet examination and hoping to get into pes CS branch thru kcet, if yall dont reccomend pes then what are some other colleges you guys would suggest? I am having difficulty deciding between colleges, please help.",
  "metadata": {
    "root_comment_id": "maqj5v6",
    "post_id": "1ignix0",
    "author": "Falcon7890",
    "url": "https://www.reddit.com/r/PESU/comments/1ignix0/why_not_pes/",
    "permalink": "https://reddit.com/r/PESU/comments/1ignix0/why_not_pes/",
    "score": 0,
    "upvote_ratio": 0.4000000059604645,
    "created_utc": 1738584188,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "maqj5v6",
      "body": "Rvce, mit manipal  these two are good for almost all branches afaik\n├── thank you\n├── Mit taking admissions through kcet? Where did u hear that from? I'm in Mit and have never heard abt this\n│   └── Karnataka has a new law from this year  that all ug colleges should take admissions through kcet/comedk  and cannot conduct their own private exams from this year\nThis is also the reason why pessat has been discontinued\n│       └── I think mit is excluded from this as it has some kind of minority college status. Not sure tho don't take my word for it\n│           └── yeah , no way mit will agree to take kcet seats, they are some special category clg only\n├── Nah MIT conduct their own exam MET and they already started applications for it\n│   └── Then try your best for rvce \nIf you have money for mit then mit\n└── Nah not mit moneypal"
    },
    {
      "id": "mavoae2",
      "body": "Bro if you get CSE at PES through KCET or any exam , there's absolutely no reason you SHOULDN'T take it. Unless you've got a confirmed seat at an IIT,NIT or BITS or something , there aren't any cons in PES. Yes , make sure to read the Cons regarding other branches too but don't believe everything you see on reddit. A lot of 'trash-talk' about the college is very opinion based and one-sided and you'll find trash-talk of this level in literally any college ( from IIT's to tier-100 colleges ). \n\nWhat you should focus on right now is trying for other exams tho , don't restrict yourself to only PES or RV before writing your exams."
    }
  ]
}