{
  "id": "1ijc5am",
  "title": "MRD scholarship.",
  "content": "How is mrd scholarship students short listed?? Are they the one who gets more than 9cpga? ",
  "metadata": {
    "root_comment_id": "mbctaof",
    "post_id": "1ijc5am",
    "author": "Marathonofthoughts",
    "url": "https://www.reddit.com/r/PESU/comments/1ijc5am/mrd_scholarship/",
    "permalink": "https://reddit.com/r/PESU/comments/1ijc5am/mrd_scholarship/",
    "score": 18,
    "upvote_ratio": 1,
    "created_utc": 1738872816,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "mbctaof",
      "body": "Bro it's the top 5% of students, 8.5 is the cutoff to quality and then it's the top 5 students out of all the ones who got 8.5+ in the batch\n└── So like if 3 people get 10sgpa. Would the one who get 9.85will still be eligible for mrd?"
    },
    {
      "id": "mbeo5yx",
      "body": "CNR - Cutoff 8.5 SGPA - Top 20% based on SGPA\n\nMRD - Cutoff 9 CGPA - Top 5% based on CGPA\n\nFor the first sem SGPA == CGPA\n├── Oh wow so for mrd cgpa is taken whereas for cnr sgpa is considered?\n│   └── Yep\n└── btw all the students who get MRD wont be counted for CNR right, so assuming enough people meet the cutoffs, 25% of the students get scholarship?\n    ├── yes\n    └── Yes it seems the top 5% of CGPA holders are first filtered out and then top 20% are taken"
    },
    {
      "id": "mbf6cfm",
      "body": "Usually mrd for c cycle is 9.6+ p cycle is 9.36+ for 1st sem. After 2nd sem it is cgpa based so 9.4+ was cutoff overall after 1st year. Now in CSE, 9.53cgpa is mrd cutoff\n├── so 8.8+sgpa is a safe bet for cnr? in phy cycle\n│   └── Yes it is, last time it was 8.6+\n│       └── ok thankss\n├── Wait so mrd and cnr are awarded for both sems?\nI thought cnr is given for both 1st and 2nd sem \nWhereas mrd is given for the cgpa resulted from both the sems\n│   └── Mrd/cnr/dac is given for every sem with your sgpa for cnr and cgpa for mrd (cgpa=sgpa for first sem)\n│       └── What if a person gets mrd both the sems of a year \nThen 100% of the fees is given back?\n│           └── 😭😭😭😭no\nMrd for one semester = 25% of ur annual fees\nSo mrd both sems means you get 50% refund of your annual fees\nSuppose u pay 4.5L per year\nIt means u pay 2.25L per sem\nSo if u get MRD u get 50% of sem fees back, so 1.125L you get it back.\n│               └── Okay yeah makes sense i thought mrd is 50% of annual fees mb\n│                   └── It is if you get it for the 2 sems in a year\n│                       └── Yeah\n└── Bro what if the 5% of CGPA holders also come under the Top 20% of SGPA holders. Then will Top 25% of SGPA holders be considered for CNR Scholarships or is it still top 20% only?\n    └── After the top 5% cgpa is filtered out of the pool, then the top 20% of that pool is filtered for sgpa\n        └── Yess got it"
    },
    {
      "id": "mbolafk",
      "body": "When will they announce the scholarship? \n\nDo they inform only eligible students or do they publish the list for everyone to see? \n\nFor 1st sem students who got scholarship will there be a refund of fees deposited for 2nd sem (or annual) as the fees deposited at the beginning of the year was annual?\n└── The scholarship is already emailed to the eligible students i think.\n    └── It can’t be as so far only provisional results are declared\n        └── My friends got the email though saying that congratulations you have cnr scholarship something like that\n            └── Whats his gpa?\n                └── Somewhere around 9.85\n                    └── He will defo get mrd with that gpa lol\n                        └── Na the rest got 10😬\n                            └── Which cycle is he from bro, in p cycle there aren't many who got 10\n                                └── Ah not engg!"
    }
  ]
}