{
  "id": "1ijuhza",
  "title": "Am I cooked?",
  "content": "I got 7.4sgpa in p cycle and I have selected ece branch, I have heard it's very hard score in ece so am I cooked can I atleast end up with 8+ end up by 6th sem?",
  "metadata": {
    "root_comment_id": "mbh0to5",
    "post_id": "1ijuhza",
    "author": "Bruks123",
    "url": "https://www.reddit.com/r/PESU/comments/1ijuhza/am_i_cooked/",
    "permalink": "https://reddit.com/r/PESU/comments/1ijuhza/am_i_cooked/",
    "score": 9,
    "upvote_ratio": 0.9100000262260437,
    "created_utc": 1738933427,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "mbh0to5",
      "body": "You will dw, you have nothing to worry about, you'll do just fine, 3rd year ece is easy\n└── That's a bit assuring but any placement?💀😭\n    ├── In ECE? /s\n    │   ├── 😭\n    │   └── For a ECE student to get placed in a tier 1 company.. one has to Master DSA + Learn computer fundamentals + have 2-3 good projects.. isnt this what any CS student have to do apart from the course curriculum to get a job and which can be done by an ECE student? What other advantage does a CS student have when it comes to placement?\n    │       └── The fact that they're in CS and a company would rather pick a CS grad who has exposure to the tools/code the company is hiring for through their experiences/projects/curriculum over an ECE grad who mostly wouldn't have the same. \n\nCheck the FAQs, this has been discussed in detail.\n    └── no placements in ECE, do CSE Minor courses else u can forget about a job /s\n        └── For a ECE student to get placed in a tier 1 company.. one has to Master DSA + Learn computer fundamentals + have 2-3 good projects.. isnt this what any CS student have to do apart from the course curriculum and which can be done by an ECE student? What other advantage does a CS student have when it comes to placement?\n            └── Don't cross comment, its already answered above."
    },
    {
      "id": "mbi1vhf",
      "body": "Yes, you are charred my fella....."
    }
  ]
}