{
  "id": "1ilqcqo",
  "title": "Research Opportunities at PES",
  "content": "How's the scenario with the research opportunities here. And, how to reach out to the professors regarding this and from where and how to pick up a domain. Also, does it have any CGPA criteria or anybody who's willing to do is fine. \nBtw, second year CSE student here.",
  "metadata": {
    "root_comment_id": "mbz2uci",
    "post_id": "1ilqcqo",
    "author": "ToastedTaco_11",
    "url": "https://www.reddit.com/r/PESU/comments/1ilqcqo/research_opportunities_at_pes/",
    "permalink": "https://reddit.com/r/PESU/comments/1ilqcqo/research_opportunities_at_pes/",
    "score": 8,
    "upvote_ratio": 0.9100000262260437,
    "created_utc": 1739138099,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "mbz2uci",
      "body": "The Role of Empathy in Moral Choices: Why Do People Make Sacrifices for Others?  \n[https://docs.google.com/forms/d/e/1FAIpQLScFacN\\_Tuw1o6SAsRPuZZfzU20TvItvRtXcxMFJPhnKBuxdmQ/viewform?usp=header](https://docs.google.com/forms/d/e/1FAIpQLScFacN_Tuw1o6SAsRPuZZfzU20TvItvRtXcxMFJPhnKBuxdmQ/viewform?usp=header)\n\nHello! I'm Praeksha, a BSc. Psychology student, and I would really appreciate it if you could take some time out of your day to answer this survey for a research paper I'm working on. Please take the survey only if you belong to Gen X or Gen Z and circulate it around on other groups as well.\n\nThank you! Here's a little token of gratitude 🍪"
    },
    {
      "id": "meu5jex",
      "body": "It's better than most.\nResearch at PES is a good way to start, but as someone who did it and then did a proper research PhD and now trying to grow in my field I understand where the institute is messing up.\nFirstly most profs aren't trained in doing research. Given that they don't get dedicated labs or research time it's not really a priority for the institute. But due to NIRF ranking they do push for Scopus papers.\n\nIs it ideal ? No, Is it good? Sort of, it's better than nothing.\n\nBut I'll tell you where It helps, I cracked a top tier institute cause I knew what to do in terms of research the basic stuff formatting, literature coding related to it etc. I learned most of it thankfully to a cousin who was a PhD student but I did get some stuff waived from internship requirements cause I did get that paper in Scopus which btw pre Covid used to be a big deal for in year 3.\n\nI have worked (and am still working) with PES students on some research and I can tell you that they are better than most when they have time. 😅The later part was due to the high amount of activities they don't usually get much time for research except a few people.\n\nBut it's really good to see people asking about research 🙌, feel free to ask if you need any help in it."
    }
  ]
}