{
  "id": "1inmnl3",
  "title": "Yall want crazy8 ideas?",
  "content": "",
  "metadata": {
    "root_comment_id": "mcc5hxg",
    "post_id": "1inmnl3",
    "author": "Terrible-Section9841",
    "url": "https://i.redd.it/lcn48hkk8oie1.jpeg",
    "permalink": "https://reddit.com/r/PESU/comments/1inmnl3/yall_want_crazy8_ideas/",
    "score": 58,
    "upvote_ratio": 0.9300000071525574,
    "created_utc": 1739350007,
    "flair": "Meme :snoo_dealwithit:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "mcc5hxg",
      "body": "crazy indeed"
    },
    {
      "id": "mcc5uxy",
      "body": "Human computer interaction?\n├── I would say elon musk potential\n└── Great ideas"
    },
    {
      "id": "mccbh0c",
      "body": "That dumbass nitin pujari asked for it?\n├── yeah lol\n└── not just ur prof, it's happening in every class\n    └── It's all nitins idea though\n        └── oh ok what a b\\*tch"
    },
    {
      "id": "mcccsez",
      "body": "Crazy fr"
    },
    {
      "id": "mccdu7h",
      "body": "Predict gambling odds"
    },
    {
      "id": "mccf4bp",
      "body": "Input : your birthday\n\noutput: all crimes committed on that day and the most famous criminal born that day\n\nsounds like a crazy and feasible idea to me"
    },
    {
      "id": "mcdfmz0",
      "body": "What's this for, give some context lol\n├── apparently to come up with a new idea (inspired by cmu) and google does it\n└── Cs lab staff asked us to write 8 crazy ideas we can think of using \"C\" and then they sorted us into  groups of 4 people randomly and asked us to complete one project out of the 32 projects by the end of the sem. I think they are making us ready for capstone as i heard here and there that some or more seniors are doing some bs projects and are claiming it to be their capstone project or not having motivation to do it. Or they might be cooking something and are experimenting on us.\nOr they might earn off of us if we make something cool 😂\n    └── But i strongly think they will start making us ready to capstone from this sem\n        └── Yeah thats what i wanted to say this is 100% likely to be true"
    },
    {
      "id": "mcij0ft",
      "body": "Crazy8? I thought Walter white got him"
    },
    {
      "id": "mcxqubz",
      "body": "niggas after 2nd sem cse"
    }
  ]
}