{
  "id": "1inny7q",
  "title": "Maths Backlog",
  "content": "I have gotten a Backlog in maths-1, and i am planning to take it up after sem 2 ends , what should be my plan of approch\n\nShould I go talk a teacher about this ,if yes which one \n\nI have learnt from my mistakes , can anyone tell me the best method to clear it while also maintaining a good sgpa for this sem, \n\n",
  "metadata": {
    "root_comment_id": "mcchdsg",
    "post_id": "1inny7q",
    "author": "Euphoric-Paint8317",
    "url": "https://www.reddit.com/r/PESU/comments/1inny7q/maths_backlog/",
    "permalink": "https://reddit.com/r/PESU/comments/1inny7q/maths_backlog/",
    "score": 9,
    "upvote_ratio": 0.9100000262260437,
    "created_utc": 1739355926,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "mcchdsg",
      "body": "thank the lords I somehow passed , I for one thought for sure i was failing in math-1 , i wrote questions and came for exam , i even fcked up my isa's , i genuinely have no idea how i passed , ig its a mistake lmaoo\n└── did anyone ask?"
    },
    {
      "id": "mcdlo5a",
      "body": "T.R.Geeta will be willing to help. Her office in in F block"
    },
    {
      "id": "mci4c5p",
      "body": "My advice to you is study up and clear it as soon as possible, otherwise it will prevent you from doing anything you actually want to. It's gonna always be on the back of your mind and the more time goes by the more afraid you become to face it. Maths 1 is a difficult subject and you need to earn 40 marks minimum in the esa to clear it. If you are confused by the previous statement, when you get a backlog in a subject your isa and assignment marks become null and void, so you need to earn 40 marks through the ESA directly. Go to geetha ma'am and she will give you notes. Ask her for assistance and study up, you won't have time to study much later on. Best Of Luck and be brave and prepare to work hard, and most importantly don't postpone it."
    }
  ]
}