{
  "id": "1ioiw2n",
  "title": "Project Ideas",
  "content": "I desperately want a good project for my resume , So i need some ideas .Preferably MERN  \nalso i kinda wanna include pre trained ai models into my project .  \nso is there any idea that i can work on , I researched yt , but modt of them were same old projects .",
  "metadata": {
    "root_comment_id": "mcjodu9",
    "post_id": "1ioiw2n",
    "author": "Radiant-Contract-460",
    "url": "https://www.reddit.com/r/PESU/comments/1ioiw2n/project_ideas/",
    "permalink": "https://reddit.com/r/PESU/comments/1ioiw2n/project_ideas/",
    "score": 6,
    "upvote_ratio": 0.8799999952316284,
    "created_utc": 1739452867,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "mcjodu9",
      "body": "Yes someone please answer this. How \"unique\" is good enough to attract the interviewer. Every tom dick and dickless has the same mern stack crud project, is it better to not even include it? Is it better to have more os type low level projects?\n\nAnother point i also hear from people is that they don't want to hire people who doo too niche extra stuff. They're just looking for another decently smart guy wholl get stuff done. And for that, the usual projects are probably better. \n\nApparently you get questions like \"you have 9+ gpa, and seem to be interested in research. How can we know you won't ditch us for an ms in a year\"\n\nIt seems somewhat reasonable but is it true? \n\nAnd can anyone with experience in this tell me some examples of projects in both these categories."
    },
    {
      "id": "md0um9b",
      "body": "It depends on your profile, however I would recommend to choose a project you can do in a time frame. Like if you need something in 4 months for final year placement do a course and a project with it.\n\nHowever if you are not in 6th semester, then I would recommend not to rush for a project which you can do in 1-2 months with minimum efforts. Cause that can be replicated by anyone with a youtube video and gpt. Doesn't show you added value or learned much. However if you are in 6th semester then you gotta replicate a youtube video. I know some areas and such videos, if you need something specific then you can mention your area.\n\nOr if you want to go in depth and make some value then that's a different discussion."
    }
  ]
}