{
  "id": "1ioka69",
  "title": "Just feeling straight up suicidal",
  "content": "Academics are so overwhelming, Every day just passes by without me feeling a single ounce of happiness. Have friends for name sake but they probably won't even care if I kill myself tomorrow XD. Home feels anything but home. Parents probably want me out asap. Lost contact with my old friends. Had little to no friends to begin with. Life just feels hopeless right now. I just feel numb everyday. Every morning feels bad and I just wanna sleep. Is there anything I can do to feel better or is this how I'm gonna feel throughout.",
  "metadata": {
    "root_comment_id": "mck0r7m",
    "post_id": "1ioka69",
    "author": "Maybewtfwtf",
    "url": "https://www.reddit.com/r/PESU/comments/1ioka69/just_feeling_straight_up_suicidal/",
    "permalink": "https://reddit.com/r/PESU/comments/1ioka69/just_feeling_straight_up_suicidal/",
    "score": 107,
    "upvote_ratio": 0.9800000190734863,
    "created_utc": 1739457065,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "mck0r7m",
      "body": "Hey man, I’m really sorry you’re feeling this way. I know things feel overwhelming right now, and it probably seems like nothing’s going to get better, but please know that you’re not alone in this. It sucks to feel like no one cares, but trust me, there are people who do,even if it doesn’t feel that way at the moment. Sometimes, our minds convince us that we don’t matter, but that’s just the pain talking. You do matter. More than you know.I know academics, friendships, and home life can feel like a lot, especially when it all piles up. But this isn’t how life will always be. There are better days ahead, even if you can’t see them right now. Please don’t keep this all to yourself,talk to someone, even if it’s just a small step. A friend, a professor, your mentor,someone who can listen.If you’re feeling really low, please reach out to someone who can help\n\nVandrevala Foundation – 1860 266 2345  \nSnehi – 91-9582208181  \niCall – +91 9152987821\n\nYou’re not alone in this. You’re stronger than you think, and you will get through this. Please stay. ❤️\n└── No my friends don't care, there's literally no one I can call right now and cry to. Life just seems meaningless right now\n    └── I missed this post and I'm not sure what you posted, but I did kind of infer you're the OP from your post/comment history. \n\nJust want to say that my DMs are open in case you (or anyone else reading this) would like to vent/rant/open up about something. I know I'm not in college anymore, I might not be able to 100% relate to everything or help, but I can listen and share my views and opinions if asked. I'm your senior, and I went through the same school-college-job phase not too long ago. You can open up about whatever is on your mind and I can assure you anonymity because neither of us know each other. \n\nI lost someone dear to me to s*icide way back in school, and the guilt of not being there for them at their lowest haunts me even now. \n\nJust hold on. Life is beautiful and full of hope and meaning. Tough times always pass and time heals everything. You got this, I believe in you and everyone else struggling with something right now."
    },
    {
      "id": "mck0y1w",
      "body": "I'm really sorry you're feeling this way,  It takes a lot of courage to understand and talk about what you're going through.\n\nAcademics can be super stressful, but your mental health comes first. Try breaking tasks into smaller chunks and give yourself a pat on the back for each one you get done. Don't hesitate to ask for help from teachers or academic advisors—they're there to support you. You will probably able to find some teachers who are more understanding and kind in pes so talk to them if you feel comfortable. \n\nI know it might feel like your friends don't care, but real connections can make a world of difference. Reach out to someone who's been there for you before, or try finding new friends in clubs or places with similar interests, do not lose hope the best people enter your lives at the most unexpected times! \n\nIf you're open to it, consider chatting with a counselor or therapist—they're there to help you \n\nYou will always be loved more than you realise so do not ever think you do not matter.As a person who has gone through this before, here is what I figured out you matter. Even if it doesn't feel like it right now. Life can be tough, but there are brighter days ahead and there is always light at the end of the tunnel. Please give yourself the chance to see them. \n\nTake care, and don't hesitate to reach out for help. You're stronger than you think, and there are people who care about you."
    },
    {
      "id": "mck1g2c",
      "body": "Yo studies can feel overwhelming, but they’re not everything—there’s much more to do on and off campus. Maybe try joining a club, meeting new people, or even hitting the gym (It’s surprisingly fun). If that’s not your thing, yoga or chess could be a chill way to stay engaged and find like-minded people. Just ease into a routine—study for a bit when you're back in your room, but don’t let it take over your life. There’s plenty of time to figure things out, so go easy on yourself but don't get distracted at the same time. Also never consider what you mentioned in the post, it's not the approach you should take to life. There's way too many things you haven't experienced yet.\n└── Are there any clubs still open?\n    └── u can try next sem  \nactually try PESU IO course, they are held every sem apparently, a lot of people ik made friends there."
    },
    {
      "id": "mck1jak",
      "body": "Just know that It will get better , There is always light at the end of the tunnel , Your future self will look back at these times , things will always get better :))"
    },
    {
      "id": "mck3i1u",
      "body": "Just get good sleep during night , grind during the day , set a time table to do stuff in particular timeslot, work on yourself, your health , academics.. it'll all be fine , just try once to follow this , i was in the same situation as you"
    },
    {
      "id": "mck6t34",
      "body": "I'd been in this exact situation in my first year. Would probably not be here if I didn't decide to just thug it out for another day in June 2023. I cannot guarantee anything, but if there's anything I've been taught, everything will be fine over time.\n\nPeople fight different battles at different times. Your battles just seem to have landed on back-to-back days with no warning. It's just life hardening you for a better tomorrow.\n\nFailure is not in making an attempt. Failure is in not making an attempt at all. Take a step, fall, and get back up. Keep moving.\n\nI'm in my 3rd year now, and I can tell you it will get better. It is up to you to not give up now. You will find your calling one day if you keep going until that day comes.\n\nP.S.: I tried to keep this as situation-agnostic as possible, reach out if there's something very specific you wish to talk about."
    },
    {
      "id": "mckbetd",
      "body": "Which sem ??"
    },
    {
      "id": "mckpd2t",
      "body": "Academics aren't easy. It depends on the teachers. Friends don't matter...unless you keep in touch and they value you. Do what you have to do...and life will be great."
    },
    {
      "id": "mckvwlj",
      "body": "Same"
    },
    {
      "id": "mcl3dua",
      "body": "bro, I can help if you need someone to talk to\nI feel pretty stagnant too"
    },
    {
      "id": "mcl7jdy",
      "body": "[some brainrot bs cuz why not](https://www.instagram.com/reel/DFVwpkzSvoT/?igsh=MWtjdnB1bm5mN3p5cw==)"
    },
    {
      "id": "mcljd5l",
      "body": "hey i know things feel really hard right now and i’m really sorry you’re going through this but this isn’t how life is always going to be. i know it might not feel like it but you won’t always feel this way.\n\nyou matter more than you think, and even if it seems like no one cares, your presence makes a difference. it’s okay to feel like this, but don’t let it convince you that things can’t change. try reaching out, even if it’s just to talk, or doing something small like stepping outside or changing up your routine. you’re not alone, and things can get better."
    },
    {
      "id": "mclr19t",
      "body": "I am a graduate from pesu. People with 6.5-7 gpa got jobs of 10-20 lpa while people with 9.5 gpa struggled to find jobs worth 10 lpa . Don't worry you will get better"
    },
    {
      "id": "mcmbiw7",
      "body": "Bhai sunn, mujhe bhi aesa lgrha hai sach btau toh,dost khtm bas maa baap hai aur koi hai hi nhi , but i have started meditating yoga and home exercise, trust me bahaut farak pada hai, its just that apne ap push karna pdega else give up toh kabhi bhi karskte hai !"
    },
    {
      "id": "mcmwmli",
      "body": "Get a purpose in life. Many times we feel we are just existing, nobody cares. Help someone, make people dependent on you, make them expect something from you. You'll start to feel that you matter and slowly that feeling will go away. Being alone in the worst times of life makes us feel that way but be someone dependable and you'll find yourself much better because you'll know that people expect from you and you have to do something for them. Just sharing my experience, I once felt like that not suicidal but thought, i should die kya hi hojayega? Like this and slowly got better in 2-3 months. Happened due to a few things but finally I am grateful that Bhagwan ji wanted to make me teach something . I'm working super hard and grinding"
    },
    {
      "id": "mcp9e1d",
      "body": "Congratulations you don't have to face Drama's anymore,\nF everything have a good sleep,\nFollow wtf pod's he if f'ing aww I don't even have to complete all his pod's."
    }
  ]
}