{
  "id": "1ip315c",
  "title": "PES sucks and people here suck",
  "content": "I Hate myself for picking this college. It's filled with self centered people who don't have any signs of empathy whatsoever. Fuck pes. I'm so done",
  "metadata": {
    "root_comment_id": "mcon3dy",
    "post_id": "1ip315c",
    "author": "Maybewtfwtf",
    "url": "https://www.reddit.com/r/PESU/comments/1ip315c/pes_sucks_and_people_here_suck/",
    "permalink": "https://reddit.com/r/PESU/comments/1ip315c/pes_sucks_and_people_here_suck/",
    "score": 100,
    "upvote_ratio": 0.9200000166893005,
    "created_utc": 1739509177,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "mcon3dy",
      "body": "You'll find such people everywhere you just got real check that you're alone in this world"
    },
    {
      "id": "mconkro",
      "body": "Which sem ??"
    },
    {
      "id": "mcoo8tg",
      "body": "Same me \nAfter graduation also I fill same"
    },
    {
      "id": "mcoowot",
      "body": "I feel you just have not found the right crowd to hang out with yet , Although there are some self centered people here at the same there are genuinely kind and amazing people too here."
    },
    {
      "id": "mcopg5w",
      "body": "I get you OP. I'm a final year student so luckily I don't have to go to college much anymore, so I've been the happiest I've been in a good while. \nThat place and the crowd there just drains everything our of you. I hate the stupid rules they've put in place too, and don't even get me started with the god awful professors. \nJust do your work, study decently, and get out asap.\n└── what rules ?"
    },
    {
      "id": "mcoqget",
      "body": "Real bruv , can feel u"
    },
    {
      "id": "mcot9y6",
      "body": "I have friends I consider close but I really agree, I find college draining for the most part. I'm not very academically gifted either and have to work my ass day and night to get even a decent gpa. I've accepted that this is what it's like, and there's no point whining. I'm sort of relieved knowing I'm already halfway there and after a bit more struggling I'll be out of here. I really hope I'll feel happier after I graduate lmao."
    },
    {
      "id": "mcowvom",
      "body": "Fr this shi so ass"
    },
    {
      "id": "mcoxttu",
      "body": "Same here bro I’m such a extrovert but out here I’m al alone like super alone I get akward trying talk I have a lot of gaps in between classes and in gaps we don’t have any place to go although we have libraries but every one is out there with friends and can’t even go to canteen alone it’s filled with couples parents don’t even understand what I’m going through they just think I’m being difficult I cry every morning before going to college"
    },
    {
      "id": "mcoy1eo",
      "body": "Going to join this year and this is scaring me lol\n└── me too bro wth\n    └── Include me too in your gng\n        └── well I don't think I got in so so much for that lmao"
    },
    {
      "id": "mcp0f0s",
      "body": "Tell me something new."
    },
    {
      "id": "mcp3r06",
      "body": "PES was my dream , ended up in Reva 🥲\n└── do people die to get into PES?"
    },
    {
      "id": "mcp8gpe",
      "body": "Yep I've felt it too💀"
    },
    {
      "id": "mcq2d7e",
      "body": "Thats a very pessimistic outlook to have. There are really good people ive met and seniors r helpful and mostly chill. Join the PESU discord and have a chat you'll find some great people there. On the other hand your crashout about the college is completely reasonable"
    },
    {
      "id": "mcq5yg0",
      "body": "I felt the exact same way when I joined this college. The teaching made no sense, didn't like the crowd here and definitely hated how every semester was an experiment for them to try something new on us. Going to and returning from college felt like a chore everyday. I couldn't wait to get out of this place.\n\nFour years later, I found a few friends who I've become incredibly close to, funnily enough we got close by hating on PES and its policies lol, I realized that Professors were victims of the system as much as we are and every batch is going to be a guinea pig for something, looking back I'm happy I didn't have to do those stupid subject hackathons and fruit problems(seriously, what the fuck are those?). \n\nWhat I'm saying is that this college isn't great. Now that I'm no longer actively going to college, I've been feeling much happier. But maybe you need to a change in mindset too. Unfortunately, you need to attend college because they have an attendance policy. If you fill your head with negative thoughts, you just feel worse. Just attend your classes, stay out of drama, get a good GPA(8.5+) where college doesn't see your academic scores as concerning and you'll be out sooner than you think.\n└── Wdym by going to college felt like chore bro??? Ain't it a chore???💀"
    },
    {
      "id": "md2wib6",
      "body": "Same feeling i had when i was in 2023 graduating batch .. the experimenting batch for them..made some shitty rules and exam rules.. met some nice friends..my advice is study well , crack placements and make some good friends out there..i can understand ur feeling ..not everyone has the same experience ."
    },
    {
      "id": "md7w8tg",
      "body": "Same. Luckily I found someone who had the same opinions as me. Sadly in this world there will always be those you are selfish and those who aren't"
    }
  ]
}