{
  "id": "1iq30ak",
  "title": "Process of Getting Scholarship for PESSAT",
  "content": "Hello 2nd sem student here, first sem esa results came out and according to the previous year cutoffs i should be getting the 40% scholarship sem wise, can any senior guide me on how to avail this? Ive received my union bank details and passbook...",
  "metadata": {
    "root_comment_id": "mcx9sj9",
    "post_id": "1iq30ak",
    "author": "4dxrsh",
    "url": "https://www.reddit.com/r/PESU/comments/1iq30ak/process_of_getting_scholarship_for_pessat/",
    "permalink": "https://reddit.com/r/PESU/comments/1iq30ak/process_of_getting_scholarship_for_pessat/",
    "score": 12,
    "upvote_ratio": 1,
    "created_utc": 1739631244,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "mcx9sj9",
      "body": "You will need to first wait for them to release the cutoffs and scholarship list for this semester. If your name is on the list, and your bank account has been made, it is usually transferred to your account once they initiate it at their end. Note that scholarship money takes almost an entire semester to be sent out. Its way too early.\n├── so could take 5-6 months more? for just getting the list of top 25%  scorers??\n\nis it sent on gmail personally or the notice boards\n│   └── They'll send an excel spreadsheet to your mail with all the recipients' name. We got it towards feb end last year. This sem (3rd sem) they just sent a congratulatory message. After that a google forms link will be shared asking you to fill all the ubi credentials.\n└── what if i haven't had a bank account made from their end? cause i was told that if i already have a Union bank account,no need to have a new one,but they don't have my acc details tho\n    └── They will send a google forms link, asking you for bank details, after the scholarship is announced"
    },
    {
      "id": "mcydiqb",
      "body": "What was the cutoff last year?\n└── 9+ chem cycle 8.6+ p cycle\n    ├── EC or RR?\n    │   └── RR\n    └── That was for MRD right I was told CNR was 8.5 for chem cycle.\n        ├── Oh maybe yeah\n        └── The minimum required SGPA is 8.5 this doesnt mean that at 8.5 CNR scholarship is guranteed..."
    },
    {
      "id": "mdg4vn0",
      "body": "They'll release who got"
    }
  ]
}