{
  "id": "1irihwo",
  "title": "Query regarding admission",
  "content": "Hello guys, I want to take admission in pes under ece branch by management quota seat so on calling the helpline number they told me that it even requires 80% in pcm in 12th class but I scored 79.9% in pcm in 12th from telangana board. So please tell me whether  I am eligible and is there any other student who scored less than 80% in pcm but still got the management seat.\n\n(On speaking to them they told to come and meet in the office but currently I stay in hyderabad so if I temple from hyderabad to banglore with parents and then if they say no so it will be a loss of both time and money)",
  "metadata": {
    "root_comment_id": "md92vpc",
    "post_id": "1irihwo",
    "author": "Lost-Data7543",
    "url": "https://www.reddit.com/r/PESU/comments/1irihwo/query_regarding_admission/",
    "permalink": "https://reddit.com/r/PESU/comments/1irihwo/query_regarding_admission/",
    "score": 1,
    "upvote_ratio": 0.6700000166893005,
    "created_utc": 1739794485,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "md92vpc",
      "body": ">it even requires 80% in pcm in 12th class but I scored 79.7% in pcm in 12th from telangana board. So please tell me whether I am eligible\n\nI mean, isn't the answer in your question? I think even you know the answer. \n\n>On speaking to them they told to come and meet in the office\n\nThen you should do that. Or call them again or try having someone else in the city meet them. You're asking for help with something students cannot help with or have an idea about. Remember that this sub compromises students (and occasional profs lurking), not the admission department.\n├── I have seen few old posts on the same topic and there were few studnets who told that they were still being offered the seat after scoring less than 80%\n│   └── Then go and meet them in the office if you really want admission here.\n│       └── If I even get admission under management quota is it worth the money I pay?\n│           └── Absolutely not. I'd even say that the current non-CET fees is too much too.\n│               ├── Can you send any document/excel showing the placement stats especially for ece and lastly is it possible for the ece guysbto do IT stuff aide by side?\n│               └── What is the average package and all for a ece student and can a ece students do coding side by side?\n└── I even spoke to another third party agent and he was also telling that it's not compulsory"
    }
  ]
}