{
  "id": "1irpcq4",
  "title": "I got 96.4 Percentile in Jee Mains 2025 Shift 1 do i get Pes ?",
  "content": "I am really confused on which branch can i get into in PES.  \nplease can someone help me know if i can get Cse or Electronics or not ",
  "metadata": {
    "root_comment_id": "mda52ay",
    "post_id": "1irpcq4",
    "author": "Select-Stock-6675",
    "url": "https://www.reddit.com/r/PESU/comments/1irpcq4/i_got_964_percentile_in_jee_mains_2025_shift_1_do/",
    "permalink": "https://reddit.com/r/PESU/comments/1irpcq4/i_got_964_percentile_in_jee_mains_2025_shift_1_do/",
    "score": 5,
    "upvote_ratio": 0.7799999713897705,
    "created_utc": 1739813380,
    "flair": "PESSAT/Admission",
    "nsfw": false
  },
  "comments": [
    {
      "id": "mda52ay",
      "body": "I'd say nearly 100% chance for ece in EC campus.\n└── ohhh\n    └── Cse also decent chance, try to improve in the second attempt, if ur eligible for kcet aim for that, lower fees plus chance for RVCE.\n        └── Ohh, thank you  hope I get cse"
    },
    {
      "id": "mda95fv",
      "body": "nah i think ull actually get RR campus idk abt cse but ece for sure and ai ml, cause they increased jee mains quota seats this time as per what ive heard\n└── ohh okay thank you so much"
    },
    {
      "id": "mdamyrw",
      "body": "one honest question from someone's who's been at pes for 2 years, why did you choose pes? (not saying it's a bad college, I want to know what attracted you)\n├── So my dream college was Bits and Pes was my second choice  but today my physics state board exam went really badly and might not clear marks so im thinking of doing pes .  \nwhat are your thoughts on the college and is it good ?\n│   └── It's awesome if you adapt to it and vice versa\n│       └── Ohhh and its  still worth it if i shift to it from mumbai right\n│           └── If your passion is computer science then yes, and your ability to endure mental pressure 🙃\n│               └── yess thank you so much for helping me out\n└── hey bro, i had 97.2 percentile in jm ( 41k rank) i wanted to ask you a few questions since u were in pes, please answer..\n\n1.) can i get cs in pes?  \n2.) what is the average/median package ( roughly) ( it shows just the highest on the website)\n\n3.) how much would it cost roughly thru jee mains?\n\n4.) should i look for other colleges at this percentile ( nit lower branches, some iiit ece, vit cse, lnmiit, thapar) please guide me, im so fkin confused..."
    },
    {
      "id": "mdb84po",
      "body": "I know ur target is pes or bits, but from experience,  I am saying... Don't give up. Try to score much better in April session JEE Main like 98.5 to 99++ percentile....try for IITs, I mean it isnt wasy to get top branches....but you will def get a better exposure there.....and if you only fail, omly then come to pes...keeping your goal as pes at first place is smthg...a low key....no hates please...."
    },
    {
      "id": "mdf8wgj",
      "body": "ik a dude who's in pesu cse rn with 98.6%ile, 2024 batch. back then jee quota was only 5% of total seats and now its 40. If for some random reason where luck is not on your side you might miss out on CSE but AIML is guaranteed."
    },
    {
      "id": "me12j05",
      "body": "Search it up. You will get most of them."
    },
    {
      "id": "mf8am46",
      "body": "hey, what did u get? did they release the merit list?\n└── not yet\n    └── What time they releasing it"
    }
  ]
}