{
  "id": "1isex1e",
  "title": "what are your most interesting projects that you think got positive attention from interviewers?",
  "content": "everyone does the same course projects and for resumes most people just have the same old crud project on a mern stack or something else and not many people have anything different at all. i don't want to be in the same group but i'm having a hard time looking for different project ideas.\n\nso please answer the question, hopefully people with positive responses, or who had interviewers show interest. and also anyone who made something they are proud of. thanks",
  "metadata": {
    "root_comment_id": "mdfy780",
    "post_id": "1isex1e",
    "author": "meddlin_cartel",
    "url": "https://www.reddit.com/r/PESU/comments/1isex1e/what_are_your_most_interesting_projects_that_you/",
    "permalink": "https://reddit.com/r/PESU/comments/1isex1e/what_are_your_most_interesting_projects_that_you/",
    "score": 13,
    "upvote_ratio": 1,
    "created_utc": 1739891650,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "mdfy780",
      "body": "Well if someone shares here, everyone's gonna do it. \n\nUhm I ain't implying anything tho uk 🤷‍♂️\n└── Obviously nobody's going to do the literal same thing. (At this point god knows)\n\nBut just for an idea"
    },
    {
      "id": "mdg80mt",
      "body": "Since I maintain a history of all my resumes/CVs, I can answer this pretty accurately. Just went through them and here is the summary:\n\n1. When my 6th semester was going on (so while applying for summer internships), I had a 2-month research experience at CCBD. I had 1 paper, three ongoing research projects (one from capstone, one from NLP course, one side project) and a few other miscellaneous projects. You can check my LinkedIn (DM for link) for the paper by checking the one published before 2021. My primary projects included an NLP library in C which supported basic functions and neural embedding models, a working version control system, a self-supervised video querying engine and a knowledge graph based essay evaluator. It was mainly my research experience and ML/NLP-related stuff that got me my 7th semester internship, so not naming the other random projects. Extra stuff included scholarships, club/fest work and other achievements. \n\n2. During placement season in Aug 2021, everything from the previous point + my ongoing research experience during the 7th semester + ongoing TA experience + another scholarship.\n\nI don't want to disclose more without compromising my identity, so if anyone wants to see what my CV looks like today and 4 years ago, DM."
    }
  ]
}