{
  "id": "1iskhuw",
  "title": "AIML @ RR v/s ECE @ RR",
  "content": "I would like to know if I should opt for cse aiml over ece at rr ? and if so why?  \nI know that job prospects for ece at least at pes is bad, but i also don't want to regret taking aiml in the future. Is there any solution for this dilemma?",
  "metadata": {
    "root_comment_id": "mdhn94s",
    "post_id": "1iskhuw",
    "author": "Alarmed-Painter6368",
    "url": "https://www.reddit.com/r/PESU/comments/1iskhuw/aiml_rr_vs_ece_rr/",
    "permalink": "https://reddit.com/r/PESU/comments/1iskhuw/aiml_rr_vs_ece_rr/",
    "score": 1,
    "upvote_ratio": 0.6700000166893005,
    "created_utc": 1739905148,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "mdhn94s",
      "body": "Simple solution: Take whichever you are interested in. You cannot compare across branches.\n└── I've read a couple of your answers and spoken to quite a few who've studied at PES, and else where, they ask you not to specialize in bachelors, so according to this train of thought, AIML is bad.  \nBut on the other side, one of my cousins (2024 graduate) had to go through a lot to get a job because she chose ECE at PES.   \nAll this leads to me hoping that I get CSE at RR, looking at last year's JEE main cutoff (98 percentile), I think I'll barely make it in, but who knows.\n    └── Instead of searching around the web and see what you will get and get depressed will make it worse.....instead just keep on your work and study harder to get 98%le...even if you start now, I am sure you will get 98%le, because that was my case to....don't think anything else or about the results...."
    },
    {
      "id": "mdjtf8h",
      "body": "Aiml in the grand scheme is just a couple courses different over the entire 4 years. Placements are pooled, and the few courses either won't make much of a difference or you can cover them yourself in the holidays. \n\nIt's not really \"specialised' as the people here say, I'm in third year and overall the only differences are\n\n1) big data was a core course \n2) oop replaced with deep learning \n3) electives constrained to ai and cybersecurity related only. But almost everyone takes one from these two so it's not very bad. \n\nI heard the recent batch has something else, im not sure how different that is\n\nSo if you're interested in computers and don't have the rank for it, aiml is the no brainer.\n└── Even that has changed for the batch after you. Im in 2nd year and we have the exact same courses that cs dudes have. Apparently all the core courses across all the semesters is the same. It's just the electives (3rd year) that change.\n\n We'll have access to only cybersecurity and other ai related electives while cs guys have a bit wider options to choose from.  \nOverall I'd say AIML isnt as \"specialized\" as it is thought to be. If you aren't interested in ece then definitely go with AIML\n    ├── Exactly. Most comments just spout the same talking points without a single clue at all.\n\nAiml is just another way for the college to have more cs seats\n    └── Thanks for letting me :)"
    },
    {
      "id": "mdjtivo",
      "body": "I went with ece bcoz i felt , if i need a cse take proper cse instead of aiml, but upto you, cuz cse and aiml are literally same until 2nd year ends . I kinda regretted a bit but nope now I'm happy with my decision . But ECE is not for pussies\n├── Yea, I've heard that ECE and EEE are super hard\n└── Bro can I DM u, I want to ask a few questions\n    └── S"
    }
  ]
}