{
  "id": "1ite71p",
  "title": "is it normal to feel completely uninterested and unambitious about your degree",
  "content": "i’m in my 4th semester of cse, and i’m starting to feel really disconnected from everything. i didn’t choose this field because i’m really passionate about it. it just seemed like the logical choice, epecially since both my parents are in tech, and it felt like a reliable path. \n\ni’ve been coding since 7th grade (my school introduced it to us very early), and while i’m decent at it and comfortable with computers, my interest in this field has really started to wane.  even the subjects I thought i enjoyed were ruined by shitty teachers. it doesn’t give me the excitement i see in so many of my classmates. i see them discussing career paths, domains, future studies, projects etc., and i really don't give a single fuck about any of these things. i’ve realized that my brain isn't wired for \"analytical\" thinking. i’ve always been good at writing even made some money from it (although very little), and i’ve always enjoyed social sciences in general. i can definitely see myself working in tech, but i just know it’s something that will bore me out and piss me off soon. i know plenty of people feel the same way, but cs is the so called \"safe\" path for anyone who isn’t rich, so people stick it out, even if they’re miserable.\n\n i’m honestly unsure about my future, but i can’t even talk to my parents about it since i already chose engineering after they asked me a hundred times if i was sure. ",
  "metadata": {
    "root_comment_id": "mdo6a1v",
    "post_id": "1ite71p",
    "author": "kanyewaste_",
    "url": "https://www.reddit.com/r/PESU/comments/1ite71p/is_it_normal_to_feel_completely_uninterested_and/",
    "permalink": "https://reddit.com/r/PESU/comments/1ite71p/is_it_normal_to_feel_completely_uninterested_and/",
    "score": 40,
    "upvote_ratio": 0.9399999976158142,
    "created_utc": 1739993316,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "mdo6a1v",
      "body": "Lately, I’ve been feeling a bit uninterested, especially since starting my third year. My passion for aviation hasn’t faded, I still follow it closely and hope to pursue it seriously someday if things work out in my favor.\n\nLooking back, I’ve learned a lot in CSE and coding, and I’m genuinely grateful to my friends for helping me stay updated. However, I can’t shake the feeling that many of us ended up here not because it was our true calling, but because we didn’t have many great alternatives. \n\nSo Maybe that’s why the best thing we can do is support each other and eventually work toward our real goals.\n\nWith my third year coming to an end, it feels like college life is officially winding down. Honestly, it hasn’t been the most exciting experience, maybe because I’ve been a bit introverted and didn’t interact much with seniors or even many people from my own batch. Looking back, that might have made the journey feel more monotonous than it actually was."
    },
    {
      "id": "mdptlpc",
      "body": "im in 4th sem . I feel the exact same way!! Im seeing people around me discussing about projects , domains while im here soo unsure whether this is my right field. I thought i was the only one feeling like this 😭\n└── nah, trust me, you're not the only one. i know plenty of people in college who were forced into cse by their parents. pretty sure that’s the case for at least half the engineering crowd."
    },
    {
      "id": "mdsrp7h",
      "body": "hmm, depends if you are rich enough... if you are--go for some another \"fun\" degree\n\n:)"
    },
    {
      "id": "mdt5kgu",
      "body": "Omg same😭 This is legit me rn, no cap\nMost relatable shit I’ve read in a while\nIt honestly sucks, just sitting around watching everyone excel in something\nEveryone is engaged in some activity or the other, projects, internships and what not\nHere I am struggling to study this\nI know that if i put in the effort I’ll get good grades but the more i read the more i get frustrated like\nIs this what my life has come to\nI wanted to do either med or law but my parents were kinda against it so I took CSE, coz i enjoyed coding back in middle/high school\nEvery semester (even though I’m only in 4th) i somehow gaslight myself but it gets worse, I’m like gradually hitting rock bottom :("
    }
  ]
}