{
  "id": "1ivgnn8",
  "title": "Library credentials",
  "content": "Actually I got my library credentials in mail n it was in spam n I didn't note those username n password so now its not there in mail so now how can I get the library credentials?? ",
  "metadata": {
    "root_comment_id": "me5fj88",
    "post_id": "1ivgnn8",
    "author": "Constant_Ant_6389",
    "url": "https://www.reddit.com/r/PESU/comments/1ivgnn8/library_credentials/",
    "permalink": "https://reddit.com/r/PESU/comments/1ivgnn8/library_credentials/",
    "score": 0,
    "upvote_ratio": 0.5,
    "created_utc": 1740223410,
    "flair": "Study Help :table:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "me5fj88",
      "body": "Go to library and talk to reception they will give your credentials\n└── If you are in rr campus go to F block library"
    },
    {
      "id": "me5h0k1",
      "body": "did you try asking the librarian before you came to the subreddit to ask? \n\n\"uhhh where can i get my library credentials bro\" IDK BRO MAYBE THE FUCKING *LIBRARY*???\n\nFUCK SAKE WHY'RE YOU SO STUPID\n├── While I agree with your solution and would've given the same, calm down a bit dude. You can help them without putting them down. I understand it's frustrating when people need things spelled out (the number of times I've had to answer the same queries every year) but no need to go all out on them.\n│   └── context for rowlett and anyone else reading this: my username is pesu-hater, i hate as a matter of professional expertise, \n\nOP actually has a valid question, and its pretty shitty on PESU's part for not making it clear to students, i myself only figured out the libraries in 3rd sem after a friend told me\n\njuniors, please dont feel bad for things u read on the internet, i love you all <3\n│       └── >what the fuck is the point of providing a resource if nobody knows how to use it\n\nPESU 101\n└── Me AGGRESSIVELY typing MF Y TF r u rude... then saw ur other comment and had to delete a whole paragraph...\n    └── OH YOU DELETED A PARAGRAPH? WOW, CONGRATS BRO, WANT A MEDAL? YOU REALLY THOUGHT YOU COULD OUT-RAGE ME? I WAKE UP EVERY DAY FILLED WITH MORE HATE THAN YOUR ENTIRE KEYBOARD-SMASHED PARAGRAPH COULD HANDLE. NEXT TIME, JUST POST IT—I’D LOVE TO RIP IT APART PIECE BY PIECE. THIS IS WHAT I DO. THIS IS MY OXYGEN\n        └── I'm glad I'm not u eww... "
    },
    {
      "id": "me6k26o",
      "body": "Just mail your name, srn and prn to [librarian@pes.edu](mailto:librarian@pes.edu) They are quite quick to respond on weekdays.. you'd have to wait till monday if you send them a mail on weekends."
    }
  ]
}