{
  "id": "1ivgjyt",
  "title": "aatmatrisha doubtss",
  "content": "how are these domains gonna work in these aatmatrisha club? like each domain will further be divided into teams and you'll be guided by the team mentor? is it really worth spending your time here? especially if you're a first year student and how much time does it take up",
  "metadata": {
    "root_comment_id": "me5hek4",
    "post_id": "1ivgjyt",
    "author": "LawfulnessCapable373",
    "url": "https://www.reddit.com/r/PESU/comments/1ivgjyt/aatmatrisha_doubtss/",
    "permalink": "https://reddit.com/r/PESU/comments/1ivgjyt/aatmatrisha_doubtss/",
    "score": 10,
    "upvote_ratio": 0.9200000166893005,
    "created_utc": 1740222962,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "me5hek4",
      "body": "fuck you mean \"is it worth spending your time there?\"\n\nmate its a college fest, its supposed to be fun, you're not gonna get a damn Ph.D and 150% ROI going to a fest\n\n\n\"how are the domains gonna help\" BRO THE SAME WAY THEY HELP IN EVERY OTHER EVENT?!?\n\noperations team manges operations, treasury manages the money etc etc\n└── Valid crashout"
    },
    {
      "id": "me5qpw7",
      "body": "1)These domains work together to pull off the fest,they’re responsible for separate things,Finance is responsible for ticketing and budgeting,PR and Campaigning is for Campaigning across campuses,platforms etc,Logistics is to bring in and facilitate all the needs of the event(tables,printing etc) and so on for the rest of the domains\n\n2)AT is structured in the following \nHeads->Cores->Organisers->Volunteers \nwhere each branch is responsible for the branch right underneath \n\n3)It’s one of the most fun things you can get into,most people make a lot of friends and get to do non college related stuff while making a lot of connections that last beyond college\n\n4)You can give it as much time as you wish,if you want to be heavily involved you can,if you just want to do the bare minimum you can do that as well"
    },
    {
      "id": "me5r6xs",
      "body": "Aatmatrisha isn't a club. It's a techno-cultural fest and one of the biggest ones students get to organise and put together. It's also the most fun time at PESU and students wait every year for it because it comprises usually a week long of celebratory activities, fests, dress-up days, contests etc. Overall, it's the most fun time on campus after a hectic year. \n\nNow whether it's \"worth your time\" is something that depends on you. There is nothing except fun and recreation to be gained from this. If you want to have a (hopefully) great time, join the organising team. Adding this to your resume doesn't make any impact however. \n\nAlso since you're in first year, I'd highly recommend taking part in whatever fest and club activities you come across. Not because they're useful on your resume but because they're fun, you get to hang out with your friends, meet new people and overall get to experience some amount of college life at PES. You'll miss these moments once you're out. And given you're a first year, you have way more time and significantly lesser commitments and responsibilities to worry about as you have fun."
    },
    {
      "id": "me5vi2r",
      "body": "Live a little man,  \nGo out there join clubs make friends, trust me clubs is the easiest way to socialize and a really good one too. I have more seniors as my friends than my own batchmates. Since you are in first year, lets be honest you aint studying all the time so might as well use it to interact  \nClub activities may not show impact on your profile as other things might but they help you evolve, and build skills that cannot be learnt through textbooks.   \nSo go out there and make use of all the opportunities you get :)"
    }
  ]
}