{
  "id": "1iwgon5",
  "title": "Peer group for a DSA",
  "content": "I'm starting to study DSA in C with a 45 day target to complete the basic data structures and algorithms and practice easy and medium level questions. I want to have a buddy so we can support one another given I haven't really found the appropriate peer group. Pls DM for the 45 day plan and for further discussion.",
  "metadata": {
    "root_comment_id": "medt152",
    "post_id": "1iwgon5",
    "author": "anastusuh",
    "url": "https://www.reddit.com/r/PESU/comments/1iwgon5/peer_group_for_a_dsa/",
    "permalink": "https://reddit.com/r/PESU/comments/1iwgon5/peer_group_for_a_dsa/",
    "score": 10,
    "upvote_ratio": 0.8600000143051147,
    "created_utc": 1740335007,
    "flair": "Study Help :table:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "medt152",
      "body": "45 days to master dsa in c? bro really said 'i fear no algorithm.'\n\nyou’re either about to become a coding god or spiral into the deepest stack overflow rabbit holes known to man.\n\ngood luck, future leetcode warrior. may your segfaults be few and your pointers never lost.\n└── One of the seniors told me it's doable if I dedicate 1-2 hrs on a daily basis. Suggestions and criticism is always welcome with open arms.\n    └── I'm in."
    },
    {
      "id": "medwfn9",
      "body": "If you truly want to master dsa I would recommend a time span of 3 months ."
    },
    {
      "id": "meeomu3",
      "body": "idk about structured plan but me and my friends have a group where we sit together and grind leetcode every once in a while and try to crack as many questions as we can during random 3-4 hour runs on days where we have hella free time, u can dm me if yr interested"
    },
    {
      "id": "mge0p01",
      "body": "Is anyone interested in Studying together?  I'm currently working at a small consulting firm with around 1 year of experience and looking to switch to a product-based company ASAP. I've done a solid amount of DSA but want to revise everything and also focus on LLD/HLD."
    }
  ]
}