{
  "id": "1ixu8tc",
  "title": "Stop the torture",
  "content": "CONS- 1) SAVE PSYCHOLOGY DEPARTMENT 😭they bring in meaningless rules.\n2) Recently their new drama started 'cannot use laptop to make notes' this was also fine.\n3) But, every student will get their name cards and they are supposed to get it everyday and sit in the class according to srn. Like wHY?  I mean who really gives a damn about which student will sit where. Like its gonna slove the problem of using phones etc. \nThey couldn't even go an extra step to make a decent name card, they used 'already  used' paper to make them. And the names are written in such huge bold font. we are supposed to bring it and keep it everyday on the table like cattles! But if thats what you want, why have id cards???Are they just stupid at this point? It literally just a laminated A4 SHEET cut in half thats already been used! And bring that shit everyday college.  The management really needs to get a life.  And not make our lives a living hell! \n4) Already we are over worked. They don't leave us early even when the prof is not teaching anything, WE STAY IN COLLEGE EVERYDAY TILL 4' .The psychology department is a disaster.\n5) We have 3 huge research paper to finish,  assignments, case studies,  case reports. And they wont let us go home early and when we mention how much work we have, they say to do it in college,  but for that we need a goddam laptop.  Who in their sane mind would carry laptop everyday while using public transportation!? And even if we do carry laptops, whats the bloody use? We can't make notes in our laptop in class anymore. \n6) Keeping eyes on students through camera 24/7 , isn't that creepy, like get a life! Not just that, they from what i hv heard they can ultra zoom into phones and get a nice look of whats going on in the phone.  \n7) They make a HUGE deal about SLEEPING IN CLASS. I agree its not a good thing to sleep in class.  But how much can the students take!? Everyday wake up at 5, to reach college at 8 and then return home around 6pm. And then stay up all night working on research papers! Its impossible to not put our heads fown for just 2 mins! 8) IN ALL OF THAT THERE WAS 1 GOOD THING, WE COULD ATLEAST SIT NEXT TO OUR FRIENDS IN THE CLASS AND RELAX A  BIT, AND SIT ON THE BEACHES WE WANTED TO SIT ON.  BUT THESE PEOPLE TOOK THAT AWAY FROM US, MADE US SIT IN THE ORDER OF OUR SRN LIKE MINDLESS ZOMBIES! Many people cant sit in the back bench because they cant see the ppt properly from the back, many cant sit in the front bench because they are very light sensitive. Many of us get migraines etc, we could choose where we wanted to sit before BUT THEY WONT LET US SIT COMFORTABLY IN THE CLASS FOR 3 BLOCK CLASSES! \nSOMEONE FROM THE MANAGEMENT IS READING THIS, PLEASE TELL  ME WHATS THE POINT OF THIS???? \n\nif anyone could please save the psychology department before i cry tears of blood and die. I feel like since pes loves to give us exposure about future so much, they are giving exposure of 'after life hell' at this point. \n\nWasn't clubbing all 3 sessions into 1 class not enough? Wasn't not giving attendance for people who came after the 1st session got over for they second session not enough? Wasnt not  letting us even keep our heads on the table even  for 2 mins not enough? They should draw the line with the rules at some point. \nThey made the guest lectures and the club hours in between the short and long break,  so no matter what the students stay till 4 everyday. All other departments have their departmental clubs hours in the afternoon, but here, its only us that has it in between classes. \n\nEverything was fine. Why sit in rhe order of srn? Why make it so hard on us? And then expect 75%, for what? Ruining our mental health?\nI wouldn't be surprised if they introduced the rules that 'the profs would sit in our class during the lunch time and we need to take permission from the professor to go out during the lunch time'. Like seriously when will this stop?",
  "metadata": {
    "root_comment_id": "mep0dnp",
    "post_id": "1ixu8tc",
    "author": "Far_Badger1318",
    "url": "https://www.reddit.com/r/PESU/comments/1ixu8tc/stop_the_torture/",
    "permalink": "https://reddit.com/r/PESU/comments/1ixu8tc/stop_the_torture/",
    "score": 9,
    "upvote_ratio": 0.800000011920929,
    "created_utc": 1740487901,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "mep0dnp",
      "body": " Stop spamming boss\n\nYou’ve made 3 duplicate posts. We get it. You don’t like the new rules"
    },
    {
      "id": "mep7c12",
      "body": "Other departments have name cards from a very long time and these people complaining now💀"
    },
    {
      "id": "mep7d11",
      "body": "Your question or post has been answered previously. Before making a new post, always remember to search the subreddit. Duplicate posts will entail deletion."
    }
  ]
}