{
  "id": "1j0ejtu",
  "title": "Does PES accept improvement board marks",
  "content": "I got CSE in PES but their boards criteria is supposed to be 60% and I don’t think I will be getting that for pcm so what should I do do they accept improvement board examinations  ",
  "metadata": {
    "root_comment_id": "mfalqlw",
    "post_id": "1j0ejtu",
    "author": "Select-Stock-6675",
    "url": "https://www.reddit.com/r/PESU/comments/1j0ejtu/does_pes_accept_improvement_board_marks/",
    "permalink": "https://reddit.com/r/PESU/comments/1j0ejtu/does_pes_accept_improvement_board_marks/",
    "score": 5,
    "upvote_ratio": 0.8600000143051147,
    "created_utc": 1740767091,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "mfalqlw",
      "body": "Bruh come on man, dont lose hopes.....give ur best.....I heard chem paper was easy and phy ofc u and I both got deep fried....(PS: I gave Boards last yr)......but still dont lose hopes....even in worst case you wont be getting below 60% chill....\n└── I hope bro i can just hope now"
    },
    {
      "id": "mfamy8t",
      "body": "what was ur jee percentile?\n└── i got 96.5\n    └── u got CSE in rr or ecity?"
    },
    {
      "id": "mfavjrk",
      "body": "How can you get 95%+ in JEE but cannot cross 60% in Boards. Wtf?\n└── •Taking boards lightly (one shot before exam night will be sufficient 🤓👆 ill focus on april attempt)\n\n•Physics was messed up for cbse folks past two years (pu only physics mcqs were messed up)\n\n•coaching centres the big ones dont care about boards and only focus on jee Often not even covering derivations and tellin to mug up formulae\n    └── Exactly what you said bro \nMy coaching centre didn’t focus on my boards and jammed the week between my boards and jee attempt with practical’s so i had no time to study for boards and regret it big time\n        └── But there's a massive difference between 60% and 95%. Someone who scores a 60% lacks the most basic fundamentals. If you can cross 95% you definitely have atleast those clear. IMO you're simply underestimating yourself.\n            └── For 95%tile u barely need 100/300 (depends on difficulty too). And that's quite easy."
    },
    {
      "id": "mfe983x",
      "body": "U got CSE in ec campus?"
    },
    {
      "id": "mfevmi7",
      "body": "What was you %tile???"
    },
    {
      "id": "mffbyk3",
      "body": "what was your percentile??"
    }
  ]
}