{
  "id": "1j2huri",
  "title": "Scholarship",
  "content": "Does anyone have idea what is the cutoff for CNR scholarship this year for Sem 1 chem cycle \n",
  "metadata": {
    "root_comment_id": "mfrtr97",
    "post_id": "1j2huri",
    "author": "Serious-Adagio-8439",
    "url": "https://www.reddit.com/r/PESU/comments/1j2huri/scholarship/",
    "permalink": "https://reddit.com/r/PESU/comments/1j2huri/scholarship/",
    "score": 5,
    "upvote_ratio": 1,
    "created_utc": 1741005938,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "mfrtr97",
      "body": "EC Campus had sem-2 orientation today\n\nCNR Cutoff for both Phy and chem cycle = 8.5\n\nMRD Cutoff \\~ 9.1\n├── so cutoffs will be different for both campuses?\n│   └── yes\n├── will it be similar for both campuses as in will there be a huge a difference in cutoffs?\n│   └── That depends on how people perform.\n├── What else did they say?\n│   └── nothing much... they displayed a graph of how many scored above 8.75,7.75 sgpa and so on and also the number of students who got each scholarship...\n│       └── Did u take a picture of this?\n│           └── nope\n│               └── i am sry but did they tell wt percent of the fees we gonna get as scholarship\n│                   └── You should know this by now\n├── what was the orientation about?was it worth attending?\n├── So everyone above 8.5 were in the top 25%?\n│   └── yes... infact only top 15% got mrd or cnr.. the rest 10% had less than 8.5 cgpa\n│       ├── Tf\n│       │   └── even i was stunned at first... i thought cnr would be 9 lol\n│       │       └── it's never below 9 in rr campus, so don't get your hopes up:/\n│       └── Nah, wait I remember 14% were above 8.75 and 33% were between 8.75 and 7.75 in physics cycle\n│           └── Yeah... what I mentioned was of Chem cycle.. 10% above 8.75 and 24% between 8.75 and 7.75 \n└── is this a rough estimate? like cut off can differ right...\n    └── Mrd is a rough estimate cause they didn't explicitly mention the cutoff but cnr is fixed I.e. anyone above 8.5 got"
    }
  ]
}