{
  "id": "1j2jaw7",
  "title": "II PUC Improvement exams",
  "content": "I have my french exam tomorrow, and 90% chance I'm going to fail. I once heard that people who fail one subject in 2nd PUC, do not get their PCM scores counted for KCET, as supplementary exams take place a long time later.\n\nStarting from last year, there are improvement exams starting in May and KCET is going to consider PCM marks of improvement exam. So will I be marked as Pass if I pass my French exam in the improvement examination or will my PUC scores not be counted for KCET?\n\nHas anyone have first hand experience of this before?",
  "metadata": {
    "root_comment_id": "mfs423e",
    "post_id": "1j2jaw7",
    "author": "Kikyotaka",
    "url": "https://www.reddit.com/r/PESU/comments/1j2jaw7/ii_puc_improvement_exams/",
    "permalink": "https://reddit.com/r/PESU/comments/1j2jaw7/ii_puc_improvement_exams/",
    "score": 1,
    "upvote_ratio": 1,
    "created_utc": 1741010494,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "mfs423e",
      "body": "Ask in r/kcet"
    },
    {
      "id": "mfs4y5n",
      "body": "trust me, failing pu exams is harder than passing. they practically hand out marks for anything. if you didn’t know the answer, you could just scribble nonsense or summarize a random chapter and still pass. that’s exactly how I aced hindi as a south indian who can’t string three sentences together in the language. maybe it’ll work for your french too.\n├── the problem is french has maximum marks for grammar for them to hand out :/  \nbut thanks a lot! i'll try that out\n└── is it the same for subjects like- phy/chem and math\n\nwas very sick for phy, probably fucked it up..no recollection...  \ni do intend on writing second attempt for puc...still  \nany thoughts\n    └── they'll give you a mark or two for writing just the formulae.\n        └── what about for 2nd puc exam-2? is the exam also supposed to be easier than the og one? if i happen to flunk exam-2 will they consider exam-1 score as final if its better?\n            └── I have no idea since we didn't have 2 attempts"
    },
    {
      "id": "mfs79h1",
      "body": "hey, i was in a similar situation as yours last year. Passing French seemed impossible the day before the exam for me as well lmao, but if you can mug up a few important grammar topics and comprehension/essay/letter writing  you can pass quite easily. Failing French boards is quite uncommon so don’t stress too much\n└── dialogue and letter seem so freaking complicated, i have no idea how i can mug that up...  \nI just plan doing how much ever I can in grammar from the question bank board provided"
    }
  ]
}