{
  "id": "1j6hqcn",
  "title": "How’s the crowd,teaching and placements in pes",
  "content": "Would u recommend people to join pes for btech.If not what other colleges would you suggest and also what’s the cutoff there for cse ",
  "metadata": {
    "root_comment_id": "mgomtcz",
    "post_id": "1j6hqcn",
    "author": "Zestyclose_Map_723",
    "url": "https://www.reddit.com/r/PESU/comments/1j6hqcn/hows_the_crowdteaching_and_placements_in_pes/",
    "permalink": "https://reddit.com/r/PESU/comments/1j6hqcn/hows_the_crowdteaching_and_placements_in_pes/",
    "score": 17,
    "upvote_ratio": 0.949999988079071,
    "created_utc": 1741442395,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "mgomtcz",
      "body": "Check the faqs\n├── Where can I find it\n│   └── https://www.reddit.com/r/PESU/s/UF7yN1Hkdk\n│       └── Thank u but would u recommend me to join\n│           ├── I have no answer for this, you have to do your own research, understand what works for you and what PES is offering, and decide on your own.\n│           └── As someone else said: go through the pros and cons and other related posts on this subreddit (search this sub, this is asked very frequently and many have posted their views) and form your own decision.\n│               └── Okay\n└── Rowlet bhai aap?"
    },
    {
      "id": "mgouamy",
      "body": "Crowd kinda mid, from next year it's gonna be way better. Teaching: first year has been decent so far with a few oddballs but a common pattern is very experienced profs who knows everything except to teach accurately.\nPlacement good for cse. Prolly top 3 in Karnataka"
    },
    {
      "id": "mgp6ies",
      "body": "The crowd is good, placement is very competitive . It is mostly dependent on your CGPA completely"
    },
    {
      "id": "mgt0kbo",
      "body": "Crowd is good.\n\nTeaching is a mixed bag. On a downward trajectory though.\n\nPlacements are good if you're at the cream of the crop. Too competitive otherwise, because PES' intake is very high. Lots of cheating going on, but college doesn't really care since they want to raise their stats. However, batches after mine(2025) increased their intake massively, so keep that in mind."
    },
    {
      "id": "mgtc09l",
      "body": "Placements are great but mostly favored for CSE . Profs are average to good but most of the study happens by yourself in any college. CSE cutoff will be different this year as the intake is through JEE and KCET which is a first , but it might be around 96%ile+ for CSE at RR\n\nI'd recommend you joining only if you didn't get a good branch in IITs/NITs/BITS\n\nAnd the crowd is obviously very competitive so you gota try ur best to be ahead to guarantee good results/placements/scholarships\n└── Will 89 percentile work"
    }
  ]
}