{
  "id": "1j9km9r",
  "title": "Admission with x% in JEE? - We don't know either so STOP ASKING.",
  "content": "As stated previously, this is the first year since PES removed it's PESSAT admission test and included only JEE and KCET scores. No current student or graduate will have enough information to answer which branch you can get with x% given that the pool of seats for JEE has increased, we're looking at completely new demographics applying from this year and the range of applicant scores has increased: past data is now obsolete for making predictions. \n\nPES is also not transparent with the new admission process and most current students (and especially graduates) don't really bother knowing the intricate details once they're in (or out). So almost everyone here is uninformed and there is quite a bit of missing information and insights. \n\nTo summarise, there are simply no data points to offer helpful suggestions. We cannot help you besides answering about PES. If you have any admission-related questions, they're best directed towards the admission department. \n\nAny future posts on this topic will be promptly deleted. If you see any such post, please report it to the mods.\n\n\n",
  "metadata": {
    "root_comment_id": "mhdwq7a",
    "post_id": "1j9km9r",
    "author": "rowlet-owl",
    "url": "https://www.reddit.com/r/PESU/comments/1j9km9r/admission_with_x_in_jee_we_dont_know_either_so/",
    "permalink": "https://reddit.com/r/PESU/comments/1j9km9r/admission_with_x_in_jee_we_dont_know_either_so/",
    "score": 67,
    "upvote_ratio": 1,
    "created_utc": 1741787683,
    "flair": "ANNOUNCEMENT :snoo:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "mhdwq7a",
      "body": "the kids who actually need to see this post will ignore it, and they’ll keep posting about it endlessly, as usual\n├── They never check / search previous posts especially I have seen the same in RVCE sub as well KCET sub they ask  repeated questions\n└── Report those posts. We'll handle it from there.\n    ├── Better just setup a automod for it\n    │   ├── W profile picture\n    │   │   └── Oshi no ko fan?\n    │   │       └── Except for the ending yeah I even hv physical copy of vol 1\n    │   │           └── Same even I have vol 1 physical copy to keep it as memory, yeah ending was ass.  \n\nBtw which girl kana, akane Or ruby?\n    │   │               └── Ai still my favorite even though she had like 0 screentime but from those 3 ruby\n    │   └── not sure if reddit has that feature\n    │       └── No it's available, it would be impossible to moderate reddit if it wasn't available, there is a sub also about it  r/Automoderator\n    │           └── Here's a sneak peek of /r/AutoModerator using the [top posts](https://np.reddit.com/r/AutoModerator/top/?sort=top&t=year) of the year!\n\n\\#1: [Removing posts based on someones profile description](https://np.reddit.com/r/AutoModerator/comments/1i1l3t4/removing_posts_based_on_someones_profile/)  \n\\#2: [Using AutoModerator to ban links to X/Twitter in your subreddit](https://np.reddit.com/r/AutoModerator/comments/1i7vohb/using_automoderator_to_ban_links_to_xtwitter_in/)  \n\\#3: [Sample automod code to ban Oligarch-controlled propaganda sites](https://np.reddit.com/r/AutoModerator/comments/1i6t91m/sample_automod_code_to_ban_oligarchcontrolled/)\n\n----\n^^I'm ^^a ^^bot, ^^beep ^^boop ^^| ^^Downvote ^^to ^^remove ^^| ^^[Contact](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| ^^[Info](https://np.reddit.com/r/sneakpeekbot/) ^^| ^^[Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/o8wk1r/blacklist_ix/) ^^| ^^[GitHub](https://github.com/ghnr/sneakpeekbot)\n    └── Btw how's pes for cse, I'm talking like college life and also placements with a major goal being placements\n        └── There's a complete FAQ about it in the sub in the about section"
    },
    {
      "id": "mhejiwv",
      "body": "For anyone who wants to know it's 99.99 percentile to join ece at ec campus\n└── Fake! I had 316.42 percentile and the best they offered was civil at EC campus\n    └── Fake! There is no civil at EC Campus\n        └── fake ! there is, i saw some guys  building the hospital the other day\n            └── 😂"
    }
  ]
}