{
  "id": "1jb6xma",
  "title": "Aatmatrisha critic",
  "content": "Just share your opinions on aatmatrisha both positive and negative \n\nMy opinion ( No hate if I am wrong pls correct me)\n\n1.Why do they keep aatmatrisha just before ISA why can't they keep it atleast a week before.so.that atleast we can enjoy fully without overthinking much about ISAs\n\n2. What is this method of buying tickets why make it complicated, I am not complaining and I know it's not an easy task but still you could have made this course easy only.\n\n3.why pes does not make maaya as aatmatrisha \n\nHope this event turns out good as well as your ISAs ",
  "metadata": {
    "root_comment_id": "mhrm7r3",
    "post_id": "1jb6xma",
    "author": "Frequent_Purple3443",
    "url": "https://www.reddit.com/r/PESU/comments/1jb6xma/aatmatrisha_critic/",
    "permalink": "https://reddit.com/r/PESU/comments/1jb6xma/aatmatrisha_critic/",
    "score": 62,
    "upvote_ratio": 0.9800000190734863,
    "created_utc": 1741967031,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "mhrm7r3",
      "body": "1. Mostly cuz its only First Year who has their ISA just after AT, rest all have it later.\n\n  \n2. Agreed, but else will they generate the \"hype\"  if everybody buys online?"
    },
    {
      "id": "mhrofz4",
      "body": "AT and maaya are complete disasters compared to fests in other colleges, and not because of budget or scale, but pure incompetence. AT last year was a fucking joke. they delayed everything, made everyone stand in 36 degree heat for 3 hrs, and the volunteers were useless. maaya wasn’t any better. they held a paid diwali \"party\" that my friends went to, started ridiculously late, and wrapped it up in just 30 minutes.\n\ni've had fun, but only because of my friends. these fests are not worth the money otherwise.\n├── i agree ! the show had already started before even half the audience had entered the venue....main artist came super late AND they overpriced everything at the stalls during pro nite too..having to pay an absurd amount ( i dont remember well i think it was 50/100 ? ) for a paper cup of water was so ??? just let us take a transparent water bottle inside the venue\n\nwe'd also bought tix for the silent disco on the previous day and it lasted barely 15-20 mins despite our slot being a 30 min one.\n\nand the tickets this year cost much more than they did last year\n├── This time too volunteers are no better. It happens every time most of the, are noobs/ first timers. Once you are inside the concert, you are forced to buy overpriced stuff a 10 rupee water bottle is sold twice-thrice its price. Trust me, you will have fun only if you are with your close friends else forget it, everything will be annoying. Be ready to stand in line for upwards of 3 hours. Dumb organisers can’t even plan out the registration and frisking properly.\n│   └── the volunteers don't  gaf about the fest. they only signed up to bunk classes and get free attendance.\n\nthe water bottle situation was a complete disaster. i was dizzy from the heat and thirst, barely able to stand, and someone had to hold me up. there was a massive crowd just waiting for bottle. i have no idea how i made it out of there alive lmao.\n│       └── The least they can do is give everybody a frigging water bottle after taking so much money for that pass lmao but nah lets churn out MORE MONEYYYY\n└── Sh!t at PESU ALWAYS starts wayyy later than its scheduled, this shows that they have no value at all for others' time. \n\nPart of the reason why I don't attend any of the PESU bs events."
    },
    {
      "id": "mhs2347",
      "body": "Maaya > AT . Who tf is buying a ticket for 1000\n├── Me unfortunately. Seeing the reviews on reddit kinda makes me regret buying tickets.  I am going with friends tho so I'll make the best of it ig lol\n└── Well AT does get more expensive artists tho."
    },
    {
      "id": "mhvvif7",
      "body": "Bro it's aatma Trisha not rcb unbox event just chill and wait for the reality hits."
    },
    {
      "id": "mhw7iop",
      "body": "Hard agree on 2. The ticketing system is overcomplicated, they should either keep it full online or full offline"
    }
  ]
}