{
  "id": "1jdiota",
  "title": "RESEARCH",
  "content": "I’m currently in my first year but I’m really interested in research. Seniors who were interested in it as well, how did you go about it? ",
  "metadata": {
    "root_comment_id": "miap2xk",
    "post_id": "1jdiota",
    "author": "Correct-Western-6058",
    "url": "https://www.reddit.com/r/PESU/comments/1jdiota/research/",
    "permalink": "https://reddit.com/r/PESU/comments/1jdiota/research/",
    "score": 11,
    "upvote_ratio": 1,
    "created_utc": 1742233281,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "miap2xk",
      "body": "Mantesh basappa khot ftw🔥🔥\n└── I’ll need more explanation, what’s that?"
    },
    {
      "id": "miayxei",
      "body": "I can come back to this and write a detailed comment later, but this should be good enough to give you some initial info: \n\n[https://www.reddit.com/r/PESU/comments/1bhk8os/comment/kvfizda/](https://www.reddit.com/r/PESU/comments/1bhk8os/comment/kvfizda/)\n\nYou will find more comments if you go through my comment history and search with \"research\" or other relevant keywords\n└── Thank you, will definitely look ‘em up"
    },
    {
      "id": "mifjyjm",
      "body": "What are you interested in working on?"
    },
    {
      "id": "mitpv2j",
      "body": "What are the scopes of research for pass-out students. If someone can please provide some details. I have completed my M.Tech and I want to pursue research."
    },
    {
      "id": "mwm4zs9",
      "body": "It totally depends on the objectives, I'll share it based on my experience during PES, as well as when I hired some interns during my last and current academic job.\n\n1. Most students want to do research in an internship cause they are going to apply for MS Abroad immediately or after a couple of years. If that's the case then apply for profs/labs outside, will help you with recommendation letters and if long enough 12+ months possibly a paper (my first group of interns got their conference Acceptance 7 months into the work from PES) and a journal publication 😅12-24 months. Remember I'm not counting presenting as local college level conferences with no peer review or magazine articles (like IEEE Access) those wouldn't help anywhere.\n\n2. You want credits for the internship to boost your score. In that case find the one which is easiest in college in blr anyone who will sign off.\n\n3. You want a career in research: (One in hundred 😭, but still) then take the right steps right from reading possible areas pick profs in India or Indian Abroad (higher likelihood of reply) start working with them, raise your intellectual level, learn good research practices, show intent. Then they will pull you through. I only found 1 from PES so far and I'm glad to say that after 10 months she is now joining IIM Kozhikode for her PhD ⚡. \n\nBut feel free to ask anything specific"
    }
  ]
}