{
  "id": "1jh96z6",
  "title": "PES",
  "content": "Hey... \nI Have A Query.. How Much It Gonna Cost For Non Karnataka Student For 4 years  complete B Tech CSE In PES University With Certain Scholarship",
  "metadata": {
    "root_comment_id": "mj5bkug",
    "post_id": "1jh96z6",
    "author": "Siddharthh_05",
    "url": "https://www.reddit.com/r/PESU/comments/1jh96z6/pes/",
    "permalink": "https://reddit.com/r/PESU/comments/1jh96z6/pes/",
    "score": 5,
    "upvote_ratio": 0.7300000190734863,
    "created_utc": 1742652380,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "mj5bkug",
      "body": "Somewhere around 12.5 lakhs if u get mrd scholarship, 14 lakhs if you get cnr scholarship and 20 lakhs if you don't any scholarship (this is only for the tuition fee)\n├── Dude if a person gets into pes through kcet \nWhat will the fees be? \nAnd if one can avail scholarships what will the cost be?\n│   └── 5.2l if you want scholarship and 4.8l without scholarship benefits\n│       ├── Lol alright thanks dude\n│       │   └── The scholarship is like a lottery. You pay the 10k  for 1 year to be eligible, and if you get it you get 30k per sem. \n\nSo even getting it in one sem is worth it. But if not you're down 1pk\n│       └── Wait do we have to pay 10k every year for scholarship??\n│           └── Yes\n└── But one should not join assuming they will get a scholarship every sem.\n    └── That is what he assumed in the question"
    },
    {
      "id": "mj5zd9z",
      "body": "Am Just In Dilemma Yrr... Can't Figure Out... How To Get Good College... i Got 90 percentile in my jee and am not sure about 2nd attempt... And I Want A Good College with decent placement... and Fees Shouldn't be high than 11_12 lakhs\n├── A clg with less than 12L fees is bit tough with that percentile,even if u get VIT or MIT by clearing their entrance exam the fees would exceed 12L . i would suggest you to give Comedk exam , you might get some good pvt clgs of Bengaluru, tho the fees is a bit higher than 12L fs but you'll atleast get a somewhat decent clg\n└── Give kcet if your eligible... it's the only option for low fees..."
    },
    {
      "id": "mj9x273",
      "body": "Easily 20L to 24L. In tution fees. "
    }
  ]
}