{
  "id": "1jjfsh0",
  "title": "Pes or RV for grading?",
  "content": "Choosing a college for my brother right now. \n\nI am in bits and I know how fucked the grading scene is, scoring above 9 is insanely hard and that’s hampering masters for us. I don’t want that for my brother.\n\nWe want RVCE or PES core cse, how is the grading and competition in both of them? \n\nAnd the placement scenes in both. PES seems to have better facilities but RVCE placements seem good (on paper)\n\n",
  "metadata": {
    "root_comment_id": "mjmrd8b",
    "post_id": "1jjfsh0",
    "author": "Logical_Syrup_13",
    "url": "https://www.reddit.com/r/PESU/comments/1jjfsh0/pes_or_rv_for_grading/",
    "permalink": "https://reddit.com/r/PESU/comments/1jjfsh0/pes_or_rv_for_grading/",
    "score": 27,
    "upvote_ratio": 0.9700000286102295,
    "created_utc": 1742896754,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "mjmrd8b",
      "body": "Rv fosho\n└── Why though?\n    └── Though the other factors are debatable, for grading pes is worse than rvce but it's not as bad as bits. The vtu colleges in general have a relaxed grading scheme with simpler tests, it's easier to score cgpa in rv comparatively and many of the teachers told this to us openly in the start, but I have heard rv also has a hectic schedule with a lot of projects that count for your grade.\n        └── So grades at BITS and IIT's are comparable?\n            └── Not sure about BITS and iits. Only downside with bits is 100 percent merit seats so it’s extremely competitive and hence scoring better than the average gets very tough"
    },
    {
      "id": "mjmwpw7",
      "body": "If you care more about a higher CGPA, RV is definitely the way to go. It's a lot easier to score well in VTU colleges.\n├── How much easier can it be? Probably like 20% of our brech batch has a 9+ gpa. What self respecting college can be worse than that\n│   ├── At RV the percentage is more...\n│   └── The only VTU colleges that are decent are rvce, bms, and msr because of the high cutoffs. Everything else is pretty much trash. I have friends  with a 6 digit kcet rank who smoke weed all day, barely show up to class, and still manage a 9 GPA.\n└── How bad is pes grading then? Like what percent of batch is above 9? And how hard is it?\n    └── The grading isnt as horrible as people here make it seem, but I dislike their inconsistenty and lack of transparency. Some semesters, they hand out grades like candy, and other times, they tank your grades for no reason.\n\nIt gets harder with after first year. If you study consistently with a goal in mind, you'll be okay.\n\n\nNot sure about the cgpa distribution. Someone had posted some stats about it earlier, so you can look for it.\n        └── https://preview.redd.it/5eb9e2bzwuqe1.png?width=1280&format=png&auto=webp&s=e05c538d5cd9244cee6399aec29ae75dbb016372"
    },
    {
      "id": "mjn2rka",
      "body": "RV for better grades :)"
    },
    {
      "id": "mjnpydm",
      "body": "Pes for the active  cs culture honestly "
    },
    {
      "id": "mjo0n6k",
      "body": "Definitely rvce for grades"
    },
    {
      "id": "mjogjvx",
      "body": "Can i dm about BITS?"
    },
    {
      "id": "mjolohl",
      "body": "Pes goated. Dream college fr\n└── I hope this is sarcasm 💀😂"
    },
    {
      "id": "mjozfz4",
      "body": "Afaik grading in rv and pes is much better than bits so shouldn't go wrong with either of them"
    }
  ]
}