{
  "id": "1jp3oy3",
  "title": "AT 25 TIX FOR NON PES",
  "content": "Pretty much the title. WHEN will the ticketing for non PES students start? ",
  "metadata": {
    "root_comment_id": "mkwtsnu",
    "post_id": "1jp3oy3",
    "author": "Correct-Western-6058",
    "url": "https://www.reddit.com/r/PESU/comments/1jp3oy3/at_25_tix_for_non_pes/",
    "permalink": "https://reddit.com/r/PESU/comments/1jp3oy3/at_25_tix_for_non_pes/",
    "score": 10,
    "upvote_ratio": 1,
    "created_utc": 1743533942,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "mkwtsnu",
      "body": "Idt they are selling it to non pes this time\n└── Are you from the AT team?\n    └── They are not selling to non PES this time, ask AT team if u want. I had asked one from AT team and they had told me that AT is only for PES ppl this time\n        └── That's weird, do you know why? Usually AT is open to everyone. I myself have bought tickets after graduating.\n            ├── I heard that The contract with artists says pes exclusive\n            │   └── That doesn't add up because this is a chance to make more money by including outsiders. Plus, outsider tickets have always coated more afaik\n            │       ├── Maybe to reduce the crowd and increase the quality of the fest for our university students itself\n            │       └── I think its artists preference at the end of day. Not sure exactly, but the reason cud be to reduce crowd maybe?\n            └── There is a lot of drama with AT this time\nMainly in regards to mohith chauhan.\n                └── Ooooh I smell tea. Spill 👀"
    },
    {
      "id": "ml5t4hg",
      "body": "i already bought tickets for in-house tickets,the ppl who were selling tickets allowed me to, non pes are still allowed for in-house events on 4th april right?"
    },
    {
      "id": "ml7952x",
      "body": "non-pes for in-house events, yes\n\nnon-pes for AT ProNite, not this time, artist contract said only PES students allowed\n\nFrom an AT Org"
    }
  ]
}