{
  "id": "1jqevub",
  "title": "Do you think if as a student cannot make it into great colleges like PES etc and other good colleges never end up to get any job?",
  "content": "",
  "metadata": {
    "root_comment_id": "ml6fbbo",
    "post_id": "1jqevub",
    "author": "Informal_Valuable302",
    "url": "https://www.reddit.com/r/PESU/comments/1jqevub/do_you_think_if_as_a_student_cannot_make_it_into/",
    "permalink": "https://reddit.com/r/PESU/comments/1jqevub/do_you_think_if_as_a_student_cannot_make_it_into/",
    "score": 0,
    "upvote_ratio": 0.5,
    "created_utc": 1743676113,
    "flair": "Club Post :upvote:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "ml6fbbo",
      "body": "Bros making me cry and laugh at the same time"
    },
    {
      "id": "ml6fokt",
      "body": "Imma actually cry if this isn't a satirical post\n└── arey its not ironic bhai i have really told the truth i am going to bad in kcet so i asked whether i could still land a job even after lading in bad one"
    },
    {
      "id": "ml6frcg",
      "body": "Pes is not a great college\n└── i knw all colleges are the same but what about the placemnets huge package that pes offers every of my friend who is going to write kcet this year is crying for pes seat dude becoz they know pes can offer good jobs\n    └── you guys see the placement stats and think it’s a done deal, but the competition here is mad. There are way too many people, and if you’re not willing to put in the work to be at the top, a good placement isn't gonna fall into your lap\n        └── thanks bro this motivated me bro thanks so can i still expect to land a job if i work hard even if i have ended up in a bad college?\n            └── Pes students only struggling for job,what u think u will get in some shitty college\n                └── Bro dont scare me😭😭\n                    └── You should be, seeing your situation"
    },
    {
      "id": "ml6hk05",
      "body": "https://preview.redd.it/hhuew64hplse1.jpeg?width=1199&format=pjpg&auto=webp&s=baf4d24375f297e937716dc83b179f211b9ce282\n└── lol y"
    },
    {
      "id": "ml6jin8",
      "body": "No"
    },
    {
      "id": "mlbvz8v",
      "body": "Cooked"
    },
    {
      "id": "mlbw4l0",
      "body": "![gif](giphy|ZxItKsSZuDgva4WTqL)\n└── bro wt"
    },
    {
      "id": "mlinzig",
      "body": "Great college like pes.At this point i stopped reading. Today we have a cultural event. The volunteers are treating people who paid 1k+ like dogs and are making them stand in the sun for hours not even providing water. On the study side the college is better but just know that this college is like a school so make your choice very carefully.\n└── Bro wat bout placement package and czn i hope to land job if i work hard even if i am in shitty clg\n    ├── Job placements you will get. Pes is better than other tier 2 tier 3 colleges in that comparison.\n    └── In shitty college well you will get max infosys, capegemini and cognizant giving you upto r.5 lakh jobs. Once in a while 10 lakh. Nothing greater than that\n        └── Am done with my life😭\n            └── you can always grow from there. At the end of the day college gives you 2 year boost at max paycheck wise. its chill"
    },
    {
      "id": "n9k5trh",
      "body": "No you're cooked.Jk bro. There is more towards life than placements. Chill 😭.There are successful people from tier 3 colleges as well tho college does initially give you a headstart depending on the companies that show up.Besides the intake is huge at PES."
    }
  ]
}