{
  "id": "1jymjvm",
  "title": "Scholarship amount",
  "content": "When will the scholarship amount be credited for the first sem as it’s still not done?",
  "metadata": {
    "root_comment_id": "mmzm1nn",
    "post_id": "1jymjvm",
    "author": "Rine7979",
    "url": "https://www.reddit.com/r/PESU/comments/1jymjvm/scholarship_amount/",
    "permalink": "https://reddit.com/r/PESU/comments/1jymjvm/scholarship_amount/",
    "score": 10,
    "upvote_ratio": 0.8600000143051147,
    "created_utc": 1744591600,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "mmzm1nn",
      "body": "Whenever they wish to. Just know that you'll get it, there's no guarantee about when. Some of us got paid our TA stipend almost a year after graduating lmao.\n└── How much is the TA stipend?\n    ├── Good question very much needed please guys how much is it\n    └── Depends on many factors, including the workload and how much the prof requests the department to pay you. I know people who got paid ₹3000/course, some got paid as much as ₹8000.\n        └── Ohhh ok got it"
    },
    {
      "id": "mmzu3bf",
      "body": "bro thought pes actually gives out scholarships /s"
    },
    {
      "id": "mmzw2pk",
      "body": "I’ve received mine almost a week or 2 ago ( check with COE or the bank if there’s some issue )\n└── My friends and I havent received\n    └── Sem1 wala?.\n        └── Yeah , I’m from EC and a lot of my mates have had it transferred to their account, a few of them had issues with the bank , they were told that it might get credited in a month or so"
    },
    {
      "id": "mn0bsy4",
      "body": "got it a day after they released the scholarship list itself. EC campus\n├── RR be inefficient like that\n└── What’s the amount received for cnr scholarship\n    └── they said 40% of tuition fees, but would be nice if someone could tell the exact amt whether its on the 4,00,000 or whole of 4.8L\n        └── It's 20% of whole 4.8 , or 40% of the sem fee\n            └── ok thankss"
    },
    {
      "id": "mn0kc7k",
      "body": "U guys getting scholarships ?\n└── ye, mrd"
    }
  ]
}