{
  "id": "1k2xo5j",
  "title": "PESU Admissions for 2025",
  "content": "So JEE Mains happened. Well AIR 65xx for General Male ain't getting me any good options.\n\nI'm interested in Programming/Coding. I've done a few projects and like programming/coding. (I've done 20-25 free lance projects, helped built 2-3 discord bots out of which one has around 400k servers)\n\nSo I'd want to B Tech in CSE, I got CSE in counselling in January, but I didn't block my seat, I'll probably get CSE this time as well. A few questions  \n  \n1. What should be the priority order for filling? \n\nhttps://preview.redd.it/i0fl3j9xysve1.png?width=1345&format=png&auto=webp&s=6aa537221c67edf15e0a386e1ed76ad794863e7e\n\n(Does anyone know why it's ordered like this)\n\n2. Fees is not really an issue, but would NIT CSE(lower ones) or IIITB/IIITA CSE be better than PESU?\n\nIf you have any inputs, please let me know, Thank you!",
  "metadata": {
    "root_comment_id": "mnxrklp",
    "post_id": "1k2xo5j",
    "author": "After_Leadership_809",
    "url": "https://www.reddit.com/r/PESU/comments/1k2xo5j/pesu_admissions_for_2025/",
    "permalink": "https://reddit.com/r/PESU/comments/1k2xo5j/pesu_admissions_for_2025/",
    "score": 7,
    "upvote_ratio": 0.7699999809265137,
    "created_utc": 1745073382,
    "flair": "PESSAT/Admission",
    "nsfw": false
  },
  "comments": [
    {
      "id": "mnxrklp",
      "body": "You're considering joining pes with a 6k mains rank. \n\nIf this isn't definitive proof that smart people are secretly dumb i don't know what is\n└── You tell me what colleges I'm gonna get(that are not shit). CSE degree.\n    ├── it's honestly depressing that with a rank that good you still can't get CSE at a top college\n    │   └── What to do. I can't even complain about reservation cause it won't change in this country. I don't wanna take a drop. We'll see what happens\n    │       └── you should be proud of yourself, dude. getting a score that good is pretty rare :)\n\n  \nPES isn’t bad at all when it comes to placements, and it has a solid coding culture. so i think you’d do well there, especially since you seem to be quite an academic performer too. the only real downsides are the fees, which are kind of unjustifiable, and the huge population. really think about whether you want to be competing with 1500 other students for a job.\n\niiit-b might actually be a better option. from what i’ve heard, they don’t offer a bachelor’s, but an integrated master’s instead, and the place leans more toward research.\n\nalso consider colleges through comedk and kcet.\n    ├── The post was enough. You really don't need to strengthen my point further\n    │   └── What lol\n    └── IIIT Banglore exists bruh"
    },
    {
      "id": "mnxsan0",
      "body": "priority order depends on these factors :  \ncampus selection : closer to your home the better, avoid travelling long distance in blr.  \nbranch selection :  CSE would be better than AIML. since you want CSE.(You can opt for AIML specialized courses during third year in CSE if you want).  \n\n\nprioriy order acc to me if location is not a problem for you :  \nRR-CSE > EC-CSE > RR-AIML > EC-AIML.  \n\n\ncheckout [FAQs](https://www.reddit.com/r/PESU/comments/14c1iym/faqs/) for more factors that you would need to decide for priority order.\n└── Okay thank you so much!"
    },
    {
      "id": "mnxswtr",
      "body": "IIITB CS Anyday bro"
    },
    {
      "id": "mnxznq1",
      "body": "dumbass take iiitb cs   \nwhat is wrong with you"
    },
    {
      "id": "mny3sjk",
      "body": "You will get CSE at DTU, and if not, then Information Technology or Software Engineering for sure."
    },
    {
      "id": "mnynbtz",
      "body": "Go to either of the IIITs....rather than PESU.....if fees ain't any problem then definitely IIIT Bengaluru....I also kept an option for IIIT A as a backup now....but PESU is good only ngl....but for this rank you deserve better...."
    },
    {
      "id": "mokb1e1",
      "body": "This is a parent. Can I DM?"
    }
  ]
}