{
  "id": "1k3t4ry",
  "title": "Does PES recommend laptops to be used",
  "content": "Does PES recommend laptops (or their specs) to be used for CSE (or any other majors) 2nd year onwards or we need to pick a suitable laptop on our own?",
  "metadata": {
    "root_comment_id": "mo4qdlp",
    "post_id": "1k3t4ry",
    "author": "Unusual_Sky5634",
    "url": "https://www.reddit.com/r/PESU/comments/1k3t4ry/does_pes_recommend_laptops_to_be_used/",
    "permalink": "https://reddit.com/r/PESU/comments/1k3t4ry/does_pes_recommend_laptops_to_be_used/",
    "score": 5,
    "upvote_ratio": 0.7799999713897705,
    "created_utc": 1745173710,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "mo4qdlp",
      "body": "Nothing of that sort. Your choice to buy laptops."
    },
    {
      "id": "mo4qgxb",
      "body": "they prescribe a particular laptop. and if you don't use that specific model, you'll get a 0.5 gpa penalty per semester. \n\nif you're wondering second year onwards, they not only take attendance but also do weekly laptop checks. don't forget to bring your laptop on every thursday\n├── PesuOS ✋😭\n├── Op this a joke btw don't take it seriously mahn 😭\n│   └── I get it 💀\n└── Est-ce que vous parlez francais?\n    └── no lol. it's just what the french call a driving thing when the rear tires suddenly regain traction and send you to a slide in the opposite direction. it literally means \"racket swing\" or something i guess, but that wasn't my reason\n\n[https://www.youtube.com/shorts/KNYXRGwZQ58](https://www.youtube.com/shorts/KNYXRGwZQ58)  \nthis is what i mean\n        └── Damn, interesting, I saw your username and I realized it was in french. I am also learning French so I assumed probably you might be somewhat familiar with the language as well."
    },
    {
      "id": "mo6hptu",
      "body": "Nothing like that."
    },
    {
      "id": "mo6iate",
      "body": "They don't, but make sure to get a good one with good specs. Future proof it so that it lasts for like 6-7 years"
    },
    {
      "id": "mo94pkj",
      "body": "They don't have any restrictions but there is a helpful guide in the FAQs"
    }
  ]
}