{
  "id": "1k46vb4",
  "title": "Sem4 Isa2 CSE study plan",
  "content": "at the time im writing this, theres exactly a week left for ISA2 to start (not counting EIE)\n\nif you havent started studying yet, this message is for you:\n\ndont start with **DAA**, we have a day gap to study, and its mostly chill, you'll get by from just reading the slides, if you really dont understand something, just copy paste the algorithm name into youtube and watch a video about it, or ask chatgpt to explain it to you\n\nif you didnt pay attention in classes (like me) then **LAA** is probably harder then you're thinking it will be, i suggest just solving the [classwork problems](https://drive.anga.pro/collection/?id=hGF99WlmZbSXBUy), even if you dont know shit, just start solving, again, ask chatgpt or deepseek or whatever when you get stuck, but do practice LAA\n\n**CN** is kinda lengthy but still doable overnight, if you havent done shit in it yet, i'd suggest do it from betterpes vibha's notes, unit3 for this semester starts from page 12 of vibha's unit3, ideally you shoulda dont merged slides, but if you havent done it yet, dont do it now. you dont have the time.\n\n**OS** if *fucking* lengthy and *unfortunately*, we dont have a day gap for it, but luckily for you, OS exams in the past seem to have not gone too in-depth with the concepts, i'd suggest just quickly skim thru [the slides](https://drive.anga.pro/collection/?id=HlBC6V087e9jUPp) and if you have extra time, skim thru them again\n\ni'd love to help you and give advice for **MPCA** but frankly im still tryna figure that shit out myself, go pray to whatever god you believe in and hope they spare ur MPCA grade\n\nheres a link to the entire study stash for sem4 - [https://drive.anga.pro/collection/?id=4HDmSZ1bkQWwfFz](https://drive.anga.pro/collection/?id=4HDmSZ1bkQWwfFz)\n\n**DISCLAIMER:** *i'm not a professor nor your senior, im not exactly qualified to give out advice, if you fail, dont blame me, you're the one taking advice from a reddit post*\n\nall the best  \n\\- anga",
  "metadata": {
    "root_comment_id": "mo7tvd9",
    "post_id": "1k46vb4",
    "author": "Anga205",
    "url": "https://www.reddit.com/r/PESU/comments/1k46vb4/sem4_isa2_cse_study_plan/",
    "permalink": "https://reddit.com/r/PESU/comments/1k46vb4/sem4_isa2_cse_study_plan/",
    "score": 29,
    "upvote_ratio": 0.9399999976158142,
    "created_utc": 1745216913,
    "flair": "Study Help :table:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "mo7tvd9",
      "body": "also for EIE, just go watch some andrew tate podcast about escaping the matrix or sum shi idk (jk try to go thru QB on pesuacademy)"
    },
    {
      "id": "mo7tvna",
      "body": "They really should’ve given the holiday for CN fuckall subject\n└── in vibha notes we trust 🙏"
    },
    {
      "id": "mo7ut4n",
      "body": "What's EIE?\n├── entrepreneurship\n│   └── Is this different from CIE?\n│       └── CIE is the entrepreneurship center that is mostly responsible for conducting the course\n\nthe center is CIE\n\nthe subject is EIE\n│           └── Alright got it thanks\n└── Emotionally Incapacitated Engineers"
    }
  ]
}