{
  "id": "1k6lfbn",
  "title": "is this preference actually possible with my perc?",
  "content": "https://preview.redd.it/dh8la7iy7qwe1.png?width=1604&format=png&auto=webp&s=9c16b9a4a4e2eddac7f32b376c7cd5276b6c8716\n\ni got 94.7%ile cse possible?\n\nplease help",
  "metadata": {
    "root_comment_id": "moqvzz7",
    "post_id": "1k6lfbn",
    "author": "Opposite_Antelope804",
    "url": "https://www.reddit.com/r/PESU/comments/1k6lfbn/is_this_preference_actually_possible_with_my_perc/",
    "permalink": "https://reddit.com/r/PESU/comments/1k6lfbn/is_this_preference_actually_possible_with_my_perc/",
    "score": 13,
    "upvote_ratio": 1,
    "created_utc": 1745475917,
    "flair": "PESSAT/Admission",
    "nsfw": false
  },
  "comments": [
    {
      "id": "moqvzz7",
      "body": "Take rr campus only, after that select ec campus if you have choices\n└── I want cse most of all becuz rr and ec campus sit together for placements right....I dont want to do specialisation....\nBut atleast is cse possible in EC campus?\n    └── The quality I'd different bro keep rr above ec. There are many things but the over quality and exposure in the rr campus is miles ahead of anything in ec campus\n        └── ah okok i changed my pref to both rr and then ec"
    },
    {
      "id": "moqwtg3",
      "body": "Bro at placement cse and aiml won't matter much as I got to know, but rr campus is better than ec. Many of my friends complain about the workload there.\n├── not just for placements, i dont want to specialize soo soon, i want to go for masters later probably, if i specialize soo soon itll be tough later,,,,but cse is poosible? like acc to ur friends and u?\n│   └── For masters you need to do research and for that you need to have a research inclination. You cannot be a jack of all traits. You will figure it out by second year. And then end up specializing in the 3rd in one way or the other\n└── What?\nWorkload is the exact same lmao"
    },
    {
      "id": "mor1ybq",
      "body": "isn't there more than 4 choices??\n└── noo T\\_T"
    },
    {
      "id": "morlydp",
      "body": "You should easily get CS at ecity ig.. RR will be doubtful \n└── How would you rate this college, Also I want to know Is there a CP culture there\n    └── wtf cp????????? bro ion think they allow cp there\n        └── ![gif](giphy|GCO5WNzFmlc0vjK8cA)\n\ncompetitive programming\n            └── whutt??\n                └── Forget about it ,Also When will the counselling start ,Did you get anything on the mail?"
    },
    {
      "id": "mos2ors",
      "body": "Anything possible in EC campus at 86%ile? Like any cse spec or ece?\n└── i think ece maybe or defn eee or summ...\n    └── No eee in ec campus. Only cse, cse aiml and ece."
    }
  ]
}