{
  "id": "1k6vvcz",
  "title": "Please Help me with Preference Order",
  "content": "[I do considered exploring about CS and CS with specialization in AIML and got the following conclusion ](https://preview.redd.it/8425hop51twe1.jpg?width=2450&format=pjpg&auto=webp&s=5c812ef602b807a9c60b937f45778eb924be848f)\n\n1. CSE (AI & ML) is a **bit more math-heavy and specialized**. CSE is more flexible.\n\n[2.AI](http://2.AI) & ML variant is **more rigorous** in terms of concepts and project-based learning.\n\n3.**CSE is more versatile**, while **CSE (AI & ML)** is future-facing but narrower in scope.\n\n  \nSo; based on my conclusion this is my preference order but seniors is the high fees considerable for the electronic city? Ring Road campus is well established and great Alumini Network so I am ok with that fees!! Additionally I'm not from KA so applying through jee mains is the only option and I have a score of 95.18%ile in jee mains... What are the chances for cs at the ring road campus? and they gave only 4 choices to fill idk why?? So; should I go with the same preferance order or you would suggest any changes? ",
  "metadata": {
    "root_comment_id": "mot6vw7",
    "post_id": "1k6vvcz",
    "author": "Wizard_1857",
    "url": "https://www.reddit.com/r/PESU/comments/1k6vvcz/please_help_me_with_preference_order/",
    "permalink": "https://reddit.com/r/PESU/comments/1k6vvcz/please_help_me_with_preference_order/",
    "score": 7,
    "upvote_ratio": 1,
    "created_utc": 1745510428,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "mot6vw7",
      "body": "If I were you, I would put AIML@RR as my 2nd preference. If you work well in 1st year and have a pretty good CGPA, you can move up to CS@RR from AIML@RR\n├── You can move from any branch any campus to any branch any campus.\n├── You can move from any branch any campus to any branch any campus\n└── so my final preference should be cse rr; aiml rr; cse ecc; aiml ecc ? how hard is shifting>? although i had a doubt that they suck in online councelling and messed up in the pre-coucelling that was in march they gave a student with 92%ile cse in ecc just because his preference was aiml ecc was 2nd and a guy with 96%ile doesn't got alloted because his preference of aiml at ecc was at 3rd!"
    },
    {
      "id": "mot7jtn",
      "body": "CSE RR\nAIML RR \nCSE EC\nAIML EC\n├── out of curiosity why do you suggest rr over ec?\n│   ├── Check the FAQs\n│   └── PES RR has comparatively better \n- Faculty  \n- Fest\n- Location\n│       └── Faculty yes, Fest u can attend both so it doesn't matter, location is debatable\n│           └── Are you saying Electronic City and Ring Road are debatable?\n│               └── Yea everyone has their own preferences wrt location\n│                   └── Well yeah many IT companies are nearby. And its at 30 min drive from HSR. Other than what location benefits? Outer ring road is more towards central city.\n└── Are you sure ? Seniors say both campus are equal. Omg this is so confusing 😭\n    └── They are equal in terms of placement, different in terms of crowd\n        └── But rowlet (a passout) said crowd cant be judged based on pcm scores, and kinda true cuz between 1.8k and 4k, there isnt much difference of correctly marked answers. See [here](https://www.reddit.com/r/PESU/comments/1lni3te/comment/n0kpjzr/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)\n            └── I know rowlet, he must know better than me. You follow what he says."
    },
    {
      "id": "motaiyd",
      "body": "U will be having same perks from alumnis whether they are from EC or RR. \n\nAs of AIML, its domain specific, and everyone recommends keeping all options open, u don't know what u will like after a year or how the trends shift. \n\nUr choice filling is perfect, prioritise branch. Amount of opportunities are same. Placements are pooled, Hackathons are open to both campuses.\n\nWell listing some perks of RR over EC :-\n- Better fests. [ Not really a deal breaker, its open to both campuses ]\n- At an average, slightly better peer group. [ Try to find ur type of people, its a wide spectrum ]\n- Better Infra. [ Not that it's bad in ECC (better than other blore clgs for sure) ]\n├── alright! so I should have my preference aiml over electronic city right? so the final preferance should be cse rr; aiml rr; cse ecc; aiml ecc?\n│   └── No no pls don't fall for campus bias, go through the FAQs, they are highly detailed. \n\nOrder should be :-\n\n- RR CSE\n- EC CSE\n- RR AIML\n- EC AIML\n\nI myself switched from RR AIML to EC CSE in 2nd year [ More of a Blockchain guy 🥰 ]\n│       └── how hard is branch shifting there? is the high amount of fees worth it? A guy in comment suggested me for aiml at rr as my 2nd preference i'm confused\n│           └── 1> Depends on your GPA.\n2> No such high fee ain't worth it for a tier 2 clg.\n3> By all means don't overthink and give priority to branch, not the campus. Branch will stay forever with you.\n│               └── ok so i'm going with the same preference cse rr ; cse ecc; aiml rr; aiml ecc? you got admitted through jee mains? what was your percentile?\n│                   └── I got in through pessat.\n└── although i had a doubt that they suck in online councelling and messed up in the pre-coucelling that was in march they gave a student with 92%ile cse in ecc just because his preference was aiml ecc was 2nd and a guy with 96%ile doesn't got alloted because his preference of aiml at ecc was at 3rd!"
    }
  ]
}