{
  "id": "1k7oxda",
  "title": "4th year",
  "content": "Looking for some info about what the expectations are in the 4th year.\nHeard 7th Sem we have online classes. Will have to come to college for tests.\n8th Sem need to attend online classes if we don't secure an internship.\n\nIs 7th Sem mostly focused on Placement Prep and Capstone? \nWhat are the general expectations?\nAny tips for placements?\nDo we get enough time in the 7th sem to prep?\n\nAppreciate any help. ",
  "metadata": {
    "root_comment_id": "mp04nxf",
    "post_id": "1k7oxda",
    "author": "FlushedFool",
    "url": "https://www.reddit.com/r/PESU/comments/1k7oxda/4th_year/",
    "permalink": "https://reddit.com/r/PESU/comments/1k7oxda/4th_year/",
    "score": 26,
    "upvote_ratio": 0.9700000286102295,
    "created_utc": 1745597792,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "mp04nxf",
      "body": "8th sem u have to attend online classes even if u get an internship. Also 7th sem is placements not prep for placements\n├── Depends, if number of credits is excess, then no need to do, but tat most likely wont happen for 2026 batch\n│   └── Hi. I have come across this post while looking out for info regarding 2 credit courses in 4th year. I am right now in 6th sem, our batch would accumulate 140 credits by the end of this sem. After considering the credits for capstone (remaining 6 credits in 4th year) and internship (6 credits), it would sum upto 152 credits. To complete 160 credits, I assume we have to take 4 more 2 credit courses in 4th year. If so, could you tell how it's going to split? I mean can we do all the 4 courses in 7th sem? \n\nSince our batch had the choice of opting for special topics in 3rd and 4th sem, I have only completed 1 special in 2nd year, so I would have to do 5 courses in total. Would it be better to do this extra one in this summer or is it feasible to complete all 5 courses in last year? I would assume online classes are better than 1 week summer course? This is why I wanted to know about the split. Is there any max limit of 2 credit courses that could be taken in final year?     \n\nThank you for your time!\n└── Hi. I have come across this post while looking out for info regarding 2 credit courses in 4th year. I am right now in 6th sem, our batch would accumulate 140 credits by the end of this sem. After considering the credits for capstone (remaining 6 credits in 4th year) and internship (6 credits), it would sum upto 152 credits. To complete 160 credits, I assume we have to take 4 more 2 credit courses in 4th year. If so, could you tell how it's going to split? I mean can we do all the 4 courses in 7th sem?\n\nSince our batch had the choice of opting for special topics in 3rd and 4th sem, I have only completed 1 special topic in 2nd year, so I would have to do 5 courses in total. Would it be better to do this extra one in this summer or is it feasible to complete all 5 courses in last year? I would assume online classes are better than 1 week summer course? This is why I wanted to know about the split. Is there any max limit of 2 credit courses that could be taken in final year?\n\nTo clarify capstone is going to be (4+2) in 7th and 8th sem respectively and all 6 internship credits from 8th sem.\n\nThank you for your time!\n    └── Idk about u guys but for us it was 140 till 6th sem. In 7th sem 10 credits (6 from capstone and 4 from 2 special topics). In 8th sem also it's 10 credits (6 from internship, 2 from capstone and 2 from 1 special topic). Ig for u guys capstone credits have been spread across more semesters so not sure what'll happen.\n\nWhat I've mentioned above is the minimum that everyone must compulsorily take in 7th and 8th even if u have more than the required credits. If u have shortage of credits they do allow u take additional special topics in 7th sem only.\n        └── It's 140 till 6th sem for us too. In 7th sem, it's 4 capstone and 3 special topics I assume. In 8th sem it's the same with 6 from internships and 2 from capstone. So in total 8 credits worth of special topics in 4th year. \n\nIf I got it right, one (can't be more) special topic has to be taken in 8th sem. So the remaining 3 (4 for me) special topics has to be taken in 7th sem. I hope it's logistically possible, saw the esa timetable of 8th sem special topics, they were overlapping with each other. And lastly, are all special topics in 7th sem online? If so I assume that would be better than doing a summer course?\n            └── Yes in 7th sem there were groups and u could select 1 special topic from each group this was done to avoid scheduling challenges so yes it is possible to take more special topics in 7th sem depending on how many groups there are. \n\nYes all classes are online either class on teams on Saturday or it's NPTEL course that's available online. \n\nBut summer course gets over in a week and u don't have to worry about an additional course for an entire semester and u could focus better on placements. If u have nothing going on this summer I would recommend getting it done in the summer itself. \n\nLast year it was pure chaos they told everyone has to get to 140 at the end of July, so people had to abandon the last week of their internship in order to attend summer course. And afterwards they gave the option of doing special topic in 7th sem.\n                └── That's great. How many groups were there in your batch?\n\nThank you! Would do the summer course then.\n\nYup, heard about the last moment announcement of new policy from college side. That was terrible management from them. Hopefully you have got placed and doing well.\n                    └── Dm I'll send u the timetable of 7th sem and special topics guidelines if I find it"
    },
    {
      "id": "mp2jxgl",
      "body": "complete capstone implementation as early as possible, and focus on placement, dsa plays a major role to get a good paying company.\n\nand try to get into a company where it provides internship+fte so you don't need attend for fte even if you have an only internship offer\n└── DSA ?\nfte ?\n    └── dsa is coding (leetcode,hackerrank),fte is fulltime offer"
    },
    {
      "id": "mp6p827",
      "body": "7th Sem is for the experimentation for CAPSTONE. The classes will be there but the CAPSTONE will be the majority. 8th sem is for internships (special topic only if you don't get a paid internship) and publishing a paper for CAPSTONE."
    },
    {
      "id": "mpmtpoh",
      "body": "Bro I’m taking Electronics and communication is it good there or any intention internship ? And what’s the salary package for EC"
    }
  ]
}