{
  "id": "1k9pdj4",
  "title": "CCBD CDSAML ex-interns",
  "content": "How was the whole experience last time around? Is it worth it or should I choose other centres like Rapid, pvl,etc over it?\nAlso if you have interned at any other centres please do share your thoughts as it might be helpful to others.",
  "metadata": {
    "root_comment_id": "mpg3zew",
    "post_id": "1k9pdj4",
    "author": "CharlesMarcLeclerc",
    "url": "https://www.reddit.com/r/PESU/comments/1k9pdj4/ccbd_cdsaml_exinterns/",
    "permalink": "https://reddit.com/r/PESU/comments/1k9pdj4/ccbd_cdsaml_exinterns/",
    "score": 12,
    "upvote_ratio": 1,
    "created_utc": 1745823495,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "mpg3zew",
      "body": "Pvl/pil or stay at home. Don't waste your summer with the \"internship\"\n└── Not everyone has had a bad experience. Just ask the alumni from those labs who still keep in touch with the profs and the ongoing projects."
    },
    {
      "id": "mpg5vh3",
      "body": "I see so many posts and comments saying most research centres on campus are bad. I would disagree. See they're not marvelous or anything but they're not bad either.\nDon't go in with expectations of something mind-blowing. It just gives you an opportunity to work on a project and if you work hard it would lead to a publication.\nIt gives you something to put in your resume, the research is great practice for capstone, you can build connections with professors for LORs. \nIf you somehow get an internship in a company go right ahead. But if you don't ( which most won't) this is definitely better than sitting home.\nAll in all if you do it with a good group of people it'll be a pretty chill good experience.\n└── Bud You could've started with I'm Fine with mediocrity and saved everyone the paragraph\n    └── Don't read the paragraph if you don't want to, but all the points posted are valid. People expect too much from these labs and go in with the wrong expectations."
    }
  ]
}