{
  "id": "1kakcj8",
  "title": "ECE is good?",
  "content": "I graduated from 12th and I got pes university and EC subject I heard it’s good for both hardware and software so what’s the salary package you get or any good jobs and what’s the opportunity for this subject in PES and is it gonna be worth studying this subject bcz my score isn’t really good for CS so I had to take EC but idk its job opportunities can anyone here help me how is the opportunity or anyone who got into some good jobs.\n",
  "metadata": {
    "root_comment_id": "mpugkev",
    "post_id": "1kakcj8",
    "author": "ruchitherenyeager",
    "url": "https://www.reddit.com/r/PESU/comments/1kakcj8/ece_is_good/",
    "permalink": "https://reddit.com/r/PESU/comments/1kakcj8/ece_is_good/",
    "score": 6,
    "upvote_ratio": 0.800000011920929,
    "created_utc": 1745921350,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "mpugkev",
      "body": "ECE as a subject is intense. You gotta love mathematics to survive. Unfortunately its neither hardware or software, syllabus is such that by the end of course you will be thorough with simulations, but hardware skills~~ meh. Not more than 20 get placed in core companies as the industry required really experienced individuals. Most of the students end up choosing to pursue higher studies. Placement stats: about 110 got placed out of which around 20 core jobs in VLSI / Verification/ Design. Remaining switched to software, some took management role in Flipkart etc.\n└── I have a really good interest in software so by taking this subject can I get into Google or Microsoft like this subject isn’t purely software so would the companies like Google take me if not India maybe abroad?\n    └── Okay, if you are interested in software, it’s better not to take it. ECE is a very weird place to be in if you like software. Trust me there is nothing thought in the department that will benefit you (software).\nThe amount of time put to learn the core subjects will eat away any free time you have to learn software. So in that case highly advice to avoid ECE. However if you consider yourself someone who can manage to major in ECE and pursue a minor in cse then, it’s your call."
    },
    {
      "id": "mq0be7k",
      "body": "regretting after taking it\n└── Is it bcz of subject or job no opportunity?"
    },
    {
      "id": "mq178ps",
      "body": "The coursework is intense but fun if you learn it the right way from the right sources you'll have a fun time, coming to placements it's non existent 4-5 core companies come once and hire 2-3 at max but if you get through the growth curve is exponential!"
    }
  ]
}