{
  "id": "1kb80ow",
  "title": "Which campus is better for Computer science ? Ring road, or Electronic city ?",
  "content": "",
  "metadata": {
    "root_comment_id": "mpsdz2r",
    "post_id": "1kb80ow",
    "author": "Careless_East_1088",
    "url": "https://www.reddit.com/r/PESU/comments/1kb80ow/which_campus_is_better_for_computer_science_ring/",
    "permalink": "https://reddit.com/r/PESU/comments/1kb80ow/which_campus_is_better_for_computer_science_ring/",
    "score": 10,
    "upvote_ratio": 0.8600000143051147,
    "created_utc": 1745987455,
    "flair": "Admissions",
    "nsfw": false
  },
  "comments": [
    {
      "id": "mpsdz2r",
      "body": "RR\n├── Thanks\n├── Nigga both are equal (speaking as someone in RR). You ain't even in college yet according to your post history, how'd you come to that conclusion\n└── But the faqs say they are about the same?\n    └── Rr definitely has better students as kcet cutoff is lower\n        ├── I am not shooting myself in the foot by choosing ec right?\n        ├── PCM abilities don't translate to how good a CS engineer you'll be. Clearing KCET cutoffs for RR doesn't make you \"better at CS\". It just means you're good at PCM problem solving. If you really think RR is better, take a look at the average GPAs when scholarship lists are released - the scores are nearly identical, with a ±0.5. \n\nThe better student is simply one who is better skilled at CS. Their PCM solving skills hardly contribute. You'll find some of the best alumni to have come from ECC.\n        │   └── I don't know when you last checked but the scholarships for RR and ECC are radically different.An 8.9 in 3rd sem rr would fetch you a DAC while a 9.05 in ECC would get you an MRD.\n        │       └── Outliers. I have seen scholarship lists for both campuses throughout my 4 years, as well as a year or two after. However, I do admit, I have not seen it this year, but from my prior observations, in *most* cases, there is <0.5 difference. Exceptions do exist like you pointed out but lets not generalise and say it *always* happens.\n        │           └── 0.5 is a sizeable [difference.As](http://difference.As) someone who shifted from EC to RR it's funny how people with >0.5 gpa difference in EC end up with the same scholarship.\n        └── Bruh, my own classmates, currently in second sem....few ppl literally rank below 1200 in kcet, imagine, they all have less than 8.8 sgpa while my other friends who had 12k 6k one with 20k,they literally have way more than 9 sgpa one with 9.6....so ya...."
    },
    {
      "id": "mpsorlw",
      "body": "RR is better slightly , However if you have much travel time to rr compared to ecc , choose ecc , Dont waste your time travelling."
    },
    {
      "id": "mpstzsp",
      "body": "Better in *which* aspect? Both have the same placements since they are pooled. Profs, research labs, are kinda average at both. You could say that the peer group is marginally better at RR, but the difference is not statistically significant and unlikely to affect you.\n└── Thanks."
    },
    {
      "id": "mptlyss",
      "body": "Can i get cse in pes ? My jee rank is 76000 and ews rank 1000\n└── no reservation in pes, only ur general rank matters. Just curious, pes jee fees is 5 lakhs a year, and ews needs u to have a family income of less then 8 lakh, wouldn't that be hard to manage or ur taking a loan?"
    },
    {
      "id": "mptyhaw",
      "body": "Cet kid here with rank. Could've gotten rr cse in 2nd round but choose ec cuz it's way more convienient to travel to electronic city.\n\nThe fomo is real , campus infra is way better at rr.  , lots of improvement in infra could be done here.\n\nI still like it here tho, campus is peaceful and large, I kinda find the immense crowd at rr nauseating.\n\nCrowd ehh can't comment, it's a nice blend of many kinda people tho so wasn't very hard finding friends.\n\nMy teachers are good, tho some of them care wayy too much and can sometimes give off school teacher vibes.\n\nIn the end choose whichever one u won't end up crying about later cuz of fomo XD, both campuses have their cons and pros\n visit both campuses and make ur choice\n└── Thanks."
    },
    {
      "id": "mpvisxm",
      "body": "Is ec campus well connected? Like is there bus/metro near college\n└── bus is there, metro will start \"soon\", the station is right in front of college. The construction of yellow line is completed but they are waiting for coaches, so it might start in 8-12 months from now.\n    └── Okay thanks"
    },
    {
      "id": "mq72bqj",
      "body": "Campus Infrastructure is much much better at RR. If you're joining a club, it's much more easier to get funding in RR than ECC. ECC students/peer group is great, the faculty is average in both campuses. The only problem is the management treats ECC like a cash cow and doesn't improve any infrastructure here. The buildings have a night and day difference, at least the engineering block"
    }
  ]
}