{
  "id": "1kc97t4",
  "title": "How does management quota at PES work",
  "content": "Outside state student, 96 percentile in mains, general male ,  cooked, want cs, how to apply and what is cost",
  "metadata": {
    "root_comment_id": "mq0qk8e",
    "post_id": "1kc97t4",
    "author": "RogueMonarch",
    "url": "https://www.reddit.com/r/PESU/comments/1kc97t4/how_does_management_quota_at_pes_work/",
    "permalink": "https://reddit.com/r/PESU/comments/1kc97t4/how_does_management_quota_at_pes_work/",
    "score": 14,
    "upvote_ratio": 0.9399999976158142,
    "created_utc": 1746107418,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "mq0qk8e",
      "body": "Not entirely sure, but you might get CS or ECE in PES at 96 percentile. In their website the fees mentioned is 5 lacks/year"
    },
    {
      "id": "mq0t15s",
      "body": "If im not wrong it's 64L for cse could be more.Also only that is not enough your late for management because people start applying for management from November-December \nImo it is not worth 64L \nLastly it's your choice\n└── Oh it’s 64 lakhh🤡"
    },
    {
      "id": "mq0t8pz",
      "body": "I think you need to visit the campus and find out, it's not an online process as far as I remember. \n\nAlso, unwanted uncle opinion - this place is not worth the management quota fees.\n├── \\+1, it's not worth any fees for that matter. The teacher quality has become much worse compared to pre covid times. We are just paying for placements\n│   └── I'd say it's worth it if you're from CET though. Pretty affordable and you get great placement opportunities.\n└── Alright"
    },
    {
      "id": "mq129cw",
      "body": "u will get a seat through JEE main chill\n└── Really cs at 96 ?"
    },
    {
      "id": "mq19e6c",
      "body": "You will get cse from jee mains itself in PES\n└── Sure ?\n    └── Yeah one of my friend was getting ECE for 83%ile itself in main branch. You can definitely get CSE for 96%ile. But keep in mind that the fees is more if you go through mains, it's 5L per annum excluding hostel fees i believe."
    },
    {
      "id": "mq1frgd",
      "body": "I think it’s 11-12L per year\n└── That’s way too expensive"
    },
    {
      "id": "mq28p8q",
      "body": "Why not thapar?\n├── 96 pe cs Nahi milta\n└── 96 pe no cs"
    }
  ]
}