{
  "id": "1kcbeih",
  "title": "Psychology?",
  "content": "Is PES good for Bsc Hons Psych? any students studying psych here?",
  "metadata": {
    "root_comment_id": "mq5rk48",
    "post_id": "1kcbeih",
    "author": "ProduceOk6090",
    "url": "https://www.reddit.com/r/PESU/comments/1kcbeih/psychology/",
    "permalink": "https://reddit.com/r/PESU/comments/1kcbeih/psychology/",
    "score": 1,
    "upvote_ratio": 1,
    "created_utc": 1746112966,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "mq5rk48",
      "body": "I'm second year psych student.\nIt's really good you can consider it.\n├── do you guys have labs too? how's the course and faculty?\n│   └── Yes we have lab every Tuesday \nAnd faculty is good but don't expect too much in college eveything is upto us\nComing to course it's so fascinating the subjects eveything.\n└── How is the first day of psychology class? Like how does it go?\n    └── Okay so classes doesn't commence as soon as you come, first week of college we had a bootstrap which they mix all the department make a teams and  build our friendship or whatever as we are new to environment. \nThat's where you make new friends and groups.\n\nSo coming back to first day of college I still remember all most every professors asked us the same questions Introduction and \"why did you choose psychology\"? So be ready with this answer almost the whole sem we kept answering.\nThey go with basic Introduction of psychology and subject related intros so nothing that serious about 1 week and after that they'll dive into topic.\nClasses are pretty chill and intresting almost half the chapter they do it by interacting with us so it's basically you gonna have \"Interactive section\" so it doesn't put you into sleep.\n\nIn conclusion it's worth joining pes for psychology initial it will pretty chill but as soon as day passes it gets hectic with so many research papers and case reports just be ready.\n        ├── Ok got it! \n\nIs there anything you wish you had done before college started that would have helped you with the course? Would you mind sharing it? It could really help me. Also, I have a lot of free time right now, and I’m not sure how to use it. I’d like to do something related to the course, but I’m not sure what.\n        └── Hey! Just checking in—hope you’re doing well. I was wondering if you had a moment to share any advice about preparing for college/psychology before classes start. Totally understand if things are busy on your end!\n            └── Hey! I'm doing well...I hope you're enjoying the holidays anyway if you're that intrested to studies go with general ones coz everyone are like you new and clueless about the college it takes time to get adjust to classroom environment.\nI would suggest you to go with some research papers and stuff because once you come to college you will be wind up with research nd case reports so yes I would like to suggest to be ready what anol your plans regarding that would be great helpfull for you and makes your things easy!!!\n                └── hows the department in terms of faculty? welcoming or ? i had my interview yesterday and just gotin. i wnated a bit more info before i decided. is it extremely hectic or manageable still? they mentioned internships yesterday saying we would get to work in the psych dept of their hospital. is all that true or just bait?"
    }
  ]
}