{
  "id": "1kf6lnq",
  "title": "PES at 33K jee rank",
  "content": "Is it worth taking pes cs over some IIIT cse ?\nAnd can someone tell me about college life and placement in PES",
  "metadata": {
    "root_comment_id": "mqod2hh",
    "post_id": "1kf6lnq",
    "author": "joblessvirgin69",
    "url": "https://www.reddit.com/r/PESU/comments/1kf6lnq/pes_at_33k_jee_rank/",
    "permalink": "https://reddit.com/r/PESU/comments/1kf6lnq/pes_at_33k_jee_rank/",
    "score": 9,
    "upvote_ratio": 0.7599999904632568,
    "created_utc": 1746433973,
    "flair": "Admissions",
    "nsfw": false
  },
  "comments": [
    {
      "id": "mqod2hh",
      "body": "You can check pec ee it's also a good option if branch compromise kar skte\n└── What's the average placements and department scenario"
    },
    {
      "id": "mqoh6s9",
      "body": "Cheaper government colleges available at that rank\n└── Damn which ones?\n    └── Pec \nLower branches in lower nit \nLots of lower IIIT\n        └── I mean u can't rly compare two different branches like that. \nU compare pes cse ece etc with other colleges' cse ece etc.\nUr not supposed to sort based on college first, sort based on the branch u want then take the best college u are getting. \n\nBesides who tf wants to go to some mediocre college in the middle of nowhere.\n            └── Ok 👍"
    },
    {
      "id": "mqohs3o",
      "body": "Don't even think about it lol. For the fee you're paying thru jee mains quota it's not worth it. If you're getting better government colleges then take it."
    },
    {
      "id": "mqokad3",
      "body": "See, I also had a similar circumstances last yr, IIIT Sonipat or any 2nd gen IIIT vs PES CSE in RR (KCET)....since my hometown is blr and fees also is less, I joined here...and also which IIIT will you be getting?? If you get like hyd, blr, Allahabad or Delhi or even Lucknow....then it's better to go with IIIT....else he'll naw....and also since your thinking to join via JM then you definitely have to give your best to receive the CNR or MRD Scholarships, then it's definitely worth it....as they refund 40% and 50% of you tuition fees overall....for more go through the sub and figure it out....and don't give up so easily....prepare for advanced....you have less than 2 weeks now....ALL THE BEST TO YOU...."
    }
  ]
}