{
  "id": "1kg57fq",
  "title": "How is PES?",
  "content": "I finished my 12th and now looking for good colleges in Bangalore. I heard PES was a good choice but i want to know everything about it it before joining here. what are your opinions on the Bangalore branch of this college? ",
  "metadata": {
    "root_comment_id": "mqvxdkr",
    "post_id": "1kg57fq",
    "author": "BirdRevolutionary777",
    "url": "https://www.reddit.com/r/PESU/comments/1kg57fq/how_is_pes/",
    "permalink": "https://reddit.com/r/PESU/comments/1kg57fq/how_is_pes/",
    "score": 0,
    "upvote_ratio": 0.25,
    "created_utc": 1746540019,
    "flair": "Admissions",
    "nsfw": false
  },
  "comments": [
    {
      "id": "mqvxdkr",
      "body": "https://preview.redd.it/dyrjtbv156ze1.jpeg?width=500&format=pjpg&auto=webp&s=ae587ce53523f2458537bb9c812fff3d66d217f7\n\nthis subreddit in a nutshell"
    },
    {
      "id": "mqvytxv",
      "body": "dawg just don't ask it, i got flamed in this subreddit for asking the same question a week ago. question got removed by the mods. use the search bar and delete ur question before these people come and flame u too.\n├── Its nothing personal - these questions are asked every year by applicants, and they have been answered in lot of detail already. The answers are also frequently updated so they don't get outdated. Using the search bar will not only give you instant answers (which btw, have been verified), but it also helps clean the subreddit clean and bring more views to posts that actually need attention or answers. \n\nThe goal is simple: keep posts that need genuine help rather than ones that ask the same dear beat questions.\n└── I was expecting that so I used a different account. Appreciate it tho"
    },
    {
      "id": "mqvyuh5",
      "body": "Your question or post has already been answered in the FAQs. Before making a new post, always remember to search the subreddit and/or check the FAQs. Duplicate posts will entail deletion. \n\nFAQ link: https://bit.ly/pesu-faq."
    }
  ]
}