{
  "id": "1khk0ou",
  "title": "Applied for pesu, doubts about two topics: how's the main campus's girl's hostel? and should i go for cse core or specialization",
  "content": "in the hostel: 1) are we allowed to wear shorts (not super short, just a decent length) 2) are wardens strict? 3) hostel timings and distance from campus. im a non local btw",
  "metadata": {
    "root_comment_id": "mr7kt4e",
    "post_id": "1khk0ou",
    "author": "rainbow_throwup",
    "url": "https://www.reddit.com/r/PESU/comments/1khk0ou/applied_for_pesu_doubts_about_two_topics_hows_the/",
    "permalink": "https://reddit.com/r/PESU/comments/1khk0ou/applied_for_pesu_doubts_about_two_topics_hows_the/",
    "score": 7,
    "upvote_ratio": 0.8999999761581421,
    "created_utc": 1746688337,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "mr7kt4e",
      "body": "2) pick cse core : you can explore many fields, if you want specilization you can still take it via elective courses in 3rd year.\n└── Thank you for the advice. I’ll go with cse core!"
    },
    {
      "id": "mr8iljn",
      "body": "Check FAQs - there's a detailed answer on CS vs specialisation.\n└── Alright, thank you!"
    },
    {
      "id": "mrbf4xg",
      "body": "if u don’t mind 7pm curfew and mid food it’s not that bad- suggest you to go look at them first tho \nshorts aren’t allowed in mess but depends on warden, sometimes they are nice , some are strict plus there are many different hostels units all around 1.5km from college but we have buses \n\ngo for cse core\n└── Thanks for the info! Btw are the classes at uni done by 4? So that we have the time between 4-7 to ourselves? \n    └── The classes start at 8AM in odd semesters. It ends at 1PM on two days (usually on Wednesdays +1 other day). Two other days it end at 3:15PM and one day it’ll end at 4PM. \nIn even semesters, classes start at 8:45AM. It ends at 1:45PM on two days, 4PM on the other two days and 4:45 on one day. Saturday’s are off. There will be an online class of 2 credits course for 2 hours.\n        └── alrightt, thanks for the info!"
    }
  ]
}