{
  "id": "1kih4eb",
  "title": "Need help",
  "content": "I got 88%(ik a bad score)  in Jee mains  OBC-NCL, can I get CS in pes? (Any specialization ig) Heck can i even get a seat in PES i really don't wanna waste 1.5k for the registration if there is no chance for me to get anything good with 88%",
  "metadata": {
    "root_comment_id": "mreqxfy",
    "post_id": "1kih4eb",
    "author": "AlbatrossNo9359",
    "url": "https://www.reddit.com/r/PESU/comments/1kih4eb/need_help/",
    "permalink": "https://reddit.com/r/PESU/comments/1kih4eb/need_help/",
    "score": 1,
    "upvote_ratio": 1,
    "created_utc": 1746793285,
    "flair": "Admissions",
    "nsfw": false
  },
  "comments": [
    {
      "id": "mreqxfy",
      "body": "Maybe CS-AIML at PES EC Campus... if your willing to pay 5L/year you shoudnt think much about paying 1.5k as registration fee...\n└── My parents set a condition that I have to pay for any entrance exams/application outside of my home state from my own pocket as they kinda don't want me to go out of state but i don't wanna stay here so yes 1.5k is quite a bit \n\n\nI really want to go to banglore i have decent chances with manipal/amrita banglore but no CS in those two \nSo I am thinking of PES but i obviously had to know if I even have any chances \n(I am actually fine with any other branch but i heard PES is only good for CS so i specified CS specifically)\n\nIk I already said too much but what is EC campus?\n    └── Ah i get you, there are a few parents who are strict about not leaving their kids outside home... \n\nPES has 2 campuses in Bangalore for engineeering.. RR and EC. RR is sligtly harder to get into but both the campuses are similar when it comes to placement oppurtunities etc.\n        └── If it's not an inconvenience can I ask a few questions?\n\n1. Is it really not worth taking any other branch than CS related in PES\n\n2. How is the life on campus and the peer group (really important for me)\n\n3. What facilities are available (like gym, swimming pool etc)\n\n4. How's the mess food\n\n\n5. And just how strict are they regarding everything\n            └── 1. I'm in first year right now so cant answer that as of now(refer to the FAQ's)\n\n2.  Campus is small and peer group is great here\n\n3.  Pretty much all the outdoor(cricket,football etc.) and indoor (gym,TT,badminton,chess,pool table) facilities except a swimming pool\n\n4. Mess food is decent. \n\n5. They are strict regarding attendence (75%) and heard that hostel rules are also pretty strict."
    }
  ]
}