{
  "id": "1kj19tr",
  "title": "Thanks guys",
  "content": "Thanks to all you modi supporters-who have never read a history book in their life. Modi got us into fucking war. \n\nAfter the devastating Pahalgam terror attack that killed 28 civilians, the Modi government responded with Operation Sindoor, launching missile strikes deep into Pakistani territory on May 7, 2025. While supporters call it a decisive response to terrorism, critics argue that the escalation was reckless and politically motivated, with India bypassing international diplomacy and regional dialogue. The retaliation from Pakistan has already led to dozens of deaths, blackouts across northern states, and the closure of civilian airspace.\n\n\nNarendra Modi’s tenure has been marked by a series of high‑profile missteps that have undermined economic stability, democratic norms, human rights, and social cohesion. From the 2016 demonetization that crippled small businesses and disrupted the informal sector ￼ to the catastrophic handling of the COVID‑19 pandemic that led to oxygen shortages and undercounted deaths ￼, his policies often appear driven by political optics rather than expert input. The introduction and eventual repeal of controversial farm laws after mass protests highlighted a disconnect with rural stakeholders ￼, while media freedom has plummeted to 151st globally under broad legal and extralegal pressures ￼. Concurrently, the abrogation of Article 370 in Kashmir triggered prolonged blackouts and detentions ￼, and unemployment has stubbornly remained above 8%, with youth unemployment near 18% ￼. Together, these issues paint a portrait of governance that prioritizes centralized control and ideological narratives over inclusive, evidence‑based policymaking.\n\nEconomic Policy Missteps\n\nDemonetization Debacle\n\nModi’s 2016 demonetization abruptly invalidated 86% of India’s currency in circulation, causing small‑scale traders and micro industries to suffer up to 60% job losses and a 47% drop in revenue ￼. Subsequent analyses revealed the policy did little to curb black money while further decelerating credit growth in the MSME sector ￼.\n\nCrisis Management Failures\n\nCOVID‑19 Response Haemorrhaged Lives\n\nDuring the 2021 COVID‑19 surge, the government’s reluctance to heed expert warnings led to severe oxygen shortages and a death toll widely regarded as undercounted by hundreds of thousands ￼.\n\nFarm Laws and Rural Disconnect\n\nIn 2021, three farm laws were enacted without adequate stakeholder consultation, provoking year‑long protests that culminated in their repeal, underscoring a significant gap between the government and its agricultural base ￼.\n\nDemocratic Erosion and Human Rights\n\nMedia Freedom and Journalist Intimidation\n\nUnder Modi, India’s press freedom ranking fell to 151st out of 180, with journalists facing threats, censorship, and even violence for covering sensitive topics ￼. The 1967 Unlawful Activities (Prevention) Act has been used to charge at least 15 journalists and detain 36 since 2014, weaponizing legal tools to stifle dissent ￼.\n\nJudicial Interference\n\nThe Modi administration has been accused of undermining judicial independence by delaying the appointment of judges and exerting executive influence over key cases to shield political allies ￼.\n\nRevocation of Kashmir’s Autonomy\n\nThe unilateral abrogation of Article 370 in 2019 led to a protracted communications blackout, the detention of political leaders, and a persistent security lockdown in Jammu and Kashmir ￼.\n\nHuman Rights Abuses Against Minorities\n\nHuman Rights Watch reported that Modi’s election campaigns were fueled by hate speech targeting minority communities, violating India’s obligations under international human rights law ￼. Amnesty International has documented how financial and investigative agencies have been weaponized to intimidate civil society, activists, and critics ￼.\n\nSocial and Economic Polarization\n\nUnemployment Crisis\n\nDespite sustained economic growth figures, unemployment has remained above 8%, with youth unemployment reaching nearly 17.8%, reflecting a failure to generate sufficient jobs for new labor market entrants ￼.\n\nCommunal Polarization\n\nCritics argue that Modi’s Hindutva‑driven rhetoric has deepened religious and social divides, contributing to communal violence and fracturing India’s pluralist fabric ",
  "metadata": {
    "root_comment_id": "mrja82g",
    "post_id": "1kj19tr",
    "author": "Due-Flan8470",
    "url": "https://www.reddit.com/r/PESU/comments/1kj19tr/thanks_guys/",
    "permalink": "https://reddit.com/r/PESU/comments/1kj19tr/thanks_guys/",
    "score": 0,
    "upvote_ratio": 0.2800000011920929,
    "created_utc": 1746849053,
    "flair": "Meme :snoo_dealwithit:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "mrja82g",
      "body": "Rage Bait?"
    },
    {
      "id": "mrjab6o",
      "body": "Send this mf to a MUN, we dont need your opinions here"
    },
    {
      "id": "mrjabgm",
      "body": "And how is this related to PES?"
    },
    {
      "id": "mrjac2a",
      "body": "https://preview.redd.it/rul4y7xunvze1.jpeg?width=1080&format=pjpg&auto=webp&s=1ba74f8b9ab8566835a4252558cbfcfbb6f85e84"
    },
    {
      "id": "mrjah5k",
      "body": "did you \n\n\ndid you chatgpt this shit?"
    },
    {
      "id": "mrjzbwb",
      "body": "disrespectfully, end yourself"
    }
  ]
}