{
  "id": "1kolvgn",
  "title": "About EC Hostel Rooms.",
  "content": "As the fee payment has started for joining the EC hostel, I've heard that there are some issues with some rooms, like network issues, water problems, and ventilation issues. Can Seniors please advise us about the hostel? Which floor is better, as we need to stay for three years there?",
  "metadata": {
    "root_comment_id": "msr7jmj",
    "post_id": "1kolvgn",
    "author": "Flash_00007",
    "url": "https://www.reddit.com/r/PESU/comments/1kolvgn/about_ec_hostel_rooms/",
    "permalink": "https://reddit.com/r/PESU/comments/1kolvgn/about_ec_hostel_rooms/",
    "score": 4,
    "upvote_ratio": 1,
    "created_utc": 1747461190,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "msr7jmj",
      "body": "Some rooms don't get proper network, even the zero delivery guys complain about bad reception whenever they have to complete their deliveries here. Some 3 window rooms are hot in summers. Like if you enter your room after a few hours, the corridor seems cooler than your rooms. Some rooms smell weird. Can't really point out what exactly smells, but smells. And one issue that's not pointed out a lot is that, some room's toilets don't flush completely and that's a big issue. If a complaint is registered in the office registry, the plumbers just come and put acid and leave. That doesn't make it any better. \n\nSo make your decision. If you want to experience a little hardship for you to tell your grandkids about, then go ahead, our smelly rooms are waiting for you!\n└── Damn Bro. Can you mention some better rooms? I am feeling traumatised  🫥\n    └── If u managed well in amaatra , it's not that bad and definitely manageable here also"
    },
    {
      "id": "msr9nvq",
      "body": "Plus, the warden/supervisor is super arrogant, and if you tell him about all these problems, he'll just say, \"If you don't like it in here, just vacate\". That really pisses people off after hearing that because all of us pay 1,70,000 and the guy lets us occupy the room only after showing the fees paid receipt. \n\nAlso, during the morning rush hours (7:00 to 8:30 AM) water doesn't come in any of the taps and this happens quite frequently and since there will be three of you in the room, such problems will just make you miss the morning class. When I told this to the warden, he asked me to wake up at 4 AM and take a bath."
    },
    {
      "id": "msrf1zo",
      "body": "any such problems for the RR campus hostel?\n└── iam from ec campus, so i dont know 😅"
    }
  ]
}