{
  "id": "1ks1dxl",
  "title": "Fresher's doubts please help seniors",
  "content": "Hi , I am joining pes university in ECE branch planning on making my career based on robotics , I have a few doubts regarding the college please DM seniors I need help very confused whether to select this college which is not under VTU or choose RVCE but outdated syllabus . \n",
  "metadata": {
    "root_comment_id": "mths8rz",
    "post_id": "1ks1dxl",
    "author": "MR_parker2007",
    "url": "https://www.reddit.com/r/PESU/comments/1ks1dxl/freshers_doubts_please_help_seniors/",
    "permalink": "https://reddit.com/r/PESU/comments/1ks1dxl/freshers_doubts_please_help_seniors/",
    "score": 0,
    "upvote_ratio": 0.4399999976158142,
    "created_utc": 1747842965,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "mths8rz",
      "body": ">please DM seniors\n\nIf *you* have questions, it is not *their* job to DM you. \n\nJust go ahead and post your questions; someone will get to them when they can. Or join the Discord server, and someone will assist you there on the Ask-a-senior channel. There is also a detailed FAQs on this sub.\n└── It is not mentioned in the FAQ that's why.\n    └── You didn't mention your questions in the post. You just asked for seniors to DM. \n\nAnyway, my other points still stand."
    },
    {
      "id": "mtid7ac",
      "body": "No seniors will DM you, just post here or ask on Discord server please. people will assist you.   \nRobotics is a good choice btw"
    },
    {
      "id": "mtl7u08",
      "body": "\n\nWhat is the structure of the ECE curriculum (theory vs. labs)?\n\n\n\nHow updated is the syllabus with a current industry oriented curriculum?\n\nWhich companies recruit ECE students specifically?\n\n\nHow early do students start preparing for placements?\n\n\nAre there any ECE-focused technical clubs?\n\nWhich clubs are most active and useful (coding, robotics, entrepreneurship)?\n\nAre clubs open to first-year students?\n\nHow to get into top-performing teams (like hackathon-winning teams)?\n\nHow’s the crowd at PES RR? Friendly, competitive, collaborative?\n\nHow do you manage GPA + projects + clubs effectively?\n\nWhat mistakes should I avoid in the first year?\n\nWhich online resources help with ECE at PES (YouTube channels, sites)?\n\nAre there notes or resources passed down from seniors?\n\nWhat scholarships are available for merit or financial need?\n\n\n\n\nHow hard is it to maintain the eligibility for merit scholarships?\n└── Update your post description, do not make a new comment."
    }
  ]
}