{
  "id": "1ktju77",
  "title": "Incorrecr Jee Main CRL being displayed",
  "content": "I logged in earlier and it was showing my corret crl which i entered (81XXX) but this is whats being show now. Does anyone else have the same issue",
  "metadata": {
    "root_comment_id": "mtu16to",
    "post_id": "1ktju77",
    "author": "rynmuneer",
    "url": "https://i.redd.it/1ai7ndg3cj2f1.png",
    "permalink": "https://reddit.com/r/PESU/comments/1ktju77/incorrecr_jee_main_crl_being_displayed/",
    "score": 13,
    "upvote_ratio": 1,
    "created_utc": 1748007619,
    "flair": "Admissions",
    "nsfw": false
  },
  "comments": [
    {
      "id": "mtu16to",
      "body": "Call kro bhai staff ko\n└── Did u check urs? Is the correct crl being displayed?"
    },
    {
      "id": "mtu1hdb",
      "body": "last kab login kiya tha?\n└── Morning it was correct then"
    },
    {
      "id": "mtu1jmi",
      "body": "welp call pesu and ask them what to do"
    },
    {
      "id": "mtu1ljj",
      "body": "Yes mine is correct I checked\n└── Did u fill in both the jee percentile session 1 and 2???\n    └── yes\n        └── Your second attempt percentile was less by any chance?\n            └── more than first attempt and you should call or mail them\n                └── Not picking up call office hours is up\n\nTomorrow is  Saturday office will be closed apparently ,trying to mail them to see if they respond"
    },
    {
      "id": "mtu5kd9",
      "body": "Wtf mine is showing wrong too\nMine is also 81xxxx\n└── Maybe its a temperory error while theyre making rank list if they mess this up istg\n    ├── I swear I wrote it right\n    │   └── Yea me too i logged in multiple times\n    └── Is it from our second attempt have they taken the rank\n\nI got 94.56 in first attempt so 81k rank\n        └── Damn i git 94.56 too. And no how tf can they make up a rank w 2nd session percentile. Even then i had 89 perc how tf can it become 10lakh rank. What rank are they show for u now?\n            ├── Yes trying to mail them too office will be closed tomorrow also tf thanks for telling me this\n            │   └── Wont office be closed now\n            │       └── Not picking up call so trying to email it \n\nWhen was the time given to edit the form?\n            │           └── Idk i had given correct rank tho im 100% sure\n            │               └── I'm too I hope they rectify it \n\nI filled the form on 21st night\n            │                   └── 21st was the last date to appy thats what they said when i called. What rank are they showing for u??\n            │                       ├── 170k\n            │                       └── How tf it's happening to only us I talked to some other guy too who filled the form their rank is showing\n            │                           └── Idfk man. Did u check ur rank i got 7k sm. Sum guy w 77k jee crl got 1.5k so we shud be getting under 2k forsure\n            └── 89 pe tabhi u shouldnt get that rank no??\n                └── No they fucked up sm else"
    },
    {
      "id": "mtuc9cd",
      "body": "94.8 hai mera cse milega rr??\n├── prolly not, but nobody knows for sure as this is the first time admissions are being taken this way.\n└── Bhai i had 14xx rank wid same percentile"
    }
  ]
}