{
  "id": "1ktkrjn",
  "title": "Showing wrong rank in the pesu site what to do?",
  "content": "My rank is 81k 94.56 percentile \nBut here it's showing 170k ??\n\nI remember so clearly I put in the right rank even double checked \n\nOffice will be closed tomorrow and I'm trying to email them now ",
  "metadata": {
    "root_comment_id": "mtupq0a",
    "post_id": "1ktkrjn",
    "author": "Fun_Election9179",
    "url": "https://i.redd.it/xg32xal5jj2f1.png",
    "permalink": "https://reddit.com/r/PESU/comments/1ktkrjn/showing_wrong_rank_in_the_pesu_site_what_to_do/",
    "score": 10,
    "upvote_ratio": 1,
    "created_utc": 1748009990,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "mtupq0a",
      "body": "Is 81k ur category rank or general rank?\n├── As ur %ile is 94 then it should be general but i am conforming\n└── Yes it's the CRL I got 94.56 in mains I'm general\n    └── Maybe some coding problem of website for 94.56 number i guess\n        └── Maybe or maybe that we both filled the form on 21st I don't know they should rectify this and give new rankings"
    },
    {
      "id": "mtuq9x5",
      "body": "Does the qr code on ur result card clearly visible?\n└── It should be I posted it directly from the jee site I used in other counselling too"
    },
    {
      "id": "mtuqeew",
      "body": "Does ur pes rank is 2800+\n├── Yes it's in 3k\n\nIt should be around 1.5k\n└── What are the chances that I get cse or aiml at2100 rank ??\n    └── I m also in line, i dont know will we get or not\n        └── What was the cut off last year??\n            └── Until last year they dont take direct admission from jee mains through online website as per i know\n                └── Um also was this list solely on this month's basis or mixed with yhthe list of early allotment and jee mains January counselling\n                    └── I dont know man why private college do not make process more transparent\n                        └── How would we know that we have to report or not???\n                            └── They re gonna give a further instructions message apparently"
    },
    {
      "id": "mtur6ip",
      "body": "When was the last time (date) u filled rank and submit pdf as i had filled 2-3 times rank and submit pdf then my rank given is correct\n└── I filled the form on 21st I guess It was the last date too but I'm so sure I filled it correctly don't they recheck with the pdf they ask for jee \n\nThis is so messed up 😭😭\n    └── Call to the office tommorrow in every 20 minutes after office opening as they hardly attend calls (from experience)\n        └── https://preview.redd.it/hczczqjj2k2f1.jpeg?width=1280&format=pjpg&auto=webp&s=96936bcb72bfaa2eef6ed8a59fc9e28498619064\n\nThis is what they are showing this but it's for the one who hasn't uploaded their rank card do u think they'll let me edit it??\n\nAlso mailing them right now."
    }
  ]
}