{
  "id": "1kto6ne",
  "title": "Pesu btech cs worth it?",
  "content": "Due to unseen circumstances I could not give a good J ee performance, and therefore I only have a chance to apply at private unis now. \n\nI am really concerned regarding my future..I wish to pursue btech but I'm not able to choose the college.\n\nCan you guys guide me on whether the college is worth it considering the huge fees it asks for. Does it provide the same level and quality of education and exposure back or is it not recommended at all?\n\nYou are also welcome to give another recommendations. \n\n",
  "metadata": {
    "root_comment_id": "mtv3eyg",
    "post_id": "1kto6ne",
    "author": "69MunnaBhaiya69",
    "url": "https://www.reddit.com/r/PESU/comments/1kto6ne/pesu_btech_cs_worth_it/",
    "permalink": "https://reddit.com/r/PESU/comments/1kto6ne/pesu_btech_cs_worth_it/",
    "score": 3,
    "upvote_ratio": 1,
    "created_utc": 1748018430,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "mtv3eyg",
      "body": "Considering JEE didn't go well , if you can afford the fees your best options would be BITS ( BITSAT is upcoming)  , PESU RR CSE , RVCE in bangalore (Comedk?) , Thapar if u can afford the fees + hostel but idrk much ab it\n└── Thanks for the advice. I have given comedk and am waiting for the results. But I'm selecting some good backups. I am aiming for a good environment rn cuz I'll probably get a job or side hustle and upskill apart from college. \n\nSo should I consider pesu as a good choice?\nI'm a girl btw so I'll have to look at many more things\n    └── Imo you can definitely consider it a good choice in terms of an academic environment and a competitive peer group . The only con would be that the fees is a little high through JEE Mains , but you can always aim for scholarships from 40-50% off ( which isn't too hard to get ).   \n  \nIf you study and maintain a good cg and you dont mind a slightly academic environment with respect to clubs and exams and hackathons , then you'll do just fine.\n\nKeep other options open as exams are still going on. ( bits/rv cse )"
    },
    {
      "id": "mtvaiku",
      "body": "PESU cse is a good choice. RVCE, MSRIT, BMSCE are other good colleges you can look out through comedk. Then there's VIT/MIT. But obviously won't recommend due to the ROI factor."
    },
    {
      "id": "mtvauu5",
      "body": "Your question or post has already been answered in the FAQs. Before making a new post, always remember to search the subreddit and/or check the FAQs. Duplicate posts will entail deletion. \n\nFAQ link: https://www.reddit.com/r/PESU/comments/14c1iym/faqs/"
    }
  ]
}