{
  "id": "1ktr7h9",
  "title": "Should I use this to get an idea of cutoffs?",
  "content": "Is it realistic to use this to get an idea of this year's cutoffs? (non-CET cutoffs).",
  "metadata": {
    "root_comment_id": "mtvtc8f",
    "post_id": "1ktr7h9",
    "author": "Glad-Class-2427",
    "url": "https://i.redd.it/sh61f6f2uk2f1.jpeg",
    "permalink": "https://reddit.com/r/PESU/comments/1ktr7h9/should_i_use_this_to_get_an_idea_of_cutoffs/",
    "score": 14,
    "upvote_ratio": 0.9399999976158142,
    "created_utc": 1748025769,
    "flair": "Admissions",
    "nsfw": false
  },
  "comments": [
    {
      "id": "mtvtc8f",
      "body": "Same question getting 19XX rank so according to that I can get ec campus cse\n└── What did you get alloted??\n    └── Counselling hasn't started"
    },
    {
      "id": "mtvuvni",
      "body": "Yes kind off but jee has slightly more seats now that it was through pessat\n└── So if I have 19XX rank can I get cse aiml at rr"
    },
    {
      "id": "mtvx2zw",
      "body": "https://preview.redd.it/d0pu05ityk2f1.png?width=1079&format=png&auto=webp&s=41f5223d116b7c92ddfad53e2a81ba533c59246c\n\nUsed chatgpt to convert 60% seats cutoff to 75%\n├── Aren't there more seats compared to pessat last year  ?\n├── Don't use chatgpt for such conversions honestly, kabhi kabar bohot inaccurate batata hai\n└── im prolly understanding this wrong, but shouldnt you convert 40% seat availability (PESSAT) to 45% (JEE MAINS this year)?\n    ├── So it the rest 65% of the previous 40%pessat now kcet(pes councelling)?\n    │   └── 45% JEE, 40% KCET, 15% Management\n    │       └── But there's kcet (kea councelling) and kcet (pes councelling) too right\n    │           └── Yeah I registered for both of them idk what the cutoff would be\n    └── It was 60% for pessat"
    },
    {
      "id": "mtvz4z1",
      "body": "Question , so pessat seats are now both jee and cet so will the jee cutoff really be same as last yr pessat ..or less/more\n└── Some are saying they incr pessat seats or smn also ? Is it?"
    },
    {
      "id": "mtw0a9x",
      "body": "22xx mein kya mil skta h?\n├── What was your jee rank?\n│   ├── 1.09 Lakh\n│   └── What can I get for 5xx rank is cse possible\n│       └── Probably not\n└── ECE in first round and AIML in 2nd round for RR Campus you can get cse in ec campus\n\nThis is according to previous year pessat ranking\n    ├── Wb 190X\n    │   └── Same as above as per last pessat cutoffs cs usually closes in under 1k\n\nIDK how will it be this time for you guys as jee is taken into consideration cut offs may vary it is completely new.\n    │       └── Ok so AIML in RR possible and cse in ec campus toh more or less confirm\n    └── My jee percentile is 89 and my Peddar rank is 3300. Can I get cse In etc campus or ece in re campus"
    },
    {
      "id": "mtw1dja",
      "body": "do any of you all know how much percentage seats was reserved for pessat?\n└── there was no pessat this year?\n    └── last year there were 288 seats for pessat"
    },
    {
      "id": "mtwd7og",
      "body": "Is hisaab se to I can get CS at EC campus 3049 rank (89.1 percentile) which is quite unbelievable \n└── it went down to 5k last year in round 2.. so cant tell anything rn..."
    },
    {
      "id": "mtweqlb",
      "body": "what would i be able to get at 26xx"
    },
    {
      "id": "mtyethw",
      "body": "Can we change the branch preference already filled ??"
    },
    {
      "id": "mtyio6t",
      "body": "what can i get for 61XX rank??\n└── whats ur jee rank?"
    },
    {
      "id": "mtyotaz",
      "body": "I dont think you should,  seats are different now and last year the cutoffs were also down (your data is 2 years old)\nAnd idk if it’s fair to compare Pessat and JEE for the ranks"
    },
    {
      "id": "mtytohe",
      "body": "any idea on what I might get at 16XX rank ?"
    },
    {
      "id": "mtzevb4",
      "body": "How many seats are there in pes for cse and cse aiml combined??"
    },
    {
      "id": "mtzhdtq",
      "body": "13xx pe kya milega! lol idc 5.1 lakh nhi fukna iss college ke liye"
    },
    {
      "id": "mu41uax",
      "body": "so do i have a higher chance of getting cse(ai ml) through jee (91 %ile) than getting it through kcet (4440) ?"
    },
    {
      "id": "mu4sl8j",
      "body": "Bro i got 3604 rank in pessat can i expect atleast ece in ec campus"
    },
    {
      "id": "mu59tyy",
      "body": "For cs you should 1k in kcet and for aiml 1.5k in kcet"
    },
    {
      "id": "mu5a1o2",
      "body": "From jee main if you can to go you need 98 percentile for cs"
    }
  ]
}