{
  "id": "1kxe6fn",
  "title": "Building, chai, and code — join us for an open-source hackathon in Bangalore",
  "content": "Hey folks,  \nWe’re hosting an open-source hackathon in Bangalore this weekend — and you’re invited.\n\nIt’s called **f\\*rk off — open hackathon / OSS acc**, and it’s a 12-hour overnight jam session for anyone who loves building, tinkering, or just exploring open source.\n\nWhether you’ve shipped a dozen PRs or are just starting out, this is a space with no pressure, no gatekeeping, and lots of room to learn and collaborate.\n\nWhat’s happening:\n\n* Starts at 4 PM with lightning talks and team formation\n* Build sprint from 8 PM to 8 AM — no themes, no limits\n* Free chai, snacks, fast WiFi, and good energy\n* Up to ₹20k in cash support for standout projects\n* Open-source mentors and contributors in the room\n* Stickers, merch, and plenty of good conversations\n\nCome solo or with friends. You can find a team on the spot too. This isn’t a competition — it’s an open playground to build something that matters (or something just for fun).\n\nWhen: June 1st, Saturday, 4 PM onwards  \nWhere: Central Bangalore  \nRegister here: [https://lu.ma/nen7u44v?tk=AB0Acp](https://lu.ma/nen7u44v?tk=AB0Acp)\n\nFeel free to share this with your tech circle. Hope to see you there.",
  "metadata": {
    "root_comment_id": "muoyuqe",
    "post_id": "1kxe6fn",
    "author": "Dependent_Sweet_8200",
    "url": "https://www.reddit.com/r/PESU/comments/1kxe6fn/building_chai_and_code_join_us_for_an_opensource/",
    "permalink": "https://reddit.com/r/PESU/comments/1kxe6fn/building_chai_and_code_join_us_for_an_opensource/",
    "score": 7,
    "upvote_ratio": 1,
    "created_utc": 1748430074,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "muoyuqe",
      "body": "Post is unrelated to PESU University. All posts on {community name} can be anything related to students, communities, news and happenings at PES but nothing beyond."
    }
  ]
}