{
  "id": "1l27erx",
  "title": "How's Semester 6 CSE Results ?",
  "content": "",
  "metadata": {
    "root_comment_id": "mvqobli",
    "post_id": "1l27erx",
    "author": "Loud-Experience-8006",
    "url": "https://www.reddit.com/r/PESU/comments/1l27erx/hows_semester_6_cse_results/",
    "permalink": "https://reddit.com/r/PESU/comments/1l27erx/hows_semester_6_cse_results/",
    "score": 16,
    "upvote_ratio": 0.8700000047683716,
    "created_utc": 1748942577,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "mvqobli",
      "body": "Got cooked,CD especially"
    },
    {
      "id": "mvqopey",
      "body": "Cd and Cc didn't get the grades as expected.. Rest were ok\n└── What happened ?"
    },
    {
      "id": "mvqr93n",
      "body": "Why couldn't they just grade us like 5th sem , fucked up the cgpa in the last sem\n└── https://preview.redd.it/duc3j96wyo4f1.jpeg?width=640&format=pjpg&auto=webp&s=b1d3e4368b905647f23ca41184570f0b4c0dbb15\n    └── Why not just inflate if it helps to increase their own college's placement stats but as we all no they don't go by normal logic\n        └── Higher GPA doesn't lead to better placement stats though, they will need to get more companies to offer higher packages. These are two events without any correlation.\n            └── But won't more people cross the minimum gpa to sit for placements atleast\n                └── Companies will still shortlist the same number they intend to shortlist for interviews. Does not matter if 100 or 1000 are eligible, if they decide on interviewing 20, they will interview 20.\n                    └── Fair enough but it's very sad for people like me who were close to landmarks like 7.5, 8 or 7 cgpa\n                        └── You can't do anything about your GPA. If you can't beat the competition with your GPA, you *have* to beat them with your problem solving and aptitude test performance. A high GPA is simply a foot through the door, not an entry ticket. You can still get shortlisted, maybe not initially, but you still can get a T1 job. It all depends on if you are able to acknowledge where you can put in more effort and work on yourself. \n\nYou have the entire summer to practice DSA and get better at OAs. Work your ass off. if you didn't do it earlier, you have no choice but to do it now."
    },
    {
      "id": "mvqw0ms",
      "body": "Not bad, not good as expected"
    }
  ]
}