{
  "id": "1l6i37j",
  "title": "Has anyone received the confirmation email",
  "content": "The councelling for btech was yesterday morning and they still haven't sent us the email🫠",
  "metadata": {
    "root_comment_id": "mwow273",
    "post_id": "1l6i37j",
    "author": "Icy-Might5224",
    "url": "https://www.reddit.com/r/PESU/comments/1l6i37j/has_anyone_received_the_confirmation_email/",
    "permalink": "https://reddit.com/r/PESU/comments/1l6i37j/has_anyone_received_the_confirmation_email/",
    "score": 4,
    "upvote_ratio": 0.8399999737739563,
    "created_utc": 1749404622,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "mwow273",
      "body": "not yet, prolly cause its a sunday?\n├── I hope you are right then\n└── Do you think we will receive it by tomorrow?\n    └── no idea dude, hopefully. btw, did u attend online counselling\n        └── Yah the morning one at 8am, wbu?\n            └── 2nd one\n                └── Okay so did they say anything Abt the confirmation email and by when will they send it ?\n                    └── they mentioned in the meeting that the email would come within 48 hours of counselling, so we wait ig. thats all i heard"
    },
    {
      "id": "mwox34f",
      "body": "The login credentials one??\n└── The email regarding seat confirmation in the preferred branch and further steps\n    └── Recieved an email subject admission status ..body: congrats ur application has been accepted and these are ur login credentials and password for pesu app (PRN) one\n        └── Yes this is the one but idk why I haven't received this yet. When did you get this ?\n            └── Yesterday\n                └── Did you attend the offline counselling cuz I attended the online one as I am from outside karnataka so i dont really know about the domicile issue \nDoes your mail mention the branch tho?\n                    └── I attended offline and am non karnataka students and no I t didn't mention the branch\n                        └── Okay thanks bro, did they say anything about the class commencement date and schedule?"
    },
    {
      "id": "mwox91r",
      "body": "Nah\n└── Glad to know I ain't the only one"
    },
    {
      "id": "mwsauw3",
      "body": "was this for round 1? round 2 still hasn't started, right?\n└── Yes"
    },
    {
      "id": "mwymir0",
      "body": "did online students receive the mail yet??\n└── No at least I haven't yet received any sort of mail"
    }
  ]
}