{
  "id": "1l7sam6",
  "title": "Help needed: suggestions for girls PGs near EC Campus and roommates",
  "content": "I'm a fresher for BTech CSE EC campus. I'll be moving in BLR for the first time and unfortunately I don't qualify for the EC campus hostel (I don't have a local guardian and I can't really submit a demand draft right now in person).   \nI'm thinking of shifting to a PG for a year or so until I find good friends to move into a flat. However most of the PGs nearby (Zolo and stayzone) are unisex which I don't think am very comfortable with. The nice girls PGs are kinda far away from the campus.   \nAny suggestions? Anyone looking for rooms or PGs this year?",
  "metadata": {
    "root_comment_id": "mx0h6vp",
    "post_id": "1l7sam6",
    "author": "Deemioneee",
    "url": "https://www.reddit.com/r/PESU/comments/1l7sam6/help_needed_suggestions_for_girls_pgs_near_ec/",
    "permalink": "https://reddit.com/r/PESU/comments/1l7sam6/help_needed_suggestions_for_girls_pgs_near_ec/",
    "score": 5,
    "upvote_ratio": 1,
    "created_utc": 1749539204,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "mx0h6vp",
      "body": "It will be difficult to find an incoming student opting for PG/apartment, especially if you're trying to find someone over reddit. I'd suggest posting this on your batch WhatsApp group and discord server. Or if you're ok with seniors, post on their groups (ask around on discord for the link). It'll probably be easier (and safer) to find someone through the WhatsApp groups, plus odds are you'll find a senior who might be willing to move, compared to incoming students who usually don't go for these options.\n└── okayy thankss"
    },
    {
      "id": "mx5i3h0",
      "body": "DM me, there are few good ladies pg near the campus"
    },
    {
      "id": "myeobhz",
      "body": "heyy, so you mean we can't be qualified for hostel without a LC? \n└── Yep, no lg no hostel"
    },
    {
      "id": "myeohq4",
      "body": "im kinda in the same situation im not from blr as well and i was planning on joining hostel (ec campus) with no LC"
    },
    {
      "id": "myeojbt",
      "body": "if you found any alternative (like pg) pls lmk :) \n└── Sure sure\n    └── hey, just letting you know I've messaged you personally, if you're comfortable we can text there! \n        └── Let me know if you find any PG.\n            └── heyy i actually got a room in hostel\n                └── In college hostel?\n                    └── yes"
    }
  ]
}