{
  "id": "1lb6aly",
  "title": "Pes kcet merit list query(please help)",
  "content": "I got a message saying it’s out but can’t find it please",
  "metadata": {
    "root_comment_id": "mxq2wx6",
    "post_id": "1lb6aly",
    "author": "AdExpensive2973",
    "url": "https://www.reddit.com/r/PESU/comments/1lb6aly/pes_kcet_merit_list_queryplease_help/",
    "permalink": "https://reddit.com/r/PESU/comments/1lb6aly/pes_kcet_merit_list_queryplease_help/",
    "score": 18,
    "upvote_ratio": 0.8700000047683716,
    "created_utc": 1749899837,
    "flair": "Admissions",
    "nsfw": false
  },
  "comments": [
    {
      "id": "mxq2wx6",
      "body": "Same, can't find it\n├── Same still can’t find it have you entered everything properly\n│   └── Yea\n└── same\n    └── but i feeel i've screwed up filling my reg no.   \nI've entered cet no instead of app no. will i not get my rank???? Someone pls help\n        ├── Yeah I think cet no\n        │   ├── Oh yeah application number\n        │   │   └── Cet number is diff from application number.. they ask CET no only bro\n        │   │       ├── Application number that begginis with 492023 that’s how they can check our ranks dumbass\n        │   │       └── they asked application number not cet no\n        │   │           ├── Exactly\n        │   │           │   └── hey bro, what was rank? Apparently ranks for both who entered cet no and application no.\n        │   │           └── They asked for cet number bro\n        │   └── Did you enter CET number or application number?\n        │       └── they said cet no when i asked\n        ├── You can check go the entrance exam page on your profile and then expand on kcet marks there’ll you’ll be able to see\n        │   ├── nahh, bro thats ur kcet rank given by KEA not PESU\n        │   │   └── Yeah Ik that’s what even I’m saying for checking his application number\n        │   └── not able to see\n        │       └── Alright when did message come then\n        └── Hi, yeah same thing. I have also entered my CET number."
    },
    {
      "id": "mxq3gf2",
      "body": "Yeah same."
    },
    {
      "id": "mxq3nu0",
      "body": "where is it supposed to come does any1 have an idea"
    },
    {
      "id": "mxq4jyq",
      "body": "nope, cant see yet, do update\n└── Has it come yet brother?\n    └── yes\n        └── Tysm"
    },
    {
      "id": "mxq4ng2",
      "body": "I entered registeration number (the one we use to log) and still dont see my rank\n└── Yeah chill all of us didn’t get it yet"
    },
    {
      "id": "mxq7bau",
      "body": "Hi,  \nEven I am not able to find the result. I have entered the CET number instead of the application number in the KCET portal. Is it expected? Are the results out for anyone?\n└── chill u will get ur rank, not yet updated on the website\n    └── Okay, did you give your CET number or application number in the PES portal?\n        ├── cet number i asked management\n        │   ├── it doesnt even accept as many digits as application number\n        │   │   └── Okay please update if the ranks are out.\n        │   ├── Phew thank god, i got super scared.\n        │   └── How will they validate our results if we enter our cet no…only with application number you can view kcet results\n        │       └── idk when i asked they said cet number \nyou cant even enter as many numbers as application number\n        │           └── I gave application number wth\n        │               └── me too\n        │                   └── Aight we in the clear then\n        └── cet number\n            └── Okay please update if the ranks are out."
    },
    {
      "id": "mxq8oxf",
      "body": "could someone share link where the results come out, is it pesu academy website only?\n└── Rank is out"
    },
    {
      "id": "mxq8z8g",
      "body": "I am also not able to find it, guess it will take sometime to reflect in website. Remember there was a couple of hours lag when JEE rank message came.\n└── The rank is released now. What can be the cutoff for CSE on RingRoad campus?"
    },
    {
      "id": "mxq9ky4",
      "body": "still aint there"
    },
    {
      "id": "mxqadt4",
      "body": "Same not able to find, I've entered CET no, that's what was told to enter\n└── could you send the link?\n    └── [https://admissions.pes.edu/Academy/](https://admissions.pes.edu/Academy/)"
    },
    {
      "id": "mxqb9k1",
      "body": "yo could someone please share the link for gods sake"
    },
    {
      "id": "mxqe262",
      "body": "Guys is this same as KEA KCET counselling or different??\n├── Way different bro kea fees is 4 lakhs this ones 25 lakhs +\n│   └── Thanks a lot for clarifying!!\n└── its not kea \nseperate pes counselling\n    └── Thanks for clarifying"
    },
    {
      "id": "mxqkhu5",
      "body": "Any updates on the results\n├── Did we ever have to update something like preference and all? I don't remember seeing it, only had to update KCET details right\n│   └── Yeah they should ask this later\n│       └── I didn't put any preference.. like just uploaded my details, that's it right?  \nIt says \"  The time window to update / edit your KCET Marks and to select your choice preferences has now ended. Merit allotment for the first round will be happening on 28th April and we will communicate further course of action with the candidates who have uploaded the scores in a timely manner.  \n\"\n\nBut I didn't put any prefernce only\n├── I am able to see the results. I entered CET number. There is a \"Download KCET Ranke\" button in the Next Steps section. I dont know what use this ranking is for though, as most of the seats are over after JEE round 1.\n└── received"
    },
    {
      "id": "mxqpta7",
      "body": "received mine\n├── did you give your application number or cet number ?\n│   └── cet number\n│       └── damn, I gave my application no and still received it\n└── how much rank\n    └── 16XX"
    },
    {
      "id": "mxqpy0j",
      "body": "received mine\n└── How much y’all got\n    ├── 460\n    ├── 21XX\n    ├── What was your rank?\n    └── 12XX"
    },
    {
      "id": "mxqr5n8",
      "body": "it came\n└── What rank\n    └── 2.1k😭😭 will I get anything??\n        └── What rank in kcet\n            └── bad...13k"
    },
    {
      "id": "mxqrwfv",
      "body": "Rank card came\n\n\nGot rank 460 (KCET rank - 2.5k)\n└── Bro why did you apply for pesu kcet, you'd be getting it with kea only"
    },
    {
      "id": "mxqttvk",
      "body": "i got mine i got 900 rank kcet(5k) just wanted to know how much csc seats are left in rr campus"
    },
    {
      "id": "mxqynyf",
      "body": "it's out"
    },
    {
      "id": "mxvqp8v",
      "body": "It was out by yesterday night, check once!"
    }
  ]
}