{
  "id": "1lczlnc",
  "title": "So ece chaps are u going jobless?",
  "content": "I heard pes mostly favours cs branches only and other branches getting ignored.\nSo how are the ece guys taking it, placements, future plans etc i heard there are very few ec core companies come for hiring is it true.",
  "metadata": {
    "root_comment_id": "my4fvop",
    "post_id": "1lczlnc",
    "author": "Superb-Set325",
    "url": "https://www.reddit.com/r/PESU/comments/1lczlnc/so_ece_chaps_are_u_going_jobless/",
    "permalink": "https://reddit.com/r/PESU/comments/1lczlnc/so_ece_chaps_are_u_going_jobless/",
    "score": 10,
    "upvote_ratio": 0.8600000143051147,
    "created_utc": 1750096198,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "my4fvop",
      "body": "That's the case in all clgs bruh"
    },
    {
      "id": "my78lgq",
      "body": "Koi tho jawab do?\n└── zara ruko bhai"
    },
    {
      "id": "my7gnff",
      "body": "Most ece ppl here just prepare for CS jobs. Core companies as you said are few, so if you want to do something core, then have to find it outside or go for masters. I know a lot of guys who joined ece only bcoz they didn't get cse. Their plan is to do minors in cse (which clg offers) and sir for IT companies' placements\n├── Do they get jobs at IT companies?\n│   ├── Yes they do, some get really good packages too. But really depends on your skillset and how the company's feeling about recruiting ece guys\n│   └── yes, many of them get, although some get low package, its okay tho, a few get higher package as well\n│       └── Can u let me know what is low or high some range so i can understand.\n│           └── Low in the sense below 10LPA or somewhere around, high means 30+LPA\n└── Don't rely on a minor specialization. For the 2025 batch, only two companies visited the campus that considered minor courses in CSE. However, the placement office still evaluated candidates based on their major CGPA, even if they applied through a minor. I'm not sure if this issue was specific to our batch, but I'm just sharing the facts from this year."
    },
    {
      "id": "n080ord",
      "body": "Things will change in the next 4 years.There will be shortage of ECE skills . Read the link  https://www.financialexpress.com/business/start-ups/semiconductor-startups-tackle-talent-crunch-with-homegrown-solutions/3889106/\n└── but vlsi roles and core roles which pay good mostly require masters degree.....so thats the problem when u spend a lot on btech in clgs like PES, Thapar and Manipal"
    }
  ]
}