{
  "id": "1lk07f4",
  "title": "Is taking notes on laptop allowed in classes?",
  "content": "Might be joining this year so is it allowed or only some professors allow? ",
  "metadata": {
    "root_comment_id": "mznxbeq",
    "post_id": "1lk07f4",
    "author": "Hopeful-Yoghurt-1285",
    "url": "https://www.reddit.com/r/PESU/comments/1lk07f4/is_taking_notes_on_laptop_allowed_in_classes/",
    "permalink": "https://reddit.com/r/PESU/comments/1lk07f4/is_taking_notes_on_laptop_allowed_in_classes/",
    "score": 9,
    "upvote_ratio": 0.7400000095367432,
    "created_utc": 1750840070,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "mznxbeq",
      "body": "Really depends on the professors atleast for first year"
    },
    {
      "id": "mznz690",
      "body": "well tbh we never made notes lol ...\n└── don't do what this guy did keeds"
    },
    {
      "id": "mzo1j1z",
      "body": "Only some allow , Most of the teachers who allow are the ones using to code something. Like C/Python/DS/WT"
    },
    {
      "id": "mzo6wa9",
      "body": "Most of them dont allow in 1st year, ur allowed to use laptop/any device only in C and python class in the first year but if you get some chill prof u can do anything. From 2nd year onwards you can use anything you want(some profs are exceptions tho)"
    },
    {
      "id": "mzo91yf",
      "body": "you can use ipad tough in class for taking notes\n├── though\\*\\*\n└── Are all professors chill with that?"
    },
    {
      "id": "mzpccxw",
      "body": "for first year apart from python and c you cant take notes for anything on laptop. \n\nunless you pay attention in evs and constitution classes, and you take notes in that like a maniac\n└── nah you can if profs allow, we were allowed in some other courses like epd and statics"
    },
    {
      "id": "mzug2lj",
      "body": "As long as u don’t like your laptop u can take notes"
    },
    {
      "id": "n02j25p",
      "body": "Ask nicely and beforehand and most professors should be okay with it. Especially if you're Sitting on the first bench"
    },
    {
      "id": "n09m0d0",
      "body": "Laptop depends on prof, but you can use a tablet if you have one"
    },
    {
      "id": "n0q2dld",
      "body": "It depends on the teacher."
    }
  ]
}