{
  "id": "1lo69tm",
  "title": "[CET] PES KCET Merit List Cut-offs",
  "content": "[removed]",
  "metadata": {
    "root_comment_id": "n0kemqj",
    "post_id": "1lo69tm",
    "author": "Alexei2691",
    "url": "https://www.reddit.com/r/PESU/comments/1lo69tm/cet_pes_kcet_merit_list_cutoffs/",
    "permalink": "https://reddit.com/r/PESU/comments/1lo69tm/cet_pes_kcet_merit_list_cutoffs/",
    "score": 20,
    "upvote_ratio": 0.9599999785423279,
    "created_utc": 1751286597,
    "flair": "Admissions",
    "nsfw": false
  },
  "comments": [
    {
      "id": "n0kemqj",
      "body": "Hi u/Alexei2691, your post was temporarily held for moderator review because it mentions topics related to JEE-based admissions.\n\nAny posts asking for counseling advice based on JEE rank will be removed promptly. Attempts to bypass this filter may result in a 30-day ban or longer for repeat offenders.\n\nThis strict rule is designed to protect you from misinformation and speculation, not to restrict you. Since this is the first year PES uses JEE for admissions, there is no reliable data for making predictions. Many users offering predictions are fellow aspirants like you, without real expertise or data — effectively, the blind leading the blind. Choosing a college is a serious decision. **Please avoid relying on unverified predictions from peers who are also uncertain**.\n\nFor previous cutoffs and credible information, refer to this post: [Which branch can I get? (PESSAT 2022 cutoffs)](https://www.reddit.com/r/PESU/comments/1ct5ujc/which_branch_can_i_get_at_no_dont_make_such_posts/)\n\nPlease respect the rules and seek guidance from trusted sources.\n\n*This action was performed automatically by [u/AutoModerator](https://www.reddit.com/user/AutoModerator) to ensure the quality of our community. If you have any questions or concerns, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/PESU).*\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PESU) if you have any questions or concerns.*"
    },
    {
      "id": "n0lh770",
      "body": "cfbr"
    },
    {
      "id": "n0lz7rr",
      "body": "cfbr"
    },
    {
      "id": "n0m8gtt",
      "body": "cfbr"
    }
  ]
}