{
  "id": "1lot0dy",
  "title": "[Question] Is joining this university worth it in cse or cse with aiml Through jee mains?",
  "content": "[removed]",
  "metadata": {
    "root_comment_id": "n0ph5k3",
    "post_id": "1lot0dy",
    "author": "introverted_s",
    "url": "https://www.reddit.com/r/PESU/comments/1lot0dy/question_is_joining_this_university_worth_it_in/",
    "permalink": "https://reddit.com/r/PESU/comments/1lot0dy/question_is_joining_this_university_worth_it_in/",
    "score": 1,
    "upvote_ratio": 1,
    "created_utc": 1751345510,
    "flair": "Admissions",
    "nsfw": false
  },
  "comments": [
    {
      "id": "n0ph5k3",
      "body": "Hi u/introverted_s, your post was temporarily held for moderator review because it mentions topics related to admissions.\n\nAny posts asking for counseling advice based on JEE or CET rank will be removed promptly. Attempts to bypass this filter may result in a 30-day ban or longer for repeat offenders.\n\nThis strict rule is designed to protect you from misinformation and speculation, not to restrict you. Since this is the first year PES uses JEE and CET for admissions, there is no reliable data for making predictions. Many users offering predictions are fellow aspirants like you, without real expertise or data — effectively, the blind leading the blind. Choosing a college is a serious decision. **Please avoid relying on unverified predictions from peers who are also uncertain**.\n\nFor previous cutoffs and credible information, refer to this post: [Which branch can I get? (PESSAT 2022 cutoffs)](https://www.reddit.com/r/PESU/comments/1ct5ujc/which_branch_can_i_get_at_no_dont_make_such_posts/)\n\nPlease respect the rules and seek guidance from trusted sources.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PESU) if you have any questions or concerns.*"
    },
    {
      "id": "n0qehih",
      "body": "How much did you score in mains\n└── 96%ile\n    └── I think you can also get thapar coe\n        └── Wtf?? thapar is more expensive than pes bro, why would you suggest that to him??\n            └── Yea that too with similar packages and worse location"
    },
    {
      "id": "n0qelzg",
      "body": "Well check the faqs for knowing the pros and cons of, but in my opinion a student loan is a big no as it might become a burden for you .. moreover its ur descision now\n└── Yea even i was thinking that the loan will be  a big burden for myself and my family"
    },
    {
      "id": "n0qxk9c",
      "body": "See , considering you don't have any other options ( BITS , IIITs etc ) your only choice is one of the three -   \n Take a drop , Take pes or Take smvit/sit tumkur etc..\n\n My recommendation if you're not willing to take a drop would be to take PES and grind for scholarships ( because trust me it's not that hard to get 40 % of ur fees back every semester ) , which will drop the fees to close to ur smvit/sit tumkur fees. If not then work hard and try to make the most of the ROI because PES does have way better opportunities. (especially in cs and related branches which ull get ).\n\nIf you really can't or it requires a lot of adjusting/financial burden then you can consider some kcet/comedk colleges or a drop.\n└── How do i know more about these scholarships?\nCan u give me an overview? Where can i learn more\n    └── [Scholarships - PES University](https://pes.edu/scholarships/)\n\nalso, search on this sub for more posts regarding scholarships. Plenty of people have already explained it in detail.\n        └── Will i get 40% of my total semester fees as my fees will be higher like 2.5 lakhs per semester soo will i get 1 lakhs back? Or is it capped at a certain value?\n            └── Yea the 40 % scholarship is around 1 lakh every semester if ur paying jee mains fees.  In first year the cgpa cutoff for it is around 8.6-8.75"
    },
    {
      "id": "n0re1o0",
      "body": "Also, what is your family income\n└── 12 13lpa\n    └── Go for pes"
    }
  ]
}