{
  "id": "1lou4i0",
  "title": "[Admission] PES RR NAGAR CSE-AIML VS MIT MANIPAL MATHEMATICS AND COMPUTING?",
  "content": "I got PES through pesujee, so like the fees will be similiar. The only advantage im seeing in PES is that there is a way to get some moneyback from the college and also its in banglore.\n\nHowever currently i prefer manipal as its more reputed, better campus, better hostel life and id rather do mnc than cse. \n\nMy home is just 4km from PES, hence if i decide to join PES il mostly be at home , but if i join manipal i can live in the hostels which i want to do.\n\nHence i am asking , is there any convincing reason why PES might be a better choice than MIT",
  "metadata": {
    "root_comment_id": "n0ppao0",
    "post_id": "1lou4i0",
    "author": "TheVulcanReaper",
    "url": "https://www.reddit.com/r/PESU/comments/1lou4i0/admission_pes_rr_nagar_cseaiml_vs_mit_manipal/",
    "permalink": "https://reddit.com/r/PESU/comments/1lou4i0/admission_pes_rr_nagar_cseaiml_vs_mit_manipal/",
    "score": 0,
    "upvote_ratio": 0.5,
    "created_utc": 1751349636,
    "flair": "Admissions",
    "nsfw": false
  },
  "comments": [
    {
      "id": "n0ppao0",
      "body": "Hi u/TheVulcanReaper, your post was temporarily held for moderator review because it mentions topics related to admissions.\n\nAny posts asking for counseling advice based on JEE or CET rank will be removed promptly. Attempts to bypass this filter may result in a 30-day ban or longer for repeat offenders.\n\nThis strict rule is designed to protect you from misinformation and speculation, not to restrict you. Since this is the first year PES uses JEE and CET for admissions, there is no reliable data for making predictions. Many users offering predictions are fellow aspirants like you, without real expertise or data — effectively, the blind leading the blind. Choosing a college is a serious decision. **Please avoid relying on unverified predictions from peers who are also uncertain**.\n\nFor previous cutoffs and credible information, refer to this post: [Which branch can I get? (PESSAT 2022 cutoffs)](https://www.reddit.com/r/PESU/comments/1ct5ujc/which_branch_can_i_get_at_no_dont_make_such_posts/)\n\nPlease respect the rules and seek guidance from trusted sources.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PESU) if you have any questions or concerns.*"
    },
    {
      "id": "n0qs8kz",
      "body": "!Remindme 3 days"
    },
    {
      "id": "n0qy8tl",
      "body": "If you want to go to manipal why are you asking for reasons to go to pes lol"
    },
    {
      "id": "n0qzdsk",
      "body": "I'm pretty sure placements and ROI will be better in PES considering ur commute/hostel scenario as well as scholarships and placements of the branches in general.\n\n  \nAltho undoubtedly you'll be missing out on college/hostel life and I think extracurricular clubs of MIT are better surely."
    },
    {
      "id": "n0rwxtv",
      "body": "Tf is rr nagar now.\nAnyway, I would recommend cse in ecc instead.\n└── https://maps.app.goo.gl/DYNQZoJeotE2zSBVA?g_st=ac\n    └── Since when did pes build a campus in rr nagar bruh\n        └── he means Ring Road lmaooooo. OP doesnt know Bangalore prolly"
    },
    {
      "id": "n0sql82",
      "body": "Ffs it's NOT RR NAGAR DAMMNIT"
    }
  ]
}