{
  "id": "1lov7o6",
  "title": "Round 1 alloted students who already applied for refund... Assemble!",
  "content": "So, is there anyone who got a seat alloted in PES in round 1 councelling of JEE mains and applied for refund from the institute? mention it so we can have a rough estimate for vacant seats in Round 2 jee main councelling... but in between there is PES KCET councelling and then after there will be JEE mains R-2 councelling for the left out seats... maybe there can be a chance since they closed the new registrations through jee mains also PES KCET fee is 5 lakhs per year so there is a chance for vacant seats in that as well because through Gov. KCET councelling fee is approx. 1 lakh and 40% seats are reserved for Gov. based KCET councelling and the 45% are for the jee mains + PES KCET councelling for which the fee is 5 lakhs.. so let's hope for the best. i have PES rank 13xx let's see if there is a chance for CSE in PES>?",
  "metadata": {
    "root_comment_id": "n0pwrg8",
    "post_id": "1lov7o6",
    "author": "Wizard_1857",
    "url": "https://i.redd.it/0cryob3io7af1.jpeg",
    "permalink": "https://reddit.com/r/PESU/comments/1lov7o6/round_1_alloted_students_who_already_applied_for/",
    "score": 27,
    "upvote_ratio": 1,
    "created_utc": 1751353837,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "n0pwrg8",
      "body": "Hi u/Wizard_1857, your post was temporarily held for moderator review because it mentions topics related to admissions.\n\nAny posts asking for counseling advice based on JEE or CET rank will be removed promptly. Attempts to bypass this filter may result in a 30-day ban or longer for repeat offenders.\n\nThis strict rule is designed to protect you from misinformation and speculation, not to restrict you. Since this is the first year PES uses JEE and CET for admissions, there is no reliable data for making predictions. Many users offering predictions are fellow aspirants like you, without real expertise or data — effectively, the blind leading the blind. Choosing a college is a serious decision. **Please avoid relying on unverified predictions from peers who are also uncertain**.\n\nFor previous cutoffs and credible information, refer to this post: [Which branch can I get? (PESSAT 2022 cutoffs)](https://www.reddit.com/r/PESU/comments/1ct5ujc/which_branch_can_i_get_at_no_dont_make_such_posts/)\n\nPlease respect the rules and seek guidance from trusted sources.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PESU) if you have any questions or concerns.*"
    },
    {
      "id": "n0qk9nv",
      "body": "Your 13xx pes rank is for kcet or jee\n└── for jee\n    ├── you must have got CSE at RR\n    └── How much percentile"
    },
    {
      "id": "n0s38hv",
      "body": "When did u apply, is this rank only applicable for r2\n└── it was applicable for round 1 also but i didn't pay the fee at the institute and hence no seat was alloted"
    },
    {
      "id": "n0w2pnh",
      "body": "Are you sure there will be a round 2 for jee after  pesu counselling?...like did they mention that to you when you left the seat in round 1?\n└── If you get to know please share also"
    }
  ]
}