{
  "id": "1lozdxs",
  "title": "[Question] Regarding PES RR and EC Campus",
  "content": "https://preview.redd.it/csixfwvv19af1.jpg?width=725&format=pjpg&auto=webp&s=a9cad881ab8ab444da56007fed3786bf5feb2a34\n\nIs what this person is saying is correct and are EC students discriminated against RR students?\n\nPls tell me this isn't true or else I would have to change my campus to the one which is very far from my home :(\n\nPs:- I am not asking the same question repeatedly asked in this sub, I know both campuses are same, that is why I took EC above RR, I just wanted to make sure that what the person in screenshot is saying is not true.",
  "metadata": {
    "root_comment_id": "n0qppa1",
    "post_id": "1lozdxs",
    "author": "Suzuha369",
    "url": "https://www.reddit.com/r/PESU/comments/1lozdxs/question_regarding_pes_rr_and_ec_campus/",
    "permalink": "https://reddit.com/r/PESU/comments/1lozdxs/question_regarding_pes_rr_and_ec_campus/",
    "score": 0,
    "upvote_ratio": 0.4000000059604645,
    "created_utc": 1751369943,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "n0qqdbj",
      "body": "It's not true. All placement emails are sent to both campuses at the same time, as part of the same thread (you can even see the recipients are both campuses). \n\nNot sure why people constantly trying to defame EC. Don't trust any information about campuses unless it's coming from this subreddit. There is a lot of misinformation out there.\n├── Thanks a lot for clarifying!\n│   └── No worries. Be wary of such individuals. You'll find many in college spreading their own narratives as well.\n│       └── I will, thanks!\n├── [There you go](https://www.reddit.com/r/kcet/comments/1lo23cb/cet_why_does_the_cuttoff_between_rr_and_ec_campus/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)\n└── Mod , thanks that was calming"
    },
    {
      "id": "n0qypt7",
      "body": "long live pesu mods, and let these people cope as hard as they can that rr campus is superior to ec. They themselves are prolly studying from a worse college and don't want to believe the potential ec campus has, let them struggle for their infosys/cognizant dream job lol."
    },
    {
      "id": "n0ufwn2",
      "body": "Rr sits first what does that even mean"
    }
  ]
}