{
  "id": "1lpsi6g",
  "title": "[Question] What are the chances of getting CSE related branches in RR or EC CAMPUSES",
  "content": "So I have registered for phase 2 of PES Counselling which would be in Mid July, but few people told me that all CSE related seats are completely full in RR and EC campuses , I have 96.68 percentile in JEE Mains and 93.6 percentage in Boards.\nCan I get Cse related branches in any f the two campuses if seats get withdrawn",
  "metadata": {
    "root_comment_id": "n0x45qa",
    "post_id": "1lpsi6g",
    "author": "beinglaiden",
    "url": "https://www.reddit.com/r/PESU/comments/1lpsi6g/question_what_are_the_chances_of_getting_cse/",
    "permalink": "https://reddit.com/r/PESU/comments/1lpsi6g/question_what_are_the_chances_of_getting_cse/",
    "score": 0,
    "upvote_ratio": 0.33000001311302185,
    "created_utc": 1751452728,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "n0x45qa",
      "body": "Hi u/beinglaiden, your post was temporarily held for moderator review because it mentions topics related to admissions.\n\nAny posts asking for counseling advice based on JEE or CET rank will be removed promptly. Attempts to bypass this filter may result in a 30-day ban or longer for repeat offenders.\n\nThis strict rule is designed to protect you from misinformation and speculation, not to restrict you. Since this is the first year PES uses JEE and CET for admissions, there is no reliable data for making predictions. Many users offering predictions are fellow aspirants like you, without real expertise or data — effectively, the blind leading the blind. Choosing a college is a serious decision. **Please avoid relying on unverified predictions from peers who are also uncertain**.\n\nFor previous cutoffs and credible information, refer to this post: [Which branch can I get? (PESSAT 2022 cutoffs)](https://www.reddit.com/r/PESU/comments/1ct5ujc/which_branch_can_i_get_at_no_dont_make_such_posts/)\n\nPlease respect the rules and seek guidance from trusted sources.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PESU) if you have any questions or concerns.*"
    },
    {
      "id": "n0yjbaj",
      "body": "u can get cse in first round , dk about first round"
    },
    {
      "id": "n12o3na",
      "body": "By phase 2 of pes counselling do you mean round 2 of jee counselling?....did you check w them ..i mean are they even gonna have it after the pesu kcet counselling?\n└── what is your percentile?"
    },
    {
      "id": "n15bhhn",
      "body": "from where u registered for 2nd round? can u tell me too..... im waiting for 2nd round registration"
    },
    {
      "id": "n1lfti3",
      "body": "do you mean phase 2 of jee counselling"
    }
  ]
}