{
  "id": "1lqlqz5",
  "title": "[Placements] Need 3rd sem guidance help please ( Would prefer seniors going to 3rd year to reply )",
  "content": "Messed up first year ,  couldn't cross 9 even tho its apparently the easiest year to score in . Need to know what exactly I should do for a 9-9.5+ grade in my 3rd sem. If someone could give a subject-wise analysis or guidance it'd be really helpful.\n\nAlso how much can I increase my final gpa before placements if Im looking at a \\~8.5 after 1st year ( on average how much do people usually end with if they grind the next 3 years properly starting from an 8.5 ).\n\nThanks",
  "metadata": {
    "root_comment_id": "n13mv2z",
    "post_id": "1lqlqz5",
    "author": "PrestigiousLow9589",
    "url": "https://www.reddit.com/r/PESU/comments/1lqlqz5/placements_need_3rd_sem_guidance_help_please/",
    "permalink": "https://reddit.com/r/PESU/comments/1lqlqz5/placements_need_3rd_sem_guidance_help_please/",
    "score": 22,
    "upvote_ratio": 0.8899999856948853,
    "created_utc": 1751536990,
    "flair": "Study Help :table:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "n13w1o8",
      "body": "+1 please guide us seniors"
    },
    {
      "id": "n13y50b",
      "body": "Pes academics is almost bs, and there's not too much to \"understand\" or wrap your head around. The hard part is remembering. \n\nIn the 3 years you will almost never in an exam be like \"ahh i can't understand how to do it\", the more common thing is \"ahh i can't remember this formula/procedure /these 5 points for the 5 marks\"\n\nSo there's not much you can do other than spend more time remembering stuff\n└── This"
    },
    {
      "id": "n14f6j0",
      "body": "\"Messed up my first year and couldn’t cross a 9 CGPA, even though it’s supposedly the easiest year to score in.\"  \n  \nThis isn’t entirely true—it varies from person to person. My semesters 3 and 4 had higher scores than semesters 1 and 2. In short, focus on solving slides and classwork problems, and learn most of your concepts during college classes. I have 9.5+ Cgpa right now , hope my answer is detailed enough to answer your queries  \nScoring 9.5+ can be hectic and requires consistent effort.  \n\n\nDo look into PYQ of all courses ( 2-3 years must be sufficient to get a rough idea of the topics )\n\nDDCO  \nRead the slides thoroughly and understand every concept clearly.  \nThis is a challenging course with a lot to memorize, so dedicate extra time to it.Mathematics for CS  \nRefer to classwork problems and use slides for reference.  \nPracticing these should be sufficient.  \n  \nWT (Web Technologies)  \nThis depends on your interest. I wasn’t too invested in this field, so I didn’t dive deep.  \nI mostly referred to the slides. For some topics, I used the ReactJS and MongoDB documentation to clarify concepts, as the slides were a bit unclear.  \n\\[This was especially helpful for MCQs.\\] No need to go through the entire documentation, just focus on what’s required for the course.  \n  \nAFLL  \nTry to get Prakash CO’s notes if possible (you can ask the professor directly).  \nSearch on Discord for a Google Drive with recordings of all topics by Preet Kanwal Ma’am.  \nUse slides and solve questions from Prakash CO’s notes.  \n\\[I don’t have these resources anymore, but they’re often passed down to juniors, so you might find them.\\]  \n  \nDSA   \n(Data Structures and Algorithms)  \nPractice coding in C for all concepts covered in the slides.  \nImplement and understand the concepts thoroughly—this is enough. Use slides for reference and focus on implementation for a solid understanding.  \n  \nCIE  \nGlance through the slides 1-2 hours before the exam and review the question bank. This should be sufficient.  \n  \nRegarding Placements  \nDon’t stress too much about GPA. Focus on building core skills and a deep understanding of concepts. Aim to keep your GPA above 8.75 before placements.  \nSpend time learning about topics you are interested in."
    },
    {
      "id": "n14k6lr",
      "body": "he answer to such type of questions is just a single word - study"
    }
  ]
}