{
  "id": "1lrcfif",
  "title": "[CET] Admission to B Tech CS or B Tech in AI ML through DCET 2025",
  "content": "I wanted to know what the fees structure will be if I get into PESU Ring road Campus  \nfrom 2nd year to 4th year what would be the fees for each year  \nIn the option entry list it is showing it will be 1.12L apart from the no refundable admission fees  \nBut I would still like to clarify that the fees will be the same   \nand if anyone are from PG I would like to know what the pricing will be each month for the PG and other expenses including going out with your friends and all ",
  "metadata": {
    "root_comment_id": "n19n32m",
    "post_id": "1lrcfif",
    "author": "Aniketan01",
    "url": "https://www.reddit.com/r/PESU/comments/1lrcfif/cet_admission_to_b_tech_cs_or_b_tech_in_ai_ml/",
    "permalink": "https://reddit.com/r/PESU/comments/1lrcfif/cet_admission_to_b_tech_cs_or_b_tech_in_ai_ml/",
    "score": 1,
    "upvote_ratio": 0.6700000166893005,
    "created_utc": 1751612986,
    "flair": "Admissions",
    "nsfw": false
  },
  "comments": [
    {
      "id": "n19n32m",
      "body": "Hi u/Aniketan01, your post was temporarily held for moderator review because it mentions topics related to admissions.\n\nAny posts asking for counseling advice based on JEE or CET rank will be removed promptly. Attempts to bypass this filter may result in a 30-day ban or longer for repeat offenders.\n\nThis strict rule is designed to protect you from misinformation and speculation, not to restrict you. Since this is the first year PES uses JEE and CET for admissions, there is no reliable data for making predictions. Many users offering predictions are fellow aspirants like you, without real expertise or data — effectively, the blind leading the blind. Choosing a college is a serious decision. **Please avoid relying on unverified predictions from peers who are also uncertain**.\n\nFor previous cutoffs and credible information, refer to this post: [Which branch can I get? (PESSAT 2022 cutoffs)](https://www.reddit.com/r/PESU/comments/1ct5ujc/which_branch_can_i_get_at_no_dont_make_such_posts/)\n\nPlease respect the rules and seek guidance from trusted sources.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PESU) if you have any questions or concerns.*"
    },
    {
      "id": "n19s9rg",
      "body": "If you are coming through DCET, then the fees will be same for all the 3 years + you have to pay an extra 10k if you want to get MRD/CNR scholarship."
    }
  ]
}