{
  "id": "1lrknh4",
  "title": "[Admission] Guys any idea on how many seats are surrenderd under jee and around how many will be called for kcet ?",
  "content": "",
  "metadata": {
    "root_comment_id": "n1bd9fb",
    "post_id": "1lrknh4",
    "author": "Dear_Ground9094",
    "url": "https://www.reddit.com/r/PESU/comments/1lrknh4/admission_guys_any_idea_on_how_many_seats_are/",
    "permalink": "https://reddit.com/r/PESU/comments/1lrknh4/admission_guys_any_idea_on_how_many_seats_are/",
    "score": 1,
    "upvote_ratio": 1,
    "created_utc": 1751640718,
    "flair": "Admissions",
    "nsfw": false
  },
  "comments": [
    {
      "id": "n1bd9fb",
      "body": "Hi u/Dear_Ground9094, your post was temporarily held for moderator review because it mentions topics related to admissions.\n\nAny posts asking for counseling advice based on JEE or CET rank will be removed promptly. Attempts to bypass this filter may result in a 30-day ban or longer for repeat offenders.\n\nThis strict rule is designed to protect you from misinformation and speculation, not to restrict you. Since this is the first year PES uses JEE and CET for admissions, there is no reliable data for making predictions. Many users offering predictions are fellow aspirants like you, without real expertise or data — effectively, the blind leading the blind. Choosing a college is a serious decision. **Please avoid relying on unverified predictions from peers who are also uncertain**.\n\nFor previous cutoffs and credible information, refer to this post: [Which branch can I get? (PESSAT 2022 cutoffs)](https://www.reddit.com/r/PESU/comments/1ct5ujc/which_branch_can_i_get_at_no_dont_make_such_posts/)\n\nPlease respect the rules and seek guidance from trusted sources.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PESU) if you have any questions or concerns.*"
    },
    {
      "id": "n1o0oz4",
      "body": "Very few seats have been surrendered. Hence jee round 2 counselling has been cancelled. This was the update given by admissions dept when went to college yesterday\n└── Are u sure bcz I heard lot of seats are surrenderd"
    },
    {
      "id": "n1r7p19",
      "body": "All the surrendered seats will be used for the pes kcet counselling scheduled on 20th\n└── Ohh damn and till wht rank are they calling?"
    }
  ]
}