{
  "id": "1lstdfm",
  "title": "[Discussion] A Call for Transparency.",
  "content": "Starting with the most obvious, ESA marks are not even shown to students unless reviewed.\n\nWe do have a great provision for relative grading when the batch performs poorly, but we’re not even sure if a subject will actually be scaled. This fuels rumours like “relative grading doesn’t happen in even sems” or \"cutoff reductions for each grade\" from being spread. Even when scaling happens, we only figure it out by asking at least five people for their grades, ISA marks, and expected lab marks. This makes applying for revaluation unnecessarily difficult.\n\nHow are we supposed to apply for reval in a subject with a lab component when we don’t even know if relative grading was used? Even from a money perspective, this doesn’t make sense for me.\n\nEach subject has so many assignments, and all of that is squeezed into just 10 marks. While this limits the chance of losing more than 3–4 marks, we should at least get the proper split-up for each assignment. \n\nThe irony is, for a university that prides itself on being autonomous, this feels on par with VTU colleges or worse. At least they know their lab marks. Yes, our reval fees is lower, but does that really make this okay?\n\nNo, this is not a rant\n\nand no, other colleges doing it does not justify it.\n\nI'm going to be sending a mail to the COE (a much formal and justifiable version) \n\n",
  "metadata": {
    "root_comment_id": "n1l7a4b",
    "post_id": "1lstdfm",
    "author": "Potato_Vortex",
    "url": "https://www.reddit.com/r/PESU/comments/1lstdfm/discussion_a_call_for_transparency/",
    "permalink": "https://reddit.com/r/PESU/comments/1lstdfm/discussion_a_call_for_transparency/",
    "score": 77,
    "upvote_ratio": 0.9800000190734863,
    "created_utc": 1751779001,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "n1l8400",
      "body": "\"your complaint has been noted and duly ignored\"\n└── Real"
    },
    {
      "id": "n1l8up1",
      "body": "Send it anonymously. These people are extremely petty and I'm 100% sure they'll make your life hell\n└── How so? Care to elaborate?"
    },
    {
      "id": "n1lbelt",
      "body": "Sending mail isn't gonna work, most of us tried in our batch and they just replied back saying everything is fine.\n\nDo try if you want, it doesn't matter whether it's anonymous or identifiable, let's see how good your luck is. And keep us in loop throughout 😁\n└── Worth a shot, let's see\n    └── Did you get any reply? I really wanna know what they said!!!"
    },
    {
      "id": "n1mrroz",
      "body": "Hello OP!  \nMany have sent emails and even talked to HODs regarding this, nothing has been done, I was gonna start a petition on campus to bring the college's attention to this, would it be possible for you to pm me to discuss details about issues you faced, the contents of your email, etc. so that we can maybe perhaps work together on this?\n├── Yes!\n├── Count me in.\n\n![gif](giphy|4NiFoaN9ufCOKbbn2i)\n└── Pls update me also with the info im in"
    },
    {
      "id": "n1nr3lp",
      "body": "Also recently, the college had started AI checking which, as people have reported, has said to shown pretty bad evaluation results compared to human checking and there even isn't enough clarity regarding how properly AI checked paper is reviewed before results are revealed or if AI checking has been done at all."
    },
    {
      "id": "n1tyf5h",
      "body": "Istg, just finished sem two and so done , these some teachers cut in lab and u can't even figure out where u have lost marks to get a particular grade.,, not just that before spending 1000 rs per subject , we shld atleast know whether it was relatively graded or not and if yes then the transition marks , this is so inconvenient and depressing to be so not transparent .. also this revaluation , to submit that form each time we need to go to college , what if we live far or out of Bangalore.. making life so inconvenient for students..\n└── I enquired with many teachers about the relative grading scheme for maths \nThey be like \"DONT TRUST YOU'RE SENIORS THERE IS NOTHING LIKE RELATIVE GRADING HERE AT PES\" do they think we are dumb or something\n    └── Istg, who sets all these if nobody knows"
    },
    {
      "id": "n2e6b4z",
      "body": "Yeah but they'll ignore y'all for sure"
    }
  ]
}