{
  "id": "1lu1jj8",
  "title": "[Placements] Help me understand the placements timeline",
  "content": "Is the placements stuff that happens during 7th sem our last chance at trying for tier 1 companies? Or do we get to try for them again during 8th sem? Cause I feel like I haven't done enough things to put on my resume. I want more time",
  "metadata": {
    "root_comment_id": "n1uk1qu",
    "post_id": "1lu1jj8",
    "author": "strange_panther21",
    "url": "https://www.reddit.com/r/PESU/comments/1lu1jj8/placements_help_me_understand_the_placements/",
    "permalink": "https://reddit.com/r/PESU/comments/1lu1jj8/placements_help_me_understand_the_placements/",
    "score": 13,
    "upvote_ratio": 0.8899999856948853,
    "created_utc": 1751912000,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "n1uk1qu",
      "body": "Hi u/strange_panther21, your post was temporarily held for moderator review because it mentions topics related to admissions, which automatically flags it for review. \n\nPosts involving admissions are treated with particular care on this subreddit due to the high potential for misinformation during high-stress times of counseling, seat allotment and critical decision-making periods.\n\nUnfortunately, we've seen how easily inaccurate or speculative advice spreads in such environments. Users frequently make major decisions about their future based on what they read online, often from fellow aspirants who may not have access to accurate information. This leads to confusion, false expectations, and in many cases, regret. Since this is the first year PES is using JEE and CET for admissions, the risk of misinformation is even greater and there simply isn't enough reliable historical data for anyone to make trustworthy predictions or statements.\n\nFor these reasons, all posts that fall under the category of admissions must go through moderator review and fact-checking before they are visible to the community. This is not meant to restrict discussion but to ensure that the advice shared here is grounded in verified knowledge and does not unintentionally mislead other students. Posts that speculate on admission procedures, branch allocation, share personal rank-based predictions, or solicit counseling advice from the crowd will generally not be approved, unless they clearly offer helpful, factual insights without creating confusion.\n\nIf you're looking for real data, refer to this post: [Which branch can I get? (PESSAT 2022 cutoffs)](https://www.reddit.com/r/PESU/comments/1ct5ujc/which_branch_can_i_get_at_no_dont_make_such_posts/)\n\nWe appreciate your understanding and cooperation. These policies are designed to protect not just you, but the entire community, from the harm that misinformation can cause during such a critical time. Please respect the rules and seek guidance from trusted sources. Attempts to bypass this filter may result in a 30-day ban or longer for repeat offenders.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PESU) if you have any questions or concerns.*"
    },
    {
      "id": "n1x8cce",
      "body": "Most tier 1 companies do come in 7th sem, few (but not zero) in 8th sem. You still have time to build up your resume now. If there is a time-turner, that's the only way you'll go back in time"
    },
    {
      "id": "n1xnwsz",
      "body": "first 2 to 3 months in 7th semester , most of the top companies come with internship + FTE offers where you  do  the internship in 8th sem and FTE later. 8th sem onwards lesser internship +FTE offers and just FTE  or just internship offers will be coming. some exceptions are ofc there.  \nBut you still have 1 month approx to build your resume. so all the best. make sure to add your sem projects and deploy them if you can.\n├── deploy means?\n│   └── make your project live on internet.If you deploy you will get a link for that project and you can put it on your resume or any where else you want to show it.\n└── Also what if I get only an internship offer? Then how can I get an FTE?\n    └── other companies come only for FTE , you are still eligible for them."
    },
    {
      "id": "n1zdpoh",
      "body": "You need to keep an eye out for the placement details."
    }
  ]
}