{
  "id": "1lu1lm8",
  "title": "[Question] Did I make a mistake choosing AIML over CSE? Need advice from seniors",
  "content": "Hey everyone,  \nI’m an AIML student just done with 1st year. Back during my PESSAT counselling, I had the option to choose between CSE and CSE-AIML. I picked AIML because I was interested in the AI/ML field.\n\nBut after joining college, I’ve been hearing that the syllabus is almost the same, and that real AIML stuff doesn’t start until much later. One of my friends even suggested I should try to shift to core CSE if I get a chance — said there’s uncertainty around AIML placements since the batch hasn’t been placed yet.\n\nNow I’m just confused — feels like neither the AIML learning nor placement clarity is working out. 😓\n\nCould some AIML seniors (especially 3rd/4th years or anyone placed) please share your experience?\n\n* Is there really a disadvantage in terms of placements?\n* Does AIML get proper exposure later in the course?\n* What would you do in my place?\n\nAlso — this might sound silly but I’m confused about one more thing:  \nShould AIML students…  \na) Follow the same path as CSE folks?  \nb) Try building their own direction in AI/ML (like doing more outside the syllabus)?  \nIf it's option b, would love to hear any roadmap, advice, or tips for how to go about it.\n\nThanks in advance 🙏 really appreciate any guidance from seniors. I'd love input from u/Sad_Ticket_8800  if you're around!",
  "metadata": {
    "root_comment_id": "n1ukhj4",
    "post_id": "1lu1lm8",
    "author": "Due-Bid3526",
    "url": "https://www.reddit.com/r/PESU/comments/1lu1lm8/question_did_i_make_a_mistake_choosing_aiml_over/",
    "permalink": "https://reddit.com/r/PESU/comments/1lu1lm8/question_did_i_make_a_mistake_choosing_aiml_over/",
    "score": 5,
    "upvote_ratio": 0.6899999976158142,
    "created_utc": 1751912140,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "n1ukhj4",
      "body": "Hi u/Due-Bid3526, your post was temporarily held for moderator review because it mentions topics related to admissions, which automatically flags it for review. \n\nPosts involving admissions are treated with particular care on this subreddit due to the high potential for misinformation during high-stress times of counseling, seat allotment and critical decision-making periods.\n\nUnfortunately, we've seen how easily inaccurate or speculative advice spreads in such environments. Users frequently make major decisions about their future based on what they read online, often from fellow aspirants who may not have access to accurate information. This leads to confusion, false expectations, and in many cases, regret. Since this is the first year PES is using JEE and CET for admissions, the risk of misinformation is even greater and there simply isn't enough reliable historical data for anyone to make trustworthy predictions or statements.\n\nFor these reasons, all posts that fall under the category of admissions must go through moderator review and fact-checking before they are visible to the community. This is not meant to restrict discussion but to ensure that the advice shared here is grounded in verified knowledge and does not unintentionally mislead other students. Posts that speculate on admission procedures, branch allocation, share personal rank-based predictions, or solicit counseling advice from the crowd will generally not be approved, unless they clearly offer helpful, factual insights without creating confusion.\n\nIf you're looking for real data, refer to this post: [Which branch can I get? (PESSAT 2022 cutoffs)](https://www.reddit.com/r/PESU/comments/1ct5ujc/which_branch_can_i_get_at_no_dont_make_such_posts/)\n\nWe appreciate your understanding and cooperation. These policies are designed to protect not just you, but the entire community, from the harm that misinformation can cause during such a critical time. Please respect the rules and seek guidance from trusted sources. Attempts to bypass this filter may result in a 30-day ban or longer for repeat offenders.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PESU) if you have any questions or concerns.*"
    },
    {
      "id": "n1x79hb",
      "body": "Rowlett has literally posted about why core CS is more preferable on the FAQs. I'm surprised you didn't tag him instead of the random guy who thinks that incoming freshers will know what their GPA will be, and decide their college based on that\n├── I wouldn't be surprised if this is \"that random guy's\" alt, lmfao\n├── There's a new rowlet in town\n│   └── cant beat the original\n│       └── ![gif](giphy|OaomGL55IkfXKynnQS)\n└── tq for letting me know about FAQ's i will look into it !"
    },
    {
      "id": "n1zuecd",
      "body": "4th year AIML dude here.\n\nNo clue about placements yet, although internship offers during 3rd year were handed out almost proportionately to dept sizes.  \nComing to exposure, aka electives during 3rd year. They're good, but you can get a similar, if not better understanding of certain concepts if you just put in the time to learn whenever you can. The syllabus seems to be the exact same across departments until the 3rd year.  \nWhat really irks me is the fact that you're not given the choice of taking up some really good electives like the ones in the systems vertical (BD, HP, etc.). Those are much safer electives to be choosing as an undergrad. Realistically, you have much higher chances of getting an ML-related job right out of the gate after you've done a masters in this domain.\n\nThe choice is ultimately yours. Would personally just shift to CSE if I cleared the GPA requirement to do so. If not, you're still fine.\n├── what's the gpa requirement to shift?\n└── Tq for sharing !!"
    }
  ]
}