{
  "id": "1lwy587",
  "title": "[Admission] Original documents required",
  "content": "What are the original documents required to be submitted for seat confirmation? Pls",
  "metadata": {
    "root_comment_id": "n2hvft9",
    "post_id": "1lwy587",
    "author": "Putrid_Painter_3909",
    "url": "https://www.reddit.com/r/PESU/comments/1lwy587/admission_original_documents_required/",
    "permalink": "https://reddit.com/r/PESU/comments/1lwy587/admission_original_documents_required/",
    "score": 1,
    "upvote_ratio": 0.6700000166893005,
    "created_utc": 1752209551,
    "flair": "Admissions",
    "nsfw": false
  },
  "comments": [
    {
      "id": "n2hvft9",
      "body": "Hi u/Putrid_Painter_3909, your post was temporarily held for moderator review because it mentions topics related to admissions, which automatically flags it for review. \n\nPosts involving admissions are treated with particular care on this subreddit due to the high potential for misinformation during high-stress times of counseling, seat allotment and critical decision-making periods.\n\nUnfortunately, we've seen how easily inaccurate or speculative advice spreads in such environments. Users frequently make major decisions about their future based on what they read online, often from fellow aspirants who may not have access to accurate information. This leads to confusion, false expectations, and in many cases, regret. Since this is the first year PES is using JEE and CET for admissions, the risk of misinformation is even greater and there simply isn't enough reliable historical data for anyone to make trustworthy predictions or statements.\n\nFor these reasons, all posts that fall under the category of admissions must go through moderator review and fact-checking before they are visible to the community. This is not meant to restrict discussion but to ensure that the advice shared here is grounded in verified knowledge and does not unintentionally mislead other students. Posts that speculate on admission procedures, branch allocation, share personal rank-based predictions, or solicit counseling advice from the crowd will generally not be approved, unless they clearly offer helpful, factual insights without creating confusion.\n\nIf you're looking for real data, refer to this post: [Which branch can I get? (PESSAT 2022 cutoffs)](https://www.reddit.com/r/PESU/comments/1ct5ujc/which_branch_can_i_get_at_no_dont_make_such_posts/)\n\nWe appreciate your understanding and cooperation. These policies are designed to protect not just you, but the entire community, from the harm that misinformation can cause during such a critical time. Please respect the rules and seek guidance from trusted sources. Attempts to bypass this filter may result in a 30-day ban or longer for repeat offenders.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PESU) if you have any questions or concerns.*"
    },
    {
      "id": "n2ifpaz",
      "body": "During the time of admission they will let you know, generally they would ask for  \n1) 12th Original Mark sheet  \n2) 10th Original Mark Sheet  \n3) Transfer Certificate \n\nAlso you can claim this back after 1st year. Or maybe 1st Sem.\n├── I just finished and came out. Thanks tho🙏\n├── I think its for UG Tell me about pg\n└── if submitted in other college, what to do. As other colleges start early, but PES 4th round is later. Want to quit the other college and take admission here depending on counselling"
    },
    {
      "id": "n31ucxe",
      "body": "Marksheets (10th and 12th)\n\nAadhaar or any other proof of identity that you gave @ the time of admission\n\npassport size photos.\n\nTC \n\nI think this is the basic\n└── Hi..I’m in sem 3 at ECC. Last year, I submitted my original 10th and 12th mark sheets to the RR office, and they told me the docs would be transferred to ECC if I am not wrong. I’ve applied for passport renewal and need those originals back in about 2 weeks. Should I write an application or just email the admin office? Planning to contact them tomorrow. Any tips on how to get my documents back smoothly?\n    └── If it's still in RR campus, you need to visit the MRD office and ask. If they say no...u should ask in the equivalent in the EC campus"
    }
  ]
}