{
  "id": "1lx5g6t",
  "title": "PES CSE or Comedk colleges at 11.1k rank?",
  "content": "",
  "metadata": {
    "root_comment_id": "n2jcl38",
    "post_id": "1lx5g6t",
    "author": "Wizard_1857",
    "url": "https://i.redd.it/gqniigklm8cf1.jpeg",
    "permalink": "https://reddit.com/r/PESU/comments/1lx5g6t/pes_cse_or_comedk_colleges_at_111k_rank/",
    "score": 0,
    "upvote_ratio": 0.3799999952316284,
    "created_utc": 1752236460,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "n2jcl38",
      "body": "Hi u/Wizard_1857, your post was temporarily held for moderator review because it mentions topics related to admissions, which automatically flags it for review. \n\nPosts involving admissions are treated with particular care on this subreddit due to the high potential for misinformation during high-stress times of counseling, seat allotment and critical decision-making periods.\n\nUnfortunately, we've seen how easily inaccurate or speculative advice spreads in such environments. Users frequently make major decisions about their future based on what they read online, often from fellow aspirants who may not have access to accurate information. This leads to confusion, false expectations, and in many cases, regret. Since this is the first year PES is using JEE and CET for admissions, the risk of misinformation is even greater and there simply isn't enough reliable historical data for anyone to make trustworthy predictions or statements.\n\nFor these reasons, all posts that fall under the category of admissions must go through moderator review and fact-checking before they are visible to the community. This is not meant to restrict discussion but to ensure that the advice shared here is grounded in verified knowledge and does not unintentionally mislead other students. Posts that speculate on admission procedures, branch allocation, share personal rank-based predictions, or solicit counseling advice from the crowd will generally not be approved, unless they clearly offer helpful, factual insights without creating confusion.\n\nIf you're looking for real data, refer to this post: [Which branch can I get? (PESSAT 2022 cutoffs)](https://www.reddit.com/r/PESU/comments/1ct5ujc/which_branch_can_i_get_at_no_dont_make_such_posts/)\n\nWe appreciate your understanding and cooperation. These policies are designed to protect not just you, but the entire community, from the harm that misinformation can cause during such a critical time. Please respect the rules and seek guidance from trusted sources. Attempts to bypass this filter may result in a 30-day ban or longer for repeat offenders.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PESU) if you have any questions or concerns.*"
    },
    {
      "id": "n2jiq89",
      "body": "11.1k pe konsa PES CSE mil raha, how did I miss that last year 😞\n└── His comedk rank is 11.1k"
    },
    {
      "id": "n2jk0c8",
      "body": "Pesu easily"
    },
    {
      "id": "n2jqpah",
      "body": "Mera rank 7k hai aur mai PES aiml le rha\n└── but comedk colleges are \\~9lakhs cheaper than PES...\n    └── Bhai but in your case, at a rank of 11k, you are not gonna get anything decent. So, pes would be a better investment even with a higher fees.\n        └── I'm getting BMSIT CSE, RVITM CSE, SIT Tumkur CSE, DSCE ECE so PES will be a wise decision or no kyunki unka intake jyada hai like \\~720 CSE core+ 480 CSE AIML and for both campus placement centralised hai so approx. 2400 students ho gyee! and considering comedk is \\~9lakhs cheaper... I'm confused\n            └── rvitm cse has good placement, bmsit has decent placement and good campus, sit i wont recommend for non-KA student\n                └── why not SIT because of language barrier?  and what is the scene of PGs in Bangalore like how much will it cost monthly if I took a single room PG with decent facilities?\n                    └── yes because language barrier and rvitm is better but campus isn't good, bmsit is worth the money imo"
    },
    {
      "id": "n2jsztw",
      "body": "I had 6k rank and still took pes. Honestly rvce is pretty hard to get, msrit and bms are also tougher to get (though bms has increased seats), so pes through jee mains is the best option for anyone who stands no chance of the above three (only if u can afford it though, financial muscle probably plays a big role in deciding if it's the \"best\" option for you)\n└── is it hard to get scholorship in PES? like comedk colleges are \\~9 lakhs cheaper than PES... so what should I Choose?\n    └── No idea about how hard is it to get a scholarship because college hasn't started for me yet. Regarding other comedk colleges, I don't think at 11k u gonna get even dsce or nie mysore. So it's better to go with pes. If u get a cgpa of 8.5 or 9 (don't remember exactly), ur 40% tuition fees will be relieved"
    },
    {
      "id": "n2k2zvm",
      "body": "stfu and take pes cse no other colleges needed peace u need which u will get in pes cse after studying and little bit enjoying macha\n├── but through comedk fee is \\~9 lakhs cheaper than PES so i'm in doubt\n│   └── then take comedk bro if u are getting any good colleges at 11k\n│       └── bhai like I'm getting BMSIT CSE, RVITM CSE, SIT Tumkur CSE, DSCE ECE so PES will be a wise decision or no kyunki unka intake jyada hai like \\~720 CSE core+ 480 CSE AIML and for both campus placement centralised hai so approx. 2400 students ho gyee! and considering comedk is \\~9lakhs cheaper... I'm confused\n│           └── **Take SIT Tumkur CSE – the median package is around 8–9 LPA, and about 93% of students are placed. BMSIT CSE is similar in terms of placement but has a very high intake. On the other hand, RVITM CSE is in a completely new campus – there's barely any college life, it feels more like a school. Placements there are average to decent, with the lowest being 3 LPA and the highest going up to 27 LPA, but again, it’s a very new campus.**\n\n**Considering both placements and college life, SIT Tumkur is definitely the better choice. Just go for it, bro!**\n│               └── but in PES, if you pay more but also study more, u have a shot at a much better placement\n│                   └── i mean might be yes might be no . it all depend on individual\n│                       └── is it hard to get scholorship in PES?\n│                           └── 1. Prof. MRD Scholarships\n\nMerit Certificate + 50% Tuition Fee Refund for Top 5% of the Students based on their CGPA.\n\n# 2. Prof. CNR Rao Scholarships\n\nMerit Certificate + 40% Tuition Fee Refund for the next 20% of the Students based on their SGPA.\n\n# 3. Distinction Awards\n\nMerit Certificate for Students securing 7.75+ SGPA.\n\n**Note:**\n\n1. The Scholarships/ Awards are subject to qualifying CGPA/ SGPA and other conditions as stipulated by Scholarship Committee each year.\n2. The above Scholarships/ Awards are not applicable to students in their final year of study.\n3. The student is eligible only for one award in each semester/year.\n\n# DevOn Corporate Scholarships\n\nMany corporates offer scholarships for our students in the final year of their education recognizing their merit\n\nhttps://preview.redd.it/lmlwhwi6efcf1.png?width=750&format=png&auto=webp&s=c10bfe96ed6efa280637803c72778aec8ef42d2c\n\n# Teaching Assistantships\n\nStudents who display proven acumen towards teaching shall be compensated for assisting their Professors in teaching their students\n\n# Research Assistantships\n\nStudents showing keen research intent can work under Professor’s as research associates and can be compensated for it.\n│                               ├── CGPA mantain krna hard hai kyaa bahut? and I heard from a PES senior ki <7.5 CGPA students are placed maximum at 6 lpa?\n│                               │   └── CGPA is just used as a filter. Having a CGPA of 8.5+ is the best bet if you're in CS (although don't let that stop you from aiming for higher).\n\nYour projects, experiences, publications and other work that makes up your profile is what will matter. Once you clear the CGPA cutoffs to sit for companies, your skills and projects are the primary factors that will land you a job. It's a similar story for Masters, although you preferably also want a much higher CGPA since it's weighted more.\n\nSummary, don't spend all your time on your CGPA. Find a balance between the CGPA you want (an 8.7-9.2 for CS is the best possible thing you can achieve without sacrificing too much on either end) and your other activities. Good luck!\n\nStudents with cgpa above 6.5 are allowed to sit for companies,rest the companies decide the cutoff,A cgpa above 8 will allow you to sit for 99% of companies. And many companies shortlist higher gpa students in the process.\n\nA company offers the same package to all students that it selects, irrespective of their GPA.\n\ni guess it helps u\n│                               │       └── it helped a lot bro are you landed in any scholorship range?\n│                               │           └── no\n│                               └── and what is the scene of PGs in Bangalore like how much will it cost monthly if I took a single room PG with decent facilities?\n│                                   └── * **Budget options** (basic amenities, shared washrooms): ₹7,000–₹12,000/month \n* **Mid-range** (furnished room, attached bathroom, meals, Wi‑Fi, housekeeping): ₹12,000–₹18,000/month                                                                                                 Ideal baseline budget: **₹15,000/month** for comfortable living with food and utilities included. I m not sure though but this is approx\n│                                       └── broo thanks a lot for the infos! appreciated🫡\n│                                           └── good luck\n│                                               └── thank you and gl to you too :)\n└── also is it hard to get scholorship in PES?\n    ├── no idea about scholarship\n    └── get above 8.6+ (usually) for 40% refund and 9.4+ (usually) for 50% refund\n        ├──  what is the scene of PGs in Bangalore like how much will it cost monthly if I took a single room PG with decent facilities?\n        ├── are you offered any scholorship by PES?\n        └──  and I heard from a PES senior ki <7.5 CGPA students are placed maximum at 6 lpa?\n            └── Varies to person to person bro but ofc if gpa is low, ctc will be low"
    }
  ]
}