{
  "id": "1m4pyc5",
  "title": "[Question] Who do I submit the union bank account form to?",
  "content": "Hey there, recently received the CNR scholarship but hadn't opened a union bank account last sem. Went to the PESIT branch, where they gave me a form to fill and told me to submit the form to open the bank account at the mrd block. At the mrd block reception they told me to go to gjbc accounts, but then the accounts people told me to go back to mrd block where I was now told that they aren't collecting the form to open the bank account. Super confused abt the situation, would really appreciate it if any of yall knew who I could possibly contact for help, or where I could go to submit the form and open the bank account. Thanks.",
  "metadata": {
    "root_comment_id": "n46356a",
    "post_id": "1m4pyc5",
    "author": "Buntsforever",
    "url": "https://www.reddit.com/r/PESU/comments/1m4pyc5/question_who_do_i_submit_the_union_bank_account/",
    "permalink": "https://reddit.com/r/PESU/comments/1m4pyc5/question_who_do_i_submit_the_union_bank_account/",
    "score": 3,
    "upvote_ratio": 0.8100000023841858,
    "created_utc": 1753020841,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "n46eopx",
      "body": "Yeah seems rather frustrating,the bank and the college are usually never on the same page.\n\nYou can just open a union bank account anywhere,there’s another branch on the road behind the PESIT branch if this one seems to prove troublesome.Once you open an account,give your account details (number,IFSC code,branch name etc) to the COE,which is at the basement of BE block.\n└── Ight thanks man appreciate the help"
    },
    {
      "id": "n46p2a4",
      "body": "Scholarship email isnt out yet out for 2nd sem ryt?\n└── I'm not doing 2nd year btech so ye it might not be out for u guys yet\n    └── Bro are you moving abroad\n        └── Ye after graduation, why do you ask\n            └── Even i was interested to do so, if you don't mind can you tell me wich path are you talking\n                └── Sure, I was actually planning to do my undergraduate outside the country as well but due to some family matters I decided to stay back, as for my master's I'm going to start preparing for the GMAT exams from the sem 4 summer vacations for masters in finance and I'll probably be applying to universities in south east asia so like Singapore, Malaysia etc during the 7th sem if all goes well. And for portfolio work I'll probably pick up a few internships here and there, but it's not as big of a concern for me because I have a strong work experience background from before coming to uni. Hope this helps man if u got any other qs feel free to ask or dm me anytime."
    }
  ]
}