{
  "id": "1m6dj7l",
  "title": "[Admission]I'm stuck with ee in rr campus",
  "content": "[removed]",
  "metadata": {
    "root_comment_id": "n4ioi4j",
    "post_id": "1m6dj7l",
    "author": "xX_NeutronStar_Xx",
    "url": "https://www.reddit.com/r/PESU/comments/1m6dj7l/admissionim_stuck_with_ee_in_rr_campus/",
    "permalink": "https://reddit.com/r/PESU/comments/1m6dj7l/admissionim_stuck_with_ee_in_rr_campus/",
    "score": 6,
    "upvote_ratio": 1,
    "created_utc": 1753189427,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "n4ioi4j",
      "body": "Hi u/xX_NeutronStar_Xx, your post was temporarily held for moderator review because it mentions topics related to admissions, which automatically flags it for review. \n\nPosts involving admissions are treated with particular care on this subreddit due to the high potential for misinformation during high-stress times of counseling, seat allotment and critical decision-making periods.\n\nUnfortunately, we've seen how easily inaccurate or speculative advice spreads in such environments. Users frequently make major decisions about their future based on what they read online, often from fellow aspirants who may not have access to accurate information. This leads to confusion, false expectations, and in many cases, regret. Since this is the first year PES is using JEE and CET for admissions, the risk of misinformation is even greater and there simply isn't enough reliable historical data for anyone to make trustworthy predictions or statements.\n\nFor these reasons, all posts that fall under the category of admissions must go through moderator review and fact-checking before they are visible to the community. This is not meant to restrict discussion but to ensure that the advice shared here is grounded in verified knowledge and does not unintentionally mislead other students. Posts that speculate on admission procedures, branch allocation, share personal rank-based predictions, or solicit counseling advice from the crowd will generally not be approved, unless they clearly offer helpful, factual insights without creating confusion.\n\nIf you're looking for real data, refer to this post: [Which branch can I get? (PESSAT 2022 cutoffs)](https://www.reddit.com/r/PESU/comments/1ct5ujc/which_branch_can_i_get_at_no_dont_make_such_posts/)\n\nWe appreciate your understanding and cooperation. These policies are designed to protect not just you, but the entire community, from the harm that misinformation can cause during such a critical time. Please respect the rules and seek guidance from trusted sources. Attempts to bypass this filter may result in a 30-day ban or longer for repeat offenders.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PESU) if you have any questions or concerns.*"
    },
    {
      "id": "n4k088n",
      "body": "You can change your branch after first year I think\n└── Do yk when the last date to withdraw the seat is?😔\n    ├── Already passed\n    │   └── I heard someone say they pushed it to 25th💔\n(Also doesn't pes follow ugc refund policy?)\n    └── https://preview.redd.it/59k94futogef1.png?width=1080&format=png&auto=webp&s=f2e5acf5ae49c426b16a9e118232b1ee54f19d84\n\nI would trust this more than anything ig .. and it makes sense cuz before 2nd round only you must withdraw seats and even the speech during 1st counselling mentioned it .. that on 2nd round there would be no option to withdraw .. only before 2nd round it's possible .. but now due to this extra kcet round idk if thats true .. they might've changed the date on website if something was gonna be different tho\n        └── But according to ugc policy the last date to withdraw the seat is usually in end Sept or october, aren't they legally required to follow that?\n            └── Pes won't follow it unless it's from KCET .. cuz management quota and JEE counselling are different and even have different dates of counselling .. the only thing they should follow is to give 15+ days for surrendering seats after allotment through the first round only .. as second round is last one it's obvious no college will give u chance to surrender seat cuz u can't fill it because there is no more allotment round for the same seat ..\n                └── Aah I guess that makes sense \nJust had a doubt cause they've mentioned on their website that they follow ugc refund policy.\nSo not adhering to it would be very shady\n                    └── Maybe yes .. but they might call \"JEE Quota\" a special category of seat allotment .. then they won't have to follow UGC rules anymore .."
    },
    {
      "id": "n4k249z",
      "body": "Getting 8+ CGPA in first year will be good enough for branch change to ece"
    }
  ]
}