{
  "id": "1m9vz12",
  "title": "[Question] MY KCET RESULT , WHAT DO DO NOW",
  "content": "I got best pes ecity cse core , show my question was what should I add above this option like what should give more priority than this in first round and further rounds my options are\n\nBms -- cse cyber , csbs,aiml\nMsrit -- aids, aiml\nPes rr -- aiml\n\nI know many of you work tell me to go with pes rr aiml but if I want less academic pressure and more freedom so what should I go with \n\nIf I go till 3rd round then these are options i might get like if I am lucky to get around 200 rank inflation \n\nMsrit -- cse cyber around 200 rank inflation required \nBms-- cse core around 200 rank inflation required\n\n\n\n",
  "metadata": {
    "root_comment_id": "n5a0bim",
    "post_id": "1m9vz12",
    "author": "Correct-Engineer5178",
    "url": "https://i.redd.it/w59bp6yek8ff1.png",
    "permalink": "https://reddit.com/r/PESU/comments/1m9vz12/question_my_kcet_result_what_do_do_now/",
    "score": 15,
    "upvote_ratio": 0.8899999856948853,
    "created_utc": 1753543263,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "n5a0bim",
      "body": "Hi u/Correct-Engineer5178, your post was temporarily held for moderator review because it mentions topics related to admissions, which automatically flags it for review. \n\nPosts involving admissions are treated with particular care on this subreddit due to the high potential for misinformation during high-stress times of counseling, seat allotment and critical decision-making periods.\n\nUnfortunately, we've seen how easily inaccurate or speculative advice spreads in such environments. Users frequently make major decisions about their future based on what they read online, often from fellow aspirants who may not have access to accurate information. This leads to confusion, false expectations, and in many cases, regret. Since this is the first year PES is using JEE and CET for admissions, the risk of misinformation is even greater and there simply isn't enough reliable historical data for anyone to make trustworthy predictions or statements.\n\nFor these reasons, all posts that fall under the category of admissions must go through moderator review and fact-checking before they are visible to the community. This is not meant to restrict discussion but to ensure that the advice shared here is grounded in verified knowledge and does not unintentionally mislead other students. Posts that speculate on admission procedures, branch allocation, share personal rank-based predictions, or solicit counseling advice from the crowd will generally not be approved, unless they clearly offer helpful, factual insights without creating confusion.\n\nIf you're looking for real data, refer to this post: [Which branch can I get? (PESSAT 2022 cutoffs)](https://www.reddit.com/r/PESU/comments/1ct5ujc/which_branch_can_i_get_at_no_dont_make_such_posts/)\n\nWe appreciate your understanding and cooperation. These policies are designed to protect not just you, but the entire community, from the harm that misinformation can cause during such a critical time. Please respect the rules and seek guidance from trusted sources. Attempts to bypass this filter may result in a 30-day ban or longer for repeat offenders.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PESU) if you have any questions or concerns.*"
    },
    {
      "id": "n5aetjy",
      "body": "If you are getting core CSE in pes ec, then honestly you should put only rvce CSE and pes CSE above that; Nothing else. If you are thinking about giving a priority to CSE+with something over CSE just give a thought about it.\n├── I got pes ecity cse too did exactly that\n├── I personally told OP exactly this on dm a day ago. Oh well.\n└── good luck with \\~2200 CSE students only"
    },
    {
      "id": "n5azk3e",
      "body": "Only put rr cse and rvce cse above ecc cse.\nBms and msrit are shit.\n└── but bmsce placements seem good this year is choosing pes ecc any good?\n    └── I would take pes over bms any day.\nEven ecc has good coding culture and shit.\nPlus a much better syllabus than vtu."
    },
    {
      "id": "n5dxpiw",
      "body": "If u want less academic pressure and more freedom, pes rr all the way"
    },
    {
      "id": "n64l53g",
      "body": "Be Patient . Wait till the 3rd Round No Matter What .  \nYou can add like RVCE(CSE) , RVCE(AIML) , RVCE(ECE)\\[if interested\\] , PESU RR(CSE) above the PES EC(CSE)\n\nSJCE , Mysore is also pretty good now a days . If you are interested , that is an option too .\n└── SJCE they didn't publish placements of last 2 years are you sure\n    ├── 100% brother . I've got many seniors and also classmates who've studied/studying there\n    └── As I've heard , the coding culture is crazy in SJCE\n        └── okk I got JSSSTU in first round so ima proceed ig although I did think of putting bmsce"
    }
  ]
}