{
  "id": "1mbgy9r",
  "title": "[Question] How to maintain a good CGPA ???",
  "content": "Was talking to a senior, so he told me it is really difficult to maintain a good cgpa in pesu so I just wanted to confirm is it really difficult to maintain a good cgpa like 9 or more than 9 ??? Also am not good in jee maths (like I am very bad in integration) so will that affect my college studies??? Please Help 🙏 ",
  "metadata": {
    "root_comment_id": "n5lyrs9",
    "post_id": "1mbgy9r",
    "author": "pareshan_aatmaaa",
    "url": "https://www.reddit.com/r/PESU/comments/1mbgy9r/question_how_to_maintain_a_good_cgpa/",
    "permalink": "https://reddit.com/r/PESU/comments/1mbgy9r/question_how_to_maintain_a_good_cgpa/",
    "score": 18,
    "upvote_ratio": 0.9100000262260437,
    "created_utc": 1753711193,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "n5lyrs9",
      "body": "Hi u/pareshan_aatmaaa, your post was temporarily held for moderator review because it mentions topics related to admissions, which automatically flags it for review. \n\nPosts involving admissions are treated with particular care on this subreddit due to the high potential for misinformation during high-stress times of counseling, seat allotment and critical decision-making periods.\n\nUnfortunately, we've seen how easily inaccurate or speculative advice spreads in such environments. Users frequently make major decisions about their future based on what they read online, often from fellow aspirants who may not have access to accurate information. This leads to confusion, false expectations, and in many cases, regret. Since this is the first year PES is using JEE and CET for admissions, the risk of misinformation is even greater and there simply isn't enough reliable historical data for anyone to make trustworthy predictions or statements.\n\nFor these reasons, all posts that fall under the category of admissions must go through moderator review and fact-checking before they are visible to the community. This is not meant to restrict discussion but to ensure that the advice shared here is grounded in verified knowledge and does not unintentionally mislead other students. Posts that speculate on admission procedures, branch allocation, share personal rank-based predictions, or solicit counseling advice from the crowd will generally not be approved, unless they clearly offer helpful, factual insights without creating confusion.\n\nIf you're looking for real data, refer to this post: [Which branch can I get? (PESSAT 2022 cutoffs)](https://www.reddit.com/r/PESU/comments/1ct5ujc/which_branch_can_i_get_at_no_dont_make_such_posts/)\n\nWe appreciate your understanding and cooperation. These policies are designed to protect not just you, but the entire community, from the harm that misinformation can cause during such a critical time. Please respect the rules and seek guidance from trusted sources. Attempts to bypass this filter may result in a 30-day ban or longer for repeat offenders.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PESU) if you have any questions or concerns.*"
    },
    {
      "id": "n5mjpwa",
      "body": "Go through previous discussions on this topic. It's been explained before, multiple times. Check the FAQs. \n\nIf you want to do well and get a 9+, it means you need to cross an 80/100 on average on the overall score for each course. While this sounds like a simple directive, the difficulty lies in execution. Each course can have assignments, quizzes, projects, etc (depends on how the course is planned). Since *everything* adds to your final grade, the only way to do well in a course is to do well in *everything*. \n\nSo to do well, you simply need to put in consistent efforts throughout the semester. This isn't a place where you can study overnight or 1-2 days before the exam and slip through. Your GPA will suffer if you let all deliverables overwhelm you. Start assignments/projects early, be on top of deadlines, plan your week ahead in advance, set fixed goals, manage your time between fun and study efficiently. Most top performers at PES aren't the ones who work their asses off like donkeys a few days before the exam or are geniuses in their field, they're ordinary folks who know how to balance their time, and most importantly, they put in moderate but consistent efforts over the semester rather than cramming overnight. \n\nThere is no overnight academic success story at PES. If you want to do well *and* not lose your sanity, the only way to do it is to be smart about *how* you study rather than *how much*. Many people cross a 9, it's not that difficult if  (1) you dedicate time and effort and more specifically, (2) at the right time.\n└── Thank you very much ☺️\n    └── Other tips and tricks have been posted before (mostly by me) about how to manage time and study, how to know how much effort to put in, how to set what I call an \"effort boundary\", basically how to get the most out of your time (academically and fun too), how to network with and get the most out of seniors/alumni at PES. Search the subreddit, or my older comments, and you should find it.\n        └── Ok, Thank you sooo much 😭😭😭\n            └── I found a few other links which may not be directly related but might help in the long run (definitely recommend reading all, or at the very least, the FIRST one):  \n  \n1. Tips/tricks for freshers, compiled by me: [https://www.reddit.com/r/PESU/comments/1ek15de/fresher\\_here\\_cse/](https://www.reddit.com/r/PESU/comments/1ek15de/fresher_here_cse/)  \n2. How to equip yourself for placements: [https://www.reddit.com/r/PESU/comments/1ljeutj/comment/mzjhtzr/?utm\\_source=share&utm\\_medium=web3x&utm\\_name=web3xcss&utm\\_term=1&utm\\_content=share\\_button](https://www.reddit.com/r/PESU/comments/1ljeutj/comment/mzjhtzr/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)  \n3. Another less detailed post about managing time: [https://www.reddit.com/r/PESU/comments/1d66ywv/comment/l6qhycx/?utm\\_source=share&utm\\_medium=web3x&utm\\_name=web3xcss&utm\\_term=1&utm\\_content=share\\_button](https://www.reddit.com/r/PESU/comments/1d66ywv/comment/l6qhycx/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)  \n4. Search results for all time-management related comments from me: [https://www.reddit.com/user/rowlet-owl/search/?q=time+management&type=comments&cId=d9c3265a-259a-48d7-b012-c9ffef6c6919&iId=27a6167c-31e4-4359-965b-b184d7efc832](https://www.reddit.com/user/rowlet-owl/search/?q=time+management&type=comments&cId=d9c3265a-259a-48d7-b012-c9ffef6c6919&iId=27a6167c-31e4-4359-965b-b184d7efc832)\n                └── Thank you again ... 😭😭😭\nmost cool senior you are 🥹😌🙏\n                    └── \\*coolest. And yes, yes I am.\n\n![gif](giphy|9EDHvl8L5WbbTDJG3N)"
    },
    {
      "id": "n5mpzih",
      "body": "Currently have a 9cg, so i can help u a bit in this.. Its not that tough to get 9, but you have to be consistent, so just be consistent in studies, Start studying like 2 weeks before isa 1 and 3 weeks before isa 2, [3 weeks before isa 2 coz the last week of the sem will be stressful as you have to submit all the assignments, and stuff], do this youll get 9..\n\nFor first year slides are more than sufficient for all the subjects if your aim is just 9, to get 10 cg you have to study notes as well..\n\nHope this helps\n└── Thank you 😊"
    },
    {
      "id": "n5mrfc2",
      "body": "1. Study atleast the tough topics in syllabus before the ISA/ESA begins. Not 1 day before or in the exam gap.\n2. (very imp) Learn how to frame your answers well if it's not a mathematical/arithmetic oriented subject.\n3. Pray that the qp setter knows his shit. Your knowledge doesn't matter if the qp is not worded well or is very tough to crack.\n└── Noted, Thank you ☺️"
    },
    {
      "id": "n5n4uyt",
      "body": "source: 9.7 cgpa after 4 years\n\nit's not hard, but it does take effort and time. common things to do are, as mentioned elsewhere in the comments, to start studying earlier and take notes of concepts. try to find the best way you absorb information, for me I preferred a visual way to connect topics so my notes were structured like a web of info, so I can relate topics with each other. specifically about studying for tests, you'll have a good idea of what's important from previous years papers or asking the prof, and you can focus on some topics deeply while maybe only a surface level understanding of something else is ok\n└── Noted, Thank you ☺️"
    },
    {
      "id": "n5nzlvu",
      "body": "I had .5 cgpa after 1st sem, I know this is a dream for 95% here but here at my tips:\n\nDon’t give a damn about exams, they are basically like 1 hour of how you do, useless in my opinion\n\nI gamed the entire night before exam and yet I have this result, join the valo grindset and become topper student (you will still be second to me)\n\n![gif](giphy|Uhhab2MUqOMmWBG55K)\n└── Post/comment contains advice or information that is incorrect, misleading, unethical, or potentially harmful. Please fact-check before posting and refer to reliable sources when giving guidance."
    },
    {
      "id": "n6dr9ah",
      "body": "Hey there....I am a recent graduate and know something that might help. So maintaining consistent CGPAs is tricky, I know of alums from PESIT who wrecked their GPAs with just bad performance in 2-3 subjects. They ended up missing their placement shortlists despite strong skills and placement prep.  \nMy friend who is also from PESIT has developed an algorithm of sorts that can figure out what to study from a course syllabus, what is important and get instant answers to all doubts. It is currently under trial, but he is gathering interests from students across multiple VTU colleges. It is like a hack to improve grades, but will be built only when a minimum number of interests is received. Don't mean to spam you, but if you are interested, you can just add it here and invite like-minded people too  \n[www.kplor.com](http://www.kplor.com)"
    },
    {
      "id": "n6jtcgl",
      "body": "You shouldn't get any grade below a C to maintain your gpa above 7"
    }
  ]
}