{
  "id": "1me4scp",
  "title": "[Question]regarding PESU KCET registration & counselling process",
  "content": "So I had initially registered on the PESU website, and got a confirmation mail that my registration was successful. Recently, I received my PESU KCET rank card, and then got another mail from PESU saying that there won’t be any online counselling. Instead, I have to attend offline counselling on a specific date.\n\nI called them to clarify a few things:\n\nI asked if this is for a management seat, and they told me the fees are the same as CET and it’s not a management quota seat.\n\nI also asked why they haven’t mentioned the branch allotment in the mail, and they said I’ll get to know during counselling.\n\n\nBut here's my confusion, They mentioned there’s no online counselling, but in the KEA option entry, PESU RR campus is still listed. So is this offline counselling only for those of us who registered early on PESU’s portal?\nLike… is there a separate seat allocation process going on for us? Or is this something else entirely?\n\nIf anyone has been through this or has some clarity, please help 🙏",
  "metadata": {
    "root_comment_id": "n66k6m6",
    "post_id": "1me4scp",
    "author": "FearlessFan3895",
    "url": "https://www.reddit.com/r/PESU/comments/1me4scp/questionregarding_pesu_kcet_registration/",
    "permalink": "https://reddit.com/r/PESU/comments/1me4scp/questionregarding_pesu_kcet_registration/",
    "score": 2,
    "upvote_ratio": 0.6000000238418579,
    "created_utc": 1753976068,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "n66k6m6",
      "body": "Hi u/FearlessFan3895, your post was temporarily held for moderator review because it mentions topics related to admissions, which automatically flags it for review. \n\nPosts involving admissions are treated with particular care on this subreddit due to the high potential for misinformation during high-stress times of counseling, seat allotment and critical decision-making periods.\n\nUnfortunately, we've seen how easily inaccurate or speculative advice spreads in such environments. Users frequently make major decisions about their future based on what they read online, often from fellow aspirants who may not have access to accurate information. This leads to confusion, false expectations, and in many cases, regret. Since this is the first year PES is using JEE and CET for admissions, the risk of misinformation is even greater and there simply isn't enough reliable historical data for anyone to make trustworthy predictions or statements.\n\nFor these reasons, all posts that fall under the category of admissions must go through moderator review and fact-checking before they are visible to the community. This is not meant to restrict discussion but to ensure that the advice shared here is grounded in verified knowledge and does not unintentionally mislead other students. Posts that speculate on admission procedures, branch allocation, share personal rank-based predictions, or solicit counseling advice from the crowd will generally not be approved, unless they clearly offer helpful, factual insights without creating confusion.\n\nIf you're looking for real data, refer to this post: [Which branch can I get? (PESSAT 2022 cutoffs)](https://www.reddit.com/r/PESU/comments/1ct5ujc/which_branch_can_i_get_at_no_dont_make_such_posts/)\n\nWe appreciate your understanding and cooperation. These policies are designed to protect not just you, but the entire community, from the harm that misinformation can cause during such a critical time. Please respect the rules and seek guidance from trusted sources. Attempts to bypass this filter may result in a 30-day ban or longer for repeat offenders.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PESU) if you have any questions or concerns.*"
    },
    {
      "id": "n66tovn",
      "body": "Kcet counselling is not related to pesu kcet...you have to do choice filling for kea counselling and the fees through pesu kcet is 5 LPA and through kea kcet counselling is 1.12 LPA\n└── When I called them to ask about the fees specifically..and they said it's similar to that off kea kcet\n    └── Check their website buddy ig they got confused by kea kcet counselling\n        └── Yeaaa alright..thank you soo muchh :)"
    },
    {
      "id": "n67eh3m",
      "body": "KEA KCET and PESU KCET both are different.  \nPESU KCET is organized by PES and i think they allocate around 10% seats for this and fees is 5LPA  \nKEA KCET is organized by KEA(govt) and has 40% seat allocation and fees will be around 1.2LPA\n└── But they did say that fees are similar to that of KEA kcet..\n    └── It's not, pes kcet is 5 lpa, not the govt one\n        └── Yea alright got it\nThank you"
    }
  ]
}