{
  "id": "1meqs5p",
  "title": "[Question]Need clarification about the 2 pes campuses..",
  "content": "Got alloted pes rr ece..want to know which campus is better whether rr ece or ec cse...any seniors can guide through...",
  "metadata": {
    "root_comment_id": "n6bc69s",
    "post_id": "1meqs5p",
    "author": "Ancient-Story-2548",
    "url": "https://www.reddit.com/r/PESU/comments/1meqs5p/questionneed_clarification_about_the_2_pes/",
    "permalink": "https://reddit.com/r/PESU/comments/1meqs5p/questionneed_clarification_about_the_2_pes/",
    "score": 5,
    "upvote_ratio": 0.7799999713897705,
    "created_utc": 1754036166,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "n6bcwyo",
      "body": "They had said both campuses cse students attend the placements combined, so ec cse should be better\n└── Thanx for the advice u r from rr or ece?\n    └── RR\n        └── Y"
    },
    {
      "id": "n6bdmle",
      "body": "il be joining this year. according to me, the choice lies on the interest, whether you prefer ece or cse, if cse, then ec cse, if ece then rr ece.\n├── Ah haan...I c..both campuses r equal ryt tho placements wise?\n│   └── Yes it's centralised\n│       └── Bro I don't know u the kcet cutoff for ec campus is tht low? I mean much rank\n│           └── Man dont go by that, people still think one campus is better than the other, in reality placements and all are pooled, so doesnt really matter, and try to prefer cse if your interested in it.\n│               └── Ok bro thnx\n└── Good to see juniors with common sense\n    └── Thanks, now pls give me tips 😂"
    },
    {
      "id": "n6bdnaa",
      "body": "RR. The building is very beautiful.\n└── Placements wise which one?\n    └── Afaik both placements are combined so it won't matter much."
    },
    {
      "id": "n6bfbbb",
      "body": "Ohhh I c thanks broo"
    },
    {
      "id": "n6bftqn",
      "body": "Based on how you phrased your question, I'm assuming you don't have a particular interest in either branch. RR campus has better infra than EC campus. But the branch is a deal breaker, take CSE at EC campus over ECE in RR if placements are what you care about. ECE placements are not that great in PES. Placements are anyways pooled, so campus doesn't matter for it."
    },
    {
      "id": "n6bntad",
      "body": "Ece placements aren't good at all, pick based on ur interest, not the campus. Every question paper we right is ditto the same across all the campuses so there's literally no difference.\n└── Thnxx for the advice"
    }
  ]
}