{
  "id": "1mffs36",
  "title": "[Question]Any senior can explain like why the cutoff will will go high in 2nd round of kcet counselling or any other one like this time all people participated and cutoffs are very low I'm hoping it will not go high if it's not true can anyone share their knowledge",
  "content": "Any comments would be appreciated \n\nAnd mods please stop your vengeance and at least don't remove this post",
  "metadata": {
    "root_comment_id": "n6grlbe",
    "post_id": "1mffs36",
    "author": "CeleryImmediate9415",
    "url": "https://www.reddit.com/r/PESU/comments/1mffs36/questionany_senior_can_explain_like_why_the/",
    "permalink": "https://reddit.com/r/PESU/comments/1mffs36/questionany_senior_can_explain_like_why_the/",
    "score": 6,
    "upvote_ratio": 0.800000011920929,
    "created_utc": 1754103369,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "n6gu9at",
      "body": "There is a vast difference in this year's cutoff compared to last year, it has increased significantly."
    },
    {
      "id": "n6gy0wa",
      "body": "Context?\n└── Like how there will be the rank different in kcet counselling from round 1 to round 2 regarding this year\nWhy this happens will it happen every year or not\n    └── Usually pesu rr cs closes at 2k and aiml at 3k in 2nd extended for GM"
    },
    {
      "id": "n6hdalr",
      "body": "This is totally based on what I had heard when I was going through councelling. Imagine the cutoff is 1000 in first round, and in the second round the cutoff is 2000. Usually the college releases seats round by round let's say for convenience 10 seats are released in each round, then that means the cutoff rank is the highest rank that got a seat in that round. If the 9 people who applied had the ranks 1100, 1200.... 1900 then there is a seat left. If 20k rank guy applies and gets allocated, then that means nobody between 1900 and 20k got the tenth seat. The cutoff for the second round will be 20k because they are the ones who got the last seat. That doesn't mean everybody within 20k would've gotten the seat. If a 15k guy had gotten the last seat, a 16k guy wouldn't have gotten it because now the cutoff would've been 15k. Now these are released for each reservation, each round. One of my friends had gotten a seat in a college and the cutoff for that reservation was his rank from the first round to the 3rd, because nobody else from that category had applied and gotten the seat. That means that from the first round to the last round the seats released for that category in each round weren't filled up and were empty. As far as I know those empty seats aren't reallocated to the general category in the Mop-Up round, which kind of seems unfair. But hey, what can you do🤷"
    }
  ]
}