{
  "id": "1mi6zrc",
  "title": "[Admission] doubt regarding pesu refund",
  "content": "For example I get aiml in rr campus in pesu kcet counselling i.e on 10 th aug and get pesu ecity ece in kcet round 2 so will they refund my money \nI really need some advice on this pls cause 5lpa is huge for someone like me , help me out so i end up with the right choice \nThank you!",
  "metadata": {
    "root_comment_id": "n71chpw",
    "post_id": "1mi6zrc",
    "author": "Intrepid_Repair_8579",
    "url": "https://www.reddit.com/r/PESU/comments/1mi6zrc/admission_doubt_regarding_pesu_refund/",
    "permalink": "https://reddit.com/r/PESU/comments/1mi6zrc/admission_doubt_regarding_pesu_refund/",
    "score": 1,
    "upvote_ratio": 0.6700000166893005,
    "created_utc": 1754394519,
    "flair": "Admissions",
    "nsfw": false
  },
  "comments": [
    {
      "id": "n71chpw",
      "body": "Hi u/Intrepid_Repair_8579, your post was temporarily held for moderator review because it mentions topics related to admissions, which automatically flags it for review. \n\nPosts involving admissions are treated with particular care on this subreddit due to the high potential for misinformation during high-stress times of counseling, seat allotment and critical decision-making periods.\n\nUnfortunately, we've seen how easily inaccurate or speculative advice spreads in such environments. Users frequently make major decisions about their future based on what they read online, often from fellow aspirants who may not have access to accurate information. This leads to confusion, false expectations, and in many cases, regret. Since this is the first year PES is using JEE and CET for admissions, the risk of misinformation is even greater and there simply isn't enough reliable historical data for anyone to make trustworthy predictions or statements.\n\nFor these reasons, all posts that fall under the category of admissions must go through moderator review and fact-checking before they are visible to the community. This is not meant to restrict discussion but to ensure that the advice shared here is grounded in verified knowledge and does not unintentionally mislead other students. Posts that speculate on admission procedures, branch allocation, share personal rank-based predictions, or solicit counseling advice from the crowd will generally not be approved, unless they clearly offer helpful, factual insights without creating confusion.\n\nIf you're looking for real data, refer to this post: [Which branch can I get? (PESSAT 2022 cutoffs)](https://www.reddit.com/r/PESU/comments/1ct5ujc/which_branch_can_i_get_at_no_dont_make_such_posts/)\n\nWe appreciate your understanding and cooperation. These policies are designed to protect not just you, but the entire community, from the harm that misinformation can cause during such a critical time. Please respect the rules and seek guidance from trusted sources. Attempts to bypass this filter may result in a 30-day ban or longer for repeat offenders.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PESU) if you have any questions or concerns.*"
    },
    {
      "id": "n71iksd",
      "body": "AFAIK if you change your type of seat they only refund excess amount or ask for the makeup amount. You dont have to pay again just have need all your documents.\n└── So I am allowed to change like that?\n    └── Yup also if you dont like your branch again later you can change in 2nd year.\n        └── I mean from different campus of pesu to different course is it possible ? Initially through pesu counsel and then through kea if I get through\n            └── Ya as long as its pes university and not pes college of engineering there are no issues with all this stuff. Idk if you have to pay to kea or pes for that seat but if its kea then theyll refund 5L and u need to pay the new fees probably (im not through kcet). But dont worry pes always gives back due money of admission pretty fast. I got mine back within a few weeks I think.\n                └── Thanks"
    },
    {
      "id": "n71ofpz",
      "body": "You can only get a refund if it's for the same campus and for same specialization\n└── This was my doubt loll cause this year idk how it works"
    }
  ]
}