{
  "id": "1mkx6cm",
  "title": "[Admission] KCET Rank Card of KEA for pesu kcet merit counselling [URGENT]",
  "content": "So, im in a dilemma right now, pes says they want kea rank card as : \n\nYour KCET Rank Card (taken from the Karnataka Government KEA portal) which should clearly show your Application Number, CET Number, KCET Engineering Rank and the KCET marks in Physics, Chemistry and Math - **This is mandatory**. This will be validated before you are allowed for the seat selection process\n\n  \nproblem with kea's result sheet on their website is that it doesnt show CET Number (different from application number)\n\nverification slip has everything except kcet marks (which is more important imho)\n\nso im confused what document to take\n\nplease advice\n\nthank you",
  "metadata": {
    "root_comment_id": "n7lyjy8",
    "post_id": "1mkx6cm",
    "author": "agentdb69",
    "url": "https://www.reddit.com/r/PESU/comments/1mkx6cm/admission_kcet_rank_card_of_kea_for_pesu_kcet/",
    "permalink": "https://reddit.com/r/PESU/comments/1mkx6cm/admission_kcet_rank_card_of_kea_for_pesu_kcet/",
    "score": 3,
    "upvote_ratio": 0.7099999785423279,
    "created_utc": 1754664393,
    "flair": "Admissions",
    "nsfw": false
  },
  "comments": [
    {
      "id": "n7lyjy8",
      "body": "Hi u/agentdb69, your post was temporarily held for moderator review because it mentions topics related to admissions, which automatically flags it for review. \n\nPosts involving admissions are treated with particular care on this subreddit due to the high potential for misinformation during high-stress times of counseling, seat allotment and critical decision-making periods.\n\nUnfortunately, we've seen how easily inaccurate or speculative advice spreads in such environments. Users frequently make major decisions about their future based on what they read online, often from fellow aspirants who may not have access to accurate information. This leads to confusion, false expectations, and in many cases, regret. Since this is the first year PES is using JEE and CET for admissions, the risk of misinformation is even greater and there simply isn't enough reliable historical data for anyone to make trustworthy predictions or statements.\n\nFor these reasons, all posts that fall under the category of admissions must go through moderator review and fact-checking before they are visible to the community. This is not meant to restrict discussion but to ensure that the advice shared here is grounded in verified knowledge and does not unintentionally mislead other students. Posts that speculate on admission procedures, branch allocation, share personal rank-based predictions, or solicit counseling advice from the crowd will generally not be approved, unless they clearly offer helpful, factual insights without creating confusion.\n\nIf you're looking for real data, refer to this post: [Which branch can I get? (PESSAT 2022 cutoffs)](https://www.reddit.com/r/PESU/comments/1ct5ujc/which_branch_can_i_get_at_no_dont_make_such_posts/)\n\nWe appreciate your understanding and cooperation. These policies are designed to protect not just you, but the entire community, from the harm that misinformation can cause during such a critical time. Please respect the rules and seek guidance from trusted sources. Attempts to bypass this filter may result in a 30-day ban or longer for repeat offenders.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PESU) if you have any questions or concerns.*"
    },
    {
      "id": "n7r9cee",
      "body": "I just took a printout of my KCET verification slip\nIt contains all the details and just for backup i took a printout of the result you’re talking about with only application number"
    }
  ]
}