{
  "id": "1mmjkyu",
  "title": "[Admission] First time living in a hostel...",
  "content": "Do you guys take food from the hostel during breakfast for lunch at the college or buy at canteen??? ",
  "metadata": {
    "root_comment_id": "n7xyds7",
    "post_id": "1mmjkyu",
    "author": "CardiologistCheap588",
    "url": "https://www.reddit.com/r/PESU/comments/1mmjkyu/admission_first_time_living_in_a_hostel/",
    "permalink": "https://reddit.com/r/PESU/comments/1mmjkyu/admission_first_time_living_in_a_hostel/",
    "score": 10,
    "upvote_ratio": 0.9200000166893005,
    "created_utc": 1754835060,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "n7xyds7",
      "body": "Hi u/CardiologistCheap588, your post was temporarily held for moderator review because it mentions topics related to admissions, which automatically flags it for review. \n\nPosts involving admissions are treated with particular care on this subreddit due to the high potential for misinformation during high-stress times of counseling, seat allotment and critical decision-making periods.\n\nUnfortunately, we've seen how easily inaccurate or speculative advice spreads in such environments. Users frequently make major decisions about their future based on what they read online, often from fellow aspirants who may not have access to accurate information. This leads to confusion, false expectations, and in many cases, regret. Since this is the first year PES is using JEE and CET for admissions, the risk of misinformation is even greater and there simply isn't enough reliable historical data for anyone to make trustworthy predictions or statements.\n\nFor these reasons, all posts that fall under the category of admissions must go through moderator review and fact-checking before they are visible to the community. This is not meant to restrict discussion but to ensure that the advice shared here is grounded in verified knowledge and does not unintentionally mislead other students. Posts that speculate on admission procedures, branch allocation, share personal rank-based predictions, or solicit counseling advice from the crowd will generally not be approved, unless they clearly offer helpful, factual insights without creating confusion.\n\nIf you're looking for real data, refer to this post: [Which branch can I get? (PESSAT 2022 cutoffs)](https://www.reddit.com/r/PESU/comments/1ct5ujc/which_branch_can_i_get_at_no_dont_make_such_posts/)\n\nWe appreciate your understanding and cooperation. These policies are designed to protect not just you, but the entire community, from the harm that misinformation can cause during such a critical time. Please respect the rules and seek guidance from trusted sources. Attempts to bypass this filter may result in a 30-day ban or longer for repeat offenders.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PESU) if you have any questions or concerns.*"
    },
    {
      "id": "n7xynew",
      "body": "You need to plan your breakfast time well, most of the time, people just skip or eat early\n└── No I mean for lunch at the college...do you guys take tiffin from the hostel itself or buy at a canteen??\n    ├── Your wish bro, you can do what you want 😂\n    └── ec?"
    },
    {
      "id": "n7xzl65",
      "body": "😂"
    },
    {
      "id": "n7y27a2",
      "body": "Lunch is provided on campus in the mess. So you don't have to pack it or anything. Maybe just see what is being served and if you don't like it there are a lot of options to buy from too.\n└── For free??\n    └── Mess is part of hostel fees. Obviously buying food outside the mess isn’t free\n        └── So the mess at the college is free for hostlers... I just wanted to know that...\n            └── Yes ng how did they not explain this to you during orientation\n                └── Lol cuz orientation hasn't happened yet it's on the weekend before college starts which is kind of late for ppl who need to settle in and stuff"
    },
    {
      "id": "n7y4ute",
      "body": "What's the scenario like for day scholars. Can I chose to eat only lunch at mess if I pay, for instance??\n└── Yes, as far as I know you can pay and eat in both food court and hostel mess, not sure about namdhari"
    },
    {
      "id": "n7yfmb3",
      "body": "Ok i am gonna give you a brief idea , usually there is 45min of time for lunch and during that time , u can go to the mess, grab a plate and eat food , simple"
    },
    {
      "id": "n7ykwnu",
      "body": "bro, u are literally paying for the mess... so eat whatever your mess gives at whichever part of the day\n└── but like isnt our hostel 6km far\n    └── Brother the hostel mess is on campus. The same campus where your classes are being held. Do you follow?"
    }
  ]
}