{
  "id": "1mrvt2r",
  "title": "[Discussion]These 3rd year OA internship tests are killing me.",
  "content": "I just rage quited one of the OA tests. Can someone please tell me where I should study DSA from, what kind of questions should I solve, what should I exactly do to actually do well in these tests and actually get even 'decent' results. Please give me guidance. These tests are destroying me rn and I am very worried about my future",
  "metadata": {
    "root_comment_id": "n90b9fh",
    "post_id": "1mrvt2r",
    "author": "Fantastic_Jelly_1582",
    "url": "https://www.reddit.com/r/PESU/comments/1mrvt2r/discussionthese_3rd_year_oa_internship_tests_are/",
    "permalink": "https://reddit.com/r/PESU/comments/1mrvt2r/discussionthese_3rd_year_oa_internship_tests_are/",
    "score": 33,
    "upvote_ratio": 0.9800000190734863,
    "created_utc": 1755352175,
    "flair": "Study Help :table:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "n90h3x3",
      "body": "Are you talking about the Zscalar one , i also rage quit it 😭😭\n└── yes lmao"
    },
    {
      "id": "n91bv94",
      "body": "Grind Striver's A to Z sheet properly and contests everyday. It would be the same during placements, crazy hard OAs..\n└── Contests from codeforces? Also how many people got an internship (in campus) in third year from your batch?\n    ├── On campus, it would be around 80-90 out of 1600 CSE+AIML students\n    │   ├── Damn what? So less? How do the others get an internship then? Referrals or something?\n    │   │   └── Yeah, the total number of students who did an internship this summer would be around 300-400 tho. Mostly through connections and referral.\n    │   └── The total number rr+ec would go upto 100-120 ppl through on campus internships, and others referral or off campus\n    ├── Tbh you don't need to grind dsa that much.\n\nOne year of thorough dsa should be enough.\n\nYou also need to grind concepts that may be asked in interviews.\n    │   └── Yeah true one of my friend got placed in Net Core recently. We both are from ECE and she has done minors in CSE. She said the interviewer also helps sometimes. But what about us core ECE man.. 😭😭\n    └── striver's dsa sheet is best for interviews, for OAs, start with leetcode and codeforces contests. Codeforces will have the same format of questions that are being asked in OAs nowadays"
    }
  ]
}