{
  "id": "1mxgaa1",
  "title": "[Question] WHAT TO DO ? SENIORS ASSEMBLE !!",
  "content": "\n\nSince the KEA messed up the 3rd round, my plans are now shattered.\n My only options now are \n\nPES ECITY CSE, \nBMS, AIML, \nBMS, iot cyber \nBms CS DS. (I might not get it, read the full post.)\n\n Should I take BMS AIML? I think it's a very low branch; it's very different and it's BMS, so should I avoid it?\n\nMAIN QUESTION\n\n Since CSDS seats have increased by 60, and last year's cutoff for my category was 4713, will I get it in the 2nd round? My rank is 5.1k. Is a 400-rank jump possible, considering not many people are considering bms nowadays?\n\n If so, should I consider it above PES EC CSE? Is it better or worse? less\n\n\nConsider BMS because the cllg life is better there a lot of events are happening and yeah it's not good at placements compared to pes but not bad either and will it be a big mistake is I take BMS ? Since I am comparing it to pes ec campus so yeah please seniors guide me🥲 ",
  "metadata": {
    "root_comment_id": "na4ncwp",
    "post_id": "1mxgaa1",
    "author": "Correct-Engineer5178",
    "url": "https://i.redd.it/b5vpsv6gjmkf1.png",
    "permalink": "https://reddit.com/r/PESU/comments/1mxgaa1/question_what_to_do_seniors_assemble/",
    "score": 0,
    "upvote_ratio": 0.25999999046325684,
    "created_utc": 1755891676,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "na4ncwp",
      "body": "Hi u/Correct-Engineer5178, your post was temporarily held for moderator review because it mentions topics related to admissions, which automatically flags it for review. \n\nPosts involving admissions are treated with particular care on this subreddit due to the high potential for misinformation during high-stress times of counseling, seat allotment and critical decision-making periods.\n\nUnfortunately, we've seen how easily inaccurate or speculative advice spreads in such environments. Users frequently make major decisions about their future based on what they read online, often from fellow aspirants who may not have access to accurate information. This leads to confusion, false expectations, and in many cases, regret. Since this is the first year PES is using JEE and CET for admissions, the risk of misinformation is even greater and there simply isn't enough reliable historical data for anyone to make trustworthy predictions or statements.\n\nFor these reasons, all posts that fall under the category of admissions must go through moderator review and fact-checking before they are visible to the community. This is not meant to restrict discussion but to ensure that the advice shared here is grounded in verified knowledge and does not unintentionally mislead other students. Posts that speculate on admission procedures, branch allocation, share personal rank-based predictions, or solicit counseling advice from the crowd will generally not be approved, unless they clearly offer helpful, factual insights without creating confusion.\n\nIf you're looking for real data, refer to this post: [Which branch can I get? (PESSAT 2022 cutoffs)](https://www.reddit.com/r/PESU/comments/1ct5ujc/which_branch_can_i_get_at_no_dont_make_such_posts/)\n\nWe appreciate your understanding and cooperation. These policies are designed to protect not just you, but the entire community, from the harm that misinformation can cause during such a critical time. Please respect the rules and seek guidance from trusted sources. Attempts to bypass this filter may result in a 30-day ban or longer for repeat offenders.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PESU) if you have any questions or concerns.*"
    },
    {
      "id": "na8kaji",
      "body": "Take my fucking downvote"
    },
    {
      "id": "na8vifk",
      "body": "pes ec cse seems a good option and i can't really say much about bms bc i don't study there"
    },
    {
      "id": "nacuqml",
      "body": "if u wanna chill 4 yrs in a subpar campus and end up with 8lpa, bms is good\nIf you wanna grind 4 yrs in a decent campus and end up with 10lpa+, pes is good"
    },
    {
      "id": "najj2gr",
      "body": "compromised college with compromised branch. IIT Bangalore."
    }
  ]
}