{
  "id": "1my8r9p",
  "title": "[Admission] would appreciate some help!",
  "content": "Actually I am a dropper , there is a long story but in short I will take pesu cse next yr if I don't get rv cs. Pesu cs through jee. Basically I have fucked up my 75% criteria by a bit and I don't feel giving improvement is worth it cuz I ain't no prodigy I am a mediocre student I know I am not gonna get anything above 97%ile for which pesu is best imo and if I do well I have nsut dtu IIITB so imo giving improvement wasnt too ideal. Since I have very limited options from last 3-4 days I have been very worried about the counselling process thinking in mind that I'll do well in jee but fuck up the counselling process.\n\nI tried searching for any post related to pesu jee counselling process but couldn't find any detailed post listing the procress so I just wanted to know the counselling process for btech admissions via jee route.\n\nThanks in advance 🙏❤️",
  "metadata": {
    "root_comment_id": "naaahi6",
    "post_id": "1my8r9p",
    "author": "Trick_Store2016",
    "url": "https://www.reddit.com/r/PESU/comments/1my8r9p/admission_would_appreciate_some_help/",
    "permalink": "https://reddit.com/r/PESU/comments/1my8r9p/admission_would_appreciate_some_help/",
    "score": 3,
    "upvote_ratio": 0.6700000166893005,
    "created_utc": 1755972923,
    "flair": "Admissions",
    "nsfw": false
  },
  "comments": [
    {
      "id": "naaahi6",
      "body": "Hi u/Trick_Store2016, your post was temporarily held for moderator review because it mentions topics related to admissions, which automatically flags it for review. \n\nPosts involving admissions are treated with particular care on this subreddit due to the high potential for misinformation during high-stress times of counseling, seat allotment and critical decision-making periods.\n\nUnfortunately, we've seen how easily inaccurate or speculative advice spreads in such environments. Users frequently make major decisions about their future based on what they read online, often from fellow aspirants who may not have access to accurate information. This leads to confusion, false expectations, and in many cases, regret. Since this is the first year PES is using JEE and CET for admissions, the risk of misinformation is even greater and there simply isn't enough reliable historical data for anyone to make trustworthy predictions or statements.\n\nFor these reasons, all posts that fall under the category of admissions must go through moderator review and fact-checking before they are visible to the community. This is not meant to restrict discussion but to ensure that the advice shared here is grounded in verified knowledge and does not unintentionally mislead other students. Posts that speculate on admission procedures, branch allocation, share personal rank-based predictions, or solicit counseling advice from the crowd will generally not be approved, unless they clearly offer helpful, factual insights without creating confusion.\n\nIf you're looking for real data, refer to this post: [Which branch can I get? (PESSAT 2022 cutoffs)](https://www.reddit.com/r/PESU/comments/1ct5ujc/which_branch_can_i_get_at_no_dont_make_such_posts/)\n\nWe appreciate your understanding and cooperation. These policies are designed to protect not just you, but the entire community, from the harm that misinformation can cause during such a critical time. Please respect the rules and seek guidance from trusted sources. Attempts to bypass this filter may result in a 30-day ban or longer for repeat offenders.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PESU) if you have any questions or concerns.*"
    },
    {
      "id": "naaar1p",
      "body": "Mods please approve this post else I will have to live worried like this untill I am able to find someone whom I can ask about the admission process 🙏\n└── There are posts about pessat counselling but now it's abolished and there isn't detailed post for jee counselling."
    },
    {
      "id": "naeidjn",
      "body": " i think they will release a rank list based off your jee mains crl, after which you choose your preferred branch/campus through the jee main admission preferrence list & then they will conduct counselling (in person). there might be some more steps to it, that i'm not sure of, but this is the gist of it.\n├── When does the process start typically?\n│   └── around may june ig? not sure really but it starts after advance is over ig\n└── Is whole counselling process which is done offline completed in a day?\n    └── yes. you select ur branch n campus based on availability and pay as welll. there will be 2 rounds of counselling usually but i'm not sure if the ranks drop by a lot in the 2nd round\n        └── Oh"
    },
    {
      "id": "nai0gqv",
      "body": "Counselling starts around June, there were 2 rounds this year. Each round happens in 1 day, 1st happened in June, 2nd took place in July. You get called based on your pesu-jee rank, like for us it was rank 1-1500 at 8am, 1500-3000 10am, 3000-5000 2pm type thing, and the offline counselling finishes in a day\n└── If I am outside Karnataka student then can I select offline counselling or do I have to compulsarily go in online counseling if there is any? And when does the application process start typically? Is the counselling for both the campuses done at the rr campus?\n    └── Yes, I believe you can select offline counselling. Not sure, but I think that is default; you have to choose if going online.\nApplication for counselling? May end, I think.\nYes, counselling for both campuses is done at RR.\n        ├── Thanks bhai can I dm you?\n        ├── Thanks bhai\n        └── Btw if I had to compulsarily opt for online counseling if they don't give offline counselling for non karnataka students, is online counseling if pes smooth?"
    }
  ]
}