{
  "id": "1mylygh",
  "title": "[Discussion] How difficult or easy to get 8.5 CGPA ?",
  "content": "",
  "metadata": {
    "root_comment_id": "nacztl4",
    "post_id": "1mylygh",
    "author": "Potential_Result_825",
    "url": "http://www.Pes.edu",
    "permalink": "https://reddit.com/r/PESU/comments/1mylygh/discussion_how_difficult_or_easy_to_get_85_cgpa/",
    "score": 10,
    "upvote_ratio": 0.8600000143051147,
    "created_utc": 1756008781,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "nad4a5a",
      "body": "For first year\nMath u have to practise,use pesu mcqs and do assignments(I only did qb, that worked better for me). \nrest all learn/mug from slides."
    },
    {
      "id": "nadg13c",
      "body": "Quite easy to maintain 8.5+. Just a bit of studying here and there"
    },
    {
      "id": "nadm1rn",
      "body": "Pretty easy as long as you atleast try to care about studying. From people ik, people who dont focus in class and dont stdy well before exam get like 5-6. Those who atleast focus in class or exam get 7-8  and those with mid level efforts in both get cnr(8.5+) high level effort mrd 9+ .\n\nAgain this is just from general consensus. Marks depends on your capabilities of those subjects. Me and my friends have consistently maintained well above that so i might be biased."
    },
    {
      "id": "nadne24",
      "body": "It is easy enough if you focus in class honestly (for cs atleast)( I got 7.5 in first year and bumped it to 8.5 by final year)"
    },
    {
      "id": "nadpawr",
      "body": "People may disagree with me, but imo 8.5+ isn't that hard.\n\nAs long as you know what is going on in class, or if you study a little bit weekly it is possible.\n\nI mean played games and didn't study until the week before and I still managed to keep it high.\n\nAnd even if it isn't 8.5+ it doesn't matter for placements as long as you have 8+ cgpa.\n\nAt least that was how it was for us."
    },
    {
      "id": "naedywt",
      "body": "It's pretty easy to get 8.5 if you understand the concepts. I usually only studied like the day before the exams"
    },
    {
      "id": "nag79de",
      "body": "Long answers in ESA, than specific point wise small answers was my secret trick to increase my GPA."
    },
    {
      "id": "naji1ox",
      "body": "I'll let you know when I get there."
    }
  ]
}