{
  "id": "1myz7jp",
  "title": "[Rant]EC Campus hostel's messed up plumbing.",
  "content": "I don't know what the issue is with the EC Campus hostel's plumbing system. The entire bloody hostel is crap from the top to the bottom. The hostel fees is 1.4 Lakhs per annum and these guys can't provide a room with even the basic of necessities like a properly flushing toilet or a working sink. It's been 3 weeks since college started, and we've had this problem with the sink since. When the sink is used the water doesn't even go in and just stays there. It's not even like it clears up eventually. It's been 3 days since the plumber guys just came in and \"resolved the issue\" and the water that they filled on Thursdays is still in the sink. It stinks horribly. And on top of that there's no mirror in the bathroom and even a tubelight isn't working. I've lodged a complaint 4-5 times already and the warden just says that it's gonna happen on the weekend/tomorrow, but it's been 3 weekends and there's no improvement of any type. \n\nA parent sends off their kid to a new city, paying a hefty amount for the hostel only for their ward to live in such disgusting environments is a matter of disgrace to the management and whoever is looking over the workings of the hostel. If there's any member of the management reading this, kindly try and resolve this issue. \nThe hostel had two months of sem break to fix all issues, but they still chose not to. This is totally unjustified and has no reasonable explanation. \n\nIf you guys are also facing such issues, let us all make a log of each of our issues by going around to every room in the hostel, signing it off and we can directly involved the senior management into this issue. ",
  "metadata": {
    "root_comment_id": "nafhzzf",
    "post_id": "1myz7jp",
    "author": "Ariiii_10",
    "url": "https://www.reddit.com/r/PESU/comments/1myz7jp/rantec_campus_hostels_messed_up_plumbing/",
    "permalink": "https://reddit.com/r/PESU/comments/1myz7jp/rantec_campus_hostels_messed_up_plumbing/",
    "score": 37,
    "upvote_ratio": 0.9599999785423279,
    "created_utc": 1756050753,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "naw2w0y",
      "body": "The hostel warden seems a little too chill about it. Unless something is affecting his room i dont think he cares. It only makes sense to raise a complain multiple times and take your room mates to talk to the warden."
    }
  ]
}