{
  "id": "1n2o3jg",
  "title": "[OffTopic] my last day on this Subreddit",
  "content": "I was a jee aspirant, always liked PES college I wrote kcet but couldn't get my favourite college ( pes) I had a lot of hopes that I'll get into this clg but ended up getting 6k rank pes ec is 2km from my home. Since 3 months I am seeing this subreddit and praying I'll get this clg.. but of no use, too much rank inflation, soo many droppers and what not... anyways always liked those huge buildings I could see while travelling around but nevertheless I feel like a looser.. I got pes EC campus cse through jee but can't afford the fees🥲 I have gone through almost all posts while dreaming of getting into pes but anyways it's my fate...\nAll the best to those who got this clg.... \n4yrs of hopes shattered\nI am a bit emotional coz all of those harwork went  in vain \nNevertheless, it's my last visit to this subreddit \nPeace out gng 🥀 \n",
  "metadata": {
    "root_comment_id": "nb7al80",
    "post_id": "1n2o3jg",
    "author": "Objective-Patient365",
    "url": "https://i.redd.it/mr4cjeltqtlf1.jpeg",
    "permalink": "https://reddit.com/r/PESU/comments/1n2o3jg/offtopic_my_last_day_on_this_subreddit/",
    "score": 50,
    "upvote_ratio": 0.9599999785423279,
    "created_utc": 1756414750,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "nb7al80",
      "body": "Hi u/Objective-Patient365, your post was temporarily held for moderator review because it mentions topics related to admissions, which automatically flags it for review. \n\nPosts involving admissions are treated with particular care on this subreddit due to the high potential for misinformation during high-stress times of counseling, seat allotment and critical decision-making periods.\n\nUnfortunately, we've seen how easily inaccurate or speculative advice spreads in such environments. Users frequently make major decisions about their future based on what they read online, often from fellow aspirants who may not have access to accurate information. This leads to confusion, false expectations, and in many cases, regret. Since this is the first year PES is using JEE and CET for admissions, the risk of misinformation is even greater and there simply isn't enough reliable historical data for anyone to make trustworthy predictions or statements.\n\nFor these reasons, all posts that fall under the category of admissions must go through moderator review and fact-checking before they are visible to the community. This is not meant to restrict discussion but to ensure that the advice shared here is grounded in verified knowledge and does not unintentionally mislead other students. Posts that speculate on admission procedures, branch allocation, share personal rank-based predictions, or solicit counseling advice from the crowd will generally not be approved, unless they clearly offer helpful, factual insights without creating confusion.\n\nIf you're looking for real data, refer to this post: [Which branch can I get? (PESSAT 2022 cutoffs)](https://www.reddit.com/r/PESU/comments/1ct5ujc/which_branch_can_i_get_at_no_dont_make_such_posts/)\n\nWe appreciate your understanding and cooperation. These policies are designed to protect not just you, but the entire community, from the harm that misinformation can cause during such a critical time. Please respect the rules and seek guidance from trusted sources. Attempts to bypass this filter may result in a 30-day ban or longer for repeat offenders.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PESU) if you have any questions or concerns.*"
    },
    {
      "id": "nb8flbe",
      "body": "Damn"
    },
    {
      "id": "nb8hvud",
      "body": "Which college are you going to ?"
    },
    {
      "id": "nb8l0hb",
      "body": ":("
    },
    {
      "id": "nb8mjfr",
      "body": "A form of higher power saved you from pes. Rejoice."
    },
    {
      "id": "nb8pi91",
      "body": "People drowning while others die of thirst"
    },
    {
      "id": "nb9lo1v",
      "body": "good luck bro, I hope u succeed in any field u go, take this as a new start and start grinding in coding, don't lose hope\n\n![gif](giphy|l3vR5kvzODSuw3bnq)"
    },
    {
      "id": "nb9pkjg",
      "body": "Damn someone is actually dreaming to get into IIT BANGALORE 😃😃🪄🪄"
    },
    {
      "id": "nbmdcr5",
      "body": "God does have favorites, OP is one of them"
    }
  ]
}