{
  "id": "1n3aw7f",
  "title": "[Admission] Extra fee for exam",
  "content": "Iam taking admission in PESU in EEE branch.Plz can u tell me about the extra fees that PESU takes during admission for exam and is it only for exam or other stuff is included?",
  "metadata": {
    "root_comment_id": "nbc1x5n",
    "post_id": "1n3aw7f",
    "author": "MohammedAbrar2035",
    "url": "https://www.reddit.com/r/PESU/comments/1n3aw7f/admission_extra_fee_for_exam/",
    "permalink": "https://reddit.com/r/PESU/comments/1n3aw7f/admission_extra_fee_for_exam/",
    "score": 3,
    "upvote_ratio": 1,
    "created_utc": 1756482163,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "nbc1x5n",
      "body": "Hi u/MohammedAbrar2035, your post was temporarily held for moderator review because it mentions topics related to admissions, which automatically flags it for review. \n\nPosts involving admissions are treated with particular care on this subreddit due to the high potential for misinformation during high-stress times of counseling, seat allotment and critical decision-making periods.\n\nUnfortunately, we've seen how easily inaccurate or speculative advice spreads in such environments. Users frequently make major decisions about their future based on what they read online, often from fellow aspirants who may not have access to accurate information. This leads to confusion, false expectations, and in many cases, regret. Since this is the first year PES is using JEE and CET for admissions, the risk of misinformation is even greater and there simply isn't enough reliable historical data for anyone to make trustworthy predictions or statements.\n\nFor these reasons, all posts that fall under the category of admissions must go through moderator review and fact-checking before they are visible to the community. This is not meant to restrict discussion but to ensure that the advice shared here is grounded in verified knowledge and does not unintentionally mislead other students. Posts that speculate on admission procedures, branch allocation, share personal rank-based predictions, or solicit counseling advice from the crowd will generally not be approved, unless they clearly offer helpful, factual insights without creating confusion.\n\nIf you're looking for real data, refer to this post: [Which branch can I get? (PESSAT 2022 cutoffs)](https://www.reddit.com/r/PESU/comments/1ct5ujc/which_branch_can_i_get_at_no_dont_make_such_posts/)\n\nWe appreciate your understanding and cooperation. These policies are designed to protect not just you, but the entire community, from the harm that misinformation can cause during such a critical time. Please respect the rules and seek guidance from trusted sources. Attempts to bypass this filter may result in a 30-day ban or longer for repeat offenders.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PESU) if you have any questions or concerns.*"
    },
    {
      "id": "nbfyrqt",
      "body": "U have to pay only exam fees that is ₹10k for us don't know is it increased for u or not and If u want scholarship u have to pay extra but it's optional.\n└── Thanks,but what kind of scholarship?\n    └── If you are in top 5% you get 25%fee each sem.\nIf you are in next top 20% then you get 20% fee.\nhttps://pes.edu/admissions/scholarships/\n        └── And what about MRD is it fully 50%\nAnd one more thing what should I do to be in top 5% means what is the criteria\n            └── See to get mrd they see top 5% by cgpa(aggregate )and cnt top 20% by sgpa(sem wise).\nAnd 50% means 25% + 25% i.e you get sem wise\nIf you are top in both sem u get 50 if only one sem only 25 like that\n                └── Thanks a lot."
    },
    {
      "id": "nbgbhdz",
      "body": "Hey buddy i’m also joining PESU cse branch (RR campus)\nI wanna ask if this university is good or not like i have heard its so so so many bad reviews about this uni. I’m scared now. Please help:)\n└── It have some negative and positive points,u you can ask senior s"
    }
  ]
}