{
  "id": "1n3z5s0",
  "title": "[Question]how can I score 9.5+ cgpa in 1st yr",
  "content": "Presently I'm in my first year.My classes are gonna start from Monday,can I get any suggestions from seniors to score well in isa's and esa's(like 9.5+cgpa)",
  "metadata": {
    "root_comment_id": "nbh2zwk",
    "post_id": "1n3z5s0",
    "author": "SadChannel9943",
    "url": "https://www.reddit.com/r/PESU/comments/1n3z5s0/questionhow_can_i_score_95_cgpa_in_1st_yr/",
    "permalink": "https://reddit.com/r/PESU/comments/1n3z5s0/questionhow_can_i_score_95_cgpa_in_1st_yr/",
    "score": 12,
    "upvote_ratio": 0.7699999809265137,
    "created_utc": 1756553001,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "nbh3x9b",
      "body": "Just Complete ur syllabus 1 week prior to exams"
    },
    {
      "id": "nbh8gji",
      "body": "Why do people keep asking these kind of questions when the obvious answer is to just study?"
    },
    {
      "id": "nbheiao",
      "body": "you don't need to stress tooooo much. Complete the syllabus early like others said. Solve a lot of problems. Previous years papers too if you get your hands on them.\n\nSource: 9.82 sem 1, 9.95 sem 2\n└── Where to get the previous year questions\n    └── opac library, pesu discord off the top of my head"
    },
    {
      "id": "nbhf6cp",
      "body": "I’m also joining the college from tuesday (cse re campus)\nI wanna ask if the college is good or not like i have heard so so so many negative reviews about the college which is scaring me af. Please help:/\n└── bro if ur anyway joining, what good will me telling you the truth actually be, will you drop out of clg if people on reddit say its bad?\n    └── N no that’s not the point i was saying, i’m asking are that reviews true as there’s no campus life, only studying and stuff, so that i’ll get mentally prepared (as i’m so much in sports).. i need help with this:)\n        └── ull have more than enough time in first 2 years so u dont need to worry abt it\n            └── Oh that’s great then \n \nThanks man i was so scared abt it"
    },
    {
      "id": "nbhg04o",
      "body": "Yeah you can"
    }
  ]
}