{
  "id": "1n657ik",
  "title": "[Admission] PESU RR Admission through KCET Round 2 completed. Summary as follows",
  "content": "* Reach their by 9:00 AM.\n\nhttps://preview.redd.it/7e1kl1976nmf1.jpg?width=2691&format=pjpg&auto=webp&s=8b90fafdb09f3e212806cc968666e571065c77a6\n\n* For step 1 just show printout of\n\nhttps://preview.redd.it/0hsfm41p6nmf1.png?width=337&format=png&auto=webp&s=f8076c20473a170ec75f4c162b37967760f88651\n\nFor step 2 show originals of 10th and 12th original marks cards. They will take your photo for issuing college admission order. Collect both student and college copy of admission order from them.\n\nStep 3 takes time. In the lab only student allowed. For creating PESU intranet ID following details needs to be filled :\n\nStudent identity ( name, contact details, place of birth, DOB,\n\ntransport, accommodation details, cast, language proficiency,\n\naddress details, full name details in AADHAR,\n\n10th mark sheet, 10th and 12th mark sheet details, school/ college details ,\n\nlast day in PU, PES joining date)\n\nparents details ( name, address, occupation salary etc)\n\nhttps://preview.redd.it/k6cu2j5f8nmf1.jpg?width=1819&format=pjpg&auto=webp&s=1caa015491843051ba52a2802983e0260041ca01\n\nIn step 4 they take 10th, 12th and TC originals and give an acknowledgement of it. They shall return those documents back in about a years time. You shall get details of your PRN ID ( unique student ID) which can be used to first time login and set up account into the intranet system.\n\nIn step 5 collect your welcome kit ( a college bag, water bottle, T-shirt) the quality of the stuff is ok.\n\nvisit F block where all first year classes are conducted to see the location, ask details if any.\n\n**Classes shall start on 8th September**. Any change will be informed through PESU system / application.\n\nhttps://preview.redd.it/wj9u2air9nmf1.jpg?width=2179&format=pjpg&auto=webp&s=27fb4e23a0f95467638d756cb41a378ee1daa1da\n\nhttps://preview.redd.it/hu19v0jw9nmf1.jpg?width=2486&format=pjpg&auto=webp&s=d02537a30ee57054960dbb2009ebcfca5450fbce\n\nhttps://preview.redd.it/dbod4ea4anmf1.jpg?width=2412&format=pjpg&auto=webp&s=4af9c8222f90485f77aa30dc1b0ddcba0aef2cd6\n\nhttps://preview.redd.it/476vk8r6anmf1.jpg?width=2120&format=pjpg&auto=webp&s=009d70f52bff3e0f3578c50b71fb8629da5c1f6d\n\n**No vacancy in campus boys hostel.**",
  "metadata": {
    "root_comment_id": "nbxj2g2",
    "post_id": "1n657ik",
    "author": "KhamuDear",
    "url": "https://www.reddit.com/r/PESU/comments/1n657ik/admission_pesu_rr_admission_through_kcet_round_2/",
    "permalink": "https://reddit.com/r/PESU/comments/1n657ik/admission_pesu_rr_admission_through_kcet_round_2/",
    "score": 6,
    "upvote_ratio": 1,
    "created_utc": 1756772427,
    "flair": "Admissions",
    "nsfw": false
  },
  "comments": [
    {
      "id": "nbxj2g2",
      "body": "Hi u/KhamuDear, your post was temporarily held for moderator review because it mentions topics related to admissions, which automatically flags it for review. \n\nPosts involving admissions are treated with particular care on this subreddit due to the high potential for misinformation during high-stress times of counseling, seat allotment and critical decision-making periods.\n\nUnfortunately, we've seen how easily inaccurate or speculative advice spreads in such environments. Users frequently make major decisions about their future based on what they read online, often from fellow aspirants who may not have access to accurate information. This leads to confusion, false expectations, and in many cases, regret. Since this is the first year PES is using JEE and CET for admissions, the risk of misinformation is even greater and there simply isn't enough reliable historical data for anyone to make trustworthy predictions or statements.\n\nFor these reasons, all posts that fall under the category of admissions must go through moderator review and fact-checking before they are visible to the community. This is not meant to restrict discussion but to ensure that the advice shared here is grounded in verified knowledge and does not unintentionally mislead other students. Posts that speculate on admission procedures, branch allocation, share personal rank-based predictions, or solicit counseling advice from the crowd will generally not be approved, unless they clearly offer helpful, factual insights without creating confusion.\n\nIf you're looking for real data, refer to this post: [Which branch can I get? (PESSAT 2022 cutoffs)](https://www.reddit.com/r/PESU/comments/1ct5ujc/which_branch_can_i_get_at_no_dont_make_such_posts/)\n\nWe appreciate your understanding and cooperation. These policies are designed to protect not just you, but the entire community, from the harm that misinformation can cause during such a critical time. Please respect the rules and seek guidance from trusted sources. Attempts to bypass this filter may result in a 30-day ban or longer for repeat offenders.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PESU) if you have any questions or concerns.*"
    }
  ]
}