{
  "id": "1n6mxfc",
  "title": "[Discussion] JEE & KCET Cutoff for batch 2025-2029",
  "content": "I have a cousin who would be writing JEE and CET the next year. So if anyone knows the cutoff for JEE & CET who got into PES for 2025, pls comment down.  \nProviding KCET cutoff would also be of help.",
  "metadata": {
    "root_comment_id": "nc14qei",
    "post_id": "1n6mxfc",
    "author": "Historical_Battle286",
    "url": "https://www.reddit.com/r/PESU/comments/1n6mxfc/discussion_jee_kcet_cutoff_for_batch_20252029/",
    "permalink": "https://reddit.com/r/PESU/comments/1n6mxfc/discussion_jee_kcet_cutoff_for_batch_20252029/",
    "score": 0,
    "upvote_ratio": 0.33000001311302185,
    "created_utc": 1756827660,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "nc14qei",
      "body": "Hi u/Historical_Battle286, your post was temporarily held for moderator review because it mentions topics related to admissions, which automatically flags it for review. \n\nPosts involving admissions are treated with particular care on this subreddit due to the high potential for misinformation during high-stress times of counseling, seat allotment and critical decision-making periods.\n\nUnfortunately, we've seen how easily inaccurate or speculative advice spreads in such environments. Users frequently make major decisions about their future based on what they read online, often from fellow aspirants who may not have access to accurate information. This leads to confusion, false expectations, and in many cases, regret. Since this is the first year PES is using JEE and CET for admissions, the risk of misinformation is even greater and there simply isn't enough reliable historical data for anyone to make trustworthy predictions or statements.\n\nFor these reasons, all posts that fall under the category of admissions must go through moderator review and fact-checking before they are visible to the community. This is not meant to restrict discussion but to ensure that the advice shared here is grounded in verified knowledge and does not unintentionally mislead other students. Posts that speculate on admission procedures, branch allocation, share personal rank-based predictions, or solicit counseling advice from the crowd will generally not be approved, unless they clearly offer helpful, factual insights without creating confusion.\n\nIf you're looking for real data, refer to this post: [Which branch can I get? (PESSAT 2022 cutoffs)](https://www.reddit.com/r/PESU/comments/1ct5ujc/which_branch_can_i_get_at_no_dont_make_such_posts/)\n\nWe appreciate your understanding and cooperation. These policies are designed to protect not just you, but the entire community, from the harm that misinformation can cause during such a critical time. Please respect the rules and seek guidance from trusted sources. Attempts to bypass this filter may result in a 30-day ban or longer for repeat offenders.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PESU) if you have any questions or concerns.*"
    },
    {
      "id": "nc4rth6",
      "body": "Get above 95 percentile and uk rank ull be gucci"
    },
    {
      "id": "nc5pt4a",
      "body": "Through JEE: Anything above 92% is usually sufficient to secure a CS (AIML) seat in the Ecity campus. The better your percentile, the higher your chances of getting into the top branches.\n\nThrough KCET: The cutoff for ECE at Ecity was around 6.1k (GM category). So, a rank better than that improves your chances of getting CSE, ECE, and other top branches in both campuses.\n\n(I had a 3k rank in KCET which was enough to join ECE in the RR campus but since I live much closer to the Ecity campus and preferred CSE, I took admission in the latter)\n└── Thanks buddy"
    },
    {
      "id": "nc79gc2",
      "body": "RR cse==93-94 percentil\n\nRR aiml ==90+percentile\n\nRR ECE ==88percentile\n\nECC cse==85.8 percentile\n\nECC AIML==84-83 percentile \n\nECC ECE==80-82 percentile\n\n  \nthis was the first time PES admited using jee mains in such high volumes definitely cutoff will increase next year by a lot\n├── Woah ... Full elaborated .... psych man... thank you\n│   └── bro i was branch closer for ECC cse full data ik 😂\n├── Pretty accurate lol.\n├── what do you think, how much will the cutoffs increase next year specifically for RR aiml ?\n│   └── it might get above 93 ig not sure\n│       └── I see thanks a lot man\n└── How cutoff can we expect for pes ec cse next yr?\n    └── see, now PES has got some recognition as it is accepting JEE mains and now in Electronic city metro is also available(right in front of campus) so it is convenient to be on the safer side i would say 92 percentile+ for sure next year cutoff wont go as down as low as 85percentile for ECC cse"
    }
  ]
}