{
  "id": "1n6q7p3",
  "title": "[Question] Am I cooked right now?",
  "content": "I haven't attended the first two days as a fresher. We had to go out of station and the tickets were non refundable bro what to do ny dad said it wouldn't be a big deal, I legit thought to just stay at home, alone, and manage but they refused. Am I cooked when I show up tomorrow?",
  "metadata": {
    "root_comment_id": "nc1tjz5",
    "post_id": "1n6q7p3",
    "author": "uglybich_hlep",
    "url": "https://www.reddit.com/r/PESU/comments/1n6q7p3/question_am_i_cooked_right_now/",
    "permalink": "https://reddit.com/r/PESU/comments/1n6q7p3/question_am_i_cooked_right_now/",
    "score": 15,
    "upvote_ratio": 0.8899999856948853,
    "created_utc": 1756835004,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "nc1u8re",
      "body": "No."
    },
    {
      "id": "nc1ucty",
      "body": "Nobody gives a rat's ass lmfao"
    },
    {
      "id": "nc1uohm",
      "body": "ur good bro dw"
    },
    {
      "id": "nc1vzw6",
      "body": "Lil bro, people bunk entire weeks and nobody gives two shits, and u are getting scared for 2 days "
    },
    {
      "id": "nc1ye6l",
      "body": "I'll recommend that you go through the first 2 or 3 topics of first unit, for all subjects.\n\nIt shouldn't be a big problem, but its best not to miss out anything and push it for later.\n└── Bro what is the attendance percentage for labs\n    └── 75%\nAll subjects' theory classes and lab classes, have to be atleast 75% individually in first year."
    },
    {
      "id": "nc447km",
      "body": "Whatever they teach everyday are getting updating in pesuacademy like the slides they present and teach ....just go thru them , its very simply ( im from chem cycle tho ....its just basic math , chem , semiconductor physics , and all those triangle/rectangle law of vectors for mechanics )"
    },
    {
      "id": "nc459f9",
      "body": "nobody gives a fuck if youre attendance is above 75 during esa"
    },
    {
      "id": "nc4fx26",
      "body": "Don't waste ur net on this shit lamo"
    },
    {
      "id": "nc57cex",
      "body": "Bro you are cooked. They will not let you sit in class. DON'T BUNK ANY MORE CLASSES IF YOU WANT YOUR DEGREE. YOU HAVE BEEN WARNED. /s"
    },
    {
      "id": "nc5y1th",
      "body": "lol, are u in sec b?"
    },
    {
      "id": "nc7tiux",
      "body": "2 days thats it? i would stay at home for a month if they didnt have attendance policy chill bro nothing serious"
    },
    {
      "id": "ncwsg2m",
      "body": "Ur good man dw"
    }
  ]
}