{
  "id": "1n729pz",
  "title": "[Admission]Which college would you choose",
  "content": "I need to make a decision quick between two colleges PESU RR cse-aiml in bangalore or SSN chennai cse core. i am from bangalore and some may say pesu is the obvious choice, even the fees is much lesser in pes(6-7 lakh for 4 years where as 25l in chennai). But also the intake in pes is currently around 2200 for both campuses but here it is only 180 students. So want to know what you guys will choose placement opportunities is only slightly better in pes",
  "metadata": {
    "root_comment_id": "nc4d8ir",
    "post_id": "1n729pz",
    "author": "Least-Treacle-3746",
    "url": "https://www.reddit.com/r/PESU/comments/1n729pz/admissionwhich_college_would_you_choose/",
    "permalink": "https://reddit.com/r/PESU/comments/1n729pz/admissionwhich_college_would_you_choose/",
    "score": 7,
    "upvote_ratio": 0.7099999785423279,
    "created_utc": 1756864401,
    "flair": "Admissions",
    "nsfw": false
  },
  "comments": [
    {
      "id": "nc4d8ir",
      "body": "Hi u/Least-Treacle-3746, your post was temporarily held for moderator review because it mentions topics related to admissions, which automatically flags it for review. \n\nPosts involving admissions are treated with particular care on this subreddit due to the high potential for misinformation during high-stress times of counseling, seat allotment and critical decision-making periods.\n\nUnfortunately, we've seen how easily inaccurate or speculative advice spreads in such environments. Users frequently make major decisions about their future based on what they read online, often from fellow aspirants who may not have access to accurate information. This leads to confusion, false expectations, and in many cases, regret. Since this is the first year PES is using JEE and CET for admissions, the risk of misinformation is even greater and there simply isn't enough reliable historical data for anyone to make trustworthy predictions or statements.\n\nFor these reasons, all posts that fall under the category of admissions must go through moderator review and fact-checking before they are visible to the community. This is not meant to restrict discussion but to ensure that the advice shared here is grounded in verified knowledge and does not unintentionally mislead other students. Posts that speculate on admission procedures, branch allocation, share personal rank-based predictions, or solicit counseling advice from the crowd will generally not be approved, unless they clearly offer helpful, factual insights without creating confusion.\n\nIf you're looking for real data, refer to this post: [Which branch can I get? (PESSAT 2022 cutoffs)](https://www.reddit.com/r/PESU/comments/1ct5ujc/which_branch_can_i_get_at_no_dont_make_such_posts/)\n\nWe appreciate your understanding and cooperation. These policies are designed to protect not just you, but the entire community, from the harm that misinformation can cause during such a critical time. Please respect the rules and seek guidance from trusted sources. Attempts to bypass this filter may result in a 30-day ban or longer for repeat offenders.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PESU) if you have any questions or concerns.*"
    },
    {
      "id": "nc4jy34",
      "body": "I think placements r fine, if u work lil hard in pes, if u r among top 10% of students in pes u wil get a 12lpa+ job, and being in top 10 % aint very hard\n├── \"aint very hard\" 🥀\n│   ├── Bro can you please tell how hard it actually is to\n│   │   └── to be in top 10 % is not a big deal, its an achievable goal , even if u hv joined by some management quota\n│   │       └── lmaooo, thats like saying being in the top 1%ile of jee is not a big deal.\n│   │           ├── bruh r u sane ? thts gotta be rage bait\n│   │           └── I got 97% I worked my ass off for it straight 2 years, moreover there r 13 lakh ppl in jee mains and only 2k ppl in pes, so if u can't be in top 200, tht too from a non jee based college, this conversation is totally useless or mb a RB\n│   │               ├── >Non jee based college\n\n13 lakh people don't have strict eligibility criteria to apply for jee while the 2k people you mentioned most of them wrote kcet or pessat and scored a rank < 10,000 to get into pes who competed against 3 lakh people. Yeah jee is tougher than kcet agree but saying you can top the people who went through all this is totally senseless.I have also seen students who were eligible for iit/nit just chose pes because they didn't wanted to leave their hometown for iit/nit\n│   │               │   └── dont waste your precious time on him bro, if he hasnt realized any of this he isnt exactly very bright to begin with.\n│   │               ├── you dumbfuck half of those 2k ppl in pes have also grinded their ass off for 2 years. do you still not understand the competition? you just wasted your 2 years if you still underestimate the competition lmao  \nyou are very ignorant and egoistical for someone who could only manage to get 97%ile, stop disrespecting others and focus on yourself. you are not going very far by talking down a senior\n│   │               │   └── oh look who got hurt, sorry lil bro \n\n![gif](giphy|RWUqVYucDBD4A)\n│   │               │       └── ?  \ni wont brag about my college/jee mains and adv rank but know one thing im leagues above you\n│   │               └── Lmao as a 97 percentiler my self, im laughing so hard ngl\n│   └── yea, it won't as hard as jee\n│       └── what college are you in vro\n│           └── im joining PES CS this year\n│               └── good luck\n├── Top 10?? You'd do fine if u stay in top 30-35 percent lmao\n└── > Being in top 10% ain't very hard in pes\n\nLmao\n    └── of course it wil be hard if u do 4 cgpa activities all 3.5 years and start sweating real hard in 8th set for placements\n        ├── ![gif](giphy|tMuTXPEnsnM2dOHFMH)\n        │   └── yea sure mate, its sad u r in 4th year, nd don't know abt place ments and shit , pretty sure u r not from CS department, or prob as I said 4 cgpa in CS\n        │       ├── ![gif](giphy|khGuFhshLWQIdXijHa|downsized)\n        │       ├── lmaooo, i’m sure a 4th year knows more abt pes than someone who hasn’t even joined yet\n        │       └── so many down votes, looks like peeps who did this got hurt \n\n![gif](giphy|GpyS1lJXJYupG)\n        └── Lmao you're joining no? Let's see.\n            └── See what?"
    },
    {
      "id": "nc5vt9e",
      "body": "SSN is really good bro.i would say same level as pes"
    }
  ]
}