{
  "id": "1n760dx",
  "title": "[Question] for admission do I need to self attest photocopies only or all the documents too..?",
  "content": "..?",
  "metadata": {
    "root_comment_id": "nc54uiz",
    "post_id": "1n760dx",
    "author": "Niranjan2278",
    "url": "https://www.reddit.com/r/PESU/comments/1n760dx/question_for_admission_do_i_need_to_self_attest/",
    "permalink": "https://reddit.com/r/PESU/comments/1n760dx/question_for_admission_do_i_need_to_self_attest/",
    "score": 2,
    "upvote_ratio": 1,
    "created_utc": 1756875845,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "nc55e59",
      "body": "Only photocopies\n└── https://preview.redd.it/cvahz5xnvvmf1.jpeg?width=258&format=pjpg&auto=webp&s=3afd65a54928bd1d94aeb315cff76f97c7fc0a41\n\nLike this...?\n    ├── Thanks for you photo\n    │   └── Now all we need is his DOB! /s\n    └──   \n\n\n![gif](giphy|5xtDarIN81U0KvlnzKo)"
    },
    {
      "id": "nc58qdg",
      "body": "I went for admission yesterday, and they were quite strict about both the order and the number of copies of each document required for registration/document verification.\n\n1. You need 1 full set of originals (as per the official list provided).\n2. Along with that, you must have 2 complete sets of photocopies (xerox). You can get these on campus itself, but I’d recommend preparing them in advance.\n3. Signatures are mandatory on all photocopies (self-attestation), but not on the originals. This applies to documents like:\n4. •\t10th marks card •\t12th marks card •\tTransfer Certificate (TC) •\tStudy Certificate, etc. •\tFor the photocopies, your parent’s signature     is also required on their PAN card copy.\n\nSelf-attested copies simply mean you need to sign on the xerox version of the documents before submission.\n\nhttps://preview.redd.it/w3pdth4uzvmf1.jpeg?width=3024&format=pjpg&auto=webp&s=d6a317322e9638fcb369add0cebdfdca3a827b2b\n└── >but not on the originals\n\nDid not know that this needed to be explicitly pointed out, but you should never sign on your originals. The concept of attestation applies only to photocopies made of any \"original\" document to prove that this is indeed yours.\n    └── Yeah, I agree.. But when I went for admission yesterday, there was a small issue—someone had signed all their original documents and it caused a bit of confusion. That’s why I just wanted to clearly mention that originals shouldn’t be signed"
    }
  ]
}