{
  "id": "1n8cdjd",
  "title": "[Admission] [I got admitted 3 days ago]My Pesu app and website is showing nothing about my classes and other info",
  "content": "if any fresher is facing the same issue, pls tell, cuz if mine is a one off case, I want to contact the IT support, or if anyone has already contacted them about it , please lmk",
  "metadata": {
    "root_comment_id": "ncdth5j",
    "post_id": "1n8cdjd",
    "author": "Murky_Cookie2011",
    "url": "https://www.reddit.com/r/PESU/comments/1n8cdjd/admission_i_got_admitted_3_days_agomy_pesu_app/",
    "permalink": "https://reddit.com/r/PESU/comments/1n8cdjd/admission_i_got_admitted_3_days_agomy_pesu_app/",
    "score": 5,
    "upvote_ratio": 0.8600000143051147,
    "created_utc": 1756997607,
    "flair": "Admissions",
    "nsfw": false
  },
  "comments": [
    {
      "id": "ncdth5j",
      "body": "Hi u/Murky_Cookie2011, your post was temporarily held for moderator review because it mentions topics related to admissions, which automatically flags it for review. \n\nPosts involving admissions are treated with particular care on this subreddit due to the high potential for misinformation during high-stress times of counseling, seat allotment and critical decision-making periods.\n\nUnfortunately, we've seen how easily inaccurate or speculative advice spreads in such environments. Users frequently make major decisions about their future based on what they read online, often from fellow aspirants who may not have access to accurate information. This leads to confusion, false expectations, and in many cases, regret. Since this is the first year PES is using JEE and CET for admissions, the risk of misinformation is even greater and there simply isn't enough reliable historical data for anyone to make trustworthy predictions or statements.\n\nFor these reasons, all posts that fall under the category of admissions must go through moderator review and fact-checking before they are visible to the community. This is not meant to restrict discussion but to ensure that the advice shared here is grounded in verified knowledge and does not unintentionally mislead other students. Posts that speculate on admission procedures, branch allocation, share personal rank-based predictions, or solicit counseling advice from the crowd will generally not be approved, unless they clearly offer helpful, factual insights without creating confusion.\n\nIf you're looking for real data, refer to this post: [Which branch can I get? (PESSAT 2022 cutoffs)](https://www.reddit.com/r/PESU/comments/1ct5ujc/which_branch_can_i_get_at_no_dont_make_such_posts/)\n\nWe appreciate your understanding and cooperation. These policies are designed to protect not just you, but the entire community, from the harm that misinformation can cause during such a critical time. Please respect the rules and seek guidance from trusted sources. Attempts to bypass this filter may result in a 30-day ban or longer for repeat offenders.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PESU) if you have any questions or concerns.*"
    },
    {
      "id": "nchlpii",
      "body": "i’m having the same issue"
    },
    {
      "id": "nchxlr6",
      "body": "Same fr\n└── Does is show now, how long did it take to show??\n    └── 1 day before classes\n        └── Oh Ok"
    },
    {
      "id": "nci9rqs",
      "body": "Mine too and I'm getting notifications of everything like Mtech/PhD/Nursing... along with Engineering"
    },
    {
      "id": "ncizzs5",
      "body": "Same"
    },
    {
      "id": "nckguu6",
      "body": "Same, do classes really start on 8th?\n└── I haven't received any official communication but most people are saying so. Really dunno how far starting on 8th holds good.\n    └── But I'm an hostelite, I've to report to hostel on Sunday, but they are not giving proper information. So I'm confused\n        ├── Maybe we should just call them tomorrow if we don't get any official info by noon.\n        │   ├── Yea, let's do that.\n        │   └── hey can you send me a dm if urs gets updated\n        │       └── Sure, comrade :)\nI'll DM you once it gets updated.\n        └── hey can u dm me if urs gets updated \n\npls\n            └── Yea, ofc. I'll check with the college tomorrow.\n                └── Any updates\n                    └── Yes. Check mail.\n                        ├── i didn't get any mail?\n                        │   └── I got classrooms info. And app is also updated\n                        │       └── which campus?\n                        │           └── RR\n                        └── I got mail for admission in 2026 batch\n                            └── Ec"
    },
    {
      "id": "ncqdyy3",
      "body": "i’ve been given the details about my section and the commencement date on my mail now. (i’m from the ecity campus)"
    }
  ]
}