{
  "id": "1n907x0",
  "title": "[Placements] This is so unfair man",
  "content": "I know a person who copied the whole ass test from sap ( wrote it from home) and got to the interview but fucked up royally. This just ends up hindering the chances of a deserving candidate cause they won’t even get to the interview ffs\nI’ve come to a realisation that this is pure luck based😭\nCan seniors please help me out on how to stand out with our application on various job portals?",
  "metadata": {
    "root_comment_id": "ncixcf5",
    "post_id": "1n907x0",
    "author": "Realistic_Ad_3721",
    "url": "https://www.reddit.com/r/PESU/comments/1n907x0/placements_this_is_so_unfair_man/",
    "permalink": "https://reddit.com/r/PESU/comments/1n907x0/placements_this_is_so_unfair_man/",
    "score": 132,
    "upvote_ratio": 0.9900000095367432,
    "created_utc": 1757063127,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "nciy7ob",
      "body": "At this point i just want to know how the fuck to clear OA By any means possible. fuck morality . (I'm an average student witn gpa <  9 so please refrain from telling me how people with 500+ leetcode and 9.5+ gpa got placed entirely on their own without cheating)\n└── there’s really smart people I know who aren’t even getting shortlisted to the interview whereas dumbf*cks who don’t even know how to introduce themselves are getting 2+ interviews and imagine my shock when they don’t clear the interview 😱\n    └── we are all gonna make it (hopefully)\n        └── We will bro"
    },
    {
      "id": "ncizc40",
      "body": "LinkedIn is your best bet. Try to connect with seniors or alumni who currently work and if you find any available new grad positions in their companies, reach out to them for a referral.\n\nCampus placements, given the current market situation are basically a roll of dice. With odds mostly stacked against you. Not trying to induce fear, sadly that’s just how things are.\n\nKnowing the right people will help you more than you realize"
    },
    {
      "id": "ncj95jq",
      "body": "Good luck cheating through OA and interview but be prepared to get kicked out if you don't know your work enough once you join the office.\n├── Cheaters will eventually eff up but the issue is genuine students losing out cause of them\n│   └── That's always there but nothing much can be done about that. All I can say is just don't follow the herd mentality and be unique.\n└── Why are u getting downvoted 😭\n    └── Not everyone can digest the fact lmao. Let them idc."
    },
    {
      "id": "ncjg1w3",
      "body": "Not just CSE lol, even in ECE stuff like this is happening. Some random ass people get shortlisted for interview, not just once but for multiple of them, and then bomb the interview. This is so unfair"
    },
    {
      "id": "nckb9qy",
      "body": "Bruhh you're saying this about SAP Labs what about Apple Shortlists that seems even more sus like I personally know some hostelites who openly admitted to cheating the OAs and ended up getting shortlisted I swear this is downright disgusting if they get the offer then Apple will get it's biggest downfall yet\n└── Once these guys start failing interview rounds companies will just think pesu students are dumb and stop showing up 😭\nBut it's prolly the same scene in every college.\n    └── I mean I swear such mfs snatch valuable opportunities of deserving peeps in interviews but cos of such cheating mfs we can't even clear OAs also like can karma fuck such ppl god forbid they do get offers at companies\n        └── Karma also striking  for few of the people rn who used to boast so much Abt their gpa and are crying so much now after not getting shortlisted \n            ├── I swear ppl really need to clear the misconception that high gpa does not really imply good placements it maybe a gate pass but not the only requirement lol\n            │   ├── Bruh my capstone teammate's entire personality in college is that he has 8.5 gpa and me being a 7 pointer has to do all the heavy lifting as he is just a study for exams kind of a guy\n            │   │   └── I swear man placements really have become so random ig it's just a harsh reality to just accept and move on atp\n            │   └── ok so will an 8.5 be sufficient?\n            │       ├── It's great but 8.75+ would be ideal don't run after 9.5 and shit\n            │       │   └── ok so w 8.75 will we even be eligible for high paying t1?\n            │       │       └── Most T1 companies look for 8 and 8.5 above as shortlisting criteria so I'd say 8.5 is safest anyday as very few companies look for 8.75 and 9 above categories, I'd say slogging for a 9 above for no reason is just not needed lol\n            │       └── See that various with companies shortlisting criteria safest anyday is 8.5 as it clears a hell lot of companies, with very few asking for 8.75 above and 9 above\n            └── Okayyy like I actually know a girl who has like 9.5 goa and always used to look down on others .Now she has got placed for 11.5 lpa base and she is crying that she deserved better\n                └── Ppl are always like this they'll be in a la la land thinking high gpa => crazy package until reality shatters them I mean why can't this lady actually try for \"better companies\" and show her mettle lol"
    },
    {
      "id": "nckx7u2",
      "body": "Really don't know why pes doesn't make offline OAs mandatory. GJB Assessment center would be perfect.\n├── Ong man, atp it’s only a lucky draw lol\n└── They copy there also xD"
    },
    {
      "id": "ncoira1",
      "body": "In this shitty situation, there are only 2 options,   \n  \nfirst ,report to college about such people and make sure every test and interview is offline in college\n\nsecond, learn to cheat smartly like everyone and get in companies.\n\nPick one, thats all you can do"
    },
    {
      "id": "ncoqu8r",
      "body": "2025 grad here.Unpopular opinion, but ill tell you one thing. Since many cheat....you should also do the same.\nits not about sincerity, its about going forward and securing a good job.\nAnd its very random I agree. Also if ur not clearing OAs thats absolutely normal.\nMany ppl get their first interview as late as November as well. But eventually ull land up somewhere.\nThe initial months like August, September are always the most stressful due to high competitions and shortlists."
    },
    {
      "id": "ncos997",
      "body": "You have to cheat yourself. Don't try to be fair cause the world isn't. Everything after is luck."
    }
  ]
}