{
  "id": "1n9ud66",
  "title": "[Placements]What happens if i get a  TIER2 -INTERNSHIP+FTE ?",
  "content": "I eligible to take\n\na\\] only FTE from a TIER1\n\nb\\]both INTERNSHIP+FTE TIER1\n\n",
  "metadata": {
    "root_comment_id": "ncpa1ej",
    "post_id": "1n9ud66",
    "author": "Antique_Sir_2060",
    "url": "https://www.reddit.com/r/PESU/comments/1n9ud66/placementswhat_happens_if_i_get_a_tier2/",
    "permalink": "https://reddit.com/r/PESU/comments/1n9ud66/placementswhat_happens_if_i_get_a_tier2/",
    "score": 23,
    "upvote_ratio": 0.9700000286102295,
    "created_utc": 1757147459,
    "flair": "Placements 🤑",
    "nsfw": false
  },
  "comments": [
    {
      "id": "ncpa3a0",
      "body": "Only fte from tier 1\n├── That's really bad if true, fte only companies are really rare\n└── Not sure why you're getting downvoted, but you're right - if you get a T2 intern+FTE, it takes up 1/1 of your internship offer quota and 1/2 of your FTE offer quota. Assuming you *accept* this offer, you are out of placements and you cannot sit for any more companies. If you *reject* this offer, you are now eligible only for companies with T1 FTE offers, and you won't be allowed for intern-only or intern+FTE.\n\nAlso kids, this has already been discussed before. Search the sub, seriously. Its embarrassing if someone from the 2028 batch has a higher awareness of the placement policy than someone in the final year going through placements.\n    ├── How come even after ppl got tier-1 intern + fte, they are allowed to sit for apple (only internship) ? Does this internship 1/1 quota not applicable to dream tier?\n    │   └── That's dream tier offer anyone regardless of having any tier offer are allowed to sit for it\n    │       └── What is dream tier? Like what makes something dream tier\n    │           └── I don't remember exactly since it changes a little every year, but anything above X LPA in CTC. It was 45 back in my time.\n    │               └── It was 60+ for 25 batch\n    ├── What's the time gap between getting selected for the company and getting the offer letter?\n    │   └── As quickly as the company wants to roll out the letter. Usually under a week, sometimes more.\n    ├── So, If I reject this T2 offer and eligible for only T1 FTE offers, where will I be doing my internship?\n    │   ├── ![gif](giphy|Jls16O6RdqyxueMvBj|downsized)\n    │   │   └── i am really worried about internship in this case, could you please answer.\n    │   │       ├── You can approach the college clubs , or your mentors u can easily complete a 6month internship in the college clubs and claim the credits\n    │   │       └── You need to find an internship on your own, since you already rejected the 2 offers you received.\n    │   └── u reject tier 2 offer then ur still eligible for tier fte+intern since u dont have any internship at hand u can sit for both intern + fte and fte\n    └── The Placement Policy if any of you are confused: -\n\n1) If you get a T1, u cannot sit for any other company (FTE/FTE+Int)\n\n2) If you get T3, u can sit for T2 and T1.\n\n3) Maximum 2 offers of any Tier allowed\n\n4) U cannot get more than 1 Internship offer.\n\n5) consequence of (4) is that, if you get T2 Intern+FTE u cannot sit for T1 Intern+FTE only FTE of T1 will be allowed.\n\n6) If you reject a T2, u can only sit for T1. similiarly, if you reject a T2 Intern+FTE then u can sit for Intern + FTE of T1 ONLY (note the difference pls)\n\n7) If you get a T2 IT, u can also sit for T2 Core. Similiarly, if you reject a T2 Intern+FTE IT u can also sit for T2 Core intern+FTE\n\n8) If u get internship which gets converted, you have the right to reject/accept it and sit for FTE as placement cell treats it as just as internship.\n\n\n\n\nThis was posted on Discord by a senior a couple of weeks ago.Fpund this comment under another post.The 4th one is it correct or wrong ,suppose I reject a Tier 2 fte+intern so I will br allowed to sit fir fte+intern of tier 1?\n        └── Isn't the answer to your question already present in my comment? Please read the last line of my first paragraph.\n            └── What happens if you get a T1 offer, but you also sit for dream tier? Can you give interviews and get selected for that and reject the T1 offer?\n                └── You guys need to start reading the FAQs. If you accept the T1 offer, you cannot. If you don't accept the T1 offer, you can sit only for dream tier companies."
    }
  ]
}