{
  "id": "1na2k5k",
  "title": "[Discussion] Get Early Access to Perplexity's New Browser - Comet",
  "content": "Hello r/PESU ,\n\nI'm here to tell you about Perplexity's new AI browser Comet and how you can get early access to it.\n\n**What is Comet?**  \nComet is an AI-first browser developed by Perplexity that blends advanced search with productivity tools, making it especially useful for students, researchers, and creators.\n\n**Key Features of Comet:**\n\n* AI-Powered Search – Provides instant, reliable answers with cited sources.\n* Research Mode – Quickly summarizes articles, academic papers, and web pages.\n* AI Writing Assistant – Assists with drafting essays, reports, and other content.\n* Knowledge Management – Lets you save, organize, and revisit your research easily.\n* Personalized Recommendations – Suggests topics and resources tailored to your interests.\n\n**How to Get Access To Comet:**\n\n1. Go to the link: [https://pplx.ai/dg](https://pplx.ai/dg)\n2. Verify your student status through SheerID (use your student email, as this might skip the need for document verification) when prompted.\n3. Download and install the Comet browser (only available for Windows and MacOS for now).\n4. Sign in to your account you just created. (You will also receive free Pro subscription if you haven't had a Perplexity account on your student id before).\n5. Start exploring and run your first search to activate your account. (To fully activate your account, be sure to complete every step detailed here).\n6. Have fun exploring the browser and finding new ways to boost your productivity!\n\n\n\n*Transparency note: I’m part of Perplexity’s Campus Ambassador Program. The link above is a referral link, which means I may receive a kickback if you sign up through it.*",
  "metadata": {
    "root_comment_id": "ncqvv3y",
    "post_id": "1na2k5k",
    "author": "NoHumor9325",
    "url": "https://www.reddit.com/r/PESU/comments/1na2k5k/discussion_get_early_access_to_perplexitys_new/",
    "permalink": "https://reddit.com/r/PESU/comments/1na2k5k/discussion_get_early_access_to_perplexitys_new/",
    "score": 0,
    "upvote_ratio": 0.4300000071525574,
    "created_utc": 1757172864,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "ncqwpwe",
      "body": "https://pplx.ai/ankushkumar-yemekar"
    }
  ]
}