{
  "id": "1naruhk",
  "title": "[Placements] Placement policy doubt",
  "content": "I’ve gotten placed in tier 1 for fte only. What do i do about the 8th sem internship. Can i sit for internship only companies through college placements?\n\nAlso how long does it take on average to receive offer letter or atleast some kind of communication from the company.",
  "metadata": {
    "root_comment_id": "ncw6rnq",
    "post_id": "1naruhk",
    "author": "depressed_simp234",
    "url": "https://www.reddit.com/r/PESU/comments/1naruhk/placements_placement_policy_doubt/",
    "permalink": "https://reddit.com/r/PESU/comments/1naruhk/placements_placement_policy_doubt/",
    "score": 19,
    "upvote_ratio": 0.949999988079071,
    "created_utc": 1757247935,
    "flair": "Placements 🤑",
    "nsfw": false
  },
  "comments": [
    {
      "id": "ncw93co",
      "body": "1. Yes, you're eligible for internship-only\n2. Depends on the company, usually under a week.\n└── I have a doubt, as now we have to do a 4 month internship 8 credits what if we are not able to secure an internship what's the process\n    └── I believe PES will force you into some kind of *internship* on campus. That's what I read on Discord anyway.\n        ├── What's fte and fte+internship\n        │   ├── If you are in 4th year, you shouldn't be asking such questions\n        │   └── Bruhhhhhhh😭😭🥀\n        └── What's fte and fte+internship\n            ├── Did u read FAQs? FTE means ur actual job, and FTE + internship means ur 8th sem internship + ur job\n            └── Wtf bruh 4th year ans how are u even asking this 💀"
    },
    {
      "id": "ncwtk10",
      "body": "What was it? Hsbc?\n└── yup\n    └── That's actually pretty cool, you can still find internships, and if you get converted you basically have 2 options for fte\n\nOtherwise hsbc\n\nAnd if you don't get an internship, do some crap in college and join hsbc\n\nWin win win every way you go, lucky bastard. Enjoy life\n        └── Hey if I have internship offer from 1 company and FTE offer from another. \nLet's say i accept both offers for now.\nWill I be able to reject the FTE offer later( just before July suppose) If get converted in my internship?\n            └── Yup u can ....the rule is u can hold max 1 intern offer and 2 fte offer"
    },
    {
      "id": "nd1prb9",
      "body": "where did you get placed"
    }
  ]
}