{
  "id": "1nbpmjj",
  "title": "[Question] If I got an offer from Tier 1 company, can I apply for other Tier 1 company through off campus ?",
  "content": "If I also got offer from offcampus as well, what should I do with the one I got from on-campus ?",
  "metadata": {
    "root_comment_id": "nd3c8x7",
    "post_id": "1nbpmjj",
    "author": "Key_Mathematician544",
    "url": "https://www.reddit.com/r/PESU/comments/1nbpmjj/question_if_i_got_an_offer_from_tier_1_company/",
    "permalink": "https://reddit.com/r/PESU/comments/1nbpmjj/question_if_i_got_an_offer_from_tier_1_company/",
    "score": 9,
    "upvote_ratio": 0.9200000166893005,
    "created_utc": 1757342637,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "nd3e74r",
      "body": "In off campus you can do whatever you want; If you get an offer you can reject the earlier offer, but you should do it before signing the offer letter just to be on the safer side.\n└── On an average how much time we get to hold the offer letter, as in from our selection to get the offer then after getting offer it till to sign it...\n    └── It depends on the company, ask placement cell; They will inform the hr and get back to you\n        ├── Thank you.. Thank you.. Very much..\n        ├── Rejecting an accepted offer will have no consequences since they would have removed you from the pool anyway. And no, they won't add you back since you had previously accepted the offer.\n        └── Bruh why will they scold.....he would be out of placements pool anyway.\n            └── It depends on their mood bro; The people in the placement cell are very moody, if they are in good mood then they will directly accept your request; Otherwise, they will tell like you should have told before the offer letter got released, you wasted opportunities for others etc. and then accept your request;  Conclusion is they will accept the request, but getting scolded or not depends on their mood and how busy they are."
    }
  ]
}