{
  "id": "1nbq4cd",
  "title": "[Admission] worth taking mgmt quota CSE?",
  "content": "my nephew is getting mechE in BIT via comddk but he is interested in doing CSE from PES EC branch but might get only mgmt quota. is it worth of spending 12lpa for this course here? total cost would be close to 50L by the time he completes it. can he get placed and recover this ROI?",
  "metadata": {
    "root_comment_id": "nd3fxgu",
    "post_id": "1nbq4cd",
    "author": "Foreign_Wedding2060",
    "url": "https://www.reddit.com/r/PESU/comments/1nbq4cd/admission_worth_taking_mgmt_quota_cse/",
    "permalink": "https://reddit.com/r/PESU/comments/1nbq4cd/admission_worth_taking_mgmt_quota_cse/",
    "score": 3,
    "upvote_ratio": 1,
    "created_utc": 1757343730,
    "flair": "Placements 🤑",
    "nsfw": false
  },
  "comments": [
    {
      "id": "nd3fxgu",
      "body": "Hi u/Foreign_Wedding2060, your post was temporarily held for moderator review because it mentions topics related to admissions, which automatically flags it for review. \n\nPosts involving admissions are treated with particular care on this subreddit due to the high potential for misinformation during high-stress times of counseling, seat allotment and critical decision-making periods.\n\nUnfortunately, we've seen how easily inaccurate or speculative advice spreads in such environments. Users frequently make major decisions about their future based on what they read online, often from fellow aspirants who may not have access to accurate information. This leads to confusion, false expectations, and in many cases, regret. Since this is the first year PES is using JEE and CET for admissions, the risk of misinformation is even greater and there simply isn't enough reliable historical data for anyone to make trustworthy predictions or statements.\n\nFor these reasons, all posts that fall under the category of admissions must go through moderator review and fact-checking before they are visible to the community. This is not meant to restrict discussion but to ensure that the advice shared here is grounded in verified knowledge and does not unintentionally mislead other students. Posts that speculate on admission procedures, branch allocation, share personal rank-based predictions, or solicit counseling advice from the crowd will generally not be approved, unless they clearly offer helpful, factual insights without creating confusion.\n\nIf you're looking for real data, refer to this post: [Which branch can I get? (PESSAT 2022 cutoffs)](https://www.reddit.com/r/PESU/comments/1ct5ujc/which_branch_can_i_get_at_no_dont_make_such_posts/)\n\nWe appreciate your understanding and cooperation. These policies are designed to protect not just you, but the entire community, from the harm that misinformation can cause during such a critical time. Please respect the rules and seek guidance from trusted sources. Attempts to bypass this filter may result in a 30-day ban or longer for repeat offenders.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PESU) if you have any questions or concerns.*"
    },
    {
      "id": "nd453rq",
      "body": "subjective but my answer would be not worth it\n└── Nothing subjective tbh, its just not worth it"
    },
    {
      "id": "nd6wiyb",
      "body": "Not worth it. Maybe check for rvce mgmt quota, I would rather pay a little more and take that instead of PES tbh\n└── rvce management quota is 70L 💀"
    },
    {
      "id": "nd76zbc",
      "body": "if you get 12lpa sure\n└── you mean it costs more than this?\n    └── you should get back the money u invested in pes, at a management quota this will be difficult cuz you invested a lot and have a high probability of getting a lower package (unless you're a genius). which means you will essentially will take a very long time to get that money back, and then pursue higher education or anything else"
    },
    {
      "id": "nd8aay1",
      "body": "If man is smart enough to get scholarship, definitely worth it. Considering u pay 50L for 4 yrs and he manages the 40% scholarship at least, u wud get back 20L. The scholarship is on the entire money paid not only on the tuition fees. And abt getting placed and recovering it, thats based on how he manages the 3 years and gets placed. Tier 1 meaning he can def recover the ROI in 2-3 years.\n└── thank you, will ask him to check abt this."
    },
    {
      "id": "nd8x8uy",
      "body": "No"
    },
    {
      "id": "ndb6iqw",
      "body": "Nope, get CSE from any other college and save the money for masters."
    }
  ]
}