{
  "id": "1nc9w8m",
  "title": "[Question] totally lost in both DDCO and DSA",
  "content": "TITLE. our ddco teacher is fine but all our dsa teacher does is draw pictorial representations 😭  how do I prepare wrt isa?? the ddco textbook has so so many problems .all we learn in dsa class is pictorial representation and he finished stacks in 20 minutes and spent the next 2 full classes on 2 youtube videos, each solving one postfix expression only  😭 ",
  "metadata": {
    "root_comment_id": "nd7o9m5",
    "post_id": "1nc9w8m",
    "author": "DurianFriendly6901",
    "url": "https://www.reddit.com/r/PESU/comments/1nc9w8m/question_totally_lost_in_both_ddco_and_dsa/",
    "permalink": "https://reddit.com/r/PESU/comments/1nc9w8m/question_totally_lost_in_both_ddco_and_dsa/",
    "score": 17,
    "upvote_ratio": 0.9599999785423279,
    "created_utc": 1757393250,
    "flair": "Study Help :table:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "nd7rhu2",
      "body": "Atleast you know the c basics U shd understand logic\n└── What if you don’t\n    └── Well u r in frist year so ya ull learn basics first\n        └── Im ok second year\n            └── Then how did u pass 1st year\n                └── 🤬"
    },
    {
      "id": "nd81lq9",
      "body": "Start studying relevant sections from the textbook for DDCO. Solve the problems, as many as you can. The book is great; its pretty comprehensive and might be lengthy and tedious, but its quite good at breaking down the concept and explaining it in detail: something you are *really* going to need during the ESAs because surface level knowledge won't cut it. DDCO exams tend to be conceptually heavy, especially the ESAs where they tend to pick problems directly or adapted from the book sometimes. Most, if not all, have benefited from studying this course directly from the book.\n\n  \nWon't comment about DSA since I primarily depended on learning from the class and prof and just practiced online in my free time."
    },
    {
      "id": "nd82erc",
      "body": "DSA, if I recollect correctly, was mostly code. Both ESA and ISA had coding questions. I’d suggest picking a YouTube channel (like Striver, Abdul Bari, or Neetcode) and practicing on platforms such as HackerRank or LeetCode. Building intuition is really important for DSA.. if you practice well it would help with placements as well.\n└── oh thanks a lot! that is the reason im quite worried for dsa as well bc it's needed for placements but i find it hard to follow along in class."
    },
    {
      "id": "nd83lv5",
      "body": "Bro u need to ace the college level dsa , this is nothing compared to the dsa asked in OAs and placements, but dw it's tough with c so  try to learn from yt ,later on when u do it with cpp , java or python the college level codes will be quite ez\n├── yes yes that is why i am worried! i am still solving doubly linked lists problems(from esa papers) and not getting them right but our sir's finishing up queues already!! thanks a lot for the help!\n└── when did u start doing dsa in cpp?\n    └── During the summer break before 3rd year though I had a cpp special topic in 3rd sem"
    },
    {
      "id": "nd8nqy3",
      "body": "If u already know C basics, start with **Jenny's Lectures CS IT** if u have time. if u have less time I would suggest watching gate smashers for ISA\n└── oh thanks! will check it out!"
    },
    {
      "id": "nd8y3pt",
      "body": "Ahh nigga even we had some werido for dsa but unfortunately it is what it is\n└── canon event then"
    }
  ]
}