{
  "id": "1nci7fl",
  "title": "[Placements] NO SHOW NOTICE!!!",
  "content": "people who got no show notice what are we supposed to do   \nare we blacklisted or something? ",
  "metadata": {
    "root_comment_id": "nd99lsy",
    "post_id": "1nci7fl",
    "author": "Strong_Relative_8421",
    "url": "https://www.reddit.com/r/PESU/comments/1nci7fl/placements_no_show_notice/",
    "permalink": "https://reddit.com/r/PESU/comments/1nci7fl/placements_no_show_notice/",
    "score": 31,
    "upvote_ratio": 1,
    "created_utc": 1757422674,
    "flair": "Placements 🤑",
    "nsfw": false
  },
  "comments": [
    {
      "id": "nd9cjl2",
      "body": "Someone explain this term NO SHOW NOTICE plzz\n└── If you registered for the OA, or you got shortlisted for the interview and if you did not show up, the company will issue the college a no show notice for you, and the placement cell will in turn get to know that you skipped it. The consequences usually depend on the placement coordinator's mood but the usual SOP is he will blacklist you and then summon you to the campus for an explanation. If you have a valid reason, you're in luck, but people have gotten blacklisted for skipping interviews; skipping OAs is bad but usually they haven't been too strict about it.\n    ├── Does this happen if I miss OAs of 3rd year internships as well?\n    │   └── Yes. Applies to summer internship season as well as placement season.\n    └── what if a person logs in to the test but submits an empty paper? what are the consequences for that? will they get blacklisted?"
    },
    {
      "id": "nd9g4al",
      "body": "Blacklist for missing tests?no way lol also like hundreds of ppl are there in the list if they really do some shit like that there would be definitely 2 or more minded who would deadass off themselves,something that wouldn’t benefit college’s reputation in any way\n└── You shouldn't comment if you aren't aware of what's happened previously. People have gotten blacklisted. Some temporary (2-3 companies), some permanent. Since you mention it to be the OA, the odds of blacklisting are much lower and if it happens, will only be temporary (I hope so at least).\n\nStudents not showing up hurts the college's reputation too, and companies haven't taken favorably to that in the past. At the end of the placement cycle, each company also provides feedback about the placement process as well as quality of students, and these are highlighted there. If you scroll back to maybe 2022 or 2023 on this sub (or Discord, don't remember, but it was a word document being presented on the MRD screen), you'll find pictures posted of the feedback that my batch and my juniors had received. \n\nCompanies had clearly highlighted that students skipped the OA/interview, and there's no way to say with certainty that it didn't affect their recruitment numbers next year, but it's safe to assume that given companies have shown reactions to student quality in the past, these actions don't go without consequences which affect the college. To prevent these from happening, PES enforces these consequences to limit how many skip the OAs and damage the future placement process. \n\n--- \nAlso curious, you mention hundreds in the list. How did so many skip the OA? Did you guys have another OA at the same/similar time?\n    └── Ohh nvm i apologize i wasnt aware of it,but yeah nearly 250 students are there in the list,also the pointers had walmart test at evening that day\n        └── That's alright. But don't make these assumptions and mislead others, especially about something as critical as placements. And thanks for the update. If there was a clashing test, they should email the placement coordinator with that information. However, its pretty easy to check if a student attempted either test. If someone did not attempt either, they are in trouble.\n            └── Should i send them an email now??Or wait for some time cuz as of now tgey have just released the sheet of ppl who didnt appear for test,also only 9 pointers had walmart test and they are still the minority in the list so a lot of ppl are in trouble"
    },
    {
      "id": "nd9lf5l",
      "body": "As I said in my [other comment](https://www.reddit.com/r/PESU/s/9By4Nxo0KK), if you skip the OA/interview, the placement coordinator will eventually reach out and summon you to campus for an explanation. You can also take the lead on this and visit the placement cell before they summon you. I'm not sure what you missed, but if it's an interview, you're kind of cooked. They're usually a little more relaxed with OAs, but we've had people getting blacklisted, both temporarily and permanently, for skipping the process. \n\nAlso fyi, if you want to *skip* something in the future, the only way to do it safely is to absolutely shit yourself in the OA or interview. If it's the OA, it's as simple as logging in and submitting an empty test, and if it's an interview, screw up the first round really badly. There is no other safe route."
    },
    {
      "id": "nd9nrvf",
      "body": "I wrote exam in my room but yet I am in NO SHOW LIST"
    },
    {
      "id": "nd9o038",
      "body": "I wrote exam in my room, I was unable to go to college, yet I am in NO SHOW LIST\n├── For tests taking place inside the campus, they will scan the id card and mark attendance; So only people who attend the test in campus will be considered for further rounds.\n│   └── Ya bro that's fine they can remove me from further rounds but why NO SHOW\n│       ├── It's one and the same only no; Like they already said, you have to attend it from campus; There won't be any consequences this time, but you might get blacklisted next time, so be careful\n│       ├── Bruh u haven’t written test IN CAMPUS, hence no show\n│       └── Because you were required to attempt it on campus. You cannot play by your rules.\n├── If you weren't able to go to college, why'd you write the test then 🌚\n│   └── As i registered the OA is in google doc do i just Marked all mcqs just to avoid I not missed OA\n│       └── Now should I meet somashekar sir or just ignore and not do that again?\n├── So, the HOP was like no tolerance to people taking exam anywhere else other than assigned venue. If u had attended the orientation, you would have known.. anyway if you have genuine reason, maybe they will let you off with a warning\n└── Sorry to say this, in my books you have scammed the OA"
    },
    {
      "id": "nd9tob6",
      "body": "In last week's orientation, they said that if we register for a company's placement process and fail to turn up they will not give LOR and might blacklist you"
    }
  ]
}