{
  "id": "1nd0cz8",
  "title": "[Rant]Where is PESU? who the hell made this list!",
  "content": "",
  "metadata": {
    "root_comment_id": "ndd6mtp",
    "post_id": "1nd0cz8",
    "author": "New_Entrepreneur_810",
    "url": "https://i.redd.it/90jwb5qt42of1.jpeg",
    "permalink": "https://reddit.com/r/PESU/comments/1nd0cz8/rantwhere_is_pesu_who_the_hell_made_this_list/",
    "score": 50,
    "upvote_ratio": 0.9200000166893005,
    "created_utc": 1757465369,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "nddfxj2",
      "body": "How tf did srm get in but not pesu\n└── activity I'm guessing, as SRM and those other subs are quite active \n\n\nwhile pesu i don't see a new post that often, which I'm guessing is the reason why we didn't make the list\n    ├── The r/manipal sub is for the entire town of Manipal, which the college also shares. It's hardly a fair comparison if you include it. Its like saying r/bangalore is also r/PESU.\n    │   └── Tbh the manipal town is almost nothing if u exclude manipal college.\n    └── How is pesu sub not active, there is a post like every hour.\nPretty much everyone comes here to get their kcet doubts answered too.\nI think u keep looking at srm posts so u get more of those."
    },
    {
      "id": "nddgs1n",
      "body": "why didn’t you post this comment there?"
    },
    {
      "id": "nddh8a0",
      "body": "PESU is in our hearts"
    },
    {
      "id": "nddmwy2",
      "body": "Brother PESU ain't just an engineering college, it is a university with other courses like bba\n├── So is SRM lmao\n└── > Brother PESU ain't just an engineering college\n\nCorrect, PESU is an emotion uwu\n    └── oof"
    },
    {
      "id": "nddv7ao",
      "body": "How tf bits has 202K?!?!\n└── There's lots of aspirants and others lurkers too\n    └── Bots"
    },
    {
      "id": "nddzzjd",
      "body": "It’s an insult if PESU is compared to these colleges, it’s on a different tier\n└── Legend"
    },
    {
      "id": "nde8uwo",
      "body": "Love this!!\n\nThanks for defending this subreddit... I guess the list is made from a POV of famousness of college \n\nBut no other subreddit is as helpful as this one"
    },
    {
      "id": "ndesfkd",
      "body": "Bro who made this? 💀"
    }
  ]
}