{
  "id": "1negvx2",
  "title": "[OffTopic] Partial drop from PESU?",
  "content": "do you guys think taking a partial drop from cse in pes is worth it? i’m extremely unhappy and i can’t feel proud of myself no matter what so this has pushed me into a really tough time mentally… i genuinely only think getting something better will make me even like myself more so is it possible? has anyone done it please help me ",
  "metadata": {
    "root_comment_id": "ndojq6d",
    "post_id": "1negvx2",
    "author": "snowprincess_hiii",
    "url": "https://www.reddit.com/r/PESU/comments/1negvx2/offtopic_partial_drop_from_pesu/",
    "permalink": "https://reddit.com/r/PESU/comments/1negvx2/offtopic_partial_drop_from_pesu/",
    "score": 7,
    "upvote_ratio": 0.8199999928474426,
    "created_utc": 1757616085,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "ndolcam",
      "body": "Depends on what exam you gave and the scope of improvement tbvh. Look let's say for a NIT/IIT you missed the cutoff by a small margin and ended here then you can somewhat think of a partial drop but if the difference was really high then just don't! Cos you'll end up screwing your CGPA here. 1st year is the easiest to score and you don't wanna hurt your placement/internship expectations just cos you screwed your GPA up in 1st year."
    },
    {
      "id": "ndomc2o",
      "body": "I don’t know what exactly you’re going through that made you feel like this (since you’re still in 1st year), but honestly you don’t need to be some expert to survive engineering. In the beginning it feels like everyone’s doing crazy stuff and you’re just stuck, but trust me, most of us have been there.\n├── Taking a drop will just delay things, it won’t really “fix” it. Instead, try finding good friends, go to hackathons/workshops, pick up new stuff and just keep growing and learn.\n└── **“You don’t have to be great to start, you just need to start.”**"
    },
    {
      "id": "ndpreq4",
      "body": "Before I discuss it being worth it, here's the truth: partial drops at PES aren't possible. It's been discussed before, but the gist is that PES is way too academically rigorous to balance JEE prep alongside with. You're going to have regular assignments, projects, labs, quizzes, etc, along with ISAs for every course - all of these combined make it pretty tough to take out quality time to focus on something like preparing for the entrances again. You're barely going to have time for yourself. People have tried it before and failed spectacularly, the only thing they've achieved is screwing up their first year GPA so bad that when placement season arrives, it's too late to recover from the damage. As said before, overnight academic success stories aren't found at PES, this isn't the college for partial drops or loose academic grit. If you do intend to actually look for a better college, you're better off taking a complete drop and focusing entirely on your prep. \n\n---\n\nHaving said that, I think it's important to address some parts of your post which are very serious. I've seen far too many go through this, so this is going to be a long answer and you'll have to bear with me. \n\n> i’m extremely unhappy and i can’t feel proud of myself no matter what \n\nAnd why is it that you feel this way? Did you dream of better colleges, if yes, which ones? I know everyone dreams of IITs, but within the bounds of practicality, where did you see yourself? Do you feel this way because your peers/friends ended up in canonically better colleges? Or are you feeling this way because you feel you won't achieve the same success from here compared to other colleges?\n\n> so this has pushed me into a really tough time mentally… i genuinely only think getting something better will make me even like myself more \n\nUnfortunately, this is a never ending problem. There's always going to be a better college. Once you start working, there's always going to be a better company, or someone with a better pay. So where does this end? Odds are getting into a \"better\" position is only going to make you happy for a few moments before you circle back to the same emotions. \n\nComparison is the thief of joy. You need to start finding happiness in the present, in what you are and what you are working towards. Instead of looking back on what you could have done, look forward and think about what you can do instead. \n\nDon't attach how you feel about yourself to your college tag, it's the last thing you should correlate yourself with. Your value isn't determined by which college you go to, and you're no less than any IITian or whatever college you dream of. Learn to love yourself for who you are, because only then will others also love you for the same reasons. Do you only want people to notice/appreciate you just because you're from college X, or do you want to be loved regardless of who you are? It all starts with how you look at yourself. \n\n---\n\nHere are my two cents: you're here now. You cannot change the past. What's done is done. Focus on your present because this is a new chapter in your life. Your entire career trajectory is going to be decided by what you do today instead of what you didn't do yesterday. Work hard, build your skills, become industry ready and hirable. Don't let the college determine your identity, it's just a tag at the end of the day. You're not going to be defined by that tag but rather what you do and accomplish; you have to strive to be much, much, much more than your college's reputation and tag. \n\nPeople think that IIT is the only road to success in life. If that had been the case, you wouldn't have seen this many successful people in the world today. Kids from colleges like PES have gone on to achive far more than IITians in various spheres of life, it all depends on whether you let your circumstances define you, or whether you take the reigns of your life and control the momentum. A quick search on LinkedIn will show you what alumni are upto: students from PES have gotten into the world's best MS and PhD programs, or are working at some of the top companies, whatever their goals may be. \n\nAll that matters is how you make the most of what you've given. At better colleges, you've got more freedom to pick opportunities, while at lower ranked ones, you've got to grab every single one and sometimes make those opportunities yourself. But none of this means that you can't be as successful as others. The only one stopping you from being that successful is yourself. \n\nOf course, at the end of the day, the decision is yours. But you should know that your college, tag etc are all secondary. What really matters is what you make of yourself and what you achieve. As long as you believe you can, nothing can stop you.\n└── Edit: your post/comment history (deleted post) shows you called someone who wasn't able to understand something in class a \"village kid\"? Wtf? \n\nIf you seriously did that, shame on you OP. You don't deserve the kind words others have posted here. I'm going to leave my comment up in case it helps others but you should learn to be better."
    },
    {
      "id": "ndreh7k",
      "body": "Beta do naau pe pair mat rakho, last me phatna hi hai. Speaking from personal experience"
    }
  ]
}