{
  "id": "1nfuft5",
  "title": "[Question] Top commentors please see this post...",
  "content": "I want to change my clg and come to pes \nIt even possible...\nPlease walk me through the process ..\nI got a seat in nie but .\nThe campus sucks.\nThe staff suck.\nThe people and the atmosphere is soo gloomy I don't even want to go there ...\nI couldn't get any branch in pes .\nMy rank was too low ..\nIs there anyone who did change their clg ..\nplease help me guys..\nTop commentors please see this thread",
  "metadata": {
    "root_comment_id": "ndz18mi",
    "post_id": "1nfuft5",
    "author": "S_r32",
    "url": "https://www.reddit.com/r/PESU/comments/1nfuft5/question_top_commentors_please_see_this_post/",
    "permalink": "https://reddit.com/r/PESU/comments/1nfuft5/question_top_commentors_please_see_this_post/",
    "score": 5,
    "upvote_ratio": 0.8600000143051147,
    "created_utc": 1757760510,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "ndz18mi",
      "body": "Hi u/S_r32, your post was temporarily held for moderator review because it mentions topics related to admissions, which automatically flags it for review. \n\nPosts involving admissions are treated with particular care on this subreddit due to the high potential for misinformation during high-stress times of counseling, seat allotment and critical decision-making periods.\n\nUnfortunately, we've seen how easily inaccurate or speculative advice spreads in such environments. Users frequently make major decisions about their future based on what they read online, often from fellow aspirants who may not have access to accurate information. This leads to confusion, false expectations, and in many cases, regret. Since this is the first year PES is using JEE and CET for admissions, the risk of misinformation is even greater and there simply isn't enough reliable historical data for anyone to make trustworthy predictions or statements.\n\nFor these reasons, all posts that fall under the category of admissions must go through moderator review and fact-checking before they are visible to the community. This is not meant to restrict discussion but to ensure that the advice shared here is grounded in verified knowledge and does not unintentionally mislead other students. Posts that speculate on admission procedures, branch allocation, share personal rank-based predictions, or solicit counseling advice from the crowd will generally not be approved, unless they clearly offer helpful, factual insights without creating confusion.\n\nIf you're looking for real data, refer to this post: [Which branch can I get? (PESSAT 2022 cutoffs)](https://www.reddit.com/r/PESU/comments/1ct5ujc/which_branch_can_i_get_at_no_dont_make_such_posts/)\n\nWe appreciate your understanding and cooperation. These policies are designed to protect not just you, but the entire community, from the harm that misinformation can cause during such a critical time. Please respect the rules and seek guidance from trusted sources. Attempts to bypass this filter may result in a 30-day ban or longer for repeat offenders.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PESU) if you have any questions or concerns.*"
    },
    {
      "id": "ne10dnc",
      "body": "I don't think so you can change it like that. I mean ig there's lateral entry but that's only for diploma students.. you can confirm it with PES management by calling the admission department. Other option remains taking a partial drop and trynna get a good KCET/Mains rank to end up here but I don't think so you should waste a drop year.. if you got North Campus in NIE then ig it should be fine if you're from CSE or related branches placements are decent I heard but if you're in some core branch you might be cooked\n└── My clg mangement said u can apply for clg and branch change after first semester when vtu will announce the seat  vacancies later on (if there will be any) he mentioned smtg like u can only get into vtu affiliated clgs and govt aided ones \nSo I think my best shot would be to hope for any vacancies in and outside my clg and hope it all works out ..Also.\nTq for ur time :)\n    └── pes isn’t VTU affiliated though?\n        └── It is vtu affiliated but they'll first let ppl from ec campus and their own campus to fill the vacancies ig ..so no real hope for me there\n            ├── nah i’m 100% sure that PES isn’t affiliated to VTU. it a university\n            │   └── Ur right ..i just went through the entire list..\nLooks like I've wasted ur time \n.\nMy bad .\n            └── No pes isnt vtu affiliated anymore don't even consider seat vacancies as an option"
    }
  ]
}