{
  "id": "1nhcbq0",
  "title": "[Question] what is bootstrap?",
  "content": "I just joined pes and I'm curious of what bootstrap actually is. Is it true that kcet students miss bootstrap?",
  "metadata": {
    "root_comment_id": "neakns8",
    "post_id": "1nhcbq0",
    "author": "Saltwater1122",
    "url": "https://www.reddit.com/r/PESU/comments/1nhcbq0/question_what_is_bootstrap/",
    "permalink": "https://reddit.com/r/PESU/comments/1nhcbq0/question_what_is_bootstrap/",
    "score": 4,
    "upvote_ratio": 0.75,
    "created_utc": 1757910286,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "neale4j",
      "body": "Bootstrap at PES University is a week-long program for first-year students, typically held before regular classes commence. Its primary goals are to introduce new students to university life and foster connections.\n\nHere's a breakdown of what bootstrap entails:\n\n*   **Activities and Exploration:** During this period, students engage in simple and fun activities designed to help them explore various engineering branches, such as AI/ML, Biotechnology, and Electronics. Even if a student has been admitted to a specific branch like Computer Science and Engineering (CSE), they are still encouraged to explore other disciplines. Activities can include mechanical workshops, visits to electronics labs to learn basic concepts, hackathon-style design thinking events, and sometimes community service.\n*   **Socialization and Networking:** Bootstrap serves as an icebreaker, offering a chance for new students to meet their batchmates and interact with seniors. While it's a social event, some students note that it's not the sole or most critical place to form lasting friendships, as many connections are also made during regular classes.\n*   **Location:** While historically students from both campuses (RR and EC) might have attended bootstrap at the RR campus, it now takes place at the respective campuses.\n*   **Mandatory Status:** Bootstrap is not mandatory to attend. Although it's described as a fun experience, it's generally not considered essential for a student's academic or social integration into the university.\n\nRegarding KCET students, it is true that they often miss the bootstrap program. This is because the KCET counselling and admission process can extend later than the scheduled bootstrap period. If a student joins late due to the admission timeline, they will miss the program. However, students who have missed it generally suggest that it is not a significant loss, as it's not considered crucial, and regular classes provide ample opportunities for learning and making friends.\n\nSources:\n\n- https://www.reddit.com/r/PESU/comments/1dwu90v/first_dayweek_at_pes/\n- https://www.reddit.com/r/PESU/comments/1myymv0/question_bootstrap_program/\n- https://i.redd.it/r3titr5z31gd1.jpeg\n- https://www.reddit.com/r/PESU/comments/1f65opu/classes_start_from_september_17_for_freshers/\n- https://www.reddit.com/r/PESU/comments/1fhducc/bootstrap/\n- https://www.reddit.com/r/PESU/comments/1fevmn0/kcet_procedure/\n- https://www.reddit.com/r/PESU/comments/1ekq8xt/will_i_miss_orientation_and_bootstrap_if_i_am_not/\n\n---\n*I am a bot, and this action was performed automatically.*\n├── Works 🔥🔥🔥\n└── man askpesu is working so well\n    └── And its only going to get better.\n\n![gif](giphy|l0ExbnGIX9sMFS7PG)\n\nIn other news, looks like AI has taken my job /s\n        └── ![gif](giphy|10yXFkBJ0MwGQ0)\n            └── hdwoufie"
    },
    {
      "id": "nfyirnm",
      "body": "bootstrap is crazy"
    },
    {
      "id": "nfyitd8",
      "body": "me when bootstrap"
    },
    {
      "id": "nfyiucy",
      "body": "me when askpesu 🔥🔥🔥"
    },
    {
      "id": "nfyivb9",
      "body": "askpesu meri jaan"
    },
    {
      "id": "nfylozj",
      "body": "abcdefgh"
    },
    {
      "id": "nfym0sx",
      "body": "ijklmnop"
    }
  ]
}