{
  "id": "1niff36",
  "title": "[Placements] help to on placement prep",
  "content": "im currently in my 3rd sem w a gpa of 8.3 and i wanna aim for high paying tier 1,have started my dsa placement prep as they say it's better to start early and that's going pretty well,but my worry is since i have an 8.4 will that hinder my oppurtunities ,i should get it to 8.5,idk if i can push it to 9 or not,have we seen people w such a gpa securing high paying t1's? what's the approach for such roles?",
  "metadata": {
    "root_comment_id": "neicy3s",
    "post_id": "1niff36",
    "author": "Regular-Beautiful-71",
    "url": "https://www.reddit.com/r/PESU/comments/1niff36/placements_help_to_on_placement_prep/",
    "permalink": "https://reddit.com/r/PESU/comments/1niff36/placements_help_to_on_placement_prep/",
    "score": 10,
    "upvote_ratio": 1,
    "created_utc": 1758023909,
    "flair": "Placements 🤑",
    "nsfw": false
  },
  "comments": [
    {
      "id": "neioaqy",
      "body": "Make sure to get atleast 8.5; 9 is the safest zone, with 8.5 you can sit for 80-85% of companies as per current trend\n├── Wat abt 8 😭\n│   └── 70-75% only as per the current trend; As your batch size is very huge it can even go towards 65-70\n└── where do we do sql from?\n    └── There are many sql questions in leetcode itself, you can practice from there\n        └── thank you sm!"
    },
    {
      "id": "nej4lp5",
      "body": "9-9.1+ is the safest GPA to have. You can still push it there is enough time"
    },
    {
      "id": "nekpqim",
      "body": "You're in a pretty good spot i would say so don't worry about gpa that much, try keeping it above 8. I got a tier 1 offer this year with a gpa of 7.5 so as long as it's 7+ you will have opportunities come your way. DSA and SQL are what you need to clear the interviews afterwards so focus on that and also this is my personal belief but you should also focus on your communication because if you're not able to convey your methods and understanding to the recruiter it's kinda pointless even if you have 9.5"
    },
    {
      "id": "neo1vrh",
      "body": "I’ll go so far as to say that if you are maintaining a GPA above 8.5, you are eligible for (almost) all the tier 1 companies.\n\nNow, don’t sweat the placement process already. Focus on building relevant skills. It’s great that you have started practicing DSA concepts - keep doing that.\n\nTry to build a strong network. Reach out to seniors, alumni, professors for opportunities.\n\nIdeally, if you manage to land a decent internship in 3rd year, try to convert that to a full-time offer so that it’s one less thing to worry about"
    }
  ]
}