{
  "id": "1nigkzd",
  "title": "[Rant] CGPA causing me a lot of stress.",
  "content": "I’ve had a mediocre start with a GPA of 8.81 in my first two semesters. I want to improve in 3rd sem but unlike the first 2 sems I don't know what my strong subjects and weak subjects are just yet. I'm also very scared of the fact that I might screw up ISA-1 terribly and end up with less than 25-30 in all subjects and this is causing me to lose a lot of sleep everyday. I don't think I have written an ISA/ESA without being super stressed out and anxious causing me to be sick prior to the exams and this has made me come to loathe the week leading upto these tests and the tests themselves.\n\nIs there anything I can do reduce this anxiety and what can I do to ensure I can cross 9 ish gpa by the end of this year? Thanks a lot guys.",
  "metadata": {
    "root_comment_id": "neilexo",
    "post_id": "1nigkzd",
    "author": "DurianFriendly6901",
    "url": "https://www.reddit.com/r/PESU/comments/1nigkzd/rant_cgpa_causing_me_a_lot_of_stress/",
    "permalink": "https://reddit.com/r/PESU/comments/1nigkzd/rant_cgpa_causing_me_a_lot_of_stress/",
    "score": 0,
    "upvote_ratio": 0.4099999964237213,
    "created_utc": 1758027047,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "neim4g2",
      "body": "![gif](giphy|YExAAySmC0I9u2TjKJ|downsized)"
    },
    {
      "id": "neimcql",
      "body": "![gif](giphy|YExAAySmC0I9u2TjKJ|downsized)"
    },
    {
      "id": "neimmfu",
      "body": "It wont matter after a few years. Unless you want that CNR/MRD money 💴💰\n├── i want to try for masters after few years of working , specifically an mba from a decent school so im scared  😭\n│   ├── Trust me \nI know people with 8 GPA’s who attended top MBA colleges across the world\n│   │   └── thanks for the info!\n│   └── If you’re interested in doing an MBA in the US, your GPA is already perfectly fine for top programs. Maintain it but you main focus would be on placements and building up top tier work experience over 3-4 years as well as a great GMAT score.\n\nI am in the second year at a good MBA program here in the US and my CGPA was 8.73. Didn’t affect me much.\n└── It does matter in the placements season though. A 9.1+ is required to maximise your opportunity in all the companies\n    └── Placements are a mirage. There are a billion opportunities out there. Only thing that matter is how well you code bud. An 8.5 GPA is more than enough."
    },
    {
      "id": "neimoc5",
      "body": "Are u sitting for campus placements?\n└── i'm in second year but i will be sitting for campus placements\n    └── Then u shouldn't have to worry tbh.\nMost companies have very minimal gpa requirements.\nI asked cuz I heard only if one wanted to pursue masters would they really have to concentrate on maintaining a high gpa\n        ├── but i do want to do an mba after working you know so i'll need a high gpa regardless\n        │   └── Oh ok.\n        └── It is still better to have 9.1+. If the company has a gpa cutoff you are effectively competing with lesser people so it maximises your chance of getting placed\n            └── i heard gpa cutoffs were pretty minimal tho, im talking 7 or 8 at max"
    },
    {
      "id": "nein260",
      "body": "Relax and study, worrying will only fuck your gpa\n└── 😭 don't understand why i get so stressed out tbh man"
    },
    {
      "id": "neipiw0",
      "body": "Hey op dont mean to make light of your situation, hope you get through it and do good in the Isa, but what the fuck 8.81 is mediocre!?!?\n└── 2 of my close friends have 10 gpa and the other 3 are 9.5 gpa holder so ofc i feel like its mediocre noo?? 😭😭"
    },
    {
      "id": "nejcpbm",
      "body": "If its abt stress and anxiety: Try breathing exercises or listen to music. I usually just write when I face something similar. Its usually a personal choice. Try doing stuff that makes you happy."
    },
    {
      "id": "nek3hkm",
      "body": "Just try studying bro, worrying makes it worse, you feel like every 10 mins is time wasted and then think about the time wasted, then it slows you further. So, just chill and accept that atleast some time may get wasted"
    },
    {
      "id": "neq6ps8",
      "body": "Bro respectfully speaking fuck off\n└── you could have just scrolled down man.. commenting after 2 days telling me to fuck off?? really?"
    }
  ]
}