{
  "id": "1nj4au7",
  "title": "[Placements] So it's officially over for us",
  "content": "Most of the tier 1 companies have came and recruited and I think there will be 10-20 yet to visit who will be hiring atleast one student.and the rest will just conduct a test and go as there is no 9+ gpa students left. tier 2 is my only hope now. This is so fucked man.i guess i should have studied more and practiced how to get lucky these years.",
  "metadata": {
    "root_comment_id": "nenldjc",
    "post_id": "1nj4au7",
    "author": "gfddtggdergv",
    "url": "https://www.reddit.com/r/PESU/comments/1nj4au7/placements_so_its_officially_over_for_us/",
    "permalink": "https://reddit.com/r/PESU/comments/1nj4au7/placements_so_its_officially_over_for_us/",
    "score": 73,
    "upvote_ratio": 0.9399999976158142,
    "created_utc": 1758085723,
    "flair": "Placements 🤑",
    "nsfw": false
  },
  "comments": [
    {
      "id": "nenmavp",
      "body": "Shanti bro shanti we will get placed, luck is an important factor, but i feel there is some hope"
    },
    {
      "id": "nenmvjj",
      "body": "What do u think, u should have done more??Like in what year u should have studied more?\n└── I don't even know this process is so fucking random. I used what i studied like 5% through the entire process.it doesn't really matter at this point.but I do suggest start from 1st year and hope that you will get lucky.maybe the process wouldn't be so fucked up for you maybe only the deserving ones get selected so start preparing from now I don't think dsa shit will make sense in another 4 years"
    },
    {
      "id": "nennst8",
      "body": "It"
    },
    {
      "id": "nenoosm",
      "body": "Bro, don’t lose hope. Many companies are still yet to come. Remember, this isn’t the end of life, jobs are just one path. You can always explore business and many other opportunities too."
    },
    {
      "id": "nenu4rt",
      "body": "I know it seems bleak, but its still pretty early in the placement process. We had T1 companies visiting even in the even semester. Just keep practicing and working hard. Eventually it will work out for you, the same way it has worked out for your seniors. As I said in another older comment, placements is a marathon. You cannot give up in the middle, you need to keep going until you reach the finish line. Some people start closer to the finish line and win early, some take more time. You cannot control how the companies will shortlist, but you can control how well you stand among your peers. Crying over what you should have done is futile, instead focus on what you can do starting from today to improve your odds.\n└── What do you mean keep working hard \nI did practice leetcode but fucked leetcode easy ,\n\nSo please define working hard\n    └── If you worked hard but are still struggling with solving easy questions, it means you aren't working smart enough. It does not matter if you put in 100x more effort than the other guy if your approach is incorrect. Some advice in life: when you see yourself putting in efforts but not seeing results, its often best to sit down and introspect. You need to figure out why you aren't doing well. Sometimes, you need to switch your strategy, sometimes you need to test yourself more in challenging environements, sometimes, you need to put in more work. So if you see yourself struggling with leetcode easy, make a list of all the problems you failed to solve, find a pattern, see what type of questions you are struggling with and work on it. Blindly putting effort without a plan is as good as not putting in effort."
    },
    {
      "id": "nenuhb0",
      "body": "Lol I flunked 11 to 12 interviews before I got an offer\n└── Which batch?\n    └── 2022 .\nI got placed during mid-October.\n        └── 2021 scenes were wayyyy better than how it is now bro sadly"
    },
    {
      "id": "nenv3ym",
      "body": "Try to connect with Alumni offline Or through LinkedIn. You can by-pass the GPA requirement too :P"
    },
    {
      "id": "nenw722",
      "body": "Are there any students who didn't get a good gpa but still are placed in T1\n└── Yess"
    },
    {
      "id": "nenwjli",
      "body": "why do these fuckers still ask for 10th and 12th . its pretty depressing\n├── Yeahh idk why they are considering it.  \nBecause of it i am missing most of the companies.  \nI am regretting now taking CBSE fckin no use\n├── I had 72.2% in cbse how much problem will I face 👀\n└── can you breif how they taking grade of 10 and 12 th and why"
    },
    {
      "id": "nenx7k0",
      "body": "There are still 70 + ppl above 9 gpa yet to be placed"
    },
    {
      "id": "neo00in",
      "body": "Bruh still 80+ 9+ gpa yet to be placed .....and its still pretty early dont lose hope"
    },
    {
      "id": "neo3c4r",
      "body": "Fellas, don't lose hope. Attempt for every company if you clear the criteria. There is more luck involved than you think. You just need to get one or two out of dozens of companies. Remember, it's a numbers game."
    },
    {
      "id": "neo7z1p",
      "body": "My guy, it's still September. The peak is usually around October."
    },
    {
      "id": "nep383m",
      "body": "Don't lose hope, buddy, eventually one of the interviews will click, till then you have to keep your head up and keep trying."
    },
    {
      "id": "neq1915",
      "body": "Don’t look at it that way.\n\nThere are people from last year batch who got placed in good T1 companies even in dec, jan, feb and many of them didn’t even have 9+ I think. So even if it feels annoying not getting shorlisted, stay patient and keep putting in the work. \n\nThere’s no point about being sad that u didn’t grind enough now in the past, don’t waste that time/energy thinking about all that; there are more imp things to pay attention to now in the present.   \n\nAlso there’s no downside of being optimistic rn, only real downside is slipping into pessimism , so might as well chose to be an optimist and keep grinding :) \n\nGood luck and get it💪"
    }
  ]
}