{
  "id": "1nj4j37",
  "title": "[OffTopic] About unofficial freshers",
  "content": "Anybody need extra ticket for unofficial freshers which is on 18th of sept i.e. tomorrow as i have an extra ticket for that.\nIf anyone of you need that ticket pleaseee let me know ASAP!!!!!!!!\nIt is urgent…!!",
  "metadata": {
    "root_comment_id": "nenmz18",
    "post_id": "1nj4j37",
    "author": "CosmicSeducer",
    "url": "https://www.reddit.com/r/PESU/comments/1nj4j37/offtopic_about_unofficial_freshers/",
    "permalink": "https://reddit.com/r/PESU/comments/1nj4j37/offtopic_about_unofficial_freshers/",
    "score": 1,
    "upvote_ratio": 1,
    "created_utc": 1758086536,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "nenn3jf",
      "body": "ticket for what?\n\nas far as i remember we didnt have any ticket thing for our freshers thing\n└── No its unofficial freshers outside the campus\nSome seniors are organising this.!\n    └── all our seniors told those thing are fishy and kinda risky 💀\n        └── But this is legit as they have came to every room to announce this\n\nAnd made some posters and you can book on sortmyscene app which made me believe its real\nSo yeah it is most probably real tho\n            └── But the thing is i literally bought 2 (one for my friend) and now he is not coming as he has chess trials tomorrow. So i have one extra and i have paid the money so idk what to do\n\nThat is why this is urgent"
    },
    {
      "id": "nennx4r",
      "body": "Dear Students,\n\nIt has come to our notice that a group of students claiming to be higher semester students are hosting a 'Freshers' Party', in private places. \n\nPlease note that all such activities are illegal and have no approval from the University.\n\nPlease do not be part of such activities which could put you in a wrong group and lead you to a situation of no return. Such activities are normally organised by a set of people trying to collect money from gullible students and in places which are unsafe and dangerous.\n\nWe have noticed such activities in the past and have reported the same to the concerned authorities, who have taken effective steps to stop them from happening, where our own students would land up as victims.\n\nThe Vice-Chancellor, Registrar and Dean, Student Affairs, PES University, have been informed about this activity. Parents are also being informed about this activity in a separate communication.\n\nStay informed, keep away from these nefarious activities and stay safe.\n\nRegards,\n\nPES University"
    }
  ]
}