{
  "id": "1nj5nkk",
  "title": "[Placements] To Those Feeling Low During Placements",
  "content": "If you're feeling low about placements, just remember more companies are yet to come. Sometimes the process is so random that a rejection isn’t really your fault.\n\nNot landing an on-campus job isn’t the end of the road. People go for higher studies, build businesses, or find great opportunities off-campus all the time.\n\nEventually, we'll all figure it out, trust the process.",
  "metadata": {
    "root_comment_id": "nenubsw",
    "post_id": "1nj5nkk",
    "author": "Insane_kid5",
    "url": "https://www.reddit.com/r/PESU/comments/1nj5nkk/placements_to_those_feeling_low_during_placements/",
    "permalink": "https://reddit.com/r/PESU/comments/1nj5nkk/placements_to_those_feeling_low_during_placements/",
    "score": 78,
    "upvote_ratio": 0.9900000095367432,
    "created_utc": 1758090511,
    "flair": "Placements 🤑",
    "nsfw": false
  },
  "comments": [
    {
      "id": "neo93il",
      "body": "OA is the biggest joke they are making on us...\n└── Should just conduct every OA in college"
    },
    {
      "id": "neome9r",
      "body": "Don't know what to say, just felt bad when jawahar displayed core placement stats..... They could only place 55 students from 2025 batch. Disappointing part is that he did orientation events in every semester but never displayed core placement stats .... We saw it only after coming to 4 th year.... He just manipulated us(Ece students)\n├── There is a clear bias towards cs xD\n│   └── This bias has been there in market since 1990's bro.....cs grads are needed more thasall...\n├── 55 are the no of companies that came looking for eee ece and mech students\n│   └── Nope, number of job offers.... It was clearly mentioned in the slide\n│       └── damn they lied to us 3rd years lmao coz it said companies\n│           └── actually i swore i heard jawu say students but my friends all said that it was written as companies\n└── wasnt that known tho, i remember seeing ece stats when joining and core was at 10%, most get IT and all tho"
    }
  ]
}