{
  "id": "1njyp9x",
  "title": "[Question] I don’t know coding, which coding club do I join to learn??",
  "content": "Hi I’m a first sem cs-aiml student. My only prior coding experience is java in grades 8-10. But now I see everyone around me participating in hackathons left right and centre and I’m getting a bit anxious. Please tell me, how do I start? From where do I start? Are there any clubs that are good for beginners like me? What do I do? Please help",
  "metadata": {
    "root_comment_id": "netyuu3",
    "post_id": "1njyp9x",
    "author": "imchuckbass_07",
    "url": "https://www.reddit.com/r/PESU/comments/1njyp9x/question_i_dont_know_coding_which_coding_club_do/",
    "permalink": "https://reddit.com/r/PESU/comments/1njyp9x/question_i_dont_know_coding_which_coding_club_do/",
    "score": 23,
    "upvote_ratio": 0.9200000166893005,
    "created_utc": 1758169243,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "neu34p0",
      "body": "+1"
    },
    {
      "id": "neu4sg8",
      "body": "+1\n└── If you want to be notified, follow the post (you can find the option on your app/website) instead of posting an unrelated comment."
    },
    {
      "id": "neu53aq",
      "body": "+1"
    },
    {
      "id": "neu6max",
      "body": "Coding clubs won't really teach you programming basics, they're more focused on tech events for the campus. If you are starting from absolute scratch, read the FAQs or the other guide I put up for freshmen. TLDR - CS50 and MIT Missing Semester are the best courses to begin with. One teaches you programming basics, and the other focuses on picking up software engineering tools and skills for the industry. Odds are, as long as you lay attention in your python class it's more than enough and you don't need the CS50 course, but I would still recommend the MIT course regardless. \n\nAlso, there is an open source community where a few of the alumni and current students have set up, called the PESU Dev Group. We make open source tools for the community at PES, and also help mentor students. There are freshmen from your batch actively taking part and contributing, and a few members have even gone on to take part in hackathons after learning stuff on this journey. Highly recommend joining us if you're interested in being part of a larger tech community, building some cool stuff and having a fun time in general :))\n\nFor more info: search the subreddit (or my older comments) for \"Joined X year post\", and go through FAQs for dos and don'ts as a freshman.\n└── I feel like there’s not enough awareness about competitive programming at PES, even though it can be really useful for CS students. I think everyone should at least give it a try once and see if they like it. There should be a proper club for it, one that actually has contests, sessions, and seminars, not just a dead club like AlCoding.\n\nAlso, companies do value CP and whatever you’ve achieved in it. It’s definitely a plus point, and it also prepares you for those unexpected questions in online assessments and sometimes even interviews at big tech companies. On top of that, it just makes you better at problem-solving, which, let’s be honest, is written in the first line of almost every job description.\n\nI saw people asking which clubs actually “help” with placements, and I think it’d be great to have one that really does make a difference. A place where people can practice, learn stuff that’s never going to be taught in regular classes, and push each other to get better. That’s something I never got, but honestly, I really needed it.\n    ├── AlCoding used to be really popular during my time. It had its fair share of problems (elitist, restricted membership and events, etc), but it did have a good goal in mind and the occasional open contests were pretty helpful in giving you an idea of where you stood in your batch. It also gave people a quick taste of how placement season tests would be. \n\nAlthough I'd argue that the number of companies who actually care about your CP accomplishments today are extremely few, and the entire hiring landscape has shifted drastically towards how well you can fit into existing teams rather than how quickly you can reverse a linked list. Just having \"rank X\" on your resume isn't really going to attract any attention nowadays, what actually matters today is the experience you've gained. Especially as you progress through the years in your career, DSA will take a back seat and eventually disappear. However yes, CP is definitely useful from an overall perspective since it obviously does make OAs and DSA driven interviews easier, and also helps you sharpen your problem solving skills and intuition.\n\nThat being said, the problem is that people now relate CP only with placements and it's kind of lost its charm. You don't get to see people doing CP just for the pure joy of doing it anymore. People grind it for a couple of weeks/months during placement/internship season and they drop it afterwards, just like how they grinded PCM for JEE. It's currently only seen as another entrance test, not a field of its own. It's a shame because as much as it wasn't my cup of tea, I did have friends who genuinely loved it for what it was but lost interest when they realised everyone around them was in it only for a better job. Hopefully clubs on campus can change that, but even then, it's the mindset that needs to change.\n    │   └── i agree, cp is a hobbyset in its own right, however it's a niche hobby and from what i can tell, it always has been, most people relate CP to placement tests because for most people, thats the only place they will really encounter it\n\nThat being said, i too would love to find more people with a geniune interest in competitive programming\n    ├── alcoding is a club, and just like any other cs club, suffers from the same beaurocratic issues that the college places upon it, i used to head it at some point, and they still do contests and events occasionally, and, although its not as perfect as i'd like it to be, i believe from a placement OA perspective, their contests are still a decent way to gauge were u stand in your CP trail\n    └── This 💯. Codechef ECC is revived this year"
    },
    {
      "id": "nf2abww",
      "body": "striver"
    }
  ]
}