{
  "id": "1nkg83p",
  "title": "[Discussion] Should i Participate in Hackathon as a Fresher????",
  "content": "I’m a btech cse fresher and as of now i don’t know a single language of coding. I have just started and like i have started from scratch. \nSo should i participate in hackathon rn or should i learn everything first and then go.\nSuch a silly question but i’m so freakin confused. Helpppp:///",
  "metadata": {
    "root_comment_id": "nexktpo",
    "post_id": "1nkg83p",
    "author": "CosmicSeducer",
    "url": "https://www.reddit.com/r/PESU/comments/1nkg83p/discussion_should_i_participate_in_hackathon_as_a/",
    "permalink": "https://reddit.com/r/PESU/comments/1nkg83p/discussion_should_i_participate_in_hackathon_as_a/",
    "score": 10,
    "upvote_ratio": 1,
    "created_utc": 1758220064,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "nexshss",
      "body": "There is no harm in participating,\nYour fresher years are there for you to explore things and hackathons are best for it, you get to meet new people, your potential mentors, you get to know a lot of stuff ...... its also a great oppourtunity to network with right minded people and find your interests. You also get to know about some brilliant ideas from other participating teams.....learn about different approaches that can be used in real world.\n\nI am currently in 4th year, and i regret a lot now about not taking part in hackathons from first year....i have took part in hackathons from my third year, i have missed so many opportunities by thinking that i need to learn more......you can just take part and do as much as u can...if your team gets selected.\n\nSo yeah just try participating in hackathons, if your team's problem statement gets selected, perform as much as u can. And take this as an opportunity to learn, grow, and create ur peer group and network."
    },
    {
      "id": "nf0l6qk",
      "body": "Yes, these are all good learning experiences walk around looking at other peoples projects and youll learn quicker. attend almost all the hackathons you can while maintaining GPA."
    },
    {
      "id": "nf0q6wg",
      "body": "Trust me if you keep waiting to be perfect and then join, ull keep waiting forever. The reason for participating in these hackathons is primarily to learn and not just win. I didnt know jackshit either, but i started participating from 1 st sem and made it a point to participate in atleast 1 hackathon every sem, and thats when i got my first win in the 4 th sem. So go to these hackathons to learn, make friends, explore ideas and most importantly eat free food :)"
    },
    {
      "id": "nf3s1sh",
      "body": "yes. i did 4 trips with college friends in 3 years by winning hackathons and getting scholarships."
    },
    {
      "id": "nfqbwml",
      "body": "Absolutely! Hackathons are one of the best ways to learn in my opinion. You don’t need to know everything before jumping in. If i were you, I’d join one now, even as a fresher.\n\nFor example, the VeChain global hackathon just started on Dorahacks— it’s online, has workshops, resources. that way you can learn alongside others instead of waiting until you feel “ready.” Most people pick up a ton just by building and collaborating.\n\nHere is the link if you're interested: [https://dorahacks.io/hackathon/vechain-builders/detail](https://dorahacks.io/hackathon/vechain-builders/detail)"
    }
  ]
}