{
  "id": "1nlyz0z",
  "title": "[Discussion] Poor handling of placements",
  "content": "Wanted to let everyone know how poorly they are handling placement at EC Campus.\n\nWe aren't getting mails for placements. That's all we want. Getting mails on time.\n\nBeing a CSE focused college for years and they still can't figure out how to send mails.\n\nEC Campus students have missed out on 5 companies. All queries are ignored. All emails are ignored. All efforts to ask for help are ignored.\n\nAll we get is being redirected to placement commitee for even asking to get mails on time.\n\nWe need to travel and hour away to ask these people to do their job properly. It is apparently on students to take time out and help them resolve their issues.\n\nDon't forget this is the same college which had 4 sucides in less than a year. How college addressed those? Blame it on us of course.\n\n\"Don't blame us if your girlfriend didn't wish you happy birthday\" - Our Estemmed chancellor\n\nBlatant disregard for students. It's utter shameful.\n\nPut aside the fact that they can't handle so many students in offline interviewes, refusal of so many companies to come due to mismanagement and insane amount of cheating happening in OAs.\n\nThey literally had one job and they keep fucking up. Fuck this shit.",
  "metadata": {
    "root_comment_id": "nf8xx8j",
    "post_id": "1nlyz0z",
    "author": "Enough-College-123",
    "url": "https://www.reddit.com/gallery/1nlyz0z",
    "permalink": "https://reddit.com/r/PESU/comments/1nlyz0z/discussion_poor_handling_of_placements/",
    "score": 3,
    "upvote_ratio": 0.8100000023841858,
    "created_utc": 1758376901,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "nf8yh1j",
      "body": "Did anyone receive KPMG OA Link??\nI've been mailing to placement office but there's no reply"
    },
    {
      "id": "nf8yqzz",
      "body": "Just go to campus man , idk why they fucking don't have a proper team for this .\nJust some boomers with ego handling this.\nAlso the core companies which come for ece and eee haven't showed up or these people are just doing some bs.\nSo many core companies came last year by this time came , this time it's worse"
    },
    {
      "id": "nf8ywi9",
      "body": "It’s bad enough that yall missed some companies but missing oracle and ibm when they are bound to hire 30 minimum combined is very unfortunate."
    }
  ]
}