{
  "id": "1nmiqpr",
  "title": "[Discussion] What's your favourite feature on pesuacademy",
  "content": "",
  "metadata": {
    "root_comment_id": "nfd7wb7",
    "post_id": "1nmiqpr",
    "author": "Anga205",
    "url": "https://i.redd.it/bp2uaggz4gqf1.jpeg",
    "permalink": "https://reddit.com/r/PESU/comments/1nmiqpr/discussion_whats_your_favourite_feature_on/",
    "score": 152,
    "upvote_ratio": 0.9800000190734863,
    "created_utc": 1758429277,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "nfd89vv",
      "body": "Best feature is when it makes you download the shitty ppt presentations with gibberish file names instead of just displaying it in the course portal\n└── AND HALF THE TIME THE PPT CANT EVEN BE OPENED CUZ ITS CORRUPTED\n    └── If someone wants to take the initiative, I’d suggest creating a GitHub repository and uploading all the course presentations there. Organize them by course, semester and the major\n        └── those already exist, in fact people have made entire websites just for making the study material more accessible, like betterpes and (insert shameless self promo music) [angadrive](https://drive.anga.codes/collection/?id=UP3dwiNBROnrnHu)\n            └── i know an arch club member when i see an arch club member"
    },
    {
      "id": "nfd92ge",
      "body": "The one where when you skip to a next topic when you're already in a topic's page and it decides to skip a random number of topics but never seems to go to the actual next topic🤗\n├── see now thats just _bad_ web design\n└── in first sem epd i missed a topic thanks to this amazing feature."
    },
    {
      "id": "nfd9kb6",
      "body": "When it shows me another person’s ESA results and gives me a heart attack\n└── that HAPPENS?!?\n    └── YEAH it happens sometimes, before our actual results come out\n\nI remember one time it showed me a 2024 passout’s results, and they had failed nearly everything. The relief i felt when I realized it wasn’t mine\n        └── thats WILD, good on u man\n\nme personally, i only ever fail _half_ of my subjects\n\nmostly because im busy doomscrolling reddit instead of studying for tomorrow's ISA\n            └── >mostly because im busy doomscrolling reddit instead of studying for tomorrow's ISA\n\narent we all"
    },
    {
      "id": "nfdb09t",
      "body": "Nah , the app has better features. How smoothly you can access the course content on the mobile app is mind blowing. Also I love it when I open the app and I am logged out and need to re login.\nNot to mention the spam notifications I get OMG I LOVE THOSE.\n\n\nThe seating info? They choose to not update it on the app and I specifically need to use the website to check it (haha in that way I open not one but two of pesuacademy’s wonders )\n└── omg yea the mobile app is its whole own can of worms"
    },
    {
      "id": "nfdc0u6",
      "body": "how about that one feature that allows you to open pesuacademy inside the pdf viewer for a inception kinda thing\n└── THAT SHIT IS COOL AF"
    },
    {
      "id": "nfdcl6q",
      "body": "The best feature is clearly opening another Pesuacadamy in the PDF viewer I have record of stacking 4"
    },
    {
      "id": "nfdmdst",
      "body": "Best feature is the To Be Deleted Unit in DBMS :D"
    },
    {
      "id": "nfdnx76",
      "body": "it flashes me with results randomly 😔"
    },
    {
      "id": "nfdr4ow",
      "body": "All the best features already mentioned above I thought those “ best features “were due to system specific bugs.But the best features for me is when i open slides from my phone only first page would open"
    },
    {
      "id": "nfdv583",
      "body": "the best feature is not being able to go to a previous page by pressing the back arrow on my browser, it's a really cool feature! I also love it when it opens the login portal for no reason and as i login again it says invalid CSRF token, thats like so cool ngl, i love pesu academy i wish i could make something so cool for a hackathon or something"
    },
    {
      "id": "nfdw0f6",
      "body": "One of the coolest features is how the mobile app barely gives any irrelevant notifications or spams the same notification 30-40 times.  Glad that they've kept user's comforts in mind."
    },
    {
      "id": "nfea7x7",
      "body": "my favorite feature was everyone got out of out in one isa (DAA)."
    }
  ]
}