{
  "id": "1nmv2du",
  "title": "[Question] electives for 5th and 6th sem",
  "content": "can aiml students pick cse electives and vice versa?",
  "metadata": {
    "root_comment_id": "nffmgva",
    "post_id": "1nmv2du",
    "author": "Regular-Beautiful-71",
    "url": "https://www.reddit.com/r/PESU/comments/1nmv2du/question_electives_for_5th_and_6th_sem/",
    "permalink": "https://reddit.com/r/PESU/comments/1nmv2du/question_electives_for_5th_and_6th_sem/",
    "score": 3,
    "upvote_ratio": 1,
    "created_utc": 1758468820,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "nffs8z7",
      "body": "AIML has 3 verticals, CSE has a few more (I think). Both have different ones , but CSCS (connected systems & cyber security) is the only common vertical between the two departments. You can't choose their electives and they can't choose yours. But CSCS is common and available to both.\n├── https://preview.redd.it/ioesgf18mjqf1.png?width=478&format=png&auto=webp&s=cf97714b4bcaf47a3cb0288d928fbc2d3cfa93e3\n\nim talking about these so aiml students and cse will not the an common electives in 5th and 6th sem? sorry but i have no idea about this\n└── and if you could tell me what verticals are"
    },
    {
      "id": "nffxdqz",
      "body": "Both cse and aiml have some common electives ( i.e cryptography, cns , etc ) but rest are something cse students can't take."
    },
    {
      "id": "nfg29t5",
      "body": "Basically there are 3 verticals for both cse and aiml. Assume each vertical has 3 subs, so cse and aiml have 9 each. Cse and aiml have only 1 vertical in common so basically only 3 subs common and remaining 6 are different, and u have to choose one from 9 of these subjects. This is all for 1 elective of 1 sem. The other elective's subjects also come under the 3 same verticals. If you take subjects from the same veritical for both electives for both the sems, youll get a specialization for that vertical. Hope you understood this messy explanation\n└── yup i did thank you so much,so it is possible for an aiml student to have 100% same subjects as cs right?\n    ├── \\*if they choose the common vertical that is\n    └── Yes you can have the same subs as them, the common vertical is cybersec domain btw"
    }
  ]
}