{
  "id": "1nnk4je",
  "title": "[OffTopic] What it Truly Means to be the Pride of PESU",
  "content": "reply to u/perkyclown 's post:\n\nTo be the Pride of PESU is not a goal, it is not a rank, it is not even something you can apply for with a Google Form. It is a calling. A destiny. You don’t chase it — it chooses you, like a WiFi connection that somehow works only on your device while everyone else is stuck at “can’t connect.” The Pride is not measured in marks, CGPAs, or attendance percentages… it is measured in **vibes per second**. It is when you walk into class five minutes late and the professor still nods like you were meant to be there. It is when people laugh at your memes more than they cry about their internals. It is when even your most questionable life choices start looking inspirational in hindsight.\n\nThe Pride of PESU is not about being perfect — it is about being **legendary**. Your existence becomes folklore, your name whispered in corridors, your Reddit posts screenshotted into WhatsApp groups, your aura carried on the wind like the smell of samosas outside campus. You don’t live as the Pride. You **become** the Pride. And in that moment… you realize Rowlet didn’t just set the standard. Rowlet *is* the standard.",
  "metadata": {
    "root_comment_id": "nfkzbf9",
    "post_id": "1nnk4je",
    "author": "FireOverWater312",
    "url": "https://www.reddit.com/r/PESU/comments/1nnk4je/offtopic_what_it_truly_means_to_be_the_pride_of/",
    "permalink": "https://reddit.com/r/PESU/comments/1nnk4je/offtopic_what_it_truly_means_to_be_the_pride_of/",
    "score": 39,
    "upvote_ratio": 0.8500000238418579,
    "created_utc": 1758541246,
    "flair": "Meme :snoo_dealwithit:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "nfkzbf9",
      "body": "Hi u/FireOverWater312, your post was temporarily held for moderator review because it mentions topics related to admissions, which automatically flags it for review. \n\nPosts involving admissions are treated with particular care on this subreddit due to the high potential for misinformation during high-stress times of counseling, seat allotment and critical decision-making periods.\n\nUnfortunately, we've seen how easily inaccurate or speculative advice spreads in such environments. Users frequently make major decisions about their future based on what they read online, often from fellow aspirants who may not have access to accurate information. This leads to confusion, false expectations, and in many cases, regret. Since this is the first year PES is using JEE and CET for admissions, the risk of misinformation is even greater and there simply isn't enough reliable historical data for anyone to make trustworthy predictions or statements.\n\nFor these reasons, all posts that fall under the category of admissions must go through moderator review and fact-checking before they are visible to the community. This is not meant to restrict discussion but to ensure that the advice shared here is grounded in verified knowledge and does not unintentionally mislead other students. Posts that speculate on admission procedures, branch allocation, share personal rank-based predictions, or solicit counseling advice from the crowd will generally not be approved, unless they clearly offer helpful, factual insights without creating confusion.\n\nIf you're looking for real data, refer to this post: [Which branch can I get? (PESSAT 2022 cutoffs)](https://www.reddit.com/r/PESU/comments/1ct5ujc/which_branch_can_i_get_at_no_dont_make_such_posts/)\n\nWe appreciate your understanding and cooperation. These policies are designed to protect not just you, but the entire community, from the harm that misinformation can cause during such a critical time. Please respect the rules and seek guidance from trusted sources. Attempts to bypass this filter may result in a 30-day ban or longer for repeat offenders.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PESU) if you have any questions or concerns.*"
    },
    {
      "id": "nfl16bh",
      "body": "holy glaze"
    },
    {
      "id": "nfl2bug",
      "body": "my glorious king rowlet ftw"
    },
    {
      "id": "nfl5d11",
      "body": "![gif](giphy|du4D0b0HWgxGg)"
    },
    {
      "id": "nfl6nyw",
      "body": "![gif](giphy|RUQL7vIPJZ5xoDDcqV)"
    },
    {
      "id": "nfl7ket",
      "body": "get off the dih vro"
    },
    {
      "id": "nfla6dh",
      "body": "https://preview.redd.it/fga401anqpqf1.jpeg?width=1080&format=pjpg&auto=webp&s=c90dbecf4f3ec2ce04e7cdb248f046592b814078"
    },
    {
      "id": "nflfxc9",
      "body": "https://preview.redd.it/qhpumhkiwpqf1.png?width=750&format=png&auto=webp&s=802f6c723babe42a50b7baed126477dd3daafae1"
    },
    {
      "id": "nflmz13",
      "body": "I have a question - what the fuck?\n├── A good start to the day then?\n└── gng i would be happy if you answered my question ):\n    └── Which one\n        └── the one i posted"
    },
    {
      "id": "nfln4il",
      "body": "Jawahar wont let u touch it bro"
    },
    {
      "id": "nfln8e4",
      "body": "ts not tuff gng 🥀"
    },
    {
      "id": "nfls0f3",
      "body": "https://preview.redd.it/nry62y9w7qqf1.png?width=196&format=png&auto=webp&s=20b1215bb8c35cc3c377f3ac6c84f4cdd3573439"
    }
  ]
}