{
  "id": "1nnpwj7",
  "title": "[Placements] Guys your opinions on this",
  "content": "",
  "metadata": {
    "root_comment_id": "nfm6pcd",
    "post_id": "1nnpwj7",
    "author": "Bothumannn3",
    "url": "https://i.redd.it/fes8ruzlwpqf1.jpeg",
    "permalink": "https://reddit.com/r/PESU/comments/1nnpwj7/placements_guys_your_opinions_on_this/",
    "score": 81,
    "upvote_ratio": 0.9300000071525574,
    "created_utc": 1758555592,
    "flair": "Placements 🤑",
    "nsfw": false
  },
  "comments": [
    {
      "id": "nfmbn2f",
      "body": "Deserved.\n├── Pes should ask companies to do this\n│   ├── It already has. Bout time companies recognised this. People's career are at stake because of suck stupid people\n│   │   └── Like, istg, there should be a Nepal happening in college towards such people. Burn them. Humilitate them in public. Let them reap what they sow.\n│   │       └── Lee Kuan Yew those mfs for all I care.\n│   └── Lol pes has 0 authority in front of companies\n│       └── Ah yes let's blame the company for taking corrective measures and penalizing malpractice instead of students for cheating. Lovely take.\n│           └── Okay unc.\n│               ├── Cba bitchass, might be better if you let the company do whatever they want for their own interest. No one cares about your disgruntled opinion of you not working hard enough for the job, and serve silver spoons and handouts to you. The world doesn't owe you shit, so stop being a bitch.\n│               │   └── OK\n│               └── It's easy to blame others instead of having accountability. The dude knew the risks and still cheated. Facing the consequences is something he 100% deserves to do as well. He's not sorry cause he cheated, he's sorry cause he got caught. The company is hardly to blame for penalizing malpractice; you don't like what they can potentially do? Don't cheat in their test. Very simple. It's like shooting yourself in the foot and blaming someone else for letting you take the shot.\n\nAnd yes, I am an unc, and old enough to distinguish right from wrong. Luckily my moral compass isn't broken even after 25 years of my life, can't say the same about yours, kiddo.\n│                   ├── Regarding the moral compass thing,good  companies make oas nowadays so tough that it's impossible to clear them without copying and those are having that so called moral compass are nowhere near to getting shortlisted. Sorry for the unc shit, it's just due to a lot of frustration and was rather spontaneous \n│                   └── Nowadays the good companies OAs are so tough that only a genius can solve them without destroying their \"moral compass\". Sorry for the unc shit btw , it was out of frustration and rather spontaneous \n│                       └── I think the problem is cyclic. People cheat -> companies make tests harder -> people cheat more aggressively. It's not an easy problem to solve overnight since one leads to the other. \n\nI know that honesty might not lead to results immediately, but I'd rather see a fellow junior being eligible for OAs/interviews, struggling but still giving their best and eventually getting placed rather than seeing them getting blacklisted by companies because they cheated. The only reason I keep incessantly warning is not because I don't want to see you guys succeed in life, but rather I think it's too early to make these kinds of avoidable mistakes and doom your corporate career at the age of 21-22. You don't want to be facing things like getting removed from placements, banned from certain companies and having issues with BGV just because of something as silly as this. And let's face it, the consequences aren't exactly easy to live with. \n\nYou kids are my juniors and my advice comes from a place where I want to see you guys succeed and grow in your careers and not fall into these tempting traps. Unfortunately many people take it the wrong way and think the reason I discourage cheating is because I'm always acting righteous (yes, cheating is definitely bad, but the consequences if you get caught are so much worse).\n│                           └── I understand but the frustration creeps in when most of the people ik have got placed with cheating in OA, and the interview is always so much easier than the oa so sometimes I think whether companies just want to test how street smart we are with the oa\n└── Nope. \n\nWhat if only OP got caught and many others who cheat, escaped? This, loophole ridden system, where selective few get caught later, creates a double confusion: If I don't cheat, others will and I will fail, but if I cheat, I might get caught and be blacklisted. \n\nInstead of catching, enforce better ways so that nobody is able to cheat, conduct tests in labs (with attendance), put questions and timer in such a way that nobody is able to click and gpt.....\n    └── Nah not sadistic enough. Mf gotta pay"
    },
    {
      "id": "nfmhoad",
      "body": "Of course, when I mentioned the consequences of cheating in my older comments and how it could ruin you, people jumped in to claim that cheating should be normalized and justified it, asserting that whatever I said was being pulled out of my ass. Now when people actually read about what *could* happen, nobody wants to say anything about it. I swear some of y'all treat me as if I don't have a clue what I'm talking about lmao. \n\nAs I said previously, if companies do want to escalate things, they will. There will always be consequences for cheating, it's up to the company if they want to execute those actions. It's not that companies cannot identify who has cheated their way through tests/interviews, most don't want to go through the hassle and would prefer to just not hire anyone. But if God forbid they actually *want* to penalize you, you are in deep shit my friend. Company blacklists actually exist, can't comment on the legal procedures; but eventually you're going to see yourself getting desk rejected from anywhere they do a background verification on you and this shows up. \n\nCheat if you want, I couldn't care less if you get blacklisted or unemployed. My intention was to only make you guys aware of real world consequences. It's your decision if you're willing to risk the reward, which IMO, isn't worth it if you get caught. Don't crawl into my DMs asking for help when I've been warning about the consequences from months in advance.\n├── W comment ngl\n└── its a lose lose situation as i see it. dont copy and be left behind by those who did and get shortlisted, or do copy and possibly risk getting blacklisted.\n    └── That's a fair take. Although I would argue that the risk of the latter (blacklisted and potential unemployment) is far worse than the risk of the former (getting placed much later at a lower tier company). Although people will only stop cheating once more companies start penalizing students.\n        └── valid, thing is ive hardly heard anybody getting any kind of penalty for cheating, theyre hardly ever caught. that autorabbit guy isnt the norm. When u see these other guys at least getting shortlisted in placement season while you who honestly solved wouldnt even make it past OAs, kinda almost incentivizes cheating and unethical practices.  \n  \nthis is what i was told by my seniors anyway.\n            └── What this company did isn't the norm; however, the usual strategy is to filter candidates out since it's cheaper and quicker. I understand the incentive given that this has gone unchecked, but sooner or later someone from PES will cause this to happen at our campus and thats when realization will hit."
    },
    {
      "id": "nfmi6yn",
      "body": "PES won't give a fuck about cheaters. They only want people to get placed, through whatever means possible.\n└── Issue is, companies can very well choose not to visit for placements if there are high occurrences of malpractice involved. I think I posted this on the other thread, but I came across a post on either the BMSCE/BMSIT sub about their placement cell releasing a list of companies that had chosen to blacklist the college for malpractice the previous year. \n\nSo yes, if PES decides to leave this go unchecked, we will reach that stage soon. Either the company, or the college, needs to do something about this. Both have the power to do it, but the college is the interface and would be easier for them.\n    └── Not from pes but iiit sri city .\nLast year a single student was caught cheating during an online coding interview and guess what the company banned our college, this company used to take like 20 students which is a good amount for a college with batch strength of 400\n        └── 20/400 is 5%; calculate the same % for PES and it comes out to be \\~60 kids. That is insane. Which company is this btw? Sharing this info would help others here."
    },
    {
      "id": "nfmyyd4",
      "body": "Plagiarism won't take you through miles. Read this line while attempting a online test"
    },
    {
      "id": "nfp878n",
      "body": "Its simple , most companies simply **afford to not care if they find out**, they have better things to do.  \nSome Blacklist you , Some of them may take legal action. Most of them dont care.  \nThis also Brings a lot of \"Internship only\" offers , which will only be converted based on performance."
    },
    {
      "id": "nfpudfj",
      "body": "I had gone to give meesho test for BA role.....internet was nor working,they put us in seminar halls. There people were actively copying from chatgpt .There was no invigilation also. I even know one girl who got into interview round too, eventually she got into a very good company. First pes should identify cheating in offline tests snd then smtg can be done about online tests"
    }
  ]
}