{
  "id": "1nqelye",
  "title": "[Placements] Not one person made it past round 1 of confluent lmao 😭😭😭😭 they decided to cancel hiring after seeing round 1 results.",
  "content": "Allegedly , they asked everyone to leave after round 1 of confluent. I guess this is what happens when you keep a 7+ gpa cutoff with online exam for a 33.5 lakh base company. A waste of time for all involved. \nHilarious tho ",
  "metadata": {
    "root_comment_id": "ng67sgk",
    "post_id": "1nqelye",
    "author": "Revolutionary-Fox794",
    "url": "https://www.reddit.com/r/PESU/comments/1nqelye/placements_not_one_person_made_it_past_round_1_of/",
    "permalink": "https://reddit.com/r/PESU/comments/1nqelye/placements_not_one_person_made_it_past_round_1_of/",
    "score": 101,
    "upvote_ratio": 0.9599999785423279,
    "created_utc": 1758825009,
    "flair": "Placements 🤑",
    "nsfw": false
  },
  "comments": [
    {
      "id": "ng6a6o8",
      "body": "Missed the part where the 7+ GPA requirement is a problem.\n├── 7+ gpa isn’t a problem but when you combine it with online exam , it’s definitely a problem\n└── Trust me this never was a problem when cutoff was say 8.5 or 9+ \nAll companies chose a good no of peeps after interview \nThis has been issue most of the times when cutoff was 7\nEg. Uber and confluent\n    └── Yeah no the real problem is PES refusing to keep tests on campus (with actual invigilation)."
    },
    {
      "id": "ng6b77g",
      "body": "Another company that will never visit PES again.  \nThank you PES for increasing seats with dogshit infra, so that more cheaters can give us a bad image.\n└── They hired 6 last year and converted all of them too, so Idts they will stop coming but definitely a negative impression\n    ├── They have been visiting PES regularly for non-SDE roles. This was the only year they came for SDE role and we fucked up.\n    │   ├── Hey do you know much they pay for non-SDE roles?\n    │   └── And are they hiring for non-SWE roles too in PES?\n    │       └── Not this year , last year they did\n    └── Last year they didn’t hire Software Engineers from PES. This looks like Software Engineer compensation. I think other roles compensation is lesser, I maybe wrong though."
    },
    {
      "id": "ng79zrr",
      "body": "ofc what else is gonna happen when ppl shamelessly cheat OAs and interviews and think karma will never fuck them up"
    },
    {
      "id": "ng952kd",
      "body": "The DSA question was hard actually they didnt ask about resume, about their projects or any other skills.  \nFirst round straightup asked hard++ DSA question. Few of them answered with brute force method. But they wanted a optimised solution.\n├── On one hand that seems unfair since I believe technical skills are just as important but if the company is paying 33.5L per year , it’s fair that they have some insane standards, if they were smart they would have come at the start of the semester\n│   └── But its not fair judging someone by giving some hardest DSA question, he/she might be good in problem solving skills or leadership.   \nMan have to say because of this coding ai tools like Copilot, Trae and cursor legit i have forgotten how to code backend and stuff.   \nBut you the logic working and thats enough, if you understand whats happening and build stuff is good  \nThese companies should check that. Straight up a random ass tough dsa question and rejecting.\n└── My friend interviewed with them last year(Not PES).\nTheir first round - Hard DSA question\nSecond round - Concurrency\nThird round - HM interview\n\nHM interview is where they tell people to get lost if their resume isn’t good (This is what happened to my friend). Concurrency is where they test the skills they needed. I don’t think this is bad compared to any other high paying company. DSA is the best way to judge since it is mix of problem solving and coding. That’s why every bigtech conpany does that.\n    └── Agreee"
    },
    {
      "id": "ng9ap5b",
      "body": "People don't have consciousness now a days ! They don't prepare shit ,lack of skills,  have 7 CGPA and aspire to get 33.5 lakhs of CTC !! WOW.   \nDiversity Hiring should be banned ! Girls are amazing cheaters they don't need such quotas"
    },
    {
      "id": "ng9owwi",
      "body": "As expected"
    },
    {
      "id": "ngbv29j",
      "body": "Can those who have attended interviews share their experiences, such as what questions were asked in interview rounds, including those in online assessments?\n\nso it would be helpful to others"
    }
  ]
}