{
  "id": "1nr5oa4",
  "title": "[OffTopic] New rules for vehicle parking",
  "content": "15Km/hr from college gate to parking lot ",
  "metadata": {
    "root_comment_id": "ngbvdco",
    "post_id": "1nr5oa4",
    "author": "Mean_Scar9146",
    "url": "https://i.redd.it/s2wqqw75bjrf1.jpeg",
    "permalink": "https://reddit.com/r/PESU/comments/1nr5oa4/offtopic_new_rules_for_vehicle_parking/",
    "score": 57,
    "upvote_ratio": 0.9900000095367432,
    "created_utc": 1758903498,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "ngbwj0c",
      "body": "Pes finding 101 ways to make money 🤑\n├── For real\n└── money laundering 101"
    },
    {
      "id": "ngbwj39",
      "body": "Just don't pay, what are they gonna do, send a court order?\n├── stop u from writing exams\n└── If you owe them money, they will follow every method in the world to get money from you.\n    ├── I'm gonna try it out and let you know\n    └── its like owing money to the mob 😭"
    },
    {
      "id": "ngbycah",
      "body": "How will they know, just don't fill the vehicle info on the website"
    },
    {
      "id": "ngbyijv",
      "body": "Just don't pay, dont fill vehicle info, how will they ever know unless they stop u"
    },
    {
      "id": "ngbzabz",
      "body": "those detectors always show incorrect speed 💔"
    },
    {
      "id": "ngc11t1",
      "body": "Can they get the road fixed near back gate?\n├── That repair work isn’t going to happen until we graduate. They’ve had it dug up since the day I joined college.\n└── They've repaired it now today morning when I came where ever it has earlier been dug has been patched up with tar.\n    └── thats just temporary work , itll be back to square one next time it rains"
    },
    {
      "id": "ngc1b0t",
      "body": "guys pls have empathy how else should jawu's family recover from IT raid /s"
    },
    {
      "id": "ngc4ou3",
      "body": "I visited the campus once. I understand safety is a thing but it’s creepy how many cameras there are. Felt straight out of 1984.\n└── 500 to be precise"
    },
    {
      "id": "ngcgv6p",
      "body": "I always go at 45km/h in campus never got finned, I guess it’s because they don’t punish top students with 0.8 CGPA like me🥰💫\n├── bro it says it would be implemented from the first of october even .  \nI don't go 15km/hr who goes that slow\n└── Can I join you on this journey to self-sabotaging?"
    },
    {
      "id": "ngevn1x",
      "body": "Enjoy ur time left ig 😔 minimum 30 required bro or else walking faster"
    },
    {
      "id": "ngezr6u",
      "body": "Fuck this college dawg I walk faster🥀"
    }
  ]
}