{
  "id": "1nrn7kq",
  "title": "[OffTopic] Had to repost this",
  "content": "Just after posting this yesterday some guy in a white Volkswagen Tiguan(white)  KA50 registration would have killed me today\nI was coming back from my isa \nI was driving back I was correctly left side of the lane that guy was at least at 50 ig just passed from left side of me didn’t even stop I don’t know how he managed to manoeuvre from my left as there was literally no place left , and it took place inside the campus just before the parking lot like totally unnecessary  speeding as I was literally at a speed bump ",
  "metadata": {
    "root_comment_id": "ngfns2p",
    "post_id": "1nrn7kq",
    "author": "Mean_Scar9146",
    "url": "https://i.redd.it/qq6uftcb9nrf1.jpeg",
    "permalink": "https://reddit.com/r/PESU/comments/1nrn7kq/offtopic_had_to_repost_this/",
    "score": 1,
    "upvote_ratio": 1,
    "created_utc": 1758951311,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "ngfphe2",
      "body": "That's one way to reduce the competition during placements /s\n└── It would have been if it was the other way 💀"
    },
    {
      "id": "ngfq7vr",
      "body": "reducing competition"
    },
    {
      "id": "nggbq45",
      "body": "Though extreme, this new rule is pretty valid then"
    },
    {
      "id": "nggmkzu",
      "body": "I think its valid , campus limits aint the place for speeding , some dumb ahh people come and uk jus start racing nd stuff\n└── Yeah thought I did a mistake posting the earlier post so I reposted it , some people try cheap tricks just to impress some girls bruh"
    },
    {
      "id": "nggtims",
      "body": "What if I don’t register my vehicle"
    },
    {
      "id": "nglflvw",
      "body": "I have an doubt I wasn't able to post in this subreddit so please just answer this ive pesu main campus as an backup opt[12thie hun rn] n im not eligible for kcet nd heard that through mains fee is arnd 5LPA will there me aby concession in fees through mains nd boards I mean getting good percentage in them vl help me?[ik its not related to the post but please dont get offended]\n├── Bhai as far as I know that 5 lakhs is concession because the management around here is 12lpa but I’ll clarify it and dm you if I get anything \nTo post you’ll have to use brackets first  [something inside this bracket  ]and then followed by title  title should be above25 characters and you should use a flair\n└── In your case write the heading as mentioned in double quotation \n\n\n“[Admission] Admission fees & concession for year 2025 “\nAnd then write your body part \nAnd then use the flair as ask seniors"
    },
    {
      "id": "ngm9xuv",
      "body": "While I completely agree with having a speed limit that is enforced. Having a 15 kmph limit is just dumb. Atleast let it be 20 or 25. My bike goes faster than 15 when I'm coasting (throttle fully closed) in 2nd gear. Also, most vehicles, even those with reasonably shit brakes can stop from 20 in under 10 feet.\n\nTo add to this, while I agree that some dumbass students/parents drive recklessly, PES buses and trucks/Ace carrying construction materials or whatever drive wayyy faster than that, and almost all the dangerous situations I've encountered are caused by them rather than a student vehicle.\n└── Yeah they could’ve increased the limit 15 km/hr is very low"
    }
  ]
}