{
  "id": "1ns0zlc",
  "title": "[Placements] Ibm_isdl after biometrics",
  "content": "People were asked to add aadhar,pan,and every grade card to a pdf and submit it in the ibm portal.\nBut the pdf isn't getting saved. \nAnyone facing the same issue? \n",
  "metadata": {
    "root_comment_id": "ngiftuc",
    "post_id": "1ns0zlc",
    "author": "sukuna_is_a_bum",
    "url": "https://www.reddit.com/r/PESU/comments/1ns0zlc/placements_ibm_isdl_after_biometrics/",
    "permalink": "https://reddit.com/r/PESU/comments/1ns0zlc/placements_ibm_isdl_after_biometrics/",
    "score": 1,
    "upvote_ratio": 1,
    "created_utc": 1758994011,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "ngih614",
      "body": "Yes even I'm facing that issue. I asked some of my friends as well they too are facing same problem. One small correction it is Ibm isl which came today.\n└── Oh ya it's isl my bad"
    },
    {
      "id": "ngil90p",
      "body": "I think we have to upload it after we receive the final shortlist ie. the status of the application is updated as selected I guess.\n└── yes that makes sense"
    },
    {
      "id": "ngioiqe",
      "body": "They took my biometrics, didn't send any forms or links.They didn't even ask me to upload antg....am I indirectly rejected?\n├── i dont think so   \ni think we are supposed to do this after we get selected for the job so u guys(non pesu52 peeps) might get the memo then\n│   └── I was in pesu52....I was among the last set of students to leave pesu52\n│       └── did u take a photo with the hr?\n│           └── Yes\n│               └── the biometrics machine stopped working during the end is what i heard  \nif u have taken a photo with hr then u r safe\n│                   └── Ohh thanks for this info tho\n└── Meaning fingerprints and stuff in the college?"
    },
    {
      "id": "ngiraul",
      "body": "How many people’s biometrics have been taken in total, and how many have had their jobs confirmed\n├── in pesu52 everyone who finished round 2 got their biometrics taken\n\nIbm will send a list of the final shortlisted but idk when tho\n└── I don't think anything is confirmed yet, someone asked HR, they said they'll inform the selected ppl on Monday\n    └── Then what about uploading pdf and all that?idt nonpesu52 people have received it"
    },
    {
      "id": "ngitf67",
      "body": "The document upload is to be done at:\nibmglobal.avature.net/en_US/careers/YourInformation \n\nThen \"edit your information\" and upload the pdf in \"others\" file upload input \n\nIf they took your biometric, they told me to do this next... If it's not already uploaded, so I think ppl who had their biometric done should upload regardless, no harm in uploading \n\nLogin here with ur IBM id\n├── But my \" your application \" says \"No longer under consideration\".\n│   └── I dunno man, I shared what I knew 😭. This worked for me\n│       └── Yeah valid dw, I was just mentioning to just know if any1 else has the same issue..\n└── tried that but the pdf isnt getting saved\n    └── Ah that is just their site issue, it's being saved dw. It just doesn't show up, but it's uploaded (IBM ppl confirmed... to me at least)\n        └── ah peaceful then"
    }
  ]
}