{
  "id": "1nsgyev",
  "title": "[Placements]Luck plays a crucial role. IBM interviews",
  "content": "The IBM interviews were taking place yesterday and to be able to take the interview for all the 300+ candidates they were divided as virtual interview(from campus, but i've heard the late batches trying to scam and take it from itself or another room where people could help them ) and on campus face to face interviews. I've seen a lot of people who got the oncampus interview get such easy questions such as sorting algorithms , or the top basic easy leetcode questions , some didnt have to code itself just explain the approaches . There were repetitions as well i know 5 people who got same Linked list questions . For the virtual interviews people were asked to code not just explain a Perceptron Prediction Function , code a hoisting func in JavaScript and DSA coding questions that were'nt exactly easy. This doesnt apply to all becoz ik some virtual got regular easy questions and some on campus did get some hard questions. \n\nAfter the interview i had such mixed feeling i wasn't feeling really sad , why because these were situations that i can't do anything about. Sure i need to go back and prepare more thoroughly such that i should be able to answer any questions asked. But i couldnt help thinking that what if i was asked to take an oncampus interview what if i was asked the same sorting algorithm , i knew i would make it to the next round, i am that confident enough. Two people i know , one was actually more smarter and deserving than the other, i know its wrong to compare but it is what it is, the more smarter one didn't make it through because they were asked really hard questions while the other got the job after answering the linked list question. Do i think the other person didnt deserve the job , i mean the luck was on their side and they were prepared enough so they used the opportunity and did get the job so happy for them. All this made me realize that during placements luck and skills go hand by hand. You have the skills that others might have but dont have the luck then your skills must overcompensate. But if you have all the luck but dont have the skills then that wouldn't help either. Imagine getting asked basic linked list question luck is clearly on your side but you dont know the answer, well you are the one who has to work hard.\n\nSorry for the long post but all i wanted to say that if some of you guys have taken the past interviews and even after preparing well luck wasn't on your side , tbh there is only one thing that can be done just prepare more harder, because things such as luck arent  something we can control, but we can start preparing more thoroughly.  ",
  "metadata": {
    "root_comment_id": "nglvfmj",
    "post_id": "1nsgyev",
    "author": "Temporary_Load_7877",
    "url": "https://www.reddit.com/r/PESU/comments/1nsgyev/placementsluck_plays_a_crucial_role_ibm_interviews/",
    "permalink": "https://reddit.com/r/PESU/comments/1nsgyev/placementsluck_plays_a_crucial_role_ibm_interviews/",
    "score": 1,
    "upvote_ratio": 1,
    "created_utc": 1759039941,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "ngm0qtq",
      "body": "I jus don't understand y is every other post about placement is about luck, I am naive about the situation on ground, as im a fresher. maybe its luck, but if the company asked questions harder than others doesn't mean others were lucky, the person wasn't good enough,u had 3.5 years to prepare, its just a straight thing either u answer the questions or not, if u don't, u don't get the role,   \nto confirm whether the things u mentioned were within limits to prepare in 3 years , I have a brother of mine who is working in a tier 1 company from 2 years , he's pretty sure 3.5 years was sufficient when I asked him about this,  \nI don't understand people who come to discussion or rant or whatever, r these people one of those who did not prepare well,   \nmy point is why are the discussions about placements is always about luck, why not about how to excel in things so the competition wouldn't care much,   \nI made a post recently about placements for our batch 2029, most of comments is about me getting humbled or to hav a downfall, only one comment was really nice , like y don't u talk things which r important,  \nand still every single day there is a rant post on so called \"luck in placements\""
    },
    {
      "id": "ngm222p",
      "body": "I jus don't understand y is every other post is about luck in placements, maybe it is , but read the under explanation carefully, its simple,  \nthe company asked you questions, u did not answer them, u did not get the job. u had 3 or 3.5 years to prepare, it doesn't matter whether the company asked easier to others, y y'all always expect to get easier questions, y not just overpower ur skills compared to what the company expects, but its completely opposite, u do less and expect things to go easy on you, that's y everyone sees this as luck rather than giving the company value. I agree sometimes people less skilled Than u might land it.\n\nits not about you getting the job and a salary , in an interview its about u giving value to the company.\n\nI asked my brother who is in a tier 1 for almost 2 years, whether its possible to learn these things within the time, he said its doable to even achieve things more than u mentioned, \n\nthe problem is people join this college thinking that placements are nice and they will land a nice job \n\nchase excellency not luck ,then even the cheating or getting lucky whatever it is, won't matter\n├── Is ts tuff \n│   └── For you? Yeah, even a coloring book’s a challenge for u\n│       └── U urself said u don't care and start fighting lol\n│           └── mah boi, got roasted now cries why I replied back TT\n│               └── Okay bro , agreed. Nice roast \n│                   └── Roasted and u r still salty , pretty much a  classic combo\n├── Just love throwing around random buzzwords don't you?\n\nWhat does misogyny have to do with anything here? Absolute clueless muppet.\n│   └── You're out here acting like ‘misogyny’ is a buzzword just because your brain starts buffering when it hears big words. The only ‘random’ thing here is your opinion — Dismissing 'misogyny' as a buzzword doesn’t reflect insight — it reflects a lack of understanding. Your argument, dressed up in second-hand slang and loud certainty, lands with the credibility of one of the people mentioned above\n├── well first thats not how you use the word misogyny.\n\nsecondly if you read my post completely i was talking about how we have to be thoroughly prepared, even if luck is by your side you have to be prepared well enough, if not you have to keep preparing. You said we have 3 years to prepare right yes we did , and i didnt use all of it i agree. But my other friend who i mentioned is very hardworking and has been preparing for years but still couldn't make it through. And after this interview i did learn to study more thoroughly and be prepared with all concepts , but it's natural for me to wonder what it would have been if i could have sat for another one.\n│   └── I agree there is a luck factor, but believe me, if ur friend is actually working hard all these years, he would definitely land something better or near to this company   \nI hav read many posts similar to yours, my comments are not entirely directed to yours but in a general comment to all of those\n├── we arent saying its just luck , what we are saying is it does play an important role, regardless of how much one upskills there will things that one would never know. And when the shortlist is so huge , not answering even a single question will lead to rejection\n│   └── doesn't this mean \"competation\" in other words, if its high, u gotta make sure u r the best, I mean if u r aiming to land that job\n│       └── Are you telling me luck plays no role?\n│           └── oh it does play a role, Im mentioning y not overkill ur skills, rather than depending on luck   \nthis ibm looks like a one off case, but this will work for others\n│               └── Yeah it does,your right it was one of case hopefully the next one goes fine\n├── Are u fucking retarded😭\n│   └── the slur \"fucking retarded\" in big 2025, get some iq and braincells lil bro\n│       ├── just hop off the sub my guy🥀\n│       │   └── Hop off? Nah, you’re the one stuck here unc\n│       └── \"Lil Bro\"  \nyou are literally 18. Maybe not if Hopefull\\_Wing was right about you being retarded.\n├── \\> misogynistic  \nThis guy/girl is literally talking out of their ass.  \n\\>  I know I would get down voted badly, but I don't give a shit about downvotes nor am I chasing upvotes > on this platform, so do whatever you want  \nStill cares enough to put it at the end lol.  \nwhat one chancellor speech does to a mf on his first day in college.\n└── >the problem is people join this college thinking that placements are nice and they will land a nice job\n\nBelieve us, we know that just because we got into pes we won't be handed a great package, our batch and our seniors have learnt this the hard way and we have accepted it\n\n>chase excellency not luck ,then even the cheating or getting lucky whatever it is, won't matter\n\nThere are people who are more skilled than me who aren't placed but I am. There are people with better conversation skills than me who are not placed. This is exactly what we are saying. And as your seniors, who have also asked their siblings for advice, trust us when we say there is a lot of luck in placements. Consider that you have given 5 interviews, you have multiple skills, you know 3-4 coding languages fluently and have used multiple tools, and you see someone who has much lesser skills than you, they get the job and you don't because their interviewer asked a simpler question, your interviewer asked you a question you never saw before, you got stuck in the solution and the interviewer saw your conversation skills, considered it below average (coz ofc) and moved on. Are you actually saying this isn't frustrating? After 5 interviews? \nThis post was just that rant, and we didn't need a 1st year kid explaining the process of placements to us when we are the ones that are experiencing it first hand. \n\n>people coming here are just so misogynistic\n\nFinally I'd like to address why I said your conversation skills are below average, you used a word incorrectly, which is fine, but you didn't correct yourself even once. If a hiring manager ever saw something like this, they wouldn't hire you. \n\nYour seniors have a point when they say what they say, rather than finding the mistake in it, take what is useful and move on. We aren't saying that we deserve a job just because we are part of PES, we are seeing the process first hand, we only share our experiences so take it or leave it."
    },
    {
      "id": "ngm2che",
      "body": "Luck is a big factor, but I've seen a lot of people solely attribute their misfortunes to luck and not change a single thing about themselves. \n\nI've had people tell me their interview experiences yesterday and cuss at the interviewer for not being pleased/interested. Meanwhile when I actually ask them for the answers they gave, it's very apparent why they were not selected. Wrong answers is one thing, but nobody will hire anyone with the wrong attitude, atleast if you display it for everyone to see. \n\nStart treating interviews like less of an interrogation and more of a conversation, you'd be surprised. \n\nObviously this doesn't apply to everyone, not by a long shot. but I've noticed quite a few who are like this. After every single interview just keep cussing about how they did absolutely nothing wrong. \n\nI'll just say one thing. Luck can't change much. Maybe good luck gets you selected in the first time out. Very Bad luck might see you getting a job in your 4th or 5th interview. But if you keep continually failing at interviews, there might just be some other variable at play.\n├── yea this is what I said in my comment, they just expect things to go easy on them, or get lucky, but the underlying hardwork is missing, maybe even people who do hardwork might not land it, but sure as hell they will land something in their further opportunities\n│   └── Dude you missed my point completely. You're first year what are you even talking about?\n\nMy point is that there's a lot of interviews where they ask things which most won't know. And as a guy preparing for interviews you can't cover all niche things. \n\nMy point was to improve communication skill, learn how to not answer while keeping him happy. Maybe divert, go on a tangent about another topic you're very familiar with. It won't work at higher levels especially with bigger and standardized companies, but at our level it seems to. \n\nShow a positive attitude and give any response other than \"idk let's move on\"\n\nYou misunderstood me completely and have no clue what you're talking about\n│       └── People can't explain basic things about their own projects, and lack a lot of base concepts too.\n\n  \nisn't this related to my comment\n│           └── You chose one line of an entire para. That wasn't the main point. \n\nThe point was again. Even if you don't know something, convert it to another direction.\n│               └── bro u wrote it, I replied for it, if it wasn't the main point y write then ):\n│                   └── You show way too much attitude while lacking an ounce of knowledge to back it up. Good luck with your life and placements. \n\nI assure you, you'll need a lot of it.\n│                       └── Attitude? Nah, I call it confidence , something you clearly mistake for ignorance because you don’t have the facts to keep up. But hey, good luck with your placements too , you’ll probably need a whole ass Hail Mary and not just luck\n│                           └── Yup, I've never seen a person so confidently incorrect before. \n\nYou don't have facts to back you up, nor do you have any experience. You've literally just crossed out of the jee race and you don't know the first thing you're talking about. You've got 3 years to change yourself or you're in for a tough time. Even if you know everything, good luck cause nobody's looking to hire a guy like you. You're the entire reason hr departments exist. \n\nA company rejecting you in the hr round would be enough value on its own to justify the existence of the entire department. \n\nAnd thanks for your wishes, although they're a bit too late. I got placed in early August\n│                               ├── did u even read my comment, I mentioned asking my brother about it, who has a whole lot more experience than you   \nagain good luck with ur job, idk y they hire people with 2 brain cells who can't even remember a small para :)\n│                               └── don't worry about me, I hav a lot more wisdom than u uncs\n│                                   ├── And I bet you'll use that \"wisdom\" of yours to drive your career to the ground before it even begins\n│                                   │   └── Funny, your ‘wisdom’ sounds more like a self-fulfilling prophecy. Hope you’re not taking career advice from yourself\n\nBless your heart,i bet u still trying to figure out how to make an impact in ur company\n│                                   └── Nigga you in first year worry about your batch. I'm sure you'll be crying during placements where your  total intake is 3k+ .\nBro thinks it's cool to just call unc just to prove their point\n│                                       └── Keep counting my batch size nd i'll keep collecting opportunities. Some of us play in the big leagues  \n3000+ people still ahead of you. Must be tough losing to a whole stadium.\n│                                           ├── I called  unc, cuz it was needed for ppl like u who r in boomer mode\n│                                           └── 🤣🤣🤣🤣🤣 sure\n│                                               └── why u crying lil bru, not finding the comeback\n\n![gif](giphy|z3qHZEpopsLTDRQLPo)\n└── >Start treating interviews like less of an interrogation and more of a conversation, you'd be surprised\n\nThis is the most important part personally when I gave my interview (in Aug) ,the domain of the  project I did and the domain my interviewer worked in was the same so when we started discussing it went on like a normal conversation between two people I felt almost like as if I was talking to one of my classmates."
    },
    {
      "id": "ngm4aff",
      "body": "  \nThe thing is the placements purely boils down to luck and cant help. It feels hard when u r working harder, having sleepless nights but the one who is chilling got placed. But also I have heard the quote that says   \n\"luck favours the brave\" , I am not sure how authenticated the statement is.  \nJust work hard god will take care!!!  \nGood luck for placements man!"
    },
    {
      "id": "ngm4gzo",
      "body": "Thsi is so true. There were two to three places on campus where the interviews were taking place , pesu52, placement center and mca labs. Some interviewers in pesu52 rejected all candidates while some asked only about the resume , and interviews in the placement center were extremely easy . Unfortunately my interviewer(interview took place in pesu52) asked terrible questions and I did not make it though. All I can say is we just have to keep pushing no other choice."
    },
    {
      "id": "ngmg5wg",
      "body": "IBM is a big scam always ! It's one of those very useless mass hiring low quality firm   \nThey don't have a standard process like good quality firms like Walmart , Cloudera , Meesho or Zomato who pay really well !\n└── There's a bit of luck involved in every company, the luck factor in IBM is a lot more apparent and visible since it plays out over a much larger scale\n    └── It is a junk company with useless talented workforce\n        └── So what you're saying is the people who got IBM by getting a bit lucky with the interviews got what they deserved?"
    },
    {
      "id": "ngmgfa7",
      "body": "If any fresher says they are working at IBM from here on out don't expect me to value you. Because of IBM's dog shit selection process."
    }
  ]
}