{
  "id": "1nskimh",
  "title": "[Rant] Ibm Interviews trauma",
  "content": "The IBM interviews this time were conducted in both offline and online modes. More than half of the candidates had face-to-face interviews, while the rest had them virtually. What really shocked me was seeing people blatantly copying during the online interviews using AI tools. They would just pretend to be thinking while looking at auto-generated answers. And the worst part? Some of them actually got shortlisted. I legit saw a couple of them keep their phone and cheat their way through. As someone who tried to go through the process honestly, this was honestly disheartening. Watching people cheat their way through while genuine candidates struggle was pretty shattering. It makes you lose a bit of hope in the fairness of the system. And personally, I’ve completely lost hopes on the system.",
  "metadata": {
    "root_comment_id": "ngmj3uo",
    "post_id": "1nskimh",
    "author": "blehblehduhduh",
    "url": "https://www.reddit.com/r/PESU/comments/1nskimh/rant_ibm_interviews_trauma/",
    "permalink": "https://reddit.com/r/PESU/comments/1nskimh/rant_ibm_interviews_trauma/",
    "score": 1,
    "upvote_ratio": 1,
    "created_utc": 1759053718,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "ngmkby7",
      "body": "This is why indian tech guys are hated abroad. Totally random selection of the IT workforce.   \n\\> Be me   \n\\> Thought of trying my luck on upwork .   \n\\> Read reviews about the indian guys scamming in client projects by either outsourcing or writing unreadable slop code. \n\n\\>  Read somewhere that majority of the indians have to fake their name/location to UK/Canada just to get a decent client .\n\n\\> Quit the app without completing the registration.\n\nThis is the reality."
    },
    {
      "id": "ngmkpdj",
      "body": "why was it virtual and offline at the same time?\nThey could have done the interview process  on two separate days right?\n└── Yes, it was at the same time, some had their offline interviews going at pesu52 and a bunch of them had to take it from the library, the virtual ones. And good lord, cheating for the most basic answers. I lost all my hopes right then and there. All I could do is just blankly look at the person cheating their way through infront of my eyes. And no, Pes won’t really schedule it on different days I’m sure. It has its own way of doing stuff which is unpredictable."
    },
    {
      "id": "ngmkqm6",
      "body": "Damn, people are even cheating in interviews now? For our batch, people usually cheated only during the OA. Tough times ahead."
    },
    {
      "id": "ngml3h9",
      "body": "Did everyone who gave biometrics and marks card are placed or is it like previous drive where even if you give they shortlist further"
    }
  ]
}