{
  "id": "mf75lo",
  "title": "Previous year pessat papers",
  "content": "Im planning to attempt pessat this year, i tried to find few previous year papers and sample paper but i couldnt find em. Could somebody help me wid findin the paper or share the paper wid me...pls?",
  "metadata": {
    "root_comment_id": "gsnb5kv",
    "post_id": "mf75lo",
    "author": "Manishc03",
    "url": "https://www.reddit.com/r/PESU/comments/mf75lo/previous_year_pessat_papers/",
    "permalink": "https://reddit.com/r/PESU/comments/mf75lo/previous_year_pessat_papers/",
    "score": 4,
    "upvote_ratio": 0.8399999737739563,
    "created_utc": 1616957388,
    "flair": null,
    "nsfw": false
  },
  "comments": [
    {
      "id": "gsnb5kv",
      "body": "PESSAT has been online for the past few years and I don't think they release the questions and solutions after the exam.\n└── Thanks\n    └── You're welcome ☺️"
    },
    {
      "id": "gsnesa1",
      "body": "If you've practiced enough for KCET/COMED-K and your fundamentals are strong you won't need previous year papers for this :)\n└── Thank you"
    },
    {
      "id": "gtjnynh",
      "body": "You shouldn't even be considering PES.\n└── Pls elaborate, pls tell me why its not a good choice b4 its too late for me to change\n    ├── I'm in 4th sem Mech EC campus. To survive in PES, you need to study every day. If you're planning to chill and study just a week before the exam, PES is going to make things really hard for you. The club activities are marginal compared to other good colleges like BMS or RV. You don't really get the feeling of having freedom to explore your other interests in PES because they keep giving you pressure for scoring well in their internals and end-semester exams. Its good for you if you get good grades but PES does this all the time, is really pissing off.\n\nForget about enjoying fests because PES has so few that it is a meme. The campus infrastructure has nothing special to talk about. It gets pretty boring after a week. Some of the teachers are really good and some of them are \"okay\". On the flip side, RR campus is better in terms of extra curricular activities but it's the same \"pressurising\" philosophy at it's core. It's a fact that EC campus students envy the RR campus students and regret everyday that they couldn't make it there.\n    │   └── Thank you sm for ur feedback, so is it good if i get into cse at  the rr campus?\n    │       └── Yes, it is really good compared to most colleges in Bangalore. But I don't think it's worth paying the 3.2 lakh fees/year in PES. PES is worthy if you go through KCET.\n    │           └── Cool thanks a lot bro\n    └── Too much workload. Every semester has 5 projects and and the end of 5th semester, they ask you to do a capstone project (final project) so that you have something worthy on your resume to talk about in an interview. Such hypocrisy.\n\nThey are over exploiting their autonomy status. Would request you to reconsider your options\n        └── Sure! Im also trying for msrit nd bmsce since my parents are only allowing to go to banglore.\n            └── Pls tell me what yall know about the college coz all the info i have are from different website idk if i van trust them\n                └── DM?\n                    └── Sure!!"
    }
  ]
}