{
  "id": "n1nvyd",
  "title": "How is the ECE branch in PES University currently? How are the internships and placements for the branch if I am not interested in core ECE jobs? Also, does minoring in CSE help during placements?",
  "content": "",
  "metadata": {
    "root_comment_id": "gwe9bwz",
    "post_id": "n1nvyd",
    "author": "MegaAb651",
    "url": "https://www.reddit.com/r/PESU/comments/n1nvyd/how_is_the_ece_branch_in_pes_university_currently/",
    "permalink": "https://reddit.com/r/PESU/comments/n1nvyd/how_is_the_ece_branch_in_pes_university_currently/",
    "score": 7,
    "upvote_ratio": 1,
    "created_utc": 1619763761,
    "flair": null,
    "nsfw": false
  },
  "comments": [
    {
      "id": "gwe9bwz",
      "body": "Good luck passing DSP in 2nd year.\n├── Can u pls elaborate... \nIs it really that difficult?\n│   └── It's worse than you can think\n└── Luckily for us when that subject was there they cancelled exams XD"
    },
    {
      "id": "gwer53d",
      "body": "If you’re an ECE student with CS minor you can pretty much sit for any company placements. Internships aren’t as easy to get but placements are pretty decent. ECE is tough but you’ll get by😂\n└── Can you please elaborate a bit more about the internships... Pls\n    └── Internships are ok but please do not join...the college does not give a fuck about its students and labs are absolute dogshit"
    },
    {
      "id": "gwfk8zh",
      "body": "u/tremendous_cookie47"
    },
    {
      "id": "gwfl1mz",
      "body": "Overall I’d say ECE at PESU is a 6/10. Basically, your time here would be 1000% dependent on how well you can find opportunities for yourself. \n\nIf u are planning to go for minors in CSE, your time will be more hectic here but it does give you some weightage in comparison to people from your branch without minors in placements. \n\nInternships - core is basically non existent, as in no leads will be generated from bulletins or circulars, for core companies you need to find contacts but if it comes to IT/CS companies most of them come for both CSE/ECE so that won’t be a problem if u are good at CSE concepts. \n\nOverall it’s a good experience if u have a set goal in mind and have the go getter mindset. \n\nHope this review helped XD\n└── Thx for helping a brother out. This is the most helpful review in this thread lol. \nOne last thing, let's say I manage my time somehow and take tuitions outside for important  Cse parts like DBMS and also I do minors in cse,will I get a Tier 1 job?\n    ├── You getting a job is purely based on your skillset and as far as external tuitions go i don’t think they help that much. What u need irrespective of its for a job or creating your own product is the basics and hands on knowledge of that topic which you will get by doing projects and coding a lot. \n\nSo instead of wasting your money on external tuitions, put that money in BTC and do projects XD\n    └── Good luck finding time for tuitions. College is not like school where you can take tuitions to pass."
    },
    {
      "id": "h5nq8ej",
      "body": "To anyone who is willing to join PES University, as a student of 4th year here. Please don't. Unless you don't get a seat elsewhere, Don't. The university will let you down over and over, again and again to the point where u will to do nothing about it. The way the just ignore problems of students and do anything they want to do, and how they give 0 importance to sports or fests or whatever a good engineering college would give to. They just don't listen to students. Hell we have a ground(only one and not more than a small cricket field size) and no one except the inexistent or disfunctioning PES cricket team can play there. The campus is literally 25 acres and above half of it is covered in sand, iron rods, bricks and shit. Education, yeah, it's surely good, but everything else is so bad, the management is soooo bad that u get to ignore the quality of education. Pls take my advice."
    }
  ]
}