{
  "id": "ngpxcq",
  "title": "What is your opinion?",
  "content": "**POLL TO KNOW YOUR OPINION OF PES UNIVERSITY AND ITS MANAGEMENT**\n\n[View Poll](https://www.reddit.com/poll/ngpxcq)",
  "metadata": {
    "root_comment_id": "gyse0en",
    "post_id": "ngpxcq",
    "author": "Truthseeker1396",
    "url": "https://www.reddit.com/r/PESU/comments/ngpxcq/what_is_your_opinion/",
    "permalink": "https://reddit.com/r/PESU/comments/ngpxcq/what_is_your_opinion/",
    "score": 6,
    "upvote_ratio": 1,
    "created_utc": 1621482529,
    "flair": null,
    "nsfw": false
  },
  "comments": [
    {
      "id": "gyse0en",
      "body": "Idk what bothers me more, the fact that `college is bad but management is good` isn't even an option or that `Damn I love this college so much! I feel its on par with IIT's and Iivy league` actually got a vote.\n└── There is an impostor among us"
    },
    {
      "id": "gysnpce",
      "body": "Happy to see posts in this subredit\n└── We all dead from inside"
    },
    {
      "id": "gywi4bb",
      "body": "9 people need therapy\n├── I am one of them\n│   └── Get in touch with the student counselor of PES\n│       └── I have and its no help\n│           └── Damn. It's that serious huh?\n│               └── Its not that serious but I contacted one of the councellors and I also had a session with one of them but I didnt feel any better, in fact I can even say I started feeling even worse after that session.\n└── We all need therapy after joining PES\n    └── Can't deny that"
    },
    {
      "id": "gywydgv",
      "body": "Wht ? I just about to join pes and reading these comments is giving me anxiety\n├── I am*\n└── Its good that you saw this atleast now"
    },
    {
      "id": "gzm7icz",
      "body": "Wait for real can somebody elaborate? I've heard very positive reviews from a few alumni friends of mine from the CS dept at the ring road campus\n├── College is good but the way the college is handling the Covid situation is utterly disgusting and we are in a miserable and pathetic state\n\n[https://www.instagram.com/pesu\\_ventroom/?hl=en](https://www.instagram.com/pesu_ventroom/?hl=en)\n\nSee this instagram page your question will be answered\n└── Those are not truths. Even I came here coz people used to say placement is good. But now I can see only cse has more than 1000 students. And dont forget ece people. So just think about competition. This means that only a tiny fraction gets good job. If you have better option go there."
    }
  ]
}