{
  "id": "otwmg9",
  "title": "How to get an ECE core placement via college?",
  "content": "I've heard from my seniors that most companies come for Dev roles or IT sector jobs here in PES. Do any core companies come for placements? And generally when do they come? What kind of roles can we expect in a core company?",
  "metadata": {
    "root_comment_id": "h6z33qq",
    "post_id": "otwmg9",
    "author": "No-Particular-2440",
    "url": "https://www.reddit.com/r/PESU/comments/otwmg9/how_to_get_an_ece_core_placement_via_college/",
    "permalink": "https://reddit.com/r/PESU/comments/otwmg9/how_to_get_an_ece_core_placement_via_college/",
    "score": 12,
    "upvote_ratio": 1,
    "created_utc": 1627562137,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "h6z33qq",
      "body": "Press F to pay respects\n└── hey. Could you reply why you said this? I am getting ECE in RVCE and was also curious about campus placements and internsips in ECE department\n    └── Core companies barely visit. But I’m the other hand you are allowed to sit for most of the CS company placements as well. \n\nSo if your goal is to get into some semiconductors company or something related to ECE, placement are pretty rare in that.\n        └── would my chances in core ECE jobs increase by doing a MS/M.Tech?\n            └── Maybe. But, I don’t have enough knowledge to comment on that. ALL THE BEST!"
    },
    {
      "id": "h6ziu4q",
      "body": "First of all stop hanging out with your seniors of those who say placements come. But if you want one, sacrifice social life for studies, live like a robot for 4 years, get every damn textbook skill on your resume, and then go get a job where you can happily work 9-5 daily. It's just that simple"
    },
    {
      "id": "h71bscj",
      "body": "They do come, but they're not exactly common. Don't count on any showing up and selecting enough people. Apply off campus if you're interested.\n\nA 1-2 companies here and there for VLSI. Some for networking (idk if that's considered ECE core). I think I've seen an occasional telecom company as well. But by no means is it a lot. \n\nThere are a decent number who might show up for embedded systems and firmware design though along with things like IoT. Wrt to core ece that's probably the one that's the most in-demand, but I think CS guys are also eligible for some of these.\n\nDisclaimer - graduated from CS"
    },
    {
      "id": "h7277zm",
      "body": "F in the chat boys"
    }
  ]
}