{
  "id": "p4p162",
  "title": "Hey Guys! Whom do I have to approach in the EC Campus if I wanted to start a new club or something of that sort?",
  "content": "Even though I have been in PES for a year now, me and the current first years have no idea how anything works here . It would be very helpful if someone gave us a rundown about the people to know and contact if you need something etc including faculty and seniors. It would be good to know the student friendly faculty members who actually listen and try to take our opinions and problems and present it to the management.\n\nThanks in Advance!",
  "metadata": {
    "root_comment_id": "h90d83y",
    "post_id": "p4p162",
    "author": "Lowkey-Lokied",
    "url": "https://www.reddit.com/r/PESU/comments/p4p162/hey_guys_whom_do_i_have_to_approach_in_the_ec/",
    "permalink": "https://reddit.com/r/PESU/comments/p4p162/hey_guys_whom_do_i_have_to_approach_in_the_ec/",
    "score": 3,
    "upvote_ratio": 1,
    "created_utc": 1629012152,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "h90d83y",
      "body": "1. Issues and dealing with Management -\nEach department works differently and has their own management issues so it would really depend on your department. \nYour class representatives would generally meet with your department HoD twice/thrice each semester (Class Committee Meeting - CCM) to put forward general student concerns and issues. \nYou'll have to figure out from seniors in your department as to which faculty members actually get things done and/or are nice and approachable. Unfortunately, the EC campus has been losing a lot of good faculty because of the management. \n\n2. Clubs - \nYou may contact the student body heads of EC campus (Sukeerthi and Mahima) for further info on how to start a club. There's multiple documents required and emails have to be sent to a number of people in the management for approval. The process takes a very long time. \n\nFYI I am currently a club head in EC campus.\n└── Woah!  thanks for the heads up!"
    }
  ]
}