{
  "id": "pc19fr",
  "title": "What are the refund rules for PESU?",
  "content": "It only says if I don't opt for any seat then I'll be given a refund\n\nWhat if I opt a seat and choose to withdraw on a later date?",
  "metadata": {
    "root_comment_id": "hafujuq",
    "post_id": "pc19fr",
    "author": "thundr_strike",
    "url": "https://www.reddit.com/r/PESU/comments/pc19fr/what_are_the_refund_rules_for_pesu/",
    "permalink": "https://reddit.com/r/PESU/comments/pc19fr/what_are_the_refund_rules_for_pesu/",
    "score": 5,
    "upvote_ratio": 1,
    "created_utc": 1629990061,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "hafujuq",
      "body": "I think you will get full refund(340000/-)  if you surrender the seat b4 the deadline\n└── do they mention the deadline anywhere, because I've been going through all the documents like crazy but can't find anything\n    └── If you select a seat in the first round of counselling then ur deadline is 24th sept. The date is mentioned in the  pessat> important dates web page also it shud be mentioned in the mail u received\n        └── thanks for the quick reply\n\njust one more question\n\nWill I need original documents issued by school or the Digilocker documents suffecient ?\n            └── I had the same doubt so i requested my school to attest the documents i downloaded from digilocker for now, they told me the originals will take more time to arrive\n                └── ok, the issue is that my school is in a different state altogether so I can't even get my documents attested either\n\nI think I'll have to ask about this during counselling itself as no one seems to be picking up calls at the university\n                    └── I think the digilocker doc will work, other colleges are accepting tht as well. Its better if u get it confirmed frm the uni"
    },
    {
      "id": "hafxrm8",
      "body": "You get the 3.3L refund but you don't get the counselling fee back (afaik)"
    }
  ]
}