{
  "id": "pcdla9",
  "title": "How is CSE at EC campus ?",
  "content": "Hello I wanted a review of CSE at EC campus , is it worth joining over ECE at RR campus? Also will companies that come for placement differentiate between students of main campus and EC campus?",
  "metadata": {
    "root_comment_id": "haiw0dt",
    "post_id": "pcdla9",
    "author": "BarRepresentative923",
    "url": "https://www.reddit.com/r/PESU/comments/pcdla9/how_is_cse_at_ec_campus/",
    "permalink": "https://reddit.com/r/PESU/comments/pcdla9/how_is_cse_at_ec_campus/",
    "score": 9,
    "upvote_ratio": 1,
    "created_utc": 1630029071,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "haiw0dt",
      "body": "Hey, so first of all choosing between CSE and ECE is an incredibly important life decision as they are extremely different from each other. Initially, I was in the same predicament as you but now after having fully seen the ECE syllabus and how hard it is, I realised that ECE is not for me. Please figure out what you want to do first, otherwise you will suffer quite a bit.\n\nThat being said, let me tell you about CSE at EC campus - \n\n1. Both campuses are NOT equal. We have placements going on currently and the companies definitely favour the RR campus students. For every 15 students selected from RR, 1 student is selected from EC. \n\n2. CSE department here is losing a lot of teachers (the good ones that too) because of the bad management. Also, this campus will be converted to a Medical college so the students here will be shifted to RR. The timeline for this is unclear but Mech department has already shifted from EC to RR.\n\n3. PESU in general cares most about the CSE department. So you will face considerably less issues joining CSE, I wouldn't recommend joining ECE department based on the horrible stories I've heard about it from my friends.\n\n4. The CSE teachers in the EC campus are not as good as the ones in RR, nor as experienced. \n\n5. There are new labs in the EC campus now, so there's better equipment here now. But I feel the RR campus labs are great as well, not much of a difference.\n\n6. The teachers in EC campus are used to the VTU syllabus and not PESU. They are often quite clueless and keep waiting for instructions from RR. This is quite frustrating and doesn't seem to be getting better anytime soon.\n\n7. Also, the way PESU handles CSE is that they finish 95% of the syllabus in 3 years. Then you have the whole final year free for internships with a few very small subjects here and there with only Saturday classes.\n\n\nAll the best!\n├── thank you this was helpful\n├── Thanks a lot, this was really helpful. Do you think that the placement stats of EC will improve from next year since the first batch under PESU is graduating next year or do you think it will remain more or less the same?\n│   └── Companies still view this campus as PESIT, and I really don't see those stats improving in any way honestly. And even by the time it potentially does, the campus won't exist 😂 (all shifting to RR)\n│       ├── So all in all would you recommend someone to join CSE at South campus? Also do you have a rough estimate of the median salary for CSE at South campus?\n│       │   └── If you can get CSE at RR, that's definitely the better option. If not, then at EC is fine as well. The only other college that is comparable is RV (in Bangalore). PESU is definitely a really good option as the syllabus is updated every year and it's much more current than that of other colleges. Of course, if you get NITs, BITS, IIITs etc. that's a no-brainer. Even Manipal has some major advantages in terms of freedom.\n\nAs for the median salaries, most students ended up with packages between 6-8 LPA from the batch that graduated this year.\n│       │       └── The only other decent college I have is manipal main campus CSE but the fees there are very high and the placements are comparable to EC so that's why I am looking to join EC for CSE. Hopefully the placements and internship opportunities improve in the next 4 years.\n│       │           ├── Please do not. A lot of professors are leaving college and the management is shit. Don't intentionally do this to yourself.\n│       │           │   └── Manipal also doesn't have amazing faculty , I have asked a few seniors too. Also manipal only has decent placements for CSE (around 8lpa) so wouldn't PES be a safer option since it has better placements and some of the top companies visit the campus??\n│       │           │       └── We are literally hiring faculty because they are short of faculty, it is a terrible situation. Even in PES, placements are really good only for CSE and not other branches.  \nOn top of this, add much better campus life and infrastructure, I would personally join Manipal if I was in your place right now\n│       │           └── Honestly, if the fees aren't too much of an issue, please go for Manipal. Don't think twice about ditching PES.\n│       │               └── What seems to be the problem in PES?\n│       │                   └── I believe a lot of comments on other posts made here will answer your question. \n\nTLDR is, join PES only if you are (1) getting CSE and (2) only care about placements and getting a job after 4 years. If this is your only concern then PES will do its job. Apart from that, there isn't really any point/benefit of being here. From bad management with worse decisions, poor quality of teaching, insanely high academic pressure to a construction site for campus and no college life, PES has a lot of red flags and it is best you avoid it if you get the chance.\n│       │                       └── >n PES only if you are (1) getting CSE and (2) only care about placements and getting a job after 4 years. If this is your only concern then PES will do its job. Apart from that, there isn't really any point/benefit of being here. From bad management with worse decisions, poor quality of teaching, insanely high academic pressure to a construction site for campus and no college life, PES has a lot of red flags and it is best you avoid it if you get the chance.\n\nGood campus, a good campus life (and I don't mean pubbing, partying) that allows one to explore one's talents be it music, dramatics, extempore, debate, sports -- along with academics, is a huge factor IMV, and I agree PESU scores low on that, simply becaues they have no space, no open/green areas -- just a densly packed set of highly populated, even if nice-looking buildings. OTOH, if we compare CSE branch only, quality of academics, and quality of placements only -- do you really believe that the MIT is same or better than PES ? How so ?\n│       │                           └── I work with colleagues who graduated from Manipal / Thapar and I work in a T1 company (CSE).\n\nIt's just that the companies who offer the higher end of the pay spectrum are slightly more in number which gives PES the edge there and more opportunities to get a better pay. MIT is also a deemed University like PES. It's not that one is better or worse. Companies look for 'brands' that are likely to provide good candidates. It's not that one college edges out in the race for placements. PES was a leader once and now others are catching up fast due to craze and high demand for CSE. \n\nAny other related college life activities (I'm not talking about drinking and stuff, just college activities) (talking about EC) is a sad joke. Students who have really good interest in taking up activities and are willing to invest time and effort are shunned away like flies. It is extremely hard to pull off an event given their bureaucracy. Even then the support provided is the bare minimum with lots of expectations.\n│       └── so  will ec students also join rr campus?\n│           └── At some point in the future yes\n│               └── how soon will this be?\n├── You belong to which campus?\n│   └── I'm in EC campus\n├── Does this stuff still apply now?  Coz ec campus is now autonomous and lots of posts saying they're the same now\n│   └── EC campus was autonomous back then too. I visited campus 2 weeks ago, things are still the same from what I've observed, maybe even slightly worse placements wise.\n│       ├── Bruh. Then why do lots of people on this sub( check faqs rr vs ec) say they're the same now?\n│       │   └── btw wt did u decide r they the same??\n│       │       └── Took cs in ecity.\nfirst year ended, yea it's good idk what others complain abt\n│       └── Also about the placements thing preferring rr over ec. Isn't it because there are literally more students at rr than ec? So in pooled placements there's higher chances that a rr student gets placed than ec?\n│           └── I suppose this true then n the placements arent worse like they complained n faculty is good too?\n│               └── Idk why comparing placement by campus matters , cuz placements are pooled and recruiters(and ur degree) only know that ur a pesu student.\n\nFaculty u should ask some senior.\n└── Ik this post is 4 years old..? but is it still the case that EC students dont get the same placements as rr students?"
    }
  ]
}