{
  "id": "pfo244",
  "title": "Did anyone get the online counselling acknowledgement and link?",
  "content": "",
  "metadata": {
    "root_comment_id": "hb9bigt",
    "post_id": "pfo244",
    "author": "thundr_strike",
    "url": "https://www.reddit.com/r/PESU/comments/pfo244/did_anyone_get_the_online_counselling/",
    "permalink": "https://reddit.com/r/PESU/comments/pfo244/did_anyone_get_the_online_counselling/",
    "score": 4,
    "upvote_ratio": 1,
    "created_utc": 1630477346,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "hb9bigt",
      "body": "I have the same question, I am thinking of calling them up today, this is seriously some laid back behavior from the management\n├── When i mailed them, they told me i will receive the link a day before the counselling\n│   ├── yeah I got the same mail about link\n\nbut they should at least send an acknowledgement that yes we've got your money\n│   │   └── You can contact them via the main phone no on the university contact us page, They will connect you to admission. I contacted them today to verify whether they have received the fees or not and they said that they have approved the payments and I will get the counselling link tomorrow\n│   │       └── are you talking about this +91 80 26721983 ?\n│   │           └── +91 80 26722108 this one\n│   │               └── rn its oming out of network coverage,\n\nmaybe its the timing, I'll try it out in the morning\n│   │                   └── It's 9 am to 7 pm\n│   │                       └── did you get the link?\n│   │                           └── No did you?\n│   │                               └── nope,\n\nmessage me once when you get it, I'll do the same\n\njust for confirmation\n│   │                                   └── Perfect\n│   │                                       └── I got it\n│   │                                           └── Same what is your rank?\n│   │                                               └── 151\n\nyours?\n│   │                                                   └── 1057,that is an amazing rank  did you get any other decent college too?\n│   │                                                       └── I got 98.6 %ile in JEE Mains, but I don't think I'll get any better college than PESU with that\n\nother than that I got Mathematics MSc. at Pilani but I want to study CSE and also I'm a dropper so I really don't want a 5 year course\n│   │                                                           └── Oh okay nice, hope to bump into you in college\n│   │                                                               ├── hahaha same\n│   │                                                               └── trust me, with a campus that size, you probably will\n│   └── ok im getting nervous,what link is this?\n│       └── Its the link to join the presentation and counselling\n│           └── wait is this for ppl outside blore?\n│               └── Yes, they have an option for attending online counselling\n│                   └── okk thanks. btw do you know their refund policy? are they following UGC?\n└── I have tried calling them like 5-10 times but they never pick up"
    },
    {
      "id": "hbgcyls",
      "body": "I got the link tday\n└── Yeah me too"
    }
  ]
}