{
  "id": "pi7n3b",
  "title": "What was the cutoff for CSE at RR for the first round?",
  "content": "By the time I confirmed my seat I think almost 50 out of 360 were gone \n\nand 100 seats were gone around rank 350\n\nanybody know the last rank?",
  "metadata": {
    "root_comment_id": "hbnq65w",
    "post_id": "pi7n3b",
    "author": "thundr_strike",
    "url": "https://www.reddit.com/r/PESU/comments/pi7n3b/what_was_the_cutoff_for_cse_at_rr_for_the_first/",
    "permalink": "https://reddit.com/r/PESU/comments/pi7n3b/what_was_the_cutoff_for_cse_at_rr_for_the_first/",
    "score": 2,
    "upvote_ratio": 1,
    "created_utc": 1630821884,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "hbnq65w",
      "body": "Last rank was around 650s"
    },
    {
      "id": "hbnsy7n",
      "body": "Last rank was 659 for CSE at RR\n\nYou can check the last rank and the number of seats left here: [https://pes.edu/seats-availability/](https://pes.edu/seats-availability/)"
    },
    {
      "id": "hbofcvy",
      "body": "i got a rank of 200, will i get CS at RR in the second iteration?\n└── Did you appear for 1st round of counseling ?\n    └── yeah but i deferred. do you think if I wanted, I cud get it in the second round\n        └── You will only get a seat if some one leaves from cse rr batch and that too they must be from pessat quota and right now there are no seats left  in cse at either campuses\n            └── yeah yeah thats what i mean, do you think I have a chance?\n                └── It's tough cause I think first preference will be given to students already studying to upgrade there branch\n                    └── nah nah they said, it would go according to the rank itself. so when ppl leave CS at RR(either due to JEE or kcet or BITs or sthng) then those seats will be allotted according to the rank(ig with my rank of 200 I have a chance)\n                        ├── Yes I think rank 200 you have a fair shot\n                        └── what would be the cutoff for rr cse second round? will it reach 900s?\n                            └── tbh, I don't think so, but who am I to say anything. The cutoff right now is 659, and there are 360 seats in RR. You need 241/360 ppl to leave PES, in order for the cutoffs to reach exactly 900. 241 ppl leaving is unlikely it. Even if so many ppl leave, there will be a few like me in the 100s(rank), and 200s, who dint come for the first counseling, but will come for the second one.\n                                └── i have a rnk of 836. i dont know whether i shld take for round 2 or leave the seat and go for cet. i dont have enough rank to get in pes rr cse thru cet. so its like a gamble.\n                                    └── wait so have you taken a CS seat at E-City?\n                                        └── yep. but i can withdraw later. there are options thru kcet like bmsce ise,etc.\n                                            └── is BMSCE good, coz I think Ill get that too. How many marks did you get?\n                                                └── like mostly rvce>=pes\n\nbmsce is slightly below just slightly.\n\noverall bmsce is too chill compared to rv or pes.\n\n129\n                                                    └── what abt ramaiah? afaik RV/PES>>>Rmaiaha/BMS\n                                                        └── nah. rv>pes>bms>ramaih\n\nsometimes rv>ramaih>pes>bms\n\nits like that some ppl say ramaih is better than pes but i think rv/pes>ramaih>bms\n\nbut all are equal level generally. its just that rv has better reputation or pes has 1.5 cr package or something like that.\n                                                            └── how was your comedk? I wen to RV the other day, and the buildings suck and are old af\n                                                                └── i went to pes rr and theres so much contruction sites its not that good. only the main buildinglike thing is good. comedk was shit. mostly pes rr cse thru pessat or bmsce ise. i dont want to loose 3.4 lakhs as well. lets see. rv is better i would love to go there.\n                                                                    └── u can go for secnd counselling of pessat then if needed right?\n                                                                        └── yes. last year second round cutoff was 1038 for pes cse rr in pessat. so i will try."
    },
    {
      "id": "hbrt33x",
      "body": "What's the kcet cutoff for CSE at PESU RR campus?\n└── Around 700"
    }
  ]
}