{
  "id": "pjo5lo",
  "title": "How is EEE in Ring road campus?",
  "content": "I somehow got a seat in EEE even tho I had 9k rank and only 10 mechanical seats were left when I attended counselling, and couldnt get in that too. Then for some reason I got a seat but was asked 4 lakhs instead of normal 3.4 lakhs? Anyway How is EEE in Ring road campus?",
  "metadata": {
    "root_comment_id": "hbxywg9",
    "post_id": "pjo5lo",
    "author": "Ayfthisshit",
    "url": "https://www.reddit.com/r/PESU/comments/pjo5lo/how_is_eee_in_ring_road_campus/",
    "permalink": "https://reddit.com/r/PESU/comments/pjo5lo/how_is_eee_in_ring_road_campus/",
    "score": 5,
    "upvote_ratio": 1,
    "created_utc": 1631024938,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "hbxywg9",
      "body": "eh it's fine ig dude, there are few bad teachers, but that's a part and parcel of all engineering colleges. It also depends if you are interested in core or software too. But ee is difficult ngl, but if you work hard, it will be easy"
    },
    {
      "id": "hby7vkl",
      "body": "Didnt eee close around 3k??\n├── Ikr, they showed 0 eee seats left\n│   └── Which you joined bro\n│       └── I didn't take anything. 3.4 is more than we can afford, I'll wait for cet.\n│           └── Ha so am I but fortunately they have refund policy, hope they dont screw me up by getting admissions done before CET comes\n│               └── Yeah they do have a refund policy but you lose 10k if you give back the seat before 24th and after 24th I think they keep the full 3.5. but cet results come on 20th so it's fine\n└── I have no idea lol but yeah I did give the dd and came the seat is mine\nAlso my seat is 60k more than normal one"
    },
    {
      "id": "hc1j29g",
      "body": "If you're planning to go for a Master's degree, then I would say go for it. Because most universities treat all electronics and electrical streams identically. If you want a job after undergraduate, then understand that you've to do a lot of learning (coding, competitive programming) yourself."
    }
  ]
}