{
  "id": "pjsno8",
  "title": "How is PESU CSE when compared to other Bengaluru colleges",
  "content": "I'm talking about RVCE, BMSCE or MSRIT (Ramaiah)\n\nCSE only",
  "metadata": {
    "root_comment_id": "hbys1ue",
    "post_id": "pjsno8",
    "author": "thundr_strike",
    "url": "https://www.reddit.com/r/PESU/comments/pjsno8/how_is_pesu_cse_when_compared_to_other_bengaluru/",
    "permalink": "https://reddit.com/r/PESU/comments/pjsno8/how_is_pesu_cse_when_compared_to_other_bengaluru/",
    "score": 9,
    "upvote_ratio": 1,
    "created_utc": 1631038647,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "hbys1ue",
      "body": "in short and simple words: PESU RR any day............again, only for CSE XD\n└── Why are u lying bro😂 its shit and everyone knows it.....no need to bullshit other peeps\n    └── I thought the placements were really good for cs right?\n        └── Bro there more than 1000 people for cse alone....can u imagine the competition.\n            └── still NIRF released the data today and PESU scored well, the median salary is around 7,20,000 with 938 students placed out of 1230 and 178 choosing for Higher studies\n\nThat doesn't seem bad at all even with all the competition\n                └── You believe in nirf ranking 😂😂....amity university has better ranking than nit trichy lol. And I am not saying people are not getting placed. I am saying that what you hear about high salary placement.. Only a fraction of student receive it. Even I came to this college thinking about placement....that too from far north so I can understand what you mean to say. \nAnd if you have already taken admission then congrats and dont listen what others have to say about college because you cannot change anything now. What's done is done...so enjoy your stay here.\nBut if you are still in 12th then I want to say you try to have other option as well.\nPlacement and all still depend on you. If you are interested in your subject you will get good placement.\nBut the real problem is the management. They are the real assholes.\nYou cant even imagine how much they fucked our mental health during pandemic. And they will bully you whenever possible. This is the main reason I hate pes and I dont want junior to make the same mistake I did.\n                    ├── not talking about ranking, talking about placement stats\n                    └── Hey i have been hearing that the management is really bad. Could you please tell what exactly happened?\n                        └── Go through all the answers here on similar posts. You will find a lot of answers. Summary abou joining here is, don't join PES unless you don't have other options, or you got CSE and only care about getting a job after 4 years\n                            └── What about BMSCE, should I consider it if I've taken CSE at RR?"
    }
  ]
}