{
  "id": "pooi93",
  "title": "PES RR campus CSE vs Lower NITs and IIITs CSE",
  "content": " Getting 25k rank in JEE mains which can give CSE in lower NITs and IIITs. Have taken admission in PESU RR campus CSE which I can cancel till 24th. Not sure what to do, but some people say PES can match top NITs with respect to opportunities, facilities, etc. Is this true?",
  "metadata": {
    "root_comment_id": "hcy3rt2",
    "post_id": "pooi93",
    "author": "Lucian1729",
    "url": "https://www.reddit.com/r/PESU/comments/pooi93/pes_rr_campus_cse_vs_lower_nits_and_iiits_cse/",
    "permalink": "https://reddit.com/r/PESU/comments/pooi93/pes_rr_campus_cse_vs_lower_nits_and_iiits_cse/",
    "score": 13,
    "upvote_ratio": 1,
    "created_utc": 1631706388,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "hcy3rt2",
      "body": "No."
    },
    {
      "id": "hcyl0xb",
      "body": "Hell no"
    },
    {
      "id": "hcyxi19",
      "body": "NIT and IIITs still have a better name than PESU"
    },
    {
      "id": "hcz2cxs",
      "body": "I'm in the same boat mate, got a 13.6k rank in JEE Mains I'm not getting CSE in a college worth leaving PESU RR for\n\nThe best I'll get is NIT Raipur IT, which has a really outdated syllabus and average placement along with bad infrastructure, also location disadvantage. None of the new IIITs can be compared with PESU RR, or any of the top 5 BLR colleges for that matter\n\nIf you really want that NIT/IIIT Tag then you can go for it\n\nPeople here love to rip on PESU\n\nI myself have talked like 20+ seniors on linkedin and they all had good things to say about the institute (for cse only)\n└── This is absolutely true"
    },
    {
      "id": "hcz5wo8",
      "body": "Mahn I'm in the same dilemma since a week, can anyone plz fill me in...\n└── People on reddit thrash the college a lot but when I talked to seniors over on LinkedIn they said you would surely get equal opportunities if not more as compared to newer NITs and IIITs due to the location and the updated syllabus\n    ├── While I agree the hate directed towards the college on this platform may seem like exaggeration, as someone who is in their final year (and has gotten placed at a T-1 company) I assure you that most of it IS true. Speaking of opportunities, it is only the CSE branch that enjoys these benefits. The other branches struggle a lot. \n\nUnfortunately incoming students only see the college from the outside and the ratings on websites. It is completely different once you are inside.\n    │   └── Would you choose lower NIT/IIIT over PES? Some things I'm hearing in this subreddit are bad management, high academic pressure, lowering quality of faculty, etc. Could you elaborate over these? Please DM if there's some things you don't want to say publicly.\n    └── It's CS or bust. Every other branch gets shafted. Also with newer management, the current students seem to be having a much harder time than we ever did"
    },
    {
      "id": "hczgppn",
      "body": "Speaking with respect to job opportunities, I say you have a better chance at PES than in a relatively unknown NIT or IIIT. I have to say though, the intake for CSE in PES is high, and there will be competition. I got a rank of 23k in JEE Mains, and this is exactly what I thought before taking admission in PES."
    },
    {
      "id": "hd2if03",
      "body": "Graduated this year. Was in a similar boat as you guys - JEE rank 40k, a branch I wasn't interested in at bits, ECE @ RV and CS @ PES\n\nI picked PES. To be honest, I regretted the decision till the first sem, but after that things were actually pretty good. There are plenty of opportunities here. (disclaimer: CS and CS alone - for any other branch, don't pick it)\n\nI think opportunities is the strongest part - lots of collaboration between the college and the industry. It's also actually got a fairly up to date curriculum - there were classes that I'm glad I took because they directly helped with work/placements. \nPlacements for CS are like the biggest draw for a lot of people. By virtue of being in Bangalore you get a lot of companies who pay a fairly good amount.\n\nFacilities depends on what you're looking for. There are no large open spaces with shade to chill in. There are some decent libraries and computing facilities (of course, getting access to them is a different story). \n\nWrt to teaching, like in a lot of places it's a mixed bag. The curriculum is very heavy on projects - you'll do one for pretty much every CS course you take. This can make things hectic, but IMO it's very helpful for learning and it also gives you more things to talk about for interviews. Some teachers are extremely good, however I do not know how many of them are still faculty members. \n\nThere's been a lot of issues due to new management (for both profs and students), so before you take a call consider talking to a current final year student so you can get a feel of things. \n\nTLDR - same situation 4 years back. Picked PES and I'm thankful I did.\n├── Thanks for the detailed response!\n├── how is ec campus? cse in ec\n│   └── Apparently opportunity wise it's equivalent, but I really don't know for sure. I think placements are centralized, but I never met anyone from the EC campus, nor have I ever been there\n├── I hope you are right, i am in first sem, feels like a coaching institute for jee prep all over again. Have taken cs at rr, I hope it turns out well\n└── What is thing about \"new management\" and what kind of issues for profs & students ?\n    └── You should ask current students this for more information, but there seems to be a lot more testing, a lot more work in general and a lot of old profs have apparently left."
    },
    {
      "id": "lflzj78",
      "body": "Dear experts kindly guide me which option is better IIIT Bhubaneswar CE / PES CSE / MS Ramaih ISE"
    },
    {
      "id": "lflzkz8",
      "body": "Dear experts kindly guide me which option is better IIIT Bhubaneswar CE / PES CSE / MS Ramaih ISE"
    },
    {
      "id": "ln4k8ol",
      "body": "Damnn, have the same rank as you in mains, choosing pes cs over the clgs you mentioned. \n\nThat's crazyy\n└── Oh Lmao funny coming back to this post when I’m in my final year.\nIf I had to answer my own question, what u/U03B1Q said was 100% accurate.\nI’m doing pretty well now, placed with a good package(25lpa+) and profile looking good for masters. And I think of the options I had, this college was the best one probably.\nI would advice to only come here for CS branch though, and be prepared to put a good amount of effort and into actually learning CS, PESU can be heavy at times.\nI don’t know if all this will hold true in the future too as the competition is now even more because of aiml branch being added, and dilution of professor quality.\n    └── > I’m doing pretty well now, placed with a good package(25lpa+)\n\nCongrats for this, would definitely like to hear some tips for my clg life in my dm if ure free.. \n\n\n>And I think of the options I had, this college was the best one probably.\n\nHappy for getting birth in ktaka xd.. The fee is sooo soo less for a clg like pes.. \n\n\n>I would advice to only come here for CS branch though, and be prepared to put a good amount of effort and into actually learning CS, PESU can be heavy at times. I don’t know if all this will hold true in the future too as the competition is now even more because of aiml branch being added, and dilution of professor quality.\n\nTaking admission in pes rr cse, I already made my mind for the heavy ciricullum of pes and especially the suicide literally killed my expectations of even having some fun at pes lol.."
    }
  ]
}