{
  "id": "psg301",
  "title": "What's my best option out of the following?",
  "content": "PES CS RR (via Pessat, so 3.4lacs),\n\nBMS AI (via KCET, so 1L)\n\nMSRIT IS (via KCET, so 1L)\n\nWhich out of the following is a better option? Fees is not really a problem, but if there's not much difference, we'd rather go for the cheaper ones.",
  "metadata": {
    "root_comment_id": "hdpborz",
    "post_id": "psg301",
    "author": "JacksonDonaldson",
    "url": "https://www.reddit.com/r/PESU/comments/psg301/whats_my_best_option_out_of_the_following/",
    "permalink": "https://reddit.com/r/PESU/comments/psg301/whats_my_best_option_out_of_the_following/",
    "score": 7,
    "upvote_ratio": 0.8999999761581421,
    "created_utc": 1632220435,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "hdpborz",
      "body": "I would choose PES for 2 reasons  \n\n\n1) CSE is better as a course because it's more vast. Bachelor's degree is for understanding your stream. You have Masters and PHD to specialize in a specific topic like AI or IS  \n2) PESU as a college is better than BMS and MSRIT especially in CSE. PES has good placements for CSE"
    },
    {
      "id": "hdptah1",
      "body": "Even I was confused as to how AI and Information science compares to cs\n└── how did u do in KCET?"
    },
    {
      "id": "hdpyhzj",
      "body": "Chumma take CS in RR\n└── u sure? coz i just remembered one of ur older comments : [https://www.reddit.com/r/PESU/comments/pirxfw/comment/hbruxye/?utm\\_source=share&utm\\_medium=web2x&context=3](https://www.reddit.com/r/PESU/comments/pirxfw/comment/hbruxye/?utm_source=share&utm_medium=web2x&context=3)\n    ├── 💀\n    └── That's for mech, CS is good only here atleast better than AI in BMS\n        └── what abt against BMS CS, or RV CS?\n            └── I talked to a bunch of people at RR campus and some from BMSCE, general consesus\n\nRV CS \\~ PES CS >> BMS CS (academics and exposure)  \n\n\nPlacement wise all three are more or less same"
    },
    {
      "id": "hdqb9ji",
      "body": "Since the branches are different, it would be better to look at what exactly you might be more interested in by going through a rough syllabus of each. \n\nBranches aside, a lot about CSE at PES has been posted here already. Just go through the posts and you'll get an idea about the competition, placements etc."
    },
    {
      "id": "hdt8yb0",
      "body": "Lol can I get cse at RR campus through waitlist/spot round with a rank of 3.2K in KCET?\n└── I don't think so mate, didn't CET cutoff went to like 900 last year"
    }
  ]
}