{
  "id": "pv5ywb",
  "title": "[deleted by user]",
  "content": "[removed]",
  "metadata": {
    "root_comment_id": "he7xgl2",
    "post_id": "pv5ywb",
    "author": "[deleted]",
    "url": "https://www.reddit.com/r/PESU/comments/pv5ywb/deleted_by_user/",
    "permalink": "https://reddit.com/r/PESU/comments/pv5ywb/deleted_by_user/",
    "score": 3,
    "upvote_ratio": 0.8100000023841858,
    "created_utc": 1632573456,
    "flair": null,
    "nsfw": false
  },
  "comments": [
    {
      "id": "he7xgl2",
      "body": "did you check out the hostels? how are they?\n├── I’m sorry man, I live nearby to the campus so didn’t have a reason to check the hostels out, I’m pretty sure there are many videos showing the conditions of the hostels\n└── Hostel-lite here, any queries ?"
    },
    {
      "id": "he82y5q",
      "body": "I'm from CSE, but first year of college is common to all branches. Students from all branches will be present in each section and a common set of subjects will be taught to everyone. These subjects, however, are split into physics cycle and chemistry cycle. Half the sections will have chemistry cycle subjects and other half will have physics cycle subjects in the first semester. Then you will have subjects from the other cycle in the second semester. Math and computer science subjects are exceptions, i.e., all sections will have them at the same time, irrespective of the cycle. In your second year, you will go to your department and the department subjects will be taught. I cannot speak for the second and subsequent years, but first year should be easy. Since there is a 85% mandatory attendence rule, I suggest you don't bunk labs, because you will get very few of them in a semester. Be careful with Computer Aided Graphics in physics cycle, as you can lose marks for trivial things, and that'll affect your final grade. All other subjects are not very hard. I don't know about your batch, but we were given a 5 subject notebook. I just carried that, and additional notebooks when I ran out of pages. Stationery is kinda obvious. If you have any other questions, feel free to dm me. All the best!\n\nEdit: Apparently, Computer Aided Graphics is not there in the first year anymore. I had it in my first year, so I assumed it'll be there for you as well. Apologies. Thanks u/interiorcrocodile___\n├── Thanks\n└── computer aided graphics is not there in first year anymore\n    └── That's nice. I had it in my first year, so I assumed it'll be there for them as well. Apologies."
    },
    {
      "id": "he8n6n0",
      "body": "A checklist for college i suppose\n\n1) Don't wear shorts and always carry ID Card (keep it in bag)\n\n2) As a first year student, you'll be in Science and Humanities department, you'll study all subjects for the first 2 semesters... From Second year onward, you'll go to your respective department\n\n3) First week of college will be a Bootstrap program, it's pretty fun, where different departments showcase some application of their branch.. eg Mechanical will show you stuff about cars and stuff, ECE and EEE will have some activities...\n\n4) After the week, your normal college starts, and it's generally divided into Physic Cycle and Chemistry Cycle, the division is random, and if you did Physics Cycle in Sem 1 then you'll do the Chem Cycle in Sem 2.. The Blocks you will be studying in is F Block and G Block\n\n5) Make friends, get to know your peers, most of the clubs will have orientations and recruitment process soon, so keep an eye out for that\n\n6) Some hangout places in college are: OAT, the open area with a small stage near the building admissions happened; 13th floor, the 13th floor of B Block; πr^(3) , near the Food Court, The PESU Bakehouse, first floor of the parking lot near the entrance\n\n7) First Year notes can be found here: [bit.ly/pesufiles](https://bit.ly/pesufiles) (There maybe Syllabus Changes, proceed with caution)\n\n8) All clubs Instagram Handles can be found here: [https://www.reddit.com/r/PESU/comments/mldok0/instagram\\_handles\\_of\\_clubs\\_of\\_pes/?utm\\_source=share&utm\\_medium=web2x&context=3](https://www.reddit.com/r/PESU/comments/mldok0/instagram_handles_of_clubs_of_pes/?utm_source=share&utm_medium=web2x&context=3)\n\n&#x200B;\n\nWelcome to PESU  \nGood Luck!!"
    }
  ]
}