{
  "id": "qzcu3u",
  "title": "Regarding the crowd at pes(both RR and EC campus)",
  "content": "As the CET counseling for this year is going on, so there is a huge dilemma between students who are considering joining pes is that it has a huge crowd that implies placements will fall, so many of 'em are not considering pes(even me). Anyone who has experienced the placements or going to can share some of your thoughts about this. \n\nAbout me: I got a decent rank in KCET and I'm getting AI at BMS, CSE at pes EC and ECE at pes RR so I'm in huge confusion about what to choose. What do you guys think I should choose? and why?",
  "metadata": {
    "root_comment_id": "hlm15dl",
    "post_id": "qzcu3u",
    "author": "kyloren000",
    "url": "https://www.reddit.com/r/PESU/comments/qzcu3u/regarding_the_crowd_at_pesboth_rr_and_ec_campus/",
    "permalink": "https://reddit.com/r/PESU/comments/qzcu3u/regarding_the_crowd_at_pesboth_rr_and_ec_campus/",
    "score": 8,
    "upvote_ratio": 1,
    "created_utc": 1637554837,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "hlm15dl",
      "body": "For CSE placements have been very good this year.Ece people are eligible for most of the  companies."
    },
    {
      "id": "hlma6gy",
      "body": "PES gets objectively way more companies than BMS (I've got friends at BMS who graduated this year). \nThere's actually no comparison at all. \n\nFor example, BMS doesn't even get 10 total companies for Internship Hiring in 3rd year, whereas PES had atleast 40 for my batch. \n\nFinal year placements are the exact same thing, if not more exaggerated. PES has already had close to 130 companies and it's not even December yet. \n\nOh and most companies are obviously looking for CS related majors (CS, IS, AI and the like).\n├── Even though BMS got less companies it makes no harm coz it has less students(compared to pes).\nWould you still consider PES EC over BMS AI?\n│   └── I think you're a little too caught up in counting the university intakes. Frankly, if your course is something you're actually passionate about, you'll easily be in the 90th percentile at least. Keep in mind that, on average, only about 30% of the students in our engineering colleges are actually there because they want to be. (This is purely based on my experiences, no statistics behind it).\n\nAnd also, more opportunities with higher competition is almost always better than fewer opportunities with lower competition, especially in this case. \n\nAnd finally, I'm a little unsure about your question but I'll say this: I'd take PES CS (in either of the two campuses) over BMS CS/IS/AI any day of the week. \nHowever, I wouldn't recommend ECE or related courses over CS at all. \nIf you're stuck between BMS AI and PES ECE, go with BMS cause CS >>>\n│       ├── Everyone in PES would consider PES over another colleges, I thought they were being biased, now I'm starting to realise they are not. I'm getting CSE in ec campus though, now I have to think twice about it.\n│       └── Well Said!!\n\nTotally agree on all points!\n\nCSE as an engineering stream is always populated... CSE in PESU is really good because of academics and the job opportunities\n└── I'm currently in my 4th year at BMS in IS and almost everyone is already placed. I myself was placed in my 3rd year after the summer internship so idk where you're getting your numbers from. We have all the major companies for the internship, on the other hand my friend in pes cs has said that barely any of his seniors are placed and they too have been getting low packages.\n    ├── At the risk of this turning into a dick measuring contest, I'll just let you look up both universities' placement statistics online and you can see for yourself.\n    │   └── Where are they public?\n    │       └── Don't know if you're aware but there's this new, space-age technology called\n\n*The Internet*\n    │           └── lol okay, no point talking to someone brain-dead.\n    │               └── You're the MOD of the completely desolate r/BMSCE subreddit and you got butthurt reading posts about PES. And yet you have the gall to call me brain-dead? \n\nSeek help asap.\n    │                   └── lmao you had to go through my profile and find something to personally insult me cuz you have no argument, your life is so sad, i feel bad.\n\nsearch what \"public\" means on your so called new age technology and come back.\n    │                       └── Here you go, you lazy prick: \n\n[BMS Stats](https://bmsce.ac.in/home/Placement-Statistics)\n\n[PES Stats](https://collegedunia.com/university/28294-pes-university-pesu-bangalore/placement)\n    │                           └── mate you still didn't Google what public means, \"collegedunia.com\" isn't public lmfao\n    │                               └── [Definition](https://www.pcmag.com/encyclopedia/term/public-website#:~:text=A%20location%20on%20the%20World,See%20website%20and%20surface%20Web.)\n\nAre you actually retarded or is that an online persona? \nEither way, you're clearly lacking brain cells. \n\nSeek help mate, although I worry that you're probably too far gone.\n    │                                   └── oh god, and you said you were from cs?\n\n[all good](https://searchcio.techtarget.com/definition/public-data)\n    │                                       └── You said you wanted to see the statistics behind my claims. I provided them. And yet you're so blind to the facts? \n\nAnd now your argument has fallen into the ad hominem fallacy. Congrats dipshit, you played yourself.\n    │                                           └── lmao public data is official data published by a company, i can send some stats from a random website saying SRM is the best college in india, you good mate? Search up research bias lmfao.\n    │                                               └── You clearly don't understand what research bias is. Look it up.\n\nIf you still think that an independent website not associated to the entity in any way and with zero ulterior motives is skewing data that has zero profitability, you're just plain delusional.\n    │                                                   ├── DM me if you're still not convinced. Just don't be delusional.\n    │                                                   └── Ahaha and you're the one concluding that  they have no ulterior motives or biases when their entire website is filled with ads and sponsored college posts. Mate i opened your link for literally 2 seconds and got this, don't tell me what research bias is.\n    └── Hey!\n\nSeniors not getting placed is on the student and not the college.. in the current year, we have got placement offers from the likes of Apple, Microsoft etc.. but only a few people got placed/selected.\n\nThis doesn't reflect on college getting placement offers but on how difficult the tests are or how prepared students were...\n\nso u/kyloren000, the correct question is, does PES get good placement offer? answer is \"Yes\", do people get in depends on how you grasp your subject and how well prepared you are for the placement test"
    }
  ]
}