{
  "id": "r4pobd",
  "title": "How is ECE in PES rr campus?",
  "content": "I got Pes ECE in first-round CET counseling. Don't know whether to choose or wait for the next round.\n\nAbout me: I'm an average student who studied his ass off to get a good rank in CET (I know CET is Prety easy compared to JEE and all but still it kinda a big deal for me), one thing clear about me is that I have passion about CSE and from the beginning, I have tended toward CSE.\n\nNow coming to the main topic, if I join ECE will I get the same opportunity as CSE students? And how are the subjects in ECE? Are they anything related to CSE? I'm hoping to change my branch in the first year(I may sound dumb here). Is there a chance I could change my branch(I'm not studyholic at all)? How is campus life in Pes? I heard the term \"JAIL\" with the name of Pes is it true?\n\nWhat do you guys think I should do?\n\nMY other options: IS in DSCE, CSE in BMSIT, ECE in BSMCE, CSE in Pes ec capmpus.",
  "metadata": {
    "root_comment_id": "hmiil2q",
    "post_id": "r4pobd",
    "author": "okabeRintaro2003",
    "url": "https://www.reddit.com/r/PESU/comments/r4pobd/how_is_ece_in_pes_rr_campus/",
    "permalink": "https://reddit.com/r/PESU/comments/r4pobd/how_is_ece_in_pes_rr_campus/",
    "score": 6,
    "upvote_ratio": 1,
    "created_utc": 1638168092,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "hmiil2q",
      "body": "Hi OP, congrats your CET performance. \n\nCSE in PESU EC campus is by far the best option of the lot you mentioned. That being said, I'd wait for the 2nd round to see if a RR CSE seat opens up. \n\nJust don't choose ECE if you're not interested. \nFeel free to DM if you want.\n└── What are the chances of me changing branch after 1st year in RR campus?\n    └── Frankly, not too great. \n\nIt's insanely competitive the first year and branch changes are solely based on merit.\n        └── If I join EC campus does that make any difference?\n            └── With regard to syllabus, examinations, placements, etc., it makes absolutely no difference."
    },
    {
      "id": "hmioxqy",
      "body": "WRT to placements and internship,many of them are CSE only.\n\nAlso if you aren't interested in ECE bu interested in CSE,then better not choose ECE or else you ll feel like you are wasting time as its irrelevant.\n\nI say go for CS in BMSIT or CSE in EC Campus if you are willing to work hard.\n\nAgain just my opinion which might change due to various circumstances."
    },
    {
      "id": "hmn3pcj",
      "body": "\"First congratulations on getting great colleges. \nWith regards to ECE in PES, unless you like ECE I would say avoid joining as the subjects are hard and not many companies come to take you based on what you learn. However if you're interested in CSE and genuinely pursue CSE outside of the branch subjects, take minors or do projects then you have many companies who will take you for the technical skills you acquire throughout the years.\nThat being said the amount of companies that come to college are high and packages are great too. \nBut taking ECE only for placements won't help you get a high package (unless you like the subject and pursue masters in it)\"\n~ECE 4th year student\n└── It was on the point. I have some other things to ask can I dm?\n    └── Sure!\n\nDo DM for any more help :)"
    },
    {
      "id": "hmogbdw",
      "body": "Hi there, congrats on your CET result. I just want to straight forward with you, go for an option where you are getting what you like \"CSE\". \n\nIF you opt for ECE in PESU, then its gonna be hard for you. There is no commonality in the CSE and ECE topics. The ECE topics alone are so hard that you will spend at least your 2nd and 3rd year in insomnia. The only way to get away from this situation is to study smartly to get the cut off GPA for changing your branch in the beginning of 2nd year and pray that someone from CSE department of the same batch is leaving his/her seat for you.\n\nThe same situation will happen if you sit for the 2nd round and wait for someone to leave their CSE seat\n\nIf you want to make your life easier then directly go for those colleges where your getting CSE as an easy option. You are getting CSE in BMS, go for it.\n\nFinally it comes to what you want.\n\nBest wishes."
    }
  ]
}