{
  "id": "r8p9fm",
  "title": "What was the cuttoff for cse RR campus in second round pessat?",
  "content": "I had got 68X rank ,i had taken cse in ec campus and surrendered before 24th September. Was curious what was the closing rank for cse in RR campus in the second round.\n \nAlso what was the cut-off for cse in EC campus?",
  "metadata": {
    "root_comment_id": "hn72mgy",
    "post_id": "r8p9fm",
    "author": "Wehehewohoo",
    "url": "https://www.reddit.com/r/PESU/comments/r8p9fm/what_was_the_cuttoff_for_cse_rr_campus_in_second/",
    "permalink": "https://reddit.com/r/PESU/comments/r8p9fm/what_was_the_cuttoff_for_cse_rr_campus_in_second/",
    "score": 5,
    "upvote_ratio": 0.8600000143051147,
    "created_utc": 1638623031,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "hn72mgy",
      "body": "1050 something I think\n└── 1050 for cse in RR CAMPUS?\nHow did it go till that rank ..is that the trend every year too?\n    └── 120 more seats this year, so it tracks that cutoff is more this year\n        └── Ah ..so totally how many seats in cse in RR campus?\nAnd what's the matrix/breakup of the seats through pessat,kcet,etc? If you know.\n            └── [https://pes.edu/intake-of-courses](https://pes.edu/intake-of-courses/)/ \n\nThere you go :)"
    },
    {
      "id": "hn74qpw",
      "body": "1057 . Ik this because i missed it by 1 fucking rank lol\n├── F\n├── So what did you choose ?\n└── Guessing you took ECE or something? If you did and the counselling rounds are done you should approach the management. I believe that if a seat or two goes unfulfilled you can probably request for the change."
    },
    {
      "id": "hnc2v98",
      "body": "1000+ my rank was 8xx so I kinda got it with low risk. Idk y I had so much anxiety.\n└── Hi could you please tell me how to prepare for it ? There are ko PYQs of pessat so I don't know what exactly to follow\n    └── It's just cet with an English subject. The sample test they give is misleading. Just prepare well for cet.\n        └── But people say it's more difficult than cet and as difficult as bitsat... Is that not true?\n            └── Paper difficulty wise yeah, competition wise no."
    }
  ]
}