{
  "id": "r8pl5k",
  "title": "This might seem like a stupid question but..",
  "content": "Do Pes RR campus kids have a slight edge over EC campus kids when it comes to higher studies (abroad)? I’m in EC campus, and I keep hearing about how rr campus students have more opportunities,so will this affect my plans of higher studies ? My main goal after these 4 years is a masters, so I was just wondering",
  "metadata": {
    "root_comment_id": "hn704yw",
    "post_id": "r8pl5k",
    "author": "POS272",
    "url": "https://www.reddit.com/r/PESU/comments/r8pl5k/this_might_seem_like_a_stupid_question_but/",
    "permalink": "https://reddit.com/r/PESU/comments/r8pl5k/this_might_seem_like_a_stupid_question_but/",
    "score": 3,
    "upvote_ratio": 1,
    "created_utc": 1638624205,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "hn704yw",
      "body": "No."
    },
    {
      "id": "hnarr17",
      "body": "1) No they don't... EC and RR kids are same (under PESU)\n\n2) There mostly will be a merge between EC and RR campus in the near future\n├── will the placements be the same too? i saw the pdf that u had linked, according to that, EC campus had considerably lower placements\n│   └── The PDF i sent was 2021 batch, The current graduating batch is 2022\n\nFor 2021 batch, PES RR was PES University and PES EC was PESIT\n\nHence there was a difference\n│       └── Which placement pdf ??\n│           └── This is the doc: https://drive.google.com/file/d/17zEt7xdUs2cVWytO770XDjkSuvO7xO9O/view\n└── The degree which PESU ec campus students will get from 2022 will say PESU or PESU electronic city ?\n    └── PESU mostly, can confirm once i get my degree tho xD (i am from RR campus tho)"
    },
    {
      "id": "hnavj0b",
      "body": "Now that EC is autonomous as well, your transcript and degree will be pretty much identical to an RR student. You won't be treated any differently.\n└── Any difference will be due to professors I think."
    }
  ]
}