{
  "id": "re2mvz",
  "title": "PESu EEE",
  "content": "How is EEE at PESU (RR Campus), Considering it's a circuital branch, so almost all companies allow EEE dudes to sit for placements right??(Along with CSE students, and if someone has a really good tech profile, will he get a good job,Considering he has done a minor in cs (sorry I don't know if that does something or not) and has good command over DS Algos..?",
  "metadata": {
    "root_comment_id": "ho7yq7g",
    "post_id": "re2mvz",
    "author": "Exciting_Map_7382",
    "url": "https://www.reddit.com/r/PESU/comments/re2mvz/pesu_eee/",
    "permalink": "https://reddit.com/r/PESU/comments/re2mvz/pesu_eee/",
    "score": 8,
    "upvote_ratio": 1,
    "created_utc": 1639238333,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "ho7yq7g",
      "body": "80% of software companies allow ECE and EE students to sit for their tests. Selection into the company would depend on both your coding skills as well as past projects.\n└── Sorry, but are there also any companies which allow CS and ECE but not EEE?\n    └── There are some that take only CSE and ECE yes. There's an even smaller set that takes only CSE. But overall the EEE guys can probably sit for like 80% of the dev roles that show up."
    },
    {
      "id": "ho8d1zw",
      "body": "*\"EEE in PESU is not like any other department in the same college . They always have extra set of rules  which are blindly followed by students because everyone is too scared to raise their voices against it . So in terms of giving extra not so necessary work, the department will top at it .*   \n*Coming to the placements in IT , yes pretty much all the companies allow EEE students to sit and as long as you are good at the concepts and coding you can pretty much get a good job. Learning the concepts required for placements like DS and Algo is easier (according to me) if you have taken minors .*   \n*PS. I never did a minor course so don't really know if it's easier or the same.\"*  \n\\~ EEE Senior"
    }
  ]
}