{
  "id": "rgvmva",
  "title": "CLUBS!",
  "content": "Fresher here where tf are all the clubs you guys boast about",
  "metadata": {
    "root_comment_id": "homtjlm",
    "post_id": "rgvmva",
    "author": "Imsmortboi",
    "url": "https://www.reddit.com/r/PESU/comments/rgvmva/clubs/",
    "permalink": "https://reddit.com/r/PESU/comments/rgvmva/clubs/",
    "score": 13,
    "upvote_ratio": 0.9399999976158142,
    "created_utc": 1639562122,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "homtjlm",
      "body": "Which club are you specifically asking about xD\n└── Hacking and sports clubs"
    },
    {
      "id": "homwpbc",
      "body": "Ayo I filled the form for the trading club last week.\nHaven't heard backkk. I personally went to the be block and befriended the chairman of CIE, he added me to his mail list. \n\nIf anyone could help me w the trading club, I'd really appreciate it!\n\nThanks"
    },
    {
      "id": "hon02ea",
      "body": "Sit and do dsa.Thats the only thing that's gonna help you..."
    },
    {
      "id": "hon1r7e",
      "body": "ISFCR Club is on the 11th floor in be block,room 1114"
    },
    {
      "id": "honidls",
      "body": "You guys didn't have a \"clubs orientation programme\" or something?\n├── We see our first ISA coming soon but no orientation (˘･_･˘)\n│   └── Lmao you know what their priorities are\n└── No time to plan any orientation mate xD"
    },
    {
      "id": "hoqev7l",
      "body": "There's usually a sort of \"club showcase day\" where clubs will set up booths and whatnot across campus. \nMost clubs also do an event for freshers specifically to get new recruits, so attend those whenever they start. I'm guessing the late start to the academic year messed some timelines up. \n\nDo join a club you find interesting, or hell start one up. Some of the technical clubs are good, but joining one of the extra curricular ones is a great way to meet like-minded people and they're a lot of fun. Joining one was one of the best decisions I made in college. \n\nPlus you get to bunk more classes once you get more involved, so win-win.\n└── Eagerly waiting for it start ^_^ thanks for the reply tho"
    }
  ]
}