{
  "id": "rxh0gq",
  "title": "Attendance",
  "content": "What's the actual minimum I need to write esa's ( with a medical certificate)",
  "metadata": {
    "root_comment_id": "hri7v0y",
    "post_id": "rxh0gq",
    "author": "PegasusTheGod",
    "url": "https://www.reddit.com/r/PESU/comments/rxh0gq/attendance/",
    "permalink": "https://reddit.com/r/PESU/comments/rxh0gq/attendance/",
    "score": 8,
    "upvote_ratio": 0.9100000262260437,
    "created_utc": 1641482443,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "hri7v0y",
      "body": "The soft margin is 85%. The hard margin is 75%. With medical certificates or proof of participation in events, you can claim attendence for the days of absence. In the end, the total must be atleast 75%. If you fail to have the minimum, there will be makeup classes towards the end of the semester which you can attend to claim attendence. Personally, I've seen it happen only for one semester. COVID happened after that and I don't know of the current status of such classes.\n└── >you can claim attendence for the days of absence.\n\nHow so? I already submitted my medical certificate to my hod, so do I wait around for esa's to happen?\n    ├── Last time something similar happened to my friend, the HOD asked him to show them to the VC. The VC verified the certificates then and there, signed them and asked him to submit them to the COE. He also missed the ISAs during his absence, so the whole VC verification might've been necessary. But I'm guessing you won't need that. As for what you should do now, I frankly don't know.\n    └── Yeah wait for sometime, before the exams they send a list of peeps with attendance shortage.. if your name is there on the list, talk to your teachers and tell them about the medical certificate you submitted\n        └── ISA's 1 got postponed and I need to attend about 30 classes to reach the 75% mark b4 end semesters.\n            └── Don't sweat a lot for it\n\nYour medical certificate will be considered and probably try getting some attendance from clubs"
    }
  ]
}