{
  "id": "ry4eyd",
  "title": "Python",
  "content": "Hey guys! \nSo I'm a biology student who's joined EEE branch in PES RR Campus. I'm in 1st semester now and I'm finding Python and programming in the lab quite challenging. I dont seem to understand a lot of the things in class and the lab classes. I have tried reading the slides and use the AV summaries but I don't find it easier either. Is there anything I can do now that's going to get me off and running. It's really hard to cope up in a class that have done/had some experience in programming in Grade 11 and 12.",
  "metadata": {
    "root_comment_id": "hrmf5ny",
    "post_id": "ry4eyd",
    "author": "Greatest-idiot",
    "url": "https://www.reddit.com/r/PESU/comments/ry4eyd/python/",
    "permalink": "https://reddit.com/r/PESU/comments/ry4eyd/python/",
    "score": 7,
    "upvote_ratio": 1,
    "created_utc": 1641551129,
    "flair": "Study Help :table:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "hrmf5ny",
      "body": "Hey, I'm too from biology background. Honestly python is not too difficult I find it very easy. You have just fixed your head that your from biology, just think of it as another ordinary subject.\nIf you still find it difficult try watching YouTube tutorials about python, there are people who thought python in just [6 hours](https://youtu.be/_uQrJ0TkZlc). \nBest wishes."
    },
    {
      "id": "hrmfv3t",
      "body": "There is no single source of knowledge to learn Python programming. It is a mix of reading books, watching YouTube videos, reading articles on the web and a lot of practice. I referred to the book \"Python programming for the absolute beginner\" by Micheal Dawson when I first started out learning Python back in my 10th grade. GeeksForGeeks is a website with really great tutorials for Python (you will also find it useful in the next semester while learning C programming). I also recommend you follow the textbook prescribed for the course. Finally, practice a lot. You could start off with your lab programs and then look online for practice programs. If you come across an error, just copy and paste the error in Google. StackOverflow is a place where thousands of beginners like you post their issues and is a great place to start looking for answers."
    },
    {
      "id": "hrmhu3u",
      "body": "Just an FYI - first sem python is pretty much the same as the basic python taught in CBSE class 11. You can use the CBSE prescribed textbook maybe by Sumita Arora for something very beginner friendly.\n\nAlso - don't read, but do. You're not gonna get how to code unless you actually code."
    },
    {
      "id": "hrmq0ea",
      "body": "Lemme share some tips as a senior.\n\nIf you want to ace this course,you have to solve hard programming problems using python.This will force you to understand the language.\n\nThen the questions from the syllabus will be a piece of cake.\n\nYou can start with hackerrank practice questions using py.\n\nGood luck and keep me updated with the progres...."
    },
    {
      "id": "mu2ganq",
      "body": "Bio background and eee??? How's that possible?? How did u join?? It'd be very helpful by ur reply as iam pcb student who is sooo confused with career af rn!!"
    }
  ]
}