{
  "id": "s0kxdy",
  "title": "CIE Course",
  "content": "Hey guys!\n\nI just wanted to know how helpful and hectic the CIE level 1 course is. I also wanted to know if its better than the other special topics offered.\n\nThanks in Advance!",
  "metadata": {
    "root_comment_id": "hs66257",
    "post_id": "s0kxdy",
    "author": "Lowkey-Lokied",
    "url": "https://www.reddit.com/r/PESU/comments/s0kxdy/cie_course/",
    "permalink": "https://reddit.com/r/PESU/comments/s0kxdy/cie_course/",
    "score": 8,
    "upvote_ratio": 0.9100000262260437,
    "created_utc": 1641823957,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "hs6er8k",
      "body": "I've been a part of both the CIE L1 and L2 and am unsure of what other ST options you have, but CIE L1 is helpful if you want to understand entrepreneurial traits, real-world businesses, how they are modeled (BMC), presentation skills, lean and agile frameworks, and will open you up to a wide range of learning and exploring.   \nIf you're into this, it's a great ST and maybe the best one you'll be offered.  \nAbout how hectic it is, you'll have to find the right team and be open to pivoting, it would be very exhausting at times. We had the best teachers previously(2 semesters ago) in the RR campus, but I heard there were changes in the last sem, the course still has to be the same."
    },
    {
      "id": "hs6qm10",
      "body": "I never took any of the CIE courses, but I was actively involved in some of the co-ops they had. Highly recommend getting involved with it even if you don't take the course.\n\n100% the best technical experience I had in college. I'm average at DSA so I'm pretty sure it was the sole reason behind my internship + placement. It also got me a fun final sem internship without any extra running around.\n└── Just want to know for info, what year do you take these courses or participate in the co-ops in generally?\n    └── I did them in my 4th & 5th sem. They originally pitched it as an open competition for students in the 4th & 6th sem. My team and I decided to continue working on it in the 5th sem.\n        └── Ahh ok thanks for the info"
    }
  ]
}