{
  "id": "soc8z6",
  "title": "PESU RR or RV for CSE?",
  "content": "As it stands now, which one would you prefer if you were eligible for both?\n\n[View Poll](https://www.reddit.com/poll/soc8z6)",
  "metadata": {
    "root_comment_id": "hw7xsdd",
    "post_id": "soc8z6",
    "author": "Traditional-Ad6753",
    "url": "https://www.reddit.com/r/PESU/comments/soc8z6/pesu_rr_or_rv_for_cse/",
    "permalink": "https://reddit.com/r/PESU/comments/soc8z6/pesu_rr_or_rv_for_cse/",
    "score": 7,
    "upvote_ratio": 0.8899999856948853,
    "created_utc": 1644409096,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "hw7xsdd",
      "body": "Admissions are not yet over??\n└── No. Afaik they're closed. Just surveying for a class 12th student."
    },
    {
      "id": "hw8ac86",
      "body": "Join rv. PES is getting real fucked up in terms of the workload. You won't regret it\n└── Quite a few tell the same thing i.e. the workload in PES is hectic.Won't RV have a similar workload?\n    └── Doubt. PES just gives unnecessary work. We have internals after every unit. Nobody has that shit. We have \"experimental learning\" which is labs for every subject which isn't even counted. Imagine doing all of this garbage when you're in your pre final year worrying about capstone and placements. They just keep dumping work on us without giving a damn about whether or not we can handle it."
    },
    {
      "id": "hw8b3vg",
      "body": "Currently in 4th year\n\nIn PES, we are now studying subjects of 8th sem and we have a good flexibility to do internships or take up special topics in 8th sem\n\nIn RV right now, i have heard that thier 7th sem finals exams aren't done and they haven't even finished thier project work for Engineering. 0 flexibility to take up any internship.\n\nDuring the pandemic, PESU being a private institution and having a better curriculum could better adapt and change thier course and system to benefit the students in the long run but RV and BMSCE are struggling to catch up with semesters and will graduate late which will affect thier career in the long run!\n\nI would say take PES (yes it's hectic) as it's more dynamic and up to date with education standards"
    },
    {
      "id": "hw8r8fo",
      "body": "RV CSE/ISE anyday of the week.\n└── Would love to hear a more elaborate reason."
    },
    {
      "id": "hw94k7l",
      "body": "I was in PES CSE\nI'm in RV (CS+AIML) now.\n\nMajor con of PES is the massive intake.\nSomeone mentioned about internships and flexibility - the no. of people getting selected for top firms like Goldman Sachs and JP Morgan, etc are more from RV. \n\nThe pandemic situation is now over. Offline classes have begun and everythings back in place. \n\nPES curriculum might be updated but if u look at CSE/ISE packages, RV beats PES anyday and that's what matters in the end.\nRV is autonomous so they don't blindly follow VTU scheme either.\n\nIf you need a more credible source, look at CET cutoffs lmao\n├── One thing I'd like to say is that PES is more modern when it comes to admin stuff - like the app etc. Plus the CIE (basically E-Cell) at PES looks promising. \n\nCan't say anything about RV E-Cell as they've not started inductions yet.\n\nBoth have amazing students. The concentration tho is more at RV.\n└── Adding onto the packages thing, that isn't a point of comparison because it ultimately depends on how well a student studies, all that matters is the opportunity the student gets!\n\nIf you talk about opportunities, then PES has got Apple and Microsoft for placements too, and ig even RV would have big names!\n\nAll that matters is the college experience, people and education standards, and after talking with several RV peeps and through personal experience, i feel PES edges out!"
    },
    {
      "id": "hwc56bo",
      "body": "Don't join PES. It's extremely stressful. Probably 100 times more than any other engineering college in Bangalore. Prioritize your mental health over everything and don't join PES. They gonna f you up real soon. Especially with offline college. \n\nI get it, the curriculum is hard for a reason and it'll all be beneficial in the end. BUT what's the fuckin point when you're so burnt out in 1st year itself? Screw the timelines and everything. Think about whether or not you can handle that stress cause it's way too much here. Hope this helps you."
    }
  ]
}