{
  "id": "sq6sa6",
  "title": "Internship",
  "content": "Is it possible to do internship in first year summer vacation? I got selected for Google STEP which a paid internship . April I final have interview for that. So if i get selected should i bunk classes and work there because teachers told we won't get any vacations this year. And at last is it worth it to do a internship in your first year and missing class because of it?",
  "metadata": {
    "root_comment_id": "hwk1xxm",
    "post_id": "sq6sa6",
    "author": "FickleAd4141",
    "url": "https://www.reddit.com/r/PESU/comments/sq6sa6/internship/",
    "permalink": "https://reddit.com/r/PESU/comments/sq6sa6/internship/",
    "score": 12,
    "upvote_ratio": 1,
    "created_utc": 1644605962,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "hwk1xxm",
      "body": "If it's a summer internship lasting only till the beginning of the next year then go ahead, it'll add value as a source of experience on your resume. The college will not compensate any lost hours. \n\nIt's entirely upto you to manage attendance if the internship doesn't end by the commencement of the next semester."
    },
    {
      "id": "hwnjkhc",
      "body": "Hi,\n\nThis is my perspective\n\n\\> Getting an internship in 1st year itself is too early as you haven't even started studying your own course\n\n\\> College will only allow internships during sem 7 and 8; and i feel that is the right time to take up internships\n\n\\> I suggest to not bunk classes for internships from year 1. Rather take up extra courses and start honing  your skills, this would greatly help you in future placements/internships\n\n\\> Spend your first few sems learning and understanding what you really want to do in your career and in later sems start working towards it!\n└── Google step is only for 1st and 2nd year students , still thanks for the advice"
    },
    {
      "id": "hwv6qlt",
      "body": "First of all - congratulations!\n\nFrom what I know, the STEP program is more of an early mentorship program than a full fledged internship. That being said, it's a great opportunity. \n\nI'd say that if you get through, talk to the HoD of your department (guessing it's CS) and just explain the situation. You will be met with a fair bit of resistance, but remember that the college wants big placement numbers and whatnot, and Google is a big name. They aren't going to say no to the opportunity to say \"first year student bags internship at Google\" and whatnot. You may be able to come to some kind of mutual agreement. \n\nI will say though that it's important not to burn yourself out early. If you've got classes going on and you're choosing to go, you should make sure you can keep up with both. Neither is worth your health getting compromised.\n└── Thanks for the advice surely I will keep this on my mind"
    }
  ]
}