{
  "id": "t7dd0f",
  "title": "Campus Confusion",
  "content": "I am a student of class 12th and will be giving PESSAT 2022 I want to pursue Engineering in Computer Science\n\nThere are two campus of PES one situated in Ringroad and one in Electronic City... According to what I have heard Ringroad is the more prestigious one and long ago the EC campus students were not eligible for many internships and Placements... Is it still the same ?\n\nBecause the Electronic City campus is really close to my house so if both are considered equals now in terms of studies and placements it would save a lot of travel time for Me\n\nAlso is it comparatively easier to get admission in the EC campus?\nPlease feel free to provide me with any additional details and guidance !",
  "metadata": {
    "root_comment_id": "hzh523k",
    "post_id": "t7dd0f",
    "author": "akash_j8",
    "url": "https://www.reddit.com/r/PESU/comments/t7dd0f/campus_confusion/",
    "permalink": "https://reddit.com/r/PESU/comments/t7dd0f/campus_confusion/",
    "score": 8,
    "upvote_ratio": 0.9100000262260437,
    "created_utc": 1646498556,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "hzh523k",
      "body": "Bro, I've been to both campuses. Please please go to the electronic city campus.\n\nFirst of all, there are a few benefits of EC campus as opposed to rr. Both campuses have their own plus points. For my purposes, RR was better. \nEC campus is HEAVILY underrated. There were a few RR students who moved to EC for computer science, and they're loving the campus. The teachers I had at EC were more passionate about teaching and connecting with the students than the teachers I have at RR right now. \nA few years ago, the campuses were following different syllabi, now they're the same. \n\nRr is overrated and ec is underrated, since there was more demand for rr in the past, more kids tried competed to go to rr and perform, which became a self-fulfilling prophecy. There's a belief that rr has a better peer group, but from what I saw, ec students cared more about working hard. 😂\n\nSummary: From certain angles, rr miiiight have some benefits. But if you save on travel timw and effort, that will overcompensate and outweigh any sort of minor benefit that RR has. Ask anyone who travels far to college, it takes so much out of their body, and having a home close to their college would be more beneficial over 4 years than anything else. Whatever field you look into, extreme scenario, rr could be only slightly better. Short travel is too good of a benefit, to your academics and life too, compared to any other difference.\n└── Thank you so much for taking out time to give all the details!! Its definitely helpful"
    },
    {
      "id": "hzh5yhw",
      "body": "Rr seems to have more events. EC campus people are still allowed to attend most events lol. \nFor placements, all students will come to RR campus. No one will be differentiated. When you get your degree and documents, it will only say PES university. It won't mention what campus you belong to. This is what we heard at the orientation. \n\nI guess..... It's comparatively easier to get admission in ec campus cause it was underrated, but this is not something I think you should even think about until your exams are over lol. No matter what news you hear, study maximum. I don't want you to think you can chill with your studies because ec is easier. \n\nAlso, EC campus accomodates its students well and has nice open spaces. Ec is very scenic. Right now all RR students are cramped, and if you ask anyone, they'll tell you how much of an eyesore the construction building is. But the building will be finished in 1 or 2 years, hopefully there will be a little more space then. This may not be a relevant detail for you either lol.\n└── Thank You... Its definitely helpful.. also what makes PES so expensive I mean the other top colleges take  around 2lakhs per year while PES is 3.6lakhs per year approx ! (I'm not from Bangalore so I cannot give CET I'll be giving PESSAT and COMEDK... Fee through CET is lower)\n    └── Well it's expensive because you are paying for the brand and good quality education...\n\nAs you are pursuing CSE, if you do well in your course and get a decent placement offer.... You can techincally payback the money invested in college in just few years.\n\nThe placement scene in PESU is really good and if you manage to do well and be skilled enough, your career will have a good beginning\n\nGood Luck!"
    },
    {
      "id": "hzk6oey",
      "body": "Don't go to any campus...pes is shit"
    }
  ]
}