{
  "id": "t837in",
  "title": "Info about Internships",
  "content": "Does PES hold any on campus intership placements during 3rd or 4th year? \n\nAlso what's the general time during which students take up internships? I have seen some students do internships in 2nd year also, how does that work? \n\nCan we get attendance relaxation for internships?",
  "metadata": {
    "root_comment_id": "hzlvm6f",
    "post_id": "t837in",
    "author": "thundr_strike",
    "url": "https://www.reddit.com/r/PESU/comments/t837in/info_about_internships/",
    "permalink": "https://reddit.com/r/PESU/comments/t837in/info_about_internships/",
    "score": 12,
    "upvote_ratio": 0.9399999976158142,
    "created_utc": 1646586435,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "hzlvm6f",
      "body": "On campus internship placements occur during the end of 5th semester and 6th semester for summer internships (the summer between 3rd and 4th year). Apart from that, internship placements also take place throughout 4th year (although most, if not all, are for internship + full time roles).\n\nMost people take up an internship during the 8th semester. A few during the 7th semester and a few during the summer. Some take up internships in both semesters and some take up an internship during the summer and another additional semester. Mainly depends on if you get an offer or not, and the credits you need to graduate.\n\nAttendance relaxation for internships only takes place during the 4th year (since you barely have any courses). Except that, there is no relaxation on attendance requirements for pursuing an internship."
    },
    {
      "id": "hznurp1",
      "body": "For Mechanical Engineering\n\n\\> We can take up internships form 7th and 8th sem but offers came to us through PESU Placements office by the end of 6th sem\n\n\\> If you take up before 7th sem, there won't be any credits conversion, so it's more like extra work on top of college work\n\n\\> We had no attendance relaxation but we had few subjects... the conversion was 3 weeks of internship = 1 credit\n\n\\> You can claim a max of 8 credits from internship, and your 4th year is of 14 credits... the leftover credits should be claimed by taking up special topics in college or Swayam courses."
    },
    {
      "id": "hzp3meh",
      "body": "do companies come for internships after 2nd year?"
    }
  ]
}