{
  "id": "u14rm5",
  "title": "5.9 SGPA what to do? :(",
  "content": "Hey seniors, I got my first semester results yesterday and got very bad sgpa. My parents are very disappointed but luckily they still believe in me. \nHonestly it’s my fault, I didn’t real put that much effort, but also our semester was 3 months long with 6 months worth of syllabus.\nFucked it up badly, got only 5.9GPA.\nCan I increase gpa to 7.5+ in the coming semesters? Can you give me some tips/advice/motivation? I’m in a really bad place rn, and I don’t wanna waste my parent’s money",
  "metadata": {
    "root_comment_id": "i4a5yku",
    "post_id": "u14rm5",
    "author": "IntegrationDifferent",
    "url": "https://www.reddit.com/r/PESU/comments/u14rm5/59_sgpa_what_to_do/",
    "permalink": "https://reddit.com/r/PESU/comments/u14rm5/59_sgpa_what_to_do/",
    "score": 16,
    "upvote_ratio": 0.949999988079071,
    "created_utc": 1649673665,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "i4a5yku",
      "body": "Ok so what u got is pretty low. By the end of 6th sem try to have a CGPA something above 7 which should be the bare minimum I feel. I have seen a lot of folks who score 6 sgpa in 1st sem ending up with 8+ cgpa by the end of their course. Also word of advice: 1st year supposed to be chill. 2nd year and 3rd dont mess up. Most ideal situation after 6 sems is 8+ cgpa but it takes a good amount of effort. Even if u dont get that 7+ is a must if u wanna be placed.\n└── I realised sulking is useless now, this is a wale up call. I am ready to a lot of effort into increasing my cgpa. Thanks for your advice!!\n    └── Good Luck my man\n        └── Thanks a lott!!"
    },
    {
      "id": "i4e74o0",
      "body": "Bro lmao i was in low 5's cgpa up until 6th sem, I got it to 6.5+ in 2 sems with lower credits as well. You can easily bump it to even 8+, so much time is there. Don't sweat it.\n└── Thankss man!! You have no idea how much this means to me rn"
    },
    {
      "id": "i56e5ny",
      "body": "वीप"
    }
  ]
}