{
  "id": "u97tgp",
  "title": "do companies like Goldman Sachs, JP Morgan, Morgan Stanley visit PES for recruitment?",
  "content": "i'm someone very keen on finance, do investment banks or even management consultant companies visit PESU?",
  "metadata": {
    "root_comment_id": "i5pvd5j",
    "post_id": "u97tgp",
    "author": "[deleted]",
    "url": "https://www.reddit.com/r/PESU/comments/u97tgp/do_companies_like_goldman_sachs_jp_morgan_morgan/",
    "permalink": "https://reddit.com/r/PESU/comments/u97tgp/do_companies_like_goldman_sachs_jp_morgan_morgan/",
    "score": 5,
    "upvote_ratio": 0.8600000143051147,
    "created_utc": 1650608101,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "i5pvd5j",
      "body": "Yes they do!\n\nThere's a variety of companies that come to PES for placements\n\nFocus on your skills and try your best to get placed"
    },
    {
      "id": "i5q2k1n",
      "body": "Are you looking to join such companies in a technical capacity? If yes, continue reading.\n\nI know someone who got into Morgan Stanley. Around 12LPA is the pay. Internship pays slightly lesser but right around the FTE pay. The projects you get to work on simply depends on what's going on. My friend is working on some ML related thing.\n\nNaVi technologies also came. 26-28LPA was the pay. CRED came. Around 40LPA. Don't remember the rest.\nThe thing is these companies come very early in the placement cycle (right at the beginning of sem 7 - August to September). You HAVE to be prepared way before that to even get an opportunity to be shortlisted for these companies. It ain't easy.\n\nGiven what the curriculum structure PES has planned for y'all juniors, I'd say may whatever higher power you believe in, guide you.\n\nTLDR: Yes they do. But you gotta git gud and prepare early on to join them. They come in the initial wave of placements.\n├── will be able to land finance roles if we do an MBA later?\n│   └── Not really sure there. That would depend WHERE you get your MBA from and how much relevant knowledge and experience you have prior to getting an MBA. \n\nSwitching to completely different fields after investing so much time and money in a technical degree isn't something I would recommend. On the other hand moving up the ladder into management from a technical role is sound advice.\n\nFrom the looks of things, it doesn't look like you're interested in a technical role. Someone who's doing a financial degree might be able to shed some light here.\n└── Can you tell what to prepare other than pesu syllabus to get these kind of jobs??\n    └── https://www.reddit.com/r/WorkReform/comments/srphhh/a_guide_to_entering_into_software_engineering/\n\nHere's a shameless plug. \nI created this post for this purpose though @.@\n\nGo all the way down to Jobs. It should cover some of the bases. \n\nTLDR\nCompetitive coding and more domain knowledge is vvv important.\n        └── Thanks for this\n            └── 😎🤙"
    }
  ]
}