{
  "id": "uge8f3",
  "title": "5 ISAs",
  "content": "How bad or good is the 5 ISA system?",
  "metadata": {
    "root_comment_id": "i6zrqm7",
    "post_id": "uge8f3",
    "author": "Immortal____",
    "url": "https://www.reddit.com/r/PESU/comments/uge8f3/5_isas/",
    "permalink": "https://reddit.com/r/PESU/comments/uge8f3/5_isas/",
    "score": 8,
    "upvote_ratio": 1,
    "created_utc": 1651454148,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "i6zrqm7",
      "body": "I personally really like it.\n└── Why? could you explain.\n    └── Just lower weightage on the isa's and more on the assignments. Plus that reduces the overall stress you might take on a singular standalone isa. And you get used to studying on a weekly basis so you don't fuck esa up as much lol. But no, before if you messed an isa up you knew there was no coming back from that. But with the best 4 out of 5 and the reduced weightage, you can always make up for it."
    },
    {
      "id": "i715b26",
      "body": "It seems way better on paper. I've never gone through this system though.\n\nThe chance of you fucking up is low. It was so bad for us that you could could with certain accuracy predict your grade after the first ISA (in the 2 ISA system)\n\nI think you can flunk one ISA without it affecting your grade. You cannot afford that with the other system.\n\nYou don't study 5th unit and leave it unread for ESA. If you're doing other extra curricular stuff or something unexpected comes up right before ISA, the pressure to study is immense. \n\nYou get more marks with this system. They give you more chances to get good grades. \n\nBefore, lecturers who were lagging behind would rush right before a test. 5th unit was an afterthought sometimes. Now they're forced to pace themselves and cover portions on time. \n\nWe all had assignments. We've complained about assignments as well. \n\nI cannot for the life of me understand why people think this system is bad. Yes it's a more involved system. But all the arguments I've heard against it treat this system as an inconvenience rather than providing good reasoning to why it's bad.\n\nYes you get lesser time to do things, but that isn't because of the ISA system.\n└── Honestlyyyy. And the fact that all the isa's only have mcqs is such a plus.\n    └── Wait what ? All subjects have only mcq's?"
    }
  ]
}