{
  "id": "unxyag",
  "title": "Single digit in ISA",
  "content": "I’m in my second semester right now, and our first internals are almost done. I pretty much flunked all of them. It’s not like I didn’t understand the topics, I just didn’t study until the last minute. I’m sure I’ll get less than 20, ney, less that 15 is all subjects. I am planning to actually put in effort from next week and work hard for isa2. But will these fuckall scores of ISA1 bring my whole semester’s marks down?",
  "metadata": {
    "root_comment_id": "i8awe0w",
    "post_id": "unxyag",
    "author": "burnerakoont",
    "url": "https://www.reddit.com/r/PESU/comments/unxyag/single_digit_in_isa/",
    "permalink": "https://reddit.com/r/PESU/comments/unxyag/single_digit_in_isa/",
    "score": 13,
    "upvote_ratio": 1,
    "created_utc": 1652351150,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "i8awe0w",
      "body": "Am I pretty much fucked, or can I have an epic redemption?"
    },
    {
      "id": "i8be0i8",
      "body": "If you have the new 5 ISA system, then its not an issue because they will simply take the best 4.\n\nBut if you have the 2 ISA system (like my batch did), then I shall be honest, things aren't looking bright. With only 2 ISAs, the contribution from each ISA is higher, and it's almost possible to predict your final grade even before you write the ESA. Getting < 50% of the score in even one ISA is almost guaranteed to bring down the maximum possible grade to A or even a B\n├── ;_;\n└── Can I get above 7.5 sgpa? Like if I study properly\n    └── Yep, that is still possible. Even if you get all B's I think that is an 8 SGPA if I am not wrong\n        └── So basically 5ISA system is a good thing no?\nBut I heard that there’s isa every other week. How does the system work. Will we get time to properly practice, study and do other stuff like assignments, projects or even chill\n            └── It works on paper but not in practice.\n\n5 ISAs mean that you get more room to screw up and cover up a bad performance, but it also means you need to consistently study week after week without any break, along with the added burden of assignments, projects, labs etc happening every week.\n\nPeople would rather give two ISAs where they need to study more per ISA because there is a larger gap between the two, giving you time to chill and rest as well as time to finish up other deliverables so you don't have to work on them during the test weeks."
    }
  ]
}