{
  "id": "us7hjk",
  "title": "Info about Ec Campus hostel",
  "content": "For the EC in-campus hostel what is the curfew timing and are the gaming sites like steam,riot blocked?",
  "metadata": {
    "root_comment_id": "i91unwf",
    "post_id": "us7hjk",
    "author": "Spidak10",
    "url": "https://www.reddit.com/r/PESU/comments/us7hjk/info_about_ec_campus_hostel/",
    "permalink": "https://reddit.com/r/PESU/comments/us7hjk/info_about_ec_campus_hostel/",
    "score": 5,
    "upvote_ratio": 1,
    "created_utc": 1652859421,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "i91unwf",
      "body": "Yes riot is blocked. You can use Hotspot and play tho. There are a Lotta restrictions. But make sure you have a personal boat in the rainy season.\n├── What else is blocked like are Netflix prime available? And what about curfew timings?\n│   └── As far as ik all those are blocked. Curfew is manageable till 8 or 9 in the boys hostel on campus\n└── Okay thank you"
    },
    {
      "id": "i926i96",
      "body": "Brother you can use anything you want as long as you are smart enough. Sites are blocked sure. But VPNs are available so yeah. You can game as much as you want"
    },
    {
      "id": "i94xilw",
      "body": "Attendance 7:30 onwards. You could come in anytime before 10 (but you'll have to inform the warden if you're that late. They're chill as long as the reason is valid.) I've come in as late at 8:45 - 9 without the warden being suspicious. You got to look out for the guards at the college gate though. They're the ones who'll get you in trouble.  Once past that, you're good to go.\n\nWiFi scene is the same throughout campus. Blocked from gaming sites as far as I remember. Tunneling can cause latency issues and sometimes long episodes of lag spikes depending on how fast / reliable the service is. VPNs are prohibited by college. Do what you want with this information.\n\nI've gotten decent latency (50-100ms) on my phone connected by usb tethering."
    },
    {
      "id": "ihbm6a8",
      "body": "Is the hostel outside campus for first year students?\n└── Yep\n    └── So does it affect the college life in any way ?\n        └── Not really as there is very little “college life”"
    }
  ]
}