{
  "id": "v1r925",
  "title": "Still confused about grading",
  "content": "I’m in 2nd semester and relative/ absolute grading is still confusing to me. Do they do absolute grading in almost every subject? \nFor example I got 24 in a subject in isa1, do I still stand a chance of getting A grade in it?",
  "metadata": {
    "root_comment_id": "iao80rb",
    "post_id": "v1r925",
    "author": "TraditionalSir9962",
    "url": "https://www.reddit.com/r/PESU/comments/v1r925/still_confused_about_grading/",
    "permalink": "https://reddit.com/r/PESU/comments/v1r925/still_confused_about_grading/",
    "score": 4,
    "upvote_ratio": 0.75,
    "created_utc": 1654006479,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "iao80rb",
      "body": ">I’m in 2nd semester and relative/ absolute grading is still confusing to me. Do they do absolute grading in almost every subject?\n\nThe system is not completely transparent so it is difficult to say with certainty whether the evaluation is absolute or relative. Beyond a point, people stop trying to understand it because there isn't anything beyond speculation.\n\nHowever, they do follow the absolute grading *closely* for all courses. Sometimes if the entire batch screws up a course, it tends to become *something* *similar* to relatively grading. Again, no idea about the details because nobody knows the math behind how it works. If you want a close estimate of what you could get, assume it to be absolute and perform your calculations. That way you will account for your worst-case scenario so it works out anyway.\n\n>I got 24 in a subject in isa1, do I still stand a chance of getting A grade in it?\n\nIt depends on how you do your ISA 2 and ESA. If you get a similar score in ISA 2, then it's not possible. An A grade is roughly 80+ overall (ISA + ESA + assignments + project). To get an A grade you will *probably* need at least a 30+ in ISA 2 and at least an 80+ in ESA.\n└── Relative grading at least in ECE is a no go. Second year NAS only two people in branch got B. Rest all got D, E, F. We asked HOD for relative grading and she just asked us to piss off so lmao. But I know a few subjects in CSE got relative grading. So I’m guessing it depends on branches. Some are more lenient than others"
    }
  ]
}