{
  "id": "vfrtge",
  "title": "career guidance",
  "content": "Hey so I am an ECE student from RR campus who recently finished 4th sem and is pursuing CSE minors.Just wanted to know if internships at this point are important or is it okay to build upon some skills untill 6th sem and then go for internships as I havent developed any skills as of now. Also wanted to know what recruiters look for in general while applying for internships as I am interested in going towards the IT sector...",
  "metadata": {
    "root_comment_id": "icy6sg7",
    "post_id": "vfrtge",
    "author": "Huckleberry-4915",
    "url": "https://www.reddit.com/r/PESU/comments/vfrtge/career_guidance/",
    "permalink": "https://reddit.com/r/PESU/comments/vfrtge/career_guidance/",
    "score": 5,
    "upvote_ratio": 0.8600000143051147,
    "created_utc": 1655632583,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "icy6sg7",
      "body": "Build skills. Getting summer internships at sem 6 isn't easy, but you can try. Most recruiters aren't picky as to which B.Tech. course you've done. They just want you to be strong in basics + any language they want to recruit for (like Java, JS, C, etc). They ask networking and os fundamentals and stuff during interviews as well. Look into DSA. It'll help for writing the technical tests.\n\nEDIT: here's a shameless plug. Go to the jobs section. It should help a bit. \nhttps://www.reddit.com/r/WorkReform/comments/srphhh/a_guide_to_entering_into_software_engineering/\n└── Cool, thank you so much! I have a follow up question though if it's okay, just wanted some more insight on why getting summer internships in 6th sem isn't easy..\n    └── It's not a simple answer. There are many reasons \n1. People in general aren't prepared / experienced enough to sit for them by the time the companies come for recruiting. You'll certainly get better but by that time FTE and 8th sem internship recruitment would've started. \n\n2. There is a huge time gap between you finishing your internship and getting your degree so you can start full time there. They know lots of companies come for placements and you'll certainly get placed in a better position if you get recruited for summer internship. Many companies simply aren't going to risk that investment.\n\nSome companies do have summer internship programs so it's not a problem, but many don't want the hassle and logistics of ramping up an intern for 2 - 3 months. \n\nSome continue into 7th sem as well. But point 2 still stands here. I know a couple people who've left the current company they interned over the summer and into the 7th sem leave during December - January to another better position. \n\n3. Most importantly, The number of positions open are less. So demand > supply issue occurs which increases the competition.\n        └── Ah I see... Thank you so much for your inputs, it means a lot!!"
    }
  ]
}