{
  "id": "vq23dk",
  "title": "7&8 semester",
  "content": "What is the curriculum of placements and project in this time and what are the subjects and how is the classes scheduled?",
  "metadata": {
    "root_comment_id": "ienppsg",
    "post_id": "vq23dk",
    "author": "Affectionate_Cod_371",
    "url": "https://www.reddit.com/r/PESU/comments/vq23dk/78_semester/",
    "permalink": "https://reddit.com/r/PESU/comments/vq23dk/78_semester/",
    "score": 6,
    "upvote_ratio": 0.8799999952316284,
    "created_utc": 1656798579,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "ienppsg",
      "body": "Companies start visiting for placements around July end. Although they do keep coming until you graduate, most of the good companies are done by December end. \n\nAs far as I know, your capstone project phase 2 was split into 7th and 8th semester for 4 and 2 credits respectively. Can't say more about this because the system was different for my batch. But regardless, you'll need to resume work which was started in semester 6 and finish it.\n\nThere are a few 2-credit special topics you need to take up to meet the credit requirement to graduate. As for classes, since my batch had it online we didn't have attendance and nobody attended. Things will be different now from whatever I've heard.\n├── Capstone starts in the 6th sem now? It used to be across the 7th & 8th sems for my batch.\n\nHopefully this means newer batches can do their final sem internships in peace without worrying about their projects and publishing, especially if they're not looking to get into research.\n│   └── For my batch (2022), it was in 6th and 7th. For the 2023 batch, it's 6th, 7th AND 8th.\n\nSo yeah, the opposite is happening. It's getting stretched across more semesters.\n│       └── Oh god that sounds awful. It's hard enough to commit to one project over the course of an entire academic year. 1.5 is way too much. Plus it's always going to get less priority in the final sem thanks to internships.\n└── Thanks for the anwer,just one more thing to ask is that in cse only special topics are there in 7&8 sem or core and electives are also there?\n    └── My batch had only special topics. News is that the 2023 batch *might* have an elective course as well, although there is **no confirmation** on the matter."
    }
  ]
}