{
  "id": "vxf9c3",
  "title": "PPO and Placements",
  "content": "Just wanted to know, if we receive PPO from a company (through an internship which I obtained through college) will I be able to sit for placements if I reject the PPO.",
  "metadata": {
    "root_comment_id": "ifw3zf6",
    "post_id": "vxf9c3",
    "author": "InformationNo6409",
    "url": "https://www.reddit.com/r/PESU/comments/vxf9c3/ppo_and_placements/",
    "permalink": "https://reddit.com/r/PESU/comments/vxf9c3/ppo_and_placements/",
    "score": 15,
    "upvote_ratio": 1,
    "created_utc": 1657643175,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "ifw3zf6",
      "body": "The college's placement policy states that a student cannot sit for placements anymore if any of the following conditions are met (**in any order**):\n\n* They have already received 2 offers\n* They have already accepted an offer\n\nThis means that if you get an offer, you have 2 options - either you accept or reject it. If you accept it, you are out of the placement process. \n\n**If you reject it, and if you have already rejected an offer in the past, then you will still be out of the placement process** (since the policy simply allows you to *receive* 2 offers, not accept. However, **if this was the first offer you received and if you reject it, you can still receive one more offer** before being removed from the placement process.\n\nSo to answer your question, yes you can reject the offer and still be able to sit for placements (assuming that this is the first offer you are rejecting).\n└── @aditeyabaral Thanks for clarifying.\nI got one more doubt here. Say a person didn't get any PPO, so he will be eligible for 2 offers right?\n\nAnd, now (say) he gets an offer from Tier1 company. Will he be allowed to take the the offer? As far as I heard if he gets an offer from tier 1, he will be out of placement. And if he gets from Tier2 first then he is allowed for Tier1. So, is this two offers you are saying (Tier1 and Tier2), or the 2 offers can be from Tier1 ?\n    └── Ah yes, forgot to mention this point. College has 4 tiers based on the CTC being offered - \"Dream Company\", Tier 1, Tier 2 and Tier 3.\n\nIf you get an offer from Tier X, you can again only sit for placements for companies *above* Tier X, **as long as you have not already rejected 2 offers**. So if you accept an offer from Tier 2, you can still sit for Tier 1 and Dream Company. \n\nMy original comment was in the specific case for Tier 1. Since there are only 1-2 \"Dream Company\" tier companies, accepting one Tier 1 company's offer practically rules you out of placements.\n        ├── Whcih companies comes in \"Dream\"\n        │   └── Any company offering more than 30-35 LPA as CTC. In our case was Apple (offered around 50 if I remember)\n        │       └── CRED was also there with 40 I believe. 1 or 2 more were 30+ CTC I guess but I forgot.\n        ├── There may be companies that **ONLY** come for internships (8th sem) like my case. In that situation you will be eligible to sit for any FTE **ONLY**. There will be companies that come for FTE + Internships -> can't apply there meaning if you already have an internship through placements, you won't be able to sit for companies with this type of offer.\n        └── Suppose one gets an offer from a tier-3 and accepts it, then gets an offer from a tier-2 company and accepts. Now will person be allowed to sit for tier-1?\n            └── Nope, only 2 offers at most"
    }
  ]
}