{
  "id": "vy870i",
  "title": "adjusting my cgpa or is it too late?",
  "content": "So im a 2nd sem student...and i have got around 7 sgpa in 1st sem...2nd sem isnt going that well ...acc to me...i ll get around 7 or maybe less than 7 this semester  which ll bring me to 6.5-7 cpga.....is it a good score?...or am i down bad? Or what should  i do in the future?",
  "metadata": {
    "root_comment_id": "ig0pnq1",
    "post_id": "vy870i",
    "author": "Fun-Understanding862",
    "url": "https://www.reddit.com/r/PESU/comments/vy870i/adjusting_my_cgpa_or_is_it_too_late/",
    "permalink": "https://reddit.com/r/PESU/comments/vy870i/adjusting_my_cgpa_or_is_it_too_late/",
    "score": 7,
    "upvote_ratio": 1,
    "created_utc": 1657731651,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "ig0pnq1",
      "body": "Not sure what you wanted to hear, but the only answer is to put in maximum effort into every course from right now.\n\nThe good companies have a cgpa cutoff for placements, so if you are below 8-8.5, you will not have a chance to apply to them."
    },
    {
      "id": "ig0rspn",
      "body": "No sugar coating, 6.5-7 is not a good score. \n\nHere are the raw facts: \n\nYou need at least an 8 to be eligible to even sit for almost all companies (however very rarely do some have it at 7.5). Assuming you somehow do have an 8, shortlisting after giving a placement test is based on how you perform in the test + your CGPA, which will again put you at a disadvantage if you have a less GPA compared to the others in your batch. \n\nYou are currently only in the 2nd sem (and arguably also the easiest year to score in), and semesters will get tougher and tougher with more deliverables, more effort, lesser time. If I am not wrong from the next year you will also have the 5-ISA system which will suck out even more free time. 2nd year is also your only last chance of increasing your CGPA since 3rd year is mostly just maintaining it and it is really difficult to make vast improvements. Your resume and CGPA at the end of the 3rd year are submitted to the placement cell, so even if you get a 10 SGPA in the 4th year it won't help you cause its too late by then. This gives you exactly 4 more semesters to make improvements to your skill set, resume and CGPA.\n\nHowever, 4 semesters is a decent amount of time to make improvements. Ensure that you pick up where you are lagging and try to hit at least an 8 CGPA. Work on your skills and make sure your resume has something to show."
    },
    {
      "id": "ig0ti6n",
      "body": "You can give your best from now on.\n\nBUT\n\nMost importantly, TAKE EASY ELECTIVES in 3rd year. You get to choose two electives every year for 2 semesters. Take the easiest ones then. As for 2nd year, I personally found it harder than first year. So hang in there and give your best. You'll be just fine. \n\nKeep a gpa above 7.5 for placements, i.e., by the end of 6th semester. You're good to go then"
    }
  ]
}