{
  "id": "vzof2g",
  "title": "Stream and campus selection",
  "content": "Hey guys..i have gotten 1.5k in pessat..just wanted to know if its better to take ai/ml in rr campus or cse in ec campus(my preference is cse anyday..but should I take the gamble of taking ai/ml in rr campus since we're gonna be the very first batch for the course)\nAlso..i heard some news about 1.5k-2k rank people getting into rr cse after 2nd round counselling..is that actually true??",
  "metadata": {
    "root_comment_id": "ig9qnx5",
    "post_id": "vzof2g",
    "author": "mav3r1ck_7",
    "url": "https://www.reddit.com/r/PESU/comments/vzof2g/stream_and_campus_selection/",
    "permalink": "https://reddit.com/r/PESU/comments/vzof2g/stream_and_campus_selection/",
    "score": 5,
    "upvote_ratio": 1,
    "created_utc": 1657890761,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "ig9qnx5",
      "body": "It’s all fake pls go to some other college pes is bad join Bnmit"
    },
    {
      "id": "igas969",
      "body": " Bro take whatever, stream is temporary regret is permanent\n└── The regret will be even more surreal if someone took a seat and in the second round they would've got better course but they didn't take the risk!"
    },
    {
      "id": "igd3odq",
      "body": ">AI/ML in RR Campus\n\nWait they're offering a bachelor's degree in this now? What's the difference between that and the regular CS degree with the Data Science / Machine intelligence specialization? \n\nAs someone who works in data science, 60% of my time is spent wrangling data, 30% is with cloud development, and <10% is actually in ML.  A broad base CS degree is likely more useful since you're not shoehorned into ML. Specialize later if you're keen on it.\n└── Oh alright..really appreciate the advice given..mostly gonna choose cse itself then"
    },
    {
      "id": "igd4elp",
      "body": "I talked to a few professors at both rr and ec campus. In CSE, you get to choose a specialization in the third year (like AI ML, cyber security etc.). With CSE, you can explore and choose what you like. If you choose AI ML, you're stuck with it. \n\nI also talked to a few students and they said that AI ML is really hard. You can take it up if you plan on going abroad cause India is still developing and it doesn't have a lot of opportunities. After lots of inquiring, I've decided to stick to CSE.\n\n One of the professors told me that CSE at rr campus went upto 1.5k rank. Tbh, it sounds a little shady lol. Can someone tell me if this is true?\n└── Thanks a lot for the insight :)"
    }
  ]
}