{
  "id": "w18sqy",
  "title": "Buses for PES EC",
  "content": "[deleted]",
  "metadata": {
    "root_comment_id": "igjdaq7",
    "post_id": "w18sqy",
    "author": "[deleted]",
    "url": "https://www.reddit.com/r/PESU/comments/w18sqy/buses_for_pes_ec/",
    "permalink": "https://reddit.com/r/PESU/comments/w18sqy/buses_for_pes_ec/",
    "score": 7,
    "upvote_ratio": 1,
    "created_utc": 1658068536,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "igjdaq7",
      "body": "Eh its okay okay... unless u travel more than 10 kms its not useful at all."
    },
    {
      "id": "igridbb",
      "body": "I was in EC Campus for about 2 months before I got RR campus. Bus facility in EC Campus is quite good. A lot of people in ECC commute by bus, so yeah, there is a higher number of bus routes for that campus. The only problem is that it's too big of a hassle to travel by bus. For me, the bus used to arrive at my point at 6:25 am in the morning. Although I have never missed the bus, it's a bit of a pain to wake up and be ready at such early hours, but, you'll get used to it. You can sleep during the bus ride. That's what 90% of the people will be doing anyways, You get to see nice view of the city in the morning if you're interested. All buses arrive at around 7:45 at the campus(Classes start at 8:15). Gives you plenty of time to walk around and get a feel of the campus or mentally prepare yourself for the day of classes or finish off an assignment which you haven't completed yet. \n\nBuses leave early. A regular schedule for the bus to leave is 3:45. Classes end at 3:30, so you gotta get to the bus fast because the bus parking area is quite far away and it'll take you at least 5-7 minutes at full pace to go there. Evening bus rides are a tad bit longer due to the traffic. On certain days (every Tuesdays and other days if scheduled) buses leave at 5 pm because the seniors have some extra class. Just ask in the lobby if you have questions on when the bus is leaving. \n\nSo, yeah. Buses are good. My route (Route 3) had a nice, big bus that was kinda brand new. Some routes had older or tinier buses. It all depends on the number of people who sign up for that bus route. Most people are chill and will mind their own business, so there's nothing to fear in that too. If you want to, you can socialise with people. I recommend you to carry a pair of earphones or headphones. If you have any more queries, you can ask me. I'm happy to respond.\n└── Are the hostels for first year students outside the campus ?\n    └── For EC Campus, boys hostel will be outside campus for first years only. The other 3 years have it on campus. The girls of all years and first year boys have their hostel in Amaatra Academy campus, which is about 10-20 minutes away from the campus.\n\nFor RR Campus, boys hostel for all the years is on campus, and the girls hostel is about 10-15 minutes away from campus.\n\nBus service will be provided for those whose hostels are outside the campus, so you don't have to worry about travelling."
    }
  ]
}