{
  "id": "w5g2i1",
  "title": "What happens in the counseling process",
  "content": "Do i just go and select a branch or will they ask me questions about myself and about the branch (basically interview me)",
  "metadata": {
    "root_comment_id": "ih7qk4e",
    "post_id": "w5g2i1",
    "author": "Why_Am_IUsingReddit",
    "url": "https://www.reddit.com/r/PESU/comments/w5g2i1/what_happens_in_the_counseling_process/",
    "permalink": "https://reddit.com/r/PESU/comments/w5g2i1/what_happens_in_the_counseling_process/",
    "score": 9,
    "upvote_ratio": 1,
    "created_utc": 1658510484,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "ih7qk4e",
      "body": "No they won't interview you for btech.\nCounselling process will be explained there itself\n└── Thank you :)"
    },
    {
      "id": "ih833jr",
      "body": "They'll do document verification and take your photograph, scan fingerprint. Then you are sent to the auditorium. Once you go in, the COO will come and showcase the achievements made by PES, the clubs, blah blah. Basically an hour of presentation. After that, they counselling will start.\n\nThere is a row of computers in the front with people operating it. There's a big screen showing the number of seats left in each branch in both campuses. Also, there will be a list of names according to the PESSAT rank. When the rank is approaching, they will show the list of people who have to go up front to the people with the computers. You have to stand over there and once your chance comes, you will be asked to choose a branch and campus based on availability.\n\nOnce you choose something, the number on the of seats left will go down, etc. There will be a person reading out who chose which branch, etc. It's kind of like an auction, lmao. You'll like the feel of it. That person with the computer will give you printed sheet of paper. You take that and submit it along with the DD. to a bunch of people sitting on the side of the auditorium. Your admission is complete. \n\nThey will give you a slip with a number(if my memory serves right), along with the fees paid receipt, your PRN, etc., and you have to go a different building (probably the one under construction). Over there, they will call you based on the number on the slip(again, if my memory serves right). There you have to submit the documents, sign a couple of times and then they'll give you a PESU bag, water bottle, temporary ID card (yep, with your PRN, photo, etc.), etc. \n\nCollect the items. If you want to join hostel or college bus, there will be people sitting near the place where they give you the ID Card. You can book it if you want. That's it, you can go home. Better to ask the people over there before you leave in case things have changed.\n\nNo interview, nobody will ask you anything. Just relax. There will be people guiding you at every step. If you have a doubt, just ask. They will guide you (no judgements). It will be fine. Good luck!\n├── Thank you :)\n└── Okay but this time, it's online. What do you think would happen?\n    └── Online option is available for those who are not in Bangalore. I do not have much information on it, but I'm pretty sure you will be guided at every stage. Don't worry.\n        └── I'm done with councelling 💪"
    }
  ]
}