{
  "id": "w5wqqi",
  "title": "Is AI & ML difficult?",
  "content": "Compared to CSE. I am happy with AI & ML as well (it's in demand and less competition), I'm just worried it will be tough and I might have trouble studying it in college.",
  "metadata": {
    "root_comment_id": "ihakbbr",
    "post_id": "w5wqqi",
    "author": "imtootiredforthisugh",
    "url": "https://www.reddit.com/r/PESU/comments/w5wqqi/is_ai_ml_difficult/",
    "permalink": "https://reddit.com/r/PESU/comments/w5wqqi/is_ai_ml_difficult/",
    "score": 6,
    "upvote_ratio": 0.8799999952316284,
    "created_utc": 1658556842,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "ihakbbr",
      "body": "https://www.reddit.com/r/PESU/comments/w0bqmp/comment/igdpa5a/?utm\\_source=share&utm\\_medium=web2x&context=3"
    },
    {
      "id": "ihazkw1",
      "body": "As someone with experience in field, I can tell you that it's not for everyone. Yes ML is in demand but what a lot of people entering the field don't know is that there is more theory and algorithms to it than actual coding. \n\nThe core concept behind machine learning is ALL math - differential calculus, linear algebra. If you are someone who doesn't like math, then trust me it is going to be a nightmare for you and that is a lot of reason people back out. People look at ML as this fancy black box that they assume can be out together with a few lines of code and can do the fanciest things in the world, but what they do skip over is that there is a lot of math and algebra making doing the wonders. \n\nAll this being said, I can tell you it's a beautiful field to get into if you're interested in it. There is a lot of demand yes, but more importantly if you are interested in it there is a lot to explore and learn as well. You'll be amazed how some of the things you use everyday work with just a little math. There is also a lot of scope in research (I've published 3 papers myself before I turned 22!) and if that's your future then it's a good start as well. \n\nThis is an outline of what you can expect if they manage to do the courses well. However, since this is the first time it's going to be there, it's a HUGE risk and something I would not personally go with. I'd still suggest picking CSE since it gives room to switch domains if you do not like AI/ML. \n\nIf you'd like to know more about the field, feel free to DM. I'd be happy to share more about this in detail.\n└── Thank you so much this is very helpful! I'll dm you soon for sure."
    }
  ]
}