{
  "id": "w641k9",
  "title": "Creating a PESU Megathread",
  "content": "I think a megathread with info on branches, exams, clubs, and other common academic questions (this can have links to r/Indian_Academia and related subs too) would be pretty nice and probably reduce repeated questions and help people who dont have (or want) to have reddit account to post. Happy to help if mods all alright.",
  "metadata": {
    "root_comment_id": "ihbn4l8",
    "post_id": "w641k9",
    "author": "raidandexplore",
    "url": "https://www.reddit.com/r/PESU/comments/w641k9/creating_a_pesu_megathread/",
    "permalink": "https://reddit.com/r/PESU/comments/w641k9/creating_a_pesu_megathread/",
    "score": 13,
    "upvote_ratio": 0.9399999976158142,
    "created_utc": 1658582887,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "ihbn4l8",
      "body": "u/ChromaticChaos\r \n\npin this post\n└── Done!"
    },
    {
      "id": "ihbv3t3",
      "body": "This will  be really good for new people"
    },
    {
      "id": "ihcf49j",
      "body": "I got ECE instead of CSE, should I surrender my seat or stick with ECE and try to do a minor course with CS\n└── Depends on your area of interest and motives.\n    └── Not really interested in ECE\n        └── Then dont go for it unless u really dont have any other good options elsewhere. Ece is the toughest engineering branch. If you want to stick with ECE and try to do a minor course with Course, you can do that too as many of my friends are currently doing that rn but its too much work tbh."
    },
    {
      "id": "ihh70gy",
      "body": "My son has got into CSE at RR campus and will be joining the hostel. For the computing related courses in the first year, and for accessing the PESU academy app, is a personal laptop necessary? Can the computers in the labs be used for this purpose? Can students access the computer labs after class hours if they want to work on their projects and for self-study in coding?\n└── The computers in the lab do not remain open all the time, and if I remember correctly they all close by 5:30-6 pm (although this was 4 years ago so things could have changed). So the labs aren't exactly an option. However, until the labs close students are free to use them.\n\nAlso all study material - PPTs, notes, lecture summaries etc are made available on the PESU Academy website (not all website features are on the app), so everyone uses it to study as well. Studying on the app isn't really a feasible option.\n\nGetting a personal laptop is highly recommended since it is not only required for the CS related courses in first year, but will anyway be required going ahead from 2nd year.\n    └── Thanks for the prompt response!"
    },
    {
      "id": "ihjmy72",
      "body": "How are the mess and hostels in pes rr campus?\n└── there are three mess at pes rr. 2 of them are amazing (especially naamdhari) and another is average.\n\nthere are some 5 building divisions at hostel. \n\noverall, okayish infrastructure\n    └── Is there an option to move to a single room from 2nd year onwards? If so, how would they be allocated and how much do they cost?"
    },
    {
      "id": "jne7alf",
      "body": "I would love to work on a megathread for PES, can you include me in??"
    }
  ]
}