{
  "id": "w6udf1",
  "title": "VIT Amravathi CSE or PES EEE",
  "content": "I have gotten an opportunity to Join VIT CSE Amravathi or PES EEE. I have a keen interest in embedded systems as well as programming. I have started coding since grade 6 so I have a fair amount of knowledge in Computer Science. But I couldn't secure a seat in the CSE branch. Would it be better to join VIT or PES considering placements as a factor?",
  "metadata": {
    "root_comment_id": "ihfxozu",
    "post_id": "w6udf1",
    "author": "kushurox",
    "url": "https://www.reddit.com/r/PESU/comments/w6udf1/vit_amravathi_cse_or_pes_eee/",
    "permalink": "https://reddit.com/r/PESU/comments/w6udf1/vit_amravathi_cse_or_pes_eee/",
    "score": 4,
    "upvote_ratio": 0.8299999833106995,
    "created_utc": 1658665208,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "ihfxozu",
      "body": "pes is the way to go here, hands down\n└── oh, if possible can you state your reasoning? Thanks!\n    └── 1. PES allows minor degress, particularly in CS. It will be tough, but since you know coding, should be easier for you\n2. PES has excellent placements for CS branch and if you take a minor in CS, you should be able to sit for most placements\n3. PES is in Bangalore and you have better access to the multitude of companies in the city from start ups to service companies to product companies - for internships as well as off-campus placements. They also have easy access to you for on-campus placements\n4. Excellent infrastructure and opportunities (possibly there in VIT Amravathi also, but do check)\n\nDownsides\n\n1. Campus is a concrete jungle, though there is a very good gym and indoor basketball courts coming up. A cricket ground  and a small football field are also available. But very less greenery. But you can explore Bangalore's parks and malls - there is a Metro station just 1.5km away (21min walk or 5-10min by auto) \n2. Faculty seems to churn a bit and is a hit or miss. You may need to learn on your own for the most part.\n3. Workload is quite rigourous, 2 internal assessments, 1 final assessment, projects, assignments, labs etc."
    },
    {
      "id": "ihfxuhv",
      "body": "PES . Core branch placements are not good but EEE and other circuit branches people are eligible for most tech company placements"
    },
    {
      "id": "ihg9qlf",
      "body": "Never compromise with your branch, CSE is CSE and EEE is EEE at the end of the day, see which branch you're interested in and decide :)"
    }
  ]
}