{
  "id": "w7hu04",
  "title": "are we supposed to recieve any official email/confirmation post seat selection in pessat?",
  "content": "My rank was 2379 and due to I suppose low turn out in the first round other factors, I got cse in ec (online counselling). However I'm wondering if you're supposed to recieve some sort of official confirmation? I'm paranoid because this is the only opportunity i have in hand this year, so sorry for the odd question. \n\nThe person doing the counselling did say 'confirmed' and I've taken an ss of my name under 'seat selection complete'.",
  "metadata": {
    "root_comment_id": "ihjrqcl",
    "post_id": "w7hu04",
    "author": "Individual-Strategy1",
    "url": "https://www.reddit.com/r/PESU/comments/w7hu04/are_we_supposed_to_recieve_any_official/",
    "permalink": "https://reddit.com/r/PESU/comments/w7hu04/are_we_supposed_to_recieve_any_official/",
    "score": 8,
    "upvote_ratio": 0.9100000262260437,
    "created_utc": 1658731873,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "ihjrqcl",
      "body": "If I'm not wrong this is the first time they introduced online counseling, so I don't think anyone on this subreddit can help you. \nSince you have a screenshot of your seat it's a good proof, but you'll need to ask someone handling the counseling regarding confirmation of the seat at their end.\n└── I'll try emailing them about this and see what they say.\n\nThank you for responding :)\n    └── Call them\n        └── Have you received any official email/update from them?\n            └── Yea. Same as the guy wrote\n After my offline counselling I did get an Email which asked me to fill details at their website  using the login credentials on a paper they gave me after admission, they also emailed these login credentials to my mail. I think you are supposed to get these login credentials, so call them and ask them about it."
    },
    {
      "id": "ihk1c74",
      "body": "I didn't do online counselling. After my offline counselling I did get an Email which asked me to fill details at their website  using the login credentials on a paper they gave me after admission, they also emailed these login credentials to my mail. I think you are supposed to get these login credentials, so call them and ask them about it."
    },
    {
      "id": "ihl9psg",
      "body": "Call them and inquire about your admission status they'll ask you to submit docs for verification or they'll  ask you to mail it or bring it in person , post that you'll get an acknowledgement,admission order and fee receipt."
    }
  ]
}