{
  "id": "w7jyb1",
  "title": "Is it necessary to buy a laptop for the first year itself ?",
  "content": "Is the note taking done through Pen and Paper or people use laptops to note stuff down ?\n\nAlso what are college timings going to be like ?",
  "metadata": {
    "root_comment_id": "ihk1vcs",
    "post_id": "w7jyb1",
    "author": "throwaway1212aa12212",
    "url": "https://www.reddit.com/r/PESU/comments/w7jyb1/is_it_necessary_to_buy_a_laptop_for_the_first/",
    "permalink": "https://reddit.com/r/PESU/comments/w7jyb1/is_it_necessary_to_buy_a_laptop_for_the_first/",
    "score": 6,
    "upvote_ratio": 1,
    "created_utc": 1658739749,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "ihk1vcs",
      "body": "Note taking is done in class by pen and paper (i.e if you take notes)\n\nHowever yes, you need to have a laptop from the first year itself for all online study material and PESU Academy\n├── >i.e if you take notes\n\nI hope to haha. I shouldn't make the same mistakes I did in the previous two years lmao.\n└── What about timings, duration of classes etc\n    └── Classes start at 8:15AM\n\nYou generally have 6 hours of classes and a snacks and lunch break\n\nCollege generally ends on 3:45PM\n\nBut somedays you have let offs, college will end by Lunch Break.."
    },
    {
      "id": "ihltbns",
      "body": "Not really but i suggest you get one anyway because other than coding , for all other subjects you'll be getting reading material on pesu academy portal and you'll be reading from that portal for internals and final exams if you can manage everything on phone then you don't really need a laptop.\n\nThe college starts at 8:15 and ends at 3:30 but you won't have continuous classes considering they're starting your semester in Aug it'll be 4-5 classes per day for you guys and there'll be free hours.\n└── Free hours in the sense? We'll roam around or what\n    └── Do whatever you want they don't care.\n        └── Is it the first time 1st sem is starting in Aug?\n            ├── 20th aug most likely\n            └── they said that it would be on 22nd Aug in offline counselling.\n                └── I know right. I asked if that'll be the first time 1st semester is starting in Aug.\n                    └── oh my bad I didn't read it properly lol"
    }
  ]
}