{
  "id": "w8t8n1",
  "title": "Laptop",
  "content": "Which laptop should i buy for ECE stream",
  "metadata": {
    "root_comment_id": "ihsnlpc",
    "post_id": "w8t8n1",
    "author": "Legitimate_Payment67",
    "url": "https://www.reddit.com/r/PESU/comments/w8t8n1/laptop/",
    "permalink": "https://reddit.com/r/PESU/comments/w8t8n1/laptop/",
    "score": 7,
    "upvote_ratio": 1,
    "created_utc": 1658865092,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "ihsnlpc",
      "body": "I am not a senior but I do know a bit about laptops so here are some general guidelines\n\n1>  Don't buy intel 11th gen. If you don't know what 11th gen is then don't buy laptops which say that they have an intel i3/5/7 11xxx\n\nReason is that they aren't too efficient so the laptop's battery gets over fast and heats up more too. So its better to buy laptops with AMD processors, Don't buy ryzen 3000 series processors, buy either 4000, 5000 or 6000 they are all better for various reasons.\n\n2> Buy laptops with a decent display. So you should AVOID buying laptops which have a \"TN\" display, so it should either be written IPS or OLED or Miniled, just avoid TN.\n\nTry and get laptops of higher brightness, 300 nits and above.\n\nTry and get laptops of better color accuracy, better than 45% sRGB. If you can't spend much then atleast make sure that you have an IPS display, the other two only if you can spend more.\n\n3> Don't buy Lenovo Ideapad series. I have read so many posts about broken hinges.\n\n4> Try and get laptops of 16 gb RAM or at least if you are buying a 8gb ram laptop make sure it has an empty expansion slot so you can upgrade it in the future.\n\nPersonally my suggestions would be :\n\nHP Aero Ryzen 5, 16gb ram, 400 nit anti glare display -65K\n\nAsus Zephyrus g14 Ryzen 7, 350 nit anti glare display, gtx 1650 72k-80K\n\nThinkpad/thinkbook of similar price and configurations as HP Aero\n\nAsus Vivobook with a ryzen processor and preferably an oled screen.\n\n&#x200B;\n\nIf you want something for around 50K or lesser then you would have to make sacrifices like build quality or some of the things that I have mentioned above. All of these laptops will be able to code well and browse the web well, honestly any laptop even a 25K one will be able to code well and browse  the web well, they just tend to have  certain deal breakers in them like terrible display or terrible battery life or something else that would frustrate you. More over these cheap 25K laptops don't last long enough.\n\nIf you are going to buy something for 50K or cheaper then you should probably look for good laptops that are 2nd hand without any major issues. Like if they are just old and the owner wants a new laptop then buy that one, it would give you much better returns for you money even if you don't have a warranty.\n\n&#x200B;\n\nAvoid buying thick gaming laptops, I mentioned zephyrus g14 above which is classified as a gaming laptop but its thin and looks sleek and not gamery and moreover it checks all the boxes of a good all rounder laptop thats more of an outlier, in general gaming laptops are big and heavy, with poor thermals and their fans always kick in so it would irritating to work with them without earphones and music, those loud fans will disturb people sitting around you.That rbg and gamery design will draw unnecessary attention, so don't buy a gaming laptop, also cheap gaming laptops have  poor screens even though their refresh rate is high but everything else is shit, they will also have bad battery life and big chargers. So avoid gaming laptops, although you could look at the legion series by Lenovo if you are hell bent on gaming. The laptop picks that I wrote above should be able to play basic games like valorant and CSGO but not triple a titles like cyberpunk etc.\n\nThe g14 should be able to play most triple a games on medium/low because of its dedicated gpu tho, so that could be a good buy for people who want to game but also want a sleek looking laptop with good battery life.\n└── i wouldnt worry abt atttacting unnecessary attracton with a gaming laptop. about half the laptops i have seen are gaming laptops. \nas for their fans, honestly if you aren't playing with games they wont quick in. you should be more worried about battery life than anything else. in your first year classrooms, if its in F or G blocks you will find only a couple of ports at the front of the class. you might go to 13th floor/silent reflections for whatever reason, you dont have worry about as each place has a port. 3rd sem on, B Block has a loads of ports too, so just grab a seat near one.\nas for the g14, while it is thin and light and good, it has tendency to get hot while playing games cuz of that reason. OP if you wanna game, get a gaming laptop, otherwise go through anon's message. you might want that extra gpu power tho, so better to ask in discord (i am not sure what applications you use in ece)\n\nedit: also the ambient noise in all the above mentioned locations often drowns the fans noise, combined with the fact that most people might be wearing head/earphones, you dont really have to be worried about it. however, that leaves only battery (battery saver + ending all unnecessary background tasks, lowered brightness, etc. could be enough) and weight (baring a few, most people do not carry textbooks) as your main issues."
    }
  ]
}