{
  "id": "watqdy",
  "title": "NEED ADVICE AND SCARED AF",
  "content": "Hey guys, i am getting aiml in rr campus in pes and cse core in srm and eee in manipal main campus and my jee rank is not so good so i am leaning towards PESU because ik srm quality of student is shit and i have heard than EEE is very hard so i dont want to get into that (one of my freinds is studying in manipal eee and has got 3 backs) but all the  reviews of pes on this sub are so shit but i had heard from many people that pesu is really good and life in banglore is enjoyable but now after reading this sub and some answers in quora im scared to shit and i feel stranded with no options",
  "metadata": {
    "root_comment_id": "ii34fna",
    "post_id": "watqdy",
    "author": "[deleted]",
    "url": "https://www.reddit.com/r/PESU/comments/watqdy/need_advice_and_scared_af/",
    "permalink": "https://reddit.com/r/PESU/comments/watqdy/need_advice_and_scared_af/",
    "score": 9,
    "upvote_ratio": 0.8500000238418579,
    "created_utc": 1659064737,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "ii34fna",
      "body": "Relax. Trust your gut and study the subject you want to study. \n\nYou should ask current students what their opinion of the place is, but the reason you read a lot of shit is because I don't think any graduate has a lot of \"school pride\". Plenty of folks have a lot of distaste towards the management and the workload in general. Most folks (rightly so) don't really associate the college itself with having a good time when it comes to actually having fun.\n\nAt the same time, it's not right for me to say I hated this place or anything of the sort. I found my education to actually be useful, I recouped my investment very quickly, and I think all of my friends and I are rather happy with how our careers have started off atleast. I had a lot of opportunities that opened doors for me, and in hindsight I missed out on plenty as well. I made plenty of great friends and I had loads of fun experiences which were mostly because of my friends and a bit because of the college itself. \n\nI think for a lot of folks, first year was a bit tough because like it or not, most of us were only there because we flunked JEE and Bitsat. In retrospect though, I don't think it made a huge difference. \n\nOf course, I graduated over a year ago, and things would have changed a lot. Do your diligence and ask folks who are still there, but rest assured, you'll be ok if you do choose to study there. \n\n(Disclaimer this is all only for CS & affiliated subjects/career paths - unfortunately opportunities for core engineering are nowhere near as good)"
    },
    {
      "id": "ii34oqd",
      "body": "Hey man, if you're actually interested in EEE then I'd say go for Manipal. But if you're not then maybe PES AIML is the best choice (though AIML is a new course and therefore no-one knows what it'll be like). \n\nI won't lie, the academic life in PES is probably one of the more hectic ones out there, and if you're looking for a nice chill college life then PES isn't for you. However, the syllabus in PES is miles better than in most other colleges, as they constantly keep on updating it to fit modern standards. So after you're done with your college life, you'll be better equipped in the real world than a lot of other graduates. The student body as well is incredible and there's a lot of wonderful people in PES. Generally students also do end up getting placed in companies as well, and a LOT of companies come here for recruiting students, so the opportunities you get in campus placements can really help you a great deal if you're prepared by then. \n\nLife in Bangalore (while expensive) is also pretty enjoyable as there are a LOT of places to hang out and a lot of things to do in the city. \n\nConsider your options, and choose what you feel is best for you. I hope I was able to give you some clarity on this place, and good luck for whatever you choose!\n└── Man the thing idk what i am interested in i Haven't ever coded in my life and right i really don't know what my interests are i want to go and discover my interests and shit in college and my final goal is to go abroad for higher education"
    },
    {
      "id": "ii34wvc",
      "body": "Leaving all the comments about the college here aside, what are you interested in? CSE and CS related topics like AI/ML, or EEE? Both are really different, and you'll first need to make up your mind on which one you want to pursue. \n\nAs for the reviews about PES - yes they're true. Everything posted here by different people against the college is almost entire accurate, if not completely. The city although great should not play a big role in determining your college too. You'll need to make up your mind on whether you prefer the college over the branch, or vice versa.\n└── Bro i don't know what are my interests that's why it is so hard to make up my mind"
    },
    {
      "id": "ii3ksgr",
      "body": "Don't choose EEE if you're not into that and SRM is pretty trash because of the crowd there , if you're not sure about AI/ML just choose CSE in RR campus or EC campus."
    }
  ]
}