{
  "id": "wb1w9w",
  "title": "B.des and hostel",
  "content": "Hi I am joining pes this year for b.des and I really haven't seen much people talk about it or people from the course in any forms and I'd like to meet a fresher or a senior to know how it's gonna be and what all the assignments and classes are gonna be like.I also wanna know if the hostel is really really strict cuz I went there and it really looked like prison or something and the rulebook is riddled with strict rules so I am kinda worried.Id like to know more about both topics and would appreciate anyone who could help",
  "metadata": {
    "root_comment_id": "ii4601f",
    "post_id": "wb1w9w",
    "author": "Dear_Chemical_5561",
    "url": "https://www.reddit.com/r/PESU/comments/wb1w9w/bdes_and_hostel/",
    "permalink": "https://reddit.com/r/PESU/comments/wb1w9w/bdes_and_hostel/",
    "score": 6,
    "upvote_ratio": 1,
    "created_utc": 1659092719,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "ii4601f",
      "body": "Idk bout B. Des... But hostel is just as u heard... Meaningless rules.. Arrogant wardens... Bouncers who act like they own the place...some rules obviously we don't care about and we find loopholes out... But mostly they r a huge pain."
    },
    {
      "id": "ii4et9k",
      "body": "I would say hostel is definitely not like what you heard if you're male. Yes there are bouncers, but the curfew is actually at 9, and that gives you a lot of freedom. Most rules in the yearbook are useless, like 'maintain proper haircuts', and you hardly see the warden, it's only relevant when you want to go home. I just stay outside the hostel throughout the day, and just come back at 8 pm. The only relevant dumb rules are you can't wear shorts outside your room, and after 9 pm bouncers kinda check to make sure there's nobody else in your rooms.\n└── Heyyy that's really great to hear cuz I read that 7:30 was the curfew on weekdays and on weekends it's 9 and I also read somethings about like how other people can't go to another room to chill or whatnot ya so thank you for this if it is true then great really. I forgot to specify that I am going to rr campus and this is my first year in hostel hope whatever u said is true\n    └── Yeah it is, if you're male of course. Girls actually have a 7:30 pm curfew and it's pretty painful.\n        ├── I am male yes and okok then all good thx again\n        └── What about the roommate thing is that true?\n            └── By roommate thing, you mean?\n\nOccasionally they come after 9 pm to check that people don't group up in any particular room. Cause in other hostels people group up to drink alcohol and shit, I guess. But like after 11 pm my friends go to other rooms anyway lol, and stay up till 2 am\n                └── Ohhhh then all good thx bro I'll be seeing u in hostel then"
    },
    {
      "id": "ii5nm8x",
      "body": "Hey, I'll be a fresher in BDes too. I won't be staying in the hostel so can't really comment on that, but hmu if you wanna interact\n└── I'd love to interact and don't mind about hostel it's all cleared up"
    }
  ]
}