{
  "id": "wddwm5",
  "title": "PES U campus choice",
  "content": "I recently got admission into PES RR campus for CSE via PESSAT.\n\nNow  that KCET results are out, I also have the option to apply for PES EC  campus for CSE via KCET (13xx rank).  (Please let me know if there are  any other viable options in CSE with this rank)\n\nThe  main benefit of doing that will be significantly reduced yearly fee,  but it will a huge hassle to commute, and I've heard that even though  the placements are done together for both campuses, many companies  prefer RR students and explicitly mention that they're only hiring RR  students, and internship opportunities are also lesser.\n\nIs  this fact valid, and is it worth the extra fees to attend college in RR  campus? What's the difference in quality of lecturers and events? Any  extra information or guidance will be appreciated!",
  "metadata": {
    "root_comment_id": "iihvo5o",
    "post_id": "wddwm5",
    "author": "Bar0n_624",
    "url": "https://www.reddit.com/r/PESU/comments/wddwm5/pes_u_campus_choice/",
    "permalink": "https://reddit.com/r/PESU/comments/wddwm5/pes_u_campus_choice/",
    "score": 6,
    "upvote_ratio": 1,
    "created_utc": 1659349251,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "iihvo5o",
      "body": "RR campus peeps might have some advantages but you're paying almost 4 times via PESSAT compared to KCET so I'd suggest it's actually better to opt for EC campus CSE considering curriculum and placements are same, Quality of teaching is not that good in EC campus but then again you're not that dependent on profs."
    },
    {
      "id": "iihx17g",
      "body": "As far as I know , in the placements time companies won't even be knowing your campus. You'll be just treated as a PESU student. Some seniors whom I contacted said that the faculty is good and decent enough in particular tough subjects.\n\nEdit:- The company only allowing RR students thing might be a old data because this year it was the first time CSE placements for RR and EC campus took place together! You can see the placements data of 2022 on this subreddit. One thing to know is that you'll be always competing with RR campus students if you join EC campus and vice versa.\n└── Thanks!  \nWhich campus and branch did you take?  \nI'll most likely still end up taking RR because it'll be much more convenient to commute and the campus and events seem to be worth it. I feel that I might regret taking EC in the future but i'll never regret taking RR because thankfully, my parents are completely fine paying for the fees.\n    └── I got CSE in PESU EC Campus through PESSAT.\nYou should definitely go for RR campus if you have it as a option! Luckily my dad works in Electronic City and my family is also shifting there in the coming week."
    },
    {
      "id": "iimgm3s",
      "body": "I just missed cse rr (will get it in the 2nd round) but got a 13xx rank in kcet and can get cse ec. I'll take cse rr through pessat because I've heard it's better than ec in terms of teaching, will have a better crowd and the commute will be much easier for me. Ec is simply too far to travel every day and I'm not interested in staying in a hostel and eating mess food. Also in the long run I don't think the extra fees would matter so much."
    }
  ]
}