{
  "id": "wgwrm3",
  "title": "PES CSE @RR-campus or CSE @Thapar or tier-2 CSE @tier-2 NITs or LNMIIT",
  "content": "We are in a peculiar spot. My son secured \"IT\" branch in MIT-Manipal in firstround, and \"IT\" branch also in VIT (category-1). My personal perception is that a CSE from PESU-RR is worth more than either MIT or VIT, but it is perhaps a biased perception (I've mentored few PES interns in my company, but no experience with MIT or VIT interns). Most probably we'd surrender the MIT and VIT seats.\n\nHowever, there is a strong possibility my son also securing CSE or AI-ML or CS&BizSystems @ Thapar, also possibility at some of the tier-2 NITs and IIITs (but definitely not at Suratkhal, Warangal, Trichy), and maybe also LNMIIT i.e. for core CSE or CSE specialization or even Math+Computing etc.\n\nFocusing specifically on CSE, can people who are studying at PESU or passed out, share any feedback or opinion ? Why did you or would you choose one of them over the other ?",
  "metadata": {
    "root_comment_id": "ij2alix",
    "post_id": "wgwrm3",
    "author": "Professional_Row_967",
    "url": "https://www.reddit.com/r/PESU/comments/wgwrm3/pes_cse_rrcampus_or_cse_thapar_or_tier2_cse_tier2/",
    "permalink": "https://reddit.com/r/PESU/comments/wgwrm3/pes_cse_rrcampus_or_cse_thapar_or_tier2_cse_tier2/",
    "score": 6,
    "upvote_ratio": 0.8799999952316284,
    "created_utc": 1659709338,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "ij2alix",
      "body": "IIIT /NIT\nLNMIIT\nThapar\nPes\n\nAvoid IT as much as you can go anywhere u get cse.\n└── Aren't CS and IT are same?\n    └── The difference starts showing during placements and jobs etc\n        └── I opted for IT😥\n            └── Acchi branch hai IT I just meant ki avoid IT if you are able to get cse anywhere."
    },
    {
      "id": "ij2lt1t",
      "body": "Hi\n\nAs I just graduated, these are the few things I would bring into light \n1. PES CSE is really good along with good placements\n2. I would suggest to pursue CSE over any specific stream like ML/AI etc.. because he/she is pursuing a BTech, it should be broad so that he/she gets options for career/study post graduation \n3. Brand name is important in India, so PES has a good brand name in Karnataka, however NITs and IIITs have a brand name across India, so if he's looking to pursue in Bangalore, PES is as good as NITs or IIITs (don't quote me on this)\n\nI would summarise and say that PES is a good academic focused college with a reputable placement record. I would personally prefer a broader CSE stream over specific fields in Btech \n\nI hope this helps\nGood Luck!\n├── Side note, don't go for the NITs / MITs of the world\n\nToo many people, hard to create an identity\n└── Thanks, certainly helps."
    },
    {
      "id": "ij2nfk5",
      "body": "Go for PES CSE\n└── Firstly thanks for taking time to reply. Anything you'd like to add in elaboration to justify the recommendation :-) ?\n    └── I think placements in PES for CSE are much better than tier 2 NITs and IIIT's I'm assuming these are the newly established nits and IIIT's. The programming culture in PES is good too.\n        └── Thanks, that helps."
    },
    {
      "id": "ij3llj2",
      "body": "LNMIITian here. There is no Maths and Computing and the specialization courses are also alloted later and not at the time of admission. I would try to avoid Manipal and VIT and if tier2 NIT CSE is available then just go for it without a doubt\n├── I got in PES CSE RR campus and hoping to get lnmiit in the session 2 result\n\nWhere should I go? Ps. My hometown is jaipur\n│   └── JEE percentile?\n├── Great to see an LNMIITian hanging around here and have this feedback -- especially about \"tier2 NIT CSE\". Not many people seem to say so. Any particular reason why you feel that way ? \n\nAlso, if one doesn't get pure CSE, what are your thoughts about CSE-allied branches like Computation & Mathematics, Electronics and Computers, ECE ? \n\nAs for LNMIIT, the specialization courses are open electives (free for students to pick) or allotted by institute based on one's CGPA ? \n\nWould you happen to have a clear picture of the CSE placements, like median salary for CSE with / without specialization, and that of ECE ?\n│   └── Yes, tier2 NITs CSE and even ECE is very good. The specialization courses are for limited no of students and those interested are sorted by their CGPA and the top interested get it. If not a good branch in tier2 NIT then LNMIIT is a very good option\n│       └── Thanks again.\n└── I am getting ece in nit Surat and cse in LNMIIT what shall I choose? The average package of Lnmiit is on the higher side but there's not much difference. So if u have any idea then plzz help\n    └── I would suggest ECE in NIT Surat because it is a good NIT. But you can choose LNMIIT as well. But there will be a huge difference in fees and the high placements is because LNMIIT is also academically a bit hectic."
    },
    {
      "id": "l95utqa",
      "body": "where did he end up joining, even i am considering pes\n└── He joined BITS Hyd."
    },
    {
      "id": "lflzmlo",
      "body": "Dear experts kindly guide me which option is better IIIT Bhubaneswar CE / PES CSE / MS Ramaih ISE\n└── IIIT-Bhubaneshwar is not a Central Govt (PPP) IIIT, but a Odissa Govt PPP (public-pvt partnership), so it's standards and quality a perhaps not at same level as some of the central govt primed IIITs. You can read around and there are some mixed views about it. Also, it's location isn't a great advantage, given that the IT industry density around Bangalore the prospects, industry partnerships, companies on campus etc., might be better. Between PES CSE (especially if RR campus), and MS Ramiah ISE, as per our research 2yrs back, we'd have ranked PES-RR CSE higher.\n    └── Thank you Sir. Is NIT Rourkela Civil is better option than PES-RR CSE\n        └── In terms of institute ranking, NIT Rourkela ranks higher in terms of brand recognition, and also NIRF ranking. While one shouldn't read too much into NIRF ranking for private institutes, but for govt institutes it is a nearly honest ranking between the govt institutes. Their placements have been decent in the past, but never compare highest packages, they can be extremely misleading. Of course, if the candidate is okay to take up Civil branch (given that other options seem to be CSE, IT)"
    }
  ]
}