{
  "id": "wgx8l6",
  "title": "As per NIRF data PESU's investment in faculty is one of the lowest",
  "content": "Have asked other questions about PESU to take a final call on choice of college (PESU CSE-RR being an option). Now this is not perception, but solid NIRF data that indicates that rupees spent per unit faculty is one of the lowest at PESU. This can only mean that they have been hiring lot of junior and poor-quality faculty, else why would good faculty, with solid experience work for less ?\n\nHowever, I also suppose that some of the other private institutes might be window-dressing their statistics presented in NIRF data.\n\nWanted a insider view of how actually are in this regard ? Find it so hard to believe that management would make this mistake of thinning out quality of Faculty as the resultant effect of slide-down of it's standing/quality would be follow soon after.  \n\n\nLest someone think that this is cooked up info by competing college, here is my personal Excel sheet directly from NIRF'2022 data:  \n\n\nhttps://preview.redd.it/0ruyj0ri73g91.png?width=928&format=png&auto=webp&s=d9babb75002d6b50eac4cb80a31e78c85f9769fb",
  "metadata": {
    "root_comment_id": "ij2a3d9",
    "post_id": "wgx8l6",
    "author": "Professional_Row_967",
    "url": "https://www.reddit.com/r/PESU/comments/wgx8l6/as_per_nirf_data_pesus_investment_in_faculty_is/",
    "permalink": "https://reddit.com/r/PESU/comments/wgx8l6/as_per_nirf_data_pesus_investment_in_faculty_is/",
    "score": 13,
    "upvote_ratio": 0.8899999856948853,
    "created_utc": 1659710520,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "ij2a3d9",
      "body": "Nothing solid here, but there is a growing consensus that the quality of faculty has been declining since late. \n\nSome of the best lecturers and profs we had have all but left when we were still studying (EC). I've heard the same sentiment from alumni from RR as well i.e. really good educators have either left the college for better pastures or retired.\n\nI don't know what the root cause is, but I wouldn't be surprised at all hearing that money being spent on faculty is low.\n└── Thank you for taking time to respond. PESU has such a solid reputation in Karnataka, so it seems strange and unfortunate if this is happening unchecked. There can always be a temporary disruption, like a competing college coming up, or suddenly deciding to make heavy investment in faculty to build up it's image/reputation, but if PESU is serious about keeping it's near-top ranking, they should course-correct quickly."
    },
    {
      "id": "ij2miw2",
      "body": "u/aditeyabaral please shed some light on CSE faculty"
    },
    {
      "id": "ij362yf",
      "body": "Last 2 years , the circumstances were totally different. Hoping that they'll improve it in the future.\n└── We can only hope!"
    }
  ]
}