{
  "id": "wlw1m2",
  "title": "What were your Study methods",
  "content": "St\n\nHey fellow pesu students! \n\nI am a third sem student CSE now. \nI would like to know from seniors, the methods, resources and time they used to make notes, study and practice their 3rd sem and further sem courses. And what are the  other areas I have to focus now and start learning considering I am starting CS from scratch to build skills in my field. Not very sure though but I think I will be going into the data science and cyber sec field.\n\nThanks for hearing me out and I’m looking forward for some solid advice from our seniors.\n\nEdit: I thought this post fits ‘ask a senior’ flair better",
  "metadata": {
    "root_comment_id": "ijyy17r",
    "post_id": "wlw1m2",
    "author": "Any_Lead3",
    "url": "https://www.reddit.com/r/PESU/comments/wlw1m2/what_were_your_study_methods/",
    "permalink": "https://reddit.com/r/PESU/comments/wlw1m2/what_were_your_study_methods/",
    "score": 12,
    "upvote_ratio": 1,
    "created_utc": 1660236276,
    "flair": "Study Help :table:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "ijyy17r",
      "body": "Hello,\n\nNow that you're entering 3rd sem, your core subjects will start off. I'd say spend some extra time while learning DSA (essential for placements). Otherwise this should be your time to be exploring your interests, so try out some entry level projects, join the I/O courses offered by the seniors, and see what best aligns with your strengths. (College will be stressful enough so be careful not to take up too much on your shoulders)\n\nAs far as it comes to notes, I wouldn't say they're required for you to make in-class, as the slides and the various resources put up in pesuacademy and in the student-created drive links will suffice. For subjects like CN, OS, DSA, I'd recommend to read up the textbooks as well (some concepts will be best explained within the tbs).\n\nYou'll be able to build your skills as you improve your fundamental CS basics, which will easily happen by focusing on your core subjects that will be taught right up till the 6th semester. You can start focusing on your specializations like CyberSec, etc. from your third year onwards (you'll be offered a plethora of electives to choose from).\n\nAll the best!\n├── Thanks senior!\n└── Is there any criteria to choose electives, like a minimum cgpa/sgpa stuff?\n    └── Nope, there are no GPA restrictions on selecting electives. However, if there are too many registrations for a particular elective, you'll get to choose from a set of profs. Usually the ones with higher GPA are given more priority to fall in a class taught by a better professor.   \n\n\nThis happened to my batch ('23 batch) most notably for the courses BD and DA."
    },
    {
      "id": "ik3dk7a",
      "body": "Changed flair because ask a senior is more about queries and stuff\n\nAnd this is specific to studies, study help would make sense and would allow people to search for this post easily\n└── Alright thanks for changing the flair!"
    }
  ]
}