{
  "id": "wn4ats",
  "title": "Why is PESU's Management so partial? [FRESHER RANTS]",
  "content": "I'm a 26' fresher from up north. According to an email we were supposed to submit our documents by 16th August, so I went to Bangalore with my Dad to complete the formalities. After getting the Welcome Kit we advanced towards the Warden's office to book the hostel. There we come to know that the new NBX and NB hostel just got fully booked a day before. NO EMAIL/MESSAGE WAS SENT REGARDING HOSTEL ACCOMMODATION. Even my dad called the office to enquire about the hostel and they all said \"an email will be sent\" but consequently no e-mail was sent.\n\nIs this very common in PES? Is management inclined towards a certain section of students?? Please help",
  "metadata": {
    "root_comment_id": "ik35t56",
    "post_id": "wn4ats",
    "author": "twerking_pokemon",
    "url": "https://www.reddit.com/r/PESU/comments/wn4ats/why_is_pesus_management_so_partial_fresher_rants/",
    "permalink": "https://reddit.com/r/PESU/comments/wn4ats/why_is_pesus_management_so_partial_fresher_rants/",
    "score": 6,
    "upvote_ratio": 0.8799999952316284,
    "created_utc": 1660361575,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "ik35t56",
      "body": "which branch?"
    },
    {
      "id": "ik393o7",
      "body": "Partial, no. Management is just very inefficient with lack of proper communication whenever it regards something important. They are very non-communicative about critical information and can keep you waiting for days regarding a few things.\n└── I came to say this lol"
    },
    {
      "id": "ik39xlr",
      "body": "So the reality is PESU management and PESU boys hostel management work independently..\n\nWe don't know why but they are very very inefficient and it always affects the kids that stay outside Bangalore.\n\nThis inefficiency was there also during times of covid and led to a lot of issues...\n\nSorry for what happened to you but yeah this is how hostel management is :/"
    },
    {
      "id": "ik8h54j",
      "body": "Bro i m a current 4th year guy... Already paid hostel fees... When I went to hostel recently they sent me off saying no seats available.. Now I m staying out and waiting for refund from hostel.... Worst management this is... Especially hostel, bunch of arrogant bastards... Btw this kind of gross mismanagement is what u should expect if u join the hostel"
    }
  ]
}