{
  "id": "wn67ei",
  "title": "An insight on the sub-redditors we have in this subreddit",
  "content": "[deleted]\n\n[View Poll](https://www.reddit.com/poll/wn67ei)",
  "metadata": {
    "root_comment_id": "ik3edkx",
    "post_id": "wn67ei",
    "author": "[deleted]",
    "url": "",
    "permalink": "https://reddit.com/r/PESU/comments/wn67ei/an_insight_on_the_subredditors_we_have_in_this/",
    "score": 4,
    "upvote_ratio": 1,
    "created_utc": 1660367631,
    "flair": "ANNOUNCEMENT :snoo:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "ik3edkx",
      "body": "All non PESU peeps, let us know which college you guys are from!!\n└── Not in a college right now. Want to join PES EC campus through KCET, but counselling hasn't started because of HC drama.\n    └── What HC drama? I’m sorry, I’m a second year student, just curious.\n        ├── KEA didn't consider PUC marks for KCET Ranking of repeaters (from 2021) and they did for the freshers. So the repeaters are unhappy about it.\n        │   └── Oh… That’s just sad. It kinda looks like a Win-Lose situation for both sides however it may be considered. I hope that you guys can join the college fast. PESU does not extend semester time. It’s not like VTU or any other university and they will want to finish the 1st year by the end of July, no matter what. \n\nMore delays mean less time and they will speed-run through the semesters. Us PESSAT students had 1 speedrun semester, but the KCET students had it rough, they had 2 speedrun semesters, but at least they had a ton of guilt free vacations between 12th and first semester while we wrote JEE Advanced after college started. Also, you guys will be losing out on semester holidays.  I know this is hard to hear but you guys will be back to normalcy by the end of first year while other colleges will drag it out for a year more. It’s just one year of struggle, so good luck. Don’t worry, you guys won’t have it as stressful as we did. We hadn’t even written KCET at this point last year. You all have a 2.5 month headstart and they dragged our counselling process too due to NEET results. I hope you all get at least a month of semester holidays. Good luck!\n        │       └── Thanks for the kind words and wishes. The judgement is to be given by HC on 18th, I hope they make sure it is a win-win situation for both repeaters and freshers. I'm sure college is gonna be a rough ride now owing to the delay and drama caused by KEA.\n        │           └── I really wish that it’s a win-win for everyone. The current delays caused to you all won’t be too much of an issue. It’s nothing to be scared of. It will be either semester holidays and 29 hours of classes a week or it will be no holidays but relaxed schedule of 22-24 hours of classes a week. Also, no need to thank me. Just enjoy your vacations while you can. It is hard to get guilt free holidays when college starts as everyone will be doing courses, internship, research or whatever during the holidays and if you don’t do something, you will kinda feel like you’re wasting your time. Enjoy your holidays, because it’s guilt free (Yes, I’m stressing guilt free again), you won’t get to relax like this. Competitive exams will have ousted you out, now it’s the time to have fun and relax.\n        │               └── It has been a while since I heard kind words. Thanks again.\n        └── something related to droppers"
    },
    {
      "id": "ik3o11a",
      "body": "Okay so let's just forget about final year students huh 🥲\n└── Oh shit\n\nOppsie"
    }
  ]
}