{
  "id": "wo1fo2",
  "title": "Refund policy",
  "content": "I am a fresher in pes university. I got cse in rr campus through pessat. As many of other counselling sessions of different institutes haven’t yet been conducted  I am not sure if my fees will be refunded if I wish to change university once the classes commences. \n\nIn the official site of pes, under terms and conditions, the last line regarding refund of program course fee is as follows:-\n\n**Program Course Fee: Any refund here will be done as per current UGC refund norms only.\n\nAnd ugc 2022 norms were recently updated on 2nd August 2022.\n**According to that we can ask for FULL REFUND from any university before 31st October 2022.\n\nThe question is will they follow ugc norms of 2022? OR\nThey will be following previous ugc norms or the last date for a full refund is 29th august 2022?\nAlso if someone has more information regarding this refund policy please do share.",
  "metadata": {
    "root_comment_id": "ik910cx",
    "post_id": "wo1fo2",
    "author": "Fast_Appointment9474",
    "url": "https://www.reddit.com/r/PESU/comments/wo1fo2/refund_policy/",
    "permalink": "https://reddit.com/r/PESU/comments/wo1fo2/refund_policy/",
    "score": 8,
    "upvote_ratio": 0.9100000262260437,
    "created_utc": 1660466009,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "ik910cx",
      "body": "Back in 2018, a different refund policy was followed (not sure if this was UGC or PES refund policy back then) - you would be eligible for fees refund only if you obtained a seat in an NIT/BITS/IIT. Essentially if you don't get a seat in any of those colleges you have lost your entire money.\n\nIf I am not wrong, this was also followed in 2019. Maybe others here and state the refund policy during their admission times.\n└── In our counselling session too we were told about this NIT/IIT refund policy. But no mention of BITS. Could you confirm if BITS part is still applicable?\n    └── There isn't really any way for me to confirm this. Maybe email them?\n        └── They haven’t replied to my previous mails, but surely will give it a shot.\n            └── For my year(2021-2025), they said they would deduct a certain amount(2-3k iirc) everyday and return the rest to you if you withdrew before the second round of PESSAT counselling.\n                └── [UGC 2022-23 refund policy](https://www.ugc.ac.in/pdfnews/3132446_Letter-reg-Fee-refund-Policy.pdf)\n\n[PES terms and conditions regarding refund](https://pes.edu/terms-conditions/)\n\nPes is playing a very dirty game in these situations. They clearly have agreed to follow UGC norms.\nThese two provide a complete picture of refund.\nI just think they don’t want students to know about these policies and try to scare them with early commencement dates.\nMaybe this year students should consider the UGC norms as it might help them.\n                    ├── Literally every private university 😂\n                    │   └── >They clearly have agreed to follow UGC norms. These two provide a complete picture of refund. I just think they don’t want students to know about these policies and try to scare them with early commencement dates. Maybe this year students should consider the UGC norms \n\nAgree... PESU is not unique in this, hear the same dirty tricks thing about LNMIIT and few others. Surprisingly, MIT-Manipal has been most upfront and transparent about this !\n                    └── Yes, felt the same and facing a similar conundrum. Remember that PESU already took 10k INR through a separate DD, saying that it is not refundable in any case (in spite of UGC guidelines being to refund full fees, minus 1-2K INR).   \n\n\nTo be fair, PESU (and other colleges) are also put in a spot due to delay on part of CBSE, NTA, as they need to keep their machine rolling."
    },
    {
      "id": "ik98cqi",
      "body": "Visited Pes. According to the Admin, before 29th or even before 2nd round councelling, full refund. On Ugc refund policy, they said they will follow that. But added for IIT/Nit. For Bits , upon personal request. Someone local,may confirm."
    }
  ]
}