{
  "id": "woz541",
  "title": "What's good about PES (rr campus cs branch) ?",
  "content": "[deleted]",
  "metadata": {
    "root_comment_id": "ikdssx8",
    "post_id": "woz541",
    "author": "[deleted]",
    "url": "",
    "permalink": "https://reddit.com/r/PESU/comments/woz541/whats_good_about_pes_rr_campus_cs_branch/",
    "score": 13,
    "upvote_ratio": 0.9399999976158142,
    "created_utc": 1660568559,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "ikdssx8",
      "body": "the students, peers, comrades or whatever you want to call them. anyways, you will find shitty management where ever you go, and yes it will probably include your jobs.  shitty profs? ever college has them.  they would form the bulk of it anyways. construction? well, stuff gets built all the time. your code will almost never work the first time around properly would it? stress? it is real. learn to deal it with. be a bit stoic, learn to deal with life and move on. could things be better? yes.\n├── Bruh.\n└── Amazing answer"
    },
    {
      "id": "ike0lkf",
      "body": "Reach"
    },
    {
      "id": "ike5dq8",
      "body": "It's in Bangalore which is a great bustling city. It's location and connections give it great cs placements. It's autonomous so the syllabus is less outdated than VTU colleges, some of which you mentioned. Like another commenter mentioned, the peers matter a lot. There's a good coding culture. (And there's a better gender ratio than most engineering colleges). There's a cool place at the top of B block, with lots of cute spots to study/work, lots of power sockets (I love how convenient they are), and that's the most picturesque area of PES for now. \n\nI quite enjoy my time at PES. Honestly, happiness seems to depend more on what you make of the environment, than what the environment makes if you. \nI know people who have had the best time of their life in quarantine (I was miserable). I know people who had the best time of their life in a coaching institute in 11th and 12th (I was miserable) (this person didn't slack off, so he was enjoying classes and teachers only). I was worried that PES appeared to be stressful and miserable to a lot of students, but I spoke to this senior who said it was possible to be happy.\n└── Thank you.... This gave me hope 🫂🫂"
    },
    {
      "id": "ike5lbx",
      "body": "You'll always find negativity for any college in their respective college pages/forums....\n\nGood\n1. Batchmates\n2. Placements\n3. Studious Environment (may not be applicable for all)\n4. Club culture \n\nBad\n1. Management\n2. Studious Environment xD"
    },
    {
      "id": "ikgvq1w",
      "body": "Branding. That's it. Same goes for any college really. The difficulty in getting into the stream + college creates demand for companies hiring as the college did most of the sifting of 'talent'. \n\nIdk about extracurricular stuff though. It's better than the abysmal situation in EC regardless.\n\nEnough about this, now I'm more interested in getting longer. ;)"
    }
  ]
}