{
  "id": "wpr6hs",
  "title": "Hey need a little help",
  "content": "[deleted]\n\n[View Poll](https://www.reddit.com/poll/wpr6hs)",
  "metadata": {
    "root_comment_id": "iki6lt6",
    "post_id": "wpr6hs",
    "author": "[deleted]",
    "url": "",
    "permalink": "https://reddit.com/r/PESU/comments/wpr6hs/hey_need_a_little_help/",
    "score": 4,
    "upvote_ratio": 0.8399999737739563,
    "created_utc": 1660647243,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "iki6lt6",
      "body": "Taking drop is not easy ,but if you are ready to work hard for coming 6-8 months. Esp if you work on your weakness. Getting good Nit won't be that difficult."
    },
    {
      "id": "ikidzs7",
      "body": "are you really sure you want to trust a poll to decide your life?\n└── Nope just wanted to see the dominance"
    },
    {
      "id": "ikj3iru",
      "body": "If you come here u will take drop from 13th floor"
    },
    {
      "id": "ikjw2f3",
      "body": "Hey so I'm in a similar situation, I have got 95.5 percentile in JEE and my other option is PES CSE in EC campus.\nI also realise my mistakes and feel I can do much better if I drop, but after a lot of thinking I have decided not to for the following reasons:\n1. I'm sick n tired of JEE prep (not cus I studied a lot, but cus I haven't been able to really enjoy life and my mind feels like a jail. I need to move on.)\n2. Wasting another yr of life mastering/studying something I'm probably never going to use in my life. Rather put in those efforts in my career n clg.\n3. My present options aren't half that bad.\n4. What if I make the same mistakes again, even after knowing them.\n5. Idk if I'll be able to bear watching all my friends enjoy college life while I suffer.\n6. I want to do masters, so I have another shot at a prestigious college, and I'm not sure if drop will be worth another yr of my time n efforts.\n\nWhile none of this might apply to you, I'm just putting out my perspective.\n\nSince you're here asking this question, I assume ur confused, but while taking a drop you cannot afford to be. You need to make up your mind and have a clear aim of IIT/ 99 percentile. Drop only if you have that hunger, depending on how badly you want that prestigious college environment.\nIt's a personal decision, keep in mind your end career goal and choose your own path. All the best!\n\nPS: PES is not in a downward spiral. Every clg has its own issues n few cons, and even though it's strict, if placement is your main criteria, then you cannot go wrong being in a top college of top IT HUB city- Bangalore.\n└── Thanks man!\n    └── Also idk why I've been getting different reviews when I physically talk to people who attend the college when compared to people in reddit. Try to speak to people in person / on the phone. Reddit seems to be a place for niche opinions??"
    }
  ]
}