{
  "id": "wuko48",
  "title": "CS minor doubts",
  "content": "How helpful is CS minors purely in terms of placements?\nI am an ECE student in second year and I’m not sure whether to take them or not.\nI currently don’t have interest in pursuing a masters degree.",
  "metadata": {
    "root_comment_id": "ilade73",
    "post_id": "wuko48",
    "author": "pkmnoob123",
    "url": "https://www.reddit.com/r/PESU/comments/wuko48/cs_minor_doubts/",
    "permalink": "https://reddit.com/r/PESU/comments/wuko48/cs_minor_doubts/",
    "score": 2,
    "upvote_ratio": 1,
    "created_utc": 1661145180,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "ilade73",
      "body": "Talking from a CSE grad standpoint here. \n\nSo taking up a CS minor actually helps, since CS placement tests (and interviews) often require and test you on basic knowlege of concepts taught through the CSE syllabus namely OS, CN, DBMS which are (as far as I know) covered in the minor syllabus as well. If you do the minor courses and actually pay attention and learn them, you don't really need to go out of your way to do them from scratch on your own (something which a lot of ECE kids struggle to do right before placements). So yes, from the placement test and interview angle it does help quite a bit since it helps you *almost* meet the theoretical knowledge requirement. \n\nHowever, another thing I'd also like to point out that although you might have done a Minor in CS, a lot of companies will still be biased and pick CS grads only, since at the end of the day you are majoring in ECE. Companies will tend to pick the CSE grad over the ECE grad although both might clear the same placement test, because they feel the CSE grad might have the required skills/can learn those skills a lot faster. \n\nPoint being, doing a Minor is advisable and will help boost your chances in CS placements, but don't take it as a guarantee or as a scenario where you are equivalent to the CS kids because it'll unfortunately still not put you in the same boat as them from the company's point of view.\n├── Thanks a lot for the detailed answer.\n└── If a kid is pursuing his major in IEOR, where the syllabus is kinda good like it's may create some direct skills as well as indirect soft skills and that mindset which may lead to learning any tech with ease...I guess IEOR ka syllabus is also rigorous and logical, if a ieor guy pursues a CS minor, then wouldn't that help...cause already he or she is in that AI ML and analytics kinda thing and CS minor will make you somewhere meet theorical base required...!\n\n\n\n\nWhat tangents come to your mind on this ?"
    }
  ]
}