{
  "id": "wwd5oy",
  "title": "Any confirmed information on PESU's refund policy after withdrawal, if student gets seat in IIT/NIT/IIIT or BITS ?",
  "content": "During the admission orientation, remember that Prof.Ajoy Kumar, COO answered some of the parent/guardian questions saying that if student gets admitted to IIT/NIT through JoSAA counselling, then PESU will refund the fees. Someone did ask about BITS as well, to which it looked like a positive confirmation as well, but I didn't fully catch the response. Then, don't think IIITs were even discussed. Does anyone have some solid information on this ?\n\nAlso, now that PESU has asked to submit original certificates (12th marksheet, migration cert etc.) and starting classes from 5th Sept, what happens if neither is done. Is the admission deemed to be forfeited ? The phone and email response of Admission cell is very taciturn and non-committal. They cannot answer anything beyond cookie cutter responses to information available already on website.\n\nClearly, the univ side of the challenge here is understood, but the question is simply about adherence to UGC directives that clearly state full refund for withdrawal up to 31st Oct, and a separate directive from earlier for univs not to collect and keep the originals.",
  "metadata": {
    "root_comment_id": "ilps1pu",
    "post_id": "wwd5oy",
    "author": "Professional_Row_967",
    "url": "https://www.reddit.com/r/PESU/comments/wwd5oy/any_confirmed_information_on_pesus_refund_policy/",
    "permalink": "https://reddit.com/r/PESU/comments/wwd5oy/any_confirmed_information_on_pesus_refund_policy/",
    "score": 11,
    "upvote_ratio": 0.9300000071525574,
    "created_utc": 1661326852,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "ilps1pu",
      "body": "I am in a similar situation. I most probably planning to get a seat in MSc. eco/maths in BITS. \n\nToday I contacted them and asked to speak to a senior rather than talking to the lady as she wasn’t able to give me proper response for a long time. \nSir told me that the last date to surrender seat has been postponed to 31st September today itself. If we wish to apply for a refund after that then we will have to talk to admissions office even for BITS. He assured me that they will consider the UGC norms and whatever it entails. I got this response TWICE as I asked once before too about this UGC refund policy. But he insisted that confirmation and details about this refund will be given by admissions office in PERSON and not through a phone call. I even asked if they will consider UGC 2018 or 2022 and he didn’t even knew what they both entailed. \n\nMany colleges like SRM, SNU etc. are following UGC 2018 refund policy and VIT, MANIPAL have their own refund policies like PES. So UGC might not exercised so easily.\n\nEven though they might acknowledge following UGC norms, it might not be that easy to apply for a refund and even more difficult if the case is other than IIT/ NIT/ BITS. Like IIITS is more risky situation. \n\nOther thing I asked was if we applied for refund now, will they consider us to sit in 2nd phase counselling of PESSAT? And they agreed to it. Which seems a more viable solution as if you get a seat in round 1 will most probably get a seat in round 2. CONS - only  the admissions fee which is Rs. 10k will be lost. \n\nThey told me that 2nd phase of counselling will happen after Kcet 1st round of counselling. Kcet document verification is at least till 7th September so 1st round counselling will happen like a week from that which will give a lot of time to explore other options.\n└── >If we wish to apply for a refund after that then we will have to talk to admissions office even for BITS.\n\nThanks for sharing the detailed account of your discussion.\n\nThey sent a mail through PESUniversity portal, and I think you'd have got it too. As per that, one needs to submit original or seek withdrawal before 1st Sept. If one doesn't complete formalities (submitting originals), then PESU will consider seat forfeited, but one could still apply for 2nd round of counselling.\n\nThis doesn't therefore seem to align with what they told you over phone. PESU, so far has been the more flippant and less-transparent about this procedure, compared to some of the other popular private colleges."
    },
    {
      "id": "ilql62r",
      "body": "I had also contacted the pesu office.\nRegarding refund \n. Before 1sept , for all cases\n. After 1 Sep, will do for IIT/Nit thr there office\n. For Bits , they will consider, but can not confirm now, will have to talk to their admin.\n. But also added in the end, they will be following the latest UGC guidelines.\nNow upto you to interpret!\n└── Yes, it is indeed open to all kinds of interpretations :-). Did they clarify if in such cases (where candidate might withdraw due to offer from IIT/NIT/BITS) it is mandatory to submit original documents ? Also in such cases does candidate need to attend orientation and start classes from 5th Sept ?\n\nWith JEE Advance on 28th, and students having been in the grind since 10th standard (thanks to Covid), they really need a break. What are you planning to do ?"
    }
  ]
}