{
  "id": "wxwxg9",
  "title": "cutoff for tier-1 companies",
  "content": "",
  "metadata": {
    "root_comment_id": "iltro79",
    "post_id": "wxwxg9",
    "author": "Imsmortboi",
    "url": "https://www.reddit.com/r/PESU/comments/wxwxg9/cutoff_for_tier1_companies/",
    "permalink": "https://reddit.com/r/PESU/comments/wxwxg9/cutoff_for_tier1_companies/",
    "score": 12,
    "upvote_ratio": 0.9399999976158142,
    "created_utc": 1661480878,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "iltro79",
      "body": "The cutoffs are decided by companies and vary based on the company. However, *almost all* tier 1 companies keep it at 8. A few keep it at 8.5 and a handful at 9. \n\nIf you want to be eligible for *all* possible companies, then your CGPA needs to be 9. However if you maintain an 8.5 you can meet the requirement for like ~98% of the companies.\n├── What can someone with 7.75 expect and a person with 8 expect and is there a possibility that the cut offs might change by a big number in the coming years?\n│   ├── Can't expect reduction in cut off\n│   │   └── Alright, Any chances of the cut offs increasing?\n│   ├── What do you mean by *expect*? And no, the cutoffs don't really change\n│   │   └── What i meant was, how many companies would not even allow candidates having 7.75 or 8 to sit for their placements. And will these companies be the top recruiters from the tier 1 companies.\n│   └── With 7.75, you could expect T1's but don't hold your breath.\n\nWith 8+ your options open up.\n│       └── Okay, thanks will work on increasing gpa\n├── Is it necessary to wear formals for interview like for the capstone project?\n│   ├── Would you want to show up in casuals instead to one of the most important interviews of your life?\n│   └── Go naked bro. They can't tell you what to wear.\n│       └── this is the way\n└── Had a question. What does mantaining cgpa actually mean? If I have a 1st Year CGPA of 8 and 2nd Year CGPA of 10. Then will the average will be taken? Which comes out to be 9 ?\n    └── Yea"
    }
  ]
}