{
  "id": "wywetb",
  "title": "Can ECE students in PES crack a tier 1 job(NON CORE)?",
  "content": "\nShould they learn hardcore computer science concepts \nMaintain high GPA\nOr what else should they do??",
  "metadata": {
    "root_comment_id": "ilz8mbe",
    "post_id": "wywetb",
    "author": "SlugToxe",
    "url": "https://www.reddit.com/r/PESU/comments/wywetb/can_ece_students_in_pes_crack_a_tier_1_jobnon_core/",
    "permalink": "https://reddit.com/r/PESU/comments/wywetb/can_ece_students_in_pes_crack_a_tier_1_jobnon_core/",
    "score": 15,
    "upvote_ratio": 0.949999988079071,
    "created_utc": 1661584735,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "im1z88e",
      "body": "I'll reply in the morning buddy. \n\nCouple of things actually....\n├── Good Morning bro\n│   └── Good morning 😂\n└── heyy good morning, have a nice Sunday after u post the once mentioned above.\n    └── Lmao. I completely forgot about it.\n        └── Still waiting...\n            └── And wait you shall no more. XD\n                └── Thanks bro"
    },
    {
      "id": "im6dgie",
      "body": "My bad. I was out the whole day.  \nSo yeah, T1 jobs that is non core. I would assume that is in CS. \n\nThe most important thing I you need to understand is that, many companies have a high cutoff for T1 jobs. We are looking at maybe 7.75 - 8+ GPA. Getting a good GPA in ECE is hard I heard, so you'll need to keep that in mind.\n\nNow the 2nd most important thing is that you understand how to code. You will need to show your proficiency through projects in your resume. That will depend on what you want to do though. Like, don't expect a Data Analyst job with a Web Dev resume (you could get there, but you need to understand concepts of AI / ML). Here is what my limited knowledge can provide. As an SDE, you can do different things:\n\n1. SDE -> This can include software / tool development for a platform (Android, iOS, Windows, Linux,  MacOS, FreeBSD, etc). Different platforms require different languages (Java, Swift, Java / C# / Python, Java, C / C++). The type of development depends on the company.\n2. SDET -> This role is usually involved in testing and creating a repository of tools for testing. This can include huge programs like OS's, Legacy software, etc. idk what kind of languages are used here for development.\n3. Web Development - This can include one or both these roles. Kinda liked it when I was creating projects. Hate to work on it all the time.\n   1. Backend Developer - This can involve working in the cloud (AWS, Azure or even privately deployed stuff), NodeJS, SQL, etc. Basically managing and orchestrating all the products / client's products in the back.\n   2. Front End Developer - idk if companies give T1 salaries to freshers for this stuff. UI / UX stuff  is usually here\n4. Platforms Engineer - My thing. Working with a specific hardware product and developing software features / maintaining software, etc. This sort of stuff is hard as it requires you properly understand how C and OS works. \n5. Security Engineer - This includes learning stuff like NetSec, Hacking, Finding Exploits, etc. Requires you to understand wtf security is and how it breached. Gets started using simple concepts like Cryptography, Blockchain, etc. Interesting stuff, but I reckon companies would want core CSE for this. Doesn't hurt to know though.\n6. DevOps - This stuff is basically a concept of Engineering that is rather interesting. Docker, Kubernetes. CI / CD, Cloud Engineering, SDLC, etc. This stuff is something that I always wanted to do, but never got to it. Not sure if there are many companies offer T1 here, if at all.\n7. Data Analyst - Loads of companies will come for this role. T1 at that. Understand how AI / ML works, what Data Science is, all that math stuff, etc.\n8. Cloud Engineer - basically working with all sorts of tools in the cloud (AWS, Azure, Google Cloud, etc) or if they are hardcore, develop and maintain these tools themselves. \n\nThat is all my groggy brain can think of atm. These roles should give you an idea as to what you can expect to get if you land a T1 job. For all the roles, you can fully expect questions to come from these domains in interviews. How to get there you ask? Ah well. Learn a language and start on a concept called DSA. It is very fun (not) and easy (not).\n\n&#x200B;\n\nBasically the sure fire way to guarantee an interview is if you can do these 3 things first:\n\n1. Good GPA\n2. Related projects on your resume\n3. Understand DSA and Competitive coding\n\nCompetitive coding is the first step to getting an interview. All CSE companies have this step. You can start learning a language (not JS, please ; \\_ ; ) and then go learn concepts of DSA and then try solving problems on hackerrank or leetcode. \n\n&#x200B;\n\nOn how to start coding? [Glad you asked](https://www.reddit.com/r/WorkReform/comments/srphhh/a_guide_to_entering_into_software_engineering/). It is not complete by an stretch of the imagination, but it should get your engine running at least.\n\n&#x200B;\n\nMay the force be with you.\n├── Yoo [thanks for this](https://www.reddit.com/r/WorkReform/comments/srphhh/a_guide_to_entering_into_software_engineering/?utm_source=share&utm_medium=android_app&utm_name=androidcss&utm_term=1&utm_content=share_button).\n├── Thanks a lot\n└── The most important thing that we all should know is that, baarish hota hai toh ye chata leke soota hai.\n    └── Kyunki iska ghar me chat leak hota hai\n        └── Aur usi chata se ye wifi churata hai\n            └── Because village me sirf 2g aata hai\n                └── Aur chata pe kauwa haag diya toh 1G\n                    └── Isiliye thali pe pencil chipka ke sar pe pehno. Reception aata hai\n                        └── Arre innovation and you"
    }
  ]
}