{
  "id": "x0gs50",
  "title": "How exactly will they evaluate the DIS topics in 7th sem?",
  "content": "So I'm not getting any information from the college on how the ISAs of the DIS topics would be conducted. Will there even be ISAs for them? Would they expect us to cover certain topics before every ISA? Does anyone know how it is gonna be for Distributed Systems  T\\_T",
  "metadata": {
    "root_comment_id": "im8493r",
    "post_id": "x0gs50",
    "author": "schwarzhexe",
    "url": "https://www.reddit.com/r/PESU/comments/x0gs50/how_exactly_will_they_evaluate_the_dis_topics_in/",
    "permalink": "https://reddit.com/r/PESU/comments/x0gs50/how_exactly_will_they_evaluate_the_dis_topics_in/",
    "score": 6,
    "upvote_ratio": 1,
    "created_utc": 1661751683,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "im8493r",
      "body": "My batch had ISAs and ESA for all the special topics, even for the DIS courses. They were given a certain list of topics to cover before each test, they might send it to you soon. Although if I remember correctly they did send it pretty late, a few days before the test. \n\nIf I am not wrong Distributed Systems classes occur every week, why not ask KVS in class?\n└── We don't have classes for DS from college and have to refer to the MIT course for the same. The faculty in charge also do not bother replying to emails asking about the ISA syllabus T\\_T\n\nThanks for the reply though!"
    },
    {
      "id": "imadrgg",
      "body": "For all the STs in 7th sem its 2 ISAs and 1 ESA.   \nFor DS in particular there's a 10 mark project component as well. The first ISA's syllabus consists of the first 6 lecture videos. \n\nThere's a faculty in-charge for every single DIS course, and there's a whatsapp group for DS, although I'm not comfortable sharing a whatsapp group link on reddit. You might have to find that on your own\n├── Is the project component there for every DIS course or only some?\n│   └── I don’t think every course has a project, but I’m not certain\n│       └── Oh alright. Thanks for the clarification!\n└── Ahh Alright\n\nThank you"
    }
  ]
}