{
  "id": "x3wr9d",
  "title": "Any tips for getting 9+ gpa in first year and managing extra curricular activities?",
  "content": "",
  "metadata": {
    "root_comment_id": "imsd88l",
    "post_id": "x3wr9d",
    "author": "Youcrap-andsmile",
    "url": "https://www.reddit.com/r/PESU/comments/x3wr9d/any_tips_for_getting_9_gpa_in_first_year_and/",
    "permalink": "https://reddit.com/r/PESU/comments/x3wr9d/any_tips_for_getting_9_gpa_in_first_year_and/",
    "score": 12,
    "upvote_ratio": 1,
    "created_utc": 1662109902,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "imsd88l",
      "body": "Work hard. Dedicate your time. And most importantly, know your capacity.\n\nPS: I didn't get 9+. But this is what the people who got 9+ did.\n├── how many got 9+?\n│   └── Umm so about 20% of the College gets 8.5+\nSo I guess around 10% have more than 9. Not sure honestly \n༎ຶ‿༎ຶ\n│       └── Ohh ok... Thanks..\n└── I’ve heard that it can get really hectic here. Is that true? Is there a way to have minimum backlogs? I sound like such a nerd right now xD but I sorta need to change my branch in the second year if in case I don’t get it in the second round. Trying to be prepared mentally so that I’ll be able to actually execute it later on:)\n    └── Well to be honest it's TOOOO HECTIC. If you're coming here then forget about having a chill lifestyle. If you want to have a decent grade that is. \n\nAnd about backlogs, just work hard and you won't get them. If work is your main aim after college then don't have backlogs. Or else you can't sit for placements. \n\nAbout changing branch, unless you're in the top, then it's extremely extremely hard. \n\nJust say fuck it and go with the flow if you really want to come here. All the best :)"
    },
    {
      "id": "imsfqpn",
      "body": "All this pre-college josh. I like it"
    },
    {
      "id": "imsjkhq",
      "body": "Let's enter college first, then you can eventually make your own path. Although your intentions are right, there is no fixed template for 9+ cgpa.\n\n If everyone replies with the usual study well, don't waste time around the campus, your question sounds very obvious and doesn't give off a good impression. So my opinion is to interact with everyone irl and see what everyone's doing. Then make changes accordingly and study well.\n\nI hope we can be classmates ahead(EEE fresher:) ).\n└── True dude. Hope we all have a great journey here:)\nLooking forward to meeting you:))\n    └── You coming for tomorrow's orientation?\n        └── Of course lol\n            └── Great, hopefully we meet tomorrow :)\n                └── Let's goooo"
    },
    {
      "id": "imwl6sc",
      "body": "know your capacity and don’t compare yourself. If you compare yourself to others, you will feel very low and won’t be able to study. your grades will go down too. just know that this is a university and some people will be extra smart and be able to excel in everything even in extracurricular activities. don’t envy them , be happy for them and ask them for help if you need it.\n\nCompare your performance to your previous semester performance.  yes it’s a good idea to see where you stand with respect to others ,If you feel that you could have done better , try next time. But don’t feel bad just because some other person got better grades than you.                                                   \nbottom line: find out your true potential and use it to it’s maximum. Don’t over stress yourself cause if you do, whatever you could do before you won’t be able to in the future."
    },
    {
      "id": "imx4yjk",
      "body": "Bruh i literally skipped integration in class 12 like i know v basic thingy, will math be v hard for me now in the first year?\n├── Did you prepare for boards? Cuz in term 2 Integration had high weightage iirc\n│   └── Noo i was state board so like i could 1 mark q that's it\n│       └── Neither was I able to solve much of integration in boards/jee/pessat. Eventhough I practiced it a lot and knew all the methods but in competitive exams it's different level shit ngl.\n│           └── Truee\n└── Man I hadn’t touched calculus until February and I somehow put my mind to it and learnt it. I did all examples and sums from ncert in both differentiation and integration and I’m glad I did cause I’ve heard engg has a lot of calculus in it. I guess even you should just learn it off now and not delay cause without knowing the basics, it’s very hard to solve problems.\n    └── Yess bro i was planning to start now"
    }
  ]
}