{
  "id": "x48cak",
  "title": "Pressure/Stress and Workload in PESU",
  "content": "Hi I am planning to join PESU this year. Just wanted to know how much Pressure/Stress do PESU students face? How much workload like assignments and projects is given? How Hectic is the 5 ISA thing coz 1 test every 2 weeks?How tough is the Syllabus to study coz I heard it's demanding as it is fully updated every year according to industry?\nI am asking this bcoz I have been medically advised not to go to a stressful environment as it will impact my mental health.",
  "metadata": {
    "root_comment_id": "imvgjwx",
    "post_id": "x48cak",
    "author": "ATthebeast04",
    "url": "https://www.reddit.com/r/PESU/comments/x48cak/pressurestress_and_workload_in_pesu/",
    "permalink": "https://reddit.com/r/PESU/comments/x48cak/pressurestress_and_workload_in_pesu/",
    "score": 9,
    "upvote_ratio": 0.9200000166893005,
    "created_utc": 1662142148,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "imvgjwx",
      "body": "What are your other options? Because scoring well in an Engineering degree does take effort. Good planning, time management and proactive studying (don't leave everything to the evening before the test), should reduce stress levels significantly.\n\nAlso, what's your course and how did you fair in 12th, KCET, Mains etc.? If you prepared for JEE and did fairly well, you shouldn't have much trouble in the first year and can ease into college life\n└── Hey I've taken CS. I think I did decent in 12th boards (95% cbse pcmb combo) and kcet(1.4k rank) but I never had any JEE preparation and didn't do good in JEE (93%ile). I only studied maths for boards since I chose to do engineering quite late. How tough will I find the first year?"
    },
    {
      "id": "imvtp44",
      "body": "I'll be blunt, it can get very stressful here. If you're advised to avoid stressful environments then i don't think pes will be a good fit for you.\n└── Thanks"
    },
    {
      "id": "imw6w4s",
      "body": "Can any more seniors share their opinion?\n└── Can u get Into BMSCE?\n    └── Yes, CS\n        ├── Cool from what I've heard from my seniors, BMSCE is as good as pes in terms of placements, but provides a much more relaxed environment and gives u more time for self development and learning skills outside their syllabus. I think you should consider BMSCE.....\n        │   └── Thank you\n        └── bro then go to bms. workload is not as high as pes. Placements-wise maybe pes is a tad bit better but not a big deal, BMS CS gives you lot more time to focus on your stuff than PES CS. Also, check the number of research papers by BMS and PES. BMS has 28 while PES has <10( 5 if i’m not wrong)\n            └── Thx"
    },
    {
      "id": "imw7nmt",
      "body": "If you have specifically been advised to stay away from stressful things... Then definitely stay away from pes... U will simply reget not joining some other college which can also provide good placement, but is a lot more chill than here, PES is a school basically.\n└── Thanks"
    },
    {
      "id": "imz967h",
      "body": "Bro joining this college is like a free ticket to hell. Strict on attendance, assignments, projects….bruv I can just keep on going. If you want a peaceful life then look away from PES.\n└── Thx"
    },
    {
      "id": "in1daww",
      "body": "the work to reward ratio is higher than what people think. The work you’ll be doing or spending time on will mostly be college stuff coz there’s just so much but the reward you’ll be receiving is from the stuff you do outside of pes like extra courses or certifications. Pes is not exactly stressful, depends on how seriously you take their tests. I know quite a few people who just chill most of the semester, submit others’ work and just start studying 1-2 weeks before esa. They have low grades but are sailing through\n└── Ok"
    },
    {
      "id": "lpcrzcz",
      "body": "i actually joined pes ece ecc campus through pessat just for 1 week i feel i'm at the wrong place among all ppl who study and the syllabus is too much to study and no time for other courses or any other activities ,so is it ok to just pass at pes with low cgpa or a tier 2 clg with greater skills and cgpa reply asap guys im in very much dilemma"
    }
  ]
}