{
  "id": "x4o5nf",
  "title": "How hard would PES be for an average student?",
  "content": "Because we've all heard of the college's academic pressure and all. I got pretty bad in JEE and okay okay in boards, but my PESSAT had gone surprisingly well and I got a seat in cse main campus. I saw similar post where op was worried abt pes, but they were a topper themself? (getting 90s in jee and boards is no joke okay) and I was like damn wtf will I do then lmao\n\nI am obv willing to work hard, but I don't want to set myself up for failure (but also don't want to lose a great opportunity). ",
  "metadata": {
    "root_comment_id": "imwqoxs",
    "post_id": "x4o5nf",
    "author": "imtootiredforthisugh",
    "url": "https://www.reddit.com/r/PESU/comments/x4o5nf/how_hard_would_pes_be_for_an_average_student/",
    "permalink": "https://reddit.com/r/PESU/comments/x4o5nf/how_hard_would_pes_be_for_an_average_student/",
    "score": 9,
    "upvote_ratio": 1,
    "created_utc": 1662188926,
    "flair": "Study Help :table:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "imwqoxs",
      "body": "reach"
    },
    {
      "id": "imwrhsz",
      "body": "Cfbr.\nLooks like your guesses in pessat went right lmao\n└── i agree haha"
    },
    {
      "id": "imwx3vx",
      "body": "For a CGPA above 8.5, it will be difficult\nFor a CGPA above 7.5, a good study just before the exam should do\n\nAlthough results may vary for each person!\n└── so its still worth it right? since cs avg package is 12lpa so technically even if im below avg my package would be higher than other colleges (w my logic)\n    ├── You can keep a 7.5+ cgpa but then you need to make sure that your resume is heavy hitting \n\nExtra Curricular and additional skills become important\n    └── So one assumption being made here is that enrolling in CS automatically will entitle you to a \\~12 LPA package. Unfortunately that is not the case. Placements, especially CS, are difficult and there is a lot of competition as well (900+ kids sit for each company's tests and each company only selects a handful after interviews). CS placements also require you to pickup skills beyond your courses, and often rely on these skills 90% of the time to land you a job.\n\nMy point is, you will need to work hard, even if the opportunity exists here"
    },
    {
      "id": "in1cy7c",
      "body": "they’ve increased the number of hours per subject per semester, they’ve increased the number of internals( from 2-3 to 5), the assignment workload is the same BUT there’s an additional thing introduced called hands-on which needs your time and attention as they have regular submissions. Academics will take up majority of your time or rather all your time and you’ll be left with barely any time to focus on additional courses or certifications. The people who have 8.5+ gpa and have done stuff outside of pes have high efficiency and consistency. If you fall in that category, you’ll do just fine"
    }
  ]
}