{
  "id": "x5kouz",
  "title": "HAVE confusion cant do differentiate between Srn and PRN so if anyone could tell the format it would be helpful",
  "content": "",
  "metadata": {
    "root_comment_id": "in1l4hb",
    "post_id": "x5kouz",
    "author": "Sea_Mail_2026",
    "url": "https://www.reddit.com/r/PESU/comments/x5kouz/have_confusion_cant_do_differentiate_between_srn/",
    "permalink": "https://reddit.com/r/PESU/comments/x5kouz/have_confusion_cant_do_differentiate_between_srn/",
    "score": 5,
    "upvote_ratio": 1,
    "created_utc": 1662290807,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "in1l4hb",
      "body": "Where is the SRN?\n└── In the paid receipt, the one they gave in counselling\n    └── That is prn\n        ├── Even i got confused da. But reading comments from seniors i believe that is srn and prn is some other code\n        │   └── SRN won't be issued now, it will take time. PRN is the number on your ID card or the one in the receipt.\n        └── Check code in the id card"
    },
    {
      "id": "in1l5k4",
      "body": "example SRN: PES1UG22CS001\n\nexample PRN: PES1202200501"
    },
    {
      "id": "in1p1vr",
      "body": "SRN is the department specific roll number, \nex: PES1UG22ME033\nPRN is the university specific roll number, \nex: PES1202200888"
    },
    {
      "id": "in1q4sc",
      "body": "I asked pesu support and they said that SRN will be updated once it is generated"
    },
    {
      "id": "in1qnx8",
      "body": "Srn is the one used everywhere.\nPrn is something you'll hardly need"
    },
    {
      "id": "in219kl",
      "body": "Okay, saw a bunch of people asking where SRN is, but I can't reply to all so here it is.\n\nSRN is something like a permanent number that is issued alphabetically. So yeah, until PESU finalises who all are gonna be there in what department, you all won't get the SRN. SRN will be made available only after all the CET and PESSAT rounds of admissions are over. So, until then, you guys relax and don't worry about it. Just use your PRN when they ask for SRN or PRN, and if they ask you all why you are using PRN instead (99.99% sure that it won't happen), just tell them that the SRN hasn't been issued yet. My batch wrote 2 ISAs without SRN in the first semester, last year. It went fine. Just don't worry, and chill.\n\nEdit: You all first enter college and enjoy bootstrap. Bootstrap is fun. Don't start worrying about all of these at this point of time. You all have one week to get to know each other. It's crucial in making friends and forming close bonds. In bootstrap, focus on these as it will be harder later on(not saying that it's impossible)."
    }
  ]
}