{
  "id": "x9qivk",
  "title": "Is the PES Electronic City Campus good for CSE? How is the campus infrastructure, campus life, first year hostel, and faculty there?",
  "content": "I think I have landed a KCET rank good enough to get PES EC CSE. I want to opt for hostel, and was wondering how the living conditions will be. A few photos to illustrate would be nice. It would be even better if a person studying in EC Campus delivers his insights on the question.",
  "metadata": {
    "root_comment_id": "inpggsa",
    "post_id": "x9qivk",
    "author": "SkywalkerPadawan512",
    "url": "https://www.reddit.com/r/PESU/comments/x9qivk/is_the_pes_electronic_city_campus_good_for_cse/",
    "permalink": "https://reddit.com/r/PESU/comments/x9qivk/is_the_pes_electronic_city_campus_good_for_cse/",
    "score": 7,
    "upvote_ratio": 1,
    "created_utc": 1662714376,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "inpggsa",
      "body": "Go for it. There is no difference between RR and EC campus. Don't miss this opportunity. No other college has placements as good as PES in Bangalore.\n└── Are you a hostel student? Wanted to ask you how the hostel facility in EC is.\n    └── Pretty decent. Gets bad when there is heavy rains. Otherwise it's manageable. No I'm not a hostel student.\n        └── What happens when it rains heavily?\n            └── Gets flooded. Can't leave the hostel. But they clear it out quick.\n                └── Yup, time to get a raincoat.\n                    ├── More like a pair of swimming trunks\n                    │   └── Well, I'll see what I can do.\n                    └── And a boat\n                        └── Wait, is it that serious?\n                            ├── Not anymore ig\n\nI don't stay in that area now....\n                            │   └── ok cool\n                            └── some years ago , yes.  Not sure how it is in past few years.  \nhttps://www.deccanherald.com/content/425911/students-evacuated-boats-friday-rain.html"
    },
    {
      "id": "inpk8nl",
      "body": "1st year you'll get hostel in amaatra, it's around 6km from the college, buses will be provided. \n\nThe rooms are great, the warden is a sweet panda.\n\nIf you have good people around your room, you'll love the hostel life. \n\nYou get the campus for playing basketball, badminton, soccer etc.\n\nOnly downside is, you'll have to wake up at around 6.\n\nFrom second year onwards, you can get the hostel in the college campus if you're a guy. Then you can wake up at 7:30 and still be on time easily. \n\nIf you're a girl...... You'll be staying in amaatra.\n├── So when is the curfew time? Moreover, how is the wifi and mess food?\n│   └── 1st year curfew is around 7. Can ask the warden for staying out late provided you have a valid reason.\n\nIn the college I think it's 7:30, Can ask the warden for staying out late.\n\nWiFi is good in amaatra.\n\nMess food is good enough, for mess food standards.\nIt's edible.\n│       └── Thank you for your insight. Really helps a lot.\n└── One of the sweetest hostel review\n\nGood one"
    },
    {
      "id": "inpnzns",
      "body": "I've joined here through PESSAT\nYou can DM me cuz I can't sent pictures here\n└── ayo stop dming for pics anol\n    └── Happy kek day\n\nSend pix"
    },
    {
      "id": "ip2z035",
      "body": "What will be the fees for cse if we join pes through pessat &hostel fees in EC campus?"
    },
    {
      "id": "ip2z77d",
      "body": "I got btech IT in VIT & i am waiting for pes 2nd round counselling,which one is good?\n└── you should go for IT in VIT if you're getting main campus (Vellore)"
    }
  ]
}