{
  "id": "x9ww64",
  "title": "Anyone here who left BITS circuit / dual-degree or LNMIIT CSE for PES RR CSE ?",
  "content": "Wondering if anyone took up PES RR CSE knowing well that they could get the BITS Hyd campus EEE/ENI or dual-degrees Eco/Math/Phy, or LNMIIT CSE ? What were your reasons ?",
  "metadata": {
    "root_comment_id": "inqpywp",
    "post_id": "x9ww64",
    "author": "Professional_Row_967",
    "url": "https://www.reddit.com/r/PESU/comments/x9ww64/anyone_here_who_left_bits_circuit_dualdegree_or/",
    "permalink": "https://reddit.com/r/PESU/comments/x9ww64/anyone_here_who_left_bits_circuit_dualdegree_or/",
    "score": 7,
    "upvote_ratio": 1,
    "created_utc": 1662733511,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "inqpywp",
      "body": "bits circuital chodke idar kon ayega bro 💀\n└── COMED-K, PESSAT, KCET juntaa all are ga-ga over RV, BMS, PES... especially PES-RR CSE. And there are youtubers will million followers who say \"CS is CS\". So confused (and a bit scared). Had BITS score been good enough to confidently say I'd get ECE, probably would not have asked :-)\n    ├── Bhai esa kuch nahi he , Unless u wanna go cs ms right after btech or ur passionate about doing cs only ( most of the course isn't relavent for IT jobs ull be self studying anyway) , it is utter foolishness to compromise on tier 1 University for just the cse tag , esp if it's pes and bits circuital ur comparing , bits is saal ka avg 30lpa he lmao if u get circuital just go for it , the exposure and peer quality over ther is also much better than this place , however this place isn't so bad too (I'm a fresher) , u just need to find the rite ppl and ther r lots of exciting activities on campus , but i would take bits EEE over this place any day if I had the chance for a multitude of reasons\n    └── Also talk to actual bits alums/seniors and pes cs seniors and basically someone in real life before making these decisions, ytubers nd reddit is NOT where u should be making life decisions"
    },
    {
      "id": "inqyh8d",
      "body": "I am currently in pes EC cse and think I can get bits eie in hyd/goa. Should I take it?\n\nI don’t really have any particular interest in any branch, my decision would be purely based on placements and enjoyment for 4 years\n├── Continue with cse at PES.\n└── Placements - go with CSE.\nEnjoyment - well, the crowd we were with was chill. Hopefully that continues. Apart from that the curriculum is hectic.\n    ├── Crowd goals <3\n    └── You graduated from the EC campus?\n        └── Yes.\n            └── Cool, I’ll probably stick with pes.when I counted the cutoffs compared to previous years It’s actually kind of unlikely that I can make the cutoff for bits. Just want to be prepared to make a decision if I get it"
    },
    {
      "id": "ioshvya",
      "body": "I did :)  \nIt's because a dual at bits would be *risky*  \nThey had a semester online, with full cheating as expected, so GPA that sem would be unpredictable, and if things didn't work out, I'd be pursuing a degree I don't want/need for 5 years.\n└── Which college did you choose then"
    }
  ]
}