{
  "id": "xn1v0g",
  "title": "RVCE CS in AIML/Data Science/Cybersecurity Versus BMSCE/PES RR(Main) CSE",
  "content": "\nWhich of the above is Better and WHY for What Reason?",
  "metadata": {
    "root_comment_id": "ipr4rpk",
    "post_id": "xn1v0g",
    "author": "ATthebeast04",
    "url": "https://www.reddit.com/r/PESU/comments/xn1v0g/rvce_cs_in_aimldata_sciencecybersecurity_versus/",
    "permalink": "https://reddit.com/r/PESU/comments/xn1v0g/rvce_cs_in_aimldata_sciencecybersecurity_versus/",
    "score": 6,
    "upvote_ratio": 1,
    "created_utc": 1664047983,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "ipsrnv9",
      "body": "Any computer related branch at RVCE >>> Cse at any other Ktk college. RVCE is an all India known oct college just like bits , rest are known only in there regions. No comparison.\n├── Ok Thx\n└── What would be better- ECE at NITK or ISE at RVCE?\n    └── ECE at NIT-K"
    },
    {
      "id": "ipsw5ag",
      "body": "Thing is, anything computer related is basically cse. Cse specialisation and cse are no different in terms of placements, higher education,  etc etc. Cse spec and cse are only different wrt to the elective subjects. That's it. The only reason cse specialisation exists is so that colleges can increase the number of cs seats, but be a lil discreet about it.\n\n\nSo yeah choose the better college,  and choose the specialisation that seems the most interesting.\n├── Ok Thx\n└── It's very unlikely people will be able to make a good informed decision of choosing a specialisation without knowing what their interests are. A lot of people choose these new branches based on the hype (especially AIML), without actually understanding what these fields are about. There is always the possibility that one may not find the field interesting well into their 2nd/3rd year, and that is risky and something that should not happen. \n\nChoosing a specialisation now does not make sense if you have not done your research and are unsure about what you are interested in. Choosing one that seems \"interesting\" is very surface level, and this requires more time to research and see what it is about and see if your interests align with it. Choosing the CSE branch allows you to make that elective choice later and keep your options open, rather than restrict yourself later on.\n    └── Ok Thanks"
    },
    {
      "id": "ipswcbf",
      "body": "Also cutoffs for cse specialisation are lower cuz of lack of awareness. In most colleges the way cse specialisation is implemented is such that ur major is in cs and ur minor is in aiml/datasci/cybersec.\n├── Ok Thx\n└── Which would be better, ISE or CSE specialisation branches?"
    },
    {
      "id": "ipsxth8",
      "body": "While I agree with the other comments about RVCE being a better overall college compared to PES, I do not recommend going ahead with a fixed specialisation from the beginning. Specialisations are often offered as electives which you will need to take up. If you take the CSE branch, you'll instead have the opportunity to actually make that *choice* and choose your elective, unlike specialisations where you will be forced to take it to get the specialisation. The reason this is bad is because as a Fresher, you *may* not have much idea about those specialisations and might not know what you are interested in. You never know if you will like it or not. \n\nRestricting yourself to a specialisation now even before finding out what all it comprises of is in my opinion atleast, very risky. Choosing core CSE will allow you to explore and find out different fields you actually might be interested in, and help you take better decisions about which electives to take and specialisations to opt for. There are more answers to this question on this subreddit, search and you'll find multiple with the same opinion. Don't choose anything now, go with CSE at RVCE or PES.\n└── Ok Thanks"
    },
    {
      "id": "ipta6vi",
      "body": "RVCE anything CSE related is better than PES RR CSE , Maybe placements are decent but the campus is pretty small and too crowded, intake of PES CSE is 1500+ for both campuses combined and 300+ people in AI/ML from this year which causes alot of internal competition and during placements CGPA cutoffs are messed up for tier 1 companies. PES is more or less like VIT , SRM now or atleast they're trying to be.\n└── Ok thx"
    }
  ]
}