{
  "id": "xn62uo",
  "title": "AIML in RR campus Vs CSE in EC campus",
  "content": "I'm getting AIML in RR campus through PESSAT and CSE in EC campus through KCET\n\n\nIs it worth paying 4x the fee for a new branch in main campus?\n\n\nAnd what are the major differences between AIML & CS?",
  "metadata": {
    "root_comment_id": "iprzf34",
    "post_id": "xn62uo",
    "author": "sujan28",
    "url": "https://www.reddit.com/r/PESU/comments/xn62uo/aiml_in_rr_campus_vs_cse_in_ec_campus/",
    "permalink": "https://reddit.com/r/PESU/comments/xn62uo/aiml_in_rr_campus_vs_cse_in_ec_campus/",
    "score": 7,
    "upvote_ratio": 1,
    "created_utc": 1664058703,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "iprzf34",
      "body": "cfbr"
    },
    {
      "id": "ipsirhi",
      "body": "Even at the same fees I would recommend sticking to EC campus. Your choice is a no-brainer\n└── Absolutely valid opinion. Ec campus is underrated. Stick to EC campus, it's so wonderful."
    },
    {
      "id": "ipsn0as",
      "body": "It's definitely not worth the fees unless travel time to the ec campus is really bad, because a btech cse >> btech aiml. If you were getting cse rr through pessat it would be a more difficult choice, since despite what others say for now the rr campus is much better than ec, but in this case go for ec campus.\n└── How is it better than ec campus?\n    └── Better peer quality(and very crowded too which can be both an advantage and disadvantage), more established, more events, it's called the \"main campus\" for a reason. The gap may be closing but it's a pretty big gap, look at the difference in kcet cutoffs for both of them.\n        └── \"better peer quality\" idk man is the difference of 1500 ranks between 2 people in a pcm exam enough to decide who's smarter? Even if you were deciding the extent of someone's smartness with their pcm marks, a difference of 1500 ranks is negligible, especially considering how both colleges cutoffs are under 3k.\n\n\"Very crowded\" tbh I prefer less crowded lmao fewer people\n\n\"More established\" because it's been around for longer, yes.\n\n\"More events\" people in ec campus can attend them but ig they wouldn't get to organise them so you're right about that. \n\nIt's called the main campus because it was the first one to be established. \n\nIf OP lives pretty damn far from rr campus and really close to ec campus (like me), ec campus is the obvious choice.\n            ├── \"\"better peer quality\" idk man is the difference of 1500 ranks between 2 people in a pcm exam enough to decide who's smarter? Even if you were deciding the extent of someone's smartness with their pcm marks, a difference of 1500 ranks is negligible, especially considering how both colleges cutoffs are under 3k.\"\n\n\nI love you man, that's what I've been saying all this time.\n            ├── >ec campus is the obvious choice\n\nI did tell him to go for the ec campus...\n            └── >difference of 1500 ranks\n\nIf you're talking about kcet then RRC cse is 700ish and 1700ish ECC CSE..So 1k difference and we can see that ECC CSE cutoff is getting lower every year.\n\nFor PESSAT it differs every year (turnout is the major factor unlike kcet).\n\n>\"More events\" people in ec campus can attend them but ig they wouldn't get to organise them so you're right about that.\n\nCurrently EC campus clubs are more active than RR (Maybe RR is waiting for kcet batch to join) and conducting workshops,events, recruitment events regularly infact daily. Till now most Hackathons were there in RR campus cuz of the availability of MRD Student Centre there which can accommodate both campuses participants but now as you might've seen the MRD Student Centre of EC campus has been developed. So the frequency of hackathons in EC campus will also inturn increase."
    },
    {
      "id": "ipsr9kb",
      "body": "Go for Cse at EC campus. EC campus is not far behind RR. Bigger campus, open space, mrd centre,good teachers. Core cse >>> aiml and finally the financial aspect\n├── +Less crowded\n└── Absolutely valid opinion. Ec campus is enormously underrated."
    },
    {
      "id": "ipsxm5z",
      "body": "whats your rank in cet??"
    },
    {
      "id": "ipszam2",
      "body": "If I was you , I would go with CSE at EC campus."
    },
    {
      "id": "iptkhnn",
      "body": "Cse at EC campus"
    },
    {
      "id": "iptlngi",
      "body": "AIML at RR campus IMO, but only if you're interested in the course. The reason is because they've confirmed that it's a CSE degree end of the day.\n└── What do you mean its a cse degree? Isn't it cs with ai/ml specialization?\n    └── It is, but a lot of my peers got confused and thought it was a pure AIML degree, until they were clarified that it was CSE along with specialization which means that they'll be getting (or at least expected to) same opportunities as the students who have chosen CSE at RR campus. Moreover, as soon as CSE at RR got over, people went for AIML at RR and then CSE at EC campus and finally chose ECE at RR campus (priority order by the people)\n        └── Thanks\n            └── you're welcome!"
    },
    {
      "id": "ipy2roc",
      "body": "Talking of peer grp. RR will have more of the management quata students also. Good or bad."
    }
  ]
}