{
  "id": "xz0zu5",
  "title": "Best Option ASAP",
  "content": "Which is the best option out of these 2?\nAlso Please write in the comments Out of the RVCE Specializations which option would be best?\n\n[View Poll](https://www.reddit.com/poll/xz0zu5)",
  "metadata": {
    "root_comment_id": "irjnzux",
    "post_id": "xz0zu5",
    "author": "ATthebeast04",
    "url": "https://www.reddit.com/r/PESU/comments/xz0zu5/best_option_asap/",
    "permalink": "https://reddit.com/r/PESU/comments/xz0zu5/best_option_asap/",
    "score": 4,
    "upvote_ratio": 0.8299999833106995,
    "created_utc": 1665256504,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "irjnzux",
      "body": "Rvce ,hands down. Rvce is perhaps second only to  bits as pvt eng college at national level. \nRvce >>>>>pes\n└── Ok thx"
    },
    {
      "id": "irjscp7",
      "body": "RV is better but life in RV is hectic and the exam difficulty level is much higher than other VTU colleges. I have asked my friends.\nJoin RV and maintain CGPA above 9.75 in the first year and switch to CSE. Try to maintain cgpa over 9.5 overall till 6 sem and you will bag a placement above 10 lpa\n├── Ok thanks. But I feel PES is more Hectic bcoz the number of assignments is more and tests are also more in Pes.\n└── PES is more hectic than RV. We have 5 internals, assignments in every subject, projects in every subject and externals. You’ll barely have any time to focus on your stuff or to even relax after internals. 29-30 hours a week is what you’re expected to spend in college which is ridiculous\n    └── Thanks for the input"
    },
    {
      "id": "irm7d6a",
      "body": "Imagine taking AI or cybersecurity and you realize you hate them to the core. \n\nTaking up CS allows you to specialize later after exploring in mu opinion.\n├── This is an apt answer\n\nYou are pursuing a BTech degree, don't specialise your career line in your Bachelors degree itself\n\nTake CSE, it's broad, figure out what you genuinely like, then go for a Master's in a specific field\n├── But at the end it's still a CS degree right ? \nYa further studies will be a problem if u hate it but if you wanna just grab an offer after btech in a product based company , then it's fine ig ....\nCorrect me if I'm wrong\n│   └── CS degree yes, but all your electives and major courses will be in that field. If you don't like them/find them boring, you won't have the incentive to study and get a good GPA required for placements. Not only will it require more physical effort to do well, but you'll mentally struggle to cope up with the subject matter and also find the will to do better. We always tend to do better in the subjects that we like. It's because that affinity makes it easier to put in effort and makes us want to do better. Without that passion for a subject, you're just looking at 4 years of struggle.\n│       └── The points you've mentioned are absolute facts...\nBut as I've heard they teach the specializations from 3rd year or so .Plus somewhat boring subjects, courses are 'Ok' than the tight schedule is what I feel\n│           └── True\n└── It's just a way to increase the intake."
    },
    {
      "id": "irrqy8z",
      "body": "One more point .At PES, At the time of councelling,there will be more than 1800 Cse and related students (both rr and EC campus sit together for placement ) . Now that's a huge no and compitition too!!\n└── Ok thanks"
    }
  ]
}