{
  "id": "y4f6se",
  "title": "Doubt regarding placements",
  "content": "Hello, \nI got a tier3 FTE offer and a tier2 internship + FTE offer.\nSo my doubt is, can I sit for tier1 companies and dream companies?",
  "metadata": {
    "root_comment_id": "isdx8jb",
    "post_id": "y4f6se",
    "author": "Temporary_Media3681",
    "url": "https://www.reddit.com/r/PESU/comments/y4f6se/doubt_regarding_placements/",
    "permalink": "https://reddit.com/r/PESU/comments/y4f6se/doubt_regarding_placements/",
    "score": 3,
    "upvote_ratio": 0.8100000023841858,
    "created_utc": 1665810523,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "isdx8jb",
      "body": "Nope, atmost 2 offers across all tiers\n├── Oh ok thanks\n└── You can't choose which tiers you get? Like if you get 2 decent offers you can't even try for the tier 1 ones? I might join pes, so hoping you could help\n    └── Nope. The first two offers you get are your final ones, that's why it's important to choose and apply.\n        └── Ohh damn ok so do people generally only apply for the highest paying companies?\n            └── You ideally apply want to apply for all of them but there is a risk of you getting into a company you feel isn't paying enough. Best thing is to get one offer as backup, close to what you are expecting, and then keep applying to all companies better than the one you have. If you feel you might get into a company you don't want to, fail the interview on purpose.\n\nThere isn't exactly a simple solution to this. You need to be smart and take a decision based on the companies that have visited already, companies that might come, how many people have been recruited, etc. It's a gamble.\n                └── ohh okay \n\nThanks for replying! It was very informative"
    },
    {
      "id": "ise24wi",
      "body": "I have an tier2 FTE offer .So what offers am i eligible for next ?\n└── If you have tier X, you are eligible for any offer higher than X. So that means you're eligible for tier 1 and dream company internship+ FTE or FTE only or internship only"
    }
  ]
}