{
  "id": "y5vhpz",
  "title": "AI/ML degree vs CSE(AI/ML) degree. What's the difference?",
  "content": "",
  "metadata": {
    "root_comment_id": "ismg423",
    "post_id": "y5vhpz",
    "author": "[deleted]",
    "url": "/r/Btechtards/comments/y5mn2z/aiml_degree_vs_cseaiml_degree_whats_the_difference/",
    "permalink": "https://reddit.com/r/PESU/comments/y5vhpz/aiml_degree_vs_cseaiml_degree_whats_the_difference/",
    "score": 3,
    "upvote_ratio": 1,
    "created_utc": 1665963673,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "ismg423",
      "body": "May be the difference in the Degree given. Like many colleges have Data Science vs Cse with spl in Data science. Best to see the syll and the course curriculum. But core cse preferred over specialisation."
    },
    {
      "id": "isn02m6",
      "body": "Based on this, its important to find out which of these degrees is being offered by PES.\n\nRegardless, I would suggest core CSE >> CSE with AIML > AIML"
    },
    {
      "id": "isn83ai",
      "body": "They give you a CSE degree with AIML specialization. This information is directly from the councelling staff. They had mentioned this to my father in PESSAT round 1 counselling. So things might've changed since then but I personally don't think so.\n└── In the option entry for kcet PESU, its mentioned as Ai/Ml. But I don't know if its same case as in PESSAT\n    ├── In the final seat matrix of kcet it's CS(Aiml) , even I asked a senior in RV who's in AIML branch ..He said it's 80% similar to cse, so chill\n    │   └── What about placement wise? Would it be the same as a cse-aiml or IT branch?\n    │       └── Don't worry about placements as they'll definitely allow AIML students to sit\n    └── I don't know why it says that in the KCET option entry. (I noticed it too)  \nBut like how u/sarcastic_introvrt has mentioned, in the final seat matrix released by KEA, it says CSE(AIML) so it's mostly CSE degree with AIML specialization as speculated. Moreover, I haven't seen colleges in Karnataka bringing out a pure AIML course before a CSE(AIML) course."
    },
    {
      "id": "ko96itr",
      "body": "Interesting topic!"
    }
  ]
}