{
  "id": "y90joz",
  "title": "ISA",
  "content": "I am currently in 2nd year CSE department. Will there be relative grading or is it absolute grading this time because I am messing up all the ISA's.\n\nI don't know what to do also. I think that I have done better after coming out of the exam hall but still this happens to me all the times.",
  "metadata": {
    "root_comment_id": "it33064",
    "post_id": "y90joz",
    "author": "Ambitious_Area1240",
    "url": "https://www.reddit.com/r/PESU/comments/y90joz/isa/",
    "permalink": "https://reddit.com/r/PESU/comments/y90joz/isa/",
    "score": 5,
    "upvote_ratio": 0.8600000143051147,
    "created_utc": 1666278022,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "it33064",
      "body": "Being in the 4th year... Most of us still do not know tbh...not even the teachers do... But ig it depends on the overall performance of the batch for that exam from what I have heard...the college is not exactly transparent in these sort of things."
    },
    {
      "id": "it5li1s",
      "body": "I would say it depends on the subject, and its towards the end. What I mean by that is that, if they are to do relative grading, theyll only do it after the whole ISA+ESA calculation part. If everyone has done relatively bad, theyll bump up everyones grade, by a grade or so. \n\nIts never the marks which are improved, its the grade.  We've had a few subjects which ended up being a relative grading (Web Tech and Machine Intel to my knowledge). But thats only when EVERYONE is for sure done bad and the subject itself is quite hard. \n\nAgain this is all purely speculation, like the other redditor said, the college never really tells us when its taken as relative or absolute or on what basis. \n\nFor now, know that its fine to have one or two ISAs go really bad, it happens. focus on getting back those marks in the next ISA, and youll be fine. \n\nAlso, just a reminder, if you mess up, never assume its gonna be relative all the time and ease about on your prep for the next ISA, its almost never the case lol.  Only the truly difficult subjects get relative grading, and in my experience its quite rare and only in extreme cases will they apply relative. So always consider it to be absolute just to be prepped for worst case scenario."
    },
    {
      "id": "it79btd",
      "body": "It's relative is many people fail, and not relative otherwise"
    }
  ]
}