{
  "id": "yc911w",
  "title": "Bmsce AIML or Msrit AIML or Pes AIMl?",
  "content": "My quals- i got 4k rank and i have rural reservation. I'm interested in AI. And i need top 4 colleges only, and it's the only IT field course I'm getting now in all these 3 colleges. Please suggest me guys",
  "metadata": {
    "root_comment_id": "itl19o0",
    "post_id": "yc911w",
    "author": "vinay_yele",
    "url": "https://www.reddit.com/r/PESU/comments/yc911w/bmsce_aiml_or_msrit_aiml_or_pes_aiml/",
    "permalink": "https://reddit.com/r/PESU/comments/yc911w/bmsce_aiml_or_msrit_aiml_or_pes_aiml/",
    "score": 6,
    "upvote_ratio": 1,
    "created_utc": 1666611749,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "itl19o0",
      "body": "Cse in any of these if u can, else bmsce aiml(bmsce doesn't have such high intake as pes)\n└── I couldn't get such great rank. Only IT branch I'm getting dude.  I'm a bit interested in AI . Also i heard that bmsce hostel fees is huge. Can anyone share something on this?\n    └── Bms hostel fees are way lesser than pes, it's like 60-70k, while pes is  1lakh+, anyways congratulations all the best for your college..\n        ├── Ohh okay. Thank you\n        └── Are you in bmsce?\n            └── Nope waiting for last counseling\n                └── Ohh then are you sure with bmsce hostel fees?\n                    └── [here u go](https://collegedunia.com/college/5540-bms-college-of-engineering-bmsce-bangalore/hostel)\n                        ├── That is not true da. I asked one of my senior who is in bms but not in hostel , she said it's a quite expensive\n                        │   ├── Ohh then, i might be worth, do ask ur senior she will be able to help u properly without any false information. My bad\n                        │   │   └── It's expensive she said. She lives in nearby pg. 8k per month itseems.\n                        │   │       ├── Cool then, pes is around 1.2-1.5 as per my knowledge\n                        │   │       └── Bmsce hostel fee is 2lakhs lol\n                        │   │           └── Yeah now I'm afraid.\n                        │   └── PESU RR hostel costs 1.55 lakh per year (including a 30k refundable deposit). You can find cheaper PGs nearby .\n                        │       └── Is pg a good option?  It's almost like living in closed rooms. Hostel Life would be missed right?\n                        │           └── Surely , you will miss the hostel life (making friends is a lot easier in hostel) . Staying in pg saves your money and you have no restrictions like curfew , no wearing shorts etc.\n                        └── https://www.quora.com/Which-college-out-of-BMS-and-MSRIT-charges-more-fees-consider-hostel-fees-also-through-COMEDK/answer/Gururaj-Kammar-2?ch=10&oid=237532843&share=cadd766e&srid=TnyRF&target_type=answer"
    },
    {
      "id": "itlir54",
      "body": "Stick with core CS for now , you can choose your specialization later in 5th sem based on your interests then. Among your options , PESU has the best curriculum and placement stats but PESU is very hectic with more internals , projects , assignments etc. PESU is also very overcrowded.\n└── Ohh noted. Thanks\n    └── Don't go to PES , yes for sure you might get a decent placement but PES is tiring.\nJoin BMS , there you can chill and get grades and it also has decent placement\n        └── Yeah bro.. i need to enjoy my best 4 years of my life.. avg package is 10-11 in pes. Avg in bms is 9-10. Bms is close. Not too far away. So I'm going with bms ."
    }
  ]
}