{
  "id": "yi7pv2",
  "title": "I have heard that PESU is internationally recognized. What is the proof?",
  "content": "Just wanted to know from the seniors studying here. I plan to pursue my M. Tech abroad, so how will a degree from PESU affect my application?",
  "metadata": {
    "root_comment_id": "iuhe0ti",
    "post_id": "yi7pv2",
    "author": "SkywalkerPadawan512",
    "url": "https://www.reddit.com/r/PESU/comments/yi7pv2/i_have_heard_that_pesu_is_internationally/",
    "permalink": "https://reddit.com/r/PESU/comments/yi7pv2/i_have_heard_that_pesu_is_internationally/",
    "score": 9,
    "upvote_ratio": 1,
    "created_utc": 1667212530,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "iuhe0ti",
      "body": "Go through the profiles of seniors"
    },
    {
      "id": "iuhp5h3",
      "body": "Score above 8 CGPA you'll be good"
    },
    {
      "id": "iuhtory",
      "body": "My cousin is doing his masters from Carnegie Mellon University which is ranked third in the world in Computer Science. He advises me saying that there are a lot of students from PESU in his uni. Plus I have heard that PESU has a lot of connections with international unis and that helps students get into international master courses easily.\n├── Thanks for the info!\n└── There's a bunch of folk in MCDS and MISM. A much smaller group in the MSCS and MSML programs but they're certainly there."
    },
    {
      "id": "iuiox29",
      "body": "PESU has ties with certain foreign universities (in USA, UK, Germany) and the degree awarded conforms to ECTS requirements. Look at alumni profiles on LinkedIn and you'll find hundreds of them in top tier universities for their higher education. \n\nA degree from PESU will certainly hold more value considering the annually updated syllabus, in comparison to other colleges that have decades old course material. Add a specialisation (if applicable) to the degree and you're solid.\n└── Regarding ECTS, what would 100 credits as per PESU equate to under the ECTS system?"
    },
    {
      "id": "iulx1f6",
      "body": "Go to LinkedIn and look up the seniors from PESU, who've done masters abroad.. if you have any doubts about applications and stuff, you could try connecting with them and asking."
    },
    {
      "id": "iupf8p8",
      "body": "From my personal experience - It won't make much of an impact. Barring a few places like Stanford/Berkeley/MIT with very few/no MS seats, as long as your application is good you've got a fighting chance.\n\nLike others said, linkedin is a good place to check if you're interested in specific universities"
    }
  ]
}