{
  "id": "yky3e7",
  "title": "(PES RR campus AIML through PESSAT) OR (PES EC campus CSE through KCET)",
  "content": "PES RR campus AIML through PESSAT OR PES EC campus CSE through KCET, as you might know, it's 4.1L through PESSAT and about 1L through KCET  \nalso, I live about an hour away from EC\n\nno plans as such to do masters",
  "metadata": {
    "root_comment_id": "iuvkaxc",
    "post_id": "yky3e7",
    "author": "Ok-Adeptness7658",
    "url": "https://www.reddit.com/r/PESU/comments/yky3e7/pes_rr_campus_aiml_through_pessat_or_pes_ec/",
    "permalink": "https://reddit.com/r/PESU/comments/yky3e7/pes_rr_campus_aiml_through_pessat_or_pes_ec/",
    "score": 5,
    "upvote_ratio": 0.8600000143051147,
    "created_utc": 1667470043,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "iuvq0cq",
      "body": "Going by branch alone, choosing core CSE has more advantages than choosing AIML (or CSE+AIML, whatever PES offers.). RR campus has more opportunities when it comes to fests and clubs - there are multiple posts on this subreddit about the same, you can search for them. Faculty is kind of average at both campuses. EC has a better campus compared to RR and does not feel crowded.\n\nIf branch is the main thing for you, choose EC campus. If not then you'll need to weigh the factors and decide based on the ones that matter to you. My opinion is that you won't miss out on much if you pick EC.\n└── oh okay... ty for the points, ill think about it"
    },
    {
      "id": "iuvw1jw",
      "body": "Answered here: [https://www.reddit.com/r/PESU/comments/yker4v/comment/iuup8f5/?utm\\_source=share&utm\\_medium=web2x&context=3](https://www.reddit.com/r/PESU/comments/yker4v/comment/iuup8f5/?utm_source=share&utm_medium=web2x&context=3)  \n\n\nThis seems to be a rather popular query wow xD  \nBut this is also the prevailing opinion among just about every fourth year (my batch) and above I know, including those who actually do ML research\n└── yes but i didnt find this one specific scenario anywhere in the subreddit  \nappreciate it!\n    └── Yeah the only two \\_major\\_ disadvantages that come to mind with EC campus over RR are (a) you won't get to be on the organizing team for Aatmatrisha, which is the RR campus fest, and is usually bigger than Maaya, the EC campus one, and (b) sometimes, electives that you like can get cancelled because not enough people took them (this largely usually only happens to core systems electives like principles of programming languages, heterogeneous parallelism (this one was offered in RR but not in EC) or advanced computer networks though :/ everyone really likes AIML sighhhh)\n        └── oh okay... i have heard of (a) but (b), nope.. so thats definitely a new input for me, will keep it in my mind. thanks"
    },
    {
      "id": "iuwqgc2",
      "body": "I made a similar post here, go through the comments once\n\nhttps://www.reddit.com/r/PESU/comments/xn62uo/aiml_in_rr_campus_vs_cse_in_ec_campus/?utm_source=share&utm_medium=mweb\n└── sure!  \nnot sure how i missed that one out... anyways, i appreciate it"
    },
    {
      "id": "iv6yclv",
      "body": "Man this should be very obvious tbh, ur paying 25% the fees of pessat in kcet, and ec campus has a bigger campus area and more open space.\n\nI left core cse rr(pessat) for cse ec(in kcet ext 2nd round).\n\nOnly thing is that the exposure here is slightly less and clubs are more active in RR but, we(the seniors) are trying to develops the clubs in ec campus as well.\n└── thanks"
    }
  ]
}