{
  "id": "z02fmi",
  "title": "kcet round 2",
  "content": "what could be the expected kcet round 2 cutoff for pesu ring road cse?",
  "metadata": {
    "root_comment_id": "ix386vx",
    "post_id": "z02fmi",
    "author": "lostinthedark__",
    "url": "https://www.reddit.com/r/PESU/comments/z02fmi/kcet_round_2/",
    "permalink": "https://reddit.com/r/PESU/comments/z02fmi/kcet_round_2/",
    "score": 5,
    "upvote_ratio": 1,
    "created_utc": 1668945765,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "ix386vx",
      "body": "might go up to 1.5k for cse up to 2.5k for ai and 4 to 5k for ece\n\nbtw i got pesu eee in first round hoping for RVCE eie in 2nd\n├── eie? They don't have that there...\n│   └── no no RVCE eie my bad\n├── 1.5k? damn that's a huge increase\n│   └── He's just another student like you don't take his words that seriously. It definitely won't go to 1.5k in the second round. It might go past 1k only in the extended round. Though I do hope I'm wrong, cutoffs falling like that would be great.\n│       └── Yeah I'm sorry my bad\n│           └── It went to 1k lol, I think 1.1k or 1.2k max in the next round\n│               └── Yeah\n└── Bro I highly doubt 1.5k. Max it may go upto 900\n    ├── First round cut off was 787 so\n    └── Yeah even I feel 2nd round max 850-900, and might touch 1k in second extended round which would be a first. Cse/Ise in top colleges has never gone to 1k before in kcet or comedk, but in comedk even rvce ise went till 1.6k iirc.\n        └── Lmao rv cse this time closed around 3k msrit cs 7.7k thru comedk\n            ├── Wtf rv cse closed at 3k? How is that even possible\n            │   ├── Bro this year cutoffs have magically fallen real badly,  like BMS ECE used to close at 1.5k but this year it closed at 12k\n            │   │   └── damnn\n\nall engg colleges cutoffs dropped this year, even iits and bits\n            │   │       └── Bits have fallen like crazy like I can get mech in bits goa for 200 something marks with 160 u can get MSc bio\n            │   │           └── Yup, iiitH too went from 2k to 15k\n            │   │               └── Wtf 15k?\n            │   ├── RV cse was not at 3k it was at 1k something.\n            │   └── RV ece cutoff rank is 6.2k this year!!\n            │       └── Wtf💀💀💀 ig all the Indian parents are finally realising that they should stop forcing their children to do engineering\n            └── RV cse was not at 3k it was at 1k something. I think you've checked HK category cutoffs by mistake.\n                └── Maybe bro but I'm sure msrit aiml was 7.7k\n                    ├── Yeah I think that's correct. BMS cse was 3.3k, RV ise was 2k something... Last year all these used to be less than 1k.\n                    │   └── Yup next year too it's going fall in the same way cuz all colleges have increased intake like never\n                    └── My comedk rank was 7721 but I did not get aiml msrit\n                        └── 7339 was exactl cutoff just checked now\n                            └── What is ur comedk rank,jee rank??Waise toh I m from PESU EC campus\n                                └── 4k comedk , jee 75kish , what's urs ? I know too many people goin to pes ecity, like at least 50 in Ecity campus alone"
    },
    {
      "id": "ix3av5y",
      "body": "PES rr campus you can expect 900 max. Since all counseling is up. Nobody is gonna give up seat\n├── medico peeps might.. if they get smt good/worth in further rounds\n└── Kcet released the new seat matrix and people have still given up seats. Some 30 people gave up rvce cse in the GM category. But yeah only 0-2 seats given up in other categories."
    }
  ]
}