{
  "id": "z05ytq",
  "title": "When do we get our .edu email IDs??",
  "content": "So I was wondering when do we get our [pes.edu](https://pes.edu) emails. If we don't get it, can we use our Teams email IDs to get Office 365 for free? If yes, how?",
  "metadata": {
    "root_comment_id": "ix3rbjj",
    "post_id": "z05ytq",
    "author": "SilicoFlare",
    "url": "https://www.reddit.com/r/PESU/comments/z05ytq/when_do_we_get_our_edu_email_ids/",
    "permalink": "https://reddit.com/r/PESU/comments/z05ytq/when_do_we_get_our_edu_email_ids/",
    "score": 5,
    "upvote_ratio": 0.8600000143051147,
    "created_utc": 1668955794,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "ix3rbjj",
      "body": "Firstly, you will get a `pesu.pes.edu` (`pes.edu` is reserved for fests, faculty, departments etc)\n\nIf I remember correctly they are given for MATLAB (part of Math courses) now. Wait for a few weeks, they should give it out soon. Last time I checked the Teams IDs did have access to Office 365 as well as other subscriptions like GitHub pro. You might want to just wait until you get your `.edu` email though.\n├── Ohh okay, thanks! I tried using the Teams ID, didn't work..\n└── Question: I have my .edu email but while signing up for Jetbrains IDEs, they said that they'd sent a confirmation link to my email. Now how do I access my email? As in do I use the Outlook email app? What is the password of .edu emails?"
    },
    {
      "id": "ix3tt0p",
      "body": "They are given out 2nd year onwards by the department\n├── Oh okay\n└── Now they give it out in first year only\n    └── Hopefully I geddit soon!"
    },
    {
      "id": "ix4v4tn",
      "body": "We had to mail them and request for the pesu.edu id.... My ece friends got it from the department.\n└── I'll go and ask in the MRD block then\n    ├── You should ask in your department office.\n    └── what did they say??\n\n![gif](giphy|uKCrc7PFxJ9Xyya7DR)\n        └── Told that they have given our details to the IT people, and they will create the emails soon. I asked in S&H dept tho."
    },
    {
      "id": "kszz7sd",
      "body": "Do we lose access right after graduating?"
    }
  ]
}