{
  "id": "z0u39b",
  "title": "What are the rules for branch change after 1st year at PES University ? is it easy because of high intake for CSE related courses",
  "content": "I'm getting electrical at PESU, but I'm interested in CSE, so should i join in the hope of branch change after 1st year, please share some stats of previous years and your experience.",
  "metadata": {
    "root_comment_id": "ix7fnd9",
    "post_id": "z0u39b",
    "author": "Busy-Shallot3653",
    "url": "https://www.reddit.com/r/PESU/comments/z0u39b/what_are_the_rules_for_branch_change_after_1st/",
    "permalink": "https://reddit.com/r/PESU/comments/z0u39b/what_are_the_rules_for_branch_change_after_1st/",
    "score": 5,
    "upvote_ratio": 0.8600000143051147,
    "created_utc": 1669020970,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "ix7fnd9",
      "body": "Us bro\n└── but I spoke to a guy and he said you would need to maintain 9.5+ cgpa for cse and it also depends on vacancies"
    },
    {
      "id": "ix8arci",
      "body": "So although it is possible, branch change to CSE is extremely difficult because it depends on a lot of factors\n\n* Seats are limited - CSE seats only free up when people leave seats and every year there are only a handful (my batch had 3-4 changes only)\n* You need to be at the top of your batch to even be considered for branch change. Even if seats are available, CGPA plays a role in the priority order. Someone currently in mechanical with a better CGPA than someone in let's say someone in ECE will have more priority of changing branches.\n* If I remember correctly, changes from EC CSE to RR CSE are given more priority than complete branch changes. This will again put you at a disadvantage\n* You are competing with an insane number of people to shift branches since both campuses are considered (number of people across all branches and campuses with 9.5+ will be atleast 30 and available seats are handful), it does not really work out for almost everyone\n\nIf you join EEE with the intention of getting CSE in the second year I would suggest **don't**. I will not comment on whether you are capable of doing it, but chances are thinner than a hair.\n├── Thank you so much for your detailed explaination, What may be the GPA cutoff for EC Campus ECE to CS\n│   └── There is no \"cutoff\". As I said depends on your CGPA. People with a higher CGPA are higher priority.\n├── Is this also the case for AIML In RR?\n│   └── Mostly yes. All the points here will apply for any kind of branch change - limited seats, priority given to campus transfers, need to be a top performer. The only thing that will differ is that there will probably be a lower CGPA required to be at the top of the pile of people looking to get into AIML.\n│       └── oh okayy. but then someone here mentioned that the cutoff for last year was 8.5 for aiml and like around 7.8 for ece\n│           └── As I said - there will be a lower CGPA cutoff. The other factors will remain the same - it will depend on the availability of seats and preference will be on your GPA to switch branches.\n└── hey dude maybe you should consider changing the comment. \n\nthe change of branch is literally like any other seat allotment process. they show you the number of seats in each branch/campus. and instead of calling each person by rank, they call them by cgpa. then if someone takes a different course, there is an increment of 1 for his current branch. \n\nliterally like a second round of seat allotment. nothing about your branch or campus has nothing to do with it\n\n  \nand while rr cse is almost impossible to get, ec cse is very easily achievable \n\nhere are last year's cutoffs\n\ncs rr, 9.68\n\naiml rr, 8.2\n\ncs ec, 7.4\\\\\n\nto even apply for a branch change you need 6.75 minimum, so you can pretty much get anything else with a grade above that. maybe except ece at rr.\n    ├── Thanks. If you can, make a detailed comment the way I have (covering my points too) and I'll replace the link to your comment. \n\nOr else I'll update it over the weekend.\n    │   └── hey, can you go through my comment again. If it's good, then yeah. \n\notherwise like you said, maybe update your comment. \n\nthe main goal is to simply better inform both current first year students and also people looking to join PES and hoping for a branch change. not for them to have either very high or very low expectations, but just for them to know roughly what to expect\n    ├── when do you have to apply for branch change?\n    │   └── in the first or second week of second year, they will send a circular.\n\nand a new window for branch change will open in pesuacademy\n    │       └── If you do that in the first or second week of second year, will there not be issues? Like say someone from EC CSE or CSE AIML switches to RR CSE. If second year has already begun, won't that person have hostel issues since I am assuming they would have already enrolled in the EC hostel? Also, what if someone from non CS switches to CS? They would miss 1 or 2 weeks of courses, won't they?\n    │           └── you will miss the first few weeks. but hostel is mostly not an issue, they will internally transfer the feee\n    │               └── Thank you.\n    ├── Hello, I was not able to attend PES 1st round counselling. I want biotech and have 2k rank. What are the chances of me getting in second round counselling?? \nRight now there are 0 seats available\n    │   └── you have very good chances. but due to the low number of seats it is not assured\n\nfirst thing you have to make sure is that you actually knowwhat biotech is and future opportunities\n\nalso, why not try through kcet, the cutoffs should be very high and you can easily get in.\n    │       └── Yes i am very aware of the scope of biotech in india esp regarding placements but I'm still very passionate about it because it includes the subjects I genuinely love. I'm planning to go to america ( bay area mostly) for my masters. So yeah \nKcet well:) its saying qe marks withheld or failed. So we are going to office tomorrow, to see if it can be rectified. Hopefully yes cause many belonging to cbse have faced similar issues so let's see\n    └── Bro what's the cutoff cgpa last to join aiml in rr as I am an aiml student at ec campus"
    },
    {
      "id": "l6q72yw",
      "body": "If I join mechanical then how hard it'll be for me to change branch to biotechnology??"
    },
    {
      "id": "mci0jop",
      "body": "I have joined in ME 1st yr i want to change to EEE for 2nd year is it possible? If yes what what the last year's closing cgpa for EEE and what is the fee to be paid for branch upgradarion ??"
    }
  ]
}