{
  "id": "z3jzeq",
  "title": "what is the level of pessat compared to kcet??",
  "content": "",
  "metadata": {
    "root_comment_id": "ixm0ge6",
    "post_id": "z3jzeq",
    "author": "dyruscryptus",
    "url": "https://www.reddit.com/r/PESU/comments/z3jzeq/what_is_the_level_of_pessat_compared_to_kcet/",
    "permalink": "https://reddit.com/r/PESU/comments/z3jzeq/what_is_the_level_of_pessat_compared_to_kcet/",
    "score": 4,
    "upvote_ratio": 0.8299999833106995,
    "created_utc": 1669296542,
    "flair": "Ask a Senior :redditgold:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "ixm0ge6",
      "body": "Level is higher imo (there are some questions where you need to type the answer which I found annoying) but the competition is very less. It's easier to get a good rank in pessat."
    },
    {
      "id": "ixm0i62",
      "body": "gave both the exams. the difficulty is more of less the same. pessat includes pcm and english, while kcet includes 50 percent pcm and 50 percent board marks (though i don't know about kcet 2023 pattern). the difficulty level for both these exams are more or less the same (at least in my experience) but it's easier to get a good pessat rank than kcet rank due to the sheer number of people writing kcet. \n\nif you get a seat through pessat you'll have to pay 4 lakhs for a cse seat and through kcet it will be 91k (GM candidate). could've got a seat through pessat but as soon as i heard about the fee i dropped out of the counselling, i'd rather get my admission done via kcet\n├── same, my rank would have landed me in rr cse but the fees was too much\n└── Yeah pessat fees is not worth it unless you're getting absolutely nothing else in a decent college. Through kcet, the entire btech will be done in 3.7 lakhs. Pes takes 4.1 lakhs for just 1 year, despite not having a good campus, hostels or anything that matches the fees."
    },
    {
      "id": "ixm6miv",
      "body": "Wrote it in 2022. It totally depends on your shift to be honest. There were like approximately 13\\*2 to 15\\*2 shifts in 2022 and I know so many people who had gotten a really easy shift and thus, a really good PESSAT rank while their KCET rank was really high (numerically), in contrary to those who had gotten a harder shift and thus, a comparatively bad PESSAT rank but they were the same people with a really good KCET rank. So yeah, in general it's of a KCET-JEE Mains level but do expect a higher than or lower than expected difficulty. Pray for an easy shift :)\n\nSome might argue that it was CBT v/s pen and paper and thus the rank difference depending on what the student is good at. I agree with that to an extent but I do know peers who had >4.5K-5K KCET rank but still landed at PESU RR campus with CSE and it was not like there was a month of a gap for them to have prepared and gotten better at it. It was barely a week or two. At the same time, I go know people with 1.5K-4K KCET rank but still couldn't get <2000 in PESSAT.\n\nAll the best!"
    },
    {
      "id": "ixn53ds",
      "body": "Individually, the questions are between CET and JEE level, but considering that significantly fewer people write PESSAT, it becomes almost equivalent to CET"
    }
  ]
}