{
  "id": "z3kikc",
  "title": "Please help me out!",
  "content": "your opinions?\n\n[View Poll](https://www.reddit.com/poll/z3kikc)",
  "metadata": {
    "root_comment_id": "ixm4zgl",
    "post_id": "z3kikc",
    "author": "Ok-Adeptness7658",
    "url": "https://www.reddit.com/r/PESU/comments/z3kikc/please_help_me_out/",
    "permalink": "https://reddit.com/r/PESU/comments/z3kikc/please_help_me_out/",
    "score": 4,
    "upvote_ratio": 0.75,
    "created_utc": 1669297933,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "ixm4zgl",
      "body": "Both are quite far from eachother. I would take the near one. \n\nIf you want slightly better placements take pes since placements are pooled with the main campus. And it is always better to go for regular cse, you'll have more options to branch out into later.  \n\nIf you want better balance between studies and other activities, better campus and so on go for msrit. Also pes ec campus does not have anything near by to hang around. Msrit is better in that aspect as well.\n└── both of them are actually about the same (distance-wise) for me, msrit is about 5-10 minutes longer\n\nbut i heard that there'll be a metro near ec from next year?\n\noh, so msrit has a bad placement stat in comparison?\n    ├── Msrit isn't bad, it's just that pes is better in that aspect.\n    └── Yup Infosys metro station is 500m from campus. It'll be functional by next year"
    },
    {
      "id": "ixm83kv",
      "body": "Core CSE > CSE with any specialisation. It is very unlikely someone already is interested enough in this field to pursue this as their Bachelor's so stay away from it unless you have a very good idea on what it is about and whether you are interested. Placements wise as well, PES over MSRIT (Has been a long time since I checked, might want to reconfirm).  \n\nBut yeah, MSRIT will ensure your college life isn't filled with stress and workload. IMO pick PES. Career/Academic wise will be better in the long run."
    }
  ]
}