{
  "id": "z57hb2",
  "title": "Classes and sections",
  "content": "I have been added to the I section. Did people just get added to this section I or is it a completely new one? When it says I belong to the chemistry cycle, what does that mean? Are there any red flags about the S&H department? Help me comprehend this.",
  "metadata": {
    "root_comment_id": "ixuk438",
    "post_id": "z57hb2",
    "author": "BigManufacturer8779",
    "url": "https://i.redd.it/rtq96sfj8c2a1.jpg",
    "permalink": "https://reddit.com/r/PESU/comments/z57hb2/classes_and_sections/",
    "score": 14,
    "upvote_ratio": 1,
    "created_utc": 1669469023,
    "flair": "Study Help :table:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "ixuk438",
      "body": "Hello friend!\n\nFirst of all, a hearty welcome to PES ring road campus! Lemme answer all your queries.\n\n• Yes, you have been added to the already existing I section, and in RR campus, sections extend till T section. Many people are being added to each section depending on the cycle they are assigned, which brings us to the next question.\n\n• There are two cycles for first years so that workload can decrease. They are physics and chemistry cycle. Depending on the cycle, the subjects change.\n\n**Physics cycle**: Physics, Mechanical Engineering, Electrical engineering\n\n**Chemistry cycle**: Chemistry, Mechanics, Electronics\n\n• Idk if there are any red flags, tho i don't understand what exactly do you mean..\n\nIf you have any other queries, or you want any help in campus, just DM me or reply to this comment. All the best for a great life in PES!\n\n\nEdit: Looks like I, U and V have been added specifically for the 2nd round KCET students.."
    },
    {
      "id": "ixum72m",
      "body": "The other answer has made it clear... But lemme just add... First year is mixed for everyone... From the second year u will be entering ur respective branches... Afaik, s&h department refers to the science and Humanities department... And everyone irrespective of their branches come under the department for the first year... From the second year u guys will be under ur respective departments. There r no specific red flags coz tbh it doesn't really matter."
    },
    {
      "id": "ixuswcc",
      "body": "Fam did you join in second round. If you do then. Just so you know. All of us have completed unit 1. So they will be starting your classes from unit 2. I am guessing you guys re pretty much fked. Cause you wont be thought unit 1 again\n├── When you open pesuacademy website, before you login you can see a button that says’ know your class and section’\nClick on it\n\nEnter your SRN and you’ll get those details\n└── No, they'll cover unit 1\nThey covered everything last year too, albeit much much unevenly\n    └── I mean if they keep a new class for you it makes sense. But if they are combining you with same old class revising unit 1 doesn't make sense\n        └── They won't combine you guys with the same old class, new students will be in new classes\n            └── It says i section and I section started 3 weeks ago\n                └── Oh then idk, I still have my doubts"
    },
    {
      "id": "ixv8htz",
      "body": "From where did u get to know about this ? Like ur cycle ? Like i know I’m from section 1 but I don’t know which cycle\n└── Section 1 or I ?\n    └── Oh sry it’s section I"
    }
  ]
}