{
  "id": "z5c7vg",
  "title": "RR Campus CSE (PESSAT) vs EC Campus CSE (CET)",
  "content": "Do the two campuses vary greatly in terms of infrastructure, placements, transportation, or anything else? \n\nI'm looking at a potential swap to EC Campus through CET and would love the seniors to give me some insight into whether there's a significant difference in the two campuses.",
  "metadata": {
    "root_comment_id": "ixvevbw",
    "post_id": "z5c7vg",
    "author": "BLITZ_275",
    "url": "https://www.reddit.com/r/PESU/comments/z5c7vg/rr_campus_cse_pessat_vs_ec_campus_cse_cet/",
    "permalink": "https://reddit.com/r/PESU/comments/z5c7vg/rr_campus_cse_pessat_vs_ec_campus_cse_cet/",
    "score": 5,
    "upvote_ratio": 1,
    "created_utc": 1669482006,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "ixvevbw",
      "body": "You'll be saving up a lot if you take up the EC campus seat. Placements wise it won't really make a difference since they're combined anyway. Your degree will be the same.\n\nThe club culture at EC campus is not as great as RR (atleast during my time). RR also has better research clubs last time I checked and hence has more opportunities as well. Back during my days, EC campus kids weren't allowed to be part of these research clubs so you might want to check that. Fests are also larger at RR so you get to be part of something bigger and better. These fests are also exclusively organised by RR campus kids so you'll miss out on that. It essentially is a more \"happening\" campus than EC.\n\nTransport is something that will depend on where you live/travel from. RR campus has really good metro connectivity although it's pretty much outside the main city. EC campus last time I checked still has an incomplete metro line (although I've heard that it'll come up by end of next year?). People also don't really like the EC campus location much because it's too isolated without any proper means of connectivity. \n\nThat being said, EC campus however is prettier, is more open and spacious and you're never going to feel crowded. I've been there a couple of times for different events and every single time it just feels like a more natural campus. RR on the other hand is a concrete jungle, with old buildings and spaces being constantly removed for newer blocks. EC campus also does have its fair bit of construction, but the large campus and open areas don't really cause that much of an issue IMO.\n\nI think I've listed most of the differences. I'd suggest making a decision based on your mode of transport and the type of opportunities you are expecting your college life to have. If money is a major factor, then definitely pick EC campus. In the long run your degree and placements will be the same. However if you want a slightly more active college life to relax yourself a bit in the already stressful enviornment, then pick RR.\n└── As for club culture, EC Campus is not as frequent with events as the RR Campus however club culture wise, we are definitely equal to RRC.\n\nSure, Maaya was not as big as Aatmatrisha but the reviews were honestly MUCH MUCH better than  AT'2020 even thought Maaya was operating on a shoestring budget from what i hear.\n\nAlso RR legit feels like a suffocating factory whereas ECC is much more spacious and green.\n\nThe only problem with ECC is the logistics and the location. But that too depends on the person.\n\nCourse Content wise, its all set same so we all are equally fucked."
    },
    {
      "id": "ixxld5t",
      "body": "Ec cse any day of the week. You'll be saving 3 lakhs a year and you'll get a better campus and equal placements. The only thing is that there are relatively lesser number of events.\n└── Ec campus students can attend the events that happen in rr right?\n    └── Yup ec students can attend all major events happening in rr too."
    },
    {
      "id": "ixy6fu9",
      "body": "Blindly take ec campus through cet, pessat fees is not worth it."
    }
  ]
}