{
  "id": "z62i0w",
  "title": "What exactly is CSE(AIML/IOT/CYBERSECURITY/AIDS) in VTU-affiliated autonomous colleges?",
  "content": "Hello, I was wondering what degree appears on the certificate when you take up BMS/RVCE/MSRIT 's B.E. in CSE(AIML/IOT/CYBERSECURITY/AIDS) course. Is it just like PESU where they give you a CSE major and AIML/AIDS/CY/IOT minors or is it a certificate that has a degree whose full name itself is CSE(specialization)?  \n\n\n(I read posts about PESU giving CSE major and AIML as minor but it's their own university, so please don't tell me about their degree on the certificate as I'm already aware.)",
  "metadata": {
    "root_comment_id": "ixz6irc",
    "post_id": "z62i0w",
    "author": "Grouchy-Air-8627",
    "url": "https://www.reddit.com/r/PESU/comments/z62i0w/what_exactly_is_cseaimliotcybersecurityaids_in/",
    "permalink": "https://reddit.com/r/PESU/comments/z62i0w/what_exactly_is_cseaimliotcybersecurityaids_in/",
    "score": 5,
    "upvote_ratio": 0.8600000143051147,
    "created_utc": 1669559191,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "ixz6irc",
      "body": "> Is it just like PESU where they give you a CSE major and AIML/AIDS/CY/IOT minors\n\nCorrection: PESU gives you a degree which says CSE and a certificate which contains the specialisation name. **Specialisation is not a Minor**. The certificate only mentions that X has obtained Y specialisation throughout their BTech.\n\nThere is a big difference between a Minor and a specialisation here at PES. A Minor requires you to take up multiple courses in another branch and also requires you to pay a hefty amount for it. You need to take up this *alongside* your current degree. A specialisation on the other hand is often part of your degree (so no extra cost) and is based on elective choices made by you.\n\nAs for your original question, as far as I know, it is the same. Degree and a separate specialisation certificate."
    }
  ]
}