{
  "id": "zar23k",
  "title": "Did you become successful without a mentor? (college student asking for guidance)",
  "content": "",
  "metadata": {
    "root_comment_id": "iynkeh2",
    "post_id": "zar23k",
    "author": "reddittimewaster3",
    "url": "/r/Indian_Academia/comments/zaqjp1/did_you_become_successful_without_a_mentor/",
    "permalink": "https://reddit.com/r/PESU/comments/zar23k/did_you_become_successful_without_a_mentor/",
    "score": 5,
    "upvote_ratio": 1,
    "created_utc": 1669999906,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "iynkeh2",
      "body": "What's the criteria for Mentor, a professor or like a friend or anyone?\n└── Anyone who genuinely helps you for a long period of time. Not really every teacher, but some of the genuine ones who cared specifically about you, and gave you specific advice.\n    └── Got it\n\nThere are 2 ways to answer this\n\n1) Do you need a mentor? Nope I don't think success can be achieved only when a mentor helps you along\n2) Do you always find a mentor? Yup Humans inherently will always look up to someone or meet someone who will inspire them.\n\nSomething that is cool is that even objects and non-humans can be mentors. A piece of writing or like a poem, have actually helped people to rise up and gain success\n\nSo yeah like every \"hypothetical question\" the answer can be a Yes or No xD"
    },
    {
      "id": "iypk9q9",
      "body": "It depends on the kind of mentor as well. I know some professors who have mentored students who have gone on to achieve laurels. At the same time there are some professors who aren't good mentors at all and are mentoring just for the sake of it."
    },
    {
      "id": "iypnv0h",
      "body": " Yes, you can be successful without a mentor too, but its bit more difficult, just like walking to your destination rather than cycling there. A good mentor will guide you in all aspects and make everything easier. \n\nYou can find seniors as mentors through college clubs, groups and mutual friends. :)"
    },
    {
      "id": "iypo579",
      "body": "The mentor or guidance that you would need to be successful doesn't necessarily need to be a fixed someone. Usually, it is something that is already close to you in your daily life."
    },
    {
      "id": "iyqtett",
      "body": "Define success\n└── Reaching the goal"
    }
  ]
}