{
  "id": "zc0wre",
  "title": "PESU not complying to UGC 2022 refund guidelines",
  "content": "The 2022 UGC guidelines state that on cancellation/withdrawal of admissions up to 31st December 2022, the entire fee collected from a student should be refunded in full after deducting not more than Rs1000 as processing fee. But PESU management is telling students that these guidelines do not apply to PESU and hence they will only refund fees of students who have withdrawn their admission before 2nd November. They are also informally threatening that students who cancelled their seats before 2nd November were made to pay Rs2000 for each day since they too admission, which means students who took admission 60 days before withdrawing have to pay Rs120000.\n\nWhy is PESU exempted from UGC guidelines that are applicable to all other universities? They are scaring students into not surrendering their seats due to fear of losing more than Rs 4 Lakhs if they joined through PESSAT.\n\nAny other students facing this problem?",
  "metadata": {
    "root_comment_id": "iyu9d15",
    "post_id": "zc0wre",
    "author": "Repulsive_Acadia8557",
    "url": "https://www.reddit.com/r/PESU/comments/zc0wre/pesu_not_complying_to_ugc_2022_refund_guidelines/",
    "permalink": "https://reddit.com/r/PESU/comments/zc0wre/pesu_not_complying_to_ugc_2022_refund_guidelines/",
    "score": 12,
    "upvote_ratio": 1,
    "created_utc": 1670129796,
    "flair": "Rant :snoo_facepalm:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "iyu9d15",
      "body": ">took admission 60 days before withdrawing have to pay Rs~~60000,~~  Rs 1,20,000 + some other fees will be taken..\n\nIts terrible to lose 4lkh.. Even I didnt want to surrender due to this very reason.\n\nI would hve got cse in other clg thru kcet, my fees would have been so much less.\n\nIf you know any lawyer.. try reaching out to them"
    },
    {
      "id": "iyu9uxm",
      "body": "The UGC Fee Refund policy 2022-2023 is published at [https://www.ugc.ac.in/pdfnews/3132446\\_Letter-reg-Fee-refund-Policy.pdf](https://www.ugc.ac.in/pdfnews/3132446_Letter-reg-Fee-refund-Policy.pdf)\n\nThe PES Fees Refund policy simply says that - Any refund here will be done as per current UGC refund norms only.\n\nBut this is not what they are saying to students who want to surrender seats after December 1st. Does anyone have more details?  Any suggestions on how we can get a full refund of PESSAT fees if we surrender the seat in December."
    },
    {
      "id": "iyuaepe",
      "body": "Probably one of your first ever experiences with PES not complying with UGC, but this unfortunately has become fairly common. Especially during COVID times when the University went out of its way to do things and gave 0 shits about the UGC. PES guidelines are their own, we've seen the University not follow UGC or sometimes even the state's guidelines sometimes, almost as if the University is an independent body.\n\nUnfortunately I don't really have anything else to contribute here. Maybe go to the University with physical proof about the refund guideline, ask for someone in the higher management. If that fails, maybe take it up on some social media like Twitter and tag people who can help. You should maybe also post on r/LegalAdviceIndia and see what lawyers have to say."
    },
    {
      "id": "iyvnosg",
      "body": "Raise a grievance complain on the UGC website. Tweet about it and also seek legal help\n\nAlso make sure to put the same story on Quora so that others dont get scammed because Quora is the first place people check."
    },
    {
      "id": "iyw4zu7",
      "body": "Fight this in Court against Money Minded PES. They will be forced to follow UGC Guidelines."
    },
    {
      "id": "j162ed9",
      "body": "My college (SXC-Kol) has been very honest with UGC guidelines... People who are cancelling admission even now (as of Dec 22) are still getting refund despite having attended classes for like 3 months now. I cancelled my admission back in November and got refund as per the policy... Only ₹1000 was deducted as processing charge.\n\nOfcourse, you won't get back accomodation or hostel fees (if any) cuz it's not mentioned in the guidelines."
    }
  ]
}