{
  "id": "zc2ee7",
  "title": "Confused between Computer Science Engineering in RVCE, MIT",
  "content": "",
  "metadata": {
    "root_comment_id": "iyuuslz",
    "post_id": "zc2ee7",
    "author": "DesperateAct6771",
    "url": "/r/Btechtards/comments/zc2clj/confused_between_computer_science_engineering_in/",
    "permalink": "https://reddit.com/r/PESU/comments/zc2ee7/confused_between_computer_science_engineering_in/",
    "score": 0,
    "upvote_ratio": 0.5,
    "created_utc": 1670134686,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "iyuuslz",
      "body": "this is a pes subreddit btw\n└── Exactly! I have seen so many posts like these that i really don't know what to do outta them"
    },
    {
      "id": "iyv7a8i",
      "body": "Just to clarify, I am already in CSE MIT Manipal. I have got CSE PES in KCET 2nd extended round and am sure to get CSE RVCE in the next KCET round. Manipal has been quite good so far, but I wonder whether RVCE or PESU would be better in terms of overall development from a personality and career perspective. Like I said before money is not at all an issue for me.\n\nReally appreciate all your comments, I am finding it quite hard to decide whether CSE RVCE/PESU or MIT would be better for me. Your views on things that matter to me would be most useful in helping me decide:- knowledge and approachable faculty who will help build strong academic fundamentals, chilled out future friends-for-life with wider interests than just studies, brand name amongst US universities and at companies like Google, Apple, Microsoft, etc., internship opportunities, programming culture, extra-curricular activities that allow opportunities for soft-skills and leadership development, helpful alumni network, etc.\n├── 2nd extended ke baad bhi aur ek round ?\n├── RVCE>MIT>>PES RR>BMS & MSRIT>>>>>>>>>>>>>>>>PES EC\n└── I am warning u not to go for Mopup/Casual Vacancy round as it is very risky as u have to give up ur seats. All the CS seats in these top 5 colleges get filled up in 2nd Extended Round itself so none will be left for mopup Round. DONT go beyond 2nd Extended Round!"
    },
    {
      "id": "iyz7cmp",
      "body": "I think Casual round is only for those who didn't get any seat in previous rounds. If one already got a seat in extended 2nd round it seems one isnt qualified for the casual round. If you didn't join college or didn't cancel your kcet seat, you are liable to pay 5 times the fee amount as per kea home notification. As per latest instructions on kea home page, there is still time to cancel you kcet seat without fine. Better check and do the needful quickly if you don't want to loose money."
    }
  ]
}