{
  "id": "zey2tb",
  "title": "I have decided to surrender my KCET seat ( eee branch) to kea and leave this college which feels like coaching institute. I have attended for only 10 days? Will college ask for extra fee or anyone who knows anything abt this. please help",
  "content": "",
  "metadata": {
    "root_comment_id": "iz95joj",
    "post_id": "zey2tb",
    "author": "JustPerspective1101",
    "url": "https://www.reddit.com/r/PESU/comments/zey2tb/i_have_decided_to_surrender_my_kcet_seat_eee/",
    "permalink": "https://reddit.com/r/PESU/comments/zey2tb/i_have_decided_to_surrender_my_kcet_seat_eee/",
    "score": 13,
    "upvote_ratio": 0.8399999737739563,
    "created_utc": 1670409914,
    "flair": "Study Help :table:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "iz9e6cw",
      "body": "Dude but which college will you join now, aren't all counselings over? I'm pretty sure you'll get used to the schedule, don't take a big decision like this after just 10 days of attending. Every college in India is more or less like a coaching institute tbh.\n\nI left PES (by giving up my PESSAT seat) and had to pay 2k for every day attended. Maybe for KCET too they have something like this, your best bet is to call the management. But imo if you don't have a better/equal option don't leave.\n└── Why did you leave..if you don't mind answering.\n    └── I had got a similar college through kcet. Also I felt pes was too study focused and it was like I was in school again. I've always done better whenever I've learnt stuff on my own, compared to being made to study.\n        └── Which college did you opt for?"
    },
    {
      "id": "iz9f7qe",
      "body": "10 days? Wow, that was fast. IMO you are too late, all counselling for all colleges are done and you won't be able to get anything this year. Wrong choice to make now\n\nAnswering your question - yes, there is a certain amount that is to be paid for essentially dropping the degree. It will be different now (and a larger amount if I remember correctly) because counseling is all over, so any seat given up now is actually a heavier loss on the college. If you drop out now you will be charged a pretty hefty fee.\n\nThis is from what I had heard when someone in my batch (2022) had dropped out after the first year. Things may or may not be different now, best is to call and ask. Regardless, good luck OP"
    },
    {
      "id": "iz9h8s2",
      "body": "The kea home page has some information on kcet seat cancellation without fine. You may want to check it. Suggest to call kea and also talk to pes admin. Do ask them if you are eligible for mop up round if you surrender the seat. If you surrender seat but can't participate in mop up round, then you may have to loose a year. Do talk to kea and pes immediately to understand this properly.  \n\nIf i understand correctly (i may be wrong too), the casual round is only for those who didn't get any seat so far in the previous rounds..those who already got a seat in previous rounds can't participate.. please reconfirm this with kea."
    },
    {
      "id": "iz9mwc9",
      "body": "why does it feel like a coaching institute to you\n└── Every teacher just keeps saying \"this will come in ISA\" or \"that will come in ESA\", they don't try and make anything interesting apart from few good ones. There are so many tests and assignments per sem compared to other colleges. Just like how coaching institutes kept having loads of tests, over here the goal of getting an IIT is replaced with getting a good placement, that's all. A college should be more than that."
    },
    {
      "id": "iz9xu2y",
      "body": "😂realized it huh? But from what I know u won't get ur full amount refunded back... They take a large amount for what u have attended, Even if it is in contradiction to ugc guidelines regarding seat surrender.... Check the other posts here. I remember people having the same issues.. So maybe talk to them directly."
    },
    {
      "id": "izdgtro",
      "body": "You've made a wise decision, this college is not worth it with the 5 ISA system in place you can barely learn anything on your own forget about hobbies or sports."
    }
  ]
}