{
  "id": "zf18b3",
  "title": "rvce ise/cse specialisations or pes rr cse ?",
  "content": "[deleted]",
  "metadata": {
    "root_comment_id": "iz9ip6b",
    "post_id": "zf18b3",
    "author": "[deleted]",
    "url": "",
    "permalink": "https://reddit.com/r/PESU/comments/zf18b3/rvce_isecse_specialisations_or_pes_rr_cse/",
    "score": 1,
    "upvote_ratio": 0.6700000166893005,
    "created_utc": 1670419955,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "iz9ip6b",
      "body": "Rvce ise then pes rr then rvce comp specialisation\nIse is old and established while all other are new\nRest depends on you"
    },
    {
      "id": "iz9rqgo",
      "body": "As someone from neither pes nor rv, I think anything cs related in rv is better than pes cse. \n\nIf you want to look at placements, it will be much better than pes and btech is not enough to specialise in whatever your \"specialisation\" is. One major point people will tell you is that it's not good to specialise in anything in btech. But if you look at the course in colleges that have had these branches for some years now , there are just minor differences between cse and the rest that too in the last 3/4 sems only. It's not like if you take \"cse with specialization in xyz\" you're cursed to work on xyz only for the rest of your life. Pes is not pesit anymore, it has become extremely crowded, has way more students than rv which makes it needlessly competitive. Also lots of good profs in pes had left, don't know if they've come back.\n\nFrom masters POV, branch again doesn't matter as long as it's a 4 year course. Projects need to be good and publishing papers is a plus, you'll probably have more time to work on these in rv than in pes which I've heard gives students an absurd number of assignments and tests.\n\nHowever if you're getting both through kcet you can't go wrong with any of them. If you're scared to take these new branches, put rv ise > pes cse > rv specialisations.\n\nAll the best!\n└── Well, rv will also start taking more number of students and make it needlessly competitive too in a few years, but right now its not a ratrace like pesu\n    └── It's still not as much as pes. Also remember that pes rr campus people will be competing with ec campus as well, some 720 more students in cse there. In rv there's no pooled placements.\n        └── Rvce is also competibg with its other variants too\n            └── No placements are not pooled with those\n                └── 🤔. I meant rvu.\n                    └── Yeah, RVU is completely separate from RVCE."
    },
    {
      "id": "izafi2s",
      "body": "Rvce without hesitation."
    }
  ]
}