{
  "id": "zj41u1",
  "title": "2023 PESSAT aspirant here. Me and a lot of students would be very grateful if y'all could tell estimated last round cut off for CSE AND AIML at both the campuses respectively and what would be the impact of increased seats in future cut off.",
  "content": "",
  "metadata": {
    "root_comment_id": "izthotm",
    "post_id": "zj41u1",
    "author": "HomeImpressive7552",
    "url": "https://www.reddit.com/r/PESU/comments/zj41u1/2023_pessat_aspirant_here_me_and_a_lot_of/",
    "permalink": "https://reddit.com/r/PESU/comments/zj41u1/2023_pessat_aspirant_here_me_and_a_lot_of/",
    "score": 10,
    "upvote_ratio": 0.9200000166893005,
    "created_utc": 1670785193,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "izthotm",
      "body": "the online bar just pumped at 12:30 am after i posted the question\n└── but no one answered :')\n    └── Why do you even wanna be a part of this college ???\n\nCame through PESSAT 22' CSE RR. There's still time for KCET/COMEDK go to BMS MSRIT RV and all. Paying such a hefty fee for such a college isn't worth it imo. There's a lot of intake, lots of tests, lots of competition."
    },
    {
      "id": "izttdkp",
      "body": "Bro next year pes is gonna cost 18L is tution alone and add to that 1.5L hostel per year , it would roughly cost u 25L ,so it's better if you aim for jee you'll get something lower like at least Msr or bms thru comedk\n└── Is msrit/bms better than pes?\n    └── I would say they're more or less the same. Pes has slightly better placements. The only college I would say is better than pes in every aspect is RVCE.\n        ├── And how is rvce compared to other states?\n        │   └── I'm not sure, I'm talking about kcet colleges only\n        │       └── Ohhk thanks though\nIs the placements similar between pes and rv or is there a drastic difference?\n        │           └── I think they are much better than in pes. And the quality of teaching there is also better. Pes is actually deteriorating, many good profs have left.\n        │               └── Got it, thanks for the insight, did you join pes?\n        │                   └── I had... I dmed you some days ago lol\n        │                       └── Ohh damn, totally forgot😅\n        └── In terms of overall things it is better , like it depends , I did the mistake of leaving msrit for manipal, I was sure to take manipal over pes but not over msrit,  infact I had done a poll on this sub reddit itself where majority voted for joining manipal over pes\n            └── Isn't manipal good as well?\n                └── It's better than pes and all because of small batch size , but it's just that I miss bangalore(homesickness) or else it's awesome considering the alumini,placements,infra and all"
    },
    {
      "id": "izuzeod",
      "body": "Don't be a \"pessat aspirant\". Prepare keeping jee and bitsat in mind. If that doesn't go well, kcet, comedk and pessat, etc are your backups. \n\nComing to your question, unless pes introduces new branches or increases intake there won't be a difference between this times and next year's cutoffs. Cse rr went to 1.2k I guess, aiml rr 2k something and cse ec at 3-4k is what I remember.\n└── A big Thank You!"
    },
    {
      "id": "izv3knu",
      "body": "Pes is not worth it unless you got a CET seat.\n└── What do you mean by that..could you please elaborate?\n    └── There are two main ways to get into pes, either by writing kcet or pessat exams. It's easier to get in via pessat, but the fees is way higher. I think he means it's not worth paying as much as pessat fees(3-4 lakh per year) , whereas in kcet it's just 90k per year.\n        └── Damn thanks dude"
    },
    {
      "id": "izvk3c4",
      "body": "The way the new VC is destroying the college through ruthless means , increasing seats every year , teachers leaving every year , unbelievable hikes in pessat fees , I see PES go towards a steep dive in the coming years . I would not recommend to join pes through pessat , if you can get through kcet it would still be fine(you will have better options ). \nYou still have a year left ,start prep for kcet/comedk/jee and join any other college please\n└── It's becoming like vit , I'm in manipal most of friends had pes cs as option left it because it's becoming a really weird place,  ik a few who left it for msr bms too"
    },
    {
      "id": "izvx165",
      "body": "M in the 4th year now... Not a day goes by when I don't regret joining here... When I could have easily gone to other colleges with my rank... Mind u I came via cet even... Pessat is not at all worth... Don't be a pessat \"aspirant\".\n└── I'm sure rv, bms and msrit have their share of problems as well\n    └── I mean yes... To be fair every college has its own issues... But the problems here are much more. This is just my opinion tho from having heard from friends in those colleges too."
    },
    {
      "id": "izvyuut",
      "body": "Lmao he aspires to come to PES"
    },
    {
      "id": "j06ci44",
      "body": "Honestly, just focus on JEE Mains or CET, never be a PESSAT \"aspirant\", because the fees is literally too high, and it is highly recommended to enter PESU through a CET quota."
    }
  ]
}