{
  "id": "zuabmf",
  "title": "is it a scam?",
  "content": "1st year students got a webinar invitation link from coincent. During the session they asked to submit emails and mobile numbers for registration in their courses.",
  "metadata": {
    "root_comment_id": "j1huhrj",
    "post_id": "zuabmf",
    "author": "Rakesh-patil",
    "url": "https://www.reddit.com/r/PESU/comments/zuabmf/is_it_a_scam/",
    "permalink": "https://reddit.com/r/PESU/comments/zuabmf/is_it_a_scam/",
    "score": 6,
    "upvote_ratio": 0.8799999952316284,
    "created_utc": 1671890202,
    "flair": "Discussion :snoo_shrug:",
    "nsfw": false
  },
  "comments": [
    {
      "id": "j1huhrj",
      "body": "Btw I forgot to mention this was an unofficial link"
    },
    {
      "id": "j1hywsd",
      "body": "Ig it’s something wrong because there is no info from clg side at least they would have mailed us abt it"
    },
    {
      "id": "j1i0j2o",
      "body": "Most likely a scam.. I joined the meeting late.. then tht lady was telling us to fill sm form.. everything seemed legit until she asked us to make payment of just 1k \\*sarcastic tone\\*\n\nCmon man, coursera/MIT openlearning / udemy etc carry more value."
    },
    {
      "id": "j1i1xja",
      "body": "If they ask you to pay at any point, it's a scam"
    },
    {
      "id": "j1isol5",
      "body": "This is why I should check Reddit before making choices…I’m about to send a mildly strongly worded email to them"
    },
    {
      "id": "j1krr7c",
      "body": "It was really sketchy with the way she was making us fill the forms and pay money."
    },
    {
      "id": "j1l1atk",
      "body": "if it isn't a direct and official communication from college (or at least initiated by the college) then assume it isn't legitimate. Also if they're asking you to pay that further lends to the illegitimacy of the whole thing."
    },
    {
      "id": "j28na4q",
      "body": "After filling the form and all they seem to tell us to pay more 3 k before the starting of the classes \nIs it really fake because they told that they will be giving certificates alsooo"
    },
    {
      "id": "jvvnkb1",
      "body": "it is absolutely FAKE. they are telling us some big stuff, like they're affiliated with microsoft and that they'll give us an internship guaranteed, but first years have to pay almost 4k, 4 years in advance?? i paid 1k ,but when the rest 2.5k came up, i realised this was a pyramid scheme. the lady was telling me to share it with my other friends and for me to send her their phone numbers.\n\nSTAY AWAY. get an internship in your 3rd or 4th year. learn coding and all this stuff on your for free on youtube or khanacademy. this is NOT AT ALL WORTH IT.\n└── p.s. if you go and look up \"reviews\" on places like quora or linkdin, it's very recent and some are posted on the very same day. be careful y'all, always go for the real verified stuff or ask your college professors for more insite.\n    └── Thanks, finally got to know... Freshers should be informed about these kind of things"
    }
  ]
}